[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T23:35:30.013312+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T22:34:00+00:00",
        "description": "A CRISPR-based drug given to study participants by infusion is raising hopes for a much easier way to lower cholesterol, reports CNN:\n\n\n\nWith a snip of a gene, doctors may one day permanently lower dangerously high cholesterol, possibly removing the need for medication, according to a new pilot study published Saturday in the New England Journal of Medicine. \n\n\nThe study was extremely small &mdash; only 15 patients with severe disease &mdash; and was meant to test the safety of a new medication delivered by CRISPR-Cas9, a biological sort of scissor which cuts a targeted gene to modify or turn it on or off. Preliminary results, however, showed nearly a 50% reduction in low-density lipoprotein, or LDL, the \"bad\" cholesterol which plays a major role in heart disease &mdash; the No.1 killer of adults in the United States and worldwide. The study, which will be presented Saturday at the American Heart Association Scientific Sessions in New Orleans, also found an average 55% reduction in tr",
        "id": 4020814,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/08/2021211/scientists-edit-gene-in-15-patients-that-may-permanently-reduce-high-cholesterol",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Edit Gene in 15 Patients That May Permanently Reduce High Cholesterol",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T22:33:50.256892+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T21:34:00+00:00",
        "description": "A former Business Analyst reportedly filed a class action lawsuit claiming that for years, hundreds of remote employees at Bank of America first had to boot up complex computer systems before their paid work began, reports Human Resources Director magazine:\n\nTava Martin, who worked both remotely and at the company's Jacksonville facility, says the financial institution required her and fellow hourly workers to log into multiple security systems, download spreadsheets, and connect to virtual private networks &mdash; all before the clock started ticking on their workday. The process wasn't quick. According to the filing in the United States District Court for the Western District of North Carolina, employees needed 15 to 30 minutes each morning just to get their systems running. When technical problems occurred, it took even longer... \n\nWorkers turned on their computers, waited for Windows to load, grabbed their cell phones to request a security token for the company's VPN, waited for t",
        "id": 4020569,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/08/0836254/bank-of-america-faces-lawsuit-over-alleged-unpaid-time-for-windows-bootup-logins-and-security-token-requests",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bank of America Faces Lawsuit Over Alleged Unpaid Time for Windows Bootup, Logins, and Security Token Requests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T21:33:23.269285+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T20:34:00+00:00",
        "description": "The Associated Press reports that \"For the past decade, Dr. Priscilla Chan and her husband Mark Zuckerberg have focused part of their philanthropy on a lofty goal &mdash; 'to cure, prevent or manage all disease' &mdash; if not in their lifetime, then in their children's.\" \n\nDuring that decade they also funded other initiatives (including underprivileged schools and immigration reform), according to the article. But there's a change coming:\n\n\n\nNow, the billionaire couple is shifting the bulk of their philanthropic resources to Biohub, the pair's science organization, and focusing on using artificial intelligence to accelerate scientific discovery. The idea is to develop virtual, AI-based cell models to understand how they work in the human body, study inflammation and use AI to \"harness the immune system\" for disease detection, prevention and treatment. \"I feel like the science work that we've done, the Biohub model in particular, has been the most impactful thing that we have done. So",
        "id": 4020275,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/08/0735217/chan-zuckerberg-initiative-shifts-bulk-of-philanthropy-going-all-in-on-ai-powered-biology",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chan Zuckerberg Initiative Shifts Bulk of Philanthropy, 'Going All In on AI-Powered Biology'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T20:32:49.685866+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T19:34:00+00:00",
        "description": "Long-time Slashdot reader AmiMoJo shared this report from Marine Insight:\n\nThe world's largest cargo sailboat, Neoliner Origin, completed its first transatlantic voyage on 30 October despite damage to one of its sails during the journey. The 136-metre-long vessel had to rely partly on its auxiliary motor and its remaining sail after the aft sail was damaged in a storm shortly after departure... Neoline, the company behind the project, said the damage reduced the vessel's ability to perform fully on wind power... \n\nThe Neoliner Origin is designed to reduce greenhouse gas emissions by 80 to 90 percent compared to conventional diesel-powered cargo ships. According to the United Nations Conference on Trade and Development (UNCTAD), global shipping produces about 3 percent of worldwide greenhouse gas emissions... \n\nThe ship can carry up to 5,300 tonnes of cargo, including containers, vehicles, machinery, and specialised goods. It arrived in Baltimore carrying Renault vehicles, French lique",
        "id": 4019971,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/08/1759258/worlds-largest-cargo-sailboat-completes-historic-first-atlantic-crossing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World's Largest Cargo Sailboat Completes Historic First Atlantic Crossing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T19:31:03.560768+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T18:34:00+00:00",
        "description": "\"Internal documents have revealed that Meta has projected it earns billions from ignoring scam ads that its platforms then targeted to users most likely to click on them,\" writes Ars Technica, citing a lengthy report from Reuters. \n\nReuters reports that Meta \"for at least three years failed to identify and stop an avalanche of ads that exposed Facebook, Instagram and WhatsApp's billions of users to fraudulent e-commerce and investment schemes, illegal online casinos, and the sale of banned medical products...\"\n\n\nOn average, one December 2024 document notes, the company shows its platforms' users an estimated 15 billion \"higher risk\" scam advertisements &mdash; those that show clear signs of being fraudulent &mdash; every day. Meta earns about $7 billion in annualized revenue from this category of scam ads each year, another late 2024 document states. Much of the fraud came from marketers acting suspiciously enough to be flagged by Meta's internal warning systems. \n\nBut the company onl",
        "id": 4019681,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/08/0653232/bombshell-report-exposes-how-meta-relied-on-scam-ad-profits-to-fund-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bombshell Report Exposes How Meta Relied On Scam Ad Profits To Fund AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T18:28:11.838749+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T17:34:00+00:00",
        "description": "Long-time Slashdot reader AmiMoJo shared this report from Linuxiac:\n\n\n\nThe Japanese branch of Mozilla's Support Mozilla (SUMO) community &mdash; responsible for localizing and maintaining Japanese-language support documentation for Firefox and other Mozilla products (consisting of Japanese native speakers) &mdash; has officially disbanded after more than two decades of voluntary work... \n\nSUMO, short for Support Mozilla, is the umbrella project for Mozilla's user support platform, support.mozilla.org, that brings together volunteers and contributors worldwide who translate, maintain, and update documentation, tutorials, and troubleshooting guides for Firefox, Thunderbird, and other Mozilla products... According to marsf, the long-time locale leader of the Japanese SUMO team, the decision to disband was triggered by the recent introduction of an automated translation system known as Sumobot. Deployed on October 22, the bot began editing and approving Japanese Knowledge Base articles wi",
        "id": 4019342,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/08/0754249/japanese-volunteer-translators-quit-after-mozilla-begins-using-translation-bot",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japanese Volunteer Translators Quit After Mozilla Begins Using Translation Bot",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T17:27:14.162929+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T16:34:00+00:00",
        "description": "American multinational freight company UPS \"has grounded its fleet of MD-11 aircraft,\" reports the Guardian, \"days after a cargo plane crash that killed at least 13 people in Kentucky. The grounded MD-11s are the same type of plane involved in Tuesday's crash in Louisville. They were originally built by McDonnell Douglas until it was taken over by Boeing.\" \n\nMore details from NBC News:\n\n\nUPS said the move to temporarily ground its MD-11 fleet was made \"out of an abundance of caution and in the interest of safety.\" MD-11s make up 9% of the company's air fleet, it said. \"We made this decision proactively at the recommendation of the aircraft manufacturer. Nothing is more important to us than the safety of our employees and the communities we serve,\" UPS spokesman Jim Mayer said... FedEx said early Saturday that it was also grounding its MD-11s. The UPS rival has 28 such planes in operation, out of a fleet of around 700, FedEx said. \n\n\n\nVideo shows that the left engine of the plane caugh",
        "id": 4018936,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/08/0816223/ups-and-fedex-ground-dozens-of-md-11-aircraft-after-tuesdays-crash-in-kentucky",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UPS (and FedEx) Ground Dozens of MD-11 Aircraft After Tuesday's Crash in Kentucky",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T16:26:16.611903+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T15:34:00+00:00",
        "description": "\"Maybe you've heard that artificial intelligence is a bubble poised to burst,\" writes a Washington Post technology columnist. \"Maybe you have heard that it isn't. (No one really knows either way, but that won't stop the bros from jabbering about it constantly.)\" \n\n\n\"But I can confidently tell you that the money being thrown around for AI is so huge that numbers have lost all meaning.\"\n\nThe companies pouring money in are so rich and so power-hungry (in multiple meanings of that term) that our puny human brains cannot really comprehend. So let's try to give some meaning and context to the stratospheric numbers in AI. Is it a bubble? Eh, who knows. But it is completely bonkers. In just the past year, the four richest companies developing AI &mdash; Microsoft, Google, Amazon and Meta &mdash; have spent roughly $360 billion combined for big-ticket projects, which included building AI data centers and stuffing them with computer chips and equipment, according to my analysis of financial dis",
        "id": 4018585,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/08/0533205/stratospheric-ai-spending-by-four-wealthy-companies-reaches-360b-just-for-data-centers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Stratospheric' AI Spending By Four Wealthy Companies Reaches $360B Just For Data Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T13:20:21.113139+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: Facebook Dating, which debuted in 2019, has become a surprise hit for the company. It lets people create a dating profile free in the app, where they can swipe and match with other eligible singles. It has more than 21 million daily users, quietly making it one of the most popular online dating services. Hinge, a leading dating app in the United States, has around 15 million users. \"Underlying it all is that there are real people on Facebook,\" Tom Alison, the head of Facebook, said in an interview. \"You can see who they are, you can see how you're connected to them, and if you have mutual friends, we make it easy to see where you have mutual interests.\"\n \nFacebook Dating's popularity is a sign of how Facebook has been reinventing itself. One of the early social networks, its main social feed has become less popular over time than younger apps like Instagram and TikTok. But along with Facebook Marketplace, where people look f",
        "id": 4017456,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/08/0241231/facebook-dating-is-a-surprise-hit-for-the-social-network",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Facebook Dating Is a Surprise Hit For the Social Network",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T10:15:51.121441+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T10:00:00+00:00",
        "description": "Unesco has adopted the first global ethical standards for neurotechnology, defining \"neural data\" and outlining more than 100 recommendations aimed at safeguarding mental privacy. \"There is no control,\" said Unesco's chief of bioethics, Dafna Feinholz. \"We have to inform the people about the risks, the potential benefits, the alternatives, so that people have the possibility to say 'I accept, or I don't accept.'\" The Guardian reports: She said the new standards were driven by two recent developments in neurotechnology: artificial intelligence (AI), which offers vast possibilities in decoding brain data, and the proliferation of consumer-grade neurotech devices such as earbuds that claim to read brain activity and glasses that track eye movements.\n \nThe standards define a new category of data, \"neural data,\" and suggest guidelines governing its protection. A list of more than 100 recommendations ranges from rights-based concerns to addressing scenarios that are -- at least for now -- s",
        "id": 4016678,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/08/0232221/unesco-adopts-global-standards-on-wild-west-field-of-neurotechnology",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Unesco Adopts Global Standards On 'Wild West' Field of Neurotechnology",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T07:08:08.457759+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T07:00:00+00:00",
        "description": "New submitter semper_statisticum shares a report from the Independent: Lego is releasing its first-ever Star Trek-inspired model -- with an incredible recreation of the signature ship from the '80s TV series. Made from 3,600 pieces, the [first-ever] Star Trek inspired Lego set is of the U.S.S. Enterprise NCC-1701-D, the spaceship that serves as the main setting of Star Trek: The Next Generation series, which ran for seven seasons, as well as the 1994 film, Star Trek Generations.\n \n\"[It] allows builders to craft a detailed replica of the iconic starship, complete with a detachable command saucer, secondary hull, and warp nacelles with distinctive red and blue detailing,\" according to a press release from Lego. \"The model also features an opening shuttlebay and two mini shuttlepods, perfect for recreating classic scenes.\" The set comes with nine mini-figures of Star Trek: The Next Generation characters, including Captain Jean-Luc Picard, Commander William Riker, Lieutenant Worf, Lieuten",
        "id": 4015954,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/08/0226233/lego-unveils-first-ever-star-trek-set",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lego Unveils First-Ever Star Trek Set",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T04:03:03.179356+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from MIT Technology Review: Vanguard feels and smells like a new RV. It has long, gray banquettes that convert into bunks, a microwave cleverly hidden under a counter, a functional steel sink with a French press and crockery above. A weird little toilet hides behind a curtain. But some clues hint that you can't just fire up Vanguard's engine and roll off the lot. The least subtle is its door, a massive disc of steel complete with a wheel that spins to lock. Once it is sealed and moved to its permanent home beneath the waves of the Florida Keys National Marine Sanctuary early next year, Vanguard will be the world's first new subsea habitat in nearly four decades. Teams of four scientists will live and work on the seabed for a week at a time, entering and leaving the habitat as scuba divers. Their missions could include reef restoration, species surveys, underwater archaeology, or even astronaut training.\n \nOne of Vanguard's modules, unappetizingly na",
        "id": 4015418,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/08/0215248/the-first-new-subsea-habitat-in-40-years-is-about-to-launch",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The First New Subsea Habitat In 40 Years Is About To Launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T02:58:44.239583+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T02:20:00+00:00",
        "description": "Collins Dictionary has named \"vibe coding\" its 2025 word of the year -- a term coined by Andrej Karpathy for when a user makes an app or website by describing it to AI rather than writing programming code manually. The term, which is confusingly made up of two words, was \"one of 10 words on a shortlist to reflect the mood, language and preoccupations of 2025,\" reports the BBC. From the report: By giving an AI tool a simple description such as \"make me a program that schedules my weekly meals\", people can use \"vibe coding\" to make basic apps without any previous programming knowledge. More complicated tools still require skill, but the practice has opened up creating digital platforms to non-coders. As many have discovered, it isn't perfect - with no guarantee the code will actually work or be free of bugs. Alex Beecroft, the Managing Director of Collins, said the term \"perfectly captures how language is evolving alongside technology.\" Other words that made the list include \"clanker,\" ",
        "id": 4015199,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/08/0155228/vibe-coding-named-word-of-the-year-by-collins-dictionary",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Vibe Coding' Named Word of the Year By Collins Dictionary",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T01:56:51.953630+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T01:40:00+00:00",
        "description": "ole_timer shares a report from the New York Times: James D. Watson, who entered the pantheon of science at age 25 when he joined in the discovery of the structure of DNA, one of the most momentous breakthroughs in the history of science, died on Thursday in East Northport, N.Y., on Long Island. He was 97. His death, in a hospice, was confirmed on Friday by his son Duncan, who said Dr. Watson was transferred to the hospice from a hospital this week after being treated there for an infection.\n \nDr. Watson's role in decoding DNA, the genetic blueprint for life, would have been enough to establish him as one of the most important scientists of the 20th century. But he cemented that fame by leading the ambitious Human Genome Project and writing perhaps the most celebrated memoir in science.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=James+D.+Watson%2C+Co-Discoverer+of+the+Structure+of+DNA%2C+Is+Dead+At+97%3A+https%3A",
        "id": 4014977,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/07/2314257/james-d-watson-co-discoverer-of-the-structure-of-dna-is-dead-at-97",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "James D. Watson, Co-Discoverer of the Structure of DNA, Is Dead At 97",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T01:56:52.080581+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T01:00:00+00:00",
        "description": "The Verge's Ash Parrish writes: Nintendo has released a new store app on Android and iOS giving users the ability to purchase hardware, accessories, and games for the Switch and Switch 2. When I open my phone and scroll down to the N's, I get a neat, full row dedicated entirely to Nintendo. That's four apps: the Switch app, the music app, the Nintendo Today news app, and now the store. (The tally increases to five if you're a parent using the Switch Parental Controls app.) And it is entirely too much.\n \nNintendo has always been the one company of the big three publishers that does its own thing, and that's worked both for and against it. The company hasn't chased development trends with the same zeal as Microsoft and Sony. That insulates Nintendo when those trends don't pan out, like exorbitant spending on live-service games that fail. But also hurts it when it comes to performance and user experience. Console-native voice chat, for example, has been a standard on other platforms for ",
        "id": 4014978,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/07/2319237/nintendo-has-too-many-apps",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Nintendo Has Too Many Apps'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T00:56:08.709396+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T00:20:00+00:00",
        "description": "An anonymous reader quotes a report from SFGATE: At the Safeway on San Francisco's King Street, you now can't leave the store unless you buy something. The Mission Bay grocery store recently installed new anti-theft measures at the entrance and exit. New gates at the entrance automatically swing open when customers walk in, but they're set to trigger an alarm if someone attempts to back out. And if you walk into Safeway and change your mind about grocery shopping, you might find yourself trapped: Another gate that only opens if you scan your receipt blocks the store's sole exit.\n \nDuring my Monday visit, I purchased a kombucha and went through the check-out line without incident. (No high-tech gates block the exit if you go through the line like normal.) But for journalism's sake, I then headed back into the store to try going out the new gate. While I watched some customers struggle with the new technology, my receipt scanned immediately. The glass doors slid open, and I was free. Bu",
        "id": 4014712,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/07/238257/you-cant-leave-unless-you-buy-something",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "You Can't Leave Unless You Buy Something",
        "vote": 0
    }
]