[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T16:47:00.958038+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T16:00:18+00:00",
        "description": "While the PS5 has had two incredible exclusives to sustain its dominance over the console market in 2025, Sony's current-gen powerhouse is getting another relatively unknown timed exclusive to its yearly lineup. \n\nEverstone Studios’ Where Winds Meet brings glorious wuxia-based mechanics and an incredibly ambitious open world to the console in an experience that has a lot of potential. \n\nIn a year that has already seen its fair share of great titles, Where Winds Meet has already caught the attention of RPG and action adventure fans with its excellent world design, great combat, and a very satisfying exploration loop. But will they be enough to make it a hit among PS5 gamers? That remains to be seen but thankfully, there isn't too long to wait before we can find out.",
        "id": 4018674,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=5lXo6YGuVp8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5lXo6YGuVp8/hqdefault.jpg",
        "title": "Where Winds Meet Could Be PS5’s BIGGEST Game of 2025 - Your Next Obsession",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T13:40:42.515585+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T13:30:55+00:00",
        "description": "Crime games are always a refreshing way to blow off some steam and cause some virtual chaos after a trying day in the real world. But they can be notoriously tricky to get right, and disastrous to get wrong. There are many reasons for that, and this genre of gaming has seen mostly giant blockbusters that are too few and far between for it to truly shine as it deserves to. \n\nThat doesn't have to be the case, though, and talented studios with smaller budgets could produce experiences that bring thrilling and perhaps innovative touches to the crime formula. We dive into what those titles could look like, and what they can stand to learn from some of the genre's best experiences.",
        "id": 4017553,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=sEOqB3L5Ho0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sEOqB3L5Ho0/hqdefault.jpg",
        "title": "There Should Be Room For More Open-City Crime Games Than A GTA 6 Every Dozen Years",
        "vote": 0
    }
]