[
    {
        "age": null,
        "album": "",
        "author": "FRONTLINE PBS | Official",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-08T00:41:01.191794+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-08T00:01:00+00:00",
        "description": "Following former Vice President Dick Cheney’s death at age 84, watch this 2007 documentary tracing the behind-closed-doors battle Cheney waged within the George W. Bush administration over the power of the presidency and the rule of law. \n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate\n\nFor three decades, Dick Cheney had been an advocate of granting the president virtually unlimited wartime power. In the aftermath of the attacks on Sept. 11, 2001, with Cheney as George W. Bush’s vice president, the Justice Department and the White House made a number of controversial legal decisions. Orchestrated by Cheney and his lawyer David Addington, the department interpreted executive power in an expansive and extraordinary way, granting Bush the power to detain, interrogate, torture, wiretap and spy — without congressional approval or judicial review.\n\nIn “Cheney’s Law,” a documentary by Michael Kirk and his team, FRONTLINE ",
        "id": 4014614,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=qKtbnt1kPXo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 109,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qKtbnt1kPXo/hqdefault.jpg",
        "title": "How Dick Cheney Worked to Expand Executive Power | Cheney’s Law (full documentary) | FRONTLINE",
        "vote": 0
    }
]