[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-27T22:24:41.579460+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-27T13:00:00+00:00",
        "description": "<p dir=\"ltr\">Is there a more infamous monkey-paw wish than the collective dream that all our favorite games could last forever? Well, the finger curled, because it seems like all major game publishers in the world only want to make games that go on to infinity.</p><p dir=\"ltr\">With the rise of live-service games, it's been a struggle to know when to put the controller down, especially when games like Fortnite release seasonal content like The Simpsons season pass that ask you to play long enough to unlock stupid sexy Flanders. Luckily, for us, episodic games, perfectly portioned into bite-sized morsels, have come back to rescue us from the endless grind.</p><p dir=\"ltr\">In this case, I am talking specifically about Dispatch, the new episodic superhero game from AdHoc Studio. If the name is unfamiliar to you, AdHoc is a new game company founded by former members of Ubisoft, Night School, and perhaps most notably, Telltale Games, who blew up the episodic gaming scene with 2012's The Wal",
        "id": 4418349,
        "language": "en-US",
        "link": "https://www.gamespot.com/articles/games-want-you-to-play-forever-but-dispatch-tells-you-when-to-stop/1100-6537045/?ftag=CAD-01-10abi2f",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/4625575-dispatch-4.jpg",
        "title": "Games Want You to Play Forever, But Dispatch Tells You When to Stop",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-27T14:47:10.437313+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-27T06:00:00+00:00",
        "description": "<p>In November 2017, Bethesda Softworks and port specialists Panic Button performed what seemed like a miracle: They released a Switch port for id Software's recent reboot of Doom. The game, a famously fast-paced, intense shooter with modern graphics, seemed ill-suited to Nintendo's handheld and its capabilities, but despite some visual blurriness and a reduction in the frame rate, the game held up well on the hybrid system. In GameSpot's <a href=\"https://www.gamespot.com/reviews/doom-switch-review/1900-6416805/\">8/10 review</a> of the Switch port, Peter Brown praised the game as \"an impressive port that begs you to consider gameplay over graphics.\"</p><p dir=\"ltr\">Doom was the first Switch \"impossible port,\" a colloquial term that players took to using whenever a third-party game designed for much more powerful hardware arrived on the Switch in pretty good shape. Over the course of the system's lifespan, it would receive many more so-called impossible ports, including versions of Wol",
        "id": 4416122,
        "language": "en-US",
        "link": "https://www.gamespot.com/articles/in-the-switch-2s-first-year-every-third-party-port-tells-a-story-about-the-system/1100-6536987/?ftag=CAD-01-10abi2f",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/4625583-switch-22.jpg",
        "title": "In The Switch 2's First Year, Every Third-Party Port Tells A Story About The System",
        "vote": 0
    }
]