[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-27T16:36:29.684462+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-27T15:30:00+00:00",
        "description": "Cold Fear was quite the innovative title when it first came out way back in 2005. And while it may not have garnered the response its developers hoped its unique premise and mechanics would earn, the fact remains that what it attempted to do was a bold step in a new direction for horror games. \n\nThe idea of weaving the environment into a game’s core experience as a dynamic factor that keeps every encounter unpredictable is a bold design goal, one that few titles have fully pulled off. More's the pity, as current-gen gaming hardware could help address some of the original game's issues, and make this concept one that brings some very memorable chills and thrills to the genre's usual trappings. \n\nJoin us as we take a look at a game that was very innovative in its concept, but somewhat lacking in its execution.",
        "id": 4416698,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=q4rW3CY0674",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/q4rW3CY0674/hqdefault.jpg",
        "title": "20 Years Later, Cold Fear Still Stands Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-27T10:04:02.393385+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-27T09:30:00+00:00",
        "description": "Another year and a very entertaining bunch of action adventure games has come and gone, and with it a few titles that have stood tall amongst their peers thanks to the unique value they managed to bring to the experiences they presented. Each of them has had us glued to our screens with white knuckles from dealing with the challenges they gave us, but with a sense of awe and satisfaction at just how rewarding they've been. \n\nAlas, there can only be one winner and this time around, it's a game that has done very well to earn that crown. Join us as we dive into the action adventure genre's best contributions to 2025, and present the one that we think has managed to get ahead of them all.",
        "id": 4414944,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=-KJ6hjoXWv8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-KJ6hjoXWv8/hqdefault.jpg",
        "title": "15 Solid Action-Adventure Games of 2025 We Can't Stop Playing",
        "vote": 0
    }
]