[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T16:30:13+00:00",
        "description": "Arguably the best video game golfing simulation is returning on February 28 th after a two-year hiatus, and PGA Tour 2K25 is shaping up to be the greatest version yet. \n\nAuthenticity and realism are always at the forefront of developer HB Studio’s mind when crafting their perfect vision of digital golf, and this year’s iteration – whilst harbouring only a few incremental changes as customary with sports titles – has revamped its club swinging physics to, in 2K’s words, “truly nail the feeling of handling a golf club”. \n\nChanges to player creation, ranked play, and seasons are outlined in this video too, alongside playable golfers, courses, and anything you might expect to see and do when you tee off the first time in PGA Tour 2K25.",
        "id": 2083204,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cS3lY0PGISo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cS3lY0PGISo/hqdefault.jpg",
        "title": "PGA Tour 2K25 - 15 Things To Know BEFORE YOU BUY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T13:30:40+00:00",
        "description": "Resident Evil is good at so many things, and for the last few years, we’ve been seeing it consistently delivering on those things. But as consistently successful as it has been with its single player outings, just as consistently, the survival horror franchise has failed to make a mark with its multiplayer attempts. \n\nIn particular, it’s the series’ PvP outings that fail the hardest, Resident Evil Re:Verse being the latest in a long line of similar failures, also including Resident Evil: Resistance and Umbrella Corps. Why is it, then, that the developer keeps persisting with these cynical cash grabs- especially when Resident Evil has had a proven track record with successful co-op experiences over the years? \n\nHere, we discuss just that.",
        "id": 2081673,
        "language": null,
        "link": "https://www.youtube.com/watch?v=x_P27nvM32U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/x_P27nvM32U/hqdefault.jpg",
        "title": "Why The Hell Does Resident Evil Multiplayer Keep Flopping Again And Again?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T09:30:23+00:00",
        "description": "The PlayStation One was first launched in 1994 in Japan, and after arriving in North America and Europe in 1995, it changed the landscape forever. Instead of the Big Two of Nintendo and Sega, there was the Big Three. Alongside establishing the CD-ROM as a viable gaming medium, Sony catered to a different market.\n\nSurvival horror games, big-budget RPGs with extensive cinematics, stealth action titles, and racing sims flourished during the PS One era. Legendary properties like Resident Evil, Gran Turismo, Ape Escape, Tekken, Syphon Filter and more were born during this time. Meanwhile, franchises like Final Fantasy found new appreciation and fans. Even PC classics like Tomb Raider and Need for Speed had strong followings.\n\nWith so many excellent titles, narrowing them down to the 15 best is challenging. Nevertheless, here are the top PlayStation One games you should play as of 2025. Please note that this video is our 2025 edition.",
        "id": 2080025,
        "language": null,
        "link": "https://www.youtube.com/watch?v=_tfvz30sgwU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_tfvz30sgwU/hqdefault.jpg",
        "title": "Top 15 Outstanding PlayStation One Games You Need To Play Before You Die (Greatest PS1 Games)",
        "vote": 0
    }
]