[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T23:24:56+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Two owners of Nvidia's new RTX 5090 Founders Edition GPUs have reported melted power connectors and damage to their PSUs. The images look identical to reports of RTX 4090 power cables burning or melting from two years ago. Nvidia blamed the issue on people not properly plugging the 12VHPWR power connection in fully and the PCI standards body blamed Nvidia.\n \nA Reddit poster upgraded from an RTX 4090 to an RTX 5090 and noticed \"a burning smell playing Battlefield 5,\" before turning off their PC and finding the damage. The images show burnt plastic at both the PSU end of the power connector and the part that connects directly to the GPU. The cable is one from MODDIY, a popular manufacturer of custom cables, and the poster claims it was \"securely fastened and clicked on both sides (GPU and PSU).\" While it's tempting to blame the MODDIY cable, Spanish YouTuber Toro Tocho has experienced the same burnt cable (both at the GPU and PSU e",
        "id": 2085488,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/10/2125226/nvidias-rtx-5090-power-connectors-are-melting?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia's RTX 5090 Power Connectors Are Melting",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T22:20:54+00:00",
        "description": "Apple has released emergency security updates for iOS 18.3.1 and iPadOS 18.3.1 to patch a zero-day vulnerability (CVE-2025-24200) that was exploited in \"extremely sophisticated,\" targeted attacks. The flaw, which allowed a physical attack to disable USB Restricted Mode on locked devices, was discovered by Citizen Lab and may have been used in spyware campaigns; users are strongly advised to install the update immediately. BleepingComputer reports: USB Restricted Mode is a security feature (introduced almost seven years ago in iOS 11.4.1) that blocks USB accessories from creating a data connection if the device has been locked for over an hour. This feature is designed to block forensic software like Graykey and Cellebrite (commonly used by law enforcement) from extracting data from locked iOS devices.\n \nIn November, Apple introduced another security feature (dubbed \"inactivity reboot\") that automatically restarts iPhones after long idle times to re-encrypt data and make it harder to ",
        "id": 2085073,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/10/217213/apple-fixes-zero-day-exploited-in-extremely-sophisticated-attacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Fixes Zero-Day Exploited In 'Extremely Sophisticated' Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T22:20:54+00:00",
        "description": "According to consultancy firm Janco, the U.S. Bureau of Labor Statistics reclassified several job titles, \"leading to a downward adjustment of over 111,000 positions for November and December 2024,\" The Register reports. This revision contributed to an overall decline of 123,000 IT jobs for the year. However, in reality, IT sector hiring is on the rise, with 11,000 new positions added in January. From the report: \"Many CEOs have given CFOs and CIOs the green light to hire IT Pros,\" Janco CEO Victor Janulaitis said of the first month of 2025. \"IT Pros who were unemployed last month found jobs more quickly than was anticipated as CIOs rushed to fill open positions.\" There's still a 5.7 percent unemployment rate in the IT sector in January, Janco noted, which is greater than the national average of 4 percent - and which could rise further as Elon Musk's Department of Government Efficiency (DOGE) pushes ahead with federal workforce reductions aimed at streamlining operations.\n \n\"Over the",
        "id": 2085072,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/10/2118222/reclassification-is-making-us-tech-job-losses-look-worse-than-they-are?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Reclassification Is Making US Tech Job Losses Look Worse Than They Are",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T21:15:30+00:00",
        "description": "An anonymous reader quotes a report from CBS News: Animal shelters, rescues, and veterinarian clinics around the U.S. are posting on social media telling pet owners to check their four-legged friends' microchips after learning a major microchip company [called Save This Life] is no longer providing services. [...] If you're unsure which company your cats or dogs' chips are registered with, check them. \"You can go to your local veterinarian office, a local police station, or even a local animal shelter like HARP, and we can help check that for you and scan your animal. And then you take that number that's on there and there's a tool online where you can go look it up,\" [said Dan Cody, Executive Director of Humane Animal Rescue of Pittsburgh].\n \nHe said you check the number by using the AAHA Universal Microchip Lookup Tool at this link. If you discover your pet's microchip was registered to the company that's ceased operations, you'll need to register with a different company. \"So, if ",
        "id": 2084663,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/10/212213/microchip-company-ceases-operations-pet-owners-urged-to-re-register?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microchip Company Ceases Operations, Pet Owners Urged To Re-Register",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T20:09:49+00:00",
        "description": "An anonymous reader shares a report: For a man who's spent his career battling to make France more pro-business, Europe's prospects on AI are worrying: an oversight that could cost the bloc dearly. \"We are not in the race today,\" French President Emmanuel Macron told CNN's Richard Quest in an exclusive interview at the Elysee Palace on Thursday. \"We are lagging behind.\" \n\n\"We need an AI agenda,\" he said, \"because we have to bridge the gap with the United States and China on AI.\" The French leader added that he fears Europe becoming merely an AI consumer, losing control over the future direction and development of the technology. That's part of the impetus behind this week's AI summit in Paris -- the latest effort by Macron to put France at the heart of the debate and decision-making on international questions of the day. Earlier today, Macron announced investment pledges to bolster France's AI sector totalling $112 billion over the coming years.<p><div class=\"share_submission\" style=",
        "id": 2084274,
        "language": null,
        "link": "https://slashdot.org/story/25/02/10/1859242/europe-not-in-the-ai-race-today-french-president-macron-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Europe 'Not in the AI Race Today,' French President Macron Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T20:09:49+00:00",
        "description": "An anonymous reader shares a report: Microsoft has offered to widen the price differential between its Office product sold with its chat and video app Teams and its software sold without the app in a bid to avert a possible EU antitrust fine, according to three sources. The move by the U.S. tech giant comes five years after Salesforce-owned Slack complained to the European Commission about Microsoft's tying of Teams with Office. In 2023, German rival alfaview filed a similar grievance to the EU watchdog. Teams, which was added to Office 365 in 2017 for free and eventually replaced Skype for Business, became popular during the pandemic due in part to its video conferencing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+To+Adjust+Office-Teams+Pricing+in+Bid+To+Avoid+EU+Antitrust+Fine%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F10%2F1926209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"h",
        "id": 2084273,
        "language": null,
        "link": "https://slashdot.org/story/25/02/10/1926209/microsoft-to-adjust-office-teams-pricing-in-bid-to-avoid-eu-antitrust-fine?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft To Adjust Office-Teams Pricing in Bid To Avoid EU Antitrust Fine",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T19:05:19+00:00",
        "description": "An anonymous reader shares a report: A new paper [PDF] from researchers at Microsoft and Carnegie Mellon University finds that as humans increasingly rely on generative AI in their work, they use less critical thinking, which can \"result in the deterioration of cognitive faculties that ought to be preserved.\" \n\n\"[A] key irony of automation is that by mechanising routine tasks and leaving exception-handling to the human user, you deprive the user of the routine opportunities to practice their judgement and strengthen their cognitive musculature, leaving them atrophied and unprepared when the exceptions do arise,\" the researchers wrote.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Study+Finds+AI+Makes+Human+Cognition+'Atrophied+and+Unprepared'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F10%2F1752233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.",
        "id": 2083801,
        "language": null,
        "link": "https://slashdot.org/story/25/02/10/1752233/microsoft-study-finds-ai-makes-human-cognition-atrophied-and-unprepared?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Study Finds AI Makes Human Cognition 'Atrophied and Unprepared'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T18:01:16+00:00",
        "description": "Lyft says it will launch a fleet of robotaxis, using self-driving technology from Intel's Mobileye, in Dallas in \"as soon as 2026,\" with plans to scale to \"thousands\" of vehicles in additional markets in the months to follow. From a report: To signal its seriousness, the company tapped Marubeni, a Japanese conglomerate, to run fleet operations. Lyft's news comes after Uber dropped new details about its plan to feature Waymo's robotaxis on its platform in Austin and Atlanta later this year. And Tesla recently shared plans to launch a robotaxi service in Austin this summer.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lyft+Eyes+Robotaxi+Launch+in+2026%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F10%2F1646207%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdo",
        "id": 2083159,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/10/1646207/lyft-eyes-robotaxi-launch-in-2026?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lyft Eyes Robotaxi Launch in 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T18:01:16+00:00",
        "description": "AmiMoJo writes: A computer expert who has battled for a decade to recover a $743 million bitcoin fortune he believes is buried in a council dump in south Wales is considering buying the site so he can hunt for the missing fortune. James Howells lost a high court case last month to force Newport city council to allow him to search the tip to retrieve a hard drive he says contains the bitcoins. \n\nThe council has since announced plans to close and cap the site, which would almost certainly spell the end of any lingering hopes of reaching the bitcoins. The authority has secured planning permission for a solar farm on part of the land. Howells, 39, said on Monday it had been \"quite a surprise\" to hear of the closure plan. He said: \"It [the council] claimed at the high court that closing the landfill to allow me to search would have a huge detrimental impact on the people of Newport, whilst at the same time they were planning to close the landfill anyway. I expected it would be closed in t",
        "id": 2083158,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/10/1721224/man-who-lost-bitcoin-fortune-in-welsh-tip-explores-purchase-of-entire-landfill?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Man Who Lost Bitcoin Fortune In Welsh Tip Explores Purchase of Entire Landfill",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T16:23:10+00:00",
        "description": "Europe's Euclid space telescope has captured a rare \"Einstein ring,\" showing light from a distant galaxy bent into a perfect circle by the gravity of another galaxy sitting between Earth and the source, the European Space Agency said. \n\nThe phenomenon, spotted around galaxy NGC 6505 some 590 million light-years from Earth, reveals the warping of space predicted by Einstein's theory of relativity. The background galaxy, located 4.42 billion light-years away, appears as a complete ring of light around NGC 6505. \n\n\"An Einstein ring as perfect as this is extremely rare,\" said Open University astronomer Stephen Serjeant. Analysis shows NGC 6505 contains about 11% dark matter, a key focus of Euclid's mission to map the universe.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Euclid+Telescope+Captures+Einstein+Ring+Revealing+Warping+of+Space%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F02%2F10%2F0834236%2F%3Futm_s",
        "id": 2082634,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/10/0834236/euclid-telescope-captures-einstein-ring-revealing-warping-of-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Euclid Telescope Captures Einstein Ring Revealing Warping of Space",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T16:23:10+00:00",
        "description": "OpenAI is pushing ahead on its plan to reduce its reliance on Nvidia for its chip supply by developing its first generation of in-house AI silicon. From a report: The ChatGPT maker is finalizing the design for its first in-house chip in the next few months and plans to send it for fabrication at Taiwan Semiconductor Manufacturing Co, sources told Reuters. The process of sending a first design through a chip factory is called \"taping out.\" \n\nThe update shows that OpenAI is on track to meet its ambitious goal of mass production at TSMC in 2026. A typical tape-out costs tens of millions of dollars and will take roughly six months to produce a finished chip, unless OpenAI pays substantially more for expedited manufacturing. There is no guarantee the silicon will function on the first tape out and a failure would require the company to diagnose the problem and repeat the tape-out step. Inside OpenAI, the training-focused chip is viewed as a strategic tool to strengthen OpenAI's negotiatin",
        "id": 2082633,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/10/162234/openai-set-to-finalize-first-custom-chip-design-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Set To Finalize First Custom Chip Design This Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T15:18:08+00:00",
        "description": "Google DeepMind CEO Demis Hassabis downplayed the technological significance of DeepSeek's latest AI model, despite its market impact. \"Despite the hype, there's no actual new scientific advance there. It's using known techniques,\" Hassabis said on Sunday. \"Actually many of the techniques we invented at Google and at DeepMind.\" \n\nHassabis acknowledged that Deepseek's AI model \"is probably the best work\" out of China, but its capabilities, he said, is \"exaggerated a little bit.\"DeepSeek's launch last month triggered a $1 trillion U.S. market sell-off.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=DeepMind+Chief+Dismisses+DeepSeek's+AI+Breakthrough+as+'Known+Techniques'%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F10%2F0855244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A",
        "id": 2082102,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/10/0855244/deepmind-chief-dismisses-deepseeks-ai-breakthrough-as-known-techniques?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DeepMind Chief Dismisses DeepSeek's AI Breakthrough as 'Known Techniques'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T13:09:07+00:00",
        "description": "They publish 77 newspapers in 26 U.S. states, according to Wikipedia. But this week a \"cybersecurity event\" at the newspapers' parent company \"disrupted systems and networks,\" according to an article at one of their news sites which quotes an email sent to employees by the publishing company's CEO. \"We have notified law enforcement of the situation.\" \n\nAnd the company \"has not released print or e-editions in most markets this week,\" according to the Augusta Free Press, \"originally telling subscribers the outage was due to a server issue,\"\n\nThe CEO said the company is also working to identify \"additional steps we can take to help prevent something like this from happening again.\" The computer server appears to have compromised [last] Monday morning. No timeline has been announced for when news operations will return to normal publication schedules. According to a report in The News Virginian and published on the websites of the affected papers nationwide, the company is now producing,",
        "id": 2081179,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/10/0614233/server-attack-stops-the-presses-at-us-newspaper-chain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Server Attack Stops the Presses at US Newspaper Chain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T09:45:27+00:00",
        "description": "President Donald Trump has ordered Treasury Secretary Scott Bessent to halt penny production to cut government spending, according to a Truth Social post on Sunday. The U.S. Mint spent 3.69 cents to produce and distribute each penny last year, resulting in a $85.3 million loss on over three billion new pennies. \n\nThe one-cent coin accounts for more than half of all U.S. coin production despite having about 250 billion pieces already in circulation. Canada, Australia and several other countries have eliminated their lowest-denomination coins citing costs in recent years. \n\nFurther reading: Abolish the Penny?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Trump+Orders+Treasury+Secretary+To+Stop+Minting+Pennies%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F02%2F10%2F0841200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http:",
        "id": 2080006,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/10/0841200/trump-orders-treasury-secretary-to-stop-minting-pennies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Orders Treasury Secretary To Stop Minting Pennies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T08:40:19+00:00",
        "description": "\"The Internet's Own Boy\" was inscribed below the bust, according to the San Francisco Standard, adding that the 312-pound marble statue \"was crafted using a mix of AI-driven robotic milling and traditional hand carving.\" \n\nIt was unveiled Friday at the Internet Archive auditorium for a crowd of around 300 people. \"Aaron's legacy is bringing people together to make change, said Cindy Cohn, the executive director of the Electronic Frontier Foundation.\n\n\n\"There's a renaissance happening now in Aaron Swartz-land,\" said Lisa Rein, the co-founder of Creative Commons, a nonprofit devoted to expanding public access to information. She founded Aaron Swartz Day in 2013, an annual hackathon and tribute held on his birthday. There's now an Aaron Swartz Institute in Brazil, a documentary, multiple books and podcasts &mdash; even an Aaron Swartz memecoin (\"Do not buy,\" she warned). \n\n\"It's great that people idolize him as long as they get the story right: He was not a martyr,\" Rein said, her eyes ",
        "id": 2079747,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/10/0456219/aaron-swartz-sculptures-unveiling-at-internet-archive-attended-by-300?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Aaron Swartz Sculpture's Unveiling at Internet Archive Attended by 300",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T04:20:15+00:00",
        "description": "Today T-Mobile announced what they're calling \"the next big thing in wireless\" &mdash; T-Mobile Starlink. But the real surprise is \"The beta is now open for absolutely everyone &mdash; yes, even Verizon and AT&amp;T customers &mdash; to register for free access until July.\" \n\nAnd, as they explained to Americans watching the Super Bowl, \"If you can see the sky you're connected.\"\n\n\nNow in public beta, this breakthrough service, developed in partnership with Starlink, uses straight-out-of-a-sci-fi-movie satellite and mobile communications technology to help keep people connected &mdash; even you, Verizon and AT&amp;T customers &mdash; in the more than 500,000 square miles of the country unreached by any carrier's earth-bound cell towers. That's nearly the size of two Texases...! The beauty of the service is its simplicity: users don't need to do anything out of the ordinary. When a user's cell phone gets out of range of a cell tower, the phone automatically connects to the T-Mobile Star",
        "id": 2078850,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/02/10/043208/free-t-mobile-starlink-for-six-months-announced-during-super-bowl-also-available-to-verizon-and-att-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Free 'T-Mobile Starlink' for Six Months Announced During Super Bowl. Also Available to Verizon and AT&amp;T Customers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-10T01:05:06+00:00",
        "description": "An anonymous reader shared this report from Fortune:\n\nMore than 14 million job seekers' applications went completely ignored in a single quarter last year, according to one hiring platform. Now, sites like Greenhouse and LinkedIn are experimenting with new ways to hold companies accountable for making the hiring process so miserable for applicants. Three of the biggest job search sites &mdash; LinkedIn, Indeed and Greenhouse &mdash; have put tools in place to highlight which companies frequently respond to applicants in a timely manner... According to Greenhouse, half of applicants say they've been ghosted after an interview. \n\nMeanwhile, new artificial intelligence tools have made it easier for candidates to play a numbers game, generating tailored resumes for hundreds of roles. But that's led to an increasingly overwhelming flood of applications for companies, making it nearly impossible to process the deluge and respond to every hopeful in a timely manner &mdash; let alone find th",
        "id": 2078260,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/09/2257225/job-search-sites-try-shaming-companies-that-ghost-job-seekers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Job-Search Sites Try Shaming Companies That 'Ghost' Job-Seekers",
        "vote": 0
    }
]