[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T20:36:40.099958+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T20:00:16+00:00",
        "description": "The creators of Lost in Random and Fe have sculpted something special in The Midnight Walk. The game really lives and breathes by its claymation aesthetic. If you’re a fan of Tim Burton’s Nightmare Before Christmas in particular, you’ve got to check out this game. But it’s not just visuals that might appeal to gamers here. There’s also some terrifying horror elements. \n\nUsing the flame of your companion, Potboy, you light the way forward and attempt to overcome dark creatures lurking along the midnight walk. Failing to hide in a closet in time, for example, will result in some terrifying jump scares. Though, the game is quite lean on content, only clocking in at five hours, there’s a host of collectibles to find throughout the game’s varied environments. \n\nThe Midnight Walk releases on May 8th for PS5 and PC and is fully compatible for PSVR2 and other virtual reality headsets such as Oculus.",
        "id": 2641763,
        "language": null,
        "link": "https://www.youtube.com/watch?v=LhsVhKHK4QU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LhsVhKHK4QU/hqdefault.jpg",
        "title": "The Midnight Walk Review - A Stealth Horror Experience That Will Haunt You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T17:22:01.787974+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T16:01:09+00:00",
        "description": "id Software is no stranger to stunning first-person shooters. Since its inception, it's been pushing the envelope with its engines, especially with DOOM (2016) and DOOM Eternal. However, throughout its lifespan, it's always focused on optimization to ensure top-tier performance.\n\nTo no one's surprise, DOOM: The Dark Ages offers the best of both worlds. It takes everything seen from Eternal - the sleek animations and model layers for optimal gore - and adds ray-traced global illumination and reflections, improved destruction, and the most enemies on screen yet. The overall result is stunning, backed by numerous graphical options and a consistently smooth frame rate.\n\nThe best part is that all this carries over to the PS5 version. While dynamic resolution scaling feels more heavily in effect to ensure a steady frame rate, it still features impressive visual fidelity and performance. \n\nRegardless of your platform, DOOM: The Dark Ages should offer an excellent visual experience when it la",
        "id": 2640188,
        "language": null,
        "link": "https://www.youtube.com/watch?v=dgWCH-0LEa8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dgWCH-0LEa8/hqdefault.jpg",
        "title": "DOOM: The Dark Ages Looks Graphically Stunning On PS5 And PC, But What About PERFORMANCE?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T14:48:20.516815+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T14:01:02+00:00",
        "description": "DOOM: The Dark Ages is a special game. The latest in id Software’s beloved first-person shooter franchise delivers a new flavor of DOOM, replacing the intense mobility and pace of DOOM (2016) and, in particular, Eternal with a tankier, grimier, more methodical moment-to-moment combat loop, but at the same time, ensures that it retains the aggression and brutality that DOOM has always been known for. \n\nCombined with more of a focus on cinematics and exploration, DOOM: The Dark Ages delivers a truly spectacular experience that feels like a fresh take on a familiar beloved framework.",
        "id": 2638958,
        "language": null,
        "link": "https://www.youtube.com/watch?v=dIdBFzPxt7I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dIdBFzPxt7I/hqdefault.jpg",
        "title": "DOOM: The Dark Ages Review - A Metal Masterpiece",
        "vote": 0
    }
]