[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T23:08:04.820012+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T22:40:00+00:00",
        "description": "According to The Information (paywalled), Meta is reportedly developing facial recognition capabilities for its Ray-Ban smart glasses -- technology it previously avoided due to privacy concerns. 404 Media's Joseph Cox writes: The move is an obvious about-face from Meta. It's also interesting to me because Meta's PR chewed my ass off when I dared to report in October that a pair of students took Meta's Ray-Ban glasses and combined them with off-the-shelf facial recognition technology. That tool, which the students called I-XRAY, captured a person's face, ran it through an easy to access facial recognition service called Pimeyes, then went a step further and pulled up information about the subject from across the web, including their home address and phone number.\n \nWhen I contacted Meta for comment for that story, Dave Arnold, a spokesperson for the company, said in an email he had one question for me. \"That Pimeyes facial recognition technology could be used with ANY camera, correct? ",
        "id": 2642738,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/09/2048235/meta-to-add-facial-recognition-to-glasses-after-all?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta To Add Facial Recognition To Glasses After All",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T23:08:04.932794+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T22:02:00+00:00",
        "description": "Numerous coffee establishments across the US are actively restricting internet access and laptop use as they push back against remote workers monopolizing their spaces for hours. \n\nNew York's Devocion chain limits WiFi to two-hour windows on weekdays and eliminates it entirely on weekends, while Detroit's Alba coffee shop has operated without WiFi since its 2023 opening. Some venues have resorted to physically taping over electrical outlets. \n\nDC-based cafe Elle initially launched without WiFi but reversed course after receiving negative Google reviews, implementing a compromise with access restricted to Monday-Thursday, 8am-3pm, with a 90-minute usage cap. The restrictions primarily aim to increase customer turnover, improve sales figures, and restore the community atmosphere that extended laptop sessions often diminish.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Coffee+Shops+Ditch+WiFi+and+Laptops+To+Limit+Rem",
        "id": 2642739,
        "language": null,
        "link": "https://slashdot.org/story/25/05/09/2040233/coffee-shops-ditch-wifi-and-laptops-to-limit-remote-work?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Coffee Shops Ditch WiFi and Laptops To Limit Remote Work",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T23:08:05.045863+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T21:25:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: A Florida bill, which would have required social media companies to provide an encryption backdoor for allowing police to access user accounts and private messages, has failed to pass into law. The Social Media Use by Minors bill was \"indefinitely postponed\" and \"withdrawn from consideration\" in the Florida House of Representatives earlier this week. Lawmakers in the Florida Senate had already voted to advance the legislation, but a bill requires both legislative chambers to pass before it can become law.\n \nThe bill would have required social media firms to \"provide a mechanism to decrypt end-to-end encryption when law enforcement obtains a subpoena,\" which are typically issued by law enforcement agencies and without judicial oversight. Digital rights group the Electronic Frontier Foundation called the bill \"dangerous and dumb.\" Security professionals have long argued that it is impossible to create a secure backdoor that cannot als",
        "id": 2642740,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/09/2036224/florida-fails-to-pass-bill-requiring-encryption-backdoors-for-social-media-accounts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Florida Fails To Pass Bill Requiring Encryption Backdoors For Social Media Accounts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T20:58:09.108036+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T20:45:00+00:00",
        "description": "Just days after a radar and communications outage at Newark Liberty International Airport, the FAA confirmed a second incident on May 9 that disrupted radar and radio contact for 90 seconds due to a telecom failure at Philadelphia TRACON. \"As of 12:30PM ET, FlightAware stats showed 292 total delays for flights into or out of Newark, which is also experiencing delays due to runway construction,\" reports The Verge. From the report: After the first outage on April 28th, an air traffic controller who had been on duty that day told CNN it \"...was the most dangerous situation you could have.\" CNN reports that after a change made last July, the airport's radar and radio communication flows over a single data feed from a facility in New York, where controllers used to manage Newark's flights, to Philadelphia.\n \nThe FAA has announced a plan to replace the current copper connection with fiber, as well as adding \"three new, high-bandwidth telecommunications connections between the New York-based",
        "id": 2641910,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/09/2042235/newark-airport-radar-outage-strikes-again-delaying-more-flights?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Newark Airport Radar Outage Strikes Again, Delaying More Flights",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T20:58:09.221706+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T20:26:00+00:00",
        "description": "Wearable startup Whoop just announced its new Whoop 5.0 fitness tracker yesterday, but some existing users are already calling foul. From a report: Previously, Whoop said people who had been members for at least six months would get free upgrades to next-generation hardware. Now, the company says that members hoping to upgrade from a Whoop 4.0 to 5.0 will have to pay up. \n\nWhoop is a bit different from other fitness trackers in that it runs entirely on a subscription membership model. Most wearable makers that have subscriptions will charge you for the hardware, and then customers have the option of subscribing to get extra data or features. A good example is the Oura Ring, where you buy the ring and then have the option of paying a monthly $6 subscription. Whoop, however, has until now said that you get the hardware for \"free\" while paying a heftier annual subscription. Previously, Whoop promised users that whenever new hardware was released, existing members would be able to upgrade",
        "id": 2641911,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/09/2026235/whoop-angers-users-over-reneged-free-upgrade-promises?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Whoop Angers Users Over Reneged Free Upgrade Promises",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T19:53:14.201219+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T19:20:00+00:00",
        "description": "A U.S. senator introduced a bill on Friday that would direct the Commerce Department to require location verification mechanisms for export-controlled AI chips, in an effort to curb China's access to advanced semiconductor technology. From a report: Called the \"Chip Security Act,\" the bill calls for AI chips under export regulations, and products containing those chips, to be fitted with location-tracking systems to help detect diversion, smuggling or other unauthorized use of the product. \n\n\"With these enhanced security measures, we can continue to expand access to U.S. technology without compromising our national security,\" Republican Senator Tom Cotton of Arkansas said. The bill also calls for companies exporting the AI chips to report to the Bureau of Industry and Security if their products have been diverted away from their intended location or subject to tampering attempts.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/h",
        "id": 2641548,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/09/1850212/us-senator-introduces-bill-calling-for-location-tracking-on-ai-chips-to-limit-china-access?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Senator Introduces Bill Calling For Location-Tracking on AI Chips To Limit China Access",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T18:46:27.671728+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T18:40:00+00:00",
        "description": "Software firm 37signals is completing its migration from AWS to on-premises infrastructure, expecting to save $1.3 million annually on storage costs alone. CTO David Heinemeier Hansson announced the company has begun migrating 18 petabytes of data from Amazon S3 to Pure Storage arrays costing $1.5 million upfront but only $200,000 yearly to operate. \n\nAWS waived $250,000 in data egress fees for the transition, which will allow 37signals to completely delete its AWS account this summer. The company has already slashed $2 million in annual costs after replacing cloud compute with $700,000 worth of Dell servers in 2024. \"Cloud can be a good choice in certain circumstances, but the industry pulled a fast one convincing everyone it's the only way,\" wrote Hansson, who began the repatriation effort in 2022 after discovering their annual AWS bill exceeded $3.2 million.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=37signal",
        "id": 2641055,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/09/1618248/37signals-to-delete-aws-account-cutting-cloud-costs-by-millions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "37signals To Delete AWS Account, Cutting Cloud Costs By Millions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T18:46:27.785517+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T18:00:00+00:00",
        "description": "A comprehensive analysis in Science Advances reveals that humans have explored less than 0.001% of the deep seafloor -- an area equivalent to merely one-tenth the size of Belgium. Oceanographer Katherine Bell and colleagues at the Ocean Discovery League compiled data from approximately 44,000 deep-sea dives conducted between 1958 and 2024, finding that expeditions have concentrated overwhelmingly around waters near the United States, Japan, and New Zealand. \n\nThe study exposes significant gaps in ocean exploration, with vast regions -- particularly the Indian Ocean -- remaining virtually untouched by direct observation. Much of the existing dive data remains inaccessible to scientists, locked away by private companies.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Scientists+Have+Explored+Just+0.001%25+of+Deep+Ocean+Floor%2C+New+Study+Finds%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F05%2F09%2F0833252%2F%3Fut",
        "id": 2641056,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/09/0833252/scientists-have-explored-just-0001-of-deep-ocean-floor-new-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Have Explored Just 0.001% of Deep Ocean Floor, New Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T17:37:54.482158+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T17:20:00+00:00",
        "description": "CrowdStrike, the cybersecurity firm that became a household name after causing a massive global IT outage last year, has announced it will cut 5% of its workforce in part due to \"AI efficiency.\" From a report: In a note to staff earlier this week, released in stock market filings in the US, CrowdStrike's chief executive, George Kurtz, announced that 500 positions, or 5% of its workforce, would be cut globally, citing AI efficiencies created in the business. \n\n\"We're operating in a market and technology inflection point, with AI reshaping every industry, accelerating threats, and evolving customer needs,\" he said. Kurtz said AI \"flattens our hiring curve, and helps us innovate from idea to product faster,\" adding it \"drives efficiencies across both the front and back office. AI is a force multiplier throughout the business,\" he said. Other reasons for the cuts included market demand for sustained growth and expanding the product offering.<p><div class=\"share_submission\" style=\"position",
        "id": 2640435,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/09/0920225/crowdstrike-responsible-for-global-it-outage-to-cut-jobs-in-ai-efficiency-push?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CrowdStrike, Responsible For Global IT Outage, To Cut Jobs In AI Efficiency Push",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T17:37:54.595583+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T16:40:00+00:00",
        "description": "An anonymous reader shares a report: Panasonic will undertake a major restructuring across a range of its business, including consumer electronics, cutting 10,000 jobs globally, as the Japanese company plans to streamline, spinning out struggling divisions in hopes of reversing its dwindling market share and fending off fierce Chinese competition. Panasonic did not say which businesses it intended to shrink. The company expects to book structural reform costs of roughly $900 million this business year. Panasonic ended the fiscal year<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Panasonic+To+Cut+10%2C000+Jobs%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F09%2F0911253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F09%2F0911253%2Fpanasonic-to",
        "id": 2640436,
        "language": null,
        "link": "https://slashdot.org/story/25/05/09/0911253/panasonic-to-cut-10000-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Panasonic To Cut 10,000 Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T17:37:54.709255+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T16:01:00+00:00",
        "description": "An anonymous reader shares a report: Major tech companies lobbying to salvage a tax deduction for research and development are warning they may pull back from high-profile pledges of new US investments if Congress doesn't fully reinstate the break. \n\nBig tech companies have pledged more than $1.6 trillion in investments in the US since Donald Trump took office, promising to build factories and data centers in alignment with Trump's push to build in America. But industry representatives are signaling those promises will be imperiled if Congress doesn't fully reinstate the R&amp;D tax deduction, which was pared back to help offset the massive cost of President Donald Trump's 2017 bill. At the time, it was estimated that limiting the provision would temporarily raise about $120 billion from 2018 to 2027. \n\n\"A lot of those announcements are predicated on an expectation the administration and Congress will partner together on reinstating those R&amp;D provisions,\" said Jason Oxman, preside",
        "id": 2640437,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/09/1557201/tech-industry-warns-us-investment-pledges-hinge-on-research-tax-break?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tech Industry Warns US Investment Pledges Hinge on Research Tax Break",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T16:07:40.335006+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T15:20:00+00:00",
        "description": "The specialized role of prompt engineering, not long ago heralded as a promising new career path in AI, has virtually disappeared just two years after its emergence. Many companies are now considering strong AI prompting a standard skill rather than a dedicated position, Fast Company reports, with some firms even deploying AI systems to generate optimal prompts for other AI tools. \n\n\"AI is already eating its own,\" Malcolm Frank, CEO of TalentGenius, told the publication. \"Prompt engineering has become something that's embedded in almost every role, and people know how to do it. It's turned from a job into a task very, very quickly.\" The prompt engineer's decline serves as a case study for the broader AI job market, where evidence suggests AI is primarily reshaping existing careers rather than creating entirely new ones. \n\nFurther reading: 'AI Prompt Engineering Is Dead.'<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?statu",
        "id": 2639762,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/09/0823210/prompt-engineering-is-quickly-going-extinct?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Prompt Engineering is Quickly Going Extinct",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T15:01:50.001902+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T14:40:00+00:00",
        "description": "Nvidia founder and CEO Jensen Huang has served up another blunt take on the job market as AI permeates society. From a report: \"You will not lose your job to AI, but will lose it to someone who uses it,\" Huang said at the Milken Institute Conference. Added Huang, \"I recommend 100% take advantage of AI, don't be that person.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nvidia+CEO%3A+'You+Won't+Lose+Your+Job+To+AI%2C+But+To+Someone+Who+Uses+It'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F09%2F0815221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F09%2F0815221%2Fnvidia-ceo-you-wont-lose-your-job-to-ai-but-to-someone-who-uses-it%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n",
        "id": 2639182,
        "language": null,
        "link": "https://slashdot.org/story/25/05/09/0815221/nvidia-ceo-you-wont-lose-your-job-to-ai-but-to-someone-who-uses-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia CEO: 'You Won't Lose Your Job To AI, But To Someone Who Uses It'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T15:01:50.115584+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T14:00:00+00:00",
        "description": "Researchers are sounding alarms about the proliferation of AI-generated content -- dubbed \"slop\" -- that may be overwhelming the internet's human-created material. Fil Menczer, distinguished professor of informatics at Indiana University, who has studied social bots since the early 2010s, is now expressing serious concern about generative AI's impact. \"Am I worried? Yes, I'm very worried,\" he told Bloomberg. \n\nAnother research from Georgetown University found over 100 Facebook pages with millions of followers using AI-generated images for scams. According to Tollbit, a company that helps publishers get compensated when their sites are scraped, web scraping volume doubled from Q3 to Q4 2024, causing significant strain on sites like Wikipedia during high-traffic events. \n\nThe situation creates a dangerous feedback loop where AI content is generated to please AI recommendation systems, potentially marginalizing human creators. Jeff Allen of the Integrity Institute told Bloomberg this res",
        "id": 2639183,
        "language": null,
        "link": "https://slashdot.org/story/25/05/09/088238/ai-generated-slop-threatens-internet-ecosystem-researchers-warn?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI-Generated 'Slop' Threatens Internet Ecosystem, Researchers Warn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T13:56:36.310384+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: Education giant Pearson suffered a cyberattack, allowing threat actors to steal corporate data and customer information, BleepingComputer has learned. Pearson is a UK-based education company and one of the world's largest providers of academic publishing, digital learning tools, and standardized assessments. The company works with schools, universities, and individuals in over 70 countries through its print and online services. In a statement to BleepingComputer, Pearson confirmed they suffered a cyberattack and that data was stolen, but stated it was mostly \"legacy data.\"\n \n\"We recently discovered that an unauthorized actor gained access to a portion of our systems,\" a Pearson representative confirmed to BleepingComputer. \"Once we identified the activity, we took steps to stop it and investigate what happened and what data was affected with forensics experts. We also supported law enforcement's investigation. We have taken st",
        "id": 2638568,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/09/0146239/education-giant-pearson-hit-by-cyberattack-exposing-customer-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Education Giant Pearson Hit By Cyberattack Exposing Customer Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T11:45:15.224319+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T11:00:00+00:00",
        "description": "Facing deep staffing cuts, the IRS plans to lean heavily on AI to maintain tax collection efforts, with Treasury Secretary Scott Bessent stating that smarter IT and the \"AI boom\" will offset reductions in revenue enforcement staff. The Register reports: When asked by Congressman Steny Hoyer (D-MD) whether proposed reductions in the IRS's IT budget, along with plans to cut additional staff, would affect the agencies ability to collect tax revenue, Bessent said it wouldn't, thanks to the current \"AI boom.\" \"I believe through smarter IT, through this AI boom, that we can use that to enhance collections,\" Bessent told Hoyer and the Committee (24:29 into the video linked [here]). \"I expect collections would continue to be very robust as they were this year.\"\n \nBessent's comments didn't explain how the IRS intends to deploy AI. Given how much it has slashed its enforcement staff since Trump took office, the agency definitely needs to do something. [...] Bessent's comments didn't explain how",
        "id": 2637511,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/09/0138207/irs-hopes-to-replace-fired-enforcement-workers-with-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "IRS Hopes To Replace Fired Enforcement Workers With AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T09:35:51.426557+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T09:30:00+00:00",
        "description": "Instagram's AI chatbots are masquerading as licensed therapists, complete with fabricated credentials and license numbers, according to an investigation by 404 Media. When questioned, these user-created bots from Meta's AI Studio platform provide detailed but entirely fictional qualifications, including nonexistent license numbers, accreditations, and practice information. \n\nUnlike Character.AI, which displays clear disclaimers that its therapy bots aren't real professionals, Meta's chatbots feature only a generic notice stating \"Messages are generated by AI and may be inaccurate or inappropriate\" at the bottom of conversations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Instagram's+AI+Chatbots+Lie+About+Being+Licensed+Therapists%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F09%2F0133200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"s",
        "id": 2636586,
        "language": null,
        "link": "https://slashdot.org/story/25/05/09/0133200/instagrams-ai-chatbots-lie-about-being-licensed-therapists?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Instagram's AI Chatbots Lie About Being Licensed Therapists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T07:18:41.839989+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T07:00:00+00:00",
        "description": "schwit1 shares a report from Behind The Black: Almost immediately after India's government issued this week new tightened regulations for allowing private satellite constellations to sell their services in India, it also apparently completed negotiations with SpaceX to allow it to sell Starlink in India based on these rules. Business Today reports: \"According to sources, the DoT [Department of Transportation] granted the LoI [Letter of Intent] after Starlink accepted 29 strict security conditions, including requirements for real-time terminal tracking, mandatory local data processing, legal interception capabilities, and localisation of at least 20% of its ground segment infrastructure within the first few years of operation.\n Starlink's nod came amid heightened national security sensitivities, coinciding with India's pre-dawn Operation Sindoor strikes on terror camps across the border in response to the Pahalgam massacre. However, DoT officials clarified that the decision to approve ",
        "id": 2635928,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/09/0130212/spacex-gets-approval-to-sell-starlink-in-india?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SpaceX Gets Approval To Sell Starlink In India",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T06:13:48.582163+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T05:30:00+00:00",
        "description": "Alexander Mashinsky, the former CEO of Celsius Network, was sentenced to 12 years in prison on Thursday after pleading guilty to two counts of fraud, a dramatic fall for the leader of a company once hailed as the \"bank\" of the crypto industry. From a report: Standing before U.S. District Judge John G. Koeltl in Manhattan's Southern District, Mashinsky faced the consequences of what prosecutors described as a sweeping scheme to defraud investors. In December he pleaded guilty to commodities fraud and a scheme to manipulate the Celsius token. \n\nHis sentencing took place in courtroom 14A at 500 Pearl Street -- a venue that has seen several crypto executives-turned-felons. Mashinsky's legal troubles began in 2023 when he was arrested on charges of securities, commodities, and wire fraud, just as Celsius reached a $4.7 billion settlement with the Federal Trade Commission -- one of the largest in the FTC's history.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashp",
        "id": 2635655,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/09/0124204/celsius-ceo-mashinsky-sentenced-to-12-years-in-multi-billion-dollar-crypto-fraud-case?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Celsius CEO Mashinsky Sentenced To 12 Years in Multi-Billion-Dollar Crypto Fraud Case",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T04:02:34.159729+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from CNN: The National Oceanic and Atmospheric Administration announced Thursday its well-known \"billion-dollar weather and climate disasters\" database \"will be retired,\" a move that will make it next to impossible for the public to track the cost of extreme weather and climate events. The weather, climate and oceans agency is also ending other products, it has recently announced, due in large part to staffing reductions. NOAA is narrowing the array of services it provides, with climate-related programs scrutinized especially closely.\n \nThe disasters database, which will be archived but no longer updated beyond 2024, has allowed taxpayers, media and researchers to track the cost of natural disasters -- spanning extreme events from hurricanes to hailstorms -- since 1980. Its discontinuation is another Trump-administration blow to the public's view into how fossil fuel pollution is changing the world around them and making extreme weather more costly.",
        "id": 2635151,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/08/203254/noaa-retires-extreme-weather-database?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NOAA Retires Extreme Weather Database",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T02:57:37.029258+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T02:00:00+00:00",
        "description": "Alibaba Group researchers have developed \"ZeroSearch,\" a technique that enables large language models to acquire search capabilities without using external search engines during training. The approach transforms LLMs into retrieval modules through supervised fine-tuning and employs a \"curriculum-based rollout strategy\" that gradually degrades generated document quality. \n\nIn tests across seven question-answering datasets, ZeroSearch matched or exceeded the performance [PDF] of models trained with real search engines. A 7B-parameter retrieval module achieved results comparable to Google Search, while a 14B-parameter version outperformed it. The cost savings are substantial: training with 64,000 search queries using Google Search via SerpAPI would cost approximately $586.70, compared to just $70.80 using a 14B-parameter simulation LLM on four A100 GPUs -- an 88% reduction. \n\nThe technique works with multiple model families including Qwen-2.5 and LLaMA-3.2. Researchers have released thei",
        "id": 2634954,
        "language": null,
        "link": "https://slashdot.org/story/25/05/09/0113217/alibabas-zerosearch-teaches-ai-to-search-without-search-engines-cuts-training-costs-by-88?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Alibaba's ZeroSearch Teaches AI To Search Without Search Engines, Cuts Training Costs By 88%",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-09T01:52:18.742080+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-09T01:00:00+00:00",
        "description": "President Trump on Thursday attacked a law signed by President Joe Biden aimed at expanding high-speed internet access, calling the effort \"racist\" and \"totally unconstitutional\" and threatening to end it \"immediately.\" The New York TimesL: Mr. Trump's statement was one of the starkest examples yet of his slash-and-burn approach to dismantling the legacy of his immediate predecessor in this term in office. The Digital Equity Act, a little-known effort to improve high-speed internet access in communities with poor access, was tucked into the $1 trillion bipartisan infrastructure bill that Mr. Biden signed into law early in his presidency. \n\nThe act was written to help many different groups, including veterans, older people and disabled and rural communities. But Mr. Trump, using the incendiary language that has been a trademark of his political career, denounced the law on Thursday for also seeking to improve internet access for ethnic and racial minorities, raging in a social media po",
        "id": 2634752,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/09/0059239/trump-to-end-biden-era-high-speed-internet-program?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump To End Biden-Era High-Speed Internet Program",
        "vote": 0
    }
]