[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T23:17:31.113578+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T22:19:00+00:00",
        "description": "Graphic designer Lisa Carstens \"spends a good portion of her day working with startups and individual clients looking to fix their botched attempts at AI-generated logos,\" reports NBC News:\n\nSuch gigs are part of a new category of work spawned by the generative AI boom that threatened to displace creative jobs across the board: Anyone can now write blog posts, produce a graphic or code an app with a few text prompts, but AI-generated content rarely makes for a satisfactory final product on its own... Fixing AI's mistakes is not their ideal line of work, many freelancers say, as it tends to pay less than traditional gigs in their area of expertise. But some say it's what helps pay the bills.... \n\nAs companies struggle to figure out their approach to AI, recent data provided to NBC News from freelance job platforms Upwork, Freelancer and Fiverr also suggest that demand for various types of creative work surged this year, and that clients are increasingly looking for humans who can work ",
        "id": 3464978,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/31/2216231/humans-are-being-hired-to-make-ai-slop-look-less-sloppy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Humans Are Being Hired to Make AI Slop Look Less Sloppy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T22:08:22.358072+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T21:11:00+00:00",
        "description": "The U.S. government site climate.gov offered years' worth of climate-science information &mdash; until its production team was fired earlier this summer. The site \"is technically still online, but has been intentionally buried by the team of political appointees who now run the National Oceanic and Atmospheric Administration,\" reports the Guardian. \n\nBut now \"a team of climate communication experts &mdash; including many members of the former climate.gov team &mdash; is working to resurrect its content into a new organization with an expanded mission.\"\n\nTheir effort's new website, climate.us, would not only offer public-facing interpretations of climate science, but could also begin to directly offer climate-related services, such as assisting local governments with mapping increased flooding risk due to climate change. The effort is being led by climate.gov's former managing editor, Rebecca Lindsey, who, although now unemployed, has recruited several of her former colleagues to volun",
        "id": 3464592,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/31/219220/former-us-government-site-climategov-attempts-relaunch-as-non-profit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Former US Government Site Climate.Gov Attempts Relaunch as Non-Profit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T22:08:22.473663+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T19:27:00+00:00",
        "description": "\"A class of drugs called beta-blockers &mdash; used for decades as a first-line treatment after a heart attack &mdash; doesn't benefit the vast majority of patients,\" reports CNN. And in fact beta-blockers \"may contribute to a higher risk of hospitalization and death in some women but not in men, according to groundbreaking new research...\"\n\n\nWomen with little heart damage after their heart attacks who were treated with beta-blockers were significantly more likely to have another heart attack or be hospitalized for heart failure &mdash; and nearly three times more likely to die &mdash; compared with women not given the drug, according to a study published in the European Heart Journal and also scheduled to be presented Saturday at the European Society of Cardiology Congress in Madrid... The findings, however, only applied to women with a left ventricular ejection fraction above 50%, which is considered normal function, the study said. Ejection fraction is a way of measuring how well t",
        "id": 3464593,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/31/1854245/beta-blockers-for-heart-attack-survivors-may-have-no-benefit-for-most-could-actually-harm-women?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Beta Blockers for Heart Attack Survivors: May Have No Benefit for Most, Could Actually Harm Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T18:42:13.762994+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T18:27:00+00:00",
        "description": "\"AI web crawlers are strip-mining the web in their perpetual hunt for ever more content to feed into their Large Language Model mills,\" argues Steven J. Vaughan-Nichols at the Register. \n\nAnd \"when AI searchbots, with Meta (52% of AI searchbot traffic), Google (23%), and OpenAI (20%) leading the way, clobber websites with as much as 30 Terabits in a single surge, they're damaging even the largest companies' site performance...\"\n\nHow much traffic do they account for? According to Cloudflare, a major content delivery network (CDN) force, 30% of global web traffic now comes from bots. Leading the way and growing fast? AI bots... Anyone who runs a website, though, knows there's a huge, honking difference between the old-style crawlers and today's AI crawlers. The new ones are site killers. Fastly warns that they're causing \"performance degradation, service disruption, and increased operational costs.\" Why? Because they're hammering websites with traffic spikes that can reach up to ten or ",
        "id": 3463765,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/31/1820249/are-ai-web-crawlers-destroying-websites-in-their-hunt-for-training-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are AI Web Crawlers 'Destroying Websites' In Their Hunt for Training Data?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T17:37:10.049365+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T17:27:00+00:00",
        "description": "\"I'm still teaching at Princeton,\" 83-year-old Brian Kernighan recently told an audience at New Jersey's InfoAge Science and History Museums. \n\nAnd last month the video was uploaded to YouTube, a new article points out, \"showing that his talk ended with a unique question-and-answer session that turned almost historic...\"\n\n\"Do you think there's any sort of merit to Rust replacing C?\" one audience member asked... \"Or is this just a huge hype bubble that's waiting to die down...?\" \n\n'\"I have written only one Rust program, so you should take all of this with a giant grain of salt,\" he said. \"And I found it a &mdash; pain... I just couldn't grok the mechanisms that were required to do memory safety, in a program where memory wasn't even an issue!\" Speaking of Rust, Kernighan said \"The support mechanism that went with it &mdash; this notion of crates and barrels and things like that &mdash; was just incomprehensibly big and slow. And the compiler was slow, the code that came out was slow...",
        "id": 3463418,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/30/044226/what-happened-when-unix-co-creator-brian-kernighan-tried-rust?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happened When Unix Co-Creator Brian Kernighan Tried Rust?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T16:31:04.749060+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T15:34:00+00:00",
        "description": "\"According to a new study, wearing the right kind of perfume or cologne can enlarge your brain's gray matter,\" writes ScienceAlert\n\n\nResearchers from Kyoto University and the University of Tsukuba in Japan asked 28 women to wear a specific rose scent oil on their clothing for a month, with another 22 volunteers enlisted as controls who put on plain water instead. Magnetic resonance imaging ( MRI) scans showed boosts in the gray matter volume of the rose scent participants. \n\nWhile an increase in brain volume doesn't necessarily translate into more thinking power, the findings could have implications for neurodegenerative conditions such as dementia. \"This study is the first to show that continuous scent inhalation changes brain structure,\" write the researchers in their published paper. We've seen scents like this improve memory and cognitive performance, but here the team wanted to try a longer-term experiment to see how triggering our sense of smell might lead to measurable changes ",
        "id": 3463094,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/31/0621235/smelling-this-one-specific-scent-can-boost-the-brains-gray-matter?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Smelling This One Specific Scent Can Boost the Brain's Gray Matter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T15:27:19.229626+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T14:34:00+00:00",
        "description": "There's something rare about a snail named Ned, reports CNN:\nNed's shell spirals left, while almost all other snails have right spiraling shells. It's a one in 40,000 genetic condition among the common corno espersum... \"I was quite breathless for a moment,\" says Giselle Clarkson, an author, illustrator and self-described 'observologist' who found Ned while digging in her garden in Wairarapa, just north of capital Wellington. \"I was just pulling out this plant, and a snail tumbled into the dirt and I was just about to scoop it up and just chuck it off to the side, when I realized what I had,\" Clarkson told CNN. It was a serendipitous moment for Ned, now named for Homer Simpson's left-handed neighbor. Clarkson was aware of this rare asymmetry in snails from her work with the magazine New Zealand Geographic. \n\nBut \"should Ned hope to mate one day, it will have to be with another very rare left-coiled snail,\" notes the Washington Post (since, as CNN points out, this snail's reproductive ",
        "id": 3462649,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/30/054244/rare-snail-has-a-1-in-40000-chance-of-finding-a-mate-new-zealand-begins-the-search?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rare Snail Has a 1-in-40,000 Chance of Finding a Mate. New Zealand Begins the Search",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T13:16:10.098757+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T11:34:00+00:00",
        "description": "\"A new study released Friday found that young children diagnosed with attention-deficit/hyperactivity disorder, or ADHD, are often prescribed medication too quickly,\" reports CBS News:\n\n\nThe study, led by Stanford Medicine and published in JAMA Network Open, examined the health records of nearly 10,000 preschool-aged children ages 3 to 5 between 2016 and 2023 who were diagnosed with ADHD... The Stanford study found that about 68% of those children who were diagnosed with ADHD were prescribed medications before age 7, most often stimulants such as Ritalin, which can help children focus their attention and regulate their emotions. The turn to medication often came quickly, according to the study. About 42% of the children who were diagnosed with ADHD were prescribed drugs within 30 days of diagnosis, the study found. \n\n\"We don't have concerns about the toxicity of the medications for 4- and 5-year-olds, but we do know that there is a high likelihood of treatment failure, because many fa",
        "id": 3461797,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/31/0430224/study-young-children-diagnosed-with-adhd-often-prescribed-medication-too-quickly?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Study: Young Children Diagnosed with ADHD Often Prescribed Medication Too Quickly",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T13:16:10.224302+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T07:34:00+00:00",
        "description": "The Washington Post covers \"a string of false reports of active shooters at a dozen U.S. universities this month as students returned to campus.\"\n\n\n The FBI is investigating the incidents, according to a spokesperson who declined to specify the nature of the probe. While universities have proved a popular swatting target, the agency \"is seeing an increase in swatting events across the country,\" the FBI spokesperson said... Local officials are frustrated by the anonymous calls tying up first responders, straining public safety budgets and needlessly traumatizing college students who grew up in an era in which gun violence has in some way shaped their school experience... \n\nThe recent string of swattings began Thursday with a false report to the University of Tennessee at Chattanooga, quickly followed by one about Villanova University later that day. Hoaxes at 10 more schools followed... Villanova also received a second threat. As the calls about shootings came in, officials on many of ",
        "id": 3461798,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/31/0520222/swatting-hits-a-dozen-us-universities-the-fbi-is-investigating?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Swatting' Hits a Dozen US Universities. The FBI is Investigating",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T06:29:57.089457+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T04:34:00+00:00",
        "description": "In 2017 Rick Beato streamed \"Rick's Rant Episode 2\" &mdash; and just received a copyright claim this month. Days after jazz pianist Chick Corea died in 2021, Beato livestreamed a half-hour video which was mostly commentary, but with several excerpts from Corea's albums (at least one more than three minutes long). He also received a copyright claim for that one this August &mdash; just minutes after the claim on his 2017 video. \nThese videos \"are all fair use,\" Beato argues in a new video, noting it's also affected other popular YouTube channels like The Professor of Rock:\n\n Rick Beato: Universal Music Group [UMG] has continued to send emails about copyright content ID claims &mdash; and now copyright strikes &mdash; on my channel. As a matter of fact, I have three shorts &mdash; these are under a minute long &mdash; that if they go through in the next four days, I'll have three strikes on my channel! Now if you don't fight these things, those three strikes would actually remove my cha",
        "id": 3460171,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/08/31/045201/rick-beato-vs-umg-fighting-copyright-claims-over-music-clips-on-youtube?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rick Beato vs UMG: Fighting Copyright Claims Over Music Clips on YouTube",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-31T06:29:57.204323+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-31T01:34:00+00:00",
        "description": "\"For months, tens of thousands of people around the world have been complaining Meta has been banning their Instagram and Facebook accounts in error...\" the BBC reported this month...\n\nMore than 500 of them have contacted the BBC to say they have lost cherished photos and seen businesses upended &mdash; but some also speak of the profound personal toll it has taken on them, including concerns that the police could become involved. \nMeta acknowledged a problem with the erroneous banning of Facebook Groups in June, but has denied there is wider issue on Facebook or Instagram at all. It has repeatedly refused to comment on the problems its users are facing &mdash; though it has frequently overturned bans when the BBC has raised individual cases with it. \nOne examples is a woman lost the Instagram profile for her boutique dress shop. (\"Over 5,000 followers, gone in an instant.\") \"After the BBC sent questions about her case to Meta's press office, her Instagram accounts were reinstated... ",
        "id": 3460172,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/31/015202/what-made-meta-suddenly-ban-tens-of-thousands-of-accounts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Made Meta Suddenly Ban Tens of Thousands of Accounts?",
        "vote": 0
    }
]