[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T00:00:22.833560+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T23:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Record: Russian telecom operators have begun cutting mobile internet access for 24 hours for citizens returning to the country from abroad, in what officials say is an effort to prevent Ukrainian drones from using domestic SIM cards for navigation. \"When a SIM card enters Russia from abroad, the user has to confirm that it's being used by a person -- not installed in a drone,\" the Digital Development Ministry said in a statement earlier this week.\n \nUsers can restore access sooner by solving a captcha or calling their operator for identification. Authorities said the temporary blackout is meant to \"ensure the safety of Russian citizens\" and prevent SIM cards from being embedded in \"enemy drones.\" The new rule has led to unexpected outages for residents in border regions, whose phones can automatically connect to foreign carriers. Officials advised users to switch to manual network selection to avoid being cut off.<p><div class=\"share_submis",
        "id": 4073418,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/14/2153236/russia-imposes-24-hour-mobile-internet-blackout-for-travelers-returning-home",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russia Imposes 24-Hour Mobile Internet Blackout For Travelers Returning Home",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T22:59:52.602876+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T22:50:00+00:00",
        "description": "BrianFagioli writes: Logitech has confirmed a cybersecurity breach after an intruder exploited a zero-day in a third-party software platform and copied internal data. The company says the incident did not affect its products, manufacturing or business operations, and it does not believe sensitive personal information like national ID numbers or credit card data were stored in the impacted system. The attacker still managed to pull limited information tied to employees, consumers, customers and suppliers, raising fair questions about how long the zero-day existed before being patched.\n \nLogitech brought in outside cybersecurity firms, notified regulators and says the incident will not materially affect its financial results. The company expects its cybersecurity insurance policy to cover investigation costs and any potential legal or regulatory issues. Still, with zero-day attacks increasing across the tech world, even established hardware brands are being forced to acknowledge uncomfo",
        "id": 4073158,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/14/2140205/logitech-reports-data-breach-from-zero-day-software-vulnerability",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Logitech Reports Data Breach From Zero-Day Software Vulnerability",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T22:59:52.770050+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T22:10:00+00:00",
        "description": "According to CNBC, JPMorgan Chase has secured deals ensuring it will get paid by the fintech firms responsible for nearly all the data requests made by third-party apps connected to customer bank accounts. From the report: The bank has signed updated contracts with the fintech middlemen that make up more than 95% of the data pulls on its systems, including Plaid, Yodlee, Morningstar and Akoya, according to JPMorgan spokesman Drew Pusateri. \"We've come to agreements that will make the open banking ecosystem safer and more sustainable and allow customers to continue reliably and securely accessing their favorite financial products,\" Pusateri said in a statement. \"The free market worked.\"\n \nThe milestone is the latest twist in a long-running dispute between traditional banks and the fintech industry over access to customer accounts. For years, middlemen like Plaid paid nothing to tap bank systems when a customer wanted to use a fintech app like Robinhood to draw funds or check balances. ",
        "id": 4073160,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/14/2135239/jpmorgan-chase-wins-fight-with-fintech-firms-over-fees-to-access-customer-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "JPMorgan Chase Wins Fight With Fintech Firms Over Fees To Access Customer Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T21:58:00.913829+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T21:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Thursday evening, OpenAI CEO Sam Altman posted on X that ChatGPT has started following custom instructions to avoid using em dashes. \"Small-but-happy win: If you tell ChatGPT not to use em-dashes in your custom instructions, it finally does what it's supposed to do!\" he wrote.\n \nThe post, which came two days after the release of OpenAI's new GPT-5.1 AI model, received mixed reactions from users who have struggled for years with getting the chatbot to follow specific formatting preferences. And this \"small win\" raises a very big question: If the world's most valuable AI company has struggled with controlling something as simple as punctuation use after years of trying, perhaps what people call artificial general intelligence (AGI) is farther off than some in the industry claim. \"The fact that it's been 3 years since ChatGPT first launched, and you've only just now managed to make it obey this simple requirement, says a lot about",
        "id": 4072726,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/14/2129248/sam-altman-celebrates-chatgpt-finally-following-em-dash-formatting-rules",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sam Altman Celebrates ChatGPT Finally Following Em Dash Formatting Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:53:58.498330+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T18:05:00+00:00",
        "description": "An anonymous reader shares a report: Executives are turning to a novel structure to fund crypto accumulation vehicles as investor appetite thins. They're called in-kind contributions, and they now account for a growing share of digital-asset treasury, or DAT, deals. Instead of raising cash to buy tokens in the open market, DAT sponsors contribute large slugs of their own crypto, often unlisted and hard to value. \n\nDigital-asset treasuries are a new breed of public company built to hold concentrated crypto positions. The structure surged in 2025 as small-cap firms, especially in biotech and mining, reinvented themselves as digital-asset proxies. Sponsors provide tokens or raise money to buy them, and the stock then trades as a kind of listed bet on crypto. For insiders, it's a shortcut to liquidity. For investors, a wager on upside. But not all DATs carry the same level of risk. Earlier deals raised money to buy tokens through regular markets, which offered at least some independent pr",
        "id": 4071410,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/14/1739233/retail-traders-left-exposed-in-high-stakes-crypto-treasury-deals",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Retail Traders Left Exposed in High-Stakes Crypto Treasury Deals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:53:37.067215+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:24:00+00:00",
        "description": "Pay television penetration in American households fell to 50.2% in the third quarter and is projected to drop to 50% or lower by December, according to Madison and Wall, a technology and media advisory firm. Fifteen years ago, nearly nine in ten households subscribed to pay television services. \n\nThe decline has prompted major media companies to shed cable assets. Comcast, Warner Bros. Discovery, and A&amp;E are seeking to sell or spin off their cable television operations. Paramount stated it would not divest its cable channels but acknowledged that \"each quarter is accelerating decline.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Only+Half+the+Homes+in+America+Have+Cable+TV+Anymore%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F11%2F14%2F1715240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.faceboo",
        "id": 4070809,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/14/1715240/only-half-the-homes-in-america-have-cable-tv-anymore",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Only Half the Homes in America Have Cable TV Anymore",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:53:37.294258+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:48:00+00:00",
        "description": "TV manufacturers are abandoning their attempts to turn TVs into interactive social devices through smart cameras. Sky announced this month that it will discontinue Sky Live, a camera accessory for its Sky Glass televisions that brought video calls, body-tracked workouts, and motion games to the living room. The device will stop working at the beginning of December. Sky will brick the cameras and reimburse customers. Sky launched the product in mid-2023 as part of an effort to transform televisions from passive viewing devices into interactive platforms. \n\nThat vision has not materialized across the industry. LG's Smart Cam, released in 2023, is out of stock at major retailers and appears discontinued. TCL's smart TV camera is no longer available. Samsung stopped integrating cameras directly into its television sets, though it still sells an external camera accessory.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wh",
        "id": 4070810,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/14/1648232/where-have-all-the-tv-cameras-gone",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Where Have All the TV Cameras Gone?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T16:51:33.362131+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:02:00+00:00",
        "description": "Cryptocurrency companies and fintech startups are applying to open banks in the United States. Ripple, Coinbase and the UK payments company Wise have submitted applications for national trust charters this year. Trust banks cannot take deposits or make loans but charge fees for safekeeping customer assets and are not FDIC insured. The applications have reached 12 so far this year, more than any of the preceding eight years, according to data compiled by Klaros Group. \n\nComptroller of the Currency Jonathan Gould said last month that cryptocurrency activity should be done within the banking system if legally permissible and safe. His agency regulates nationally-chartered U.S. banks. The Bank Policy Institute and the Independent Community Bankers of America oppose the applications. BPI sent letters urging the Office of the Comptroller of the Currency to reject the Ripple, Wise, and Sony applications. The group said approving Coinbase could significantly increase risks to the U.S. financi",
        "id": 4070293,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/14/1233226/why-every-company-suddenly-wants-to-become-a-bank",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Every Company Suddenly Wants To Become a Bank",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T15:49:41.008042+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T15:20:00+00:00",
        "description": "An anonymous reader shares a report: In October, PUBG and Subnautica 2 publisher Krafton announced that it would be undergoing a \"complete reorganization\" to become an \"AI-first\" company, planning to invest over 130 billion won ($88 million) in agentic AI infrastructure and deployment beginning in 2026. This week, as it boasts record-breaking quarterly profits, the Korean publisher has followed that strategic shift by launching a voluntary resignation program for its domestic employees, according to Business Korea reporting. \n\nThe program, announced internally, offers substantial buyouts for domestic Krafton employees based on their length of employment at the publisher. Severance packages range from 6 months' salary for employees with one year or less of service to 36 months' salary for employees who've worked at Krafton for over 11 years. The voluntary resignation program follows a November 4 earnings call in which Krafton announced a record quarterly profit of $717 million. During ",
        "id": 4069679,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/14/1118241/krafton-launches-voluntary-resignation-program-weeks-after-declaring-ai-first-company-future",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Krafton Launches Voluntary Resignation Program Weeks After Declaring 'AI-First Company' Future",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T15:49:41.426434+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T14:40:00+00:00",
        "description": "One of the most common viruses in the world could be the cause of lupus, an autoimmune disease with wide-ranging symptoms, according to a new study. From a report: Until now, lupus was somewhat mysterious: No single root cause of the disease had been found, and while there is no cure, there are medications that can treat it. \n\nThe research, published in the journal Science Translational Medicine, suggests that Epstein-Barr virus -- which 95% of people acquire at some point in life -- could cause lupus by driving the body to attack its own healthy cells. \n\nIt adds to mounting evidence that Epstein-Barr is associated with multiple long-term health issues, including other autoimmune conditions. As this evidence stacks up, scientists have accelerated calls for a vaccine that targets the virus. \n\n\"If we now better understand how this fastidious virus is responsible for autoimmune diseases, I think it's time to figure out how to prevent it,\" said Dr. Anca Askanase, clinical director of the ",
        "id": 4069680,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/14/0836231/all-lupus-cases-may-be-linked-to-a-common-virus-study-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "All Lupus Cases May Be Linked To a Common Virus, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T14:42:17.082275+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T14:00:00+00:00",
        "description": "Abstract of a working paper [PDF] published by NBER: This paper examines the impact of the UK's decision to leave the European Union (Brexit) in 2016. Using almost a decade of data since the referendum, we combine simulations based on macro data with estimates derived from micro data collected through our Decision Maker Panel survey. These estimates suggest that by 2025, Brexit had reduced UK GDP by 6% to 8%, with the impact accumulating gradually over time. \n\nWe estimate that investment was reduced by between 12% and 18%, employment by 3% to 4% and productivity by 3% to 4%. These large negative impacts reflect a combination of elevated uncertainty, reduced demand, diverted management time, and increased misallocation of resources from a protracted Brexit process. Comparing these with contemporary forecasts -- providing a rare macro example to complement the burgeoning micro-literature of social science predictions -- shows that these forecasts were accurate over a 5-year horizon, but",
        "id": 4069074,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/14/080207/the-economic-impact-of-brexit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Economic Impact of Brexit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T13:40:41.430163+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Singapore's central bank will hold trials to issue tokenized MAS bills next year and bring in laws to regulate stablecoins as it presses forward with plans to build a scalable and secure tokenised financial ecosystem, the bank's top official said on Thursday. \"Tokenization has lifted off the ground. But have asset-backed tokens achieved escape velocity? Not yet,\" said Chia Der Jiun, Managing Director of the Monetary Authority of Singapore (MAS), a keynote address at the Singapore FinTech Festival.\n \nHe said MAS has been working on the details of its stablecoin regulatory regime and will prepare draft legislation, with the emphasis on \"sound reserve backing and redemption reliability.\"\nMAS is also supporting trials under the BLOOM initiative, which explores the use of tokenized bank liabilities and regulated stablecoins for settlement, he added. \"In the CBDC space, I am pleased to announce that the three Singapore banks, DBS, OCBC, and ",
        "id": 4068543,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/14/0412216/singapore-to-trial-tokenized-bills-bring-in-stablecoin-laws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Singapore To Trial Tokenized Bills, Bring In Stablecoin Laws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T10:37:18.038034+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T10:00:00+00:00",
        "description": "According to Car and Driver, Hyundai has suffered a data breach that leaked the personal data of up to 2.7 million customers. The leak reportedly took place in February from Hyundai AutoEver, the company's IT affiliate. It includes customer names, driver's license numbers, and social security numbers. Longtime Slashdot reader sinij writes: Thanks to tracking modules plaguing most modern cars, that data likely includes the times and locations of customers' vehicles. These repeated breaches make it clear that, unlike smartphone manufacturers that are inherently tech companies, car manufacturers collecting your data are going to keep getting breached and leaking it.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Hyundai+Data+Breach+May+Have+Leaked+Drivers'+Personal+Information%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F11%2F14%2F0424237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.co",
        "id": 4067246,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/14/0424237/hyundai-data-breach-may-have-leaked-drivers-personal-information",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hyundai Data Breach May Have Leaked Drivers' Personal Information",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T07:35:10.724091+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T07:00:00+00:00",
        "description": "Amazon announced that its satellite broadband project called Project Kuiper will now be known as Amazon Leo. GeekWire reports: Leo is a nod to \"low Earth orbit,\" where Amazon has so far launched more than 150 satellites as part of a constellation that will eventually include more than 3,200. In a blog post, Amazon said the 7-year-old Project Kuiper began \"with a handful of engineers and a few designs on paper\" and like most early Amazon projects \"the program needed a code name.\" The team was inspired by the Kuiper Belt, a ring of asteroids in the outer solar system.\n \nA new website for Amazon Leo proclaims \"a new era of internet is coming,\" as Amazon says its satellites can help serve \"billions of people on the planet who lack high-speed internet access, and millions of businesses, governments, and other organizations operating in places without reliable connectivity.\" Amazon said it will begin rolling out service once it's added more coverage and capacity to the network. Details abou",
        "id": 4066373,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/14/0416257/amazon-renames-project-kuiper-satellite-internet-venture-to-leo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Renames 'Project Kuiper' Satellite Internet Venture To 'Leo'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T03:33:19.451389+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: The world is still on track for a catastrophic 2.6C increase in temperature as countries have not made sufficiently strong climate pledges, while emissions from fossil fuels have hit a record high, two major reports have found. Despite their promises, governments' new emission-cutting plans submitted for the Cop30 climate talks taking place in Brazil have done little to avert dangerous global heating for the fourth consecutive year, according to the Climate Action Tracker update (PDF).\n \nThe world is now anticipated to heat up by 2.6C above preindustrial times by the end of the century -- the same temperature rise forecast last year. This level of heating easily breaches the thresholds set out in the Paris climate pact, which every country agreed to, and would set the world spiraling into a catastrophic new era of extreme weather and severe hardships. A separate report found the fossil fuel emissions driving the climate crisis wil",
        "id": 4065329,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/13/2327240/world-still-on-track-for-catastrophic-26c-temperature-rise-report-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World Still On Track For Catastrophic 2.6C Temperature Rise, Report Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T02:32:36.849306+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T01:30:00+00:00",
        "description": "Netflix is launching a new slate of TV-streamed party games that are all playable using your phone as the controller. The Verge reports: To start, Netflix is offering Boggle Party, Party Crasher: Fool Your Friends, Lego Party, Pictionary: Game Night, and Tetris Time Warp. A social deduction game based on the Knives Out series, Dead Man's Party: A Knives Out Game, is also part of this new slate but will launch at a later time. The streaming platform's approach to gaming has been unfocused, with the company bouncing between being a boutique development studio while also being a platform for premium and exclusive mobile gaming experiences. Offering party games on your TV seems like a better fit -- one that could allow Netflix to finally find its gaming footing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Netflix's+New+Era+of+TV+Games+Starts+Now%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F11%2F13%2F2333224%2F%",
        "id": 4065111,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/13/2333224/netflixs-new-era-of-tv-games-starts-now",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Netflix's New Era of TV Games Starts Now",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T01:32:07.547005+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T00:50:00+00:00",
        "description": "Xpeng's flying-car subsidiary Aridge has begun trial production at the world's first dedicated flying-car factory in Guangzhou. Euronews reports: The 120,000-square-meter facility has produced its first detachable eVTOL aircraft for the modular \"Land Aircraft Carrier.\" With an annual capacity of up to 10,000 modules, the factory will eventually assemble one aircraft every 30 minutes. Trial operations focus on process verification, equipment testing, and producing prototypes for airworthiness certification before moving into mass production.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=World's+First+Flying+Car+Factory+Begins+Production+In+China%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F13%2F2315231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2",
        "id": 4064851,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/2315231/worlds-first-flying-car-factory-begins-production-in-china",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World's First Flying Car Factory Begins Production In China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T00:31:35.068327+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: As generative AI content starts to fill our social apps, a project to bring back Vine's six-second looping videos is launching with Twitter co-founder Jack Dorsey's backing. On Thursday, a new app called diVine will give access to more than 100,000 archived Vine videos, restored from an older backup that was created before Vine's shutdown. The app won't just exist as a walk down memory lane; it will also allow users to create profiles and upload their own new Vine videos. However, unlike on traditional social media, where AI content is often haphazardly labeled, diVine will flag suspected generative AI content and prevent it from being posted. According to TechCrunch, a volunteer preservation group called the Archive Team saved Vine's content when it shut down in 2016. The only problem was that everything was stored in massive 40-50 GB binary blob files that were basically unusable for casual viewing.\n \nEvan Henshaw-Plath (who goes ",
        "id": 4064564,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/13/2247206/jack-dorsey-funds-divine-a-vine-reboot-that-includes-vines-video-archive",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jack Dorsey Funds diVine, a Vine Reboot That Includes Vine's Video Archive",
        "vote": 0
    }
]