[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:30.046772+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T18:00:54+00:00",
        "description": "Psychologist and memory researcher John Wixted challenges the widely held belief that eyewitness testimony is inherently unreliable in criminal investigations, and explains the importance of uncontaminated memory tests.\n\nJohn Wixted is a Distinguished Professor in the Department of Psychology at UC San Diego. He earned his Ph.D. in clinical psychology from Emory University in 1987 and has been a professor at UC San Diego ever since. His research addresses fundamental mechanisms of human memory, both in the lab and in the real world. In recent years, his work has focused on signal-detection models of recognition memory, the neuroscience of memory and amnesia, and eyewitness identification. Professionally, he has served as editor-in-chief of Psychonomic Bulletin & Review (1998-2002), and he later edited the 5-volume 4th edition of the venerable Stevens' Handbook of Experimental Psychology and Cognitive Neuroscience (2018). In 2011, he was the recipient of the Howard Crosby Warren Medal ",
        "id": 4071052,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=YhF-L0Z7xEc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YhF-L0Z7xEc/hqdefault.jpg",
        "title": "Can we trust eyewitness memory after all? It’s complicated. | John Wixted | TEDxUCSanDiego",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:30.141209+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:33:39+00:00",
        "description": "Imagine entering the job you have wanted for decades, and two years in, the entire world changes. How would it affect you? How would you create an effect in return? In 2020 Dr. Joe Thomas was still a novice independent hospitalist physician when he was forced to become a leader in the fight against the COVID-19 pandemic, but also the escalating parallel pandemic of misinformation. In this talk, he discusses incorporating science communication into his life outside of patient care, the emotional toll both pandemics have taken on him, and his humanistic approach to connection and education both in person and through TikTok. He finishes with tools everyone can use to sift through and push back against misinformation.   Joseph S. Thomas, MD, FHM is a hospitalist physician and science communicator working with patients in Buffalo, NY and serving as a clinical instructor to medical residents and students. He also serves as one of the Digital Media Editors for the Journal of Hospital Medicin",
        "id": 4071053,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=foaTUq40Dmc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/foaTUq40Dmc/hqdefault.jpg",
        "title": "Fighting The Pandemic of Misinformation | Joseph S. Thomas, MD, FHM | TEDxBuffalo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:30.237877+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:33:05+00:00",
        "description": "Hajiya Afiiya, a grandmother whose wisdom is shaped by decades of lived experience, invites us to rediscover the simple but powerful truth of being ourselves. In a world obsessed with comparison, pressure, and becoming what others expect, she reminds us that authenticity is the greatest gift we can give both to ourselves and the people around us.\n\nDrawing from her personal journey of raising a family, witnessing generational change, and gathering insight from life’s quiet lessons, Hajiya Afiiya shares why embracing who you truly are leads to peace, clarity, and purpose. Her message is warm, grounding, and deeply human—an invitation for young people to stop performing and start living.\n\nThis talk is a beautiful reminder that confidence begins the moment you choose yourself. Hajiya Affiyah Dalhatu is a highly accomplished philanthropist, entrepreneur, and advocate for girls' education and women's empowerment. With a degree in Special Education and over 10 diplomas in various fields, she",
        "id": 4071054,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MIgA71luzBI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MIgA71luzBI/hqdefault.jpg",
        "title": "The Freedom of Being Yourself | Affiyah Dalhatu | TEDxIntercontinental Schools Kano",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:30.332254+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:31:58+00:00",
        "description": "After loss and disaster, grief often arrives uninvited. In this moving talk, Nick Stentzel invites us to make peace with grief—learning to live alongside it, honor it, and hold space for one another. Nick Stentzel is a certified Grief Educator and grief coach focusing on widowhood. He also serves as a group facilitator and journey sitter, supporting individuals through transformative experiences.\n\nThrough Soaring Spirits International, Nick frequently presents at national workshops, covering topics such as creativity and healing, love after loss, men’s grief, and support for the newly widowed.\n\nNick is the owner and Chief Creative Officer of The ATS Team, a multi-national television production company. He is also an award-winning documentary filmmaker and photographer.\n\nNick lives in Altadena with his husband, Jonathan, and their dog, Jeb. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted",
        "id": 4071055,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jfLWbVE-uZE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jfLWbVE-uZE/hqdefault.jpg",
        "title": "Reimagining our Relationship with Grief | Nick Stentzel | TEDxAltadena",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:30.433366+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:31:57+00:00",
        "description": "What do truck stops, brothels, and small-town gas stations reveal about who we are? In this cinematic, soul-searching talk, Ry Shorosky, a trucker, photographer, and filmmaker, shares what a decade on the road taught him about storytelling, masculinity, grief, and grace. From building trust inside a Nevada brothel to witnessing resilience on the edge of nowhere, Shorosky invites us to see America not through headlines, but through human connection.\n\nThis isn’t just about capturing the perfect image. It’s about showing up when the camera’s off - and choosing to listen.\n\nAbout the Speaker:\nRy Shorosky is a long-haul trucker turned photographer and director whose visual storytelling has been featured by Polaroid, Apple, and The New York Times. Blending blue-collar grit with quiet observation, Ry explores overlooked places and the people who inhabit them. His work is rooted in empathy, presence, and the belief that the most powerful stories often live outside the frame. Ry Shorosky is an ",
        "id": 4071056,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Atet3IsCZU8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Atet3IsCZU8/hqdefault.jpg",
        "title": "Outside the Frame: A Long-Haul Trucker's Stories on Roads Less Traveled | Ry Shorosky | TEDxLasVegas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:30.532508+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:31:49+00:00",
        "description": "What if poetry wasn’t just art - but education in motion?\n\nIn this evocative and unapologetically original talk, Dr. Kevin Wright fuses research and rhythm to assert a radical truth: poetry is pedagogy. With powerful verse, personal narrative, and data-driven insight, he unpacks the lived experiences of Black men in higher education, and how traditional academic systems often fail to reflect their realities.\n\nRaised in Las Vegas and shaped by both scholarship and storytelling, Wright challenges us to see poetry not as a supplement to teaching, but as a form of teaching itself. He reveals how verse can debunk stereotypes, center joy, and unlock deeper learning in ways exams and lectures can’t.\n\nAt the intersection of intellect and identity, this talk redefines what it means to educate - and who gets to define knowledge in the first place.\n\nAbout the Speaker: Dr. Kevin L. Wright was raised in the Historic Westside of Las Vegas, NV, grounded in Louisiana southern values and a lineage of ",
        "id": 4071057,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zX9swTJrV4o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zX9swTJrV4o/hqdefault.jpg",
        "title": "Poetry Is Pedagogy: Reimagining How We Teach and Learn | Dr. Kevin Wright | TEDxLasVegas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:30.715350+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:31:29+00:00",
        "description": "What does it really mean to “be a man”? In this raw and riveting spoken word performance, Rodney Lee unpacks how toxic masculinity scripts boys into cycles of violence, repression, and isolation. Drawing from his own life and his work inside Nevada’s only maximum-security juvenile prison, Lee explores how phrases like “man up” become mandates for emotional detachment - with devastating consequences.\n\nThrough poetic storytelling and lived experience, he invites us to redefine strength: not through dominance, but through empathy, vulnerability, and connection. This is more than a reflection - it’s a call to rewrite what we teach boys about manhood before it’s too late.\n\nAbout the Speaker: \nRodney Lee is a poet, educator, and mentor who teaches English at Nevada’s only maximum-security prison for juvenile boys. A fierce advocate for restorative justice and youth empowerment, Lee uses language to break cycles of harm and reimagine identity. His TEDxLasVegas talk is a challenge to society ",
        "id": 4071058,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nvXDNG2Lgdo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nvXDNG2Lgdo/hqdefault.jpg",
        "title": "Man Up: A Poetic Reckoning with Shame, Violence, and Masculine Ideal | Rodney J. Lee | TEDxLasVegas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:30.906720+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:31:21+00:00",
        "description": "What if changing your community was as simple as ordering your favorite taco? Restaurateur Kristin Corral shows how food can be a powerful force for connection, impact, and growth. In this heartwarming and practical talk, she shares how small businesses can reimagine giving, not as a one-off donation, but as a community-first strategy that boosts both revenue and purpose.\n\nFrom personal stories of loss and comfort to scalable strategies any entrepreneur can apply, this talk is a recipe for building brand loyalty, cross-sector partnerships, and meaningful change - one taco at a time.\n\nAbout the Speaker:\nKristin Corral is a Las Vegas-based restaurateur and co-founder of Tacotarian, a fast-growing plant-based Mexican restaurant chain. She’s passionate about food as a tool for community-building and impact. Through creative collaborations with nonprofits, she’s pioneered a model that unites business growth with social good. Corral believes that with the right partnerships, even a taco can",
        "id": 4071059,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Jo7SwGQtmd0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Jo7SwGQtmd0/hqdefault.jpg",
        "title": "How a taco can change the world | Kristen Corral | TEDxLasVegas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:31.069688+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:30:12+00:00",
        "description": "This talk highlights the key points building a business requires. Janie was a Global Account Analyst at LinkedIn, Journalist at CBS, ABC, GQ, New York Magazine, and Businessweek. \nShe is an experienced journalist and public speaker. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4071060,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=f0UVeAfZYIM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/f0UVeAfZYIM/hqdefault.jpg",
        "title": "The Entrepreneur Mindset | Janie Ho | TEDxElmPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:31.327590+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:30:07+00:00",
        "description": "Explore the art and science of bread-making as a profound metaphor for life. This TEDx talk journeys through the five essential ingredients—flour, water, yeast, salt, and time—and reveals how each stage mirrors our human experience: from the struggles of kneading and inner growth during fermentation, to second chances in shaping and transformation in the oven. Discover how bread teaches us patience, resilience, and the beauty of imperfection, culminating in the shared joy of breaking the loaf together. More than food, bread is life’s story of transformation, waiting, and rising. Pioneer baker and co-founder of Lavonne, bringing life lessons from the art of breadmaking. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4071061,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Gb5K_DP1K18",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Gb5K_DP1K18/hqdefault.jpg",
        "title": "Rising with the Dough: Reflections on Bread and Life | Dr. Avin Thaliath | TEDxMVJCE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:31.520431+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:29:53+00:00",
        "description": "The lessons, growth of today, imprints on the future. How are we impacting younger ones today?  He is a dynamic leader and passionate advocate for public safety and youth development. His journey began 25 years ago when he participated in a life-changing Global Kids trip to Croatia, where he worked with Bosnian refugees. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4071062,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_BGqa8HyBZA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_BGqa8HyBZA/hqdefault.jpg",
        "title": "Leaders of Today or Leaders of Tomorrow? | Ranti Ogunleye | TEDxElmPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:31.772497+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:29:51+00:00",
        "description": "This is a flip on how expectations of others are allowed to impact our reality of possibilities and capabilities.  Nika Stewart, bestselling author of “Actually, I Can: Rewriting the Rules of Resilience,” is a celebrated speaker known for her unique blend of humor, vulnerability, and insight. Her journey through cancer, documented online virally, has inspired millions worldwide. \nIn addition, Nika has been a featured speaker and panelist on hundreds of podcasts, webcasts, and masterclasses, reaching hundreds of thousands of attendees. On social media, Nika has attracted hundreds of thousands of followers and received more than 400 million views on her viral videos and posts related to her resilience philosophy. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4071063,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=AHbaJXm6YB8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AHbaJXm6YB8/hqdefault.jpg",
        "title": "The Buzz on Mental Health | Nika Stewart | TEDxElmPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:31.947196+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:29:41+00:00",
        "description": "this talk delves into how we handle different phases in entrepreneurship journey.  Deana is a veteran sales strategist and master connector. She has partnered with high-growth organizations and purpose-driven leaders to build sales and success from the inside out.\nFrom Fortune 500 boardrooms to global summits and women-led retreats, she has taken the stage more than 100 times in the past five years. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4071064,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LQixX9XvCBA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LQixX9XvCBA/hqdefault.jpg",
        "title": "The GAP is the Gift | Deana Jean | TEDxElmPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:32.083321+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:28:58+00:00",
        "description": "This focuses on the power of our mind- possibilities and limitations are first birth in the mind.  Cindy is the founder of Cindy Miller Inc., where she serves as an executive coach, speaker, and certified behavioral specialist. Cindy is \nnamed one of the Top 50 Women Teachers in the U.S. by Golf Digest. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4071065,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=M-cdf-ru0Hk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/M-cdf-ru0Hk/hqdefault.jpg",
        "title": "The Mind Power | Cindy Miller | TEDxElmPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T18:23:32.346787+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T17:28:45+00:00",
        "description": "Preserving curiosity, individuality and creativity in children who grow up to be leaders.  Caren is an empowerment and mindset coach who helps Gen X women break free from self-doubt, perfectionism, and imposter syndrome so they can stop playing small and finally step into the boldest, truest version of themselves.\n\nAs a certified Neuro-Identity Evolution Practitioner,  her signature Unscrew Yourself method—a mix of neuroscience, somatic practices, trauma-informed coaching, and energetics—thelps women rewrite the old narratives running the show, regulate their nervous systems, and step into their full power unapologetically.\nCaren shares her story with raw honesty, humor, and heart—reminding audiences that their worth was never up for debate, and it’s never too late to rewrite the story of who they are. Her mission is simple: to help women stop hiding, own their brilliance, and show up as their fully expressed, badass selves in life and business.\nShe is a mom of 2 young adult children ",
        "id": 4071066,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=v_5NiN9B2RY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/v_5NiN9B2RY/hqdefault.jpg",
        "title": "How to raise curious and confident young people | Caren Cooper | TEDxElmPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:11.295166+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:42:54+00:00",
        "description": "En esta charla, Priscilla Gómez cuenta cómo, en medio de una pandemia y de la incertidumbre de la maternidad, redescubrió en la poesía la voz que había guardado por 17 años. A través de un podcast grabado con un celular, la palabra se convirtió en refugio, propósito y punto de encuentro con una comunidad que también necesitaba sentir. Su historia demuestra que el arte no solo transforma sociedades: primero transforma a quien se atreve a regresar a él. Priscilla Gómez es una gestora cultural que ha convertido la Biblioteca de Boquete en un faro de aprendizaje, encuentro y desarrollo comunitario. Bajo su dirección, la biblioteca ha trascendido su papel tradicional para convertirse en un espacio vivo donde la lectura, la educación y la cultura se entrelazan con la vida cotidiana de la comunidad.\nA través de su trabajo, Priscilla demuestra que los libros no solo guardan historias, sino también la posibilidad de cambiar las nuestras. This talk was given at a TEDx event using the TED confer",
        "id": 4070448,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2OXRsx1gHmI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2OXRsx1gHmI/hqdefault.jpg",
        "title": "Volver a la poesía para volver a mí | Priscilla Gómez | TEDxPanamaCity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:11.458601+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:42:39+00:00",
        "description": "En esta charla, Octavio Rodríguez muestra cómo la escritura puede convertirse en una herramienta poderosa para despertar conciencia, conectar realidades y transformar a los jóvenes en ciudadanos capaces de comprender al otro. A través de un modelo educativo colaborativo que une escuelas, maestros y estudiantes de toda la región, demuestra que cuando las historias se comparten, nace una inteligencia colectiva capaz de imaginar —y construir— un mundo distinto. Octavio Rodríguez es un educador, coach y emprendedor cultural dedicado a impulsar el cambio desde las aulas y las comunidades. A través de RAIA (Redes Autopoiéticas Inter-Aportantes), promueve procesos de aprendizaje y colaboración que ayudan a estudiantes y docentes a reconocerse como agentes de transformación.\nSu trabajo combina pedagogía, creatividad y cultura para construir entornos donde el conocimiento no se impone, sino que se comparte. Octavio representa una nueva forma de liderazgo educativo: colaborativo, consciente y p",
        "id": 4070449,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jfPdNIf6p1M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jfPdNIf6p1M/hqdefault.jpg",
        "title": "La palabra como puente para un nuevo mundo | Octavio Rodríguez | TEDxPanamaCity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:11.568824+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:42:11+00:00",
        "description": "Tired of chasing “more?\" The C.O.N. is a code to reclaim your peace and power. Lisa Bischoff began college at 14 and earned an electrical engineering degree, only to find herself a million dollars in debt and embroiled in hacking and identity theft by 2007. After masterminding a $600,000 jewel heist in 2019, she faced twelve years in prison—but a judge’s gift of grace—a 30-day sentence—cracked her “monster of more” armor and ignited her transformation. Once morbidly obese, Lisa placed top five in two figure competitions this last year, now owns a small gym where she transforms lives. Over the past year, she’s led fitness and mindset programs in a youth-detention center and guided adults with special needs to their first public showcases. On the TEDxManitou Springs stage, she’ll share how micro gifts—tiny acts of connection—build up the real you when met with your monster of more and spark seismic personal change. This talk was given at a TEDx event using the TED conference format but ",
        "id": 4070450,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jC1tsDtPoRg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jC1tsDtPoRg/hqdefault.jpg",
        "title": "How to C.O.N. your monster of more! | Lisa Bischoff | TEDxManitou Springs Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:11.672759+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:42:03+00:00",
        "description": "Ken Jaray's compelling story of personal transformation and experiences that ignited a passion to use kindness and generosity to help reshape our world, one community at a time. Six months ago, I embarked on a deliberate journey to integrate kindness and generosity into my daily routine. This transformative practice has shifted my perspective from fear and anger to hope and joy. My commitment is to lead by example to facilitate and partake in innovative and creative initiatives within Manitou Springs and the Pikes Peak region that infuse our community fabric with the essence of generosity.  I will be drawing from my over 40 years as a community activist, former Mayor of Manitou Springs, School Board member, mediator and lawyer to model the values we seek to spread, sharing the positive changes I've experienced personally, and inviting others to partake in this fulfilling journey toward a culture rich in goodwill. This talk was given at a TEDx event using the TED conference format but ",
        "id": 4070451,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pf-8cWnSyz4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pf-8cWnSyz4/hqdefault.jpg",
        "title": "How kindness reshapes you—and others | Ken Jaray | TEDxManitou Springs Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:11.772648+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:41:56+00:00",
        "description": "Kim Brierley explora cómo nuestra mente, diseñada para sobrevivir en un mundo ancestral lleno de amenazas, intenta adaptarse a las exigencias y estímulos del mundo actual. Con una mirada que une las emociones y la neurociencia, invita a comprender por qué reaccionamos como lo hacemos ante el estrés, la incertidumbre o la sobreestimulación, y cómo podemos entrenar nuestra mente para responder de forma más consciente y equilibrada. Su charla es una invitación a reconciliar nuestra biología con la vida moderna y a recuperar el control sobre un cerebro que, aunque primitivo, puede aprender a evolucionar con nosotros. Kim Brierley es psicóloga, terapeuta y formadora internacional, reconocida por su trabajo en el desarrollo de la conciencia, la integración emocional y el bienestar humano. Con más de dos décadas de experiencia acompañando procesos personales y grupales, ha combinado la psicología transpersonal, la meditación y la neurociencia para guiar a las personas hacia una vida más plen",
        "id": 4070452,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9hqYcj50I4o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9hqYcj50I4o/hqdefault.jpg",
        "title": "Tu cerebro primitivo en tiempo modernos | Kim Brierley | TEDxSantiago Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:11.866655+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:41:22+00:00",
        "description": "Em um cenário imediatista e produtivista, a vida contemporânea é marcada pela pressa e pela falta de tempo para sentir. Nesse cenário, a arte resiste como um refúgio, um espaço onde o ser humano ainda pode se reconhecer. Desde as pinturas nas cavernas até as criações de hoje, ela acompanha nossa necessidade de expressar o que não cabe em palavras. Sofia nos convida a refletir sobre esse gesto ancestral de criar, não como um luxo, mas como um modo essencial de cuidar da mente e manter viva a nossa humanidade. Aluna da 3ª série do Ensino Médio do Colégio Ábaco - Unidade São Bernardo This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4070453,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=geYnPYCLwrI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/geYnPYCLwrI/hqdefault.jpg",
        "title": "Arte como refúgio da mente contemporânea | Sofia Dotti | TEDxColégio Ábaco Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:11.963939+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:41:14+00:00",
        "description": "He vivido una infancia de pobreza en una comunidad rural de Manabí, trabajando desde los 10 años para poder estudiar y enfrentando pérdidas durísimas como la muerte de mi padre y de mi hermano, además de una acusación injusta de robo que me marcó profundamente. Cansada de las injusticias, retomé mis estudios, ingresé a la tecnología en Desarrollo Infantil Integral a pesar de los no hay cupo y construí un proyecto de vida donde me propuse obtener mi tecnología, seguir formándome y crear una fundación. Hoy soy profesional multidisciplinaria, tengo mi propio emprendimiento, brindo atención a niños y niñas y realizo servicio comunitario en Quito, Junín y comunidades rurales, incluso con otras culturas como la nacionalidad waorani. A través de Misión Clarita honro a mi madre y mi vocación de servicio, llevando educación y apoyo a niños y adultos mayores en territorios vulnerables. Con resiliencia pasé de ir a la escuela con una simple funda como mochila a convertir esa bolsa en una mochila",
        "id": 4070454,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5RcbYfK35iI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5RcbYfK35iI/hqdefault.jpg",
        "title": "La Resiliencia Transforma Adversidades en Éxito | Maria Ramírez | TEDxITECSUR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:12.060204+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:41:06+00:00",
        "description": "Entendí que enseñar no es un trabajo, es un acto de fe: vengo de una infancia con miedo a una maestra violenta y hoy elijo ser la docente que hubiera querido tener. En mi rol de coordinadora he visto cómo una familia casi pierde el sueño de una hija por no poder pagar un examen, o cómo un estudiante con gran vocación tuvo que abandonar la carrera para sostener a su hogar. Por eso impulsé junto a mi equipo un centro de cuidado diario para que madres y estudiantes puedan estudiar mientras sus hijos están seguros, y he acompañado historias durísimas como la de una alumna que busca justicia por el femicidio de su hermana. Trabajar con estudiantes amazónicos, que cruzan ríos y realidades muy duras para educarse, me recordó que la educación rompe fronteras y es también una forma de resistir. Hoy tengo claro que no se trata solo de dar títulos, sino de transformar vidas, familias y comunidades: no solo formo, también inspiro. Máster en Neuropsicología y Educación, es coordinadora académica y",
        "id": 4070455,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6G6P2ExZ4lQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6G6P2ExZ4lQ/hqdefault.jpg",
        "title": "Cuando educar se convierte en transformar vidas | Estefanía Ruiz Peñaherrera | TEDxITECSUR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:12.166144+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:40:58+00:00",
        "description": "Esta charla propone un enfoque a la improvisación desde el juego para resolver y crear en lo cotidiano. Resignificar los imprevistos y responder desde la curiosidad y la autenticidad.\nPero como todo juego, hay reglas, turnos, piezas y objetivos donde cada uno construye su propia estrategia mientras el juego mismo sucede.\nDar cabida a la improvisación en nuestra vida, es reconocer que no todo plan está libre de inconvenientes, invitándonos a abrir una vía de respuesta que aproveche las posibilidades que surgen de la limitación. \nPero para aprovechar esta capacidad, primero debemos liberarla de los estigmas y miedos alrededor de ella. Pedagoga de 23 años cuyos interreses profesionales se centran en la creación de ambientes de aprendizaje basados en el arte, el juego y la inclusión, así como en la psicología educativa.\nCuenta con formación técnica profesional en Danza Clásica del Centro Cultural Ollin Yoliztli y se encuentra en proceso de titulación. Actualmente es analista de Innovación",
        "id": 4070456,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Fxl8d1Pyji8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Fxl8d1Pyji8/hqdefault.jpg",
        "title": "El Tablero en Blanco  | Ana Luisa Aguilar Nacher | TEDxUniversidad Panamericana",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:12.273258+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:40:43+00:00",
        "description": "Aprendí que, igual que Fleming convirtió un error en penicilina, mis problemas y mi discapacidad no son condenas, sino el punto de partida para oportunidades extraordinarias. Crecí dentro de un molde social que decía que por ser ciego, pobre o diferente debía conformarme, pero decidí nadar contra corriente: me fui solo a Quito, estudié en la Central, me formé, hice música, oratoria, fisicoculturismo y activismo. Descubrí que el miedo puede ser motor si lo uso a mi favor y que la persistencia convierte cada caída en resiliencia. Hoy sé que romper la zona de confort es elegir mi propia historia, no la que el sistema escribió para mí. Nada es imposible: lo único verdaderamente imposible es no intentarlo. Abogado por la Universidad Central del Ecuador, con especialización y máster en Derechos Humanos en Europa. Activista desde los 11 años, ha promovido la inclusión de personas con discapacidad y la cultura de perros de asistencia. Asesor legal y académico, fue galardonado con el Premio Do",
        "id": 4070457,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cUdg5Nj2QI8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cUdg5Nj2QI8/hqdefault.jpg",
        "title": "Romper el molde: la resiliencia me convirtió | Andy Yong Fu Díaz Hurtado | TEDxITECSUR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:12.379868+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:39:44+00:00",
        "description": "Comprendí que la educación es como un puente: si no hablo el mismo idioma de mis estudiantes, no llegamos juntos al aprendizaje. Con mis alumnos amazónicos, que no dominaban el español, tuve que cambiar mi forma de enseñar, volver a recursos simples, usar el cuerpo, el entorno y su propia realidad para que no solo aprendan, sino entiendan. Ellos me mostraron que donde yo veía carencia había abundancia de saberes, que con hojas, semillas y la selva se puede hacer pedagogía significativa. Al ganar su confianza, dejaron de callar por vergüenza y empezaron a preguntar, apoyarse en mí y creer en sí mismos. Hoy, al ver que los 16 se gradúan, siento que ser docente es creer en mis estudiantes sin importar de dónde vengan y cruzar juntos el puente del aprendizaje. Licenciada en Educación Inicial y Máster en Intervención Psicológica en Problemas de Conducta. Docente en ITECSUR y miembro del Equipo de Evidencias, ha liderado proyectos innovadores con impacto social y educativo. Su vocación se n",
        "id": 4070458,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=h3SPCc9WHus",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/h3SPCc9WHus/hqdefault.jpg",
        "title": "Educar sin fronteras: escuela del viento, los árboles y las estrellas  | Melany Ruiz | TEDxITECSUR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:12.483871+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:39:35+00:00",
        "description": "Me pregunto cuál es el propósito de mi vida y entiendo que no se trata solo de metas, sino de tener dirección, enfoque, motivación e inspiración, porque sin inspiración nada se sostiene. Comprendo que mi realidad es el resultado de lo que pienso repetidamente, de las emociones que eso genera y de las acciones que tomo, y que mi propósito se conecta con lo que amo hacer, lo que el mundo necesita, por lo que me pueden pagar y mis talentos (mi propio ikigai). Veo mi producto, servicio o negocio como un acto de amor: una forma de impactar vidas más allá del dinero, haciendo de mi emprendimiento algo consciente y con huella. Acepto que soy responsable de lo que vivo y de cómo invierto el préstamo de tiempo que tengo, preguntándome siempre para qué hago lo que hago y qué marca quiero dejar. Incluso en el dolor más profundo, como despedir a mi madre, descubro que la inspiración es la fuerza que me levanta y me recuerda que nací para cumplir todos mis sueños y dejar una huella sin pisar a nad",
        "id": 4070459,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MQuwHjQ__NM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MQuwHjQ__NM/hqdefault.jpg",
        "title": "Dejando huella: El verdadero impacto de crear negocios conscientes | Estefanía Garrido | TEDxITECSUR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:12.588093+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:39:16+00:00",
        "description": "\"Gracias a Dios ya es Lunes\" es una invitación a reconciliarnos con los comienzos, a dejar de vivir esperando el viernes y aprender a encontrar propósito en lo que hacemos cada día.En esta charla, Jorge Huerta Bleck comparte historias reales, reflexiones y aprendizajes que nos muestran cómo transformar la rutina en motivación, el cansancio en energía y el trabajo en una plataforma para dejar huella. Es un recordatorio de que la plenitud no está en los días libres, sino en los días vividos con sentido. Licenciado en Contaduría y Maestro en Alta Dirección por el IPADE, con especialidades en Finanzas y Antropología. Además, es Doctor Honoris Causa.\nCon más de 30 años de experiencia, ha ocupado cargos de alta dirección en empresas y universidades, incluyendo el puesto de rector de University of the Incarnate Word Mexico City. \nEs fundador de Impulso México, un movimiento enfocado en el desarrollo empresarial con visión humana.\nHa sido conferencista y consultor en temas de dirección estrat",
        "id": 4070460,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bDHW1chfhXQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bDHW1chfhXQ/hqdefault.jpg",
        "title": "Gracias a Dios ya es Lunes | Jorge Huerta Bleck | TEDxUniversidad Panamericana",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:12.689784+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:38:58+00:00",
        "description": "Nací en una casa llena de libros, jardines y abuelos que me enseñaron que las cosas no se compran, se cultivan; ahí empezó mi amor por las plantas. Aunque en la escuela llegaba con cartas a la dirección mientras mi hermana llegaba con medallas, una profesora de biología y las enseñanzas de mi familia encaminaron mi vocación hacia la ingeniería agronómica. Con estudio, disciplina y mucha motivación, convertí esa vocación en proyectos ambientales de reforestación y cuidado del planeta en varios países, siempre trabajando con jóvenes y familias. Hoy entiendo la educación como suelo fértil, agua y sol: valores del hogar, práctica diaria y docentes que inspiran. Mi mensaje es vivir la vocación con amor, equilibrio entre motivación y armonía, y preguntarme siempre qué semilla estoy sembrando con mi vida. Ingeniero Agrónomo con más de 25 años de experiencia en docencia, investigación y desarrollo agroproductivo sostenible. Ha liderado proyectos en Cuba, Perú, España, Mozambique y Ecuador. Es",
        "id": 4070461,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=udQgCS7H3iY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/udQgCS7H3iY/hqdefault.jpg",
        "title": "Cuando la vocación florece en armonía con la vida | Mario Fleitas | TEDxITECSUR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T17:23:12.796883+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:38:42+00:00",
        "description": "Exploramos cómo muchas veces cargamos con emociones que reprimimos por miedo al juicio o al ser vulnerables . Y eso que escondemos… se queda con nosotros. La propuesta es clara: cuando nos escuchamos con honestidad, podemos liberar lo que nos pesa, encontrar claridad y tomar pequeñas acciones que realmente transforman nuestra vida.\nNo se trata de fórmulas mágicas, sino de reconocer que el cambio empieza desde adentro Estudiante de 19 años que se destaca por su compromiso con el desarrollo personal y social, influenciado por la perseverancia de sus padres y su filosofía de aprovechar oportunidades. \nAdemás de sus estudios, cursa un Diplomado en Educación Financiera y participa como fotógrafo deportivo en MediaGroup de la UP.\n Ha estado activamente involucrado en voluntariado con AIESEC y en iniciativas de reforestación. \nActualmente, busca una beca en Social Progress Imperative para ampliar su impacto en proyectos de desarrollo social. \nLa escritura es una herramienta de introspección ",
        "id": 4070462,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qWRVfCbzt3c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qWRVfCbzt3c/hqdefault.jpg",
        "title": "Todo lo que Escondes seQueda Contigo | Jorge Alejandro Oseguera Pérez | TEDxUniversidad Panamericana",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T16:22:30.034533+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:14:04+00:00",
        "description": "NOTE FROM TED: This talk contains a discussion of suicide.  Please seek professional help if you or a loved one is struggling and do not look to this talk as a substitute for mental health advice. Contents only represent the speaker’s personal views and understanding of technology use, youth mental health, and related interventions. The relationship between screen time and public health warrants further scientific investigation. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nThe Western Colorado Community Foundation is a major force for good, driving impact across the region by managing over $186 M in assets and distributing $8.3 Million annually in grants to nonprofits and scholarships to students. Since 1996, it’s been amplifying generosity and sparking lasting change in Western Colorado. A slice of that funding powers YouthStrong initiat",
        "id": 4069849,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mqzhFI1OD0Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mqzhFI1OD0Y/hqdefault.jpg",
        "title": "Connecting Eye to Eye: Why Mindful Parenting Matters | Tedi Gillespie | TEDxGrandJunction",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T16:22:30.310128+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:08:34+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker’s personal views and understanding of the military and national security. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nTrey Hart discusses his personal journey to establish an investment firm focused on U.S. national security. He shares how a pivotal high school experience and a crucial phone call in Fargo led him to combine his skills and passions for this \"righteous mission.\" Hart's firm aims to align America's financial markets and entrepreneurial spirit with its core freedoms, ensuring liberty and happiness for future generations. He argues that by uniting entrepreneurs with the military and its supporters, every American can help safeguard national values against adversaries. Hart con",
        "id": 4069850,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1X5PiKx-9lM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1X5PiKx-9lM/hqdefault.jpg",
        "title": "Forging America’s Future: Aligning Financial Markets & Freedoms | Trey Hart | TEDxFargo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T16:22:30.566147+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:05:56+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker’s personal approach and understanding of rare mineral policy and legislation. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nNorth Dakota legislator Dick Anderson discusses the discovery of rare minerals in North Dakota's coal and clay deposits. He highlights their essential uses in electronics, magnets, medical equipment, aviation, and more. Anderson emphasizes the nation's reliance on foreign rare mineral imports, advocating for domestic production for national security. He details his legislative efforts to establish a rare mineral refinery in North Dakota and outlines the extraction process. The speaker also identifies specific rare minerals and their diverse applications, stressing the ",
        "id": 4069851,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=I2qjRNVfxfI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/I2qjRNVfxfI/hqdefault.jpg",
        "title": "Critical Role of Rare Minerals in North Dakota and Beyond | Dick Anderson | TEDxFargo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T16:22:30.814116+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T16:02:09+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker's personal views and understanding of the mind, body, and mental fitness. Several claims lack scientific support. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nViveck Shettyy is an award-winning motivational speaker and life coach with over 15 years of experience specializing in mental fitness and Mind Management. He has delivered over 1000 lectures and trains a diverse clientele, including corporate leaders and celebrities, in public speaking and mental wellness.\nHe spoke about mental fitness as the foundation for peak performance, highlighting how modern life breeds restlessness and psychosomatic issues and urging people to turn inward for balance. Viveck Shettyy argues that mental fitnes",
        "id": 4069852,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5EbQI_wVcXo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5EbQI_wVcXo/hqdefault.jpg",
        "title": "True Success Begins in the Mind | Mr. Viveck Shettyy | TEDxBocconiUMumbai",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T16:22:30.976270+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T15:59:15+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker’s personal views and experiences in the military. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nIn this inspiring TEDx Talk, Col. Virendra Kumar Sahi, VrC, a decorated 1971 war hero and Vir Chakra awardee, takes us on a profound journey through courage, leadership, and the essence of humanity.\n\nWith the calm authority of a true soldier and the warmth of a wise mentor, Col. Sahi shares powerful reflections from the battlefield and beyond reminding us that respect is not reserved for ranks or titles, but for every individual who contributes with integrity and purpose.\n\nThrough moving anecdotes of valor, resilience, and humility, he urges us to look beyond professions and positions, to value every person’s role in building a better, stronger society. \n\nHis talk is not just a war story, it’s",
        "id": 4069853,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FBBpMofRg58",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FBBpMofRg58/hqdefault.jpg",
        "title": "Respect Beyond Ranks | Col Virendra Kumar Sahi VrC | TEDxGMC Doda",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T16:22:31.155665+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T15:55:55+00:00",
        "description": "NOTE FROM TED: TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nHow do you make an Impact? Why Does it Matter?  Regardless of your occupation, you can make your community a better place. While many people often associate law enforcement with enforcing traffic laws and responding to calls for service, the role goes far beyond that. The core idea that one should strive to serve one's community led Carly into service. In her talk she shares the great fulfillment from taking positive actions in a place you care about daring others to positively contribute to their community's betterment. Identify how you can give back to your community in your current role and then do it! A South Hagerstown High School Graduate who went on to earn an Associate of Applied Science degree in Criminal Justice from Delaware Technical and Community. Carly was hired by ",
        "id": 4069854,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eWghlrb7EYY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eWghlrb7EYY/hqdefault.jpg",
        "title": "Make an Impact | SGT Carly Hose | TEDxHagerstownWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-14T16:22:31.413999+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-14T15:52:27+00:00",
        "description": "What if your job could change the world? In this inspiring talk, Eline Goethals shares her journey from working in advertising for Big Tobacco to fighting against it. Through honesty, courage, and purpose, she shows how rethinking our careers, and choosing moral ambition over comfort, can become one of the most powerful ways to create real change. Eline Goethals worked as a Strategy Director in the advertising for over eleven years, working with global brands like NIVEA and Carlsberg, and earning awards for effectiveness and creativity. Yet, a nagging question kept growing: What am I doing this for? Wanting to have a more positive impact on the world and feeling trapped in the slot machine of advertising, Eline made the radical decision to quit her career and join the fellowship at the School for Moral Ambition. Now, she uses her influence for good, focussing tobacco control. This talk was given at a TEDx event using the TED conference format but independently organized by a local com",
        "id": 4069855,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=q4WlQ9juTe4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/q4WlQ9juTe4/hqdefault.jpg",
        "title": "Why the Best Way to Change the World Is to Change Careers | Eline Goethals | TEDxUNINA Federico II",
        "vote": 0
    }
]