[
    {
        "age": null,
        "album": "",
        "author": "Vox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T19:37:30.680095+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T19:00:18+00:00",
        "description": "For Today, Explained, Vox’s Astead Herndon sat down with New York City Mayor-elect Zohran Mamdani at his transition team’s office to talk about how Mamdani plans to execute on his promises once in office. \n\nEarlier this year, Herndon profiled Mamdani’s rise for New York Times magazine, interviewing the rising political star on the campaign trail several times. That October story broke down Mamdani’s unprecedented rise and gave the play-by-play of his surprise primary election victory over former New York Gov. Andrew Cuomo. \n\nIn this one-on-one interview with Vox, Herndon caught up with Mamdani ahead of his inauguration. They talk through everything from Mamdani’s first priorities in office, to what the national Democratic Party can learn from his successful campaign on affordability, to his appeal to new, young voters through social video.\n\nListen to Today, Explained, featuring a scene from Mamdani’s 12 hours of listening to constituents.\nhttps://podcasts.apple.com/us/podcast/today-ex",
        "id": 4438022,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EVESpvHPtG8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 779,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCLXo7UDZvByw2ixzpQCufnA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EVESpvHPtG8/hqdefault.jpg",
        "title": "Why Zohran Mamdani wants to “demystify” the political process (Full video interview)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Vox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T13:52:31.747975+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T13:01:29+00:00",
        "description": "As people spend more time using ChatGPT and other AI chatbots, more and more folks are starting to wonder if it’s possible for AIs to have some degree of consciousness. And it’s easy to see why — humans tend to find the idea of conscious AI engaging, and chatbots are trained to keep us engaged and pleased.\n\nVox’s senior reporter, Sigal Samuel, author of the Your Mileage May Vary advice column, has been getting a lot of reader questions about just this. This is how she’s approaching the question of whether our AIs have consciousness. #AI #chatbot #chatgpt\n\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts",
        "id": 4435519,
        "language": "en",
        "link": "https://www.youtube.com/shorts/kalj0hAenBA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 779,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCLXo7UDZvByw2ixzpQCufnA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kalj0hAenBA/hqdefault.jpg",
        "title": "People are wondering if their AI chatbot is conscious 🤔 #shorts",
        "vote": 0
    }
]