[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T23:39:21.433238+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T23:20:00+00:00",
        "description": "Axios reports that venture capitalist Alex Davis is warning that a speculative rush to build data centers without committed tenants could trigger a financing crunch by 2027-2028.\n \n\"This critique is coming from inside the AI optimist camp,\" notes Axios, as Davis' firm, Disruptive, \"recently led a large investment in AI chipmaker Groq, which then signed a $20 billion licensing deal with Nvidia. It's also backed such unicorn startups as Reflection AI, Shield AI and Gecko Robotics.\"\n \nHere's what Davis had to say in his investor letter this morning: \"While I continue to believe the ongoing advancements in AI technology present 'once in a lifetime' investment opportunities, I also continue to see risks and reason for caution and investment discipline. For example, we are seeing way too many business models (and valuation levels) with no realistic margin expansion story, extreme capex spend, lack of enterprise customer traction, or overdependence on 'round-trip' investments -- in some case",
        "id": 4439548,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/30/2016207/groq-investor-sounds-alarm-on-data-centers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Groq Investor Sounds Alarm On Data Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T23:39:21.604330+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T22:40:00+00:00",
        "description": "China is quietly mandating that chipmakers use at least 50% domestically made equipment when expanding capacity, \"as Beijing pushes to build a self-sufficient semiconductor supply chain,\" according to Reuters. From the report: The rule is not publicly documented, but chipmakers seeking state approval to build or expand their plants have been told by authorities in recent months that they must prove through procurement tenders that at least half their equipment will be Chinese-made, the people told Reuters. The mandate is one of the most significant measures Beijing has introduced to wean itself off reliance on foreign technology, a push that gathered pace after the U.S. tightened technology export restrictions in 2023, banning sales of advanced AI chips and semiconductor equipment to China.\n \nWhile those U.S. export restrictions blocked the sale of some of the most advanced tools, the 50% rule is leading Chinese manufacturers to choose domestic suppliers even in areas where foreign eq",
        "id": 4439549,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/30/205238/china-mandates-50-domestic-equipment-rule-for-chipmakers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Mandates 50% Domestic Equipment Rule For Chipmakers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T22:26:17.309800+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: Mac Bauer is fast, but the city's trams, weighing more than 100,000lbs and traveling at a maximum speed of nearly 45mph, should be far faster than him. And yet as of late December, in head-to-head races against streetcars, the 32-year-old remains undefeated in his quest to highlight how sluggish the trams, used by 230,000 people daily, truly are.\n \nSome races have pushed him closer to his limits as a runner. On other occasions, the car has been so slow he's had time to nip into a McDonald's before it reaches the last station. \"I don't like winning. I really don't. I really, really wish these streetcars were faster than me,\" he said. \"But they're not. And this is the problem.\" Bauer's rise as a running celebrity and transit critic embodies the mounting frustration of a city beset by chronic delays, congested streets and decades of under-built transit.\n \n\"Streetcars just shouldn't be stuck in traffic,\" he said, adding the system als",
        "id": 4439136,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/30/202203/toronto-man-outruns-streetcars-to-show-up-sluggish-transit-network",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Toronto Man Outruns Streetcars To Show Up Sluggish Transit Network",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T22:26:17.509898+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T21:21:00+00:00",
        "description": "Two cybersecurity professionals who spent their careers defending organizations against ransomware attacks have pleaded guilty in a Florida federal court to using ALPHV/BlackCat ransomware to extort American businesses throughout 2023. \n\nRyan Goldberg, a 40-year-old incident response manager from Georgia, and Kevin Martin, a 36-year-old ransomware negotiator from Texas, admitted to conspiring to obstruct commerce through extortion. Between April and December 2023, Goldberg, Martin, and a third unnamed co-conspirator deployed the ransomware against multiple U.S. victims and agreed to pay ALPHV BlackCat's operators a 20% cut of any ransoms received. They successfully extracted approximately $1.2 million in Bitcoin from one victim, splitting their 80% share three ways before laundering the proceeds. Both men face up to 20 years in prison and are scheduled for sentencing on March 12, 2026. \n\nThe Justice Department noted that all three conspirators possessed specialized skills in securing ",
        "id": 4439137,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/30/1911201/cybersecurity-employees-plead-guilty-to-ransomware-attacks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cybersecurity Employees Plead Guilty To Ransomware Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T21:16:14.542012+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T20:42:00+00:00",
        "description": "The global airline industry is on track to post an all-time profit high of nearly $40 billion in 2025, according to trade group IATA, surpassing the pre-pandemic 2019 figure of $26 billion, but carriers are still managing a net margin of just 4% -- roughly $7.90 per passenger. Economist adds: Not everything has been in the ascent. European and North American airlines, which account for three-fifths of the industry's net profits, have had to contend with circuitous long-haul routes to avoid Russian airspace since the start of the war in Ukraine. This year parts of the Middle East became no-go zones after Israel's strike on Iran in June. America's airlines were hit by a government shutdown that stopped federal workers from travelling and kept unpaid air-traffic controllers at home, disrupting flights. \n\nWhat is more, despite a drop in fuel prices, which account for 25-30% of airlines' operating expenses, other costs have risen. Airlines flew 4.8 billion passengers in 2024, beating the 2",
        "id": 4438654,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/30/1748203/despite-a-record-year-airlines-are-grappling-with-big-challenges",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Despite a Record Year, Airlines Are Grappling With Big Challenges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T21:16:14.615197+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T20:01:00+00:00",
        "description": "A study by a Singapore government agency has found that children exposed to high levels of screen time before age two showed brain development changes linked to slower decision-making and higher anxiety in adolescence, adding to concerns about early digital exposure. From a report: The study was conducted by a team within the country's Agency for Science, Technology and Research and the National University of Singapore, and published in The Lancet's eBioMedicine open access journal. It tracked 168 children for more than a decade, and conducted brain scans on them at three time points. Heavier screen exposure among very young children was associated with \"accelerated maturation of brain networks\" responsible for vision and cognitive control, the study found. \n\nThe researchers suggested this may have been the result of \"intense sensory stimulation that screens provide.\" They found that screen time measured at ages three and four, however, did not show the same effects. Those children wi",
        "id": 4438655,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/30/1716246/singapore-study-links-heavy-infant-screen-time-to-teen-anxiety",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Singapore Study Links Heavy Infant Screen Time To Teen Anxiety",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T20:04:39.856589+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T19:21:00+00:00",
        "description": "An anonymous reader shares a report: The French government on Dec 30 postponed a ban on plastic throwaway cups by four years to 2030 because of difficulties finding alternatives. The ban was meant to start on Jan 1. But the Ministry for Ecological Transition said the \"technical feasibility of eliminating plastic from cups\" following a review in 2025 justified pushing back the deadline. \n\nIt said in an official decree that a new review would be carried out in 2028 of \"progress made in replacing single-use plastic cups.\" It added that the ban would now start Jan 1, 2030, when companies would have 12 months to get rid of their stock. France has gradually rolled out bans on single-use plastic products over the past decade as environmental campaigners have stepped up warnings about the impact on rivers and oceans.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=France+Pushes+Back+Plastic+Cup+Ban+By+Four+Years%3A+https%3A%",
        "id": 4438210,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/30/1711255/france-pushes-back-plastic-cup-ban-by-four-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "France Pushes Back Plastic Cup Ban By Four Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T18:53:13.400830+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T18:41:00+00:00",
        "description": "After more than three decades of service, New York City's iconic MetroCard is about to retire, as December 31, 2025 marks the final day commuters can purchase or refill the gold-hued plastic cards that replaced subway tokens back in 1994. The Metropolitan Transportation Authority has been transitioning to OMNY, a contactless payment system introduced in 2019 that lets riders tap a credit card, phone or smart device at turnstiles. \n\nMore than 90% of subway and bus trips are now paid using the tap-and-go system, and the agency says the changeover saves at least $20 million annually in MetroCard-related costs. The new system also introduces automatic fare capping: riders get unlimited travel within a seven-day period after 12 paid rides, maxing out at $35 a week once fares rise to $3 in January. Riders who prefer not to link a credit card or phone can purchase reloadable OMNY cards. \n\nExisting MetroCards will continue to work into 2026, allowing riders time to use up remaining balances. ",
        "id": 4437748,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/30/1659234/new-yorks-metrocard-era-ends-after-31-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New York's MetroCard Era Ends After 31 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T18:53:13.672208+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T18:02:00+00:00",
        "description": "The consulting firm CVL Economics estimated last year that AI would disrupt more than 200,000 entertainment-industry jobs in the United States by 2026, but writer Nick Geisler argues in The Atlantic that the most consequential casualties may be the humble entry-level positions where aspiring artists have traditionally paid dues and learned their craft. Geisler, a screenwriter and WGA member who started out writing copy for a how-to website in the mid-2010s, notes that ChatGPT can now handle the kind of articles he once produced. \n\nThis pattern is visible today across creative industries: the AI software Eddie launched an update in September capable of producing first edits of films, and LinkedIn job listings increasingly seek people to train AI models rather than write original copy. The story adds: The problem is that entry-level creative jobs are much more than grunt work. Working within established formulas and routines is how young artists develop their skills. The historical reco",
        "id": 4437749,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/30/124254/the-problem-with-letting-ai-do-the-grunt-work",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Problem With Letting AI Do the Grunt Work",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T17:43:52.764656+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T17:21:00+00:00",
        "description": "The World Health Organization's latest annual malaria report paints a grim picture that's about to get grimmer, as the United States -- which has supplied 37% of global malaria funding since 2010 -- pulls back its international health commitments under President Donald Trump. Malaria cases have been climbing since 2015, when progress against the mosquito-borne disease stalled due to insecticide resistance and chronic underfunding. \n\nIn 2024, the world recorded 282 million cases and 610,000 deaths, and African countries accounted for 95% of both figures. Children under 5 made up 75% of malaria-related deaths in Africa. Global spending on malaria reached $3.9 billion last year. \n\nTrump's decision to slash international public health funding and gut the US Agency for International Development has caused what the WHO calls \"widespread disruption to health operations around the world.\" The burden of these setbacks, the organization adds, is expected to fall disproportionately on children. ",
        "id": 4437187,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/30/0841215/malaria-shows-no-sign-of-stopping",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Malaria Shows No Sign of Stopping",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T17:43:53.105631+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T16:41:00+00:00",
        "description": "A scheme to encourage climbers to bring their waste down from Mount Everest is being scrapped -- with Nepalese authorities telling the BBC it has been a failure. From the report: Climbers had been required to pay a deposit of $4,000, which they would only get back if they brought at least 8kg (18lbs) of waste back down with them. It was hoped it would begin to tackle the rubbish problem on the world's highest peak, which is estimated to be covered in some 50 tonnes of waste. But after 11 years -- and with the rubbish still piling up -- the scheme is being shelved because it \"failed to show a tangible result.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nepal+To+Scrap+'Failed'+Mount+Everest+Waste+Deposit+Scheme%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F30%2F0836252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"h",
        "id": 4437188,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/30/0836252/nepal-to-scrap-failed-mount-everest-waste-deposit-scheme",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nepal To Scrap 'Failed' Mount Everest Waste Deposit Scheme",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T16:31:20.647437+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T16:02:00+00:00",
        "description": "The camera industry shipped 6.5 million interchangeable lens cameras last year -- a 50% decline from 2010's peak -- yet 2025 may have been the most creatively ambitious year in nearly two decades of digital photography. DPReview's Richard Butler argues that this year's releases displayed \"invention, experimentation and niche-tickling lunacy\" not seen since digital's earliest days. \n\nInterchangeable lens shipments rose 11% in the first ten months of 2025 compared to last year, and fixed lens cameras climbed roughly 26%. The practical cameras arrived as expected: Panasonic's S1 II, Canon's EOS R6 III, and Sony's a7 V all delivered performance that \"can go toe-to-toe with the pro sports models of just a few years ago.\" But the stranger releases drew attention. \n\nSony's RX1R III faced criticism for being a \"lazy update,\" yet Butler found it \"small, fun to use and the pictures look great.\" Leica launched the Q3 Monochrom, a $7,800 fixed-lens full-frame compact that cannot capture color. Fu",
        "id": 4436676,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/30/0833258/camera-makers-went-weird-in-2025---and-thats-exactly-what-the-shrinking-industry-needed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Camera Makers Went Weird in 2025 - and That's Exactly What the Shrinking Industry Needed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T16:31:20.812541+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T15:20:00+00:00",
        "description": "In a year when print book sales have slipped 1% to 679 million copies through early December, according to Circana BookScan, audiobooks continue to carve out territory that once belonged exclusively to hardcovers, and in several notable cases this year, the audio versions have outright outsold their physical counterparts. \n\nS.A. Cosby's southern crime novel \"King of Ashes\" moved more copies as an audiobook than as a hardcover, according to publisher Macmillan Audio. The same is true for celebrity memoirs from Jeremy Renner, Alyson Stoner, and Brooke Shields -- all narrated by the authors themselves. Karin Slaughter's thriller \"We Are All Guilty Here\" and comedian Nate Bargatze's \"Big Dumb Eyes\" also saw their audio editions outpace hardcover sales. \n\nDigital audiobook revenue jumped nearly 24% in 2024 to $1.1 billion, per the Association of American Publishers, though growth has cooled to 1% through October this year, bringing in nearly $888 million. The format's strength has professi",
        "id": 4436677,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/30/0754259/some-audiobooks-are-outselling-hardcovers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some Audiobooks Are Outselling Hardcovers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T15:21:53.364888+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T14:40:00+00:00",
        "description": "Japan's demographic transformation is no longer a distant forecast but an accelerating reality, and the National Institute of Population and Social Security Research now estimates the country's population will fall to roughly 100 million by 2050 -- more than 20 million fewer people than today. \n\nThe share of residents aged 65 and over stood at 29.4% as of September and is expected to reach 37.1% by midcentury. The dependency ratio -- children and older adults supported by every 100 working-age people -- is projected to rise from 68.0 to 89.0, meaning each working-age person will effectively support one dependent. \n\nAkita Prefecture is currently offering a preview of this future. Its population fell 1.93% year over year as of November 1, the steepest decline of any prefecture, and more than 40% of its residents are already 65 or older. By 2050, Akita's population is projected to drop to around 560,000, roughly 60% of its current size. Japan's total fertility rate fell for the ninth con",
        "id": 4436159,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/30/0716215/life-in-a-shrinking-japan",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Life in a Shrinking Japan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T14:14:55.226032+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T14:00:00+00:00",
        "description": "The six-decade flow of highly skilled Indian immigrants to the United States -- a migration pattern that produced some of the country's highest-earning households, several Nobel laureates, and the CEOs of Google, Microsoft, and Pepsi -- appears to be grinding to a halt amid rising anti-Indian rhetoric from Republican officials and chaos in the visa system, according to New York Times. \n\nIndian student arrivals at American universities fell 44% this year, even as Indians had just become the largest contingent of foreign students the previous year. The decline comes as top Trump administration officials have publicly accused Indian immigrants of gaming the system. Stephen Miller, the architect of the president's immigration crackdown, declared on Fox News that Indians \"engage in a lot of cheating on immigration policies that is very harmful to American workers.\" Governor Ron DeSantis called the H-1B visa program \"chain migration run amok.\" \n\nThe hostility extends beyond policy circles. ",
        "id": 4435669,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/30/0659206/one-of-americas-most-successful-experiments-is-coming-to-a-shuddering-halt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'One of America's Most Successful Experiments Is Coming to a Shuddering Halt'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T13:08:56.035559+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from SecurityWeek: Insurance giant Aflac is notifying roughly 22.65 million people that their personal information was stolen from its systems in June 2025. The company disclosed the intrusion on June 20, saying it had identified suspicious activity on its network in the US on June 12 and blaming it on a sophisticated cybercrime group. The company said it immediately contained the attack and engaged with third-party cybersecurity experts to help with incident response. Aflac's operations were not affected, as file-encrypting ransomware was not deployed.\n \n[...] The compromised information, the insurance giant says, includes names, addresses, Social Security numbers, dates of birth, driver's license numbers, government ID numbers, medical and health insurance information, and other data. \"The review of the potentially impacted files determined personal information associated with customers, beneficiaries, employees, agents, and other individuals rela",
        "id": 4435248,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/30/0645220/22-million-affected-by-aflac-data-breach",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "22 Million Affected By Aflac Data Breach",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T10:50:29.903937+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T10:00:00+00:00",
        "description": "Meta has agreed to acquire viral AI agent startup Manus, \"a Singapore-based AI startup that's become the talk of Silicon Valley since it materialized this spring with a demo video so slick it went instantly viral,\" reports TechCrunch. \"The clip showed an AI agent that could do things like screen job candidates, plan vacations, and analyze stock portfolios. Manus claimed at the time that it outperformed OpenAI's Deep Research.\" From the report: By April, just weeks after launch, the early-stage firm Benchmark led a $75 million funding round that assigned Manus a post-money valuation of $500 million. General partner Chetan Puttagunta joined the board. Per Chinese media outlets, some other big-name backers had already invested in Manus at that point, including Tencent, ZhenFund, and HSG (formerly known as Sequoia China) via an earlier $10 million round.\n \nThough Bloomberg raised questions when Manus started charging $39 or $199 a month for access to its AI models (the outlet noted the pr",
        "id": 4434403,
        "language": "en-us",
        "link": "https://meta.slashdot.org/story/25/12/30/0640250/meta-just-bought-manus-an-ai-startup-everyone-has-been-talking-about",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Just Bought Manus, an AI Startup Everyone Has Been Talking About",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T07:30:44.311351+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T07:00:00+00:00",
        "description": "The Wall Street Journal reports that Boston's once-booming biotech sector has hit a sharp downturn, leaving newly minted Ph.D.s struggling to find work as venture funding dries up, lab space sits empty, and companies downsize or relocate amid rising costs and policy uncertainty. The Wall Street Journal reports: Boston's biotech sector, long a vital economic engine for one of America's wealthiest metro areas, is sputtering. A double whammy of cutbacks in venture capital and government funding have taken a toll, leading to layoffs and struggles for job seekers. For workers who thought they would easily launch into a well-paying science career, the downturn has been especially harsh.\n \nMassachusetts experienced a slight decline in its roughly 65,000 biotech research-and-development jobs in 2024 after years of mostly strong increases, including during the Covid-19 pandemic, according to federal data. The numbers indicate that job losses continued through at least June, while hiring remain",
        "id": 4433574,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/29/2357222/phds-cant-find-work-as-bostons-biotech-engine-sputters",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PhDs Can't Find Work as Boston's Biotech Engine Sputters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T04:15:49.753189+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T03:33:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The nervous system does an astonishing job of tracking sensory information, and does so using signals that would drive many computer scientists insane: a noisy stream of activity spikes that may be transmitted to hundreds of additional neurons, where they are integrated with similar spike trains coming from still other neurons. Now, researchers have used spiking circuitry to build an artificial robotic skin, adopting some of the principles of how signals from our sensory neurons are transmitted and integrated. While the system relies on a few decidedly not-neural features, it has the advantage that we have chips that can run neural networks using spiking signals, which would allow this system to integrate smoothly with some energy-efficient hardware to run AI-based control software.\n \n[...] There are four ways that these trains of spikes can convey information: the shape of an individual pulse, through their magnitude, through the",
        "id": 4432862,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/29/2344207/researchers-make-neuromorphic-artificial-skin-for-robots",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Make 'Neuromorphic' Artificial Skin For Robots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T02:07:29.274551+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T02:02:00+00:00",
        "description": "Amid a global DDR5 shortage and soaring prices, Russian hardware enthusiasts are experimenting with do-it-yourself DDR5 RAM by sourcing empty PCBs and soldering memory chips by hand. Tom's Hardware reports: The idea comes from Russian YouTuber PRO Hi-Tech's Telegram channel, where a local enthusiast known as \"Vik-on\" already performs VRAM upgrades for GPUs, so this is a relatively safe operation for him. According to Vik-on, empty RAM PCBs can be sourced from China for as little as $6.40 per DIMM. The memory chips themselves, though, that's a different challenge.\n \nThe so-called spot market for memory doesn't really exist at the moment, since no manufacturer has the production capacity to make more RAM, and even if they did, they'd sell to better-paying AI clients instead. Still, you can find SK Hynix and Samsung chips across Chinese marketplaces if you search for the correct part number, as shown in the attached screenshots.\n \nMoreover, the Telegram thread says it would cost roughly ",
        "id": 4432398,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/29/2336254/russian-enthusiasts-planning-diy-ddr5-memory-amidst-worldwide-shortage",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russian Enthusiasts Planning DIY DDR5 Memory Amidst Worldwide Shortage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T02:07:29.645374+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T01:25:00+00:00",
        "description": "Phoronix's Michael Larabel is \"reliving some of the best moments for Fedora Linux in 2025\" by highlighting the year's most popular news around the distro. Throughout 2025, Fedora continued to lead upstream Linux innovation with bold changes like Wayland-only GNOME, newer kernels, architecture cleanups, and experimental features -- while openly grappling with controversial shifts such as dropping 32-bit support and modernizing long-standing subsystems.\n \n\"Fedora Linux this year continued in punctually shipping the very latest upstream Linux innovations from the freshest Wayland components to Linux kernel features and continuing to leverage other improvements in the open-source world,\" writes Larabel. \"Fedora enjoyed the successful Fedora 42 and Fedora 43 releases this year, including going with Wayland-noly GNOME and further phasing of 32-bit packages. Fedora's KDE spin continued improving too and the Red Hat sponsored Linux distribution enjoyed a wealth of other improvements this year",
        "id": 4432399,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/29/2330252/fedora-continued-at-the-forefront-of-upstream-linux-innovations-in-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fedora Continued At The Forefront Of Upstream Linux Innovations In 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T01:00:39.865319+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T00:45:00+00:00",
        "description": "Longtime Slashdot reader theodp writes: MacRumors reports that Apple plans to expand iPhone and Apple Watch driver's licenses to 7 U.S. states (CT, KY, MS, OK, UT, AR, VA). A recent convert is the State of Illinois, whose website videos demo how you can use your Apple Wallet license to display proof of identity or age the next time you get carded by a cop, bartender, or TSA agent. The new states will join 13 others who already offer driver's licenses in the Wallet app (AZ, MD, CO, GA, OH, HI, CA, IA, NM, MT, ND, WV, IL).\n \nThere's certainly been a lot of foot-dragging by the states when it comes to embracing phone-based driver's licenses -- Slashdot reported that Iowa was ready to launch a mobile driver's license in 2014; they didn't get one until nearly a decade later, in late 2023.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='Pull+Over+and+Show+Me+Your+Apple+Wallet'%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%",
        "id": 4432103,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/12/29/2147256/pull-over-and-show-me-your-apple-wallet",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Pull Over and Show Me Your Apple Wallet'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-30T01:00:40.124728+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-30T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Most people use dating apps to find love. Tiffany Chau used one to hunt for a summer internship. This fall, the 20-year-old junior at California College of the Arts tailored her Hinge profile to connect with people who could offer job referrals or interviews. One match brought her to a Halloween party, where she networked in hopes of landing a product-design internship for the summer. While there, she got some tips from someone who had recently interviewed at Accenture. As for the connection with her date? Not so much. \"I feel like my approach to the dating apps is it being another networking platform like everything else, like Instagram or LinkedIn,\" Chau said.\n \nChau is among a cadre of workers who are using dating apps to boost their job searches. They're recognizing that the online job hunt is broken as unemployed workers flood the system, AI screens out resumes and many job matching programs are overwhelmed. Automation has squee",
        "id": 4432104,
        "language": "en-us",
        "link": "https://interviews.slashdot.org/story/25/12/29/2144201/tough-job-market-has-people-using-dating-apps-to-get-interviews",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tough Job Market Has People Using Dating Apps To Get Interviews",
        "vote": 0
    }
]