[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-10T16:00:34+00:00",
        "description": "Josef Fares and Hazelight’s past games have been big enough that it should come as a surprise to practically no one that Split Fiction is doing well at launch. The extent and degree of its success, however, does merit acknowledgement - here’s a game that has managed to put up better launch numbers than several major recent AAA games have achieved. \n\nWhat about Split Fiction has made it such a big hit? The confluence of hype, quality, and the goodwill accrued from several consistently great games that are quite unlike anything else on the market has led to Fares practically becoming a brand in himself, where his next game generates interest because it’s coming from him. \n\nThat, and Split Fiction being a good game - it’s no wonder it’s done as well as it has.",
        "id": 2288757,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Q6A5IB2xsIA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Q6A5IB2xsIA/hqdefault.jpg",
        "title": "Why Are HUNDREDS OF THOUSANDS of Gamers Addicted To Split Fiction?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-10T14:00:25+00:00",
        "description": "The First Berserker: Khazan is shaping up to be one of 2025's most anticipated games. Now, we have more details on the title through new gameplay that was shared by Nexon with us. \n\nThis new footage showcases various combat moves that players can do in the game and it’s all narrated by Khazan’s voice actor: Ben Starr.",
        "id": 2287671,
        "language": null,
        "link": "https://www.youtube.com/watch?v=SL98FtSxyiY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SL98FtSxyiY/hqdefault.jpg",
        "title": "The First Berserker: Khazan - Almost 8 Minutes of New, High Octane Gameplay",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-10T09:30:12+00:00",
        "description": "South of Midnight from Compulsion continues the studio’s surrealist creative streak. Real effort has been placed on making the game pop with its crafted storybook presentation. One of the most common questions revolve around its stop motion animation, something we explain in one of our first points. \n\nAside from its fantastical depiction of the deep south, it’s also a fun game world to just move through. The flow of movement feels like a parkour game with its wall running and gliding. Combat hasn’t gotten as much praise as other elements, but it still provides some cinematic boss fights, each accompanied by their own unique, and often bizarre, lyrical theme song. \n\nSouth of Midnight releases on April 8th for Xbox Series X/S and PC. It may not be the largest game this year, with an estimated playtime of around 12 hours or so, but the lower price and superb art direction make it an appealing proposition.",
        "id": 2285726,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Jzx6d3pKpzE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Jzx6d3pKpzE/hqdefault.jpg",
        "title": "South of Midnight – 15 Things You SHOULD KNOW Before You Buy This Really Cool Xbox Exclusive Game",
        "vote": 0
    }
]