[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T23:48:02.624342+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T23:20:00+00:00",
        "description": "Congress quietly removed provisions that would have let the U.S. military fix its own equipment without relying on contractors, despite bipartisan and Pentagon support. The Register reports: The House and Senate versions of the NDAA passed earlier both included provisions that would have extended common right-to-repair rules to US military branches, requiring defense contractors to provide access to technical data, information, and components that enabled military customers to quickly repair essential equipment. Both of those provisions were stripped from the final joint-chamber reconciled version of the bill, published Monday, right-to-repair advocates at the US Public Interest Research Group (PIRG) pointed out in a press release. [...]\n \nAccording to PIRG's press release on the matter, elected officials have been targeted by an \"intensive lobbying push\" in recent weeks against the provisions. House Armed Services Committee chair Mike Rogers (R-AL) and ranking Democrat Adam Smith (D-",
        "id": 4280028,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/09/2123219/congress-quietly-strips-right-to-repair-provisions-from-us-military-spending-bill",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Congress Quietly Strips Right-To-Repair Provisions From US Military Spending Bill",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T22:47:27.974875+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T22:40:00+00:00",
        "description": "Australia's world-first ban blocking under-16s from major social platforms has come into effect. The BBC is live reporting the reactions \"both from within Australia and outside it.\" From the report: I've been speaking to 12-year-old Paloma, who lives in Sydney and says she is \"sad\" about the ban. She spends between 30 minutes and two hours a day on social media. \"I'm upset... because I am part of several communities on Snapchat and TikTok,\" she tells me. \"I've developed good friendships on the apps, with people in the US and New Zealand, who have common interests like gaming, and it makes me feel more connected to the world.\"\n \nPaloma says she regularly talks about the ups and downs of her life with a boy of the same age in New Jersey, in the US, who she knows through gaming and TikTok. \"I feel like I can explore my creativity when I am in a community online with people of similar ages,\" she says. Everyone Paloma knows is \"a bit annoyed\" about the ban. By stopping them from using soci",
        "id": 4279654,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/09/2112230/millions-of-australian-teens-lose-access-to-social-media-as-ban-takes-effect",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Millions of Australian Teens Lose Access To Social Media As Ban Takes Effect",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T22:47:28.116476+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T22:02:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Shares of Apple were battered earlier this year as the iPhone maker faced repeated complaints about its lack of an artificial intelligence strategy. But as the AI trade faces increasing scrutiny, that hesitance has gone from a weakness to a strength -- and it's showing up in the stock market. Through the first six months of 2025, Apple was the second-worst performer among the Magnificent Seven tech giants, as its shares tumbled 18% through the end of June. That has reversed since then, with the stock soaring 35%, while AI darlings like Meta Platforms and Microsoft slid into the red and even Nvidia underperformed. The S&amp;P 500 Index rose 10% in that time, and the tech-heavy Nasdaq 100 Index gained 13%. [...] As a result, Apple now has a $4.1 trillion market capitalization and the second biggest weight in the S&amp;P 500, leaping over Microsoft and closing in on Nvidia. The shift reflects the market's questioning of the hundreds of ",
        "id": 4279655,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/09/2118205/apples-slow-ai-pace-becomes-a-strength-as-market-grows-weary-of-spending",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's Slow AI Pace Becomes a Strength As Market Grows Weary of Spending",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T21:44:09.557752+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T21:22:00+00:00",
        "description": "This year is set to be the world's second or third-warmest on record, potentially surpassed only by 2024'S record-breaking heat, the European Union's Copernicus Climate Change Service (C3S) said on Tuesday. From a report: The data is the latest from C3S following last month's COP30 climate summit, where governments failed to agree to substantial new measures to reduce greenhouse gas emissions, reflecting strained geopolitics as the U.S. rolls back its efforts, and some countries seek to weaken CO2-cutting measures. \n\nThis year will also likely round out the first three-year period in which the average global temperature exceeded 1.5 degrees Celsius (2.7 degrees Fahrenheit) above the 1850-1900 pre-industrial period, when humans began burning fossil fuels on an industrial scale, C3S said in a monthly bulletin. \"These milestones are not abstract -- they reflect the accelerating pace of climate change,\" said Samantha Burgess, strategic lead for climate at C3S.<p><div class=\"share_submissi",
        "id": 4279143,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/09/1959225/2025-will-be-worlds-second-or-third-hottest-year-on-record-eu-scientists-say",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "2025 Will Be World's Second or Third-Hottest Year on Record, EU Scientists Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T21:44:09.803642+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T20:41:00+00:00",
        "description": "Microsoft has announced that it will raise prices on its Microsoft 365 productivity suites for businesses and government clients starting in July 2026, marking the first commercial price increase since 2022. Small business and frontline worker plans face the steepest hikes: Business Basic jumps 16.7% to $7 per user per month, while frontline worker subscriptions surge up to 33%. Enterprise plans see more modest bumps, ranging from 5.3% for E5 to 8.3% for E3. Microsoft attributed the increases to more than 1,100 new features added to the suite, including AI-driven tools and security enhancements. Copilot remains a separate $30-per-month add-on.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+365+Prices+Rising+For+Businesses+and+Governments+in+July+2026%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F12%2F09%2F1953225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_ic",
        "id": 4279144,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/09/1953225/microsoft-365-prices-rising-for-businesses-and-governments-in-july-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft 365 Prices Rising For Businesses and Governments in July 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T20:43:30.195257+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T20:01:00+00:00",
        "description": "Pinduoduo in China, Shopee in Southeast Asia, and Meesho in India operate in markets that could hardly be more different -- an upper-middle-income industrial state, a stitched-together archipelago of under-banked economies, and a country where three-quarters of retail is unorganized and e-commerce penetration sits at about 7% -- yet all three have landed on the same business model. \n\nThese platforms run asset-light marketplaces specializing in cheap goods and slow delivery, monetizing through logistics mark-ups, advertising, and installment credit rather than retail margins. Temu and Shein are further variations now expanding in the U.S. and Europe. \n\nThe economics are thin. Pinduoduo's EBITDA margins on GMV sit in a 0-4% band; Meesho's group-wide EBITDA hovers around break-even. Neither charges commissions on most sales; both earn through logistics mark-ups and advertising. Sponsored listings account for 1-3% of GMV at Indian marketplaces and 4-5% at Alibaba and Pinduoduo. \n\nCredit i",
        "id": 4278653,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/09/1941236/the-inevitable-shape-of-cheap-online-retail",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Inevitable Shape of Cheap Online Retail",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:38:54.725703+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T19:28:00+00:00",
        "description": "The Pokemon Trading Card Game has quietly transformed into something its creators never intended: a speculative asset class dominated by adults hunting for profit while children struggle to find a single pack on store shelves. The resale market has climbed so high that the latest set, Phantasmal Flames, had a rare Charizard illustration valued at more than $800 before anyone had even pulled one from a pack -- a pack that retails for about $5.3. \n\nBen Thyer, owner of BathTCG in Bath, has watched his shop become a flashpoint. His staff have received threats from customers, and he's heard reports of attacks and robberies at other stores. He stopped selling whole boxes of booster packs and now limits individual pack purchases. On Amazon, customers can only enter raffles for the chance to buy cards at all.The Pokemon Company printed 10.2 billion cards in the year ending March 2025 and still cannot meet demand. The company shared a seven-month-old statement saying it is printing \"at maximum",
        "id": 4277969,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/09/1928240/how-pokemon-cards-became-a-stock-market-for-millennials",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Pokemon Cards Became a Stock Market For Millennials",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:38:54.934910+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T18:15:00+00:00",
        "description": "Microsoft announced on Tuesday its largest-ever investment in Asia -- $17.5 billion over four years starting in 2026 -- to expand cloud and AI infrastructure across India, fund skilling programs, and support ongoing operations in the country. The commitment adds to a $3 billion investment the company announced in January 2025 that is on track to be spent by the end of 2026. A new hyperscale cloud region in Hyderabad is set to go live in mid-2026 and will be Microsoft's largest in India, comprising three availability zones. \n\nThe company also plans to integrate AI into two government employment platforms -- e-Shram and the National Career Service -- that serve more than 310 million informal workers. Microsoft is doubling its India skilling target to 20 million people by 2030; since January, it has already trained 5.6 million.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+To+Invest+%2417.5+Billion+in+India%",
        "id": 4277970,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/09/1815211/microsoft-to-invest-175-billion-in-india",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft To Invest $17.5 Billion in India",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T18:02:22.726437+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:25:00+00:00",
        "description": "Michael Saylor's software company Strategy, formerly known as MicroStrategy, built a financial model that some observers called an \"infinite-money machine\" by stockpiling hundreds of thousands of bitcoins and issuing stock and debt to buy more, but that machine appears to be breaking down. The company's stock peaked above $450 in mid-July and ended November at $177.18, a 60% decline. Bitcoin fell only 25% over the same period. The gap between Strategy's market cap and the value of its bitcoin holdings has nearly vanished. \n\nAt one point last week, the company's market value dipped below the value of its bitcoins after accounting for debt. Strategy announced it had built a $1.4 billion dollar reserve by selling more stock to cover required dividend payments to preferred shareholders over the next twelve months. The company also disclosed it might sell some of its coins if its value continues to fall, a reversal from Saylor's February tweet declaring \"Never sell your Bitcoin.\" Professio",
        "id": 4277284,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/09/173219/what-happens-when-an-infinite-money-machine-unravels",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happens When an 'Infinite-Money Machine' Unravels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:54:59.998475+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:50:00+00:00",
        "description": "Microsoft's Xbox consoles were conspicuously absent from Black Friday's winners, failing to crack the top three in U.S. sales during one of the retail calendar's most important weeks. According to Circana analyst Mat Piscatella, the PlayStation 5 captured 47% of Black Friday week console sales ending November 29, followed by the Nintendo Switch 2 at 24% and -- somewhat remarkably -- the NEX Playground, a Kinect-like Android device aimed at children, at 14%. \n\nMicrosoft ran no promotions on its consoles during the period. The Xbox Series X currently retails for $650 following this year's price increase, up from its $500 launch price in 2020. Sony, by contrast, discounted the PS5 by roughly 40% at some retailers. Piscatella noted on Bluesky that products without price promotions typically see no seasonal lift. Costco has removed Xbox consoles from its U.S. and UK websites.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?statu",
        "id": 4276614,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/09/1630206/xbox-is-bleeding-out",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Xbox Is Bleeding Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:55:00.148392+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:11:00+00:00",
        "description": "In February, a six-month-old baby named KJ Muldoon became the first person ever to receive a CRISPR gene-editing treatment customized specifically for his unique genetic mutation, a milestone that researchers say marks a turning point in how medicine might approach the thousands of rare diseases that collectively affect 30 million Americans. Muldoon was born with a type of urea-cycle disorder that gives patients roughly a 50% chance of surviving infancy and typically requires a liver transplant; he is now a healthy 1-year-old who recently took his first steps. \n\nThe treatment's significance extends beyond one child. Scientists at UC Berkeley's Innovative Genomics Institute and the Children's Hospital of Philadelphia are now planning clinical trials that would use Muldoon's therapy as a template, tweaking the molecular \"address\" in the CRISPR system to target different mutations in other children with urea-cycle disorders. Last month, FDA officials Marty Makary and Vinay Prasad announc",
        "id": 4276615,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/09/1612202/the-rarest-of-all-diseases-are-becoming-treatable",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Rarest of All Diseases Are Becoming Treatable",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T15:52:29.889671+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T15:21:00+00:00",
        "description": "A tenured USC professor is arguing that universities need to fundamentally rethink their value proposition as AI rapidly closes the gap on human instruction and a loneliness epidemic grips the generation most likely to be sitting in their lecture halls. Eric Anicich, an associate professor at USC's Marshall School of Business, wrote in the Los Angeles Times that nearly three-quarters of 16- to 24-year-olds now report feeling lonely, young adults spend 70% less time with friends in person compared to two decades ago, and a growing majority of Gen Z college graduates say their degree was a \"waste of money.\" \n\nAnicich points to a recent Harvard study finding that students using an AI tutor learned more than twice as much as those in traditional active-learning classes, and did so in less time. The implication is stark: if instruction becomes abundant and cheap, colleges must sell what remains scarce -- genuine human community. He notes that his doctoral training included zero coursework ",
        "id": 4276025,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/09/1511224/colleges-oversold-education-now-they-must-sell-connection",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Colleges Oversold Education. Now They Must Sell Connection'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T14:50:07.900364+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T14:41:00+00:00",
        "description": "Microsoft Excel, the 40-year-old spreadsheet application that helped establish personal computers as essential workplace tools and contributed to Microsoft's current valuation of nearly $4 trillion, has weathered both the rise of cloud computing and the current AI boom largely unscathed. In its most recent quarter, commercial revenue for Microsoft 365 -- the bundle including Excel, Word, and PowerPoint -- increased 17% year over year, and consumer revenue rose 28%. \n\nThe software traces its origins to a 1983 Microsoft offsite under the code name Odyssey, where engineers set out to clone Lotus 1-2-3. That program had itself cloned VisiCalc, the first computerized spreadsheet, created by Dan Bricklin for the Apple II in the late 1970s. Bricklin never patented VisiCalc. \"Financially it would have been great if we'd have been able to patent it,\" he told Bloomberg. \"And there would be a Bricklin Building at MIT, instead of a Gates Building.\" \n\nExcel now counts an estimated 500 million payi",
        "id": 4275386,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/09/1428239/microsoft-excel-turns-40-remains-stubbornly-unkillable",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Excel Turns 40, Remains Stubbornly Unkillable",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T14:50:08.275936+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T14:01:00+00:00",
        "description": "India's dominant airline IndiGo has cancelled roughly 3,000 flights since last week after new pilot fatigue regulations collided with technical issues and the seasonal schedule shift, stranding more than half a million passengers and forcing aviation authorities to reverse course on the safety rules they had just implemented. \n\nInterGlobe Aviation, IndiGo's parent company, told regulators that stricter requirements for night flying and weekly rest periods created an acute crew shortage. The Airline Pilots Association of India called the regulatory rollback a \"dangerous precedent,\" noting that management had known about the requirements since early last year. \n\nIndiGo controls 65.6% of India's domestic aviation market as of October 2025 and briefly became the world's most valuable airline in April. The crisis arrives as India's second-largest carrier, Air India, remains under investigation following a June crash that killed 241 passengers and crew. Authorities have imposed temporary pr",
        "id": 4275387,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/09/141227/indias-aviation-crisis-is-all-about-too-big-to-tame",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India's Aviation Crisis Is All About Too Big to Tame",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T13:46:27.410178+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: The journal Regulatory Toxicology and Pharmacology has formally retracted a sweeping scientific paper published in 2000 that became a key defense for Monsanto's claim that Roundup herbicide and its active ingredient glyphosate don't cause cancer. Martin van den Berg, the journal's editor in chief, said in a note accompanying the retraction that he had taken the step because of \"serious ethical concerns regarding the independence and accountability of the authors of this article and the academic integrity of the carcinogenicity studies presented.\"\n \nThe paper, titled Safety Evaluation and Risk Assessment of the Herbicide Roundup and Its Active Ingredient, Glyphosate, for Humans, concluded that Monsanto's glyphosate-based weed killers posed no health risks to humans -- no cancer risks, no reproductive risks, no adverse effects on development of endocrine systems in people or animals. Regulators around the world have cited the paper ",
        "id": 4274801,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/09/053254/science-journal-retracts-study-on-safety-of-monsantos-roundup",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Science Journal Retracts Study On Safety of Monsanto's Roundup",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T10:41:08.630150+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T10:00:00+00:00",
        "description": "Researchers and moderators are increasingly concerned that ChatGPT-style language is bleeding into everyday speech and writing. The topic has been explored in the past but \"two new, more anecdotal reports, suggest that our chatbot dialect isn't just something that can be found through close analysis of data,\" reports Gizmodo. \"It might be an obvious, every day fact of life now.\" Slashdot reader joshuark shares an excerpt from the report: Over on Reddit, according to a new Wired story by Kat Tenbarge, moderators of certain subreddits are complaining about AI posts ruining their online communities. It's not new to observe that AI-armed spammers post low-value engagement bait on social media, but these are spaces like r/AmItheAsshole, r/AmIOverreacting, and r/AmITheDevil, where visitors crave the scintillation or outright titillation of bona fide human misbehavior. If, behind the scenes, there's not really a grieving college student having her tuition cut off for randomly flying off the ",
        "id": 4273451,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/09/0440240/evidence-that-humans-now-speak-in-a-chatbot-influenced-dialect-is-getting-stronger",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Evidence That Humans Now Speak In a Chatbot-Influenced Dialect Is Getting Stronger",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T07:36:36.185468+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T07:00:00+00:00",
        "description": "Anthropic is bringing Claude Code directly into Slack, letting developers spin up coding sessions from chat threads and automate workflows without leaving the app. TechCrunch reports: Previously, developers could only get lightweight coding help via Claude in Slack -- like writing snippets, debugging, and explanations. Now they can tag @Claude to spin up a complete coding session using Slack context like bug reports or feature requests. Claude analyzes recent messages to determine the right repository, posts progress updates in threads, and shares links to review work and open pull requests.\n \nThe move reflects a broader industry shift: AI coding assistants are migrating from IDEs (integrated development environment, where software development happens) into collaboration tools where teams already work. [...] While Anthropic has not yet confirmed when it would make a broader rollout available, the timing is strategic. The AI coding market is getting more competitive, and differentiatio",
        "id": 4272542,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/09/0417242/claude-code-is-coming-to-slack",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Claude Code Is Coming To Slack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T04:32:31.785715+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: Since online genealogy services began operating, millions of people have sent them saliva samples in hopes of learning about their family roots and discovering far-flung relatives. These services also appeal to law enforcement authorities, who have used them to solve cold case murders and to investigate crimes like the 2022 killing of four University of Idaho students. Crime-scene DNA submitted to genealogy sites has helped investigators identify suspects and human remains by first identifying relatives.\n \nThe use of public records and family-tree building is crucial to this technique, and its main tool has been the genealogy site Ancestry, which has vast amounts of individual DNA profiles and public records. More than 1,400 cases have been solved with the help of so-called genetic genealogy investigations, most of them with help from Ancestry. But a recent step taken by the site is now deterring many police agencies from em",
        "id": 4271819,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/09/008255/cold-case-inquiries-stall-after-ancestrycom-revisits-policy-for-users",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cold Case Inquiries Stall After Ancestry.com Revisits Policy For Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T02:29:33.566948+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T02:00:00+00:00",
        "description": "Europol's GRIMM taskforce has arrested nearly 200 people accused of running or participating in \"violence-as-a-service\" schemes where cybercrime groups recruit youth online for real-world attacks. \"These individuals are groomed or coerced into committing a range of violent crimes, from acts of intimidation and torture to murder,\" the European police said on Monday. The Register reports: GRIMM began in April, and includes investigators from Belgium, Denmark, Finland, France, Germany, Iceland, the Netherlands, Norway, Spain, Sweden, the UK, plus Europol experts and online service providers. During its first six months, police involved in this operation arrested 63 people directly involved in carrying out or planning violent crimes, 40 \"enablers\" accused of facilitating violence-for-hire services, 84 recruiters, and six \"instigators,\" five of whom the cops labeled \"high-value targets.\" [...]\n \nMany of the criminals involved in recruiting and carrying out these violence-for-hire services ",
        "id": 4271319,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/08/2359222/193-cybercrims-arrested-accused-of-plotting-violence-as-a-service",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "193 Cybercrims Arrested, Accused of Plotting 'Violence-As-a-Service'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T02:29:33.709169+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T01:30:00+00:00",
        "description": "The Trump administration will allow Nvidia to resume selling H200 chips to China, but only if the U.S. government takes a 25% cut. Axios reports: Trump said on Truth Social that he'll allow Nvidia to sell H200 chips -- the generation of chips before its current, more-advanced Blackwell lineup -- to China, with the U.S. government pocketing a quarter of the revenue. He said he would apply \"the same approach to AMD, Intel, and other GREAT American Companies.\"\n \nAmerican defense hawks fear that China could use Nvidia chips to advance its military ambitions. Trump said Monday that the sales will be subject to \"conditions that allow for continued strong National Security.\" The blockade remains in place for Nvidia's current generation of Blackwell chips, which will be replaced in the second half of 2026 by even more advanced Rubin chips. Huang said recently he was unsure if China would want the older chips. \"We applaud President Trump's decision to allow America's chip industry to compete t",
        "id": 4271320,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/08/2351223/nvidia-can-sell-h200-chips-to-china-for-25-us-cut",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Can Sell H200 Chips To China For 25% US Cut",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T01:28:34.642408+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T01:10:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: A coalition of more than 230 environmental groups has demanded a national moratorium on new datacenters in the U.S., the latest salvo in a growing backlash to a booming artificial intelligence industry that has been blamed for escalating electricity bills and worsening the climate crisis. The green groups, including Greenpeace, Friends of the Earth, Food &amp; Water Watch and dozens of local organizations, have urged members of Congress to halt the proliferation of energy-hungry datacenters, accusing them of causing planet-heating emissions, sucking up vast amounts of water and exacerbating electricity bill increases that have hit Americans this year.\n \n\"The rapid, largely unregulated rise of datacenters to fuel the AI and crypto frenzy is disrupting communities across the country and threatening Americans' economic, environmental, climate and water security,\" the letter states, adding that approval of new data centers should be p",
        "id": 4271064,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/08/2158223/more-than-200-environmental-groups-demand-halt-to-new-us-datacenters",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Than 200 Environmental Groups Demand Halt To New US Datacenters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T01:28:34.770120+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T00:30:00+00:00",
        "description": "Longtime Slashdot reader hackingbear writes: Taiwan's government has ordered a one-year block of a popular, mainland Chinese-owned social media app Xiaohongshu, also known as The Little RedNote, citing its failure to cooperate with authorities over fraud-related concerns. Taiwan's Ministry of the Interior on Thursday cited Xiaohongshu's, which does not have business presence on the island, refusal to cooperate with authorities as the basis for the ban, claiming that the platform has been linked to more than 1,700 fraud-related cases that resulted in financial losses of 247.7 million Taiwanese dollars ($7.9 million). \"Due to the inability to obtain necessary data in accordance with the law, law enforcement authorities have encountered significant obstacles in investigations, creating a de facto legal vacuum,\" the ministry said in a statement. \nChinese Nationalist Party (KMT), Taiwan's opposition party, Chairwoman Cheng Li-wun decried the government plan to suspend access to Chinese soc",
        "id": 4271065,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/08/2148249/taiwan-cries-censorship-as-government-bans-rednote",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Taiwan Cries Censorship As Government Bans Rednote",
        "vote": 0
    }
]