[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:15.432219+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T18:00:07+00:00",
        "description": "In this emotional and forward-thinking talk, Dr. Hossein Zargartalebi shares his deeply personal journey from a hospital room to a scientific breakthrough. His innovation—a molecular sensor that detects proteins in real time—may unlock a new era in healthcare, one where disease can be caught long before symptoms appear. By turning biology’s quietest signals into a clear voice, this technology gives us something medicine has never truly had before: the ability to act early, save lives, and give people back the most precious thing of all—time.\n\n#TEDx #TEDxChicago #healthtech #biosensors #innovation #science #biomedicalengineering #proteins #futureofmedicine #ShanaKelleyLab #DrHosseinZargartalebi #molecularsensing \n\nDr. Hossein Zargartalebi is a biotech innovator and entrepreneur developing next-generation wearable and implantable biosensors that monitor protein biomarkers in real time, inside the body. His work enables continuous tracking of inflammation, diabetes, heart failure, and ot",
        "id": 4277559,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5qWBAxf-my0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5qWBAxf-my0/hqdefault.jpg",
        "title": "What if we could hear disease? | Dr. Hossein Zargartalebi | TEDxChicago",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:15.560392+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T18:00:01+00:00",
        "description": "In her TEDxWilmingtonSalon, Sandy Parker Martinez exposes the real limits women face after 50—and it’s not age. She reveals how old stories, “beige living,” and invisible curbs shrink possibility, and how bold presence and small brave steps can ignite a full-on second-half reveal. Sandy Parker Martinez knows reinvention like most people know coffee—essential, bold, and best when shared. A dynamic speaker, author, and host of the Pink Lady Posse Podcast, Sandy has inspired audiences from 3 to 5,000 across three countries, with clients ranging from Southwest Airlines to Southern Living. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4277560,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=YZOBLtRm1cQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YZOBLtRm1cQ/hqdefault.jpg",
        "title": "The Second Half Is Not A Decline -- It's Your Reveal. | Sandy Parker Martinez | TEDxWilmingtonSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:15.690895+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:59:25+00:00",
        "description": "In this engaging TEDx talk, Nash Narasimhan draws from his experience leading brand experience across HP Stores. He unpacks how storytelling, consumer insight, and emotional connection transform the way people interact with technology.\nHe reveals how brands can create experiences that outlast transactions and build loyalty rooted in trust.\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx\n\n Head, HP Stores - driving HP’s retail and youth engagement strategies across key markets. A leader who understands both technology and people, he’s passionate about empowering young creators through innovation, storytelling, and digital transformation. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4277561,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=s_fwJ7vaSIg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s_fwJ7vaSIg/hqdefault.jpg",
        "title": "Selling Stories, Not Products  | Nash Narasimhan | TEDxChrist University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:15.789029+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:59:13+00:00",
        "description": "In this insightful TEDx talk, former Finance Secretary Of India ,Subhash Garg shares decades of policy experience, breaking down how economic decisions , public finance structures, and governance frameworks shape the direction of a nation. He offers a rare inside view of India’s financial systems, discussing the interplay of regulation, strategy, and public welfare.\nThrough real-world examples, he explains how economic reforms evolve and how citizens can better understand the forces driving national growth.\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx\n An IAS officer of 1983 Batch. Served for 36 years in many interesting and challenging public positions including District Magistrate Rajasamand, Director Agriculture, MD Roadways, Principal Secretary Finance Rajasthan, Joint Secretary Expenditure, Executive Director World Bank, Economic Affairs and Finance Secretary Government",
        "id": 4277562,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=a-Si9bq57tI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/a-Si9bq57tI/hqdefault.jpg",
        "title": "Economic Decisions That Shape a Nation | Subhash Chandra Garg | TEDxChrist University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:15.918078+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:59:07+00:00",
        "description": "In this sharp and candid TEDx talk, investment banker Sharan Patil demystifies the\nhigh-pressure world of finance. He explores the realities of deal-making, risk assessment, and the mindset required to thrive in competitive capital markets.\nThrough stories and lived experiences, he breaks down how young professionals can build credibility, resilience, and strategic thinking early in their careers.\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx\n Investment Banker - bringing a global perspective to finance, mergers, and capital markets. With a background in high-value transactions and corporate advisory, he represents the next generation of finance professionals driving strategic growth and smart investments. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4277563,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6Qcpn9KGq-s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6Qcpn9KGq-s/hqdefault.jpg",
        "title": "Inside the World of Investment Banking | Sharan Patil | TEDxChrist University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:16.061595+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:58:42+00:00",
        "description": "Valeria's talk shares how movement became the turning point that saved her mental, emotional, and physical health, showing that fitness isn’t about changing your body, it’s about reconnecting with who you truly are. Valeria Murillo Luna is a movement advocate and fitness entrepreneur focused on inspiring healthier, stronger, more empowered lives. After experiencing deep mental, emotional, and physical burnout, Valeria discovered movement not as a way to change her body, but as a lifeline that restored her identity, resilience, and sense of purpose.\n\nToday, she helps individuals reconnect with themselves through intentional movement practices that cultivate clarity, confidence, and emotional healing. Her work centers on shifting the narrative from exercise as punishment or performance to movement as medicine, a powerful tool for self-worth, inner alignment, and sustainable transformation.\n\nBased in Tirana, Albania, Valeria leads movement-based experiences that merge physical training w",
        "id": 4277564,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=N4ssoD7pu5w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/N4ssoD7pu5w/hqdefault.jpg",
        "title": "Movement As Medicine | Valeria Murillo | TEDxUniversity of Tirana Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:16.181640+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:58:18+00:00",
        "description": "Paola explora la esencia del liderazgo auténtico: la capacidad de liderarse a uno mismo antes de guiar a otros. Con un enfoque claro y reflexivo, destaca que el cambio profundo inicia en el interior, a través de la conciencia, la responsabilidad y la coherencia personal. Su mensaje invita a activar el poder interno que impulsa la acción con propósito, recordándonos que el liderazgo transformacional no es un título, sino una elección diaria que se refleja en cada paso. Madre desde hace 25 años, es Ingeniera en Ciencias Empresariales con un Máster en Administración Estratégica y más de 20 años de experiencia en posiciones gerenciales en diversos sectores. Es fundadora y Directora Ejecutiva de PATH Transforming Group, consultora especializada en desarrollo del talento humano y empresarial. Reconocida como Top LinkedIn Leader Ecuador y Top Voice en “Leadership” y “Management”, es docente titular en la Universidad Católica de Santiago de Guayaquil y conferencista sobre empoderamiento, lide",
        "id": 4277565,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=N3D0-EXxbYU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/N3D0-EXxbYU/hqdefault.jpg",
        "title": "Transformar es primero transformarse | Paola Traverso | TEDxISMAC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:16.331371+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:58:08+00:00",
        "description": "Karla ofrece una reflexión profundamente humana sobre la fortaleza emocional y el proceso de sanar. Con sensibilidad y claridad, explora el valor de detenerse, nombrar lo que duele y elegir con consciencia, mostrando cómo cada acto de autocuidado se convierte en un gesto de valentía. Su mensaje central recuerda que sanar también es avanzar, y que escogernos a nosotros mismos puede ser un acto profundamente transformador. Karla es es CEO y cofundadora de Más Bienestar, consultora especializada en salud mental organizacional. Diseña programas de bienestar que fortalecen habilidades humanas, liderazgo consciente y culturas laborales sostenibles. Como conferencista, inspira la transformación personal y profesional desde la gestión emocional y el equilibrio. Su misión es ayudar a las personas a alcanzar su máximo desempeño sin sacrificar bienestar. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www",
        "id": 4277566,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DV9Z69NWnXU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DV9Z69NWnXU/hqdefault.jpg",
        "title": "La trampa de ser fuertes todo el tiempo | Karla Sarmiento | TEDxISMAC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:16.446088+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:57:48+00:00",
        "description": "Xavier nos invita a cuestionar nuestros paradigmas sobre el arte y su lugar en la vida profesional. Con claridad y visión estratégica, demuestra que sí es posible vivir del arte cuando el talento se acompaña de disciplina, formación y creatividad aplicada. Su mensaje destaca la importancia de aprender a monetizar la creatividad, desarrollar una identidad auténtica y potenciar los talentos desde la infancia, convirtiendo el arte en un motor de vida, identidad y libertad. Artista autodidacta, diseñador creativo e ingeniero comercial apasionado por el arte, los colores y el interiorismo, sus primeras pinceladas fueron a la edad de 13 años, actualmente cuenta con mas de 2000 murales en 20 países, sus obras se encuentra en los mejores espacios de diseño del país y ha llegado a crear un sistema rentable alrededor de su creatividad. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4277567,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NEO3QZ3tno4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NEO3QZ3tno4/hqdefault.jpg",
        "title": "El paradigma de vivir del arte | Xavier Calderón | TEDxISMAC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:16.587866+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:57:28+00:00",
        "description": "In this talk, Xhoana shares the practical and often overlooked steps that helped her become a TEDx Speaker and build a career on her own terms. \n\nShe explains why applying before you feel fully qualified matters, how referrals and direct outreach can open unexpected doors, and why standing out is essential in today’s competitive job market. Xhoana Sylaj is an international workshop leader, seminar trainer, and women’s empowerment advocate dedicated to helping women navigate and excel in workplaces that were never built with them in mind. With experience spanning Germany and beyond, Xhoana has spent years working directly with diverse communities, students, and professionals, equipping them with practical strategies to thrive in environments where bias, unequal expectations, and invisible barriers still persist.\n\nAs the founder behind Divas Dialogue, she creates spaces for women to learn from one another, share real experiences, and build the confidence and strategic mindset needed to ",
        "id": 4277568,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=AoK14NTfkpE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AoK14NTfkpE/hqdefault.jpg",
        "title": "Get, Keep And Quit Your Job | Xhoana Sylaj | TEDxUniversity of Tirana Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:16.694634+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:57:16+00:00",
        "description": "Daniel Guidiño nos conduce a una reflexión profunda sobre cómo se construyen el aprendizaje y el cambio auténtico. Con claridad y humanidad, destaca que el conocimiento florece cuando se comparte y que toda persona no renace desde cero, sino crecemos desde lo ya construido. Su mensaje invita a despertar la curiosidad, la apertura mental y el compromiso personal con el crecimiento. Daniel es nacido en Rumania, habla tres idiomas y ha recorrido caminos diversos: guía turístico, vendedor, coach financiero y docente. Cada experiencia le ha enseñado que la vida no se mide por las pérdidas, sino por la fuerza de reinventarse. Hoy busca compartir cómo cada cambio puede ser una oportunidad para crecer, evolucionar y construir una vida con propósito. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4277569,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9ZemxuI1lCA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9ZemxuI1lCA/hqdefault.jpg",
        "title": "La inesperada libertad del desempleo | Daniel Gudiño | TEDxISMAC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:16.836930+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:55:46+00:00",
        "description": "En esta charla, María José Núñez nos invita a redescubrir el impacto profundo de la enseñanza. Con sensibilidad y claridad, revela cómo un gesto o una palabra de un maestro puede transformar vidas y trascender generaciones. Su mensaje destaca la docencia como un acto de vocación, entrega y esperanza en el futuro, donde cada clase y cada guía se convierten en semillas que iluminan caminos más allá del aula. María José es una apasionada del marketing digital, la comunicación y el branding. Con 15 años de trayectoria en el mundo corporativo y tres años como docente universitaria, conecta su experiencia profesional con la enseñanza para inspirar a nuevas generaciones. A través de una metodología de aprendizaje inversa y empática, promueve que cada paso en el aula se transforme en el inicio de una carrera profesional con propósito y trascendencia. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.",
        "id": 4277570,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Z2zIGReY0to",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z2zIGReY0to/hqdefault.jpg",
        "title": "La docencia: el origen de lo que trasciende | María José Nuñez | TEDxISMAC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:16.948143+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:55:35+00:00",
        "description": "En esta charla, Marcelo nos invita a repensar lo esencial: las personas y las relaciones que construimos. Con una mirada humana y profunda, destaca el valor del capital social basado en la confianza, la integridad y la autenticidad. A través de su mensaje, nos inspira a fortalecer una comunicación que escucha, conecta y transforma, recordándonos que una vida con propósito no se encuentra al azar, sino que se edifica día a día mediante pequeñas acciones con gran impacto. Marcelo impulsa iniciativas que educan, conectan e inspiran a comunidades de emprendimiento, innovación y profesionales. Cree en la comunicación como motor de cambio y en la colaboración con propósito. Este camino, que hoy transita, empezó cuando decidió tomar las riendas de su vida, lo que le permitió moverse entre sectores privados, públicos y organizaciones, aportando valor en cada desafío asumido. Busca entender que somos puentes para las demás personas nos da la capacidad de construir relaciones con propósito y ha",
        "id": 4277571,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7vd6_HmbAFs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7vd6_HmbAFs/hqdefault.jpg",
        "title": "Comunidades que Suman | Marcelo Rojas | TEDxISMAC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:17.084632+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:54:41+00:00",
        "description": "Neisi comparte una historia profunda y transformadora sobre resiliencia y propósito. Con una voz auténtica y poderosa, revela que la verdadera victoria no se encuentra únicamente en el podio, sino en la capacidad de levantarse tras cada caída. A través de sus experiencias, nos muestra cómo cada desafío puede convertirse en entrenamiento para volver más fuertes, más sabios y más determinados. Neisi Dajomes es campeona olímpica de halterofilia y un símbolo de fuerza más allá del deporte. Desde su infancia en la Amazonía Ecuatoriana ha transformado el dolor en determinación y los obstáculos en inspiración. Su historia no solo habla de levantar pesas, sino de levantar el alma, la esperanza y el poder de seguir siempre adelante. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4277572,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_w7AK53w_hk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_w7AK53w_hk/hqdefault.jpg",
        "title": "El peso que no se ve | Neisi Dajomes | TEDxISMAC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T19:15:17.202795+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:54:31+00:00",
        "description": "In this forward looking talk, Dr. Muhammad Azib explores the transformative power of modern technology in the medical field. He breaks down how Artificial Intelligence and Machine Learning are not just buzzwords, but essential tools that can revolutionize healthcare delivery and education. By bridging the gap between clinical medicine and digital innovation, Dr. Azib presents a roadmap for a future where technology acts as a catalyst for better health outcomes, turning the complexities of data into life saving solutions. \n\nDr. Muhammad Azib is a pioneer at the intersection of medicine and technology. He holds the unique distinction of being Pakistan’s first full stack technologist and medical doctor. A graduate of Dow University of Health Sciences. His work has engaged over 55,000 students globally, fundamentally shifting the landscape of medical education.\n\nThis talk was given at TEDxDUHS 2025 at Dow University of Health Sciences under the theme \"Magic in Mundane.\"\nThis talk was give",
        "id": 4277573,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ebUJ9qR6KNo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ebUJ9qR6KNo/hqdefault.jpg",
        "title": "1 Billion Lives — Revolutionizing Medical Education | Dr. Muhammad Azib | TEDxDUHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:32.908054+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:33:25+00:00",
        "description": "In this insightful TEDx talk, Damian Miller, CEO and Co-Founder of Orb Energy, traces his journey from researching solar adoption in emerging markets to building one of India’s most innovative solar companies.\nHe explains how practical technology, financing models, and on-ground resilience can accelerate renewable energy adoption at scale.\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx\n Co-Founder & CEO, Orb Energy - a global pioneer in renewable energy solutions. With nearly two decades in the solar industry, he’s helped thousands of businesses and homes transition to clean power. His journey reflects how sustainable innovation can drive real change. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4276993,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HKSybiogxog",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HKSybiogxog/hqdefault.jpg",
        "title": "Building Solar for the Real World | Damian Miller | TEDxChrist University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:33.102893+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:29:48+00:00",
        "description": "Akshay Singh is a technocrat, defense innovator, and entrepreneur dedicated to strengthening India’s security through indigenous technology. As Managing Director of Evigway Technologies Pvt. Ltd., he spearheads initiatives in data analytics, ICT, forensics, and mechatronics tailored for the Indian defense sector. With early research experiences at ISRO and DRDO, Akshay developed a deep appreciation for rigor, structure, and accountability in high-stakes environments. These lessons shaped his philosophy: success is less about one-time breakthroughs and more about the consistent tracking, review, and refinement that turn vision into reality. At Evigway, he has built systems where bold ideas are carefully measured and refined until they transform into impactful, real-world solutions. In his TED Talk, Akshay will challenge audiences to rethink success—not as a singular achievement, but as the compound effect of disciplined daily reviews and persistent effort. His insights show why consist",
        "id": 4276994,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=RTxBNMz65Qs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RTxBNMz65Qs/hqdefault.jpg",
        "title": "From Startup Chaos to MNC Clarity | Akshay Singh | TEDxIITRopar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:33.265417+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:29:29+00:00",
        "description": "A esperteza que nos define pode ser a mesma que nos atrasa.\n\nO Brasil é a 10ª maior economia do mundo, mas ocupa o 107º lugar no ranking global de combate à corrupção. Como explicar tamanha distância entre potencial e realidade? Nesta palestra do TEDxJoãoPessoa, o Procurador da República Renan Paes Felix apresenta uma reflexão profunda e provocadora sobre o jeitinho brasileiro, esse traço cultural que mistura criatividade, esperteza e contradições éticas que moldam nossa identidade.\n\nCom histórias reais, pesquisas, dados e duas décadas de experiência no sistema de justiça criminal, Renan revela como pequenos comportamentos cotidianos se transformam em obstáculos estruturais ao desenvolvimento do país. E mostra por que ressignificar o jeitinho pode ser a chave para transformar a cultura brasileira sem abrir mão da nossa inventividade.\n\nUma conversa necessária sobre responsabilidade individual, integridade, pertencimento e futuro.\nPorque o Brasil tem jeito, e a mudança começa no espelho",
        "id": 4276995,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BrNOCz8PiuA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BrNOCz8PiuA/hqdefault.jpg",
        "title": "Jeitinho brasileiro e a cultura da corrupção | Renan Paes Felix | TEDxJoaoPessoaSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:33.539902+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:29:06+00:00",
        "description": "In questo IGNITE TALK, Lara, psicoterapeuta, si domanda perchè molte persone si occupano del proprio mondo interiore solo durante le crisi, con conseguenze come ansia, solitudine e stress. La scarsa consapevolezza emotiva, infatti, danneggia l’individuo e alimenta conflitti sociali. Propone l’integrazione di pratiche semplici e quotidiane, accessibili a tutti, come prevenzione. Attraverso un esercizio pratico con il pubblico, mostra come sia possibile modificare rapidamente processi mentali e neurali. Presenta la sua visione di un futuro in cui la cura della mente sia normale e annuncia di aver fondato in Italia una piattaforma digitale per allenare il benessere psicologico. In this IGNITE TALK, Lara, psychotherapist, wonders why many people take care of their inner world only during moments of crisis, leading to consequences such as anxiety, loneliness, and stress. Poor emotional awareness harms individuals and fuels social conflict. She proposes integrating simple, everyday practice",
        "id": 4276996,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xJsZNTZmqz4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xJsZNTZmqz4/hqdefault.jpg",
        "title": "Why do we brush our teeth but not our mind? | Lara Zucchini | TEDxLakeComo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:33.857667+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:28:57+00:00",
        "description": "Nicola, esperto di cybersecurity, illustra l’evoluzione delle minacce informatiche paragonandole a tempeste digitali. Spiega come gli aggressori siano passati da hobbisti a organizzazioni criminali. Attraverso un caso reale di ransomware che ha colpito una multinazionale nel novembre 2022, mostra le sfide della risposta agli incidenti e introduce il concetto di “sopravvissuti” digitali. Analizza poi l’impatto dell’intelligenza artificiale, che automatizza gli attacchi e abilita nuove minacce come i “voice clone attacks”. Conclude evidenziando il declino del pensiero critico e offrendo consigli pratici per sopravvivere nell’era digitale, invitando a verificare le informazioni, formarsi e preservare la propria umanità. Nicola, a cybersecurity expert, illustrates the evolution of cyber threats by comparing them to digital storms. He explains how attackers have shifted from hobbyists to organized criminal groups. Through a real ransomware case that struck a multinational company in Novemb",
        "id": 4276997,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jgPF929oQR0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jgPF929oQR0/hqdefault.jpg",
        "title": "Cybersecurity. Come spopravvivere alle tempeste. | Nicolas Fasolo | TEDxLakeComo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:34.166871+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:26:27+00:00",
        "description": "In questo talk Arianna, mescolando riflessione, ironia e provocazione, offre una testimonianza di sette anni in un borgo di sei abitanti, proponendo un approccio rispettoso e non colonizzatore alla montagna e al bosco: tradizione come risorsa in emergenza, sobrietà come ricchezza e convivenza metodica con l’ambiente. Invita a vedere il bosco come socio in affari nella resistenza al sistema tecnologico e al lusso, privilegiando strumenti pragmatici, solitudine consapevole e “guadagno dalla mancata spesa”. Conclude esortando a non idealizzare la vita in montagna e a “sporcarsi” con le emergenze reali della natura, per una doppia guarigione: dell’uomo e del bosco. In this talk, blending reflection, irony, and provocation, Arianna shares the story of her seven years living in a mountain village of six inhabitants, offering a respectful, non-colonizing approach to mountain life and the forest. She presents tradition as a resource in times of emergency and simplicity as a form of wealth. Sh",
        "id": 4276998,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=JIljYOv371g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JIljYOv371g/hqdefault.jpg",
        "title": "La montagna che non voleva essere ripopolata | Arianna Porcelli Safonov | TEDxLakeComo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:34.474345+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:26:13+00:00",
        "description": "Il talk esplora il concetto di \"fullgevity\", ovvero la capacità di vivere una vita piena e \"larga\" piuttosto che semplicemente \"lunga\", navigando gli imprevisti e trasformando le fragilità in opportunità di crescita.  La protagonista  condivide la propria esperienza personale, a partire dalla nascita della figlia Zoe con una grave paralisi cerebrale, un evento che ha polverizzato le sue certezze. Attraverso un percorso di consapevolezza, accettazione e accoglienza, ha imparato a trasformare il dolore in rinascita. Questo l'ha portata a sviluppare concetti come la \"transilienza\" (trasferire competenze tra ambiti diversi) e un nuovo modello di leadership basato sulla cura. Infine, presenta il \"modello delle quattro R\" (Riprogetta, Riconnetti, Ripensa, Rileggi) come una bussola per navigare l'imprevedibilità della vita, concludendo che il filo rosso della sua esistenza è l'amore.The talk explores the concept of fullgevity: the ability to live a full and “wide” life rather than simply a l",
        "id": 4276999,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=kYahhT8PfPI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kYahhT8PfPI/hqdefault.jpg",
        "title": "Fullgevity: vivere una vita piena. Live a full life | Alessia Canfarini | TEDxLakeComo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:34.776672+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:25:32+00:00",
        "description": "Cosa significa essere lì dove la storia accade? Il talk di Nello riflette sul giornalismo di presenza in aree di crisi e conflitti, sottolineando l’importanza della testimonianza diretta “ad altezza d’uomo” per superare i filtri digitali e la propaganda. L’essere sul posto consente di dare voce a vittime, civili e combattenti, affrontando silenzio e indifferenza e confrontandosi con la paura di chi vive in questi difficili contesti. Descrive le figure femminili e maschile incontrate nel corso della sua lunga attività e le loro storie drammatiche che se non fosse stato presente non avrebbero avuto voce e rendendole pubbliche sono state protette dal silenzio e dall'oblio. Racconta delle inchieste spesso pericolose per la propria incolumità e della paura che si prova e che diventa una misura della loro rilevanza. Quindi le responsabilità del giornalista, le difficoltà poste da fake news e intelligenza artificiale, gli ostacoli all’accesso (come Gaza), e la necessità del sostegno economic",
        "id": 4277000,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pvO5kEFiW_g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pvO5kEFiW_g/hqdefault.jpg",
        "title": "Giornalisti dove la storia accade. Journalists where history happens. | Nello Scavo | TEDxLakeComo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:35.068060+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:25:07+00:00",
        "description": "In questo IGNITE TALK, Martina approfondisce il tema della \"società dell'accelerazione\", concetto teorizzato dal sociologo Hartmut Rosa ed evidenzia come la nostra quotidianità sia dominata da una corsa costante contro il tempo, alimentata dalla tecnologia e da una cultura che celebra la velocità. Mette inoltre in luce il paradosso per cui, pur risparmiando tempo grazie alla tecnologia, percepiamo una persistente \"carestia di tempo\". Conclude con un invito a rallentare: non per pigrizia, ma per sopravvivenza e per scegliere consapevolmente la direzione della propria vita, invece di correre senza meta. In this IGNITE TALK, Martina explores the idea of the “acceleration society,” a concept developed by sociologist Hartmut Rosa, highlighting how our daily lives are dominated by a constant race against time, driven by technology and by a culture that celebrates speed. She also points out the paradox whereby, despite saving time thanks to technology, we continue to feel a persistent “time ",
        "id": 4277001,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=i6mb-xo-SrI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/i6mb-xo-SrI/hqdefault.jpg",
        "title": "Nella società dell'accelerazione, rallenta!  | Martina Radicchio | TEDxLakeComo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:35.374173+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:24:47+00:00",
        "description": "Con questo IGNITE TALK  Luca pone l'attenzione sulla sicurezza dei comportamenti sul lavoro e nella vita quotidiana evidenziando come le piccole gratificazioni immediate inducano spesso comportamenti a rischio, nonostante la consapevolezza dei pericoli. Spiega che se l’azienda celebra la velocità e la risoluzione rapida dei problemi più della sicurezza, nei momenti critici le persone coinvolte scelgono le scorciatoie. Propone di parlare di sicurezza ogni giorno, misurare i comportamenti con checklist, usare i numeri per riconoscere i miglioramenti rinforzandoli positivamente con “grazie” e “bravo” tempestivi. L’obiettivo è trasformare i valori in comportamenti concreti e quotidiani, affinché la sicurezza diventi una norma naturale e quotidiana. This IGNITE TALK, focused on behavioral safety at work and in everyday life, highlights how small, immediate rewards often lead people to take risks even when they are aware of the dangers. Furthermore, he explains that if a company celebrates ",
        "id": 4277002,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=egTJie6c2u0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/egTJie6c2u0/hqdefault.jpg",
        "title": "Come rendere la sicurezza una pratica quotidiana.  | Luca Giani | TEDxLakeComo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:35.635068+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:24:20+00:00",
        "description": "In a rapidly evolving digital landscape, Harish Beeram will shed light on a crucial moment in the realm of Digital Accessibility. His TEDxWilmingtonSalon talk will focus on the imperative to create an inclusive digital environment for individuals with disabilities, ensuring that everyone can participate in this fast-paced transformation. The intersection of innovation and accessibility, and the significant impact it can have on our world. Harish Beeram is the Founder of Solutions UI/UX, specializing in front-end architecture, accessibility, and design. With 7+ years of experience, he creates inclusive, user-centered digital solutions for enterprises and startups. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4277003,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SFs004JU0do",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SFs004JU0do/hqdefault.jpg",
        "title": "A Vision Without Sight | Harish Beeram | TEDxWilmingtonSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:35.936390+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:19:13+00:00",
        "description": "This TEDx talk argues that Artificial Intelligence should be seen not as a threat, but as a powerful ally that expands human potential. By looking at past technological shifts—like the internet, smartphones, and rideshare apps—the speaker shows that society often begins with fear but ultimately adapts and benefits. AI, the talk suggests, is no different: it democratizes learning, personalizes education, enhances creativity, and frees people from repetitive tasks so they can focus on deeper thinking, innovation, empathy, and leadership. Research from MIT, Stanford, Harvard, and others demonstrates AI’s measurable benefits in productivity, idea generation, and job satisfaction. The impact of AI depends on our mindset: a fixed mindset sees danger, while a growth mindset sees opportunity. By embracing AI with openness and curiosity, we can use it to unlock our most human qualities and tackle the world’s biggest challenges. Augusto Cangahuala is a Customer Experience and Communications lea",
        "id": 4277004,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QTkMgO7PVtw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QTkMgO7PVtw/hqdefault.jpg",
        "title": "Friend, Not Foe: How AI Unlocks Our Human Potential | Augusto Cangahuala | TEDxMontgomery College",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:36.148386+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:19:00+00:00",
        "description": "This TEDx talk argues that for many teens, especially boys, sports serve as an unexpected but powerful form of therapy. Through storytelling, the speaker describes the chaos of teenage life and how football and track became spaces where his mind finally quieted, giving him structure, focus, and emotional stability. Sports pulled him off his screen, gave purpose to overwhelming teenage energy, taught healthier habits around sleep and food, and created a second family through teammates and mentors who consistently showed up for him. He explains that athletics offer mental clarity, belonging, and resilience in ways traditional therapy often doesn’t reach. The talk ends with an empowering message: sports have no age limit, anyone can start with one small change, and movement itself can be healing. Whether teen or adult, stepping onto a field or track can become the therapy you didn’t know you needed. Passionate high school student interested in pursuing a career in neurosurgery, with the ",
        "id": 4277005,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fZm_OM34uwI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fZm_OM34uwI/hqdefault.jpg",
        "title": "How teen sports build confidence and community | Siddharth Karnati | TEDxMontgomery College",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:36.494144+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:18:51+00:00",
        "description": "This TED Talk by Muhammed Salim shares his journey from growing up in poverty to discovering the power of curiosity as the force that transformed his life. After earning top exam scores and receiving a scholarship to study computer science abroad—an opportunity his family couldn’t afford—his dreams seemed to collapse. But instead of accepting the common advice to “be realistic,” he chose curiosity, asking himself what he could build with what he already knew. That question led him to pursue computer science locally, start his first travel agency from his bedroom, and later build a software company in The Gambia. The speech argues that realism often disguises fear and kills possibility, while curiosity opens doors, creates opportunities, and fuels extraordinary achievements. His message is clear: don’t shrink your dreams to match the world—stay curious, challenge limits, and build the world you imagine. Muhammed Salim is a young entrepreneur, software and machine learning engineer, and",
        "id": 4277006,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DMJHy5h8tUc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DMJHy5h8tUc/hqdefault.jpg",
        "title": "Why being “realistic” is holding you back | Muhammed Salim | TEDxMontgomery College",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T17:41:36.753526+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T17:18:42+00:00",
        "description": "This talk argues that discipline isn’t a personality trait; it’s a skill you can design. Through his own 130-pound weight loss and interviews with high performers, the speaker introduces a “Discipline Spectrum” of ten elements that shape consistent behaviour. Focusing on Focus, Routine, and Willpower, he shows how small, intentional systems matter more than motivation. The message is simple and empowering: lasting change comes from smart design, not from trying harder. Joey Pinz is a podcaster, author, tech founder, entrepreneur and behavior design educator whose work has reached global audiences. After losing 130 pounds and transforming his life, he founded the Joey Pinz podcast and coaching practice dedicated to discipline and growth. At TEDx Bates College, Joey will challenge the conventional wisdom around willpower, introducing a new system-based approach: Discipline isn’t about being tougher, it’s about being intentional. His talk invites audiences to design lives that support th",
        "id": 4277007,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_UbYVutuB48",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_UbYVutuB48/hqdefault.jpg",
        "title": "Curiosity Meets Discipline: The Power of Consistent Questions | Joey Pinz | TEDxMontgomery College",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:19.078000+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:19:55+00:00",
        "description": "Dr. Sangeeta Kaushal Mishra has dedicated her life to healing, first as a distinguished Obstetrician-Gynecologist and later as a pioneering leader in Nepal's highest levels of healthcare administration. In a country where public health challenges are immense and leadership roles are often dominated by men, her journey represents an extraordinary act of perseverance.\n\nThis talk takes you behind the scenes of a life lived on two frontiers: the demanding, life-saving work in the hospital, and the complex, bureaucratic battleground of policymaking. Dr. Mishra shares candidly about the challenges of navigating gender barriers in the Nepali medical and political sectors, the constant struggle to balance a professional calling with societal expectations, and the resilience required to maintain one's identity while driving national change.\n\nDiscover how she utilized her clinical empathy to inform high-level policy, what it truly means to lead with a voice that refuses to be silenced, and why ",
        "id": 4276305,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lSm8NrrM1aQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lSm8NrrM1aQ/hqdefault.jpg",
        "title": "The Power of Perseverance: Navigating Identity in Leadership | Dr. Sangeeta Kaushal Mishra | TEDxIOM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:19.277622+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:19:33+00:00",
        "description": "At just 18, Nima Rinji Sherpa made history by summiting all 14 of the world’s 8,000-meter peaks. But in this talk, he reveals that the biggest challenge wasn't the altitude—it was conquering the doubts, the stereotypes, and the fear.\n\nNima shares the intense, life-altering lessons learned in the Earth’s most hostile environment, the Death Zone. More than just a record-breaker, Nima is a passionate advocate for #SherpaPower, challenging the global perception of his people and demonstrating that true resilience comes from self-belief and a clear sense of purpose.\n\nDiscover the secrets to finding confidence, embracing adaptability, and owning your identity, whether your personal \"8,000-meter peak\" is a professional goal or a life-changing dream. Nima Rinji Sherpa is a record-breaking Nepali mountaineer who, at the age of just 18, became the youngest climber in history to summit all 14 of the world’s eight-thousanders. Born in the Sherpa heartland of Nepal, Nima grew up surrounded by the ",
        "id": 4276306,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wEBXIignX24",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wEBXIignX24/hqdefault.jpg",
        "title": "Why We Climb: A View from the Top of the World | Nima Rinji Sherpa | TEDxIOM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:19.450301+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:18:31+00:00",
        "description": "A partir de su investigación sobre accesibilidad y su experiencia personal con la comunidad con discapacidad visual, propone una idea sencilla pero transformadora: incorporar un sistema de locución por voz en las guaguas municipales de Las Palmas de Gran Canaria que anuncie cada parada.\nUna charla que nos hace reflexionar sobre la autonomía, la empatía y el poder de las pequeñas acciones para hacer visible lo invisible. Miembro del grupo de investigación TrIAL (Traducción, Interpretación y Aprendizaje de Lenguas), una división del IDeTIC (Instituto para el Desarrollo Tecnológico y la Innovación en Comunicaciones) de la Universidad de Las Palmas de Gran Canaria (ULPGC).\nEn la actualidad, es doctorando en el programa DELLCOS (Doctorado en Estudios Lingüísticos y Literarios en sus Contextos Socioculturales), con una tesis que se centra en la audiodescripción (AD) de películas y, específicamente, en el estilo de AD cinematográfico. This talk was given at a TEDx event using the TED confere",
        "id": 4276307,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cvJHFii1u7k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cvJHFii1u7k/hqdefault.jpg",
        "title": "Destino: Audiodescripción. Para un transporte accesible | José Luis Castillo-Flores | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:19.643854+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:18:18+00:00",
        "description": "El artista y promotor cultural senegalés Khaly Thioune comparte su pasión por la música, como lenguaje universal, en esta actuación en directo que cerró la segunda edición de TEDxULPGC.\n Artista, coreógrafo y promotor cultural senegalés afincado en Canarias, licenciado en Artes Escénicas por la Escuela Nacional de Arte de Senegal. Dirige el Estudio Artístico Hermanos Thioune, primera escuela de danzas africanas en Canarias, es profesor de folclore africano en la ULPGC y lidera la empresa de gestión cultural Hermanos Thioune.\n\nFundador de la Asociación Intercultural Afrocanarias-Diakhase, ha impulsado proyectos sociales y culturales entre Canarias y Senegal y dirigido espectáculos como Ubuntu, Yakar y Más allá de tu mirada, participando en festivales internacionales como África Vive o WOMAD. Reconocido con premios como Joven Canarias (2012) y MUMES (2014), Khaly se ha consolidado como referente en la difusión de la cultura africana en España y puente entre África y Canarias. This talk ",
        "id": 4276308,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=w5dNKmQmres",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/w5dNKmQmres/hqdefault.jpg",
        "title": "Actuación Musical | Khaly Thioune | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:19.767654+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:18:04+00:00",
        "description": "He guides everyone to find solace within themselves, reminding them that the greatest inspiration they seek already lives inside.  Mr Yashpal Sharma is a versatile Indian actor celebrated for his powerful performances across film, theatre, and television. A graduate of the National School of Drama, he began his career on stage before making his mark in Hindi cinema with memorable and realistic portrayals. Sharma gained widespread acclaim for his roles in films such as Lagaan (2001), Gangaajal (2003), Hazaaron Khwaishein Aisi (2005), Ab Tak Chhappan (2004), and Apaharan (2005). In 2022, Yashpal Sharma won the National Film Award for Best Feature Film in Haryanvi as a producer for Dada Lakhmi. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4276309,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=89QVAHlz5uM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/89QVAHlz5uM/hqdefault.jpg",
        "title": "You Are Your Own Inspiration | YASHPAL SHARMA | TEDxSTS Dwarka Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:19.889612+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:17:23+00:00",
        "description": "El artista y promotor cultural senegalés Khaly Thioune comparte su historia personal y su visión sobre la inmigración, la interculturalidad y el poder del arte como lenguaje universal.\n\nUna invitación a mirar la inmigración con humanidad y a descubrir que, cuando bailamos y escuchamos juntos, ya no hay fronteras: solo personas. Artista, coreógrafo y promotor cultural senegalés afincado en Canarias, licenciado en Artes Escénicas por la Escuela Nacional de Arte de Senegal. Dirige el Estudio Artístico Hermanos Thioune, primera escuela de danzas africanas en Canarias, es profesor de folclore africano en la ULPGC y lidera la empresa de gestión cultural Hermanos Thioune.\n\nFundador de la Asociación Intercultural Afrocanarias-Diakhase, ha impulsado proyectos sociales y culturales entre Canarias y Senegal y dirigido espectáculos como Ubuntu, Yakar y Más allá de tu mirada, participando en festivales internacionales como África Vive o WOMAD. Reconocido con premios como Joven Canarias (2012) y MU",
        "id": 4276310,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=kMy2TbGKI9o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kMy2TbGKI9o/hqdefault.jpg",
        "title": "Yakar: el Poder de la Esperanza | Khaly Thioune | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.030301+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:16:55+00:00",
        "description": "La investigadora Yara Bernaldo de Quirós nos revela cómo la naturaleza puede contener las claves para uno de los mayores desafíos de la medicina moderna: el envejecimiento arterial.\n\nA partir del estudio de ballenas y delfines, mamíferos capaces de vivir más de 200 años sin desarrollar enfermedades cardiovasculares, Yara y su equipo exploran cómo las adaptaciones evolutivas al buceo podrían proteger sus arterias del envejecimiento.\n\nUna charla que combina ciencia, biología marina y esperanza, recordándonos que el conocimiento profundo de los océanos puede ayudarnos a cuidar mejor de la vida en la superficie. Profesora en la Universidad de Las Palmas de Gran Canaria (ULPGC) y doctora en Sanidad Animal. Su investigación se centra en la fisiología de los mamíferos marinos y la enfermedad por descompresión, con una trayectoria internacional en centros como Woods Hole, Texas A&M o la Universidad de Colorado (Marie Curie Fellowship).\n\nSus hallazgos demostraron que los cetáceos no son inmune",
        "id": 4276312,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mQqTApDf-WQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mQqTApDf-WQ/hqdefault.jpg",
        "title": "Adaptaciones de Mamíferos Marinos y la Eterna Juventud | Yara Bernaldo de Quirós Miranda | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.146733+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:16:44+00:00",
        "description": "A través de la historia real del ambicioso proyecto de re-introducción de la tortuga boba en Canarias, se muestra cómo la ciencia, la cooperación y la voluntad humana pueden tender puentes entre islas y romper fronteras invisibles.\n\nUn viaje apasionante desde Fuerteventura hasta Cabo Verde que nos recuerda que el océano no nos separa: nos une. Médico especializado en medicina subacuática e hiperbárica, reorientó su carrera hacia la conservación de la naturaleza hace más de 25 años. Desde entonces ha impulsado proyectos medioambientales de gran relevancia, como la declaración de la Reserva de la Biosfera de Fuerteventura, la recuperación del guirre o la reintroducción de la tortuga marina. Su trayectoria lo ha llevado a participar en redes internacionales de biodiversidad y sostenibilidad, destacando por su compromiso con las energías renovables, el patrimonio cultural y la educación ambiental. This talk was given at a TEDx event using the TED conference format but independently organi",
        "id": 4276313,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GJMj9FQiUng",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GJMj9FQiUng/hqdefault.jpg",
        "title": "Islas sin Fronteras | Antonio Gallardo Campos | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.294259+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:16:26+00:00",
        "description": "Әр буынның мақсаты өзгергенімен, бәрін біріктіретін ортақ арман сақталады. Ата-әже тыныштықты, ата-ана тұрақты жұмысты, бүгінгі жастар әділетті қоғам мен білімді қалайды. Заман жаңарса да, әр ұрпақты алға жетелейтін ортақ мұрат болады. Banu is a Year 10 student who is interested in biology and physics. She is an eloquent speaker who always fascinates her audience with her passion and enthusiasm. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4276314,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mPIMXAdzl5Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mPIMXAdzl5Q/hqdefault.jpg",
        "title": "Ұрпақтар арманы әртүрлі, бірақ ортақ бір арман бар | Banu Temirbek | TEDxNIS Shymkent Abay Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.406709+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:16:18+00:00",
        "description": "Esta charla repasa la historia de la exageración como motor de la ironía y la sátira, reivindicando el papel del humor gráfico como una forma valiente y necesaria de denunciar lo absurdo, lo falso y lo políticamente correcto.\n\nUna defensa apasionada del trazo libre, la inteligencia y la risa como vías para recuperar nuestra humanidad. Bajo el seudónimo J. Morgan, este ilustrador y humorista gráfico inició sus colaboraciones periodísticas en prensa en marzo de 1983. Desde entonces, y hasta el momento actual, realiza una viñeta diaria para la edición impresa y digital de Canarias7.\n\nEs miembro fundador de la Asociación Canaria de Humoristas Gráficos y Caricaturistas “Se nos fue el baifo” y ha sido galardonado con el Premio Pedro Marcelino Quintana de Periodismo y el Premio del Instituto Canario de Igualdad, entre otros.\n\nMás de cuarenta años retratando los aspectos ridículos y absurdos de la condición humana, a través de la sátira social, política y cotidiana de sus viñetas. This talk w",
        "id": 4276315,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=quRMAMPbC0I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/quRMAMPbC0I/hqdefault.jpg",
        "title": "La Exageración | J. Morgan | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.529551+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:15:47+00:00",
        "description": "Los estudiantes Carlos y José, integrantes de Kármán ULPGC Project, cuentan cómo un reto aparentemente imposible los llevó a vivir una de las experiencias más transformadoras de su vida universitaria: construir el primer submarino español a pedales para competir en la European International Submarine Race en Inglaterra.\n\nUna historia de innovación, trabajo en equipo y aprendizaje real, donde la ingeniería deja de ser teoría para convertirse en desafío, esfuerzo y pasión. El primer equipo español en competir en una carrera de submarinos a pedales. Formado por estudiantes de la Universidad de Las Palmas de Gran Canaria, el grupo Karman ULPGC representa el espíritu innovador, colaborativo y valiente de una nueva generación de ingenieros que se atreven a explorar los límites entre la ciencia, la creatividad y la aventura. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4276316,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nwFUsASSPJw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nwFUsASSPJw/hqdefault.jpg",
        "title": "Aprender Sumergiéndote | Carlos y José | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.649809+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:14:25+00:00",
        "description": "A través de su experiencia en las carreras internacionales de submarinos a pedales, nos muestra cómo la ingeniería transforma lo invisible en visible.\n\nUna reflexión poética y técnica sobre el poder de la imaginación, el aprendizaje y la capacidad humana para descubrir lo que se esconde bajo la superficie. Profesor de biomimética en la Universidad Rhine Waal de Alemania y capitán de barco canadiense con formación en física y biología marina. Desde 2005 dirige junto a sus estudiantes el diseño, construcción y competición de submarinos en las European International Submarine Races, una exigente prueba de slalom submarino de 200 metros que reúne cada dos años en el Reino Unido a equipos de ingeniería de todo el mundo.\n\nEn 2025 fue profesor visitante en la ULPGC, donde impulsó la creación del equipo que diseñó el Cervantes, la primera participación española en este innovador deporte de submarinos a propulsión humana, combinando ingeniería, creatividad y trabajo en equipo en un reto único ",
        "id": 4276317,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ktLmlLHeYa8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ktLmlLHeYa8/hqdefault.jpg",
        "title": "SubRace: lo que una Competición Submarina Enseña sobre Educación | William Megill | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.765228+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:13:46+00:00",
        "description": "In Ashley’s talk, she wishes to explore the impact that languages and being multilingual can have on our identity. From our personality and the way we think to how we interact with others, it’s hard to imagine that the seemingly insignificant influence of the language we speak plays a vital role in all of these, affecting us in more ways than we are aware of. Ashley is a Y11 student from Harrow International School Hong Kong who is interested in languages, psychology and the relationship between the two. Learning and perfecting new languages is a passion of hers to explore a new culture and communicate with new people. Outside of school and the academic world, Ashley loves to read, especially crime and mystery. She also loves scrapbooking, writing poetry and anything capybara-related. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4276318,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HC7dljc3VGY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HC7dljc3VGY/hqdefault.jpg",
        "title": "The Overlooked Role of Language in Shaping Our Identity | Ashley T | TEDxYouth@HarrowHK",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.892955+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:13:36+00:00",
        "description": "A través de ejemplos cercanos, vemos cómo el estudio de la Geología nos permite comprender los procesos que han modelado nuestro planeta, prever catástrofes naturales y aprender a convivir de forma responsable con la naturaleza.\n\nUna defensa inspiradora de la alfabetización en Ciencias de la Tierra y del conocimiento como herramienta esencial para proteger el futuro de nuestro hogar común. Doctora en Ciencias Geológicas, ha desarrollado su labor profesional siempre en Canarias, primero en el Instituto Geológico y Minero de España, en el Servicio Hidráulico de Las Palmas (Dirección Gral. de Aguas del Gobierno de Canarias) y después en la Universidad de Las Palmas de Gran Canaria, donde es Profesora Titular desde 2003.\n\nSus líneas de investigación se encuadran en el campo de la Hidrogeología. Actualmente es coordinadora del grupo de investigación Geología de Terrenos Volcánicos (GEOVOL) dentro del Instituto Universitario de Estudios Ambientales y Recursos Naturales (iUNAT) de la ULPGC. ",
        "id": 4276319,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wLPU_fgUW6k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wLPU_fgUW6k/hqdefault.jpg",
        "title": "Alfabetización en Ciencias de la Tierra | María del Carmen Cabrera Santana | TEDxULPGC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:33:20.996056+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:13:12+00:00",
        "description": "A través de una mirada que combina derecho internacional, filosofía y humanidad, analiza cómo las migraciones, la identidad y el miedo moldean nuestras sociedades, y propone un cambio de paradigma: derribar las fronteras internas y externas que nos impiden reconocernos como iguales.\n\nUna invitación a repensar la empatía, los derechos humanos y la forma en que decidimos relacionarnos como especie.\n Director del área de Derecho Internacional Privado de la Universidad de Las Palmas de Gran Canaria (ULPGC). Magistrado Suplente de la Audiencia Provincia de Las Palmas. Director de la Formación Sénior de la ULPGC. Secretario del Consejo Canario del Movimiento Europeo.\n\nEstá especializado en el respeto de los derechos de las personas en el ámbito de la movilidad humana internacional en el ámbito del Derecho Internacional privado y de la extranjería. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.t",
        "id": 4276320,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=tu0Ds7fFz2k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tu0Ds7fFz2k/hqdefault.jpg",
        "title": "Derechos sin Fronteras | Lucas Andrés Pérez Martín | TEDxULPGC",
        "vote": 0
    }
]