[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T16:23:33.376688+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T16:00:31+00:00",
        "description": "After nearly 20 years since the last Prime game, a lot has happened in the world of game design, but Metroid Prime 4 Beyond barely seems to acknowledge that. Even that would have been okay with me, just more Metroid Prime would be great! I love Metroid Prime, I would gladly take more of it. \n\nBut it has to be good, and Prime 4 very often misses the mark, at least when it comes to things that matter most, such as the level design and traversal. My hope is that this game is what it is due to the unique circumstances of its development. \n\nHopefully, Retro will be allowed to put out a follow up, and hopefully, that follow up will be a lot less confused and conflicted, and a lot more cohesive with its overall vision and design. Until then, Prime 4 is what we have, the worst of the four mainline Prime games.",
        "id": 4276284,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=BwwfegYtEy8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BwwfegYtEy8/hqdefault.jpg",
        "title": "Metroid Prime 4 Beyond Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T14:21:56.128618+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T13:30:00+00:00",
        "description": "There are a lot of video game franchises coming back in the coming couple years. Rayman is reportedly on the horizon with a remake and new AAA entry, while Assassin’s Creed, Ghost Recon, and The Division are nearing an announcement. But there are two projects that remain elusive, perhaps for the wrong reasons. \n\nBut a remake of the first Splinter Cell feels more promising. Not only does the remake have its original director back on the project, it also has a rumored release date within the next two years. Though what we know is mostly speculative and limited to small breadcrumbs, the little we’ve heard so far should still be encouraging for fans of the series. Still, why is the Splinter Cell Remake taking so long?",
        "id": 4275092,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=0MIh8SMePjE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0MIh8SMePjE/hqdefault.jpg",
        "title": "What's Taking So Long With The Splinter Cell Remake?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-09T10:12:14.529470+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-09T10:01:07+00:00",
        "description": "Going into 2025, few of us expected that it would be this bountiful in terms of quality game releases. Role-playing games, racing games, platformers, and action-RPGs – each month has offered something new and compelling. There's just one problem: Time. What should you prioritize first? More importantly, which games are guaranteed to give the most bang for your buck?\n\nLet's dive into the most amazing games of this year that can offer 50 to 100 hours (maybe even more) of great gameplay.",
        "id": 4273268,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=dJ8ZkhEMP7M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dJ8ZkhEMP7M/hqdefault.jpg",
        "title": "15 Amazing Games of 2025 That Can Give You 50 To 100 HOURS of Gameplay",
        "vote": 0
    }
]