[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T18:10:48.223160+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T17:30:25+00:00",
        "description": "The NBA 2K franchise is an unstoppable force in the sports gaming world, and each year’s entry seems to only move the needle up or down a few degrees. \n\nFrom a gameplay perspective, NBA 2K26 is a significant step forward with its smooth and simplistic style that feels as good as ever, and the attempts to streamline and expand MyCareer with the Out of Bounds mode are a major step forward and a great sign of things to come for the mode. \n\nHowever, as has become routine with each 2K game, the entire package, as polished and expansive as it is, requires a significant investment of either time or money in the form of microtransactions; if you can overlook that, though that may be a tall task, this is 2K at its smoothest and most streamlined in years.",
        "id": 3524898,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=rj5kyayCQB0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rj5kyayCQB0/hqdefault.jpg",
        "title": "NBA 2K26 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T16:53:00.331879+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T15:30:22+00:00",
        "description": "Metal Gear Solid V: The Phantom Pain has long been a thorn in the side of the fanboy in me who felt betrayed by the game's lack of explicit storytelling and what I then saw as a consequence of the fallout between Hideo Kojima and Konami. Since then, I continued to lament the game that I believed Phantom Pain should have been.\n\nHowever, a recent deep dive into the franchise's expansive lore showed me just how much I had missed out on when I first played the game, and subsequently refused to replay it. Things have now changed, and I'm certainly going to revisit a title that had me sold on its gameplay, and now has me convinced that I need to explore every nook and cranny of its open world.",
        "id": 3524229,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=HnzDd_F4dvs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HnzDd_F4dvs/hqdefault.jpg",
        "title": "Metal Gear Solid 5 Haunted Me For 10 Years, But I’m Finally Over The Phantom Pain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T14:27:29.637557+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T13:30:32+00:00",
        "description": "Ghost of Yotei is nearly upon us, and we couldn't be more excited. The sequel to Jin Sakai's relentless battles against the Mongol invasion of Tsushima is all set to build on the strengths of that story while adding new features and mechanics that could very well make it the new Ghost title on the block.\n\nAtsu's vengeance-filled war on the Yotei Six is primed to switch things up on all fronts. Its narrative direction has kept us guessing and likely will do so until we roll the credits on her adventure. Its combat has been shaken up, becoming more unpredictable and challenging as a result. The lands of Ezo bring new exploration mechanics to the open world. It's going to be quite the journey, and one that we simply cannot wait to dive into.",
        "id": 3522894,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=SnXrt9omeTs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SnXrt9omeTs/hqdefault.jpg",
        "title": "Ghost of Yotei vs. Ghost of Tsushima - 15 Biggest Differences YOU ABSOLUTELY NEED TO KNOW",
        "vote": 0
    }
]