[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T23:32:04.641859+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T23:10:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: Plex has alerted its customers about a security incident that may have affected user accounts. In an email sent to subscribers, the popular media server company confirmed that an unauthorized third party gained access to one of its databases. The breach exposed emails, usernames, and hashed passwords. Plex emphasized that passwords were encrypted following best practices, so attackers cannot simply read them. The company also reassured users that no credit card data was compromised, since Plex does not store that information on its servers. Still, out of caution, it is requiring all account holders to reset their credentials.\n \nUsers are being directed to reset their passwords at plex.tv/reset. During the process, Plex recommends enabling the option to sign out all connected devices. This measure logs out every device associated with the account, including Plex Media Servers, forcing a fresh login with the updated password. The company says",
        "id": 3527247,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/08/229201/plex-suffers-security-incident-exposing-user-data-and-urging-password-resets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Plex Suffers Security Incident Exposing User Data and Urging Password Resets",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T23:32:04.879789+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T22:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Last year, we reported on the efforts of classic iPod fans to preserve playable copies of the downloadable clickwheel games that Apple sold for a brief period in the late '00s. The community was working to get around Apple's onerous FairPlay DRM by having people who still owned original copies of those (now unavailable) games sync their accounts to a single iTunes installation via a coordinated Virtual Machine. That \"master library\" would then be able to provide playable copies of those games to any number of iPods in perpetuity.\n \nAt the time, the community was still searching for iPod owners with syncable copies of the last few titles needed for their library. With today's addition of Real Soccer 2009 to the project, though, all 54 official iPod clickwheel games are now available together in an easily accessible format for what is likely the first time.\n \n[...] Now that the consolidated clickwheel game collection is complete, th",
        "id": 3527248,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/09/08/213205/all-54-lost-clickwheel-ipod-games-have-been-preserved-for-posterity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "All 54 Lost Clickwheel IPod Games Have Been Preserved For Posterity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T22:26:33.884029+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T21:50:00+00:00",
        "description": "Kevin Barry, founder and sole developer of Nova Launcher, has left parent company Branch Metrics after being told to stop work on both the launcher and an open-source release. While the app remains on Google Play, the launcher's website currently shows a 404 error. The Verge reports: Mobile analytics company Branch Metrics acquired Nova in 2022. The company's CEO at the time, co-founder Alex Austin, said on Reddit that if Barry were to leave Branch, \"it's contracted that the code will be open-sourced and put in the hands of the community.\" Austin left Branch in 2023, and now with Barry officially gone from the company, too, it's unclear if the launcher will now actually be open-sourced.\n \n\"I think the newer leadership since Alex Austin left has put a different focus on the company and Nova simply isn't part of that focus in any way at all,\" Cliff Wade, Nova's former customer relations lead who left as part of the 2024 layoffs, tells The Verge. \"It's just some app that they own but no ",
        "id": 3526806,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/08/2050202/nova-launchers-founder-and-sole-developer-has-left?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nova Launcher's Founder and Sole Developer Has Left",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T21:22:00.321952+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T21:10:00+00:00",
        "description": "Jaguar Land Rover has extended the shutdown of its UK and overseas factories after a cyberattack forced it to take IT systems offline, disrupting production, dealerships, and suppliers. The BBC reports: Jaguar Land Rover's (JLR) UK factories are now expected to remain closed until at least Wednesday after work was disrupted by a cyber attack just over a week ago. The car plants at Halewood and Solihull and its Wolverhampton engine facility, along with production facilities in Slovakia, China and India, have been unable to operate since the company fell victim to the cyber attack. Staff who work on the production lines have been told to remain at home. JLR shut down its IT systems in response to the attack on 31 August, in order to protect them from damage. However, this caused major disruption. [...]\n \nUnder normal circumstances, the company builds about 1,000 cars a day. The production stoppage has had a significant impact on the company's suppliers, with some understood to have told",
        "id": 3526405,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/08/2044243/jaguar-land-rover-extends-shutdown-after-cyber-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jaguar Land Rover Extends Shutdown After Cyber Attack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T21:22:00.471434+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T20:33:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: All work in IT departments will be done with the help of AI by 2030, according to analyst firm Gartner, which thinks massive job losses won't result. Speaking during the keynote address of the firm's Symposium event in Australia today, VP analyst Alicia Mullery said 81 percent of work is currently done by humans acting alone without AI assistance. Five years from now Gartner believes 75 percent of IT work will be human activity augmented by AI, with the remainder performed by bots alone.\n \nDistinguished VP analyst Daryl Plummer said this shift will mean IT departments gain labor capacity and will need to show they deserve to keep it. \"You never want to look like you have too many people,\" he advised, before suggesting technology leaders consult with peers elsewhere in a business to identify value-adding opportunities IT departments can execute. Plummer said Gartner doesn't foresee an \"AI jobs bloodbath\" in IT or other industries f",
        "id": 3526406,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/08/2031235/all-it-work-to-involve-ai-by-2030-says-gartner?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "All IT Work To Involve AI By 2030, Says Gartner",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T20:08:55.185704+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T19:25:00+00:00",
        "description": "An anonymous reader shares a report: In what is being called the largest supply chain attack in history, attackers have injected malware into NPM packages with over 2.6 billion weekly downloads after compromising a maintainer's account in a phishing attack. \n\nThe package maintainer whose accounts were hijacked in this supply-chain attack confirmed the incident earlier today, stating that he was aware of the compromise and adding that the phishing email came from support [at] npmjs [dot] help, a domain that hosts a website impersonating the legitimate npmjs.com domain. \n\nIn the emails, the attackers threatened that the targeted maintainers' accounts would be locked on September 10th, 2025, as a scare tactic to get them to click on the link redirecting them to the phishing sites.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Hackers+Hijack+npm+Packages+With+2+Billion+Weekly+Downloads+in+Supply+Chain+Attack%3A+https%3",
        "id": 3525877,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/08/1843235/hackers-hijack-npm-packages-with-2-billion-weekly-downloads-in-supply-chain-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hackers Hijack npm Packages With 2 Billion Weekly Downloads in Supply Chain Attack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T20:08:55.422628+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T18:45:00+00:00",
        "description": "Signal has begun rolling out end-to-end encrypted cloud backups in its latest Android beta release. The opt-in feature allows users to restore message history if their phone is lost or damaged. Free backups include all text messages and 45 days of media attachments. A $1.99 monthly subscription extends media storage to 100GB. \n\nUsers generate a 64-character recovery key on their device that Signal's servers never access. Backups refresh daily, excluding view-once messages and those set to disappear within 24 hours. The nonprofit cited storage costs as the reason for its first paid tier. iOS and Desktop support will follow the Android rollout. Signal said it stores backup archives without linking them to specific user accounts or payment information.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Signal+Rolls+Out+Encrypted+Cloud+Backups%2C+Debuts+First+Subscription+Plan+at+%241.99%2FMonth%3A+https%3A%2F%2Fyro.slashdo",
        "id": 3525878,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/08/1824254/signal-rolls-out-encrypted-cloud-backups-debuts-first-subscription-plan-at-199month?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Signal Rolls Out Encrypted Cloud Backups, Debuts First Subscription Plan at $1.99/Month",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T18:42:57.835322+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T18:08:00+00:00",
        "description": "Google has stated in a court filing that \"the open web is already in rapid decline,\" contradicting recent public statements from executives including its CEO Sundar Pichai and Search VP Nick Fox, who maintained in May that web publishing and the web were thriving. \n\nThe admission appeared in Google's response to a divestiture proposal, arguing that breaking up the company would accelerate the decline and harm publishers dependent on open-web display advertising revenue. Google's VP of Global Ads Dan Taylor has since clarified the company was referring specifically to open-web display advertising, not the entire open web.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Tells+Court+'Open+Web+is+Already+in+Rapid+Decline'+After+Execs+Claimed+It+Was+Thriving%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F09%2F08%2F188234%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_ic",
        "id": 3525151,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/08/188234/google-tells-court-open-web-is-already-in-rapid-decline-after-execs-claimed-it-was-thriving?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Tells Court 'Open Web is Already in Rapid Decline' After Execs Claimed It Was Thriving",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T18:42:58.185898+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T17:27:00+00:00",
        "description": "A 67-year-old US man is still alive more than six months after receiving a kidney from a genetically modified pig. This is the longest a pig organ has survived in a living person. From a report: Researchers say the outcome is a landmark case of successful xenotransplantation -- the process of transplanting organs from animals to humans. The recipient, Tim Andrews, had end-stage kidney disease and had been receiving dialysis for more than two years before he underwent the surgery in January. He has been dialysis-free since receiving the kidney. Andrews was one of three patients to receive genetically modified pig kidneys supplied by the biotechnology company eGenesis in Cambridge, Massachusetts, on compassionate grounds. \n\nReaching six months' survival is an amazing feat, says Wayne Hawthorne, a transplant surgeon at the University of Sydney in Australia. The first six months is the period of \"highest risk for the patient and also the transplant,\" he adds. Possible complications includ",
        "id": 3525152,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/08/1727212/us-man-still-alive-six-months-after-pig-kidney-transplant?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Man Still Alive Six Months After Pig Kidney Transplant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T17:30:16.892712+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T16:47:00+00:00",
        "description": "The former head of security for WhatsApp filed a lawsuit on Monday accusing Meta of ignoring major security and privacy flaws that put billions of the messaging app's users at risk, the latest in a string of whistle-blower allegations against the social media giant. The New York Times: In the lawsuit filed in the U.S. District Court of the District of Northern California, Attaullah Baig claimed that thousands of WhatsApp and Meta employees could gain access to sensitive user data including profile pictures, location, group memberships and contact lists. Meta, which owns WhatsApp, also failed to adequately address the hacking of more than 100,000 accounts each day and rejected his proposals for security fixes, according to the lawsuit. \n\nMr. Baig tried to warn Meta's top leaders, including its chief executive, Mark Zuckerberg, that users were being harmed by the security weaknesses, according to the lawsuit. In response, his managers retaliated and fired him in February, he claims. Mr.",
        "id": 3524480,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/08/1647240/whistle-blower-sues-meta-over-claims-of-whatsapp-security-flaws?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Whistle-Blower Sues Meta Over Claims of WhatsApp Security Flaws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T16:14:13.521374+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T16:05:00+00:00",
        "description": "University of Luxembourg mathematicians tested whether GPT-5 could extend a qualitative fourth-moment theorem to include explicit convergence rates, a previously unaddressed problem in the Malliavin-Stein framework. The September 2025 experiment, prompted by claims GPT-5 solved a convex optimization problem, revealed the AI made critical errors requiring constant human correction. \n\nGPT-5 overlooked an essential covariance property easily deducible from provided documents. The researchers compared the experience to working with a junior assistant needing careful verification. They warned AI reliance during doctoral training risks students losing opportunities to develop fundamental mathematical skills through mistakes and exploration.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Mathematicians+Find+GPT-5+Makes+Critical+Errors+in+Original+Proof+Generation%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F09%2F08",
        "id": 3523880,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/08/165206/mathematicians-find-gpt-5-makes-critical-errors-in-original-proof-generation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mathematicians Find GPT-5 Makes Critical Errors in Original Proof Generation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T16:14:13.665834+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T15:21:00+00:00",
        "description": "An anonymous reader shares a report: Two cultivated meat companies have filed a lawsuit against officials in Texas over the law that bans the sales of lab-grown meat in the state for two years. California-based companies UPSIDE Foods, which makes cultivated chicken, and Wildtype, which makes cultivated salmon are suing Attorney General Ken Paxton, Texas Department of State Health Services, Texas Health and Human Services, and Travis County, accusing them of government overreach. \n\n\"This law has nothing to do with protecting public health and safety and everything to do with protecting conventional agriculture from innovative out-of-state competition,\" said Paul Sherman, a senior attorney at the Institute for Justice, a nonprofit law firm that is representing UPSIDE Foods and Wildtype. \"That is not a legitimate use of government power.\" In June, lawmakers passed Senate Bill 261, which bans the sale of lab-grown meat in Texas for two years. Lab-grown meat, also known as cell cultivated ",
        "id": 3523881,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/08/1511251/texas-sued-over-its-lab-grown-meat-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Texas Sued Over Its Lab-Grown Meat Ban",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T14:59:17.314105+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T14:40:00+00:00",
        "description": "An anonymous reader shares a report: OpenAI recently had both good news and bad news for shareholders. Revenue growth from ChatGPT is accelerating at a more rapid rate than the company projected half a year ago. The bad news? The computing costs to develop artificial intelligence that powers the chatbot, and other data center-related expenses, will rise even faster. \n\nAs a result, OpenAI projected its cash burn this year through 2029 will rise even higher than previously thought, to a total of $115 billion. That's about $80 billion higher than the company previously expected. The unprecedented projected cash burn, which would add to the roughly $2 billion it burned in the past two years, helps explain why the company is raising more capital than any private company in history.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Says+Its+Business+Will+Burn+%24115+Billion+Through+2029%3A+https%3A%2F%2Fnews.slashdot.",
        "id": 3523129,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/08/1426211/openai-says-its-business-will-burn-115-billion-through-2029?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Says Its Business Will Burn $115 Billion Through 2029",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T14:59:17.480364+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T14:00:00+00:00",
        "description": "Young Americans are abandoning traditional retirement planning for dividend-focused ETFs that promise immediate income and freedom from traditional employment. Income-generating ETFs captured one in six dollars flowing into equity ETFs in 2025, pushing the sector to $750 billion -- with the most aggressive funds offering yields above 8% quadrupling to $160 billion over three years. \n\nThe r/dividends subreddit has grown tenfold to 780,000 members over five years, while YouTube channels and Discord servers dedicated to dividend investing proliferate. YieldMax's MSTY fund, offering a 90% distribution rate through complex derivatives, has underperformed MicroStrategy stock by 120 percentage points since February 2024 when dividends are reinvested -- nearly 200 points when payouts are withdrawn. Speaking to Bloomberg, finance professor Samuel Hartzmark identified this as the \"free dividends fallacy,\" where investors fail to recognize that dividends reduce share prices rather than creating ",
        "id": 3523130,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/08/1235210/the-new-american-hustle-dividends-over-day-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The New American Hustle: Dividends Over Day Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T14:59:17.622771+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T11:34:00+00:00",
        "description": "Slashdot reader Charlotte Web shared this report from the Register:\n\nAmong the software developers who use Microsoft's GitHub, the most popular community discussion in the past 12 months has been a request for a way to block Copilot, the company's AI service, from generating issues and pull requests in code repositories. The second most popular discussion &mdash; where popularity is measured in upvotes &mdash; is a bug report that seeks a fix for the inability of users to disable Copilot code reviews. Both of these questions, the first opened in May and the second opened a month ago, remain unanswered, despite an abundance of comments critical of generative AI and Copilot... \n\nThe author of the first, developer Andi McClure, published a similar request to Microsoft's Visual Studio Code repository in January, objecting to the reappearance of a Copilot icon in VS Code after she had uninstalled the Copilot extension... \"I've been for a while now filing issues in the GitHub Community feed",
        "id": 3523131,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/08/0235251/some-angry-github-users-are-rebelling-against-githubs-forced-copilot-ai-features?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some Angry GitHub Users Are Rebelling Against GitHub's Forced Copilot AI Features",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T14:59:17.740988+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T07:34:00+00:00",
        "description": "An anonymous reader shared this report from Fortune:\nThe percentage of young Gen Z employees between the ages of 21 and 25 has been cut in half at technology companies over the past two years, according to recent data from compensation management software business Pave with workforce data from more than 8,300 companies. \nThese young workers accounted for 15% of the workforce at large public tech firms in January 2023. By August 2025, they only represented 6.8%. The situation isn't pretty at big private tech companies, either &mdash; during that same time period, the proportion of early-career Gen Z employees dwindled from 9.3% to 6.8%. Meanwhile, the average age of a worker at a tech company has risen dramatically over those two and a half years. Between January 2023 and July 2025, the average age of all employees at large public technology businesses rose from 34.3 years to 39.4 years &mdash; more than a five year difference. On the private side, the change was less drastic, with the",
        "id": 3523132,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/08/0423228/theres-50-fewer-young-employees-at-tech-companies-now-than-two-years-ago?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "There's 50% Fewer Young Employees at Tech Companies Now Than Two Years Ago",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T14:59:17.883740+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T04:34:00+00:00",
        "description": "Somewhere in Houston, four research volunteers \"will soon participate in NASA's year-long simulation of a Mars mission,\" NASA announced this week, saying it will provide \"foundational data to inform human exploration of the Moon, Mars, and beyond.\" \n\nThe 378-day simulation will take place inside a 3D-printed, 1,700-square-foot habitat at NASA's Johnson Space Center in Houston &mdash; starting on October 19th and continuing until Halloween of 2026:\n\n\nThrough a series of Earth-based missions called CHAPEA (Crew Health and Performance Exploration Analog), NASA aims to evaluate certain human health and performance factors ahead of future Mars missions. The crew will undergo realistic resource limitations, equipment failures, communication delays, isolation and confinement, and other stressors, along with simulated high-tempo extravehicular activities. These scenarios allow NASA to make informed trades between risks and interventions for long-duration exploration missions. \n\n\"As NASA gears",
        "id": 3523133,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/08/0310211/a-new-four-person-crew-will-simulate-a-year-long-mars-mission-nasa-announces?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A New Four-Person Crew Will Simulate a Year-Long Mars Mission, NASA Announces",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-08T14:59:18.049194+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-08T01:34:00+00:00",
        "description": "Four years ago a small Microsoft Research team started creating an analog optical computer. They used commercially available parts like sensors from smartphone cameras, optical lenses, and micro-LED lights finer than a human hair. \"As the light passes through the sensor at different intensities, the analog optical computer can add and multiply numbers,\" explains a Microsoft blog post. \n\nThey envision the technology scaling to a computer that for certain problems is 100X faster and 100X more energy efficient &mdash; running AI workloads \"with a fraction of the energy needed and at much greater speed than the GPUs running today's large language models.\" The results are described in a paper published in the scientific journal Nature, according to the blog post:\n\n\nAt the same time, Microsoft is publicly sharing its \"optimization solver\" algorithm and the \"digital twin\" it developed so that researchers from other organizations can investigate this new computing paradigm and propose new pro",
        "id": 3523134,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/08/0125250/microsofts-analog-optical-computer-shows-ai-promise?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft's Analog Optical Computer Shows AI Promise",
        "vote": 0
    }
]