[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T23:54:48.165053+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T23:40:00+00:00",
        "description": "jalvarez13 writes: My venerable HP Officejet Pro 8600 Plus is showing its age and it has become expensive to operate due to the cost of the original cartridges. I tried some alternative cartridges but the printer rejects them.\n \nNow that schools still require kids to print stuff at home (mine are in 2nd and 4th grade), and my wife also needs to use the printer, I think it may be wise to invest in a good-quality printer that has a lower cost per page (maybe laser?).\n \nIn that context, I'd love to have unbiased information about brand quality, printing technology, cost efficiency, and other factors that I might have missed. Any thoughts?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ask+Slashdot%3A+Printer+Recommendation+For+Family+With+Kids%3F%3A+https%3A%2F%2Fask.slashdot.org%2Fstory%2F25%2F06%2F23%2F2313202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></",
        "id": 3002591,
        "language": null,
        "link": "https://ask.slashdot.org/story/25/06/23/2313202/ask-slashdot-printer-recommendation-for-family-with-kids?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ask Slashdot: Printer Recommendation For Family With Kids?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T23:54:48.384777+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T23:20:00+00:00",
        "description": "Disabling Intel graphics security mitigations in GPU compute stacks for OpenCL and Level Zero can yield a performance boost of up to 20%, prompting Ubuntu's Canonical and Intel to disable these mitigations in future Ubuntu packages. Phoronix's Michael Larabel reports: Intel does allow building their GPU compute stack without these mitigations by using the \"NEO_DISABLE_MITIGATIONS\" build option and that is what Canonical is looking to set now for Ubuntu packages to avoid the significant performance impact. This work will likely all be addressed in time for Ubuntu 25.10. This NEO_DISABLE_MITIGATIONS option is just for compiling the Intel Compute Runtime stack and doesn't impact the Linux kernel security mitigations or else outside of Intel's \"NEO\" GPU compute stack. Both Intel and Canonical are in agreement with this move and it turns out that even Intel's GitHub binary packages for their Compute Runtime for OpenCL and Level Zero ship with the mitigations disabled due to the performance",
        "id": 3002592,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/23/2046259/ubuntu-to-disable-intel-graphics-security-mitigations-to-boost-gpu-performance-by-up-to-20?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ubuntu To Disable Intel Graphics Security Mitigations To Boost GPU Performance By Up To 20%",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T22:49:49.552532+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T22:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: After a court ordered OpenAI to \"indefinitely\" retain all ChatGPT logs, including deleted chats, of millions of users, two panicked users tried and failed to intervene. The order sought to preserve potential evidence in a copyright infringement lawsuit raised by news organizations. In May, Judge Ona Wang, who drafted the order, rejected the first user's request (PDF) on behalf of his company simply because the company should have hired a lawyer to draft the filing. But more recently, Wang rejected (PDF) a second claim from another ChatGPT user, and that order went into greater detail, revealing how the judge is considering opposition to the order ahead of oral arguments this week, which were urgently requested by OpenAI.\n \nThe second request (PDF) to intervene came from a ChatGPT user named Aidan Hunt, who said that he uses ChatGPT \"from time to time,\" occasionally sending OpenAI \"highly sensitive personal and commercial informati",
        "id": 3002294,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/23/2039253/judge-denies-creating-mass-surveillance-program-harming-all-chatgpt-users?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Judge Denies Creating 'Mass Surveillance Program' Harming All ChatGPT Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T22:49:49.804911+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T22:00:00+00:00",
        "description": "Apple's iOS 26 introduces Recovery Assistant, a feature that allows users to restore malfunctioning iPhones without requiring a Mac or PC. The system automatically boots devices into Recovery mode when startup issues occur, displaying the message \"This iPhone encountered an issue while starting.\" \n\nUsers can then initiate recovery through another Apple device like an iPad, which downloads and installs a newer iOS version onto the malfunctioning iPhone. Apple described Recovery Assistant as \"a new way to recover your device if it doesn't start up normally\" in release notes for the second iOS 26 beta.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iOS+26+Allows+You+To+Restore+Any+iPhone+Without+a+Mac+or+PC%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F06%2F23%2F2023213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://ww",
        "id": 3002295,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/23/2023213/ios-26-allows-you-to-restore-any-iphone-without-a-mac-or-pc?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "iOS 26 Allows You To Restore Any iPhone Without a Mac or PC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T21:44:50.510945+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T21:22:00+00:00",
        "description": "The number of doctoral graduates globally has grown steadily over recent decades, creating a massive imbalance between PhD holders and available academic positions. Among the 38 OECD countries, new doctorate holders almost doubled between 1998 and 2017. \n\nChina's doctoral enrollment has exploded from around 300,000 students in 2013 to more than 600,000 in 2023. This growth has forced PhD graduates into non-academic careers at unprecedented rates. A 2023 study of more than 4,500 PhD graduates in the United Kingdom found over two-thirds were employed outside academia. \n\nIn South Africa, 18% of more than 6,000 PhD graduates reported difficulty finding jobs related to their expertise. Some countries have begun adapting their doctoral programs. Japan, Germany and the United Kingdom now offer training and paid internships during doctoral studies, including \"industrial PhD\" programs where students conduct research in collaboration with companies.<p><div class=\"share_submission\" style=\"positi",
        "id": 3001902,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/23/2015258/phd-graduates-far-exceed-academic-job-openings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PhD Graduates Far Exceed Academic Job Openings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T21:44:50.721355+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T20:40:00+00:00",
        "description": "Hackers suspected of working on behalf of the Chinese government exploited a maximum-severity vulnerability, which had received a patch 16 months earlier, to compromise a telecommunications provider in Canada, officials from that country and the US said Monday. ArsTechnica: \"The Cyber Centre is aware of malicious cyber activities currently targeting Canadian telecommunications companies,\" officials for the center, the Canadian government's primary cyber security agency, said in a statement. \"The responsible actors are almost certainly PRC state-sponsored actors, specifically Salt Typhoon.\" The FBI issued its own nearly identical statement. \n\nSalt Typhoon is the name researchers and government officials use to track one of several discreet groups known to hack nations all over the world on behalf of the People's Republic of China. In October 2023, researchers disclosed that hackers had backdoored more than 10,000 Cisco devices by exploiting CVE-2023-20198, a vulnerability with a maximu",
        "id": 3001903,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/23/201237/canadian-telecom-hacked-by-suspected-china-state-group?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Canadian Telecom Hacked By Suspected China State Group",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T20:39:50.262728+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T20:01:00+00:00",
        "description": "Bacteria can be used to turn plastic waste into painkillers, researchers have found, opening up the possibility of a more sustainable process for producing the drugs. From a report: Chemists have discovered E coli can be used to create paracetamol, also known as acetaminophen, from a material produced in the laboratory from plastic bottles. \"People don't realise that paracetamol comes from oil currently,\" said Prof Stephen Wallace, the lead author of the research from the University of Edinburgh. \"What this technology shows is that by merging chemistry and biology in this way for the first time, we can make paracetamol more sustainably and clean up plastic waste from the environment at the same time.\" \n\nWriting in the journal Nature Chemistry, Wallace and colleagues report how they discovered that a type of chemical reaction called a Lossen rearrangement, a process that has never been seen in nature, was biocompatible. In other words, it could be carried out in the presence of living ",
        "id": 3001419,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/23/1945219/scientists-use-bacteria-to-turn-plastic-waste-into-paracetamol?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Use Bacteria To Turn Plastic Waste Into Paracetamol",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T19:34:47.308649+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T19:21:00+00:00",
        "description": "Microplastics are present in all beverages, but those packaged in glass bottles contain more microplastic particles than those in plastic bottles, cartons or cans. This was the surprising finding of a study conducted by the Boulogne-sur-Mer unit of the ANSES Laboratory for Food Safety. The scientists hypothesised that these plastic particles could come from the paint used on bottle caps. Water and wine are less affected than other beverages. These findings have highlighted a source of microplastics in drinks that manufacturers can easily take measures to address.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Caps+of+Glass+Bottles+Contaminate+Beverages+With+Microplastics%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F06%2F23%2F1922202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=http",
        "id": 3000989,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/23/1922202/caps-of-glass-bottles-contaminate-beverages-with-microplastics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Caps of Glass Bottles Contaminate Beverages With Microplastics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T19:34:47.598348+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T18:23:00+00:00",
        "description": "FICO credit scores will begin incorporating buy-now-pay-later data for the first time. From a report: With over 90 million Americans expected to use BNPL for purchases this year, critics argue that existing credit scores paint an incomplete picture of an individual's ability to pay back loans. Fair Isaac Corp., which runs FICO, said Monday that it will launch two separate credit scores including BNPL data. \n\nFICO Score 10 BNPL and FICO Score 10 T BNPL will \"represent a significant advancement in credit scoring, accounting for the growing importance of BNPL loans in the U.S. credit ecosystem,\" the company said in a statement. \"These scores provide lenders with greater visibility into consumers' repayment behaviors, enabling a more comprehensive view of their credit readiness which ultimately improves the lending experience,\" FICO added.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FICO+To+Incorporate+Buy-Now-Pay-La",
        "id": 3000990,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/23/1823245/fico-to-incorporate-buy-now-pay-later-loans-into-credit-scores?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FICO To Incorporate Buy-Now-Pay-Later Loans Into Credit Scores",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T18:29:51.132133+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T17:20:00+00:00",
        "description": "An anonymous reader shares a report: AI firm DeepSeek is aiding China's military and intelligence operations, a senior U.S. official told Reuters, adding that the Chinese tech startup sought to use Southeast Asian shell companies to access high-end semiconductors that cannot be shipped to China under U.S. rules. The U.S. conclusions reflect a growing conviction in Washington that the capabilities behind the rapid rise of one of China's flagship AI enterprises may have been exaggerated and relied heavily on U.S. technology. \n\n[...] \"We understand that DeepSeek has willingly provided and will likely continue to provide support to China's military and intelligence operations,\" a senior State Department official told Reuters in an interview. \"This effort goes above and beyond open-source access to DeepSeek's AI models,\" the official said, speaking on condition of anonymity in order to speak about U.S. government information. Chinese law requires companies operating in China to provide dat",
        "id": 3000510,
        "language": null,
        "link": "https://slashdot.org/story/25/06/23/1515222/deepseek-aids-chinas-military-and-evaded-export-controls-us-official-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DeepSeek Aids China's Military and Evaded Export Controls, US Official Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T17:24:51.191663+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T16:30:00+00:00",
        "description": "IYO filed a trademark infringement lawsuit [PDF] against OpenAI and Jony Ive's company earlier this month, alleging the defendants deliberately adopted a confusingly similar name for competing products. The lawsuit surfaced after the Microsoft-backed startup quietly pulled promotional materials about its $6.5 acquisition billion deal with Ive's firm. \n\nThe Northern District of California complaint targets OpenAI's $6.5 billion acquisition of \"IO Products, Inc.,\" announced May 21, 2025. IYO, which spun out from Google X in 2021, produces the \"IYO ONE,\" an ear-worn device that allows users to interact with computers and AI through voice commands without screens or keyboards. \n\nIYO has invested over $62 million developing its audio computing technology, it says in the filing. According to the complaint, OpenAI CEO Sam Altman and Ive's design studio LoveFrom met with IYO representatives multiple times between 2022 and 2025, learning details about IYO's technology and business plans. In Ma",
        "id": 2999922,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/23/1630236/iyo-sues-openai-over-io?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "IYO Sues OpenAI Over IO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T16:20:22.675585+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T16:01:00+00:00",
        "description": "New York will construct the first major new U.S. nuclear power plant in more than 15 years, with Governor Kathy Hochul directing the state's public electric utility to add at least one gigawatt of nuclear generation capacity. The New York Power Authority will identify an upstate location and determine reactor design, either independently or through private partnerships. \n\nThe project tests President Trump's May executive orders aimed at accelerating nuclear development through regulatory overhaul, expedited licensing, and expanded use of federal lands for reactors. Only five new commercial reactors have come online since 1991, while nuclear capacity has declined more than 4% from its 2012 peak. Potential sites include grounds of New York's three existing plants owned by Constellation Energy. The state is already collaborating with Constellation on federal grant applications for reactor additions at the Nine Mile Point facility in Oswego and studying Ontario's small modular reactor ini",
        "id": 2999295,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/23/1351206/new-york-to-build-one-of-first-us-nuclear-power-plants-in-generation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New York To Build One of First US Nuclear-Power Plants in Generation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T16:20:22.883845+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T15:20:00+00:00",
        "description": "Apple has quietly removed its day-old \"The Parent Presentation\" video from YouTube. From a report: The Parent Presentation is a customizable slideshow that explains why a Mac is a useful tool in college. [...] Students can customize the presentation slides, and then show it to their parents to convince them to buy them a Mac. In an accompanying YouTube video shared by Apple, comedian Martin Herlihy showed a group of high school students how to effectively use The Parent Presentation. Some users described the ad as \"cringe\" and \"gross.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Pulls+'Convince+Your+Parents+To+Get+You+a+Mac'+Ad+From+YouTube%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F06%2F23%2F1510246%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot",
        "id": 2999296,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/23/1510246/apple-pulls-convince-your-parents-to-get-you-a-mac-ad-from-youtube?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Pulls 'Convince Your Parents To Get You a Mac' Ad From YouTube",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T15:14:51.326697+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T14:40:00+00:00",
        "description": "The U.S. House chief administrative officer has banned WhatsApp from congressional staffers' government devices citing data vulnerability concerns. The cybersecurity office deemed the messaging app \"high-risk\" due to lack of transparency in data protection, absence of stored data encryption, and potential security risks, according to an email obtained by Axios. \n\nStaff cannot download or keep WhatsApp on any House device, including mobile, desktop, or web browser versions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=House+Bans+WhatsApp+on+Congressional+Staff+Devices+Over+Security+Concerns%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F06%2F23%2F1441200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F06%2F23%2F1441200%2Fhouse-bans-whatsapp-o",
        "id": 2998736,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/23/1441200/house-bans-whatsapp-on-congressional-staff-devices-over-security-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "House Bans WhatsApp on Congressional Staff Devices Over Security Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T14:09:52.176480+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T14:00:00+00:00",
        "description": "Bruce66423 writes (slightly edited to add more context): A former potash mine at Wittelsheim in Alsace now entombs about 42,000 tonnes of toxic industrial waste, and scientists warn that, over time, contaminants could seep upward into the Alsace aquifer, which in turn feeds the transboundary Upper Rhine groundwater system supplying drinking water to millions in France, Germany and Switzerland. Campaigners argue that leaving the waste underground instead of removing it creates a long-term 'time-bomb' for people and wildlife.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Buried+French+Toxic-Waste+'Time-Bomb'+Could+Poison+Drinking-Water+For+Millions+in+Europe%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F06%2F23%2F0954234%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.sl",
        "id": 2998144,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/23/0954234/buried-french-toxic-waste-time-bomb-could-poison-drinking-water-for-millions-in-europe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Buried French Toxic-Waste 'Time-Bomb' Could Poison Drinking-Water For Millions in Europe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T13:04:50.780147+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T11:46:00+00:00",
        "description": "Perched in Chile's Andes mountains, \"A revolutionary new space telescope has just taken its first pictures of the cosmos,\" reports National Geographic &mdash; \"and they're spectacular.\" Formerly known as the Large Synoptic Survey Telescope, it's expected to bring \"unprecedented detail\" to space photography:\n\nThe observatory has a few key components: A giant telescope, called the Simonyi Survey Telescope, is connected to the world's largest and highest resolution digital camera. Rubin's 27-foot primary mirror, paired with a mind-boggling 3,200-megapixel camera, will repeatedly take 30-second exposure images of vast swaths of the sky with unrivaled speed and detail. Each image will cover an area of sky as big as 40 full moons. Every three nights for the next 10 years, Rubin will produce a new, ultra-high-definition map of the entire visible southern sky. With this much coverage, scientists hope to create an updated and detailed \"movie\" they can use to view how the cosmos changes over ti",
        "id": 2996996,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/23/0717244/unprecedented-detail-vera-rubin-space-telescope-releases-first-images-from-its-3200-megapixel-camera?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Unprecedented' Detail: Vera Rubin Space Telescope Releases First Images from Its 3,200-Megapixel Camera",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T09:00:42.600563+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T08:48:00+00:00",
        "description": "The classic VW bus got an all-electric update &mdash; but that was just the beginning. Now there's an autonomous driving version (that's intended for commercial fleets, reports Jalopnik, \"a level 4 vehicle that drives set routes\" that's \"going into full production\" as the ID Buzz AD. (The AD stands for \"autonomous driving\")\n\n\nThe AD version sports a longer wheelbase and a higher roofline than its mere human-driven sibling, which helps it to fit in the 13 cameras, nine LiDARs, and five radars that will (hopefully) allow the car to drive without crashing into anybody. These are intended for large-fleet customers providing taxi services, either ones run by local governments or private companies. [Volkswagen Group software subsidiary MOIA] has already lined up its first customer, the German city of Hamburg, which will provide the automated Buzz as a public transit option alongside traditional bus and subway services. If all goes well, after Hamburg MOIA \"will bring sustainable, autonomous",
        "id": 2996206,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/23/0330224/volkswagens-autonomous-id-buzz-robotaxi-is-ready-and-cities-and-companies-can-buy-them-soon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Volkswagen's Autonomous 'ID Buzz' Robotaxi Is Ready, And Cities And Companies Can Buy Them Soon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T06:50:35.715126+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T05:48:00+00:00",
        "description": "The Python Software Foundation (\"made up of, governed, and led by the community\") does more than just host Python and its documnation, the Python Package Repository, and the development workflows of core CPython developers. This week the PSF released its 28-page Annual Impact Report this week, noting that 2024 was their first year with three CPython developers-in-residence &mdash; and \"Between Lukasz, Petr, and Serhiy, over 750 pull requests were authored, and another 1,500 pull requests by other authors were reviewed and merged.\"\n\n\nLukasz Langa co-implemented the new colorful shell included in Python 3.13, along with Pablo Galindo Salgado, Emily Morehouse-Valcarcel, and Lysandros Nikolaou.... Code-wise, some of the most interesting contributions by Petr Viktorin were around the ctypes module that allows interaction between Python and C.... These are just a few of Serhiy Storchaka's many contributions in 2024: improving error messages for strings, bytes, and bytearrays; reworking supp",
        "id": 2995649,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/23/0542243/behind-the-scenes-at-the-python-software-foundation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Behind the Scenes at the Python Software Foundation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T02:30:40.234045+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T02:12:00+00:00",
        "description": "U.S. consumers \"rank problems with public electric vehicle charging and the time it takes to recharge as their top two reasons for rejecting electric vehicles,\" writes the New York Times, citing figures from data analytics firm J.D. Power. \n\nBut are things getting better?\nAutomakers and charging companies are building new stations and updating their cars to allow drivers to more easily and quickly recharge their vehicles. They're also outfitting charging stations with items such as food and bathrooms, and making the devices more reliable. Because chargers are only as fast as the cars they connect with, automakers are designing new cars to absorb electricity at higher speeds. In addition, many automakers have cut deals with Tesla to allow owners of other cars to use the company's fast-charging network, the largest in the country and widely considered the most reliable. \n\nEarly evidence suggests efforts to improve electric vehicle charging are paying off. In recent years, J.D. Power sur",
        "id": 2994700,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/23/0149223/is-america-finally-improving-its-electric-car-chargers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is America Finally Improving Its Electric Car Chargers?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-23T00:22:07.769757+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-23T00:12:00+00:00",
        "description": "The developer-focused analyst firm RedMonk releases twice-a-year rankings of programming language popularity. This week they also released a handy graph showing the movement of top 20 languages since 2012. Their current rankings for programming language popularity...\n\n\n\n 1. JavaScript\n2. Python\n3. Java\n4. PHP\n5. C#\n6. TypeScript\n7. CSS\n8. C++\n9. Ruby\n10. C \n\n\nThe chart shows that over the years the rankings really haven't changed much (other than a surge for TypeScript and Python, plus a drop for Ruby). JavaScript has consistently been #1 (except in two early rankings, where it came in behind Java). And in 2020 Java finally slipped from #2 down to #3, falling behind... Python. Python had already overtaken PHP for the #3 spot in 2017, pushing PHP to a steady #4. C# has maintained the #5 spot since 2014 (though with close competition from both C++ and CSS). And since 2021 the next four spots have been held by Ruby, C, Swift, and R. \n\nThe only change in the current top 20 since the last ",
        "id": 2994312,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/23/009244/redmonk-ranks-top-programming-languages-over-time---and-considers-ditching-its-stack-overflow-metric?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "RedMonk Ranks Top Programming Languages Over Time - and Considers Ditching Its 'Stack Overflow' Metric",
        "vote": 0
    }
]