[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T18:55:47.493868+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T17:30:01+00:00",
        "description": "Ghost of Yotei is largely an iterative improvement over the title that paved the way for its success, but that does not extend to its combat system. Sucker Punch's litany of additions to a core aspect of the Ghost franchise's popularity has ensured that Atsu's time in Ezo is full of battles that are bigger in size and scope than any of Jin's fights with the invading Mongol army.\n\nIt does so by creating the space for an evolution via the game's narrative, and then using that space to the fullest extent possible with changes and improvements to the game's combat mechanics and enemy AI that make this title an action experience like no other. \n\nAtsu might be a force to be reckoned with but her enemies rarely let that get in the way of their determination to put an end to the legend of the Onryo. We dive into how any why Yotei's combat feels as good as it does.",
        "id": 3748981,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=7wnQbh27E1c",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7wnQbh27E1c/hqdefault.jpg",
        "title": "How Ghost of Yotei's Combat Goes Above And Beyond Ghost of Tsushima",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T16:08:36.252083+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T15:30:31+00:00",
        "description": "Released in 2019, The Outer Worlds was a critical success despite its imperfections. Gunplay, world building, RPG progression, all of its composite systems were good without being groundbreaking. \n\nThe biggest glare, though, was its lack of scale. There was always the feeling with The Outer Worlds that the game promised more than it delivered. Well, six years later the game has assessed those composite parts, and is a sequel that’s bigger, bolder, and better in almost every aspect. \n\nThe story, of course, takes centre stage, but it's supported here by expansive character creation. Neither gets in the way of the other; together, they’ll propel players starward to a sequel which is set to break new ground in the RPG space. \n\nThis feature outlines 15 of the biggest differences between The Outer Worlds and its grander sequel.",
        "id": 3747471,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=ZNpiw3ztG7o",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZNpiw3ztG7o/hqdefault.jpg",
        "title": "The Outer Worlds 2 vs. The Outer Worlds 1 - 15 BIGGEST Differences You MAY NOT KNOW",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T12:02:22.861759+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T11:01:04+00:00",
        "description": "You can argue that there should have been more extras included with the package, especially with how much these games cost ($70 for the pack with both included, or $40 for each individually), and because this is, after all, an anniversary release. \n\nAnd sure, there’s a case to be made for that. But honestly, Galaxy and Galaxy 2 are so spectacular as games, that simply being able to play them again, and in a better and more definitive form than ever before, is still more than worth it. \n\nWhether you are a long time fan wanting to revisit these formative experiences, or a newcomer wanting to see what all the hubbub is about, Super Mario Galaxy 1 + 2 on the Switch and Switch 2 is a must have purchase for anyone who likes 3D platformers… or good games in general.",
        "id": 3745259,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Y8m4upMBuxc",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y8m4upMBuxc/hqdefault.jpg",
        "title": "Super Mario Galaxy + Super Mario Galaxy 2 Switch 2 Review - The Final Verdict",
        "vote": 0
    }
]