[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T23:38:54.835203+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T23:30:00+00:00",
        "description": "Bloomberg reports (paywalled) that Apple's hardware chief John Ternus is the frontrunner to replace Tim Cook as CEO, as Cook nears retirement and prepares to transition into a board chairman role. The Economic Times reports: Cook is turning 65 next month. Chief operating officer John Williams -- once heir apparent -- has handed over the reins of day-to-day operations to Sabih Khan and is on his way out. Even as Cook steps down as CEO, he will stay involved in some capacity, likely as board chairman. [...]\n \nWhile Khan and Apple's retail chief Deirdre O'Brien can run daily operations, Ternus remains the leading contender for the corner office after Cook, Gurman said. Firstly, he is 50 years old -- the same as Cook when he became CEO -- giving him over a decade to hold the office, he noted. Secondly, Apple needs a technologist instead of a sales person at the helm, considering the company's ambitions, Gurman wrote in the newsletter. While the Cupertino tech giant has managed to expand i",
        "id": 3750954,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/06/2145241/apple-hardware-head-john-ternus-top-pick-to-succeed-tim-cook-as-ceo",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Hardware Head John Ternus Top Pick To Succeed Tim Cook As CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T23:38:54.902189+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T22:50:00+00:00",
        "description": "Police arrested 33-year-old Joseph Mayuyo after a series of online threats forced TikTok to evacuate its Culver City headquarters. TechCrunch reports: A press release from the Culver City Police Department says that TikTok employees reported receiving multiple threats, across various social media platforms, from 33-year-old Hawthorne resident Joseph Mayuyo. After an additional message threatened TikTok's Culver City headquarters, police say company security evacuated the office \"out of an abundance of caution.\"\n \nPolice then investigated Mayuyo's home, according to the press release. During the investigation, he allegedly posted additional threatening statements, including one declaring that he would not be taken alive. Detectives obtained search and arrest warrants, and they negotiated with Mayuyo for 90 minutes before he voluntarily exited his home and was taken into custody, the police department says.\n \nBusiness Insider reports that one TikTok employee described the threats as \"re",
        "id": 3750955,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/06/2136244/suspect-arrested-after-threats-against-tiktoks-culver-city-headquarters",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Suspect Arrested After Threats Against TikTok's Culver City Headquarters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T23:38:54.969244+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from The Verge: OpenAI is introducing a way to work with apps right inside ChatGPT. The idea is that, from within a conversation with the chatbot, you can essentially tag in apps to help you complete a task while ChatGPT offers context and advice. [...]\n \nApps available inside ChatGPT starting today will include Booking.com, Canva, Coursera, Expedia, Figma, Spotify, and Zillow. In the \"weeks ahead,\" OpenAI will add more apps, such as DoorDash, OpenTable, Target, and Uber. [...] Developers can access the SDK for making apps in preview starting today. Later this year, developers will be able to submit apps for review and publication, and OpenAI also plans to offer a directory for users to browse apps, according to OpenAI CEO Sam Altman. The company will share guidance about monetization \"soon,\" Altman says. Last week, ChatGPT unveiled a new feature called \"Instant Checkout\" that lets users buy stuff directly through its chatbot -- \"part of its overall",
        "id": 3750956,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/06/2133248/openai-will-let-developers-build-apps-that-work-inside-chatgpt",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Will Let Developers Build Apps That Work Inside ChatGPT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T22:12:34.071758+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T21:30:00+00:00",
        "description": "Porsche's wireless charging system will not be available on the Macan Electric and Taycan because the inductive charging plate cannot physically fit between the front suspension on those models. Dr. Maximilian Muller, Porsche's high voltage engineering lead, told The Drive during a visit to the company's Leipzig facility that the Cayenne Electric's larger dimensions create the necessary space for the charging hardware beneath the front motor. The Cayenne Electric is wider than both the Taycan and Macan Electric. The larger vehicle forced Porsche to design different suspension geometry even though it shares the PPE platform with the Macan Electric. The changes create additional packaging constraints that prevent retrofitting the wireless charging system into existing electric models.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Porsche+Can't+Add+Wireless+Charging+To+Macan%2C+Taycan+EV+Because+the+Inductive+Plate+Do",
        "id": 3750297,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/06/1945202/porsche-cant-add-wireless-charging-to-macan-taycan-ev-because-the-inductive-plate-doesnt-fit",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Porsche Can't Add Wireless Charging To Macan, Taycan EV Because the Inductive Plate Doesn't Fit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T22:12:34.149825+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T20:51:00+00:00",
        "description": "An anonymous reader shares a report: Pay-advance apps are marketed as a way to help workers living paycheck to paycheck pay for unexpected expenses, but workers are often using the apps to manage basic expenses like groceries, rent and other needs, a new report found. The tools, consumer advocates say, can carry costs akin to those of traditional payday loans. \n\nAn analysis of anonymous data found worrisome behavior among users of the apps, including quick increases in the number of advances, advances from multiple apps at the same time and more frequent bank overdraft fees. \"These findings reveal persistent patterns of financial strain that raise serious concerns about the long-term effects of these loans,\" said the report from the Center for Responsible Lending, a nonprofit consumer advocacy group. The group analyzed data from SaverLife, a nonprofit that promotes saving and sound financial practices among people with low or moderate incomes. The analysis found that heavy users of th",
        "id": 3750298,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/06/1938255/some-workers-are-turning-to-pay-advance-apps-for-basic-expenses",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some Workers Are Turning To Pay-Advance Apps for Basic Expenses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T20:33:59.137102+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T20:10:00+00:00",
        "description": "BrianFagioli writes: Canonical has revealed the codename for Ubuntu 26.04 LTS: Resolute Raccoon. The announcement came today on X through the official @ubuntu account, continuing the tradition of pairing an adjective with an animal for each release. As an LTS version, it will be supported for five years and serve as the foundation for servers, desktops, and cloud deployments when it launches in April 2026. \n\nWhile the name itself is now public, the features of Ubuntu 26.04 remain under wraps. The community will be watching closely to see which kernel it ships with, how GNOME evolves, and what improvements land for enterprise and container use. For now, fans simply have a raccoon mascot to rally around as the countdown to April begins.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ubuntu+Linux+26.04+LTS+Officially+Named+Resolute+Raccoon%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F06%2F1933231%2F%3Futm_sou",
        "id": 3749624,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/06/1933231/ubuntu-linux-2604-lts-officially-named-resolute-raccoon",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ubuntu Linux 26.04 LTS Officially Named Resolute Raccoon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T20:33:59.281762+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T19:30:00+00:00",
        "description": "Microsoft said in a statement Monday it remains committed to developing first-party Xbox consoles. The reassurance came after rumors circulated suggesting the gaming division might abandon hardware manufacturing. The speculation gained traction following a 50% price increase for Xbox Game Pass Ultimate and retailers including Costco removing Xbox products from their shelves. \n\nMicrosoft said it is \"actively investing in our future first-party consoles and devices designed, engineered and built by Xbox.\" The company's multi-year partnership with AMD for next-generation hardware also continues. Devices in development include the Xbox Ally range under codenames Omni and Horseman, according to Windows Central. Xbox Series X and Series S production has also not stopped, the report added.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Assures+Gamers+It's+Not+Abandoning+Xbox+Hardware%3A+https%3A%2F%2Fgames.slashd",
        "id": 3749625,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/06/1929246/microsoft-assures-gamers-its-not-abandoning-xbox-hardware",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Assures Gamers It's Not Abandoning Xbox Hardware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T19:09:43.587411+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T18:48:00+00:00",
        "description": "An anonymous reader shares a report: OpenAI CEO Sam Altman said Monday that ChatGPT has reached 800 million weekly active users, marking an increase of adoption among consumers, developers, enterprises, and governments. ChatGPT's impressive growth comes as OpenAI is on a race to secure as many AI chips and build as much AI infrastructure as possible. In August, OpenAI said it was on the cusp of reaching 700 million weekly active users, already an increase from 500 million weekly active users at the end of March. \n\n\"Today, 4 million developers have built with OpenAI,\" Altman said. \"More than 800 people use ChatGPT every week, and we process over 6 billion tokens per minute on the API. Thanks to all of you, AI has gone from something people build play with to something people build with every day.\" Altman made the announcement during the keynote presentation for OpenAI's Dev Day, which also included announcement for new tools for building apps inside of ChatGPT, as well as constructing ",
        "id": 3749035,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/06/1848254/chatgpt-now-has-800-million-weekly-active-users",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ChatGPT Now Has 800 Million Weekly Active Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T19:09:43.655328+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T18:06:00+00:00",
        "description": "An anonymous reader shares a report: Tucked in the foothills of Tennessee's Smoky Mountains is a factory that has figured out a way to manufacture in America that's cheaper, quicker and better. It's the home of a famous American writing implement: the Sharpie marker. Pen barrels whirl along automated assembly lines that rapidly fill them with ink. At least half a billion Sharpie markers are churned out here every year, each one made of six parts. Only the felt tip is imported, from Japan. \n\nIt didn't used to be this way. Back in 2018, many Sharpies were made abroad. That's when Chris Peterson, who was the CFO of Sharpie maker Newell Brands challenged his team to answer a question: How could they keep Newell from becoming obsolete compared with factories in Asia? \"I felt like we had an opportunity to dramatically improve our U.S. manufacturing,\" he said. Peterson is now the CEO. And these days, most Sharpies -- in all 93 colors -- are made at this 37-year-old factory. Newell did it wit",
        "id": 3749036,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/06/1744203/sharpie-found-a-way-to-make-pens-more-cheaply---by-manufacturing-them-in-the-us",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sharpie Found a Way To Make Pens More Cheaply - By Manufacturing Them in the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T17:48:19.059267+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T17:25:00+00:00",
        "description": "Deforestation is draining color from butterfly populations in Brazil. Researchers studying butterflies in the state of Esp&#195;rito Santo found 31 species in natural forests but only 21 in eucalyptus plantations. The plantation communities were dominated by brown-colored species. Roberto Garc&#195;a-Roa, part of the research project, said the colors on butterfly wings have been designed over millions of years. \n\nLead researcher Maider Iglesias-Carrasco from the University of Copenhagen observed a general feeling of emptiness in the plantations. Ricardo Spaniol from the Federal University of Rio Grande do Sul discovered in 2019 that the most colorful Amazonian species often disappear first after deforestation, probably because of the loss of native vegetation and increased exposure to predators. Eucalyptus plantations cover at least 22 million hectares around the world. Spaniol's research found that forested Amazon habitats regenerating for 30 years after use as cattle pasture showed ",
        "id": 3748338,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/06/1627246/as-forests-are-cut-down-butterflies-are-losing-their-colours",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "As Forests Are Cut Down, Butterflies Are Losing Their Colours",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T17:48:19.122342+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T16:45:00+00:00",
        "description": "Deloitte will partially refund payment for an Australian government report that contained multiple errors after admitting it was partly produced by AI [non-paywalled source]. From a report: The Big Four accountancy and consultancy firm will repay the final instalment of its government contract after conceding that some footnotes and references it contained were incorrect, Australia's Department of Employment and Workplace Relations said on Monday. The department had commissioned a A$439,000 ($290,300) \"independent assurance review\" from Deloitte in December last year to help assess problems with a welfare system for automatically penalising jobseekers. \n\nThe Deloitte review was first published earlier this year, but a corrected version was uploaded on Friday to the departmental website. In late August the Australian Financial Review reported that the document contained multiple errors, including references and citations to non-existent reports by academics at the universities of Sydne",
        "id": 3748339,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/06/1622238/deloitte-issues-refund-for-error-ridden-australian-government-report-that-used-ai",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Deloitte Issues Refund For Error-Ridden Australian Government Report That Used AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T16:23:32.926547+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T16:03:00+00:00",
        "description": "European labor regulations enacted nearly a century ago now impose costs on companies that discourage investment in disruptive technologies. An American firm shedding workers incurs costs equivalent to seven months of wages per employee. In Germany the figure reaches 31 months. In France it reaches 38 months. The expense extends beyond severance pay and union negotiations. Companies retain unproductive workers they would prefer to dismiss. \n\nNew investments face delays of years as dismissed employees are gradually replaced. Olivier Coste, a former EU official turned tech entrepreneur, and economist Yann Coatanlem tracked these opaque restructuring costs and found that European firms avoid risky ventures because of them. Large companies typically finance ten risky projects where eight fail and require mass redundancies. Apple developed a self-driving car for years before abandoning the effort and firing 600 employees in 2024. The two successful projects generate profits worth many time",
        "id": 3747536,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/06/164204/how-europe-crushes-innovation",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Europe Crushes Innovation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T16:23:32.986431+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T15:22:00+00:00",
        "description": "Fortune tested the AI Friend necklace for two weeks and found it struggled to perform its basic function. The $129 pendant missed conversations entirely during the author's breakup call and could only offer vague questions about \"fragments\" when she tried to ask for advice. The device lagged seven to ten seconds behind her speech and frequently disconnected. The author had to press her lips against the pendant and repeat herself multiple times to get coherent replies. After a week and a half the necklace forgot her name and later misremembered her favorite color. \n\nThe startup has raised roughly seven million dollars in venture capital for the product and spent a large portion on eleven thousand subway posters across the MTA system. Sales reached three thousand units but only one thousand have shipped. The company brought in slightly under four hundred thousand dollars in revenue. The startup told Fortune he deliberately \"lobotomized\" the AI's personality after receiving complaints. T",
        "id": 3747537,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/06/1522202/testing-the-viral-ai-necklace-that-promises-companionship-but-delivers-confusion",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Testing the Viral AI Necklace That Promises Companionship But Delivers Confusion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T14:59:49.857306+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T14:42:00+00:00",
        "description": "Mary E. Brunkow, Fred Ramsdell and Shimon Sakaguchi received the Nobel Prize in Physiology or Medicine on Monday for their discoveries about how the immune system regulates itself. The three researchers split 11 million Swedish kroner ($1.17 million). Their work identified regulatory T cells and the FOXP3 gene that controls them. Dr. Sakaguchi spent more than a decade solving a puzzle about the thymus. He discovered that the immune system has a backup mechanism to stop harmful cells from attacking the body's own tissues. Dr. Brunkow and Dr. Ramsdell found the specific gene responsible for this process while studying mice that developed severe autoimmune disease. \n\nMore than 200 clinical trials are now underway based on their research. Cancers attract regulatory T cells to block immune attacks. Researchers are developing drugs to turn the immune system against these cancer cells. In autoimmune diseases, regulatory T cells are missing or defective. The FOXP3 gene provides a starting poi",
        "id": 3746732,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/06/1442218/immune-system-research-earns-nobel-prize-for-brunkow-ramsdell-and-sakaguchi",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Immune System Research Earns Nobel Prize for Brunkow, Ramsdell and Sakaguchi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T14:59:49.918167+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T14:01:00+00:00",
        "description": "OpenAI and AMD announced a multibillion-dollar partnership on Monday for AI data centers running on AMD processors. OpenAI committed to purchasing 6 gigawatts worth of AMD's MI450 chips starting next year through direct purchases or through its cloud computing partners. AMD chief Lisa Su said the deal will result in tens of billions of dollars in new revenue over the next half-decade. \n\nOpenAI will receive warrants for up to 160 million AMD shares at 1 cent per share, representing roughly 10% of the chip company. The warrants will be awarded in phases if OpenAI hits certain deployment milestones. The partnership marks AMD's biggest win in its quest to disrupt Nvidia's dominance among AI semiconductor companies. Mizuho Securities estimates that Nvidia controls more than 70% of the market for AI chips.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+and+AMD+Strike+Multibillion-Dollar+Chip+Partnership%3A+https%3A",
        "id": 3746733,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/06/141218/openai-and-amd-strike-multibillion-dollar-chip-partnership",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI and AMD Strike Multibillion-Dollar Chip Partnership",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T12:20:43.604611+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T11:34:00+00:00",
        "description": "Vibe coding tools \"are transforming the job experience for many tech workers,\" writes the Los Angeles Times. But Gartner analyst Philip Walsh said the research firm's position is that AI won't replace software engineers and will actually create a need for more.\n\n\"There's so much software that isn't created today because we can't prioritize it,\" Walsh said. \"So it's going to drive demand for more software creation, and that's going to drive demand for highly skilled software engineers who can do it...\" The idea that non-technical people in an organization can \"vibe-code\" business-ready software is a misunderstanding [Walsh said]... \"That's simply not happening. The quality is not there. The robustness is not there. The scalability and security of the code is not there,\" Walsh said. \"These tools reward highly skilled technical professionals who already know what 'good' looks like.\" \n\"Economists, however, are also beginning to worry that AI is taking jobs that would otherwise have gone t",
        "id": 3745331,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/06/031253/what-if-vibe-coding-creates-more-programming-jobs",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What If Vibe Coding Creates More Programming Jobs?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T08:22:11.040403+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T07:34:00+00:00",
        "description": "Steve Jobs died 14 years ago. But the blog Cult of Mac remembers that \"Jobs himself was not sentimental.\"\n\n\nWhen he left Apple in the mid-1980s, he didn't even clear out his office. That meant personal mementos like his first Apple stock certificate, which had hung on his office wall, got tossed in the trash. Shortly after returning to Apple in the late 1990s, he gave the company's historical archive to Stanford University Libraries. The stash included records that Apple management kept since the mid-1980s. The reason Apple handed over this historical treasure trove? Jobs didn't want the company to fixate on the past... \n\nAll of which goes some way to saying why it was so heartening that Steve Jobs' death received so much attention. He wasn't the richest technology CEO to die. But the reaction showed that his life &mdash; faults and all &mdash; meant a lot to a great number of people. Jobs helped create products people cared about, and in turn they cared about him. \nThe site Mac Rumor",
        "id": 3744249,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/06/0554208/steve-jobs-remembered-on-14th-anniversary-of-his-death",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Steve Jobs Remembered on 14th Anniversary of His Death",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T04:48:41.097724+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T04:39:00+00:00",
        "description": "The director of a tour operation remembers two tourists arriving in a rural town in Peru determined to hike alone in the mountains to a sacred canyon recommended by their AI chatbot. But the canyon didn't exists &mdash; and a high-altitude hike could be dangerous (especially where cellphone coverage is also spotty). They're part of a BBC report on travellers arriving at their destination \"only to find they've been fed incorrect information or steered to a place that only exists in the hard-wired imagination of a robot...\" \n\"According to a 2024 survey, 37% of those surveyed who used AI to help plan their travels reported that it could not provide enough information, while around 33% said their AI-generated recommendations included false information.\" Some examples?\n\n- Dana Yao and her husband recently experienced this first-hand. The couple used ChatGPT to plan a romantic hike to the top of Mount Misen on the Japanese island of Itsukushima earlier this year. After exploring the town of",
        "id": 3743414,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/06/0434206/what-happens-when-ai-directs-tourists-to-places-that-dont-exist",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happens When AI Directs Tourists to Places That Don't Exist?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T02:28:57.023661+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T02:12:00+00:00",
        "description": "If we could remove the 50 most concerning pieces of space debris in low-Earth orbit, there'd be a 50% reduction in the overall debris-generating potential, reports Ars Technica. That's according to Darren McKnight, lead author of a paper presented Friday at the International Astronautical Congress in Sydney, which calculated the objects most likely to collide with other fragments and create more debris. (Russia and the Soviet Union lead with 34 objects, followed by China with 10, the U.S. with three, Europe with two, and Japan with one.) Even just the top 10 were removed, the debris-generating potential drops by 30%. \n\n\"The things left before 2000 are still the majority of the problem,\" he points out, and \"76% of the objects in the top 50 were deposited last century.\" 88% of the objects are post-mission rocket bodies left behind to hurtle through space.\n\n\n\n \"The bad news is, since January 1, 2024, we've had 26 rocket bodies abandoned in low-Earth orbit that will stay in orbit for more",
        "id": 3743010,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/06/0148246/removing-50-objects-from-orbit-would-cut-danger-from-space-junk-in-half",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Removing 50 Objects from Orbit Would Cut Danger From Space Junk in Half",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T01:19:14.648812+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T01:12:00+00:00",
        "description": "\"Recent attacks show that hackers keep using the same tricks to sneak bad code into popular software registries,\" writes long-time Slashdot reader selinux geek, suggesting that \"the real problem is how these registries are built, making these attacks likely to keep happening.\"\n\nAfter all, npm wasn't the only software library hit by a supply chain attack, argues the Linux Security blog. \"PyPI and Docker Hub both faced their own compromises in 2025, and the overlaps are impossible to ignore.\"\n Phishing has always been the low-hanging fruit. In 2025, it wasn't just effective once &mdash; it was the entry point for multiple registry breaches, all occurring close together in different ecosystems... The real problem isn't that phishing happened. It's that there weren't enough safeguards to blunt the impact. One stolen password shouldn't be all it takes to poison an entire ecosystem. Yet in 2025, that's exactly how it played out... \n\nEven if every maintainer spotted every lure, registries le",
        "id": 3742827,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/05/2318202/are-software-registries-inherently-insecure",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are Software Registries Inherently Insecure?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-06T01:19:14.729170+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-06T00:12:00+00:00",
        "description": "A computer-generated actress appearing in Instagram shorts now has a talent agent, reports the Los Angeles Times. \nThe massive screen actors union SAG-AFTRA \"weighed in with a withering response.\"\n\nSAG-AFTRA believes creativity is, and should remain, human-centered. The union is opposed to the replacement of human performers by synthetics. \n\nTo be clear, \"Tilly Norwood\" is not an actor, it's a character generated by a computer program that was trained on the work of countless professional performers &mdash; without permission or compensation. It has no life experience to draw from, no emotion and, from what we've seen, audiences aren't interested in watching computer-generated content untethered from the human experience. It doesn't solve any \"problem\" &mdash; it creates the problem of using stolen performances to put actors out of work, jeopardizing performer livelihoods and devaluing human artistry. \n\nAdditionally, signatory producers should be aware that they may not use synthetic ",
        "id": 3742828,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/06/009212/fake-ai-generated-actress-gets-agent---and-a-very-angry-reaction-from-human-actors-union",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fake AI-Generated Actress Gets Agent - and a Very Angry Reaction from (Human) Actors Union",
        "vote": 0
    }
]