[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-07T17:58:16.697477+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-07T17:34:00+00:00",
        "description": "Why does Netflix want to buy Warner Bros, asks the chief film critic at the long-running motion-picture magazine Variety. \"It is hard, at this moment, to resist the suspicion that the ultimate reason... is to eliminate the competition.\"\n\n[Warner Bros. is] one of the only companies that's keeping movies as we've known them alive... Some people think movies are going the way of the horse-and-buggy. A company like Warner Bros. has been the tangible proof that they're not. Ted Sarandos, the co-CEO of Netflix, has a different agenda. He has been unabashed about declaring that the era of movies seen in movie theaters is an antiquated concept. This is what he believes &mdash; which is fine. I think a more crucial point is that this is what he wants. \n\n\nThe Netflix business strategy isn't simply about being the most successful streaming company. It's about changing the way people watch movies; it's about replacing what we used to call moviegoing with streaming. (You could still call it movieg",
        "id": 4261936,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/06/0459202/is-netflix-trying-to-buy-warner-bros-or-kill-it",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is Netflix Trying to Buy Warner Bros. or Kill It?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-07T16:55:02.245945+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-07T16:34:00+00:00",
        "description": "FreeBSD 15.0-RELEASE arrived this week, notes this report from The Register, which calls it the latest release \"of the Unix world's leading alternative to Linux.\"\n\n\n\n As well as numerous bug fixes and upgrades to many of its components, the major changes in this version are reductions in the number of platforms the OS supports, and in how it's built and how its component software is packaged. \n\n\nFreeBSD 15 has significantly reduced support for 32-bit platforms. Compared to FreeBSD 14 in 2023, there are no longer builds for x86-32, POWER, or ARM-v6. As the release notes put it: \n\n\"The venerable 32-bit hardware platforms i386, armv6, and 32-bit powerpc have been retired. 32-bit application support lives on via the 32-bit compatibility mode in their respective 64-bit platforms. The armv7 platform remains as the last supported 32-bit platform. We thank them for their service.\" \n\nNow FreeBSD supports five CPU architectures &mdash; two Tier-1 platforms, x86-64 and AArch64, and three Tier-2 ",
        "id": 4261621,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/07/0627214/new-freebsd-15-retires-32-bit-ports-and-modernizes-builds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New FreeBSD 15 Retires 32-Bit Ports and Modernizes Builds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-07T15:53:11.357634+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-07T15:34:00+00:00",
        "description": "\"Homebrew, the package manager for macOS and Linux, just got a handy new feature in the latest v5.0.4 update,\" reports How-To Geek. \n\n\nBrewfile install scripts \"are now more like a one-stop shop for installing software, as Flatpaks are now supported alongside Brew packages, Mac App Store Apps, and other packages.\"\n\n\nFor those times when you need to install many software packages at once, like when setting up a new PC or virtual machine, you can create a Brewfile with a list of packages and run it with the 'brew bundle' command. However, the Brewfile isn't limited to just Homebrew packages. You can also use it to install Mac App Store apps, graphical apps through Casks, Visual Studio Code extensions, and Go language packages. Starting with this week's Homebrew v5.0.4 release, Flatpaks are now supported in Brewfiles as well... \n\nThis turns Homebrew into a fantastic setup tool for macOS, Linux, and Windows Subsystem for Linux (WSL) environments. You can have one script with all your pref",
        "id": 4261240,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/07/0651234/homebrew-can-now-help-you-install-flatpaks-too",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Homebrew Can Now Help You Install Flatpaks Too",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-07T12:40:06.490333+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-07T12:34:00+00:00",
        "description": "Today America's college professors \"struggle to accommodate the many students with an official disability designation,\" reports the Atlantic, \"which may entitle them to extra time, a distraction-free environment, or the use of otherwise-prohibited technology.\" \n\n\nTheir staff writer argues these accommodations \"have become another way for the most privileged students to press their advantage.\"\n\n\n[Over the past decade and a half] the share of students at selective universities who qualify for accommodations &mdash; often, extra time on tests &mdash; has grown at a breathtaking pace. At the University of Chicago, the number has more than tripled over the past eight years; at UC Berkeley, it has nearly quintupled over the past 15 years. The increase is driven by more young people getting diagnosed with conditions such as ADHD, anxiety, and depression, and by universities making the process of getting accommodations easier. The change has occurred disproportionately at the most prestigious",
        "id": 4260178,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/06/0812245/many-privileged-students-at-us-universities-are-getting-extra-time-on-tests-after-disability-diagnoses",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Many Privileged Students at US Universities are Getting Extra Time on Tests After 'Disability' Diagnoses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-07T09:32:01.878873+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-07T08:34:00+00:00",
        "description": "Wired published an article by California-based writer/programmer Sheon Han arguing that Ruby \"is not a serious programming language.\" \n\nHan believes that the world of programming has \"moved on\", and \"everything Ruby does, another language now does better, leaving it without a distinct niche.\n\n\n\n\nRuby is easy on the eyes. Its syntax is simple, free of semicolons or brackets. More so even thanPython &mdash; a language known for its readability &mdash; Ruby reads almost like plain English... Ruby, you might've guessed, is dynamically typed. Python and JavaScript are too, but over the years, those communities have developed sophisticated tools to make them behave more responsibly. None of Ruby's current solutions are on par with those. It's far too conducive to what programmers call \"footguns,\" features that make it all too easy to shoot yourself in the foot. \n\nCritically, Ruby's performance profile consistently ranks near the bottom (read: slowest) among major languages. You may remember",
        "id": 4259417,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/07/0248219/is-ruby-still-a-serious-programming-language",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is Ruby Still a 'Serious' Programming Language?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-07T06:21:06.469160+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-07T05:34:00+00:00",
        "description": "Jolla is \"trying again with a new crowd-funded smartphone,\" reports Phoronix:\n\nFinnish company Jolla started out 14 years ago where Nokia left off with MeeGo and developed Sailfish OS as a new Linux smartphone platform. Jolla released their first smartphone in 2013 after crowdfunding but ultimately the Sailfish OS focus the past number of years now has been offering their software stack for use on other smartphone devices [including some Sony Xperia smartphones and OnePlus/Samsung/ Google/ Xiaomi devices]. \n\nThis new Jolla Phone's pre-order voucher page says the phone will only produced if 2,000 units are ordered before January 4. (But in just a few days they've already received 1,721 pre-orders &mdash; all discounted to 499&euro; from a normal price between 599 and 699 &euro;). Estimate delivery is the first half of 2026.\n\n\n\"The new Jolla Phone is powered by a high-performing Mediatek 5G SoC,\" reports 9to5Linux, \"and features 12GB RAM, 256GB storage that can be expanded to up to 2TB ",
        "id": 4258831,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/12/07/0523228/new-jolla-phone-now-available-for-pre-order-as-an-independent-linux-phone",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Jolla Phone Now Available for Pre-Order as an Independent Linux Phone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-07T03:09:36.488865+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-07T02:34:00+00:00",
        "description": "Washington Post columnist Dana Milbank calls himself \"a highly creative hypochondriac\" &mdash; who just paid for an expensive MRI scan to locate abnormal spots as tiny as 2 millimeters. \n\n\n\nHe discusses the pros and cons of its \"diffusion-weighted imaging\" technology combined with the pattern recognition of AI, which theoretically \"has the potential to save our lives by revealing budding cancers, silent aneurysms and other hidden would-be killers before they become deadly. \"\n\n\nBut the scans cost $2,500 a pop and insurance won't pay. Worse, for every cancer these MRIs find, they produce a slightly greater number of false positives that require a biopsy, with the potential for infection and bleeding and emotional distress. Even when the scans don't produce a false positive, they almost always come up with some vague and disconcerting abnormality.... Will we feel better after viewing our insides? Or will we become anxious about things we hadn't even thought to worry about? \n\n\nPart of liv",
        "id": 4258292,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/07/012206/the-anxieties-of-full-body-mri-scans-not-covered-by-insurance",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Anxieties of Full-Body MRI Scans (Not Covered by Insurance)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-07T01:02:35.006001+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-07T00:21:00+00:00",
        "description": "\"First the penny. Next, paper checks?\" asks CNN:\n\nWhen the U.S. Mint stopped making pennies last month for the first time in 238 years, it drew a lot of attention. But there have been quiet moves to stop using paper checks as well. The government stopped sending out most paper checks to recipients as of the end of September, part of an effort to fully modernize federal benefits payments. And on Thursday the Federal Reserve put out a notice that suggested it is considering &mdash; but only considering &mdash; the \"winding down\" of checking services it now provides for banks. \n\nThe central bank's statement said that as an alternative to winding down those services, it is mulling more investment in its check processing services, but noted that would come at a higher cost. But it is also considering not making any such investments, in order to keep costs roughly unchanged. That would lead to reduced reliability of those services going forward. \"Over time, check use has steadily declined, ",
        "id": 4257887,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/06/1853227/could-americas-paper-checks-be-on-the-way-out-like-the-penny",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could America's Paper Checks Be On the Way Out, Like the Penny?",
        "vote": 0
    }
]