[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T23:24:31.081624+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T23:23:00+00:00",
        "description": "A light aircraft crashed in Gloucestershire after a 3D-printed plastic air-induction elbow softened from engine heat and collapsed, cutting power during final approach and causing the plane to undershoot the runway. Investigators say the part was made from \"inappropriate material\" and safety actions will be taken in the future regarding 3D printed parts. The BBC reports: Following an \"uneventful local flight\", the AAIB report said the pilot advanced the throttle on the final approach to the runway, and realized the engine had suffered a complete loss of power. \"He managed to fly over a road and a line of bushes on the airfield boundary, but landed short and struck the instrument landing system before coming to rest at the side of the structure,\" the report read.\n \nIt was revealed the part had been installed during a modification to the fuel system and collapsed due to its 3D-printed plastic material softening when exposed to heat from the engine. The Light Aircraft Association (LAA) s",
        "id": 4241913,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/04/2125206/plane-crashed-after-3d-printed-part-collapsed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Plane Crashed After 3D-Printed Part Collapsed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T23:24:31.189636+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T22:22:00+00:00",
        "description": "Russia has blocked Apple's FaceTime and the gaming platform Roblox as part of a broader crackdown on foreign tech platforms. CBC News reports: Both restrictions are part of an accelerating clampdown on foreign tech platforms: In the case of FaceTime, Russian authorities allege it is being used for criminal activity, while Roblox was accused of distributing extremist materials and \"LGBT propaganda.\" The move follows restrictions against Google's YouTube, Meta's WhatsApp and the Telegram messaging service.\n \nCritics say the curbs amount to censorship and a tightening of state control over private communications. Russia says they are legitimate law enforcement measures. Russian authorities have this year launched a state-backed rival app called Max, which critics say could be used for surveillance -- allegations that state media have dismissed as false.\n \nJustifying its decision, the communications regulator, Roskomnadzor, said in an emailed statement: \"According to law enforcement agenc",
        "id": 4241914,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/04/186254/russia-blocks-roblox-apples-facetime",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russia Blocks Roblox, Apple's FaceTime",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T22:23:19.017684+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T21:21:00+00:00",
        "description": "The EU has opened an antitrust investigation into Meta over a new WhatsApp policy that could block rival AI assistants from accessing the platform. Complaints from smaller AI developers triggered the probe, which could lead to fines of up to 10% of Meta's global revenue if the company is found to have abused its dominance. Reuters reports: EU antitrust chief Teresa Ribera said the move was to prevent dominant firms from \"abusing their power to crowd out innovative competitors.\" She added interim measures could be imposed to block Meta's new WhatsApp AI policy rollout. \"AI markets are booming in Europe and beyond,\" she said. \"This is why we are investigating if Meta's new policy might be illegal under competition rules, and whether we should act quickly to prevent any possible irreparable harm to competition in the AI space.\"\n \nA WhatsApp spokesperson called the claims \"baseless,\" adding that the emergence of chatbots on its platforms had put a \"strain on our systems that they were not",
        "id": 4241395,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/04/181250/eu-hits-meta-with-antitrust-probe-over-plans-to-block-ai-rivals-from-whatsapp",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU Hits Meta With Antitrust Probe Over Plans To Block AI Rivals From WhatsApp",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T21:18:23.645899+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T20:20:00+00:00",
        "description": "Longtime Slashdot reader williamyf writes: The Italian company Bending Spoons seems to be on an acquisitions spree. Their recent acquisitions of AOL and Vimeo are not yet finalized, yet on Dec. 2 they announced they are buying Eventbrite, a company specializing in publicizing and organizing local events, for just half a milliard USD. Bending Spoons' portfolio also includes other companies like Evernote and WeTransfer. Further reading: Private Equity Hipsters Are Coming For Your Favorite Apps (2024)<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bending+Spoons+Buys+Eventbrite+For+%24500+Million%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F04%2F1751254%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F04%2F1751254%2Fbending-spoons-buys",
        "id": 4240945,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/04/1751254/bending-spoons-buys-eventbrite-for-500-million",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bending Spoons Buys Eventbrite For $500 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T20:16:26.077277+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T19:19:00+00:00",
        "description": "joshuark shares a report from BleepingComputer: Microsoft has silently \"mitigated\" a high-severity Windows LNK vulnerability exploited by multiple state-backed and cybercrime hacking groups in zero-day attacks. Tracked as CVE-2025-9491, this security flaw allows attackers to hide malicious commands within Windows LNK files, which can be used to deploy malware and gain persistence on compromised devices. However, the attacks require user interaction to succeed, as they involve tricking potential victims into opening malicious Windows Shell Link (.lnk) files. Thus some element of social engineering, and user technically naive and gullibility such as thinking Windows is secure is required. [...]\n \nAs Trend Micro threat analysts discovered in March 2025, the CVE-2025-9491 was already being widely exploited by 11 state-sponsored groups and cybercrime gangs, including Evil Corp, Bitter, APT37, APT43 (also known as Kimsuky), Mustang Panda, SideWinder, RedHotel, Konni, and others. Microsoft t",
        "id": 4240420,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/04/1744255/microsoft-mitigates-windows-lnk-flaw-exploited-as-zero-day",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft 'Mitigates' Windows LNK Flaw Exploited As Zero-Day",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T19:16:00.178566+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T18:18:00+00:00",
        "description": "A severe spike in global DRAM prices has pushed Samsung Semiconductor to refuse a long-term RAM order from its own sibling, Samsung Electronics. The move is forcing the smartphone division into short, expensive renegotiations, which will likely mean higher costs for consumer devices. PCWorld reports: Samsung subsidiaries are, naturally, going to look to Samsung Semiconductor first when they need parts. Such was reportedly the case for Samsung Electronics, in search of memory supplies for its newest smartphones as the company ramps up production for 2026 flagship designs. But with so much RAM hardware going into new \"AI\" data centers -- and those companies willing to pay top dollar for their hardware -- memory manufacturers like Samsung, SK Hynix, and Micron are prioritizing data center suppliers to maximize profits.\n \nThe end result, according to a report from SE Daily spotted by SamMobile, is that Samsung Semiconductor rejected the original order for smartphone DRAM chips from Samsun",
        "id": 4239873,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/04/1739230/ram-is-so-expensive-samsung-wont-even-sell-it-to-samsung",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "RAM Is So Expensive, Samsung Won't Even Sell It To Samsung",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T18:14:33.055489+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T17:17:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: Almost three in 10 GPs in the UK are using AI tools such as ChatGPT in consultations with patients, even though it could lead to them making mistakes and being sued, a study reveals. The rapid adoption of AI to ease workloads is happening alongside a \"wild west\" lack of regulation of the technology, which is leaving GPs unaware which tools are safe to use. That is the conclusion of research by the Nuffield Trust thinktank, based on a survey of 2,108 family doctors by the Royal College of GPs about AI and on focus groups of GPs.\n \nMinisters hope that AI can help reduce the delays patients face in seeing a GP. The study found that more and more GPs were using AI to produce summaries of appointments with patients, assisting their diagnosis of the patient's condition and routine administrative tasks. In all, 598 (28%) of the 2,108 survey respondents said they were already using AI. More male (33%) than female (25%) GPs have used it an",
        "id": 4239378,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/04/0538249/30-of-doctors-in-uk-use-ai-tools-in-patient-consultations-study-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "30% of Doctors In UK Use AI Tools In Patient Consultations, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T17:13:38.510512+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T16:16:00+00:00",
        "description": "Subaru owners are reporting full-screen SiriusXM pop-up ads appearing on their infotainment systems while driving -- sometimes even overriding Apple CarPlay. Subaru says the ads appear only twice a year, but frustrated drivers argue the practice is distracting, unsafe, and a sign of an industry trend that's likely to get worse. The Drive reports: At least one 2024 Crosstrek owner reported that the pop-up took over their screen even though they were using Apple CarPlay. To force-close an application that's in use, solely for the sake of in-car advertising, is especially egregious. [The following Subaru owner complaints to the National Highway Traffic Safety Administration reiterate that point...]\n \nThe Drive reached out to Subaru for comment on the marketing tactics. A company spokesperson responded, \"We will discuss those messages in an upcoming meeting and will always consider customer feedback. This is the first we've heard of any issue. Those messages occur only twice a year, aroun",
        "id": 4238683,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/04/0534222/subaru-owners-are-ticked-about-in-car-pop-up-ads-for-siriusxm",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Subaru Owners Are Ticked About In-Car Pop-Up Ads For SiriusXM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T16:09:09.396757+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T15:15:00+00:00",
        "description": "Apple's longtime human-interface chief Alan Dye is leaving to lead a new creative studio at Meta's Reality Labs, where he'll shape AI-driven design for devices like smart glasses and VR headsets. Dye will be replaced by Steve Lemay, who has had \"a key role in the design of every major Apple interface since 1999,\" according to a statement Apple CEO Tim Cook gave Bloomberg's Mark Gurman. TechCrunch reports: Shortly after the news broke of Dye's departure, Zuckerberg announced a new creative studio within Reality Labs that would be led by Dye. There, he'll be joined by Billy Sorrentino, another former Apple designer who led interface design across Reality Labs; Joshua To, who led interface design across Reality Labs; Meta's industrial design team, led by Pete Bristol; and its metaverse design and art teams led by Jason Rubin.\n \nZuckerberg said the studio would \"bring together design, fashion, and technology to define the next generation of our products and experiences.\" \"Our idea is to t",
        "id": 4238031,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/04/057208/meta-poaches-apple-design-exec-alan-dye",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Poaches Apple Design Exec Alan Dye",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T15:07:08.764599+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T14:14:00+00:00",
        "description": "A London Assembly report warns that surging demand from \"energy-hungry\" data centers is straining the electricity grid and delaying new housing developments. With data-center electricity use expected to rise up to 600% by 2050, officials fear London's housing crisis could worsen without coordinated action. The BBC reports: According to the report (PDF) from the London Assembly Planning and Regeneration Committee, some new housing developments in west London were temporarily delayed after the electricity grid reached full capacity. The committee's chair James Small-Edwards said energy capacity had become a \"real constraint\" on housing and economic growth in the city.\n \nIn 2022, the General London Assembly (GLA) began to investigate delays to housing developments in the boroughs of Ealing, Hillingdon and Hounslow - after it received reports that completed projects were being told they would have to \"wait until 2037\" to get a connection to the electricity grid. There were fears the borou",
        "id": 4237434,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/04/0449221/new-homes-in-london-were-delayed-by-energy-hungry-data-centers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Homes In London Were Delayed By 'Energy-Hungry' Data Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T14:05:42.468551+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T13:13:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Earlier this year, home goods maker Kohler launched a smart camera called the Dekoda that attaches to your toilet bowl, takes pictures of it, and analyzes the images to advise you on your gut health. Anticipating privacy fears, Kohler said on its website that the Dekoda's sensors only see down into the toilet, and claimed that all data is secured with \"end-to-end encryption.\" The company's use of the expression \"end-to-end encryption\" is, however, wrong, as security researcher Simon Fondrie-Teitler pointed out in a blog post on Tuesday. By reading Kohler's privacy policy, it's clear that the company is referring to the type of encryption that secures data as it travels over the internet, known as TLS encryption -- the same that powers HTTPS websites. [...] The security researcher also pointed out that given Kohler can access customers' data on its servers, it's possible Kohler is using customers' bowl pictures to train AI. Citing an",
        "id": 4236800,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/04/0436234/end-to-end-encrypted-smart-toilet-camera-is-not-actually-end-to-end-encrypted",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'End-To-End Encrypted' Smart Toilet Camera Is Not Actually End-To-End Encrypted",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T11:02:31.819715+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T10:10:00+00:00",
        "description": "Nature has retracted a headline-grabbing climate-economics study after critics found flawed data that massively inflated its predicted global economic collapse. The New York Times reports: The decision came after a team of economists noticed problems with the data for one country, Uzbekistan, that significantly skewed the results. If Uzbekistan were excluded, they found, the damages would look similar to earlier research (PDF). Instead of a 62 percent decline in economic output by 2100 in a world where carbon emissions continue unabated, global output would be reduced by 23 percent.\n \nOf course, erasing more than 20 percent of the world's economic activity would still be a devastating blow to human welfare. The paper's detractors emphasize that climate change is a major threat, as recent meta analyses have found, and that more should be done to address it -- but, they say, unusual results should be treated skeptically. \"Most people for the last decade have thought that a 20 percent re",
        "id": 4235389,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/04/0430227/top-journal-retracts-study-predicting-catastrophic-climate-toll",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Top Journal Retracts Study Predicting Catastrophic Climate Toll",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T08:00:00.773620+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T07:07:00+00:00",
        "description": "Slashdot readers jmurtari and schwit1 shares news that a Russian astronaut slated for the next Dragon mission to the ISS has been removed after being caught photographing proprietary SpaceX hardware. UNITED24 reports: Russian cosmonaut Oleg Artemyev has been removed from the prime crew of SpaceX's Crew-12 mission to the International Space Station and replaced by fellow Roscosmos cosmonaut Andrey Fedyaev after sources alleged he photographed confidential SpaceX materials in California in violation of U.S. export control rules, according to The Insider on December 2. The outlet reported that Trishkin also said NASA did not want the controversy around Artemyev to become public, while Artemyev was removed from training at SpaceX's Hawthorne California, facility last week after allegedly photographing SpaceX engines and other internal materials on his phone and taking them off-site.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/ho",
        "id": 4234272,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/03/2348233/russian-astronaut-kicked-out-of-the-us-for-stealing-proprietary-spacex-designs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russian Astronaut Kicked Out of the US For Stealing Proprietary SpaceX Designs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T03:30:27.181674+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T03:03:00+00:00",
        "description": "An anonymous reader quotes a report from The Verge's Sean Hollister If you wrote off the Steam Frame as yet another VR headset few will want to wear, I guarantee you're not alone. But the Steam Frame isn't just a headset; it's a Trojan horse that contains the tech gamers need to play Steam games on the next Samsung Galaxy, the next Google Pixel, perhaps Arm gaming notebooks to come. I know, because I'm already using that tech on my Samsung Galaxy. There is no official Android version of Hollow Knight: Silksong, one of the best games of 2025, but that doesn't have to stop you anymore. Thanks to a stack of open-source technologies, including a compatibility layer called Proton and an emulator called Fex, games that were developed for x86-based Windows PCs can now run on Linux-based phones with the Arm processor architecture. With Proton, the Steam Deck could already do the Windows-to-Linux part; now, Fex is bridging x86 and Arm, too.\n \nThis stack is what powers the Steam Frame's own abi",
        "id": 4233306,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/03/2357235/valve-reveals-its-the-architect-behind-a-push-to-bring-windows-games-to-arm",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Valve Reveals Its the Architect Behind a Push To Bring Windows Games To Arm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T02:29:44.975577+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T02:02:00+00:00",
        "description": "AT&amp;T and Verizon are blocking T-Mobile's new \"Switching Made Easy\" tool that scans their customer accounts to recommend comparable plans. AT&amp;T is also suing, alleging T-Mobile used bots to scrape over 100 fields of sensitive customer data. From The Mobile Report: According to a lawsuit, which AT&amp;T has shared directly with us, T-Mobile updated the T-Life app's scraping abilities three separate times in an attempt to bypass AT&amp;T's detection. Essentially, T-Mobile and AT&amp;T have been in a game of cat and mouse. Not only that, but AT&amp;T alleges that T-Mobile is intentionally hiding the fact that it's their scraper accessing an account, and essentially pretends to be an end user while doing so. Apparently, T-Mobile's scraping bot tries its best to appear as a generic web browser.\n \nAT&amp;T sent T-Mobile a cease and desist letter on November 24th demanding T-Mobile stop the scraping process. T-Mobile responded two days later refusing, stating that the process was lega",
        "id": 4233094,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/12/04/006245/att-and-verizon-are-fighting-back-against-t-mobiles-easy-switch-tool",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AT&amp;T and Verizon Are Fighting Back Against T-Mobile's Easy Switch Tool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T01:26:50.334477+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T01:01:00+00:00",
        "description": "A federal judge has ordered OpenAI to hand over 20 million anonymized ChatGPT logs in its copyright battle with the New York Times and other outlets. Reuters reports: U.S. Magistrate Judge Ona Wang in a decision made public on Wednesday said that the 20 million logs were relevant to the outlets' claims and that handing them over would not risk violating users' privacy. The judge rejected OpenAI's privacy-related objections to an earlier order requiring the artificial intelligence startup to submit the records as evidence. \"There are multiple layers of protection in this case precisely because of the highly sensitive and private nature of much of the discovery,\" Wang said.\n \nAn OpenAI spokesperson on Wednesday cited an earlier blog post from the company's Chief Information Security Officer Dane Stuckey, which said the Times' demand for the chat logs \"disregards long-standing privacy protections\" and \"breaks with common-sense security practices.\" OpenAI has separately appealed Wang's or",
        "id": 4232821,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/04/0011222/openai-loses-fight-to-keep-chatgpt-logs-secret-in-copyright-case",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Loses Fight To Keep ChatGPT Logs Secret In Copyright Case",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-04T00:22:41.958148+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-04T00:00:00+00:00",
        "description": "Longtime Slashdot reader sinij shares a report from Car and Driver: [T]he Trump administration announced less stringent Corporate Average Fuel Economy (CAFE) standards in an effort to bring down the price of new vehicles. The administration says that rules put in place by the Biden administration broke the law by going beyond the requirements mandated by Congress when the CAFE program was started. The new regulations will require automakers to meet an average fuel-economy figure of 34.5 mpg across 2031-model-year vehicles, instead of the 50.4 mpg that would have been required under the previous regulations. sinij comments: \"This is a much-needed move as they also recently closed a number of loopholes, such as the assumed fuel-savings credit for engine start-stop technology, that made it more difficult to meet these goals. More so, a recent string of engine and transmission failures from multiple manufacturers shows that meeting fleet standards came at a very significant cost of reduce",
        "id": 4232483,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/03/2341243/white-house-rolls-back-fuel-economy-standards",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "White House Rolls Back Fuel Economy Standards",
        "vote": 0
    }
]