[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-10T15:30:03+00:00",
        "description": "It's incredible to think back on how influential Falcom's action RPGs have been. The genre, as we know it, wouldn't exist without Dragon Slayer, and while numerous other titles hog the spotlight, the development team continues to pump out titles in its acclaimed Ys series.\n\nWhile its latest effort, Ys 10: Nordics, didn't quite vibe with me, Ys Memoire is a different story. Though it features new illustrations, the option to select different iterations of the soundtrack, Turbo Mode, and new voice acting, this is essentially a port of the 2005 remake of Ys 3: Wanderers from Ys. The good news is that it still holds up after all this time.\n\nIt may feel streamlined or even simplistic, but Ys Memoire: The Oath in Felghana is a testament to how excellent the action can feel even after all these years. The visuals, though charming, may not appeal to everyone, but the music is simply fantastic, and the plot is compelling enough to dive into.",
        "id": 1876604,
        "language": null,
        "link": "https://www.youtube.com/watch?v=6P4m9XdDaiI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6P4m9XdDaiI/hqdefault.jpg",
        "title": "Ys Memoire: The Oath in Felghana Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-10T13:30:41+00:00",
        "description": "Remember Overwatch? It's a rhetorical question, especially since most fervent fans couldn't stop talking about it after it launched in 2016. Several years and a \"sequel\" later, the hero shooter isn't exactly the most talked-about despite ruling the genre for so long. Instead, the attention is on NetEase's Marvel Rivals.\n\nDismissing any other pretender to the throne - Battleborn, LawBreakers, and even Concord - has been easy enough. However, Rivals has far surpassed them in player count, accumulating over 10 million in less than a week and 20 million in its first month. Whether it's the player counts or viewership, Overwatch 2 is seemingly left behind.\n\nHow did this happen? Much of it has to do with the kind of experience that Marvel Rivals has to offer, both on its own merits and in comparison, to Blizzard's efforts. With Season 1: Eternal Night Falls and the Fantastic Four around the corner, the former is only growing more popular.",
        "id": 1875947,
        "language": null,
        "link": "https://www.youtube.com/watch?v=y5u2hAUD1D4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/y5u2hAUD1D4/hqdefault.jpg",
        "title": "Marvel Rivals Is DESTROYING Overwatch 2...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-10T09:30:05+00:00",
        "description": "Cinematography in games has been steadily improving for decades, with cutting-edge graphics, direction, performance, and motion capture underpinning the most cinematic games released to date. \n\nThere’s an argument that for a game to be cinematic you must feel as though you’ve performed a starring role in a movie once you’ve reached the game’s climax, and whilst we’re certain this brief definition is serviceable this feature also considers how a game’s storytelling, visuals, acting, gameplay, and world design can foster a movie-like quality. \n\nFurthermore, we’ve focused solely on games that are beatable in an average of ten hours or less as shorter games tend to demonstrate an aptitude for eliciting emotion more effectively than a game taking ten hours plus to complete.",
        "id": 1874148,
        "language": null,
        "link": "https://www.youtube.com/watch?v=InWQqB_oWrw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/InWQqB_oWrw/hqdefault.jpg",
        "title": "15 Excellent Cinematic Single Player Games You Can Finish In Under 10 Hours",
        "vote": 0
    }
]