[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T16:09:30.106943+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T15:30:06+00:00",
        "description": "NBA 2K26 signals a significant leap forward for the basketball simulation series, with Visual Concept layering numerous gameplay changes on top of last year’s foundation. \n\nThis video outlines 15 big differences present in this year’s iteration when compared to 2K25, including an upgraded ProPLAY Motion Engine which provides smoother dribbling and more dynamic plays, while new skill-based features like Quick Protect and custom layups put greater creativity in players’ hands.\n\nDefense has been overhauled with smarter AI, while more physical contests emerge across the entire court. Offensive AI now replicates real-world strategy via expanded playbooks and attacking intelligence. In-game presentation receives an upgrade too, with enhanced player fidelity and crowd atmosphere capturing the energy of a real NBA game. Finally, the monumental NBA-WNBA crossover stakes a claim for 2K26 being a franchise reset.",
        "id": 3450047,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=82WDyouYxOM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/82WDyouYxOM/hqdefault.jpg",
        "title": "NBA 2K26 vs NBA 2K25  - 15 BIGGEST DIFFERENCES You Need To Know",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T15:04:26.160443+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T13:30:33+00:00",
        "description": "The much-anticipated remake of Naked Snake's debut adventure is finally out and in its players’ hands. Konami's decision to bring back Metal Gear Solid 3 in a brand new avatar has largely paid off, with the remake gaining a lot of traction since its release.\n\nIf you're new to the franchise, or just didn't get a chance to experience the original title back in the day, Metal Gear Solid Delta is a great way to enjoy the experience with a healthy dose of current-gen goodness thrown in. While you may already be discovering very inventive ways to achieve your goals as  Snake, this is a title that has a lot of hidden tricks that even the most diligent among you might miss the first time around.\n\nTo that end, here are a few things you might not know are possible in the game. Use them wisely!",
        "id": 3448885,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=S9XweLnFyOg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/S9XweLnFyOg/hqdefault.jpg",
        "title": "Metal Gear Solid Delta: Snake Eater - 15 SECRET Mechanics You Never Knew",
        "vote": 0
    }
]