[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T23:21:02.532590+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T22:40:00+00:00",
        "description": "Reuters has found that Meta appropriated the names and likenesses of celebrities to create dozens of flirty social-media chatbots without their permission. \"While many were created by users with a Meta tool for building chatbots, Reuters discovered that a Meta employee had produced at least three, including two Taylor Swift 'parody' bots.\" From the report: Reuters also found that Meta had allowed users to create publicly available chatbots of child celebrities, including Walker Scobell, a 16-year-old film star. Asked for a picture of the teen actor at the beach, the bot produced a lifelike shirtless image.\n\"Pretty cute, huh?\" the avatar wrote beneath the picture. All of the virtual celebrities have been shared on Meta's Facebook, Instagram and WhatsApp platforms. In several weeks of Reuters testing to observe the bots' behavior, the avatars often insisted they were the real actors and artists. The bots routinely made sexual advances, often inviting a test user for meet-ups. Some of th",
        "id": 3453235,
        "language": "en-us",
        "link": "https://meta.slashdot.org/story/25/08/29/2049213/meta-created-flirty-chatbots-of-celebrities-without-permission?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Created Flirty Chatbots of Celebrities Without Permission",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T22:14:07.018754+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T22:00:00+00:00",
        "description": "Linus Torvalds updated the kernel's MAINTAINERS file to mark Bcachefs as \"externally maintained,\" signaling he won't accept new Bcachefs pull requests for now. \"MAINTAINERS: mark bcachefs externally maintained,\" wrote Torvalds with the patch. \"As per many long discussion threads, public and private.\"\n \n\"The Bcachefs code is still present in the mainline Linux kernel likely to prevent users from having any immediate fall-out in Bcachefs file-systems they may already be using, but it doesn't look like Linus Torvalds will be honoring any new Bcachefs pull requests in the near future,\" adds Phoronix's Michael Larabel.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Linus+Torvalds+Marks+Bcachefs+as+Now+'Externally+Maintained'%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F08%2F29%2F2033242%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\"",
        "id": 3452894,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/08/29/2033242/linus-torvalds-marks-bcachefs-as-now-externally-maintained?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linus Torvalds Marks Bcachefs as Now 'Externally Maintained'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T22:14:07.164053+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T21:21:00+00:00",
        "description": "The Federal Communications Commission has rejected a call from the National Association of Broadcasters and some industry trade groups that would have imposed cable-style regulatory fees on streaming services, tech companies and pure broadband providers. From a report: In a Report and Order issued on Friday, the FCC reaffirmed that regulatory fees are calculated based on the number of full-time equivalent employees assigned to specific industries under the agency's jurisdiction. Broadcasters, satellite operators and other licensees are already assessed annual payments, which help fund the FCC's operational costs. \n\nThe NAB, in concert with other groups like Telesat, Iridium and the State Broadcasters Associations, pressed the FCC to expand the list of fee payers to include broadband providers and large technology firms. They argued that companies operating online platforms and broadband services rely on FCC resources and should contribute to the costs of regulation. \"Big Tech should n",
        "id": 3452895,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/29/2027234/fcc-rejects-calls-for-cable-like-fees-on-broadband-providers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FCC Rejects Calls For Cable-like Fees on Broadband Providers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T21:09:00.417803+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T20:40:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: WhatsApp said on Friday that it fixed a security bug in its iOS and Mac apps that was being used to stealthily hack into the Apple devices of \"specific targeted users.\" The Meta-owned messaging app giant said in its security advisory that it fixed the vulnerability, known officially as CVE-2025-55177, which was used alongside a separate flaw found in iOS and Macs, which Apple fixed last week and tracks as CVE-2025-43300.\n \nApple said at the time that the flaw was used in an \"extremely sophisticated attack against specific targeted individuals.\" Now we know that dozens of WhatsApp users were targeted with this pair of flaws. Donncha O Cearbhaill, who heads Amnesty International's Security Lab, described the attack in a post on X as an \"advanced spyware campaign\" that targeted users over the past 90 days, or since the end of May. O Cearbhaill described the pair of bugs as a \"zero-click\" attack, meaning it does not require any interact",
        "id": 3452502,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/29/2020202/whatsapp-fixes-zero-click-bug-used-to-hack-apple-users-with-spyware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "WhatsApp Fixes 'Zero-Click' Bug Used To Hack Apple Users With Spyware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T21:09:00.633868+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T20:01:00+00:00",
        "description": "DOD: Defense Secretary Pete Hegseth said the Pentagon has halted a decade-old Microsoft program that has allowed Chinese coders, remotely supervised by U.S. contractors, to work on sensitive DOD cloud systems. In a digital video address to the public posted yesterday, the secretary said DOD was made aware of the \"digital escorts\" program last month and that the program has exposed the Defense Department to unacceptable risk -- despite being designed to comply with government contracting rules. \n\n\"If you're thinking 'America first,' and common sense, this doesn't pass either of those tests,\" Hegseth said, adding that he initiated an immediate review of the program upon learning of it. \"I want to report our initial findings. ... The use of Chinese nationals to service Department of Defense cloud environments? It's over,\" he said. Additionally, Hegseth said DOD has issued a formal letter of concern to Microsoft, documenting a breach of trust, and that DOD is requiring a third-party audit",
        "id": 3452503,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/29/1928258/pentagon-halts-chinese-coders-affecting-dod-cloud-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pentagon Halts Chinese Coders Affecting DOD Cloud Systems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T20:00:00.036243+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T19:25:00+00:00",
        "description": "Federal Trade Commission Chairman Andrew Ferguson accused Google of using \"partisan\" spam filtering in Gmail that sends Republican fundraising emails to the spam folder while delivering Democratic emails to inboxes. From a report: Ferguson sent a letter yesterday to Alphabet CEO Sundar Pichai, accusing the company of \"potential FTC Act violations related to partisan administration of Gmail.\" Ferguson's letter revives longstanding Republican complaints that were previously rejected by a federal judge and the Federal Election Commission. \n\n\"My understanding from recent reporting is that Gmail's spam filters routinely block messages from reaching consumers when those messages come from Republican senders but fail to block similar messages sent by Democrats,\" Ferguson wrote. The FTC chair cited a recent New York Post report on the alleged practice. \n\nThe letter told Pichai that if \"Gmail's filters keep Americans from receiving speech they expect, or donating as they see fit, the filters m",
        "id": 3452095,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/29/1829229/ftc-claims-gmail-filtering-republican-emails-threatens-american-freedoms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FTC Claims Gmail Filtering Republican Emails Threatens 'American Freedoms'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T18:55:09.750217+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T18:41:00+00:00",
        "description": "Microsoft has found no link between the August 2025 KB5063878 security update and customer reports of failure and data corruption issues affecting solid-state drives (SSDs) and hard disk drives (HDDs). From a report: Redmond first told BleepingComputer last week that it is aware of users reporting SSD failures after installing this month's Windows 11 24H2 security update. In a subsequent service alert seen by BleepingComputer, Redmond said that it was unable to reproduce the issue on up-to-date systems and began collecting user reports with additional details from those affected. \n\n\"After thorough investigation, Microsoft has found no connection between the August 2025 Windows security update and the types of hard drive failures reported on social media,\" Microsoft said in an update to the service alert this week. \"As always, we continue to monitor feedback after the release of every Windows update, and will investigate any future reports.\"<p><div class=\"share_submission\" style=\"posit",
        "id": 3451674,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/29/1824219/microsoft-says-recent-windows-update-didnt-kill-your-ssd?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Says Recent Windows Update Didn't Kill Your SSD",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T18:55:09.866073+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T18:01:00+00:00",
        "description": "ArsTechnica: Today's video game consoles are hundreds of dollars more expensive than you'd expect based on historic pricing trends. That's according to an Ars Technica analysis of decades of pricing data and price-cut timing across dozens of major US console releases. \n\nThe overall direction of this trend has been apparent to industry watchers for a while now. Nintendo, Sony, and Microsoft have failed to cut their console prices in recent years and have instead been increasing the nominal MSRP for many current consoles in the past six months. \n\nBut when you crunch the numbers, it's pretty incredible just how much today's console prices defy historic expectations, even when you account for higher-than-normal inflation in recent years. If today's consoles were seeing anything like what used to be standard price cuts over time, we could be paying around $200 today for pricey systems like the Switch OLED, PS5 Digital Edition, and Xbox Series S.<p><div class=\"share_submission\" style=\"posit",
        "id": 3451675,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/29/1729201/todays-game-consoles-are-historically-overpriced?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Today's Game Consoles Are Historically Overpriced",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T17:50:10.668809+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T17:22:00+00:00",
        "description": "French President Emmanuel Macron vowed a strong response [non-paywalled source] if any country takes measures that undermine Europe's digital sovereignty. From a report: Earlier this week, US President Donald Trump threatened to impose fresh tariffs and export restrictions on countries that have digital services taxes or regulations that harm American tech companies. France was among the first nations to implement a digital services tax. \n\n\"We will not let anyone else decide for us on this matter,\" he told reporters in Toulon, France, on Friday. \"We cannot allow our digital sector or the regulations we have chosen for ourselves, which are a necessity, to be threatened today.\" Trump has long railed against EU tech and antitrust regulation over US tech giants including Alphabet's Google and Apple.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Macron+Vows+Retaliation+If+Europe's+Digital+Sovereignty+Attacked%3A+https%3",
        "id": 3451118,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/29/175257/macron-vows-retaliation-if-europes-digital-sovereignty-attacked?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Macron Vows Retaliation If Europe's Digital Sovereignty Attacked",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T17:50:10.785069+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T16:44:00+00:00",
        "description": "One of Australia's largest banks has apologized to staff who found out they had been fired through an automated email asking them to hand back their laptops. From a report: ANZ's retail banking executive Bruce Rush said it was \"not our intention to share such sensitive news with you in this way\" as the firm cuts jobs in its retail banking business. The bank said the emails were sent to some staff ahead of schedule in error. It said it has since stopped sending the emails and that staff have been spoken to personally. \n\nThe Financial Sector Union said the email caused \"panic and distress\" and was a result of the company forcing through a \"chaotic pace of change.\" The union's president Wendy Streets said it had not been consulted on the changes the bank was making, adding that \"ANZ must do better.\" \"Speed and cost-cutting cannot come at the expense of dignity and respect for workers,\" Ms Streets said, describing the \"botched\" episode as \"disgusting.\" Mr Rush wrote in an email to staff: ",
        "id": 3451119,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/29/1644219/bank-apologizes-for-firing-staff-with-accidental-email?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bank Apologizes For Firing Staff With Accidental Email",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T16:40:25.460052+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T16:01:00+00:00",
        "description": "A newly published Investigatory Powers Tribunal filing indicates the UK government's Technical Capability Notice to Apple went beyond the company's Advanced Data Protection encryption to include standard iCloud services used by millions [non-paywalled source]. The document states the UK Home Office order \"is not limited to\" ADP data and applies \"globally in respect of the relevant data categories of all iCloud users.\" \n\nThe filing emerged days after Trump administration officials claimed the UK had agreed to drop efforts targeting American citizens' data. Apple launched its legal challenge in March after receiving the TCN, which the company cannot discuss publicly under the Investigatory Powers Act. The tribunal scheduled a hearing for early next year. Apple withdrew ADP from UK customers in February.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK+Sought+Broad+Access+To+Apple+Customers'+Data%2C+Court+Filing+Sugge",
        "id": 3450514,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/29/1554214/uk-sought-broad-access-to-apple-customers-data-court-filing-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Sought Broad Access To Apple Customers' Data, Court Filing Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T15:34:56.460372+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T15:21:00+00:00",
        "description": "Universities facing federal research budget cuts are increasingly turning to corporate partnerships for funding as Georgia Tech secures $70 million from industry this fiscal year -- 28% more than last year and representing 15% of campus research funding versus the 6% national average. The Atlanta school's corporate engagement office has fielded multiple weekly calls from other institutions seeking guidance after securing deals including Hyundai's $55 million stadium naming rights agreement alongside undisclosed research investments in electric vehicle and hydrogen fuel technologies. \n\nThe arrangements come with restrictions: nondisclosure agreements limit publication options for graduate students, and companies typically avoid funding basic research without immediate commercial applications. Federal grants still constitute over half of university research spending nationally, supporting early-stage discovery work that laid groundwork for current quantum computing developments.<p><div ",
        "id": 3449921,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/29/1519214/georgia-tech-is-teaching-other-universities-a-fundraising-lesson?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Georgia Tech Is Teaching Other Universities a Fundraising Lesson",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T15:34:56.576370+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T14:41:00+00:00",
        "description": "An anonymous reader shares a report: Valve has started to comply with the UK's Online Safety Act, by rolling out a requirement for all Brits to verify their age with a credit card to access \"mature content\" pages and games on Steam. UK users won't even be able to access the community hubs of mature content games unless a valid credit card is stored on a Steam account. \n\nWhile platforms like Reddit, Bluesky, and Discord have opted for age verification checks using selfies, Valve is restricting its age checks to just credit cards, according to a support article. \"Among all age assurance mechanisms reviewed by Valve, this process preserves the maximum degree of user privacy,\" says Valve. \"Having the credit card stored as a payment method acts as an additional deterrent against circumventing age verification by sharing a single Steam user account among multiple persons.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=St",
        "id": 3449922,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/29/1441223/steam-users-in-the-uk-will-need-a-credit-card-to-access-mature-content-games?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Steam Users in the UK Will Need a Credit Card To Access 'Mature Content' Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T15:34:56.690893+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T14:00:00+00:00",
        "description": "A 56-year-old tech industry veteran killed his mother and himself in Old Greenwich, Connecticut on August 5 after months of interactions with ChatGPT that encouraged his paranoid delusions. \n\nGreenwich police discovered Stein-Erik Soelberg and his 83-year-old mother Suzanne Eberson Adams dead in their home. Videos posted by Soelberg documented conversations where ChatGPT repeatedly assured him he was sane while validating his beliefs about surveillance campaigns and poisoning attempts by his mother. \n\nThe chatbot told him a Chinese food receipt contained demonic symbols and that his mother's anger over a disconnected printer indicated she was \"protecting a surveillance asset.\" OpenAI has contacted Greenwich police and announced plans for updates to help keep users experiencing mental distress grounded in reality.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Troubled+Man%2C+His+Chatbot+and+a+Murder-Suicide+in+Old",
        "id": 3449923,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/29/1116218/a-troubled-man-his-chatbot-and-a-murder-suicide-in-old-greenwich?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Troubled Man, His Chatbot and a Murder-Suicide in Old Greenwich",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T13:16:54.869618+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Phys.org: In a first-of-its-kind experiment, engineers at the University of Pennsylvania brought quantum networking out of the lab and onto commercial fiber-optic cables using the same Internet Protocol (IP) that powers today's web. Reported in Science, the work shows that fragile quantum signals can run on the same infrastructure that carries everyday online traffic. The team tested their approach on Verizon's campus fiber-optic network. The Penn team's tiny \"Q-chip\" coordinates quantum and classical data and, crucially, speaks the same language as the modern web. That approach could pave the way for a future \"quantum internet,\" which scientists believe may one day be as transformative as the dawn of the online era.\n \nQuantum signals rely on pairs of \"entangled\" particles, so closely linked that changing one instantly affects the other. Harnessing that property could allow quantum computers to link up and pool their processing power, enabling ",
        "id": 3448798,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/29/0043214/engineers-send-quantum-signals-with-standard-internet-protocol?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Engineers Send Quantum Signals With Standard Internet Protocol",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T11:03:33.770311+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T10:00:00+00:00",
        "description": "Taco Bell's rollout of AI-powered drive-thru assistants has run into problems, with glitches and trolls gaming the system by making absurd orders like thousands of water cups. It's so bad that the company is reconsidering where and how to deploy the tech, admitting it may not work well in \"super busy\" restaurants. \"We're learning a lot, I'm going to be honest with you,\" Dane Mathews, Taco Bell's chief digital and technology officer, told the WSJ. \"I think like everybody, sometimes it lets me down, but sometimes it really surprises me.\" The Verge reports: Since announcing plans to put AI in the drive-thru last year, Taco Bell has deployed the tech in over 500 locations across the US, according to the WSJ. Other fast-food chains are experimenting with AI, too, including McDonald's, Wendy's, and White Castle. Mathews tells the outlet that while the company still plans on pushing ahead with AI voice technology and evaluating the data, he's discovered that using AI exclusively in certain s",
        "id": 3447803,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/29/0037244/taco-bells-ai-drive-thru-plan-gets-caught-up-on-trolls-and-glitches?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Taco Bell's AI Drive-Thru Plan Gets Caught Up On Trolls and Glitches",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T07:42:56.935454+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T07:00:00+00:00",
        "description": "Longtime Slashdot reader cristiroma shares a report from New Atlas: Wouldn't it be great if the plants in your home could do more than just sit there looking pretty? Researchers at South China Agricultural University in the city of Guangzhou have found a way to upgrade them into soft glowing night lights in a range of hues, with the use of nanoparticles. The team developed a light-emitting phosphor compound that enabled succulents with fleshy leaves to charge in sunlight or indoor LED light in just a couple of minutes, and then emit a soft uniform glow that lasts up to two hours. The afterglow phosphor compound -- which is similar to those found in glow-in-the-dark toys -- is inexpensive, biocompatible, and negates the need for more complex methods of infusing bioluminescence in plants, like genetic modification. It simply gets injected into the leaves.\n \n[...] Beyond modifying a commercial compound for this project, the team also had to figure out the right size for the phosphor part",
        "id": 3446688,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/29/0030247/nanoparticles-turn-houseplants-into-night-lights?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nanoparticles Turn Houseplants Into Night Lights",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T04:27:51.710426+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from CBS News: They look, move and even smell like the kind of furry Everglades marsh rabbit a Burmese python would love to eat. But these bunnies are robots meant to lure the giant invasive snakes out of their hiding spots. It's the latest effort by the South Florida Water Management District to eliminate as many pythons as possible from the Everglades, where they are decimating native species with their voracious appetites. In Everglades National Park, officials say the snakes have eliminated 95% of small mammals as well as thousands of birds. \"Removing them is fairly simple. It's detection. We're having a really hard time finding them,\" said Mike Kirkland, lead invasive animal biologist for the water district. \"They're so well camouflaged in the field.\"\n \nThe water district and University of Florida researchers deployed 120 robot rabbits this summer as an experiment. Previously, there was an effort to use live rabbits as snake lures but that beca",
        "id": 3445944,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/28/217230/florida-deploys-robot-rabbits-to-control-invasive-burmese-python-population?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Florida Deploys Robot Rabbits To Control Invasive Burmese Python Population",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T02:16:52.605436+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T02:02:00+00:00",
        "description": "Amtrak's new 160 mph tilting Acela trains have debuted on the Northeast Corridor, offering smoother rides, upgraded interiors, faster Wi-Fi, and 27% more seating capacity. However, \"they don't complete the journey any faster than the old trains,\" reports The Independent. From the report: Acela runs from Washington, DC's Union Station to Boston via Philadelphia, New York Penn Station, New Haven, and Providence. It's a total distance of 457 miles, with the fastest next-gen Acela journey being six hours and 43 minutes, five minutes slower than the quickest end-to-end time offered by the old Acela trains, introduced in 2000. However, this may be because, as is common practice with new trains the world over, Amtrak is scheduling longer dwell times at stations so staff and passengers can adjust to them. The next-gen sets have a top service speed that's 10mph faster -- though this can only be achieved on certain sections of the mostly 110mph route -- and an enhanced \"anticipative\" tilting sy",
        "id": 3445442,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/28/2128257/amtraks-new-160mph-acela-trains-take-just-as-long-as-the-old-ones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amtrak's New 160mph Acela Trains Take Just As Long As the Old Ones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T02:16:52.725986+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T01:25:00+00:00",
        "description": "Today, Microsoft unveiled two in-house AI models: MAI-Voice-1, a high-speed speech-generation system now live in Copilot, and MAI-1-Preview, its first end-to-end foundation model trained on 15,000 H100 GPUs. Neowin reports: MAI-Voice-1 is a speech generation model and is already available in Copilot Daily and Podcasts. To preview the full capabilities of this voice model, Microsoft has created a new Copilot Labs experience that anyone can try today. With the Copilot Audio Expressions experience, users can just paste text content and select the voice, style, and mode to generate high-fidelity, expressive audio. They can also download the generated audio if required. Microsoft also highlighted that this MAI-Voice-1 model is very fast and efficient. In fact, it can generate a full minute of audio in under a second on a single GPU.\n \nSecond, Microsoft has begun public testing of MAI-1-preview on LMArena, a popular platform for community model evaluation. This represents MAI's first founda",
        "id": 3445443,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/28/2058255/microsoft-reveals-two-in-house-ai-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Reveals Two In-House AI Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T01:12:48.383045+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T00:45:00+00:00",
        "description": "Microsoft is testing new Xbox Game Pass features with Insiders, letting Core and Standard subscribers stream cloud-enabled titles they own or access via subscription across more devices, including supported TVs and browsers. These tiers will also gain access to select PC game versions for the first time. From a Xbox blog post: We're always exploring more ways to make your Xbox experience centered around you -- your content, benefits, and playstyle. That's why we're making it easier to enjoy the games you love, wherever you are, and on any device. Starting today, Xbox Insiders are invited to try out new updates in Xbox Game Pass that make it easier to stream and play across more devices.\n \nXbox Insiders subscribed to Xbox Game Pass Core or Standard now have even more freedom to play wherever they are with Xbox Cloud Gaming (Beta). As part of this Insider experience, Xbox Game Pass Core and Standard subscribers will be able to stream cloud playable games included with their subscription",
        "id": 3445216,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/28/1827215/microsoft-expands-xbox-cloud-gaming-to-cheaper-game-pass-tiers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Expands Xbox Cloud Gaming to Cheaper Game Pass Tiers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-29T00:05:59.233803+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-29T00:02:00+00:00",
        "description": "Stellantis has put its fully developed Level 3 driver-assistance system on hold due to high costs, technical hurdles, and weak consumer demand. Reuters reports: As recently as February, Stellantis said its in-house system, which is part of the AutoDrive program, was ready for deployment and a key pillar of its strategy. The company said the system, which enables drivers to have their hands off the wheel and eyes off the road under certain conditions, would allow them to temporarily watch movies, catch up on emails, or read books. That Level 3 software was never launched, the company confirmed to Reuters. But it stopped short of saying that the program was canceled.\n \n\"What was unveiled in February 2025 was L3 technology for which there is currently limited market demand, so this has not been launched, but the technology is available and ready to be deployed,\" a Stellantis spokesperson said. The three sources, however, said that the program was put on ice and is not expected to be depl",
        "id": 3444917,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/28/2052249/stellantis-shelves-level-3-driver-assistance-program?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Stellantis Shelves Level 3 Driver-Assistance Program",
        "vote": 0
    }
]