[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T16:42:30.925441+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T16:01:31+00:00",
        "description": "Where Winds Meet features a combat system that has us itching to try it out the more we see of it. From a set of weapon types that are quite distinct from one another to well-tuned animations, mechanics, and moves, this could be a combat system that catapults to the top of modern gaming's greatest ones. \n\nBut what makes it click as well as it does? The answers are here for you to discover while we wait for one of the year's biggest RPGs, and what's shaping up to be quite an ambitious effort from Everstone Studios and NetEase. The role of a wandering swordsman has never looked this enticing, and is sure to bring a lot of memorable moments to the journey of a lifetime.\n\nSome footage here was used from Gematsu. Those were officially released footage.",
        "id": 4001660,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=op3DKZzfpSc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/op3DKZzfpSc/hqdefault.jpg",
        "title": "Where Winds Meet’s Combat Will Make You OBSESSED IN MINUTES",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T14:36:17.082288+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T13:30:51+00:00",
        "description": "When you think of The Legend of Zelda, several things come to mind. The textbook example of the hero's call to adventure. The contrast between light and darkness. The consequences of unchecked power and how it ultimately crumbles before courage. All this and more unfolds over the course of several dungeons, puzzles and legendary items, culminating in a fight with the Big Bad (or whoever is jobbing for Ganondorf this week).\n\nWhen you hear the name Hyrule Warriors, however, only one thing comes to mind: Smashing enemies until they're dead and then continuing because that KO counter isn't going to fill itself. You'd think both these formulas go together like Gorons and the cold, but there's always been some appeal to laying waste to monstrous hordes with the over-the-top flashy abilities. Such is the case with Hyrule Warriors: Age of Imprisonment, which launches on November 6th for Nintendo Switch 2.",
        "id": 4000405,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=ksKcokrObsU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ksKcokrObsU/hqdefault.jpg",
        "title": "Hyrule Warriors: Age of Imprisonment - 15 Things You NEED TO KNOW Before You Purchase",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T10:27:02.669860+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T09:30:36+00:00",
        "description": "The timeliness of Syberia's narrative and characterisation shines through. Despite some misgivings about certain changes, the overall presentation is a nice bump over the original. \n\nYet it feels like the truest experience remains with the original, as unwieldy and archaic as it can be in places. Take Syberia Remastered as an introduction to the series' world, if not a reminder about everything that makes it compelling, and then revisit the classic.",
        "id": 3998485,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=oVuDKoNCfF4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oVuDKoNCfF4/hqdefault.jpg",
        "title": "Syberia Remastered Review - The Final Verdict",
        "vote": 0
    }
]