[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T23:35:17.123006+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T23:25:00+00:00",
        "description": "Japan's new competition rules are forcing Apple to open the iPhone to third-party app stores, and iOS 26.2 will quietly flip that switch ahead of the December deadline. MacRumors reports: According to a post shared on X by @Tzzlala, iPhones running the beta in Japan are able to install alternative app stores like AltStore PAL and Epic Games, and download apps from them, though Fortnite in-app purchases are currently region-blocked by Epic. [...] The guidelines are set to come into effect by December 18, 2025, while Apple is expected to release iOS 26.2 in December, sometime between December 9 and December 16. Epic Games has already announced plans to bring Fortnite and its game store platform to iOS in Japan by late 2025.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iOS+26.2+to+Allow+Third-Party+App+Stores+in+Japan+Ahead+of+Regulatory+Deadline%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F06%2F2250226%2F%3Futm",
        "id": 4005150,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/06/2250226/ios-262-to-allow-third-party-app-stores-in-japan-ahead-of-regulatory-deadline",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "iOS 26.2 to Allow Third-Party App Stores in Japan Ahead of Regulatory Deadline",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T23:35:17.308653+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T22:45:00+00:00",
        "description": "An anonymous reader quotes a report from TorrentFreak: In a submission for the 2026 National Trade Estimate Report (PDF), Cloudflare warns the U.S. government that site blocking efforts cause widespread disruption to legitimate services. The complaint points to Italy's automated Piracy Shield system, which reportedly blocked \"tens of thousands\" of legitimate sites. Meanwhile, overbroad IP address blocks in Spain and new automated blocking proposals in France are serious concerns that harm U.S. business interests, Cloudflare reports. [...]\n \nCloudflare urges the USTR to take these concerns into account for its upcoming National Trade Estimate Report. Ideally, it wants these trade barriers to be dismantled. These calls run counter to requests from rightsholders, who urge the USTR to ensure that more foreign countries implement blocking measures. With potential site-blocking legislation being considered in U.S. Congress, that may impact local lobbying efforts as well. If and how the USTR",
        "id": 4005151,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/06/2244238/cloudflare-tells-us-govt-that-foreign-site-blocking-efforts-are-digital-trade-barriers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cloudflare Tells US Govt That Foreign Site Blocking Efforts Are Digital Trade Barriers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T22:34:07.268299+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T21:30:00+00:00",
        "description": "An anonymous reader shares a report: Amazon just introduced an AI tool that will automatically translate books into other languages. The appropriately-named Kindle Translate is being advertised as a resource for authors that self publish on the platform. \n\nThe company says the tool can translate entire books between English and Spanish and German to English. Amazon promises that more languages are coming down the pike. It's available right now in a beta form to select authors enrolled in the Kindle Direct Publishing platform. There's a broader rollout planned for a later date.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+is+Testing+an+AI+Tool+That+Automatically+Translates+Books+Into+Other+Languages%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F06%2F1931204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://",
        "id": 4004727,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/06/1931204/amazon-is-testing-an-ai-tool-that-automatically-translates-books-into-other-languages",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon is Testing an AI Tool That Automatically Translates Books Into Other Languages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T21:29:09.446334+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T20:51:00+00:00",
        "description": "An anonymous reader shares a report: On Wednesday, Reuters reported that Google is planning to build a large AI data center on Christmas Island, a 52-square-mile Australian territory in the Indian Ocean, following a cloud computing deal with Australia's military. The previously undisclosed project will reportedly position advanced AI infrastructure a mere 220 miles south of Indonesia at a location military strategists consider critical for monitoring Chinese naval activity. \n\nAside from its strategic military position, the island is famous for its massive annual crab migration, where over 100 million of red crabs make their way across the island to spawn in the ocean. That's notable because the tech giant has applied for environmental approvals to build a subsea cable connecting the 135-square-kilometer island to Darwin, where US Marines are stationed for six months each year. \n\n[...] Christmas Island's annual crab migration is a natural phenomenon that Sir David Attenborough reported",
        "id": 4004218,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/06/1924248/google-plans-secret-ai-military-outpost-on-tiny-island-overrun-by-crabs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Plans Secret AI Military Outpost on Tiny Island Overrun By Crabs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T20:28:45.255900+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T20:11:00+00:00",
        "description": "The FBI has subpoenaed popular Canadian domain registrar Tucows, demanding information about the owner of archive[dot]today, a popular archiving site used to bypass paywalls and avoid sending traffic to original publishers. The subpoena states it relates to a federal criminal investigation but provides no details about the alleged crime. \n\nArchive.today posted the document on X the same day. The site, also known as archive.is and archive.ph, started in the early 2010s and rose to prominence during GamerGate when users took snapshots of articles to avoid sending traffic to websites. It now has hundreds of millions of saved pages. The FBI requested the customer name, address, billing information, telephone connection records, payment methods, internet connectivity session times, and device identifiers. \n\nVery little is known about who operates the site. A 2013 analysis by Gyrovague suggested it is \"a one-person labor of love, operated by a Russian of considerable talent and access to Eu",
        "id": 4003798,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/06/1920210/fbi-subpoenas-registrar-for-details-on-anonymous-archiving-site-owner",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FBI Subpoenas Registrar for Details on Anonymous Archiving Site Owner",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T20:28:45.522362+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T19:30:00+00:00",
        "description": "Venture capitalist David Sacks, who is serving as President Donald Trump's AI and crypto czar, said Thursday that there will be \"no federal bailout for AI.\" From a report: \"The U.S. has at least 5 major frontier model companies. If one fails, others will take its place,\" Sacks wrote in a post on X. Sacks' comments came after OpenAI CFO Sarah Friar said Wednesday that the startup wants to establish an ecosystem of private equity, banks and a federal \"backstop\" or \"guarantee\" that could help the company finance its infrastructure investments. \n\nShe softened her stance later in a LinkedIn post and said OpenAI is not seeking a government backstop for its infrastructure commitments. She said her use of the word \"backstop\" clouded her point. [...] Sacks said the Trump administration does want to make permitting and power generation easier, and that the goal is to facilitate rapid infrastructure buildouts without raising residential electricity rates. \"To give benefit of the doubt, I don't t",
        "id": 4003800,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/06/1850207/trump-ai-czar-says-no-federal-bailout-for-ai-after-openai-cfos-comments",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump AI Czar Says 'No Federal Bailout For AI' After OpenAI CFO's Comments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T19:27:53.380273+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T18:50:00+00:00",
        "description": "AI labs are paying skilled professionals hundreds of dollars per hour to train their models in specialized fields. Companies like Mercor, Surge AI, Scale AI and Turing recruit bankers, lawyers, engineers and doctors to improve the accuracy of AI systems in professional settings. Mercor advertises roles for medical secretaries, movie directors and private detectives at rates ranging from $20 to $185 per hour for contract work and up to $200,000 for full-time positions. Surge AI offers as much as $1,000 per hour for expertise from startup CEOs and venture capital partners. Mercor pays out over $1.5 million daily to professionals it hires for clients including OpenAI and Anthropic. \n\nSome contractors are former employees of Goldman Sachs and McKinsey. Others moonlight in this work while keeping their regular jobs. Brendan Foody, Mercor's 22-year-old CEO, acknowledged at a conference last week that trade secrets could potentially be compromised given the volume of work submitted. Uber CEO",
        "id": 4003293,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/06/1824257/a-new-white-collar-gig-economy-training-ai-to-take-over",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A New White-Collar Gig Economy: Training AI To Take Over",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T18:25:03.129137+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T18:14:00+00:00",
        "description": "American manufacturing's postwar boom from the 1940s through the 1970s resulted from conditions that cannot be recreated, a story on WSJ argues. Global competitors had been destroyed by war. Energy was cheap. Unions could demand concessions without fearing job losses to foreign rivals. \n\nStrikes were frequent in steel, auto, trucking, rubber and coal mining. That relentless pressure from an organized working class raised real wages and created fringe benefits including health insurance and retirement pay. Government support for unions kept executive salaries at just a few times median income. Stock buybacks were illegal or frowned upon. President Eisenhower declared at the 1956 dedication of the AFL-CIO national headquarters that \"Labor is the United States.\" \n\nThe system began unraveling by the mid-1960s. The Vietnam War drained federal coffers. Inflation accelerated as government deficits exploded. Nixon abandoned the gold standard in 1971, unleashing currency volatility. The 1973 O",
        "id": 4002747,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/06/1813240/why-manufacturings-last-boom-will-be-hard-to-repeat",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Manufacturing's Last Boom Will Be Hard To Repeat",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T18:25:03.340425+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T17:35:00+00:00",
        "description": "An anonymous reader shares a report: Automattic, the company that owns WordPress.com, is asking Automatic.CSS -- a company that provides a CSS framework for WordPress page builders -- to change its name amid public spats between Automattic founder Matt Mullenweg and Automatic.CSS creator Kevin Geary. Automattic has two T's as a nod to Matt. \n\n\"As you know, our client owns and operates a wide range of software brands and services, including the very popular web building and hosting platform WordPress.com,\" Jim Davis, an intellectual property attorney representing Automattic, wrote in a letter dated Oct. 30. \n\n\"Automattic is also well-known for its longtime and extensive contributions to the WordPress system. Our client owns many trademark registrations for its Automattic mark covering those types of services and software,\" Davis continued. \"As we hope you can appreciate, our client is concerned about your use of a nearly identical name and trademark to provide closely related WordPress",
        "id": 4002748,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/06/1735215/automattic-inc-claims-it-owns-the-word-automatic",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Automattic Inc. Claims It Owns the Word 'Automatic'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T17:23:40.312002+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T16:54:00+00:00",
        "description": "OpenAI CFO Sarah Friar said late Wednesday that the AI startup is not seeking a government backstop for its infrastructure commitments, clarifying previous comments she made on stage during the Wall Street Journal's Tech Live event. From a report: At the event, Friar said OpenAI is looking to create an ecosystem of banks, private equity and a federal \"backstop\" or \"guarantee\" that could help the company finance its investments in cutting-edge chips. But in a LinkedIn post late Wednesday, Friar softened her stance. \n\n\"I used the word 'backstop' and it muddied the point,\" Friar wrote. \"As the full clip of my answer shows, I was making the point that American strength in technology will come from building real industrial capacity which requires the private sector and government playing their part.\" OpenAI has inked more than $1.4 trillion of infrastructure deals in recent months to try and build out the data centers it says are needed to meet soaring demand. The agreements have raised qu",
        "id": 4002127,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/06/1654233/openai-cfo-says-company-isnt-seeking-government-backstop-clarifying-prior-comment",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI CFO Says Company Isn't Seeking Government Backstop, Clarifying Prior Comment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T16:22:03.824256+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T16:12:00+00:00",
        "description": "An anonymous reader shares a report: US software company SAS Institute has withdrawn from mainland China and dismissed its local staff, according to a Beijing-based employee affected by the move, as the analytics specialist ended more than two decades of operations amid intense domestic competition and geopolitical tensions. The company on Thursday announced the lay-offs via an email and hosted a short video call, in which executives thanked local employees for their contribution and cited \"organisational optimisation\" for the exit, according to the employee. \n\n\"SAS is ceasing direct business operations in China,\" an SAS spokeswoman said on Friday in response to the Post's inquiry. \"This decision reflects a broader shift in how we operate globally, optimising our footprint and ensuring long-term sustainability.\" The company would continue having a presence on the mainland via third-party partners, according to the spokeswoman.<p><div class=\"share_submission\" style=\"position:relative;\"",
        "id": 4001549,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/06/1612213/us-software-firm-sas-exits-china-after-25-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Software Firm SAS Exits China After 25 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T16:22:03.956113+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T15:29:00+00:00",
        "description": "The government shutdown-spurred airport chaos is about to get a whole lot worse. From a report: The Federal Aviation Administration said Wednesday it will reduce flight volumes by 10 percent across 40 major airports in response, a move that could threaten 3,000 to 4,500 flights daily. The cuts will affect \"high volume\" markets, including in Atlanta, Dallas, New York City and Los Angeles, according to CBS. The FAA has not formally announced which airports will have their capacity cut. \n\n\"I'm not aware in my 35-year history in the aviation market where we've had a situation where we're taking these kinds of measures,\" FAA Administrator Bryan Bedford said at a news conference, according to the AP. The government shutdown, which is now the longest in US history, has already been causing thousands of delays each day, as well as long waits at airport security. Some major airports have even been forced to operate without air traffic control for hours at a time.<p><div class=\"share_submission",
        "id": 4001550,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/06/1529244/thousands-of-flights-in-danger-of-cancellation-as-faa-announces-major-cuts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Thousands of Flights in Danger of Cancellation as FAA Announces Major Cuts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T15:19:24.386282+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T14:40:00+00:00",
        "description": "Rockstar Games, the company behind the hit Grand Theft Auto franchise, said that the dozens of employees it fired last week were leaking company secrets, disputing allegations by labor leaders that it was disrupting workers' attempt to unionize. From a report: The employees had been sharing company information in a forum that included non-employees, a Rockstar spokesperson said in a statement to Bloomberg on Wednesday. \"Last week, we took action against a small number of individuals who were found to be distributing and discussing confidential information in a public forum, a violation of our company policies,\" the spokesperson said. \"This was in no way related to people's right to join a union or engage in union activities.\"\n\nThe company, part of Take-Two Interactive Software, fired between 30 and 40 employees across offices in the UK and Canada for what it said was \"gross misconduct.\" The Independent Workers' Union of Great Britain, the first to organize video-game workers in the UK",
        "id": 4000944,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/06/1232215/grand-theft-auto-studio-says-fired-employees-were-leaking-information",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Grand Theft Auto' Studio Says Fired Employees Were Leaking Information",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T14:16:54.163147+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T14:00:00+00:00",
        "description": "Nvidia chief executive Jensen Huang has warned that China will beat the US in the AI race, thanks to lower energy costs and looser regulations. From a report: In the starkest comments yet from the head of the world's most valuable company, Huang told the FT: \"China is going to win the AI race.\" Huang's remarks come after the Trump administration maintained a ban on California-based Nvidia selling its most advanced chips to Beijing following a meeting between US President Donald Trump and Chinese leader Xi Jinping last week. \n\nThe Nvidia chief said that the west, including the US and UK, was being held back by \"cynicism.\" \"We need more optimism,\" Huang said on Wednesday on the sidelines of the Financial Times' Future of AI Summit. Huang singled out new rules on AI by US states that could result in \"50 new regulations.\" He contrasted that approach with Chinese energy subsidies that made it more affordable for local tech companies to run Chinese alternatives to Nvidia's AI chips. \"Power ",
        "id": 4000324,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/06/1117201/nvidias-jensen-huang-says-china-will-win-ai-race-with-us",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia's Jensen Huang Says China 'Will Win' AI Race With US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T13:11:33.073886+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T13:00:00+00:00",
        "description": "A curious engineer discovered that his iLife A11 smart vacuum was remotely \"killed\" after he blocked it from sending data to the manufacturer's servers. By reverse-engineering it with custom hardware and Python scripts, he managed to revive the device to run fully offline. Tom's Hardware reports: An engineer got curious about how his iLife A11 smart vacuum worked and monitored the network traffic coming from the device. That's when he noticed it was constantly sending logs and telemetry data to the manufacturer -- something he hadn't consented to. The user, Harishankar, decided to block the telemetry servers' IP addresses on his network, while keeping the firmware and OTA servers open. While his smart gadget worked for a while, it just refused to turn on soon after. After a lengthy investigation, he discovered that a remote kill command had been issued to his device.\n \nHe sent it to the service center multiple times, wherein the technicians would turn it on and see nothing wrong with ",
        "id": 3999751,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/06/0223216/manufacturer-bricks-smart-vacuum-after-engineer-blocks-it-from-collecting-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Manufacturer Bricks Smart Vacuum After Engineer Blocks It From Collecting Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T10:06:50.096860+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T10:00:00+00:00",
        "description": "China has delayed the return of its Shenzhou-20 crewed spacecraft after it was suspected to have been struck by space debris while docked at the Tiangong space station. \"The Shenzhou-20 crewed spacecraft is suspected of being struck by a small piece of space debris, and impact analysis and risk assessment are underway,\" the China Manned Space Engineering Office (CMSEO) statement Nov. 5 read. \"To ensure the safety and health of the astronauts and the complete success of the mission, it has been decided that the Shenzhou-20 return mission, originally scheduled for Nov. 5, will be postponed.\" SpaceNews reports: CMSEO did not specify the location of the suspected strike, the extent of any damage, or the data that indicated an impact. No potential dates were noted for a return to Earth. The Shenzhou-20 spacecraft launched April 24, carrying three astronauts -- commander Chen Dong and crewmates Chen Zhongrui and Wang Jie -- to the Tiangong space station. The spacecraft docked at the radial ",
        "id": 3998385,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/06/0232232/china-delays-shenzhou-20-crew-return-after-suspected-space-debris-impact",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Delays Shenzhou-20 Crew Return After Suspected Space Debris Impact",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T08:02:06.336726+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T07:00:00+00:00",
        "description": "A new study challenges the Nobel-winning theory that the universe's expansion is accelerating, suggesting instead that it may be slowing down as dark energy weakens -- potentially leading to a future \"big crunch\" where the cosmos collapses back in on itself. \"Our study shows that the universe has already entered a phase of decelerated expansion at the present epoch and that dark energy evolves with time much more rapidly than previously thought,\" said Prof Young-Wook Lee, of Yonsei University in South Korea, who led the work. \"If these results are confirmed, it would mark a major paradigm shift in cosmology since the discovery of dark energy 27 years ago.\" The Guardian reports: The latest work focuses on the reliability of observations of distant supernovae (exploding stars) that led to the discovery of dark energy, work that was awarded the 2011 Nobel prize in physics. [...] By estimating the ages of 300 host galaxies using a different method, the team concluded that there are simply",
        "id": 3997805,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/06/0146235/universe-expansion-may-be-slowing-not-accelerating-study-suggests",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Universe Expansion May Be Slowing, Not Accelerating, Study Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T03:52:35.225200+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from MIT Technology Review: The US- and UK-based company Quantinuum today unveiled Helios, its third-generation quantum computer, which includes expanded computing power and error correction capability. Like all other existing quantum computers, Helios is not powerful enough to execute the industry's dream money-making algorithms, such as those that would be useful for materials discovery or financial modeling. But Quantinuum's machines, which use individual ions as qubits, could be easier to scale up than quantum computers that use superconducting circuits as qubits, such as Google's and IBM's. \"Helios is an important proof point in our road map about how we'll scale to larger physical systems,\" says Jennifer Strabley, vice president at Quantinuum, which formed in 2021 from the merger of Honeywell Quantum Solutions and Cambridge Quantum. Honeywell remains Quantinuum's majority owner.\n \nLocated at Quantinuum's facility in Colorado, Helios comprises ",
        "id": 3996789,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/06/0137217/a-new-ion-based-quantum-computer-makes-error-correction-simpler",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A New Ion-Based Quantum Computer Makes Error Correction Simpler",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T01:47:18.642637+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T01:30:00+00:00",
        "description": "A bungled October 18 heist that saw $102 million of crown jewels stolen from the Louvre in broad daylight has exposed years of lax security at the national art museum. From trivial passwords like 'LOUVRE' to decades-old, unsupported systems and easy rooftop access, the job was made surprisingly easy. PC Gamer reports: As Rogue cofounder and former Polygon arch-jester Cass Marshall notes on Bluesky, we owe a lot of videogame designers an apology. We've spent years dunking on the emptyheadedness of game characters leaving their crucial security codes and vault combinations in the open for anyone to read, all while the Louvre has been using the password \"Louvre\" for its video surveillance servers. That's not an exaggeration. Confidential documents reviewed by Liberation detail a long history of Louvre security vulnerabilities, dating back to a 2014 cybersecurity audit performed by the French Cybersecurity Agency (ANSSI) at the museum's request. ANSSI experts were able to infiltrate the L",
        "id": 3996262,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/05/238245/the-louvres-video-surveillance-password-was-louvre",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Louvre's Video Surveillance Password Was 'Louvre'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T01:47:18.793769+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T00:50:00+00:00",
        "description": "A new survey of over 300 US and UK gaming executives found that 72% view Steam as a monopoly. \"Furthermore, 88% said that at least three-quarters of their revenue came from Steam, while 37% reported that the platform accounted for 90% of their total revenue,\" adds Techspot. From the report: Atomik Research conducted the recent survey on behalf of Rokky, a company that helps game publishers minimize the impact of grey market key resellers on prices. In addition to opinions on Steam, developers also answered questions about the PC market's biggest challenges.\n \nThe increasing popularity of free-to-play games such as Fortnite, DOTA 2, Counter-Strike 2, Call of Duty: Warzone, and Roblox topped the list of concerns for 40% of respondents. Approximately a third mentioned market saturation and discoverability, echoing data that suggests there aren't enough players for the thousands of new titles released on Steam each year. A similar portion of survey respondents also expressed concerns rega",
        "id": 3996263,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/05/2259254/72-of-game-developers-say-steam-is-effectively-a-pc-gaming-monopoly",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "72% of Game Developers Say Steam Is Effectively a PC Gaming Monopoly",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-06T00:44:03.138709+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-06T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: Google Maps is heading in a new direction with artificial intelligence sitting in the passenger's seat. Fueled by Google's Gemini AI technology, the world's most popular navigation app will become a more conversational companion as part of a redesign announced Wednesday. The hands-free experience is meant to turn Google Maps into something more like an insightful passenger able to direct a driver to a destination while also providing nearby recommendations on places to eat, shop or sightsee, when asked for the advice. \"No fumbling required -- now you can just ask,\" Google promised in a blog post about the app makeover.\n \nThe AI features are also supposed to enable Google Maps to be more precise by calling out landmarks to denote the place to make a turn instead of relying on distance notifications. AI chatbots, like Gemini and OpenAI's ChatGPT, have sometimes lapsed into periods of making things up -- known as \"hallucinati",
        "id": 3995962,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/05/2254235/gemini-ai-to-transform-google-maps-into-a-more-conversational-experience",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gemini AI To Transform Google Maps Into a More Conversational Experience",
        "vote": 0
    }
]