[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T23:06:00+00:00",
        "description": "WordPress co-founder Matt Mullenweg said on a podcast he aims to eventually hand over leadership to a single successor rather than \"a committee,\" amid growing calls for him to step down following his legal battle with hosting company WP Engine. On a recent episode of Lenny's Podcast, Mullenweg discussed his succession strategy for Automattic, the parent company of WordPress.com, WooCommerce and Tumblr. \"I want to pass it to someone else who could have a role similar to mine, and really sort of try to be a steward,\" Mullenweg said, comparing the position to \"being like a mayor than a CEO\" as the leader would remain accountable to users and contributors.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Automattic+CEO+Matt+Mullenweg+Talks+Succession+-+'I+Don't+Want+To+Pass+It+To+a+Committee'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F04%2F2144219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https:/",
        "id": 2246859,
        "language": null,
        "link": "https://slashdot.org/story/25/03/04/2144219/automattic-ceo-matt-mullenweg-talks-succession---i-dont-want-to-pass-it-to-a-committee?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Automattic CEO Matt Mullenweg Talks Succession - 'I Don't Want To Pass It To a Committee'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T23:06:00+00:00",
        "description": "Fabled RepairTuber and right-to-repair crusader Louis Rossmann accuses Brother of implementing forced firmware updates that block third-party ink cartridges and remove older firmware versions from support portals. These updates also prevent color calibration with aftermarket ink, rendering cheaper cartridges unusable. Tom's Hardware reports: As mentioned in the intro, Rossmann has seen two big issues emerge for Brother printer users with recent firmware updates. Firstly, models that used to work with aftermarket ink, might refuse to work with the same cartridges in place post-update. Brother doesn't always warn about such updates, so Rossmann says that it is important to keep your printer offline, if possible. Moreover, he reckons it is best to keep your printers offline, and \"I highly suggest that you turn off your updates,\" in light of these anti-consumer updates. Another anti-consumer problem Rossmann highlights affects color devices. He cites reports from a Brother MFP user who n",
        "id": 2246858,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/04/2151220/brother-accused-of-locking-down-third-party-printer-ink-cartridges-via-forced-firmware-updates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Brother Accused of Locking Down Third-Party Printer Ink Cartridges Via Forced Firmware Updates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T22:00:37+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: After a group of attorneys were caught using AI to cite cases that didn't actually exist in court documents last month, another lawyer was told to pay $15,000 for his own AI hallucinations that showed up in several briefs. Attorney Rafael Ramirez, who represented a company called HoosierVac in an ongoing case where the Mid Central Operating Engineers Health and Welfare Fund claims the company is failing to allow the union a full audit of its books and records, filed a brief in October 2024 that cited a case the judge wasn't able to locate. Ramirez \"acknowledge[d] that the referenced citation was in error,\" withdrew the citation, and \"apologized to the court and opposing counsel for the confusion,\" according to Judge Mark Dinsmore, U.S. Magistrate Judge for the Southern District of Indiana. But that wasn't the end of it. An \"exhaustive review\" of Ramirez's other filings in the case showed that he'd included made-up cases in two other",
        "id": 2246398,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/04/2139203/judges-are-fed-up-with-lawyers-using-ai-that-hallucinate-court-cases?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Judges Are Fed Up With Lawyers Using AI That Hallucinate Court Cases",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T20:55:53+00:00",
        "description": "Citigroup nearly credited about $6 billion to a customer's account in its wealth-management business by accident. From a report: The near-error occurred after a staffer handling the transfer copied and pasted the account number into a field for the dollar figure, which was detected on the next business day, the report added. The wealth division's near-miss was reported to regulators and the company has since set up a tool to help vet large, anomalous payments and transfers, according to the report. The error was related to an attempted transfer of funds between internal accounts, the report said. Last week, the Financial Times reported that Citigroup erroneously credited $81 trillion, instead of $280, to a customer's account and took hours to reverse the transaction.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Citi+Copy-Paste+Error+Almost+Sent+%246+Billion+to+Wealth+Account%3A+https%3A%2F%2Fit.slashdot.org%2Fsto",
        "id": 2245939,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/04/1952241/citi-copy-paste-error-almost-sent-6-billion-to-wealth-account?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Citi Copy-Paste Error Almost Sent $6 Billion to Wealth Account",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T19:51:11+00:00",
        "description": "Chinese electric vehicle maker BYD is rapidly gaining market share in Australia, with sales rising 65% last year as nearly one in four EVs sold in the country was a BYD, according to EVDirect CEO David Smitherman. Chinese EVs now comprise roughly one-third of electric vehicles sold in Australia, which has no domestic auto industry to protect with tariffs, unlike the United States where both Trump and Biden administrations have effectively blocked Chinese EV imports. \n\nThe Biden administration imposed a 100% tariff on Chinese EVs to shield U.S. automakers from what it termed unfair competition. U.S. officials also blocked Chinese vehicle software over security concerns that Beijing could use internet-connected cars for surveillance. Australian authorities are monitoring U.S. developments but remain noncommittal despite security experts urging restrictions on Chinese connected car technology.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://t",
        "id": 2245481,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/04/1842209/australia-with-no-auto-industry-to-protect-is-awash-with-chinese-evs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Australia, With No Auto Industry To Protect, is Awash With Chinese EVs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T18:45:17+00:00",
        "description": "Apple is stepping up its fight with the British government over a demand to create a \"back door\" in its most secure cloud storage systems, by filing a legal complaint that it hopes will overturn the order. Financial Times: The iPhone maker has made its appeal to the Investigatory Powers Tribunal, an independent judicial body that examines complaints against the UK security services, according to people familiar with the matter. The Silicon Valley company's legal challenge is believed to be the first time that provisions in the 2016 Investigatory Powers Act allowing UK authorities to break encryption have been tested before the court. \n\nThe Investigatory Powers Tribunal will consider whether the UK's notice to Apple was lawful and, if not, could order it to be quashed. The case could be heard as soon as this month, although it is unclear whether there will be any public disclosure of the hearing. The government is likely to argue the case should be restricted on national security grou",
        "id": 2244844,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/03/04/1743218/apple-launches-legal-challenge-to-uk-back-door-order?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Launches Legal Challenge To UK 'Back Door' Order",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T17:40:18+00:00",
        "description": "After California's bar exams were plagued last week with technical problems, the State Bar of California is recommending that the agency return to in-person tests as it scrutinizes whether the vendor behind the new testing system met the obligations of its contract. From a report: \"Based on the administration of the February Bar Exam, staff cannot recommend going forward with Meazure Learning,\" Donna Hershkowitz, chief of admissions for the State Bar, wrote to the agency's Board of Trustees in a staff memo, referring to the vendor. Instead, she wrote, staff recommend reverting to in-person testing for the next round of exams in July. \n\nThe State Bar's 13-member board, which is scheduled to meet March 5, will ultimately decide on plans for the July bar exam and remedies for test takers who faced problems. In a statement Monday, the State Bar said it is \"closely scrutinizing whether Meazure Learning met its contractual obligations\" in administering the February State Bar exam and will ",
        "id": 2244047,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/04/1728200/after-exam-fiasco-california-state-bar-staff-recommend-reverting-to-in-person-exams?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After Exam Fiasco, California State Bar Staff Recommend Reverting To In-person Exams",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T17:40:18+00:00",
        "description": "EmagGeek shares a report: Scientists have genetically engineered mice with some key characteristics of an extinct animal that was far larger -- the woolly mammoth. This \"woolly mouse\" marks an important step toward achieving the researchers' ultimate goal -- bringing a woolly mammoth-like creature back from extinction, they say. \n\n\"For us, it's an incredibly big deal,\" says Beth Shapiro, chief science officer at Colossal Biosciences, a Dallas company trying to resurrect the woolly mammoth and other extinct species. The company announced the creation of the woolly mice Tuesday in a news release and posted a scientific paper online detailing the achievement. Scientists implanted genetically modified embryos in female lab mice that gave birth to the first of the woolly pups in October. \n\nMy editorial: One has to wonder why it is necessary or even a great idea to bring back species that nature long ago determined were a failure.<p><div class=\"share_submission\" style=\"position:relative;\">",
        "id": 2244048,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/04/1624239/scientists-create-woolly-mice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Create 'Woolly Mice'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "Apple today announced a significant update to its iPad Air lineup, integrating the M3 chip previously reserved for higher-end devices. The new tablets, available in both 11-inch ($599) and 13-inch ($799) configurations, deliver substantial performance gains: nearly 2x faster than M1-equipped models and 3.5x faster than A14 Bionic versions. \n\nThe M3 brings Apple's advanced graphics architecture to the Air for the first time, featuring dynamic caching, hardware-accelerated mesh shading, and ray tracing. The chip includes an 8-core CPU delivering 35% faster multithreaded performance over M1, paired with a 9-core GPU offering 40% faster graphics. The Neural Engine processes AI workloads 60% faster than M1, the company said. Apple also introduced a redesigned Magic Keyboard ($269/$319) with function row and larger trackpad.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Unveils+iPad+Air+With+M3+Chip%3A+https%3A%2F",
        "id": 2241653,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/03/04/1552204/apple-unveils-ipad-air-with-m3-chip?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Unveils iPad Air With M3 Chip",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "China's highest court has called for a crack down on the activities of paper mills, businesses that churn out fraudulent or poor-quality manuscripts and sell authorships. Nature: Some researchers are cautiously optimistic that the court's guidance will help curb the use of these services, while others think the impact will be minimal. \"This is the first time the supreme court has issued guidance on paper mills and on scientific fraud,\" says Wang Fei, who studies research-integrity policy at Dalian University of Technology in China. \n\nPaper mills sell suspect research and authorships to researchers who want journal articles to burnish their CVs. They are a significant contributor to overall research misconduct, particularly in China. Last month, the Supreme People's Court published a set of guiding opinions on technology innovation. Among the list of 25 articles, one called for lower courts to crack down on 'paper industry chains,' and for research fraud to be severely punished. Furth",
        "id": 2241655,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/04/1331210/chinas-supreme-court-calls-for-crack-down-on-paper-mills?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China's Supreme Court Calls For Crack Down on Paper Mills",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "CISA has warned U.S. federal agencies about active exploitation of vulnerabilities in Cisco VPN routers and Windows systems. \"While the cybersecurity agency has tagged these flaws as actively exploited in the wild, it has yet to provide specific details regarding this malicious activity and who is behind it,\" adds Bleeping Computer. From the report: The first flaw (tracked as CVE-2023-20118) enables attackers to execute arbitrary commands on RV016, RV042, RV042G, RV082, RV320, and RV325 VPN routers. While it requires valid administrative credentials, this can still be achieved by chaining the CVE-2023-20025 authentication bypass, which provides root privileges. Cisco says in an advisory published in January 2023 and updated one year later that its Product Security Incident Response Team (PSIRT) is aware of CVE-2023-20025 publicly available proof-of-concept exploit code.\n \nThe second security bug (CVE-2018-8639) is a Win32k elevation of privilege flaw that local attackers logged into ",
        "id": 2241658,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/04/0315205/cisa-tags-windows-cisco-vulnerabilities-as-actively-exploited?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CISA Tags Windows, Cisco Vulnerabilities As Actively Exploited",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "A fully driverless Maserati MC20 Coupe set a new autonomous land speed record, reaching 197.7 mph at the Kennedy Space Center. The Verge reports: The Maserati was running self-driving software developed by Politecnico di Milano, Italy's largest scientific and technological university. The team also worked with the Indy Autonomous Challenge, which most recently ran at the Las Vegas Motor Speedway during CES 2025. In the shadow of NASA's iconic Space Shuttles, the race car flew down the 2.8-mile runway at record-breaking speeds, surpassing the 192.2mph record that was also held by Indy Autonomous Challenge and PoliMOVE, set by an IAC AV-21 race car in April 2022.\n \nThe Maserati MC20 is a stylish -- and expensive -- choice for the autonomous run. Retailing for at least $239,000, the race car sports a mid-mounted, twin-turbocharged 3.0-liter V-6 that Maserati calls the Nettuno. The engine makes serious power: 621 horsepower and 538 pound-feet of torque, which is sent through an eight-spe",
        "id": 2241664,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/03/2213252/driverless-race-car-sets-a-new-autonomous-speed-record?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Driverless Race Car Sets a New Autonomous Speed Record",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "AmiMoJo shares a report: Europe's biggest battery storage project has entered commercial operation in Scotland [alternative source], promising to soak up surplus wind power and prevent turbines being paid to switch off. \n\nZenobe said the first phase of its project at Blackhillock, between Inverness and Aberdeen, was now live with capacity to store enough power to supply 200 megawatts of electricity for two hours. It is due to be expanded to 300 megawatts by next year, enough to supply 3.1 million homes, more than every household in Scotland. \n\nThe government's Clean Power 2030 action plan sets a target capacity of up to 27 gigawatts of batteries by 2030, a sixfold increase from the 4.5 gigawatts installed today. This huge expansion is seen as critical as Britain builds more renewable wind and solar power, since batteries can store surplus generation for use when the wind does not blow and the sun does not shine.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"sl",
        "id": 2241654,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/04/1348203/europes-biggest-battery-powered-up-in-scotland?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Europe's Biggest Battery Powered Up In Scotland",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "Google Play on Android devices is being updated to include a new search filter for widgets, widget badges on app detail pages, and a curated editorial page dedicated to widgets. The Verge reports: With the search filter, users will be able to more easily search for apps with widgets. The badge \"eliminates guesswork for users and highlights your widget offerings, encouraging them to explore and utilize this capability,\" Taiwo-Peters says. And the curated editorial page will show off \"collections of excellent widgets.\" The updated widget discoverability tools will be \"coming soon,\" Taiwo-Peters says. \"Historically, one of the challenges with investing in widget development has been discoverability and user understanding,\" product manager Yinka Taiwo-Peters says in the post. \"You've asked for better ways for users to find and utilize your widgets, and we're delivering.\" Yinka Taiwo-Peters also acknowledges that \"we understand that the effort required to build and maintain widgets needs ",
        "id": 2241662,
        "language": null,
        "link": "https://devices.slashdot.org/story/25/03/03/238215/google-play-is-going-to-start-highlighting-apps-with-widgets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Play Is Going To Start Highlighting Apps With Widgets",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Google has open sourced an AI model, SpeciesNet, designed to identify animal species by analyzing photos from camera traps. Researchers around the world use camera traps -- digital cameras connected to infrared sensors -- to study wildlife populations. But while these traps can provide valuable insights, they generate massive volumes of data that take days to weeks to sift through. In a bid to help, Google launched Wildlife Insights, an initiative of the company's Google Earth Outreach philanthropy program, around six years ago. Wildlife Insights provides a platform where researchers can share, identify, and analyze wildlife images online, collaborating to speed up camera trap data analysis.\n \nMany of Wildlife Insights' analysis tools are powered by SpeciesNet, which Google claims was trained on over 65 million publicly available images and images from organizations like the Smithsonian Conservation Biology Institute, the Wildlife ",
        "id": 2241657,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/04/0321215/google-releases-speciesnet-an-ai-model-designed-to-identify-wildlife?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Releases SpeciesNet, an AI Model Designed To Identify Wildlife",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "NASA used specialized Schlieren photography to capture an image of Boom Supersonic's XB-1 demonstrator aircraft breaking the sound barrier on February 10, 2025 and producing shock waves as it exceeded Mach 1. The flight produced no audible sonic boom, marking progress toward the goal of quiet supersonic travel. CNN reports: \"This image makes the invisible visible,\" said Blake Scholl, founder and CEO of Boom Supersonic, in a press release. In order to capture the Schlieren images, Boom chief test pilot Tristan \"Geppetto\" Brandenburg positioned XB-1 at an exact time in a precise location over the Mojave Desert.\n \nAs the aircraft flew in front of the sun, NASA's team documented the changing air speeds as speeds over Mach 1, the speed of sound (761.23 miles per hour or 1,225.1 kilometers per hour). The images were captured during ground telescopes with special filters that detect air distortions. You can view the photo here.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a ",
        "id": 2241661,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/03/2346245/nasa-photo-captures-sound-barrier-being-broken?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA Photo Captures Sound Barrier Being Broken",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "Firefly Aerospace's Blue Ghost lander successfully touched down on the moon, making it the first private company to achieve a stable lunar landing without crashing. The craft is carrying various NASA-funded experiments, including a \"vacuum to suck up moon dirt for analysis and a drill to measure temperature as deep as 10 feet (3 meters) below the surface,\" reports the Associated Press. There's also \"a device for eliminating abrasive lunar dust -- a scourge for NASA's long-ago Apollo moonwalkers, who got it caked all over their spacesuits and equipment.\" From the report: A half hour after landing, Blue Ghost started to send back pictures from the surface, the first one a selfie somewhat obscured by the sun's glare. The second shot included the home planet, a blue dot glimmering in the blackness of space. Blue Ghost -- named after a rare U.S. species of fireflies -- had its size and shape going for it. The squat four-legged lander stands 6-foot-6 (2 meters) tall and 11 feet (3.5 meters",
        "id": 2241659,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/04/0310239/private-lunar-lander-blue-ghost-aces-moon-touchdown?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Private Lunar Lander Blue Ghost Aces Moon Touchdown",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "Realme plans to double smartphone battery capacity to 10,000mAh within its three-year strategic roadmap, the company said at tradeshow MWC on Tuesday. Current flagship devices typically offer 5,000mAh, while Realme's latest models already ship with 6,000mAh cells. The company expects to implement 7,500mAh batteries next year before reaching the 10,000mAh target, PCMag reported, citing the firm.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Realme+Charts+Path+To+10%2C000mAh+Phone+Batteries+by+2026%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F25%2F03%2F04%2F1132213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F25%2F03%2F04%2F1132213%2Frealme-charts-path-to-10000mah-phone-batteries-by-2026%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src",
        "id": 2241656,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/03/04/1132213/realme-charts-path-to-10000mah-phone-batteries-by-2026?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Realme Charts Path To 10,000mAh Phone Batteries by 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Since the launch of ChatGPT in late 2022, experts have debated how widely AI language models would impact the world. A few years later, the picture is getting clear. According to new Stanford University-led research examining over 300 million text samples across multiple sectors, AI language models now assist in writing up to a quarter of professional communications across sectors. It's having a large impact, especially in less-educated parts of the United States. \"Our study shows the emergence of a new reality in which firms, consumers and even international organizations substantially rely on generative AI for communications,\" wrote the researchers.\n \nThe researchers tracked large language model (LLM) adoption across industries from January 2022 to September 2024 using a dataset that included 687,241 consumer complaints submitted to the US Consumer Financial Protection Bureau (CFPB), 537,413 corporate press releases, 304.3 mill",
        "id": 2241660,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/03/2327219/researchers-find-less-educated-areas-adopting-ai-writing-tools-faster?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Find Less-Educated Areas Adopting AI Writing Tools Faster",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-04T16:35:46+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: The United States has suspended its offensive cyber operations against Russia, according to reports, amid efforts by the Trump administration to grant Moscow concessions to end the war in Ukraine. The reported order to halt U.S.-launched hacking operations against Russia was authorized by U.S. Defense Secretary Pete Hegseth, according to The Record. The new guidance affects operations carried out by U.S. Cyber Command, a division of the Department of Defense focused on hacking and operations in cyberspace, but does not apply to espionage operations conducted by the National Security Agency. The reported order has since been confirmed by The New York Times and The Washington Post.\n \nThe order was handed down before Friday's Oval Office meeting between U.S. President Donald Trump, Vice President JD Vance, and Ukrainian President Volodymyr Zelenskyy, according to the reports. The New York Times said that the instruction came as part o",
        "id": 2241663,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/03/2247209/us-to-halt-offensive-cyber-operations-against-russia?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US To Halt Offensive Cyber Operations Against Russia",
        "vote": 0
    }
]