[
    {
        "age": null,
        "album": "",
        "author": "Universal Pictures",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-04T18:46:22.765364+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-04T17:45:04+00:00",
        "description": "What would you sacrifice to become the greatest of all time?\n\nFrom Oscar® winner Jordan Peele and Monkeypaw Productions, producers of the landmark horror films Get Out, Us, Candyman and Nope, comes a chilling journey into the inner sanctum of fame, idolatry and the pursuit of excellence at any cost, featuring an electrifying dramatic performance from Marlon Wayans (Air, Respect).\n\nFormer college wide-receiver Tyriq Withers (Atlanta, the upcoming I Know What You Did Last Summer) plays Cameron Cade, a rising-star quarterback who has devoted his life, and identity, to football. On the eve of professional football’s annual scouting Combine, Cam is attacked by an unhinged fan and suffers a potentially career-ending brain trauma.\n\nJust when all seems lost, Cam receives a lifeline when his hero, Isaiah White (Marlon Wayans), a legendary eight-time Championship quarterback and cultural megastar, offers to train Cam at Isaiah’s isolated compound that he shares with his celebrity influencer wif",
        "id": 3496771,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=y3iQu4oxzPU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 598,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCq0OueAsdxH6b8nyAspwViw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/y3iQu4oxzPU/hqdefault.jpg",
        "title": "Julia Fox on HIM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Universal Pictures",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-04T16:18:39.242784+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-04T15:00:16+00:00",
        "description": "What do you think happens when you die?\n\n\n-\nFour years ago, 13-year-old Finn killed his abductor and escaped, becoming the sole survivor of The Grabber. But true evil transcends death … and the phone is ringing again. \n\nFour-time Academy Award® nominee Ethan Hawke returns to the most sinister role of his career as The Grabber seeks vengeance on Finn (Mason Thames) from beyond the grave by menacing Finn’s younger sister, Gwen (Madeleine McGraw). \n\nAs Finn, now 17, struggles with life after his captivity, the headstrong 15-year-old Gwen begins receiving calls in her dreams from the black phone and seeing disturbing visions of three boys being stalked at a winter camp known as Alpine Lake. \n\nDetermined to solve the mystery and end the torment for both her and her brother, Gwen persuades Finn to visit the camp during a winter storm. There, she uncovers a shattering intersection between The Grabber and her own family’s history. Together, she and Finn must confront a killer who has grown mo",
        "id": 3495571,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DdR-gzFZoDk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 598,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCq0OueAsdxH6b8nyAspwViw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DdR-gzFZoDk/hqdefault.jpg",
        "title": "Black Phone 2 | Official Trailer 2",
        "vote": 0
    }
]