[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-04T15:39:49.723419+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-04T15:30:03+00:00",
        "description": "Before there was Agent 47, a different agent made the rounds worldwide, leaving his mark on popular culture for decades to come. Now, it's time for 007 to step into the spotlight, not that this is his first stint in video games - GoldenEye and Nightfall remain certified classics. What really sets IO Interactive's 007 First Light apart is that it's an origin story of a young James Bond, whose charm collides with a brash, impulsive and downright rebellious attitude. \n\nThanks to over 30 minutes of new gameplay, we learned a bit more about who that target could be on the first steps of Bond's journey towards 007 status. There's even a release date of March 27th, 2026, for PS5, Xbox Series X/S, PC, and Nintendo Switch 2, but what really sets the experience apart from previous 007 titles? How much does the Hitman DNA really manifest? Let's dive into it.",
        "id": 3495154,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=5yhHrCuoZEA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5yhHrCuoZEA/hqdefault.jpg",
        "title": "007 First Light - 10 STUNNING Details Bond Fans Didn’t See Coming",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-04T14:09:57.778327+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-04T13:30:56+00:00",
        "description": "Lost Soul Aside's less-than-stellar debut showcases a development cycle that could have gone better for Ultizero, a studio backed by Sony since its inception. Despite the presence of a lot to love within its gameplay loop, its narrative, visuals, and performance have failed to keep up with the expectations of its players. It looks and feels like a game trapped between two generations of consoles while its pacing certainly could have been better.\n\nWhile all of these limitations keep this title from true greatness, perhaps it's not too late for its developers to mitigate some of the game's weaknesses. But what made this seemingly brilliant game fall by the wayside so easily? That's what we're here to explore. Join us as we dive into a story that could have had a very different ending if a few things had been done differently.",
        "id": 3493735,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=vsFsAx54_UQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vsFsAx54_UQ/hqdefault.jpg",
        "title": "Lost Soul Aside - What The HELL Happened?",
        "vote": 0
    }
]