[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-04T17:58:42.904680+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-04T16:01:40+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Thomas Meeker of X-Rite | Pantone explores how UE and AxF can transform your approach to product design and 3D visualization. \n\nThe need for accurately measured virtual materials is becoming a new standard to overcome challenges in advanced visualization. But how do you create these measured materials? \n\nThe PANTORA application simplifies digital material creation, offering a standardized platform for storing and sharing complex material data to streamline design workflows. This standardized material output is the AxF (Appearance Exchange Format) material package.  \n\nLearn how to create digital material twins using PANTORA and a spectrophotometer, and how to streamline complex material communication using the AxF format. The session also covers PANTORA integration with Unreal Engine, including ensuring compatibility across all rendering targets (VR, AR, Lumen, Path Tracing) without the need to manually author new material graphs.\n\n",
        "id": 3496236,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=w8LdWK5tkVQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/w8LdWK5tkVQ/hqdefault.jpg",
        "title": "The Power of AxF Measured Materials for Product Development in UE | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-04T14:10:42.123453+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-04T14:01:08+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, we give an overview of Epic Online Services player moderation tools like Anti-Cheat, and how you can use them to help combat the bad actors in your own games.\n\nWatch to discover the functionality offered with Epic Online Services Anti-Cheat, Sanctions, and Player Reports, including what’s needed to get started and how you can implement it in your game. \n\nYou'll also see practical examples of how Epic Games uses these tools in Fortnite. Guest speaker Thomas Goebl from 2K Games joins the talk to highlight how they are using the same tools to protect their games.\n\nTo find out more about Epic Online Services, check out our website: onlineservices.epicgames.com/services\n\n#EpicOnlineServices, #2KGames, #AntiCheat, #Sanctions, #PlayerReports, #Fortnite, #EOS, #UnrealFestOrlando",
        "id": 3493743,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=efeCYvkW5N4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/efeCYvkW5N4/hqdefault.jpg",
        "title": "How Fortnite and 2K Games Address Cheating with Epic Online Services | Unreal Fest Orlando 2025",
        "vote": 0
    }
]