[
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-07T20:35:37.332685+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-07T20:00:03+00:00",
        "description": "Gat broke it off with someone else for Cady. Starring Joseph Zada, Emily Alyn Lind, Shubham Maheshwari, and Esther McGregor, We Were Liars is now streaming on Prime Video.\n \n» Watch We Were Liars on Prime Video: https://bit.ly/We-Were-Liars-PV\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n\nAbout We Were Liars:\nBased on the best-selling novel by E. Lockhart, We Were Liars, the series follows Cadence Sinclair Eastman and her tight-knit inner circle, nicknamed ‘the Liars,’ during their summer escapades vacationing on their grandfather’s New England private island. On the surface the Sinclair family is known for their good looks, generational wealth, and close familial bond, but after a life-altering accident, everyone, not just the Liars, seems to have something to hide.  \n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video L",
        "id": 3518004,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=83x_K41Lflg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/83x_K41Lflg/hqdefault.jpg",
        "title": "He Broke Up With His Girlfriend For Her… | We Were Liars | Prime Video",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-07T19:30:39.705173+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-07T19:00:53+00:00",
        "description": "Life’s too short not to spend it with the person you love. The final season of The Summer I Turned Pretty is releasing weekly on Prime Video.\n \n» Watch The Summer I Turned Pretty on Prime Video: https://amzn.to/4eTgbdt\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n\nAbout The Summer I Turned Pretty Season 3:\nIt’s the end of her junior year of college, and Belly’s looking forward to another summer in Cousins with her soulmate, Jeremiah. Her future seems set, until some core-shaking events bring her first love Conrad back into her life. Now on the brink of adulthood, Belly finds herself at a crossroads and must decide which brother has her heart. Summer will never be the same…\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original s",
        "id": 3517673,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=rg37ciSld08",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rg37ciSld08/hqdefault.jpg",
        "title": "Jeremiah Tells Conrad to Leave For Good | The Summer I Turned Pretty | Prime Video",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-07T18:17:28.696150+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-07T18:00:25+00:00",
        "description": "Hazbin Hotel is now streaming on Prime Video.\n \nAbout Hazbin Hotel: Charlie Morningstar, the Princess of Hell, struggles to convince demons and angels alike that any soul can be redeemed. Sing and curse along in this adult animated musical comedy about second chances.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original series “The Boys,” “Invincible,” “Hazbin Hotel,” “The Summer I Turned Pretty,” and more.\n \n#HazbinHotel #Shorts #PrimeVideo",
        "id": 3517301,
        "language": "en",
        "link": "https://www.youtube.com/shorts/QyDNQXo7zJo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QyDNQXo7zJo/hqdefault.jpg",
        "title": "A feud for the ages | Hazbin Hotel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-07T18:17:28.855806+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-07T17:00:36+00:00",
        "description": "Sam and Cate initiate a campus uprising and Sam is haunted by his dead brother. They're not out of the woods just yet. Jaz Sinclair, Patrick Schwarzenegger, Asa Germann, and more star in Gen V, now streaming on Prime Video.\n \n» Watch Gen V on Prime Video: https://amzn.to/3EYf4rW\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n \nAbout Gen V: From the world of The Boys comes Gen V, a thrilling new series set at America’s only college for superheroes. These gifted students put their moral boundaries to the test, competing for the university’s top ranking, and a chance to join The Seven, Vought International’s elite superhero team. When the school’s dark secrets come to light, they must decide what kind of heroes they want to become.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of uni",
        "id": 3517302,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QQt67cNf3AU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QQt67cNf3AU/hqdefault.jpg",
        "title": "Tortured Supes Get Freed From Their Prison | Gen V | Prime Video",
        "vote": 0
    }
]