[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-07T18:02:15.525603+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-07T17:30:08+00:00",
        "description": "Hollow Knight: Silksong has been my obsession over the past few days, and despite all the frustration culminating in satisfying victories, all the hours not tracked in-game of trying and retrying to beat certain bosses, I can't wait to get back to it. My only worry is that I'll eventually finish everything and have to move on (or attempt a Steel Soul run for some permadeath shenanigans).\n\nYes, some things annoy me (which may be outright deal breakers for other players), and I wouldn't mind a few changes here and there. However, as it stands, Hollow Knight: Silksong is simply sublime. It's the culmination of passion, meticulous design, and stunning presentation that aims for something beyond a simple sequel, expanding on the atmosphere and exploration while delivering higher tempo movement and more creative combat expression. I can't say if it will influence other titles for years to come or prompt wistful remembrance. In this moment, just like its predecessor, Silksong weaves its many",
        "id": 3517229,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Wl-ao9dbkwM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Wl-ao9dbkwM/hqdefault.jpg",
        "title": "Hollow Knight: Silksong Review - Is It As Good As They Say?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-07T16:55:02.041371+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-07T15:30:06+00:00",
        "description": "In the lead up to its release on September 12th, Borderlands 4 is generating a lot of buzz. The looter shooter series’ enduring legacy as a strong influencer has kept its fanbase loyal despite a handful of recent missteps, but the principal reasons behind Borderlands 4’s high anticipation are the reported evolutions coming to the series. \n\nGearbox Software have crafted a raft of gameplay, narrative, and world design innovations but, crucially, they’ve been careful to maintain the series’ long-standing DNA. In short: they’ve embellished all that works in the series with aplomb whilst eradicating everything that doesn’t. \n\nTheir diligence to honour the series’ legacy ensures Borderlands 4 is shaping up to be one of the biggest games of the year.",
        "id": 3516917,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=BuWhV6GkTmU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BuWhV6GkTmU/hqdefault.jpg",
        "title": "Why Borderlands 4 Is Shaping Up To Be One of The Biggest Games of the Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-07T14:32:57.539896+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-07T13:30:23+00:00",
        "description": "EA Sports FC 26 builds upon last year’s foundation with a suite of community-led updates across gameplay, Career mode, Football Ultimate Team, and more. Holding the experience together are two new gameplay presents - Competitive and Authentic - whilst overhauled fundamentals are set to improve the authenticity of all aspects of the beautiful game, from dribbling, passing, and shooting to tackling and goalkeeper decision making. \n\nEA Sports are also planning to set a new benchmark in accessibility, with FC 26 incorporating a range of features to level the playing field for every type of gamer. This could be the most comprehensive overhaul EA Sports has put into their annual football sim for years. This feature aims to unpack the most prominent 15 things you need to know.",
        "id": 3516039,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=OqjcvddWSyU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OqjcvddWSyU/hqdefault.jpg",
        "title": "EA Sports FC 26 - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]