[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T16:00:14.312918+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T15:30:27+00:00",
        "description": "With Metal Gear Solid Delta: Snake Eater inching ever closer to its final release, we thought it would be a good idea to explore the possibility of Konami remaking another great title from the franchise's extensive lineup. \n\nMetal Gear Solid: Portable Ops may have been locked to the PSP back in the day but it certainly deserves to have its own remake for a variety of reasons. From a story that further flashes out Naked Snake's rise to prominence as a legend to a gameplay loop that raised the bar on what the franchise's unique brand of stealth action could do, MPO is a game that presents the best of Metal Gear Solid, and does so in style. \n\nRemaking it could be a clever, and lucrative, move from Konami.",
        "id": 3242083,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=t3oVYWNXL4Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/t3oVYWNXL4Y/hqdefault.jpg",
        "title": "The Best Metal Gear Solid Game You Never Played (And Why It Needs A Remake)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T13:49:54.353911+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T13:30:40+00:00",
        "description": "Hell is Us appears to have some lofty ambitions when it comes to its gameplay loop and core mysteries. Based on its development time and hefty PC requirements, it may seem like Rogue Factor is biting off more than it can chew. Nevertheless, Jacques-Belletête has worked on Deus Ex: Human Revolution and Mankind Divided, so there's some hope that this is far more than your average action-adventure (that too, one with a proper, conclusive ending).\n\nI'm still a bit iffy on how it will perform in terms of sales, especially launching amid so many other big-name titles. There's some hope that the inherent weirdness of Hell is Us will shine through and that it possesses enough substance to really draw in those who want an unorthodox exploratory experience. Who knows? It could very well surprise us - another running theme for several games this year. Hell is Us launches on September 4th for Xbox Series X/S, PS5, and PC, having recently gone gold, so thankfully, we won't have to wait too long to",
        "id": 3241375,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=irBpssjFI0g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/irBpssjFI0g/hqdefault.jpg",
        "title": "Why Hell Is Us Could Be One of the BIGGEST Games of 2025",
        "vote": 0
    }
]