[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T23:16:45.861570+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T22:19:00+00:00",
        "description": "Started in 1984, it's been described as the internet's longest-running contest. And yesterday 2025's International Obfuscated C Code Contest concluded &mdash; with 23 new winners announced in a special four-and-a-half-hour livestreamed ceremony! \nProgrammers submitted their funniest programs showcasing C's unusual/obscure subtleties while having some fun. (And demonstrating the importance of clarity and style by setting some very bad examples...) Among this year's winners were an OpenRISC 32-bit CPU emulator, a virtual machine capable of running Doom, and some kind of salmon recipe that makes clever use of C's U\"string\" literal prefix... \n\nBut yes, every entry's source code is ridiculously obfuscated. (\"Before you set off on your adventure to decode this program's logic, make sure you have enough food, ammo, clothes, oxen, and programming supplies,\" read the judge's remarks on the winner of this year's \"diabolical logistics\" prize. \"You'll be driving for 2170 miles through a wild wild",
        "id": 3244243,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/03/2216259/winners-announced-in-2025s-international-obfuscated-c-code-competition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Winners Announced in 2025's 'International Obfuscated C Code Competition'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T21:07:25.537107+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T20:55:00+00:00",
        "description": "Slashdot reader ffkom writes: The air around you mostly consists of nitrogen [78%]. And in that air exist happy little monogamous pairs of two nitrogen atoms per molecule, also known as N2. Researchers from the University of Giessen, Germany, recently managed to synthesize N6 molecules, \"the first, to our knowledge, experimentally realized neutral molecular nitrogen allotrope beyond N2 that exhibits unexpected stability.\" \n\nAnd these appear to be pretty angry little molecules, as they detonate at more than twice the energy density than good old TNT: \n\n\nA kiloton of N6 is 1.19&#215;10**7mol, which can release an energy of 2.20&#215;109kcal (9.21terajoules) based on the enthalpy. Considering that the standard kiloton TNT equivalent is 4.184terajoules, N6 can release 2.2 times the energy of TNT of the same weight. On the basis of the documented TNT equivalent based on weight for HMX (1.15) and RDX (1.15), N6 can release 1.9 times the energy of HMX or RDX with the same weight. \n\nIn interv",
        "id": 3243706,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/03/2042230/n6-hexanitrogen-synthesized-for-the-first-time---twice-as-energy-dense-as-tnt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "N6 (Hexanitrogen) Synthesized for the First Time - Twice As Energy Dense As TNT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T21:07:25.718176+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T19:55:00+00:00",
        "description": "IBM's legendary Model M keyboard was sturdy and solid. But \"What would happen if you took the classic layout and look of the Model M and rebuilt it with modern mechanical guts?\" asks long-time Slashdot reader uninet.\n\nWriting for the long-running tech blog Open for Business , they review a new wireless keyboard from Vortex that was clearly inspired by the Model M:\n\nThe result is a unique keyboard with one foot in two different decades... Let's call it the Vortex M for simplicity's sake. \n\nI first became aware of it on a Facebook ad and was immediately fascinated. It looked so close to the original Model M, I wondered if someone else had gotten access to an original mold and was trying Unicomp's game. No, they've just managed to copy the aesthetic to a nearly uncanny level... The Vortex M eschews the normal eye candy we expect on modern keyboards and attempts the closest duplication of IBM's staid early PC design sensibility I can imagine. Off-white, rugged and absolutely no frills of ",
        "id": 3243707,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/03/1953207/vortexs-wireless-take-on-the-model-m-keyboard-cover-band-or-new-legend?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Vortex's Wireless Take On the Model M Keyboard: Cover Band Or New Legend?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T18:57:02.400289+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T18:38:00+00:00",
        "description": "America's nonprofit College Board lets high school students take college-level classes &mdash; including a computer programming course that culminates with a 90-minute test. But students did better on questions about If-Then statements than they did on questions about arrays, according to the head of the program. Long-time Slashdot reader theodp explains:\nStudents exhibited \"strong performance on primitive types, Boolean expressions, and If statements; 44% of students earned 7-8 of these 8 points,\" says program head Trevor Packard. But students were challenged by \"questions on Arrays, ArrayLists, and 2D Arrays; 17% of students earned 11-12 of these 12 points.\" \n\n\"The most challenging AP Computer Science A free-response question was #4, the 2D array number puzzle; 19% of students earned 8-9 of the 9 points possible.\" \nYou can see that question here. (\"You will write the constructor and one method of the SumOrSameGame class... Array elements are initialized with random integers between ",
        "id": 3243048,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/03/0351204/the-toughest-programming-question-for-high-school-students-on-this-years-cs-exam-arrays?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Toughest Programming Question for High School Students on This Year's CS Exam:  Arrays",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T16:47:08.750706+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T16:34:00+00:00",
        "description": "The Chinese government \"has embarked on an all-out drive to transform the technology from a remote concept to a newfangled reality, with applications on factory floors and in hospitals and government offices...\" reports the Washington Post. \n\n\"[E]xperts say Beijing is pursuing an alternative playbook in an attempt to bridge the gap\" with America: \"aggressively pushing for the adoption of AI across the government and private sector.\"\n\nDeepSeek has been put to work over the last six months on a wide variety of government tasks. Procurement documents show military hospitals in Shaanxi and Guangxi provinces specifically requesting DeepSeek to build online consultation and health record systems. Local government websites describe state organs using DeepSeek for things like diverting calls from the public and streamlining police work. DeepSeek helps \"quickly discover case clues and predict crime trends,\" which \"greatly improves the accuracy and timeliness of crime fighting,\" a city governme",
        "id": 3242410,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/02/0243223/chinas-government-pushes-real-world-ai-use-to-jumpstart-its-adoption?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's Government Pushes Real-World AI Use to Jumpstart Its Adoption",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T15:40:59.399170+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T15:34:00+00:00",
        "description": "Microsoft's AI coding assistant \"GitHub Copilot\" has now had 20 million \"all-time users,\" a GitHub spokesperson told TechCrunch.\n\n\nThat means 5 million people have tried out GitHub Copilot for the first time in the last three months &mdash; the company reported in April the tool had reached 15 million users. \nMicrosoft and GitHub don't report how many of these 20 million people have continued to use the AI coding tool on a monthly or daily basis &mdash; though those metrics are likely far lower. \nMicrosoft also reported that GitHub Copilot, which is among the most popular AI coding tools offered today, is used by 90% of the Fortune 100. The product's growth among enterprise customers has also grown about 75% compared to last quarter, according to the company... In 2024, Nadella said GitHub Copilot was a larger business than all of GitHub was when Microsoft acquired it in 2018. In the year since, it seems GitHub Copilot's growth rate has continued in a positive direction.<p><div class=",
        "id": 3242047,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/03/037202/5-million-people-tried-microsofts-ai-coding-tool-github-copilot-in-the-last-3-months?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "5 Million People Tried Microsoft's AI Coding Tool 'GitHub Copilot' in the Last 3 Months",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T15:40:59.526044+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T14:34:00+00:00",
        "description": "An anonymous reader shared this report from Engadget:\n\n\nNintendo sold 5.82 million Switch 2s in less than four weeks and is on pace to hit its target of 15 million units by April 2026, the company said in its latest earnings report. If that pans out, the Switch 2 would easily outsell the original Switch, which took a full year to hit that same 15 million sales number... \n\nDespite those superb sales figures, Nintendo says demand is outstripping supply in many regions and promises to boost production as soon as possible. There's some insight into Nintendo's available inventory elsewhere in the earnings report. The 5.82 million number counts sales up to June 30, and the company says that as of July 25, it had sold through \"more than 6 million\" consoles. That's not the clearest figure, but it definitely shows sales cratered in July despite consistent demand. \nSwitch 2 software sales were also strong with 8.67 million units sold...\n \n\n\"Nintendo had a very good quarter, more than doubling r",
        "id": 3242048,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/03/0357231/nintendo-has-sold-over-6-million-switch-2s-but-still-cant-keep-up-with-demand?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nintendo Has Sold Over 6 Million Switch 2s, But Still Can't Keep Up With Demand",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T12:27:09.090187+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T11:34:00+00:00",
        "description": "\"Did Craigslist drive the downfall of print classifieds?\" That's the question asked in a new article from the nonprofit Poynter Institute for Media Studies:\n\n\"I've always wondered about that,\" Newmark said in a Zoom interview July 1. \"I think it had an effect.\" But portraying him and the list as torpedoing an otherwise great business model is way overblown, he still believes. Citing an influential essay by Thomas Baekdal, Newmark contends that the root of newspapers' trouble was the loss of readers. \"TV hit hard. ... (And) l'm like the folks on 'CSI,' I follow the evidence. That goes back at least to the '60s.\" \nBad in itself, the loss also took away newspapers' dominant share of local audiences and ability to charge premium classified ad rates. The slide in circulation looks even worse, Baekdal pointed out, when compared to continued increases in the number of households over the years. \nStill, Craigslist came to symbolize the shift. Dozens of other vertical digital sites cropped up,",
        "id": 3241006,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/03/0611232/did-craigslist-really-kill-the-newspaper-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Did Craigslist Really Kill the Newspaper Industry?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T08:07:28.702671+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T07:42:00+00:00",
        "description": "\"Digital storefront Itch.io is reindexing its free adult games,\" reports Engadget, \"and is talking to its partnered payment processors about plans to gradually reintroduce paid NSFW content...\"\nIn a statement included in the Itch.io update, Stripe said it hasn't closed the door on the possibility of being able to support adult content again in the future. In the meantime, Itch.io says it is talking to its other payment partners about accepting the card payments Stripe is currently no longer able to process. \n\nItch's founder told the gaming news site Aftermath that it was a notice from Visa that led to the sudden deindexing of so many games. But Aftermath notes that Visa and Mastercard have now \"both released statements effectively washing their hands of the situation but also, paradoxically, justifying any actions they might have taken.\" \n\n- Visa: \"When a legally operating merchant faces an elevated risk of illegal activity, we require enhanced safeguards for the banks supporting thos",
        "id": 3240004,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/03/0537212/itchio-starts-returning-the-free-games-it-removed-from-its-store?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Itch.Io Starts Returning the Free Games It Removed From Its Store",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T04:51:46.615833+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T04:49:00+00:00",
        "description": "Established in 1943 to coordinate America's building of the first atomic bomb, the Los Alamos National Lab in New Mexico is still \"one of the world's largest and most advanced scientific institutions\" notes Wikipedia. \n\nAnd it now has a \"National Security AI Office,\" where senior director Jason Pruet is working to help \"prepare for a future in which AI will reshape the landscape of science and security,\" according to the lab's science and technology magazine 1663. \"This year, the Lab invested more in AI-related work than at any point in history...\"\n Pruet: AI is starting to feel like the next great foundation for scientific progress. Big companies are spending billions on large machines, but the buy-in costs of working at the frontiers of AI are so high that no university has the exascale-class machines needed to run the latest AI models. We're at a place now where we, meaning the government, can revitalize that pact by investing in the infrastructure to study AI for the public good..",
        "id": 3239430,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/03/0447207/americas-los-alamos-lab-is-now-investing-heavily-in-ai-for-science?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America's Los Alamos Lab Is Now Investing Heavily In AI For Science",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T02:41:56.955389+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T01:43:00+00:00",
        "description": "It's a cultural milestone. Fiverr just released an ad mocking vibe coding. \nThe video features what its description calls a \"clueless entrepreneur\" building an app to tell if an avocado is ripe &mdash; who soon ends up blissfully singing with an avocado to the tune of the cheesy 1987 song \"Nothing's Gonna Stop Us Now.\" The avocado sings joyously of \"a new app on the rise in a no-code world that's too good to be true\" (rhyming that with \"So close. Just not tested through...\") \n\n\"Let them say we're crazy. I don't care about bugs!\" the entrepreneur sings back. \"Built you in a minute, now I'm so high off this buzz...\" \n\nBut despite her singing to the overripe avocado that \"I don't need a backend if I've got the spark!\" and that they can \"build this app together, vibe-coding forever. Nothing's going to stop us now!\" &mdash; the build suddenly fails. (And it turns out that avocado really was overripe...) Fiverr then suggests viewers instead hire one of their experts for building their apps.",
        "id": 3239090,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/03/0141234/fiverr-ad-mocks-vibe-coding---with-a-singing-overripe-avocado?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fiverr Ad Mocks Vibe Coding - with a Singing Overripe Avocado",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-03T01:37:05.196284+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-03T00:36:00+00:00",
        "description": "Remember, it's all synthesized \"anthropomorphizing\". But with that caveat, Science News reports:\nIn populations of simple software agents (like characters in \"The Sims\" but much, much simpler), having \"guilt\" can be a stable strategy that benefits them and increases cooperation, researchers report July 30 in Journal of the Royal Society Interface... When we harm someone, we often feel compelled to pay a penance, perhaps as a signal to others that we won't offend again. This drive for self-punishment can be called guilt, and it's how the researchers programmed it into their agents. The question was whether those that had it would be outcompeted by those that didn't, say Theodor Cimpeanu, a computer scientist at the University of Stirling in Scotland, and colleagues. \nScience News spoke to a game-theory lecturer from Australia who points out it's hard to map simulations to real-world situations &mdash; and that they end up embodying many assumptions. Here researchers were simulating The",
        "id": 3238888,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/02/1921226/would-ai-perform-better-if-we-simulated-guilt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Would AI Perform Better If We Simulated Guilt?",
        "vote": 0
    }
]