[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T23:02:22+00:00",
        "description": "To mark Microsoft's 50th anniversary, Bill Gates has released the original Altair BASIC source code he co-wrote with Paul Allen, calling it the \"coolest code\" he's ever written and a symbol of the company's humble beginnings. Thurrott reports: \"Before there was Office or Windows 95 or Xbox or AI, there was Altair BASIC,\" Bill Gates writes on his Gates Notes website. \"In 1975, Paul Allen and I created Microsoft because we believed in our vision of a computer on every desk and in every home. Five decades later, Microsoft continues to innovate new ways to make life easier and work more productive. Making it 50 years is a huge accomplishment, and we couldn't have done it without incredible leaders like Steve Ballmer and Satya Nadella, along with the many people who have worked at Microsoft over the years.\"\n \nToday, Gates says that the 50th anniversary of Microsoft is \"bittersweet,\" and that it feels like yesterday when he and Allen \"hunched over the PDP-10 in Harvard's computer lab, writ",
        "id": 2471103,
        "language": null,
        "link": "https://slashdot.org/story/25/04/02/2145238/bill-gates-celebrates-microsofts-50th-by-releasing-altair-basic-source-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bill Gates Celebrates Microsoft's 50th By Releasing Altair BASIC Source Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T21:56:36+00:00",
        "description": "Online scam operations across Southeast Asia are rapidly adapting to recent crackdowns, adopting AI and expanding globally despite the release of 7,000 trafficking victims from compounds along the Myanmar-Thailand border, experts say. These releases represent just a fraction of an estimated 100,000 people trapped in facilities run by criminal syndicates that rake in billions through investment schemes and romance scams targeting victims worldwide, CNN reports. \n\n\"Billions of dollars are being invested in these kinds of businesses,\" said Kannavee Suebsang, a Thai lawmaker leading efforts to free those held in scam centers. \"They will not stop.\" Crime groups are exploiting AI to write scamming scripts and using deepfakes to create personas, while networks have expanded to Africa, South Asia, and the Pacific region, according to the United Nations Office of Drugs and Crime. \"This is a situation the region has never faced before,\" said John Wojcik, a UN organized crime analyst. \"The evol",
        "id": 2470656,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/02/204208/global-scam-industry-evolving-at-unprecedented-scale-despite-recent-crackdown?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Global Scam Industry Evolving at 'Unprecedented Scale' Despite Recent Crackdown",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T21:56:36+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Europol has shut down one of the largest dark web pedophile networks in the world, prompting dozens of arrests worldwide and threatening that more are to follow. Launched in 2021, KidFlix allowed users to join for free to preview low-quality videos depicting child sex abuse materials (CSAM). To see higher-resolution videos, users had to earn credits by sending cryptocurrency payments, uploading CSAM, or \"verifying video titles and descriptions and assigning categories to videos.\"\n \nEuropol seized the servers and found a total of 91,000 unique videos depicting child abuse, \"many of which were previously unknown to law enforcement,\" the agency said in a press release. KidFlix going dark was the result of the biggest child sexual exploitation operation in Europol's history, the agency said. Operation Stream, as it was dubbed, was supported by law enforcement in more than 35 countries, including the United States. Nearly 1,400 suspec",
        "id": 2470655,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/02/2140214/vast-pedophile-network-shut-down-in-europols-largest-csam-operation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Vast Pedophile Network Shut Down In Europol's Largest CSAM Operation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T20:50:59+00:00",
        "description": "An AI system has for the first time figured out how to collect diamonds in the hugely popular video game Minecraft -- a difficult task requiring multiple steps -- without being shown how to play. Its creators say the system, called Dreamer, is a step towards machines that can generalize knowledge learned in one domain to new situations, a major goal of AI. From a report: \"Dreamer marks a significant step towards general AI systems,\" says Danijar Hafner, a computer scientist at Google DeepMind in San Francisco, California. \"It allows AI to understand its physical environment and also to self-improve over time, without a human having to tell it exactly what to do.\" Hafner and his colleagues describe Dreamer in a study in Nature published on 2 April. \n\nIn Minecraft, players explore a virtual 3D world containing a variety of terrains, including forests, mountains, deserts and swamps. Players use the world's resources to create objects, such as chests, fences and swords -- and collect ite",
        "id": 2470098,
        "language": null,
        "link": "https://slashdot.org/story/25/04/02/1829253/ai-masters-minecraft-deepmind-program-finds-diamonds-without-being-taught?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Masters Minecraft: DeepMind Program Finds Diamonds Without Being Taught",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T20:50:59+00:00",
        "description": "The FBI searched two homes of Indiana University Bloomington data privacy professor Xiaofeng Wang last week, following months of university inquiries into whether he received unreported research funding from China, WIRED reported Wednesday. \n\nWang, who leads the Center for Distributed Confidential Computing established with a $3 million National Science Foundation grant, was terminated on March 28 via email from the university provost. The university had contacted Wang in December regarding a 2017-2018 grant in China that listed him as a researcher, questioning whether he properly disclosed the funding to IU and in applications for U.S. federal research grants. \n\nJason Covert, Wang's attorney, said Wang and his wife Nianli Ma, whose employee profile was also removed, are \"safe\" and neither has been arrested. The couple's legal team has viewed a search warrant but received no affidavit establishing probable cause.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"s",
        "id": 2470097,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/02/1846224/cybersecurity-professor-faced-china-funding-inquiry-before-disappearing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cybersecurity Professor Faced China Funding Inquiry Before Disappearing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T20:50:59+00:00",
        "description": "The European Commission has announced its intention to join the ongoing debate about lawful access to data and end-to-end encryption while unveiling a new internal security strategy aimed to address ongoing threats. From a report: ProtectEU, as the strategy has been named, describes the general areas that the bloc's executive would like to address in the coming years although as a strategy it does not offer any detailed policy proposals. In what the Commission called \"a changed security environment and an evolving geopolitical landscape,\" it said Europe needed to \"review its approach to internal security.\" \n\nAmong its aims is establishing Europol as \"a truly operational police agency to reinforce support to Member States,\" something potentially comparable to the U.S. FBI, with a role \"in investigating cross-border, large-scale, and complex cases posing a serious threat to the internal security of the Union.\" Alongside the new Europol, the Commission said it would create roadmaps rega",
        "id": 2470095,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/02/1927259/european-commission-takes-aim-at-end-to-end-encryption-and-proposes-europol-become-an-eu-fbi?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "European Commission Takes Aim At End-to-End Encryption and Proposes Europol Become an EU FBI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T20:50:59+00:00",
        "description": "Microsoft is pushing businesses to shift away from perpetual Office licenses to Microsoft 365 subscriptions, citing collaboration limitations and rising IT costs associated with standalone software. \"You may have started noticing limitations,\" Microsoft says in a post. \"Your apps are stuck on your desktop, limiting productivity anytime you're away from your office. You can't easily access your files or collaborate when working remotely.\" \n\nIn its pitch, the Windows-maker says Microsoft 365 includes Office applications as well as security features, AI tools, and cloud storage. The post cites a Microsoft-commissioned Forrester study that claims the subscription model delivers \"223% ROI over three years, with a payback period of less than six months\" and \"over $500,000 in benefits over three years.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Urges+Businesses+To+Abandon+Office+Perpetual+Licenses%3A+https%",
        "id": 2470096,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/02/1941244/microsoft-urges-businesses-to-abandon-office-perpetual-licenses?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Urges Businesses To Abandon Office Perpetual Licenses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T17:20:41+00:00",
        "description": "Microsoft Chief Technology Officer Kevin Scott has predicted that AI will generate 95% of code within five years. Speaking on the 20VC podcast, Scott said AI would not replace software engineers but transform their role. \"It doesn't mean that the AI is doing the software engineering job.... authorship is still going to be human,\" Scott said. \n\nAccording to Scott, developers will shift from writing code directly to guiding AI through prompts and instructions. \"We go from being an input master (programming languages) to a prompt master (AI orchestrator),\" he said. Scott said the current AI systems have significant memory limitations, making them \"awfully transactional,\" but predicted improvements within the next year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=95%25+of+Code+Will+Be+AI-Generated+Within+Five+Years%2C+Microsoft+CTO+Says%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F04%2F02%2F1611229%2F%3Fu",
        "id": 2467424,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/04/02/1611229/95-of-code-will-be-ai-generated-within-five-years-microsoft-cto-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "95% of Code Will Be AI-Generated Within Five Years, Microsoft CTO Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T17:20:41+00:00",
        "description": "Newcomer: Keith O'Brien, the man who allegedly spied for Deel while working at Rippling, is apparently clearing his conscience, according to a sworn Irish affidavit. O'Brien says in the affidavit that Deel paid him to spy on Rippling and that he coordinated directly with Deel's CEO, Alex Bouaziz. \n\nFor some background, Alex Bouaziz is Deel's CEO and Philippe Bouaziz is his father, Deel's CFO. Rippling, which competes directly with Deel, has sued Deel over the alleged spying. O'Brien says in the affidavit: I decided to cooperate after I got a text from a friend on March 25, 2025 saying, \"the truth will set you free.\" I was also driving with a family member to meet my solicitors and she told me that if I had done something wrong that I should \"just tell the truth.\" I was having bad thoughts at the time; it was a horrible time for me. I was getting sick concealing this lie. I realised that I was harming myself and my family to protect Deel. I was concerned, and I am still concerned, abo",
        "id": 2467425,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/02/1517217/alleged-deel-spy-confesses-to-coordinating-with-deel-ceo-alex-bouaziz?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Alleged Deel Spy Confesses To Coordinating with Deel CEO Alex Bouaziz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T17:20:41+00:00",
        "description": "An anonymous reader shares a report: Amazon has put in a last-minute bid to acquire all of TikTok, the popular video app, as it approaches an April deadline to be separated from its Chinese owner or face a ban in the United States, according to three people familiar with the bid. \n\nVarious parties who have been involved in the talks do not appear to be taking Amazon's bid seriously, the people said. The bid came via an offer letter addressed to Vice President JD Vance and Howard Lutnick, the commerce secretary, according to a person briefed on the matter. Amazon's bid highlights the 11th-hour maneuvering in Washington over TikTok's ownership. Policymakers in both parties have expressed deep national security concerns over the app's Chinese ownership, and passed a law last year to force a sale of TikTok that was set to take effect in January.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Said+To+Make+a+Bid+T",
        "id": 2467423,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/02/1659237/amazon-said-to-make-a-bid-to-buy-tiktok-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Said To Make a Bid To Buy TikTok in the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T17:20:41+00:00",
        "description": "Representatives Alexandria Ocasio-Cortez and Anna Paulina Luna introduced bipartisan legislation in March to cap credit card interest rates at 10% annually as Americans' debt hits record levels. \"Credit cards with high interest rates regularly trap working people in endless cycles of debt,\" Ocasio-Cortez said in a statement. \n\nCredit card debt has reached $1.2 trillion in Q4 2024, up from $720 billion in the same quarter of 2004, according to Federal Reserve Bank of New York data. Average annual percentage rates nearly doubled to 21% in 2024 from 12% in 2003. The Federal Reserve Bank of Philadelphia reported a record number of cardholders making only minimum payments in Q3 2024, \"showing signs of consumer stress.\" \n\nFurther reading: Study Reveals Why Credit Card Interest Rates Remain Stubbornly High.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lawmakers+Propose+Cap+on+Credit+Card+Interest+Rates%3A+https%3A%2F%2F",
        "id": 2467426,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/02/1443242/lawmakers-propose-cap-on-credit-card-interest-rates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lawmakers Propose Cap on Credit Card Interest Rates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T17:20:41+00:00",
        "description": "Nintendo's Switch 2, priced at $450, launches June 5 with a 7.9-inch LCD screen offering 1080p resolution, HDR support, and 120Hz refresh capability. The device maintains the original Switch's 13.99mm thickness while increasing internal storage to 256GB from the previous 32GB. \n\nThe console outputs at 4K/60fps when docked, with the dock featuring a built-in cooling fan. Two USB-C ports handle accessories and charging. The system supports microSD Express cards but not original Switch microSD cards. Joy-Con controllers now attach via magnets instead of sliding rails and feature mouse-like functionality with compatible games. Both Joy-Cons and the new Pro Controller include a \"C\" button that activates a chat menu for the new \"Game Chat\" feature. \n\nGame cards for Switch 2 will be red rather than black. The system maintains backward compatibility with original Switch cartridges and introduces a \"Game Share\" feature for local game sharing between consoles.<p><div class=\"share_submission\" s",
        "id": 2467427,
        "language": null,
        "link": "https://games.slashdot.org/story/25/04/02/148251/nintendo-switch-2-arrives-on-june-5-priced-at-450?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nintendo Switch 2 Arrives on June 5, Priced at $450",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T17:20:41+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Zelle is shutting down its stand-alone app on Tuesday, according to a company blog post. This news might be alarming if you're one of the over 150 million customers in the U.S. who use Zelle for person-to-person payments. But only about 2% of transactions take place via Zelle's app, which is why the company is discontinuing its stand-alone app.\n \nMost consumers access Zelle via their bank, which then allows them to send money to their phone contacts. Zelle users who relied on the stand-alone app will have to re-enroll in the service through another financial institution. Given the small user base of the Zelle app, it makes sense why the company would decide to get rid of it -- maintaining an app takes time and money, especially one where people's financial information is involved.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Zelle+Is+Shutting+Down+Its+App%3A+ht",
        "id": 2467428,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/02/0654238/zelle-is-shutting-down-its-app?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Zelle Is Shutting Down Its App",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "Longtime Slashdot reader backslashdot writes: Commentary, video, and a publication in this week's Nature Neuroscience herald a significant advance in brain-computer interface (BCI) technology, enabling speech by decoding electrical activity in the brain's sensorimotor cortex in real-time. Researchers from UC Berkeley and UCSF employed deep learning recurrent neural network transducer models to decode neural signals in 80-millisecond intervals, generating fluent, intelligible speech tailored to each participant's pre-injury voice. Unlike earlier methods that synthesized speech only after a full sentence was completed, this system can detect and vocalize words within just three seconds. It is accomplished via a 253-electrode array chip implant on the brain. Code and the dataset to replicate the main findings of this study are available in the Chang Lab's public GitHub repository.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/ho",
        "id": 2465229,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/02/0641259/brain-interface-speaks-your-thoughts-in-near-real-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Brain Interface Speaks Your Thoughts In Near Real-time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "An anonymous reader quotes an op-ed from Ars Technica's Scharon Harding: TVs offer us an escape from the real world. After a long day, sometimes there's nothing more relaxing than turning on your TV, tuning into your favorite program, and unplugging from the realities around you. But what happens when divisive, potentially offensive messaging infiltrates that escape? Even with streaming services making it easy to watch TV commercial-free, it can still be difficult for TV viewers to avoid ads with these sorts of messages. That's especially the case with budget brands, which may even force controversial ads onto TVs when they're idle, making users pay for low-priced TVs in unexpected, and sometimes troubling, ways. [...]\n \nBuying a budget TV means accepting some trade-offs. Those trade-offs have historically been around things like image quality and feature sets. But companies like Vizio are also asking customers to accept questionable advertising decisions as they look to create new p",
        "id": 2465233,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/02/0220243/cheap-tvs-incessant-advertising-reaches-troubling-new-lows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cheap TVs' Incessant Advertising Reaches Troubling New Lows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "The James Webb Space Telescope has revealed that a surprising majority of galaxies rotate clockwise, challenging the long-held belief in a directionally uniform universe; this anomaly could suggest either our universe originated inside a rotating black hole or that astronomers have been misinterpreting the universe's expansion due to observational biases. Smithsonian Magazine reports: The problem is that astronomers have long posited that galaxies should be evenly split between rotating in one direction or the other, astronomer Dan Weisz from the University of California, Berkeley, who was not involved with the study, wrote for Astronomy back in 2017. \"This stems from the idea that we live in an 'isotropic' universe, which means that the universe looks roughly the same in every direction. By extension, galaxies shouldn't have a preferred direction of spin from our perspective,\" he added. According to Shamir, there are two strong potential explanations for this discrepancy. One explan",
        "id": 2465230,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/02/0651224/james-webb-space-telescope-reveals-that-most-galaxies-rotate-clockwise?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "James Webb Space Telescope Reveals That Most Galaxies Rotate Clockwise",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "With the signing of HB25-1040 on Monday, Colorado now defines nuclear as a \"clean energy resource\" since it doesn't release large amounts of climate-warming emissions. \"The category was previously reserved for renewables like wind, solar and geothermal, which don't carry the radioactive stigma that's hobbled fission power plants following disasters like Chernobyl and Fukushima,\" notes Colorado Public Radio. From the report: In an emailed statement, Ally Sullivan, a spokesperson for the governor's office, said the law doesn't advance any specific nuclear energy project, and no utility has proposed building a nuclear power plant in Colorado. It does, however, allow nuclear energy to potentially serve as one piece of the state's plan to tackle climate change. \"If nuclear energy becomes sufficiently cost-competitive, it could potentially become part of Colorado's clean energy future. However, it must be conducted safely, without harming communities, depleting other natural resources or r",
        "id": 2465234,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/02/027233/nuclear-is-now-clean-energy-in-colorado?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nuclear Is Now 'Clean Energy' In Colorado",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "A new paper [PDF] from the AI Disclosures Project claims OpenAI likely trained its GPT-4o model on paywalled O'Reilly Media books without a licensing agreement. The nonprofit organization, co-founded by O'Reilly Media CEO Tim O'Reilly himself, used a method called DE-COP to detect copyrighted content in language model training data. \n\nResearchers analyzed 13,962 paragraph excerpts from 34 O'Reilly books, finding that GPT-4o \"recognized\" significantly more paywalled content than older models like GPT-3.5 Turbo. The technique, also known as a \"membership inference attack,\" tests whether a model can reliably distinguish human-authored texts from paraphrased versions. \n\n\"GPT-4o [likely] recognizes, and so has prior knowledge of, many non-public O'Reilly books published prior to its training cutoff date,\" wrote the co-authors, which include O'Reilly, economist Ilan Strauss, and AI researcher Sruly Rosenblat.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" h",
        "id": 2465232,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/02/0440222/openai-accused-of-training-gpt-4o-on-unlicensed-oreilly-books?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Accused of Training GPT-4o on Unlicensed O'Reilly Books",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "Circle, the issuer of the USDC stablecoin, has filed for an IPO aiming for a $5 billion valuation. It marks the company's second attempt at going public amid renewed momentum in the crypto sector and signs of recovery in tech IPO markets. CNBC reports: A prior merger with a special purpose acquisition company (SPAC) collapsed in late 2022 amid regulatory challenges. Since then, Circle has made strategic moves to position itself closer to the heart of global finance, including the announcement last year that it would relocate its headquarters from Boston to One World Trade Center in New York.\n \nCircle reported $1.68 billion in revenue and reserve income in 2024, up from $1.45 billion in 2023 and $772 million in 2022. The company reported net income last year of about $156 million., down from $268 million a year earlier. A successful IPO would make Circle one of the most prominent pure-play crypto companies to list on a U.S. exchange. Coinbase went public through a direct listing in 20",
        "id": 2465236,
        "language": null,
        "link": "https://slashdot.org/story/25/04/01/2233251/stablecoin-issuer-circle-files-for-ipo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Stablecoin Issuer Circle Files For IPO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "Substack has announced it will legally support foreign writers lawfully residing in the U.S. who face government targeting over their published work, partnering with the nonprofit FIRE to expand its existing Defender program. The Verge reports: In their announcement, Substack and FIRE mention the international Tufts University student who was arrested by federal agents last week. Her legal team links her arrest to an opinion piece she co-wrote for the school's newspaper last year, which criticized Tufts for failing to comply with requests to divest from companies with connections to Israel. \"If true, this represents a chilling escalation in the government's effort to target critics of American foreign policy,\" Substack and FIRE write.\n \nThe initiative builds on Substack's Defender program, which already offers legal assistance for independent journalists and creators on the platform. The company says it has supported \"dozens\" of Substack writers facing claims of defamation and tradem",
        "id": 2465235,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/01/2239250/substack-says-itll-legally-defend-writers-targeted-by-the-government?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Substack Says It'll Legally Defend Writers 'Targeted By the Government'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "Tech manufacturers continue misleading consumers with impressive-sounding but less useful specs like milliamp-hours and megahertz, while hiding the one measurement that matters most: watts. The Verge argues that the watt provides the clearest picture of a device's true capabilities by showing how much power courses through chips and how quickly batteries drain. With elementary math, consumers could easily calculate battery life by dividing watt-hours by power consumption. The Verge: The Steam Deck gaming handheld is my go-to example of how handy watts can be. With a 15-watt maximum processor wattage and up to 9 watts of overhead for other components, a strenuous game drains its 49Wh battery in roughly two hours flat. My eight-year-old can do that math: 15 plus 9 is 24, and 24 times 2 is 48. You can fit two hour-long 24-watt sessions into 48Wh, and because you have 49Wh, you're almost sure to get it. \n\nWith the least strenuous games, I'll sometimes see my Steam Deck draining the batte",
        "id": 2465231,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/02/0449217/why-watts-should-replace-mah-as-essential-spec-for-mobile-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why Watts Should Replace mAh as Essential Spec for Mobile Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-02T12:04:16+00:00",
        "description": "MoffettNathanson has crowned YouTube the \"New King of All Media\" as the Alphabet-owned video platform has become a major force in Hollywood, dominating time spent watching TV. From a report: The firm estimates that YouTube as a standalone business could be worth as much as $550 billion -- or nearly 30% of the tech giant's current valuation. The figure is based on the firm's analysis of enterprise value as a multiple of revenue in 2024 for Netflix (10.5x revenue), Meta (8.8x), Roku (2.4x), Warner Bros. Discovery (1.4x), Fox (1.3x) and Disney (1.3x). \n\nIn 2024, YouTube was the second-largest media company by revenue at $54.2 billion, trailing behind only Disney. However, the MoffettNathanson analysts predict YouTube will take the top spot in 2025, becoming a leader in both engagement and revenue. \"YouTube has the potential to become the central aggregator for all things professional video, positioning itself to capture a share of the $85 billion consumer Pay TV market and the ~$30 bill",
        "id": 2465237,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/01/2040242/youtube-could-be-worth-550-billion-as-analyst-crowns-platform-new-king-of-all-media?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "YouTube Could Be Worth $550 Billion as Analyst Crowns Platform 'New King of All Media'",
        "vote": 0
    }
]