[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T16:25:57.231090+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T15:30:34+00:00",
        "description": "Despite its announcement in 2018, The Elder Scrolls 6 is still a long way off. Besides replaying Skyrim, what options are available for those who have finished Oblivion Remastered and seek another open-world fantasy action RPG to sink their teeth into?\n\nTainted Grail: The Fall of Avalon from Questline may be a good alternative. It's currently in early access on PC but exits on May 30th while also launching for Xbox Series X/S and PS5. Set in Awaken Realms' dark world based on Arthurian legend, it sees players traversing the island of Avalon while trying to survive against the Red Death and the Wyrdness.\n\nThough the game's current state is compelling enough, the promise of dozens of hours of gameplay, more than 75 dungeons, hundreds of weapons, and complete freedom to build your character is already very compelling. It may even make the wait for The Elder Scrolls 6 much easier.",
        "id": 2697194,
        "language": null,
        "link": "https://www.youtube.com/watch?v=sFrVyTzJdYs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sFrVyTzJdYs/hqdefault.jpg",
        "title": "Tainted Grail: The Fall of Avalon Might Make Your Wait For The Elder Scrolls 6 A Tad Easier",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T14:10:06.100290+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T13:30:51+00:00",
        "description": "The new triple-A Game of Thrones is finally here and … it’s a f2p mobile game? Well, kinda. Game of Thrones Kingsroad is developed by Netmarble and it is indeed built for mobile devices as well as PC. Though, it’s not quite the small-scale game you may be thinking it is. The game’s open-world is actually quite massive, spanning across all of Westeros with Unreal Engine 5 tech and impressive modern graphics.\n\nPerhaps even more impressive is the action combat. You can be one of three classes which have their own unique abilities and skills, all performed manually with dodges and blocking making up the combat loop. You can even animation cancel enemy attacks, making this more of an action game than many other mobile titles tend to be. \n\nGame of Thrones Kingsroad comes out of early access with its full release on May 21st for PC, Android, and IOS devices. Just be aware that as a free to play game, it has a lot of microtransactions and daily energy mechanics.",
        "id": 2695788,
        "language": null,
        "link": "https://www.youtube.com/watch?v=zEGsGLYSLJc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zEGsGLYSLJc/hqdefault.jpg",
        "title": "Game of Thrones: Kingsroad - 15 Things You NEED TO KNOW Before You Play",
        "vote": 0
    }
]