[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T23:09:07.928574+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T22:50:00+00:00",
        "description": "An anonymous reader quotes a report from Gizmodo: Apple's next step for CarPlay is a version you'll only get to try if you're a fan of luxury cruisers or a popular spy film franchise. CarPlay Ultra, with its new suite of exclusive features like custom gauges, is coming first to Aston Martin vehicles with the largest, most blaring dash screens. The more advanced version of CarPlay won't necessarily fix the lingering issues the software has with some modern vehicles. Segmenting CarPlay into newer and older systems may make things worse for those with aging cars. Apple's CarPlay Ultra includes a new kind of dashboard alongside real-time information that can include car diagnostics -- like tire pressure -- or dashboard gauges. You should be able to control temperature and other car-based features as well. The new version of the software includes options for dashboards or console screens, and it will work with on-screen controls, Siri, and \"physical buttons.\"\n \nCarPlay Ultra was supposed t",
        "id": 2700022,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/16/2111259/apples-new-carplay-ultra-wont-fix-the-biggest-problem-of-phone-connected-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple's New CarPlay 'Ultra' Won't Fix the Biggest Problem of Phone-Connected Cars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T23:09:08.089281+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T22:10:00+00:00",
        "description": "MIT has formally requested the withdrawal of a preprint paper on AI and scientific discovery due to serious concerns about the integrity and validity of its data and findings. It didn't provide specific details on what it believes is wrong with the paper. From a post: \"Earlier this year, the COD conducted a confidential internal review based upon allegations it received regarding certain aspects of this paper. While student privacy laws and MIT policy prohibit the disclosure of the outcome of this review, we are writing to inform you that MIT has no confidence in the provenance, reliability or validity of the data and has no confidence in the veracity of the research contained in the paper. Based upon this finding, we also believe that the inclusion of this paper in arXiv may violate arXiv's Code of Conduct.\n \n\"Our understanding is that only authors of papers appearing on arXiv can submit withdrawal requests. We have directed the author to submit such a request, but to date, the autho",
        "id": 2700023,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/16/213210/mit-asks-arxiv-to-take-down-preprint-paper-on-ai-and-scientific-discovery?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "MIT Asks arXiv To Take Down Preprint Paper On AI and Scientific Discovery",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T23:09:08.249232+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T21:30:00+00:00",
        "description": "OpenAI has launched Codex, a powerful AI coding agent in ChatGPT that autonomously handles tasks like writing features, fixing bugs, and testing code in a cloud-based environment. TechCrunch reports: Codex is powered by codex-1, a version of the company's o3 AI reasoning model optimized for software engineering tasks. OpenAI says codex-1 produces \"cleaner\" code than o3, adheres more precisely to instructions, and will iteratively run tests on its code until passing results are achieved.\n \nThe Codex agent runs in a sandboxed, virtual computer in the cloud. By connecting with GitHub, Codex's environment can come preloaded with your code repositories. OpenAI says the AI coding agent will take anywhere from one to 30 minutes to write simple features, fix bugs, answer questions about your codebase, and run tests, among other tasks. Codex can handle multiple software engineering tasks simultaneously, says OpenAI, and it doesn't limit users from accessing their computer and browser while it'",
        "id": 2700024,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/16/2052243/openai-launches-codex-an-ai-coding-agent-in-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Launches Codex, an AI Coding Agent, In ChatGPT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T23:09:08.363788+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T20:50:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Meta thinks there's no reason to carry on with its defense after the Federal Trade Commission closed its monopoly case, and the company has moved to end the trial early by claiming that the FTC utterly failed to prove its case. \"The FTC has no proof that Meta has monopoly power,\" Meta's motion for judgment (PDF) filed Thursday said, \"and therefore the court should rule in favor of Meta.\" According to Meta, the FTC failed to show evidence that \"the overall quality of Meta's apps has declined\" or that the company shows too many ads to users. Meta says that's \"fatal\" to the FTC's case that the company wielded monopoly power to pursue more ad revenue while degrading user experience over time (an Internet trend known as \"enshittification\"). And on top of allegedly showing no evidence of \"ad load, privacy, integrity, and features\" degradation on Meta apps, Meta argued there's no precedent for an antitrust claim rooted in this alleged ha",
        "id": 2700025,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/16/2047234/meta-argues-enshittification-isnt-real?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Argues Enshittification Isn't Real",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T20:58:46.943426+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T20:02:00+00:00",
        "description": "The Federal Communications Commission has approved Verizon's $9.6 billion acquisition of Frontier Communications, valuing the Dallas-based company at $20 billion including debt. The approval comes after Verizon agreed to scale back diversity initiatives to comply with Trump administration policies. \n\nFCC Chairman Brendan Carr, who previously threatened to block mergers over DEI practices, praised the deal for its potential to \"unleash billions in new infrastructure builds\" and \"accelerate the transition away from old, copper line networks to modern, high-speed ones.\" The acquisition positions America's largest phone carrier to expand its high-speed internet footprint across Frontier's 25-state network. Verizon plans to deploy fiber to more than one million U.S. homes annually following the transaction.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Verizon+Secures+FCC+Approval+for+%249.6+Billion+Frontier+Acquisition",
        "id": 2699287,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/05/16/194255/verizon-secures-fcc-approval-for-96-billion-frontier-acquisition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Verizon Secures FCC Approval for $9.6 Billion Frontier Acquisition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T19:54:16.398222+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T19:22:00+00:00",
        "description": "Charter Communications announced a $21.9 billion deal Friday to acquire Cox Communications, combining two major cable providers as they face mounting competition from wireless carriers offering 5G home internet. The transaction merges Charter's 31.4 million customers with Cox's 6.3 million, creating a larger entity to defend against aggressive expansion from Verizon and T-Mobile. \n\nCharter lost 60,000 internet customers in the March quarter, underscoring the industry's vulnerability as traditional cable broadband growth stalls. Wireless carriers have successfully marketed their fixed wireless access services at lower price points while delivering competitive speeds, turning what was once cable's most profitable segment into contested territory.\n\nThe combined company, which will be headquartered in Stamford, Connecticut, plans to adopt the Cox Communications name within a year of closing while retaining Spectrum as its consumer-facing brand.<p><div class=\"share_submission\" style=\"posit",
        "id": 2698848,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/16/1855254/charter-to-buy-cox-for-219-billion-amid-escalating-war-with-wireless?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Charter To Buy Cox For $21.9 Billion Amid Escalating War With Wireless",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T18:49:24.473487+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T18:42:00+00:00",
        "description": "Health authorities in densely-populated Hong Kong and Singapore have warned that Covid-19 cases are spiking, as a resurgent wave spreads through Asia. Bloomberg: The virus' activity in Hong Kong is now \"quite high,\" Albert Au, head of the Communicable Disease Branch of the city's Center for Health Protection, told local media this week. The percentage of respiratory samples testing Covid-positive in Hong Kong recently reached its highest in a year. \n\nSevere cases -- including deaths -- also reached its highest level in about a year to 31 in the week through May 3, the center's data shows. While the resurgence is yet to match the infection peaks seen in the past two years, rising viral load found in sewage water and Covid-related medical consultations and hospitalizations suggest the virus is actively spreading in the city of over 7 million people. \n\nRival financial hub Singapore is also on Covid alert. The city-state's health ministry released its first update on infection numbers in ",
        "id": 2698385,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/16/1728214/covid-19-spikes-in-hong-kong-singapore-as-new-wave-spreads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Covid-19 Spikes in Hong Kong, Singapore as New Wave Spreads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T18:49:24.631303+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T17:50:00+00:00",
        "description": "Boys and young men in the United States are experiencing declining outcomes in education, mental health, and transition to adulthood compared to their female counterparts, according to comprehensive data analyzed by researchers. High school graduation rates for boys stand at 83% versus 89% for girls, while college enrollment of recent male high school graduates has barely increased to 57% from 54% in 1960, compared to women's surge to 66% from 38% in the same period. \n\nMental health indicators show 28% of boys ages 3-17 have mental, emotional, behavioral or developmental problems versus 23% of girls. Male suicide rates for ages 15-24 have nearly doubled to 21 per 100,000 in 2023 from 11 in 1968. Labor force participation among men ages 25-54 has declined to 89% from 94% in 1975, while women's participation rose to 78% from 55%. Additionally, 19% of men ages 25-34 now live with parents, compared to 13% of women. \"The contemporary American economy is not rewarding a lot of the character",
        "id": 2698386,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/16/1746241/data-shows-boys-and-young-men-are-falling-behind?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Data Shows Boys and Young Men Are Falling Behind",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T17:44:13.590781+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T17:20:00+00:00",
        "description": "Apple and Epic Games sparred over whether the iPhone maker was obstructing access to the hit game Fortnite, the latest tussle in a long-running feud over Apple's control of game distribution revenue. From a report: The game developer said that Apple \"blocked\" its latest Fortnite app submission so that it can't be released in the US or on the third-party Epic Games Store in the EU. \n\n\"Now, sadly, Fortnite on iOS will be offline worldwide until Apple unblocks it,\" the company wrote on its X account. An Apple spokesperson responded later on Friday, saying that the company \"did not take any action to remove the live version of Fortnite from alternative distribution marketplaces\" in the EU. Apple said that it asked the game company's European division, Epic Sweden, to \"resubmit the app update without including the US storefront of the App Store so as not to impact Fortnite in other geographies.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://tw",
        "id": 2697854,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/16/175234/apple-denies-blocking-fortnite-from-eu-stores-in-epic-dispute?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Denies Blocking 'Fortnite' From EU Stores in Epic Dispute",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T17:44:13.702799+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T16:40:00+00:00",
        "description": "MIT said Friday it can no longer stand behind a widely circulated paper on AI written by a doctoral student in its economics program. The paper said that the introduction of an AI tool in a materials-science lab led to gains in new discoveries, but had more ambiguous effects on the scientists who used it. WSJ: MIT didn't name the student in its statement Friday, but it did name the paper. That paper, by Aidan Toner-Rodgers, was covered by The Wall Street Journal and other media outlets. In a press release, MIT said it \"has no confidence in the provenance, reliability or validity of the data and has no confidence in the veracity of the research contained in the paper.\" \n\nThe university said the author of the paper is no longer at MIT. The paper said that after an AI tool was implemented at a large materials-science lab, researchers discovered significantly more materials -- a result that suggested that, in certain settings, AI could substantially improve worker productivity. But it als",
        "id": 2697855,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/16/1640206/mit-says-it-no-longer-stands-behind-students-ai-research-paper?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "MIT Says It No Longer Stands Behind Student's AI Research Paper",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T16:38:45.388895+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T16:00:00+00:00",
        "description": "Early adopters of Apple's $3,500 Vision Pro mixed-reality headset report widespread disappointment a year after its February 2024 launch, with many devices now unused due to physical discomfort and social awkwardness, according to customers who spoke with WSJ. \n\n\"It's just collecting dust,\" said Dustin Fox, a Virginia realtor who has used his headset only four times in the past year. \"It's way too heavy. I can't wear it for more than 20 or 30 minutes without it hurting my neck.\" Customers told the paper that the device's one-pound weight causes neck strain. The device is also reeling from limited app selection and negative public reactions as primary complaints.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Vision+Pro+Owners+Face+Weight+of+Buyer's+Remorse%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F05%2F16%2F1357258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_ico",
        "id": 2697383,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/16/1357258/vision-pro-owners-face-weight-of-buyers-remorse?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Vision Pro Owners Face Weight of Buyer's Remorse",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T15:30:20.639728+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T15:20:00+00:00",
        "description": "Broadcom employees have had their personal data compromised following a September 2024 ransomware attack on Business Systems House (BSH), a Middle Eastern subsidiary of payroll company ADP. \n\nThe breach, claimed by the Russian-speaking El Dorado ransomware group, wasn't fully identified until December when stolen data appeared online, according to The Register. Broadcom only received details of affected employees on May 12, 2025. Compromised information potentially includes national ID numbers, financial account numbers, health insurance details, dates of birth, salary information, and contact details. \n\nFive employee accounts were initially compromised, ultimately affecting 560 users. ADP has distanced itself from the incident, stating only \"a small subset of ADP clients\" in \"certain countries in the Middle East\" were affected.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Broadcom+Employee+Data+Stolen+By+Ransomwa",
        "id": 2696738,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/16/1422227/broadcom-employee-data-stolen-by-ransomware-crooks-following-hit-on-payroll-provider?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Broadcom Employee Data Stolen By Ransomware Crooks Following Hit on Payroll Provider",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T15:30:20.814456+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T14:40:00+00:00",
        "description": "Montana has enacted SB 282, becoming the first state to prohibit law enforcement from purchasing personal data they would otherwise need a warrant to obtain. The landmark legislation closes what privacy advocates call the \"data broker loophole,\" which previously allowed police to buy geolocation data, electronic communications, and other sensitive information from third-party vendors without judicial oversight. \n\nThe new law specifically restricts government access to precise geolocation data, communications content, electronic funds transfers, and \"sensitive data\" including health status, religious affiliation, and biometric information. Police can still access this information through traditional means: warrants, investigative subpoenas, or device owner consent.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Montana+Becomes+First+State+To+Close+the+Law+Enforcement+Data+Broker+Loophole%3A+https%3A%2F%2Fnews.slashdo",
        "id": 2696739,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/16/0711214/montana-becomes-first-state-to-close-the-law-enforcement-data-broker-loophole?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Montana Becomes First State To Close the Law Enforcement Data Broker Loophole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T14:22:43.308835+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T14:00:00+00:00",
        "description": "For the first time, the growth in China's clean power generation has caused the nation's carbon dioxide emissions to fall despite rapid power demand growth. From a report:The new analysis for Carbon Brief shows that China's emissions were down 1.6% year-on-year in the first quarter of 2025 and by 1% in the latest 12 months. Electricity supply from new wind, solar and nuclear capacity was enough to cut coal-power output even as demand surged, whereas previous falls were due to weak growth. \n\nThe analysis, based on official figures and commercial data, shows that China's CO2 emissions have now been stable, or falling, for more than a year. However, they remain only 1% below the latest peak, implying that any short-term jump could cause China's CO2 emissions to rise to a new record.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Clean+Energy+Just+Put+China's+CO2+Emissions+Into+Reverse+For+First+Time%3A+https%3A%2F%2Fne",
        "id": 2696084,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/16/052233/clean-energy-just-put-chinas-co2-emissions-into-reverse-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Clean Energy Just Put China's CO2 Emissions Into Reverse For First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T14:22:43.477763+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Patently Apple: It's being reported in the Gulf region that a new 5GW UAE-US AI Campus in Abu Dhabi was unveiled on Thursday at Qasr Al Watan in the presence of President His Highness Sheikh Mohamed bin Zayed Al Nahyan and US. President Donald Trump, who is on a state visit to the UAE. The new AI campus -- the largest of its kind outside the United States -- will host US hyperscalers and large enterprises, enabling them to leverage regional compute resources with the capability to serve the Global South. The UAE-US AI Campus will feature 5GW of capacity for AI data centers in Abu Dhabi, offering a regional platform through which US hyperscalers can provide low-latency services to nearly half of the global population.\n \nUpon completion, the facility will utilize nuclear, solar, and gas power to minimize carbon emissions. It will also house a science park focused on advancing innovation in artificial intelligence. The campus will be built by G42 ",
        "id": 2696085,
        "language": null,
        "link": "https://slashdot.org/story/25/05/15/2333259/us-uae-unveil-plan-for-new-5gw-ai-campus-in-abu-dhabi?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US, UAE Unveil Plan For New 5GW AI Campus In Abu Dhabi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T10:26:41.754098+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T10:00:00+00:00",
        "description": "China launched 12 satellites on Wednesday as part of the &#226;oeThree-Body Computing Constellation,&#226; the world&#226;(TM)s first dedicated orbital computing network led by ADA Space and Zhejiang Lab. SpaceNews reports: A Long March 2D rocket lifted off at 12:12 a.m. Eastern (0412 UTC) May 14 from Jiuquan Satellite Launch Center in northwest China. Insulation tiles fell away from the payload fairing as the rocket climbed into a clear blue sky above the spaceport. The China Aerospace Science and Technology Corporation (CASC) announced a fully successful launch, revealing the mission to have sent 12 satellites for a space computing constellation into orbit. Commercial company ADA Space released further details, stating that the 12 satellites form the \"Three-Body Computing Constellation,\" which will directly process data in space, rather than on the ground, reducing reliance on ground-based computing infrastructure. The constellation will be capable of a combined 5 peta operations pe",
        "id": 2694290,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/15/2326249/china-launches-first-of-2800-satellites-for-ai-space-computing-constellation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Launches First of 2,800 Satellites For AI Space Computing Constellation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T07:56:47.210098+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T07:00:00+00:00",
        "description": "Dartmouth researchers propose that dark matter originated from massless, light-like particles in the early universe that rapidly condensed into massive particles through a spin-based interaction. Phys.Org reports: [T]he study authors write that their theory is distinct because it can be tested using existing observational data. The extremely low-energy particles they suggest make up dark matter would have a unique signature on the cosmic microwave background, or CMB, the leftover radiation from the Big Bang that fills all of the universe. \"Dark matter started its life as near-massless relativistic particles, almost like light,\" says Robert Caldwell, a professor of physics and astronomy and the paper's senior author. \"That's totally antithetical to what dark matter is thought to be -- it is cold lumps that give galaxies their mass,\" Caldwell says. \"Our theory tries to explain how it went from being light to being lumps.\"\n \nHot, fast-moving particles dominated the cosmos after the burst",
        "id": 2693422,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/15/2311254/dark-matter-formed-when-fast-particles-slowed-down-and-got-heavy-new-theory-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dark Matter Formed When Fast Particles Slowed Down and Got Heavy, New Theory Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T05:46:47.007208+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T05:00:00+00:00",
        "description": "A Northeastern University student demanded her tuition money back after discovering her business professor was secretly using AI to create course materials. Ella Stapleton, who graduated this year, grew suspicious when she noticed telltale signs of AI generation in her professor's lecture notes, including a stray ChatGPT citation in the bibliography, recurring typos matching machine outputs, and images showing figures with extra limbs. \n\n\"He's telling us not to use it, and then he's using it himself,\" Stapleton told the New York Times. After filing a formal complaint with Northeastern's business school, Stapleton requested a tuition refund of about $8,000 for the course. The university ultimately rejected her claim. Professor Rick Arrowood acknowledged using ChatGPT, Perplexity AI, and presentation generator Gamma. \"In hindsight, I wish I would have looked at it more closely,\" he said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter",
        "id": 2692884,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/15/2335227/student-demands-tuition-refund-after-catching-professor-using-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Student Demands Tuition Refund After Catching Professor Using ChatGPT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T03:36:49.183201+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T03:30:00+00:00",
        "description": "An anonymous reader shares an opinion piece from The Guardian, written by columnist Emma Brockes: Mark Zuckerberg has gone on a promotional tour to talk up the potential of AI in human relationships. I know; listening to Zuck on friendship is a bit like taking business advice from Bernie Madoff or lessons in sportsmanship from Tonya Harding. But at recent tech conferences and on podcasts, Zuck has been saying he has seen the future and it's one in which the world's \"loneliness epidemic\" is alleviated by people finding friendship with \"a system that knows them well and that kind of understands them in the way that their feed algorithms do.\" In essence, we'll be friends with AI, instead of people. The missing air quotes around \"knows\" and \"understands\" is a distinction we can assume Zuck neither knows nor understands.\n \nThis push by the 41-year-old tech leader would be less startling if it weren't for the fact that semi-regularly online now you can find people writing about their relati",
        "id": 2692380,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/15/2056257/do-you-trust-mark-zuckerberg-to-solve-your-loneliness-with-an-ai-friend?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Do You Trust Mark Zuckerberg To Solve Your Loneliness With an 'AI Friend'?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T02:27:08.992636+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T01:25:00+00:00",
        "description": "YouTube has suspended ad revenue for two additional channels -- Screen Trailers and Royal Trailer -- as part of an ongoing effort to combat fake movie trailers using AI-generated content. These channels, alternative accounts of previously demonetized Screen Culture and KH Studio, splice actual movie footage with AI-generated material, often accumulating millions of views. \n\nThe action follows a recent Deadline investigation revealing Hollywood studios had requested YouTube redirect revenue from these misleading videos. Despite losing monetization, Screen Culture, which has 1.42 million subscribers, continues uploading content including a recent \"Trailer 2 concept\" for James Gunn's upcoming Superman film.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+Crackdowns+on+AI-Generated+Fake+Movie+Trailers%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F05%2F15%2F2317224%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwit",
        "id": 2692151,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/15/2317224/youtube-crackdowns-on-ai-generated-fake-movie-trailers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "YouTube Crackdowns on AI-Generated Fake Movie Trailers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T01:22:04.825718+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T00:41:00+00:00",
        "description": "Epic Games CEO Tim Sweeney said Thursday that Apple has \"neither accepted nor rejected\" Fortnite's second App Store submission, potentially delaying the game's major update planned for Friday. \n\nEpic initially submitted Fortnite on May 9 following Judge Yvonne Gonzalez Rogers' order for Apple to comply with the original 2021 injunction. After five days without response, Epic withdrew and resubmitted to accommodate the upcoming update. While Apple's guidelines state 90% of submissions are reviewed within 24 hours, this silence is unprecedented. \n\nThe legal context remains complex -- the judge's original ruling didn't require Apple to reinstate Fortnite, as she determined Epic had willingly violated agreed-upon rules. Meanwhile, Sweeney is actively pointing out on X that Fortnite knock-offs are flooding the App Store.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Keeps+Fortnite+in+App+Store+Limbo%3A+https%3A%2F",
        "id": 2691960,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/15/2327216/apple-keeps-fortnite-in-app-store-limbo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Keeps Fortnite in App Store Limbo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-16T00:17:05.285383+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-16T00:02:00+00:00",
        "description": "The FBI has issued a warning that cybercriminals have started using AI-generated voice deepfakes in phishing attacks impersonating senior U.S. officials. These attacks, involving smishing and vishing tactics, aim to compromise personal accounts and contacts for further social engineering and financial fraud. BleepingComputer reports: \"Since April 2025, malicious actors have impersonated senior U.S. officials to target individuals, many of whom are current or former senior U.S. federal or state government officials and their contacts. If you receive a message claiming to be from a senior U.S. official, do not assume it is authentic,\" the FBI warned. \"The malicious actors have sent text messages and AI-generated voice messages -- techniques known as smishing and vishing, respectively -- that claim to come from a senior U.S. official in an effort to establish rapport before gaining access to personal accounts.\"\n \nThe attackers can gain access to the accounts of U.S. officials by sending ",
        "id": 2691678,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/15/2138238/fbi-us-officials-targeted-in-voice-deepfake-attacks-since-april?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FBI: US Officials Targeted In Voice Deepfake Attacks Since April",
        "vote": 0
    }
]