[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T15:41:00.075740+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T15:30:00+00:00",
        "description": "From being a very ambitious and well-performing bit of tech for Konami and Kojima Productions to becoming nothing more than a fond memory of better times, all in the span of ten years, the Fox engine has had quite a run. \n\nAs the engine that powered one of the largest Metal Gear Solid titles in existence, and the driving force behind some excellent PES titles, it had a lot going for it. But factors beyond its control have driven it into obscurity in a situation where sticking with it simply wouldn't have worked out in Konami's favor. \n\nWe dive into a story we wish ended differently, and pay our respects to one of modern gaming's finest instances of innovation and ambition working in tandem to take a bold step into uncharted waters.",
        "id": 4375587,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=GmgfDX2mTCE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GmgfDX2mTCE/hqdefault.jpg",
        "title": "The Fox Engine Was Ahead of Its Time, So Why Was It Killed?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T10:27:54.690639+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T09:30:00+00:00",
        "description": "2025 has been a real delight for RPG fans, with a lot of great titles gracing the genre. Indeed, picking favorites from the ranks of such a solid lineup was quite the task, but we think our picks for the year's best RPGs might have you nodding in agreement for the most part. \n\nEach of these nominees has been an experience that stands out, with great stories, worlds, and mechanics to explore. But of course, there can be only one winner. And while our choice may not be too surprising considering how awesome the game in question is, there are some truly great titles for you to discover if you haven't already played them all.",
        "id": 4374040,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=3G9IluZdQss",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3G9IluZdQss/hqdefault.jpg",
        "title": "16 Most Addictive RPGs of 2025 You Need To Play",
        "vote": 0
    }
]