[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T23:25:42.582583+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T22:34:00+00:00",
        "description": "Long-time Slashdot reader destinyland wonders if \"gifts for geeks\" is the next big consumer demographic:\n\n\nFor this year's holiday celebrations, Hallmark made a special Christmas tree ornament, a tiny monitor displaying screens from the classic video game \"Oregon Trail.\" (\"Recall the fun of leading a team of oxen and a wagon loaded with provisions from Missouri to the West....\") Top sites and major brands are now targeting the \"tech\" demographic &mdash; including programmers, sysadmins and even vintage game enthusiasts &mdash; and when Hallmark and Amazon are chasing the same customers as GitHub and Copilot, you know there's been a strange yet meaningful shift in the culture... \n\nWhile AI was conquering the world, GitHub published its \"Ultimate gift guide for the developer in your life\" just as soon as doors opened on Black Friday. So if you're wondering, \"Should I push to production on New Year's Eve?\" GitHub recommends their new \"GitHub Copilot Amazeball,\" which it describes as \"Git",
        "id": 4377998,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/21/2134227/are-geek-gifts-becoming-their-own-demographic",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are 'Geek Gifts' Becoming Their Own Demographic?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T22:25:04.803427+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T21:34:00+00:00",
        "description": "\"On Saturday, videos shared widely on social media showed Waymo vehicles stopped mid-intersection with hazard lights flashing, forcing other cars to maneuver around them,\" reports the San Francisco Chronicle. \n\nThe Independent notes that \"Without working traffic lights, the driverless cars were seemingly left confused, with many halting in their tracks and causing major traffic jams. Local riders and pedestrians shared photos and videos of the vehicles stuck at intersections with long lines of drivers piling up behind them...\"\n\nIn some instances, several Waymos were piled up in front of a single intersection. \"6 Waymos parked at a broken traffic light blocking the roads. Seems like they were not trained for a power outage,\" another social media user wrote. \n\nMore from CNBC:\n\nSan Francisco resident Matt Schoolfield said he saw at least three Waymo autonomous vehicles stopped in traffic Saturday around 9:45 p.m. local time, including one he photographed near Arguello Boulevard and Geary",
        "id": 4377722,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/21/2048257/confused-waymos-stopped-in-intersections-during-san-francisco-power-outage",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Confused' Waymos Stopped in Intersections During San Francisco Power Outage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T21:23:25.075219+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T20:34:00+00:00",
        "description": "\"Perhaps no group of fans, industry workers, and consumers is more intense about AI use than gamers....\" writes New York magazine's \"Intelligencer\" column:\n\n\n\nJust this month, the latest Postal game was axed by its publisher, which was \"overwhelmed with negative responses\"\nfrom the \"concerned Postal community\" after fans spotted\nAI-generated material in the game's trailer. The developers of Arc\nRaiders were accused\nof using AI instead of voice actors, leading to calls for boycotts,\nwhile the developers of the Call of Duty franchise were\ncalled out for AI-generated assets that players found strewn across\nBlack Ops 7.Games that weren't developed with\ngenerative AI are getting caught\nup in accusations anyway, while workers at Electronic Arts are\ngoing\nto the press to describe pressure from bosses to adopt AI tools.\nNintendo has sworn off using generative AI, as has the company behind\nthe Cyberpunk series. Valve, the company that operates\nSteam, now requires AI disclosures on listed games",
        "id": 4377424,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/21/1945258/do-gamers-hate-ai-indie-game-awards-disqualifies-clair-obscur-over-genai-usage",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Do Gamers Hate AI? Indie Game Awards Disqualifies 'Clair Obscur' Over GenAI Usage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T20:17:33.535320+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T19:34:00+00:00",
        "description": "An anonymous reader shared this report from the site It's FOSS:\n\nLinux gives you plenty of ways to install software: native distro packages, Flatpak, Snap, AppImage, source builds, even curl-piped installers. The catch is that each one solves a different problem, yet none of them fully eliminates the \"works here, breaks there\" reality across all distros. Package Forge (PkgForge) is a new project with a narrower mission: deliver truly distro-independent portable applications that run the same way across systems.... \n\nIt's not a new packaging format in and of itself, nor is it trying to replace AppImages. Instead, it's an ecosystem that publishes portable packages and static binaries in curated repositories, paired with a package manager designed to install and manage them. One of the ways PkgForge stands out from some portable app efforts on Linux is its focus on accessible documentation and a security-minded distribution model. The project primarily delivers prebuilt binary packages, ",
        "id": 4377113,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/21/199237/package-forge-the-lesser-known-snapflatpak-alternative-without-distro-lock-in",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Package Forge: The Lesser Known Snap/Flatpak Alternative Without Distro Lock-In",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T19:16:27.844037+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T18:34:00+00:00",
        "description": "Long-time Slashdot reader theodp writes: Last September, tech-backed nonprofit Code.org pledged to engage 25 million K-12 schoolchildren in an \"Hour of AI\" this school year. Preliminary numbers released this week by the Code.org Advocacy Coalition showed that [halfway through the five-day event Computer Science Education Week] 13.1 million users had participated in the inaugural Hour of AI, attaining 52.4% of its goal of 25 million participants.\n\n In a pivot from coding to AI literacy, the Hour of AI replaced Code.org's hugely-popular Hour of Code this December as the flagship event of Computer Science Education Week (December 8-14). According to Code.org's 2024-25 Impact Report, \"in 2024&ndash;25 alone, students logged over 100 million Hours of Code, including more than 43 million in the four months leading up to and including CS Education Week.\" \n\nMinecraft participated with their own Hour of AI lessons. (\"Program an AI Agent to craft tools and build shelter before dusk falls in thi",
        "id": 4376825,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/21/1724209/inaugural-hour-of-ai-event-includes-minecraft-microsoft-google-and-131-million-k-12-schoolkids",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Inaugural 'Hour of AI' Event Includes Minecraft, Microsoft, Google and 13.1 Million K-12 Schoolkids",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T19:16:27.948914+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T17:34:00+00:00",
        "description": "What is the future of work? The Wall Street Journal asked five workplace experts and practitioners. \n\nSo while AI \"is already doing tasks once relegated to newly minted college graduates in many professions,\" the Journal predicts that in the next 20 years AI \"will have an impact on the role of managers, how organizations measure business outcomes and accelerate tasks that once took months.\" \n\nA senior partner at the consulting firm Mercer predicts AI (plus advances in quantum computing) will enable entrepreneurs to reshape industries with a fraction of the resources traditionally required. \n\nSome other predictions:\n Alan Guarino, vice chairman and CEO of board services at the global consulting firm Korn Ferry: In 25 years, the workplace will likely be unrecognizable, with employees and AI operating as one. Yes, there will be tasks and entire jobs taken over by AI, but we will all be elevated to a whole new superpower to make critical and creative decisions. The idea that work was once",
        "id": 4376826,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/21/0610253/will-work-change-over-the-next-20-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Will Work Change Over the Next 20 Years?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T19:16:28.076924+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T16:34:00+00:00",
        "description": "\"In the lead up to its Switch 2 console release, Nintendo updated its user agreement,\" writes the Free Software Foundation, warning that Nintendo now claims \"broad authority to make consoles owned by its customers permanently unusable.\" \n\n\n\"Under Nintendo's most aggressive digital restrictions management (DRM) update to date, game console owners are now required to give Nintendo the unilateral right to revoke access to games, security updates, and the Internet, at its sole discretion.\"\n\n\nThe new agreement states: \"You acknowledge that if you fail to comply with [Nintendo's restrictions], Nintendo may render the Nintendo Account Services and/or the applicable Nintendo device permanently unusable in whole or in part....\" \n\nThere are probably other reasons that Nintendo has and will justify bricking game consoles, but here are some that we have seen reported: \n &mdash; \"Tampering\" with hardware or software in pretty much any way; \n &mdash; Attempting to play a back-up game; \n &mdash; Pla",
        "id": 4376827,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/21/0020228/fsf-says-nintendos-new-drm-allows-them-to-remotely-render-users-device-permanently-unusuable",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FSF Says Nintendo's New DRM Allows Them to Remotely Render User's Device 'Permanently Unusuable'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T19:16:28.197489+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T15:34:00+00:00",
        "description": "An anonymous reader shared this report from CNBC:\n\n\nThe Trump administration on Monday unveiled a new initiative dubbed the \"U.S. Tech Force,\" comprising about 1,000 engineers and other specialists who will work on artificial intelligence infrastructure and other technology projects throughout the federal government. \n\n\nParticipants will commit to a two-year employment program working with teams that report directly to agency leaders in \"collaboration with leading technology companies,\" according to an official government website. [\"...and work closely with senior managers from companies partnering with the Tech Force.\"] Those \"private sector partners\" include Amazon Web Services, Apple, Google Public Sector, Dell Technologies, Microsoft, Nvidia, OpenAI, Oracle, Palantir, Salesforce and numerous others [including AMD, IBM, Coinbase, Robinhood, Uber, xAI, and Zoom], the website says. \n\nThe Tech Force shows the Trump administration increasing its focus on developing America's AI infrast",
        "id": 4376828,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/21/075239/trump-admin-to-hire-1000-for-new-tech-force-to-build-ai-infrastructure",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Admin to Hire 1,000 for New 'Tech Force' to Build AI Infrastructure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T19:16:28.303621+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T12:34:00+00:00",
        "description": "\"If I get to do another Avatar film, it'll be because the business model still works,\" James Cameron tells CNN in a video interview &mdash; adding \"That I can't guarantee, as I sit here today. That'll play out over the next month, really.\" He says theatre is a \"sacred space,\" and while it will never go away, \"I think that it could fall below a threshhold where the kinds of movies that I like to make and that I like to see... won't be sustainable, they won't be economically viable. And that can happen. We're very close to that right now.\" \n\n\nThe Wrap notes he filmed his new movie at the same time as its predecessor, The Way of Water.\"\n\n\"We did all the performance capture in an 18-month period for both films. Then we did a lot of the virtual camera work to figure out exactly how we were going to do the live-action,\" Cameron explained. \"Then we did all live-action together for both films. Then we split it and said, All right, now we just got to finish [movie] two.....\" While Cameron has ",
        "id": 4376829,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/21/0510249/while-releasing-avatar-3-james-cameron-questions-the-future-of-movies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "While Releasing 'Avatar 3', James Cameron Questions the Future of Movies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T19:16:28.428650+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T08:34:00+00:00",
        "description": "America's unemployment rate for tech jobs rose to 4% in November, and \"has been steadily rising since May,\" reports the Washington Post (citing data from the IT training/certifications company CompTIA).\n\n\n\nBetween October and November, the number of technology workers across different industries fell 134,000, while the number of people working in the tech industry declined by more than 6,800. Tech job postings were also down by more than 31,800, the report found, citing data from the Bureau of Labor Statistics and California-based market intelligence firm Lightcast. \"The data is pretty definitive that the tech industry is struggling,\" said Mark Zandi, Moody's chief economist. \"There's a jobs recession in the industry, and it feels like that's going to continue given the slide in postings....\" \n\nThe unemployment rate in the tech industry still sits below the national rate, which in November hit 4.6 percent, the highest since 2021. However, that gap has been narrowing, with tech unemplo",
        "id": 4376830,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/20/0512216/is-americas-tech-industry-already-facing-a-recession",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is America's Tech Industry Already Facing a Recession?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T19:16:28.526138+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T05:34:00+00:00",
        "description": "The team authoring the Rust 2025 Vision Doc interviewed Rust developers to find out what they liked about the language &mdash; and have now issued three recommendations \"to help Rust continue to scale across domains and usage levels.\" \n\n\n &mdash; Enumerate and describe Rust's design goals and integrate them into our processes, helping to ensure they are observed by future language designers and the broader ecosystem. \n &mdash; Double down on extensibility, introducing the ability for crates to influence the develop experience and the compilation pipeline. \n &mdash; Help users to navigate the crates.io ecosystem and enable smoother interop \n\n\nThe real \"empowering magic\" of Rust arises from achieving a number of different attributes all at once &mdash; reliability, efficiency, low-level control, supportiveness, and so forth. It would be valuable to have a canonical list of those values that we could collectively refer to as a community and that we could use when evaluating RFCs or other",
        "id": 4376831,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/21/0341243/rusts-vision-doc-makes-recommendations-to-help-keep-rust-growing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rust's 'Vision Doc' Makes  Recommendations to Help Keep Rust Growing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-21T02:41:32.261391+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-21T02:02:00+00:00",
        "description": "Archive.org now has a page with \"the raw analog waveform and the reconstructed digital tape image (analog.tap), read at the Computer History Museum's Shustek Research Archives on 19 December 2025 by Al Kossow using a modified tape reader and analyzed with Len Shustek's readtape tool.\" A Berlin-based retrocomputing enthusiast has created a page with the contents of the tape ready for bootstrapping, \"including a tar file of the filesystem,\" and instructions on dumping an RK05 disk image from tape to disk (and what to do next). \n\n\nResearch professor Rob Ricci at the University of Utah's school of computing posted pictures and video of the tape-reading process, along with several updates. (\"So far some of our folks think they have found Hunt The Wumpus and the C code for a Snobol interpreter.\")\nUniversity researcher Mike Hibler noted the code predates the famous comment \"You are not expected to understand this\" &mdash; and found part of the C compiler with a copyright of 1972. \n\n\n\nThe ver",
        "id": 4372680,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/21/020235/bell-labs-unix-tape-from-1974-successfully-dumped-to-a-tarball",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bell Labs 'Unix' Tape from 1974 Successfully Dumped to a Tarball",
        "vote": 0
    }
]