[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T23:17:34+00:00",
        "description": "The U.S. has added 80 entities to its export blacklist to prevent China from acquiring advanced American chips for military development, including AI, quantum tech, and hypersonic weapons. The Verge reports: More than 50 of the new entities added to the list are based in China, with others located in Iran, Taiwan, Pakistan, South Africa, and the United Arab Emirates. BIS says the restrictions have been applied to entities that acted \"contrary to US national security and foreign policy,\" and are intended to hinder China's ability to develop high-performance computing capabilities, quantum technologies, advanced artificial intelligence, and hypersonic weapons.\n \nSix of the newly blacklisted entities are subsidiaries of Inspur Group -- China's leading cloud computing service provider and a major customer for US chip makers such as Nvidia, AMD, and Intel -- which BIS alleges had contributed to projects developing supercomputers for the Chinese military. The Beijing Academy of Artificial ",
        "id": 2416992,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/26/2053233/us-expands-export-blacklist-to-keep-computing-tech-out-of-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Expands Export Blacklist To Keep Computing Tech Out of China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T22:13:13+00:00",
        "description": "An anonymous reader shares a report: After years of decline, the number of applications to the country's two-year MBA programs rebounded in 2024 -- rising 19%, according to a survey by the Graduate Management Admission Council. The pandemic saw a blossoming of new ways to deliver an MBA, but tradition has reasserted itself: The biggest growth last year was in conventional two-year and part-time programs. \n\nAs in recent years, the great majority of student demand came from overseas, but applications from the US rose as well. While the two-year class graduating this spring included record levels of international students at many institutions, most of the top 20 schools as ranked by Bloomberg Businessweek welcomed classes last fall with a reduced international presence. Given the Trump administration's hostility to immigration, the graduating class of 2025 could prove to be the high-water mark for international MBA students in the US for at least the near future.<p><div class=\"share_sub",
        "id": 2416605,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/26/2035210/business-schools-are-back?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Business Schools Are Back",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T22:13:13+00:00",
        "description": "VMware has sued industrial giant AG Siemens's US operations for alleged use of unlicensed software and accused it of changing its story negotiations. From a report: The case was filed last Friday in the US District Court for the District Delaware. VMware's complaint [PDF] alleges that Siemens AG's US operations used more VMware software that it had licensed. Siemens's use of VMware became contentious when it tried to arrange extended support for some products. \n\nOn September 9, 2024, Siemens apparently produced a list of the VMware software it used and \"demanded that VMware accept a purchase order to provide maintenance and support services for the listed products.\" The complaint states that list mentioned VMware deployments that \"far exceeded the number of licenses it [Siemens] had actually purchased.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=VMware+Sues+Siemens+For+Allegedly+Using+Unlicensed+Software%3A+htt",
        "id": 2416606,
        "language": null,
        "link": "https://slashdot.org/story/25/03/26/2030219/vmware-sues-siemens-for-allegedly-using-unlicensed-software?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "VMware Sues Siemens For Allegedly Using Unlicensed Software",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T21:08:02+00:00",
        "description": "Computer maker Dell's staff numbers have fallen by 25,000 in the last two years. In its latest 10-K filing, published on Tuesday, the company said that it had about 108,000 global employees as of January 31, 2025. In February 2024, that number was 120,000, marking a 10% annual reduction in the workforce. From a report: Looking back two years, Dell's head count stood at 133,000, meaning that since February 2023, the Texas-based tech company has reduced its workforce by 19%. The decline in Dell's head count comes after a year of both layoffs and RTO mandates. In August, the company significantly restructured its sales division, which it told workers was necessary to prepare for \"the world of AI.\" As part of the restructuring, Dell laid off workers, though it did not specify how many.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Dell's+Staff+Numbers+Have+Dropped+By+25%2C000+in+Just+2+Years%3A+https%3A%2F%2Fslashdot.",
        "id": 2416200,
        "language": null,
        "link": "https://slashdot.org/story/25/03/26/2014204/dells-staff-numbers-have-dropped-by-25000-in-just-2-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dell's Staff Numbers Have Dropped By 25,000 in Just 2 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T21:08:02+00:00",
        "description": "An anonymous reader quotes a report from Android Authority: No matter the manufacturer, every Android phone has one thing in common: its software base. Manufacturers can heavily customize the look and feel of the Android OS they ship on their Android devices, but under the hood, the core system functionality is derived from the same open-source foundation: the Android Open Source Project. After over 16 years, Google is making big changes to how it develops the open source version of Android in an effort to streamline its development. [...] Beginning next week, all Android development will occur within Google's internal branches, and the source code for changes will only be released when Google publishes a new branch containing those changes. As this is already the practice for most Android component changes, Google is simply consolidating its development efforts into a single branch.\n \nThis change will have minimal impact on regular users. While it streamlines Android OS development ",
        "id": 2416199,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/26/2017227/google-will-develop-the-android-os-fully-in-private?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Will Develop the Android OS Fully In Private",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T18:57:54+00:00",
        "description": "Microsoft has walked away from new data center projects in the US and Europe that would have amounted to a capacity of about 2 gigawatts of electricity, according to TD Cowen analysts, who attributed the pullback to an oversupply of the clusters of computers that power artificial intelligence. From a report: The analysts, who rattled investors with a February note highlighting leases Microsoft had abandoned in the US, said the latest move also reflected the company's choice to forgo some new business from ChatGPT maker OpenAI, which it has backed with some $13 billion. Microsoft and the startup earlier this year said they had altered their multiyear agreement, letting OpenAI use cloud-computing services from other companies, provided Microsoft didn't want the business itself. \n\nMicrosoft's retrenchment in the last six months included lease cancellations and deferrals, the TD Cowen analysts said in their latest research note, dated Wednesday. Alphabet's Google had stepped in to grab s",
        "id": 2415147,
        "language": null,
        "link": "https://slashdot.org/story/25/03/26/1832216/microsoft-abandons-data-center-projects-td-cowen-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Abandons Data Center Projects, TD Cowen Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T17:52:58+00:00",
        "description": "Here's one more reason to cling to a steady job: It doesn't pay to quit. From a report: Typically workers who snag a new position see higher pay bumps than those holding down the same job. But in February, median wage growth of 4.4% for job stayers surpassed a 4.2% gain for job switchers, according to data from the Federal Reserve Bank of Atlanta. The change, as measured by a three-month moving average, is yet another sign of a softening labor market. White collar workers have been clinging to their jobs in the face of widespread layoffs and workplace reductions. Last month, employers announced the fastest pace of job cuts since 2020, when factoring in government job losses. And now an oversupply of job seekers means workers are having to settle for smaller pay bumps, said Peter Cappelli, a professor of management at The Wharton School of the University of Pennsylvania. \n\n\"That certainly sounds like a big slackening of the job market,\" Cappelli said. It's a major reversal from the \"G",
        "id": 2414568,
        "language": null,
        "link": "https://slashdot.org/story/25/03/26/1641211/quitting-your-job-wont-help-you-get-paid-more-money-right-now?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Quitting Your Job Won't Help You Get Paid More Money Right Now",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T17:52:58+00:00",
        "description": "The United States has won far more Nobel Prizes in physics, chemistry, and medicine than any other nation, with the UK and Germany following in second and third place, according to an analysis of nearly 900 prize-winning publications. \n\nUniversities account for roughly three-fourths of Nobel Prize-winning research, with a small number of elite institutions producing a disproportionate share of winners. Cambridge University leads with 32 prizes, followed by Harvard (22) and Columbia (13). While prizes are concentrated among researchers from the US, UK, and Germany, 43 countries have produced at least one scientific Nobel laureate. \n\nOutside Europe and the Anglosphere, Japan leads with 11 prizes, while Argentina, China, and India have only one or two each. The average age of Nobel Prize winners has steadily increased from about 45 in the 1920s to 65 in the 2010s, though the age at which scientists perform their groundbreaking work has remained relatively constant at around 40.<p><div c",
        "id": 2414567,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/26/172241/who-wins-nobel-prizes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Who Wins Nobel Prizes?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T16:47:40+00:00",
        "description": "Signal president Meredith Whittaker challenged recent assertions by WhatsApp head Will Cathcart that minimal differences exist between the two messaging platforms' privacy protections. \"We're amused to see WhatsApp stretching the limits of reality to claim that they are just like Signal,\" Whittaker said in a statement published Monday, responding to Cathcart's comments to Dutch journalists last week. \n\nWhile WhatsApp licenses Signal's end-to-end encryption technology, Whittaker said that WhatsApp still collects substantial user metadata, including \"location data, contact lists, when they send someone a message, when they stop, what users are in their group chats, their profile picture, and much more.\" Cathcart had previously stated that WhatsApp doesn't track users' communications or share contact information with other companies, claiming \"we strongly believe in private communication.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitt",
        "id": 2413879,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/26/1536221/signal-president-blasts-whatsapps-privacy-claims?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Signal President Blasts WhatsApp's Privacy Claims",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T15:42:00+00:00",
        "description": "Transport for London will ban most e-bikes across its network from March 31 amid growing safety concerns over battery fires, the transport authority announced on Wednesday. The ban, covering London Underground, Overground, Elizabeth Line and DLR trains, exempts only folding e-bikes, which are considered less likely to have been modified and pose a reduced safety risk. \n\nTfL implemented the measure following union strike threats after several incidents, including an e-bike that exploded into flames at Rayners Lane Underground platform last month. The train drivers' union Aslef said the incident could have caused mass casualties.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=London+Bans+Most+E-Bikes+on+Public+Transport+Over+Fire+Risk%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F03%2F26%2F1443258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a cla",
        "id": 2413208,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/26/1443258/london-bans-most-e-bikes-on-public-transport-over-fire-risk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "London Bans Most E-Bikes on Public Transport Over Fire Risk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T15:42:00+00:00",
        "description": "Streaming platforms are increasingly indistinguishable to consumers despite high brand awareness, according to Hub Entertainment Research. The annual Evolution of Video Branding report shows major services like Netflix, Disney+, Hulu, and Max experiencing year-over-year declines in viewers' ability to articulate what makes each platform unique. \n\nFewer consumers (37% in 2025, down from 41% in 2023) report signing up for services to watch specific shows, while many can't correctly identify where signature programs like Game of Thrones or The Bear can be viewed. While 58% know Stranger Things streams on Netflix, less than half can properly place other major titles.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Streaming+Services+Are+Facing+Identity+Crisis%2C+Research+Shows%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F03%2F26%2F1518225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://",
        "id": 2413207,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/26/1518225/streaming-services-are-facing-identity-crisis-research-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Streaming Services Are Facing Identity Crisis, Research Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T13:26:51+00:00",
        "description": "An anonymous reader quotes a report from Gizmodo: Scientists scrutinizing the seafloor beneath a calving iceberg found a remarkable array of living creatures, switching up notions of how the giant chunks of ice affect their immediate environs. The scientists investigated a region of seafloor recently exposed by the calving of a gigantic iceberg -- A-84 -- which is as large as Chicago. The team found a surprisingly vibrant community of critters on the seafloor below where A-84 was once attached to an ice shelf attached to Antarctica.\n \nWithout the 197-square-mile (510-square-kilometer) iceberg in the way, the team was able to scrutinize the seafloor at depths of 4,265 feet (1,300 meters) using the remotely operated vehicle (ROV) SuBastian. The team found large corals and sponges supporting other lifeforms, including icefish, giant sea spiders, and octopus. [...] With the icebergs covering the seafloor, organisms below the shelf cannot get nutrients for survival from the surface. The t",
        "id": 2411931,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/26/0149248/chicago-sized-iceberg-hid-ancient-ecosystem-scientists-reveal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chicago-Sized Iceberg Hid Ancient Ecosystem, Scientists Reveal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T10:12:29+00:00",
        "description": "wiredmikey shares a report from SecurityWeek: Google late Tuesday rushed out a patch for a sandbox escape vulnerability in its flagship Chrome browser after researchers at Kaspersky caught a professional hacking operation launching drive-by download exploits. The vulnerability, tracked as CVE-2025-2783, was chained with a second exploit for remote code execution in what appears to be a nation-state sponsored cyberespionage campaign [dubbed Operation ForumTroll] targeting organizations in Russia.\n \nKaspersky said it detected a series of infections triggered by phishing emails in the middle of March and traced the incidents to a zero-day that fired when victims simply clicked on a booby-trapped website from a Chrome browser. The Russian anti-malware vendor said victims merely had to click on a personalized, short-lived link, and their systems were compromised when the malicious website was opened in Chrome. Kaspersky said its exploit detection tools picked up on the zero-day, and after",
        "id": 2410455,
        "language": null,
        "link": "https://slashdot.org/story/25/03/26/0143210/google-patches-chrome-sandbox-escape-zero-day-caught-by-kaspersky?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Patches Chrome Sandbox Escape Zero-Day Caught By Kaspersky",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T07:37:55+00:00",
        "description": "In an op-ed for MIT Technology Review, authors Carsten T. Charlesworth, Henry T. Greely, and Hiromitsu Nakauchi make the case for human \"bodyoids\" that could reduce animal testing, improve drug development, and alleviate organ shortages: Why do we hear about medical breakthroughs in mice, but rarely see them translate into cures for human disease? Why do so few drugs that enter clinical trials receive regulatory approval? And why is the waiting list for organ transplantation so long? These challenges stem in large part from a common root cause: a severe shortage of ethically sourced human bodies. It may be disturbing to characterize human bodies in such commodifying terms, but the unavoidable reality is that human biological materials are an essential commodity in medicine, and persistent shortages of these materials create a major bottleneck to progress.\n \nThis imbalance between supply and demand is the underlying cause of the organ shortage crisis, with more than 100,000 patients c",
        "id": 2409836,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/26/0112257/ethically-sourced-spare-human-bodies-could-revolutionize-medicine?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ethically Sourced 'Spare' Human Bodies Could Revolutionize Medicine",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T04:21:57+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Software developer Xe Iaso reached a breaking point earlier this year when aggressive AI crawler traffic from Amazon overwhelmed their Git repository service, repeatedly causing instability and downtime. Despite configuring standard defensive measures -- adjusting robots.txt, blocking known crawler user-agents, and filtering suspicious traffic -- Iaso found that AI crawlers continued evading all attempts to stop them, spoofing user-agents and cycling through residential IP addresses as proxies. Desperate for a solution, Iaso eventually resorted to moving their server behind a VPN and creating \"Anubis,\" a custom-built proof-of-work challenge system that forces web browsers to solve computational puzzles before accessing the site. \"It's futile to block AI crawler bots because they lie, change their user agent, use residential IP addresses as proxies, and more,\" Iaso wrote in a blog post titled \"a desperate cry for help.\" \"I don't w",
        "id": 2409069,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/26/016244/open-source-devs-say-ai-crawlers-dominate-traffic-forcing-blocks-on-entire-countries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Open Source Devs Say AI Crawlers Dominate Traffic, Forcing Blocks On Entire Countries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T01:07:41+00:00",
        "description": "GameStop announced it will invest part of its corporate cash in bitcoin and stablecoins, following MicroStrategy's lead. The meme stock jumped more than 6% in extended trading Tuesday following the news. CNBC reports: The video game retailer said a portion of its cash or future debt and equity issuances may be invested in bitcoin and U.S. dollar-denominated stablecoins. As of Feb. 1, GameStop held nearly $4.8 billion in cash. The firm also said it has not set a ceiling on the amount of bitcoin it may purchase. The company said the move could expose it to volatility associated with cryptocurrency prices.\n \n\"Bitcoin, for example, is a highly volatile asset and has experienced significant price fluctuations over time. Our Bitcoin strategy has not been tested and may prove unsuccessful,\" GameStop said in a U.S. Securities and Exchange Commission filing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=GameStop+To+Invest+",
        "id": 2408398,
        "language": null,
        "link": "https://slashdot.org/story/25/03/26/0059223/gamestop-to-invest-corporate-cash-in-bitcoin-following-in-footsteps-of-microstrategy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "GameStop To Invest Corporate Cash In Bitcoin, Following In Footsteps of MicroStrategy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T00:02:42+00:00",
        "description": "The Register's Richard Speed reports: Baffled by the plethora of Outlook options out there? You aren't alone. Microsoft veteran Scott Hanselman posted a list of some more variants that could be used to do the same thing. It's a problem common to several Microsoft products. A file needs to be opened, but which app should be used? Should it be Outlook New, or Outlook (New)? With tongue firmly in cheek, Hanselman listed some more options: Outlook (Zero Sugar), Outlook (Caffeine Free), and so on. Hanselman, Developer Community veep at Microsoft, also included Outlook '95, although to our mind the peak came with the version of Outlook in Office 97. A happier, more trusting time when security was less important.\n \nWhile users can create multiple Outlook profiles to store email account details and data locations, Hanselman's post on Bluesky highlights an issue facing many users of Microsoft's software: which incarnation of the application to use. Teams users often find themselves presented ",
        "id": 2408119,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/25/215234/microsofts-many-outlooks-are-confusing-users?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's Many Outlooks Are Confusing Users",
        "vote": 0
    }
]