[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T17:00:46+00:00",
        "description": "So, is AI Limit a traditional soulslike? Yes, it’s got your post-apocalyptic setting and of course, the bonfire system is an almost 1-to-1 adaptation here. If there was any debate if this was really a soulslike, there’s even the same exact run jump from Dark Souls 1 (with no dedicated jump button, or course). But there’s a special ingredient here that makes it feel so much more fluid and freeing than all the other soulslikes, and that’s the unrestricted stamina. \n\nHaving basic actions not being burdened by an energy resource is wonderful, and the game’s difficulty curve isn’t too badly affected by it, all things considered. Whether you’re a soulslike action newcomer looking for something with less friction, or are a longtime fan seeking out the next great challenge, AI Limit comes highly recommended despite its budget showing in small areas.",
        "id": 2414609,
        "language": null,
        "link": "https://www.youtube.com/watch?v=eaR1YHdvKCk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eaR1YHdvKCk/hqdefault.jpg",
        "title": "AI LIMIT Review - A Fantastic Soulslike And Yet Another Win For PS5",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T15:00:33+00:00",
        "description": "With March in the bag, it's time to look forward to April and its massive roster of upcoming games. To say that a lot is releasing would be an understatement, especially with The Last of Us Part 2 Remastered on PC and Xbox titles like Forza Horizon 5 debuting on PS5.\n\nOf course, Days Gone is getting a remaster that adds new modes like Speedrun, Permadeath and Horde Assault for the biggest hordes yet. You can also look forward to sequels for classic indie games like Crashlands, Commandos Origins, and new platformers like Bionic Bay and Steel Seed.\n\nThen you have new IPs like the magical South of Midnight. The sheer range of high-profile titles is impressive, but there's even more to look forward to. Join us as we outline every major release of April 2025.",
        "id": 2413272,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QErza1ixjaM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QErza1ixjaM/hqdefault.jpg",
        "title": "15 UNMISSABLE Games of April 2025 To Look Forward To [PS5, Xbox, PC, Switch]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-26T09:30:01+00:00",
        "description": "Assassin's Creed Shadows is the newest open world action RPG of 2025. Those words, in that specific sequence, mean that it will be literally dozens, if not hundreds, of hours before your time with the game comes to an end. \n\nBut if, at the end of that epic odyssey through feudal Japan, you find yourself thirsting for more, what then? Well, the good news is, even though it’s scaled back from the likes of Odyssey and Valhalla, the game is absurdly big even when it comes to content beyond the main quest. \n\nThere's quite literally no shortage of things to prolong your time spent on it that much more. So if you are someone who finishes Assassin's Creed Shadows, and wants more of it, this list is for you.",
        "id": 2410479,
        "language": null,
        "link": "https://www.youtube.com/watch?v=36NO83dZCv8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/36NO83dZCv8/hqdefault.jpg",
        "title": "Assassin’s Creed Shadows - 10 Things To Do AFTER FINISHING THE GAME",
        "vote": 0
    }
]