[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T15:39:42.418501+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T14:29:07+00:00",
        "description": "Watch this video to find out how UE5 features played a key role in delivering the biggest, most ambitious installment yet in the long-running ‘Borderlands’ series.\n\nWhen setting out to develop the latest installment, Borderlands 4, developer Gearbox Software’s aim was to deliver the biggest, most badass version of the looter-shooter series to date with an all-new emphasis on player freedom.\n\nTo accomplish this, the team used Unreal Engine 5 and leaned into features like World Partition to achieve the game’s ambitious scale while implementing innovative new mechanics for environmental traversal and enhancing immersion with dynamic time of day and weather.\n\nRead the full interview with Gearbox’s Technical Director, Neil Johnson\n\n#Borderlands4, #Gearbox, #2KGames, #UnrealEngine5, #UE5, #UE4",
        "id": 3532677,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Yi-aJWVe3wA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Yi-aJWVe3wA/hqdefault.jpg",
        "title": "Borderlands 4 | Game Profile | Unreal Engine",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T13:10:33.964500+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T13:00:23+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Nathan Riddle of Spacestation Animation demonstrates how the company takes content from live-action YouTube videos and transforms it into animated episodes, interactive games, consumer products, and even children's books—all using the same core assets.\n\nThe future of content creation isn't just about making great assets—it's about maximizing their potential across every possible platform and medium. \n\nSpacestation Animation, a digital entertainment studio founded by YouTube Pioneer 'Shonduras', reaches millions of young viewers across multiple platforms with their flagship property A for Adley family cartoon, demonstrating the power of their transmedia or \"\"re-imagination\"\" approach. \n\nUsing Unreal Engine as their primary tool, they've developed innovative workflows that enable them to efficiently create and adapt content across various media formats while maintaining quality and brand consistency.\n\nThis session shares Spacestation",
        "id": 3531397,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DdCRyE8kgBE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DdCRyE8kgBE/hqdefault.jpg",
        "title": "One Asset, Infinite Media: Maximizing IP Value Through Unreal Engine | Unreal Fest Orlando 2025",
        "vote": 0
    }
]