[
    {
        "age": null,
        "album": "",
        "author": "The Hated One",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T15:55:55.882826+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T15:16:52+00:00",
        "description": "A surveillance state that captures everything. Support my work: https://www.patreon.com/thehatedone \n\nThere is a newly emerging industry called “whole-body” biometrics. Surveillance technologies that go beyond anything remotely imagined by sci-fi scenarios and dystopian fantasies. It is currently the primary focus of research funded by the Intelligence Advanced Research Projects Activty (IARPA) – a US government body.\n\nIARPA aims to develop the ultimate surveillance tool – one that can combine all key biometric markers into one comprehensive surveillance AI. The research is lead by a team at the Michigan State University and the tool they are creating is called FarSight.\n\nFarSight combines three biometric markers – gait, body and face – into a traceable profile to be matched to known individuals or to identify new matches. Gait and face recognition are not new – they are long-know methods of identifying subjects based on their stride and face. What is new is FarSight’s body recognitio",
        "id": 3532790,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Ch9ZkdXn3QU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 1,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 344,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCjr2bPAyPV7t35MvcgT3W8Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Ch9ZkdXn3QU/hqdefault.jpg",
        "title": "Total surveillance you CANNOT escape is coming",
        "vote": 0
    }
]