[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T23:10:32.380467+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T22:40:00+00:00",
        "description": "The latest National Assessment of Educational Progress shows U.S. high school seniors' math and reading scores at their lowest in decades, with nearly half failing to reach basic proficiency in math and one-third below basic in reading. The Associated Press reports: A decade-long slide in high schoolers' reading and math performance persisted during the COVID-19 pandemic, with 12th graders' scores dropping to their lowest level in more than 20 years, according to results released Tuesday from an exam known as the nation's report card. Eighth-grade students also lost significant ground in science skills, according to the results from the National Assessment of Education Progress.\n \nThe assessments were the first since the pandemic for eighth graders in science and 12th graders in reading and math. They reflect a downward drift across grade levels and subject areas in previous releases from NAEP, which is considered one of the best gauges of the academic progress of U.S. schools. \"Score",
        "id": 3536331,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/09/218227/us-high-school-students-lose-ground-in-math-and-reading-continuing-yearslong-decline?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US High School Students Lose Ground In Math and Reading, Continuing Yearslong Decline",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T23:10:32.503392+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T22:02:00+00:00",
        "description": "An anonymous reader quotes a report from Tom's Hardware: Intel has removed its chief executive officer of products, Michelle Johnston Holthaus, as part of a major shake-up of the executive branch of the embattled chip firm, according to Reuters. This is part of new CEO Lip-Bu Tan's plan to reshape the company under his leadership, flattening the leadership structure so he makes more of the important decisions about day-to-day operation. [...] Holthaus is the latest high-profile figure at Intel to get the axe, ending a 30-year career at Intel, but a mere 10 months in her CEO of products role, and a temporary position as co-CEO after the previous CEO, Pat Gelsinger, suddenly left in 2024. \"Throughout her incredible career, Michelle has transformed major businesses, built high-performing teams and worked to delight our customers,\" Tan said in a statement. \"She has made a lasting impact on our company and inspired so many of us with her leadership. We are grateful for all Michelle has giv",
        "id": 3536332,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/09/213214/intel-ousts-ceo-of-products-ending-30-year-career?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel Ousts CEO of Products, Ending 30-Year Career",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T21:54:56.266016+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T21:25:00+00:00",
        "description": "Apple's new Watch lineup introduces blood pressure monitoring, sleep scoring, and upgraded hardware across the Series 11 ($399), Ultra 3 ($799), and SE 3 ($249). Ars Technica reports: The Apple Watch 11 is supposed to be able to alert users about \"possible hypertension\" by using data from an optical heart rate sensor \"to analyze how a user's blood vessels respond to the beats of the heart,\" per its announcement. According to Apple's presentation, the smartwatch will look for chronic hypertension over 30-day periods. Apple's presentation noted that the Watch Series 11 won't be able to identify all hypertension, but the company said that it expects to notify over 1 million people with undiagnosed hypertension during the feature's first year of availability. The feature is based on machine-learning and training data built from multiple studies examining over 100,000 people combined, Apple noted. Apple said it expects the blood pressure monitoring feature to receive Food and Drug Administ",
        "id": 3535739,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/09/09/2054205/apple-adds-hypertension-and-sleep-quality-monitoring-to-watch-ultra-3-series-11?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Adds Hypertension and Sleep-Quality Monitoring To Watch Ultra 3, Series 11",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T21:54:56.520625+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T20:45:00+00:00",
        "description": "Apple has unveiled the AirPods Pro 3 with heart-rate sensing, improved noise cancellation, a more compact case, and upcoming live translation features powered by Apple Intelligence. They'll be available for preorder today at a price of $249. TechCrunch reports: One of the standout features of the AirPods Pro 3 is its heart-rate sensing capability, a first for the AirPods line. This addition will operate similarly to the Powerbeats Pro 2, using LED sensors to provide precise measurements. The collected data will sync with Apple's Fitness app. The active noise cancellation, which reduces external noise, has been significantly improved. Apple says it removes twice the noise compared to Pro 2.\n \nA noteworthy upcoming feature is a live translation capability, thanks to Apple's iOS 26 software update. This lets you have conversations in different languages, using your iPhone to translate while the phone plays one language and the AirPods handle the other. Other notable updates include small",
        "id": 3535740,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/09/2043237/airpods-pro-3-arrive-with-heart-rate-sensing-live-translation-using-apple-intelligence?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AirPods Pro 3 Arrive With Heart-Rate Sensing, Live Translation Using Apple Intelligence",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T20:34:12.178948+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T19:31:00+00:00",
        "description": "Canon will rerelease its 2016 PowerShot Elph 360 HS point-and-shoot camera as the PowerShot Elph 360 HS A in late October for $379 -- $169 more than the original's $210 launch price. The camera retains the same 20.2-megapixel CMOS sensor, Digic IV Plus processor, 12x optical zoom, 1080p video recording, and USB Mini port. \n\nThe new version switches from SD to microSD cards and removes Wi-Fi image transfer and direct printing capabilities. The rerelease comes after celebrities including Kendall Jenner and Dua Lipa popularized the original model on social media. The camera will be available in black or silver only; the original purple option has been discontinued.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Canon+is+Bringing+Back+a+Point-and-Shoot+From+2016+With+Fewer+Features+and+a+Higher+Price+%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F09%2F09%2F1932201%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img",
        "id": 3534913,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/09/1932201/canon-is-bringing-back-a-point-and-shoot-from-2016-with-fewer-features-and-a-higher-price?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Canon is Bringing Back a Point-and-Shoot From 2016 With Fewer Features and a Higher Price",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T20:34:12.761591+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T18:43:00+00:00",
        "description": "Apple has unveiled its iPhone 17 lineup, introducing three distinct models targeting different market segments. The iPhone 17 Pro and Pro Max feature an aluminum unibody design incorporating a vapor chamber for thermal management, enabling the A19 Pro chip to deliver 40% better sustained performance than its predecessor. Both Pro models include three 48MP cameras offering 8x optical zoom -- the longest in an iPhone -- and an 18MP Center Stage front camera. \n\nThe standard iPhone 17 gains ProMotion display technology previously exclusive to Pro models, along with dual 48MP rear cameras and the Center Stage system. Apple introduced iPhone Air as the thinnest iPhone at 5.6mm, built on a titanium frame housing the A19 Pro, N1 wireless, and C1X cellular chips. All models feature Ceramic Shield 2 protection offering three times better scratch resistance than previous generations. The iPhone 17 starts at $799 with 256GB storage, iPhone Air at $999, iPhone 17 Pro at $1,099, and Pro Max at $1,1",
        "id": 3534914,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/09/09/1844201/apple-launches-iphone-17-lineup-featuring-ultra-thin-56mm-iphone-air?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Launches iPhone 17 Lineup Featuring Ultra-Thin 5.6mm iPhone Air",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T18:33:21.879248+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T18:11:00+00:00",
        "description": "An anonymous reader writes: Reuters News on Friday withdrew a four-minute video containing an exchange between Russian President Vladimir Putin and Chinese President Xi Jinping discussing the possibility that humans can live to 150 years old, after China state TV demanded its removal and withdrew the legal permission to use it. \n\nThe footage, which included the open mic exchange from the military parade in Beijing marking the 80th anniversary of the end of World War Two, was licensed by the China state television network, China Central Television (CCTV). The clips were edited by Reuters into a four-minute video and distributed to more than 1,000 global media clients including major international news broadcasters and TV stations around the world. Other news agency licensees of CCTV also distributed edits of the footage. \n\nReuters removed the video from its website and issued a \"kill\" order to its clients on Friday after receiving a written request from CCTV's lawyer. The letter said t",
        "id": 3534259,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/09/1811238/reuters-withdraws-xi-putin-longevity-video-after-china-state-tv-pulls-legal-permission-to-use-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reuters Withdraws Xi, Putin Longevity Video After China State TV Pulls Legal Permission To Use It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T18:33:21.985966+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T17:21:00+00:00",
        "description": "BrianFagioli writes: Microsoft has decided it is time to rein in remote work. The company will soon require employees to spend at least three days per week in the office, starting with those in the Puget Sound region by February 2026. From there, the policy will spread across the United States and eventually overseas.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Forces+Workers+Back+To+the+Office%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F09%2F09%2F177221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F09%2F09%2F177221%2Fmicrosoft-forces-workers-back-to-the-office%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/25/09",
        "id": 3534260,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/09/177221/microsoft-forces-workers-back-to-the-office?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Forces Workers Back To the Office",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T17:15:13.726487+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T16:40:00+00:00",
        "description": "Public companies in the U.S. have dutifully shared financial results with investors every three months for the past 50-plus years. A new proposal hopes to change that. WSJ: The Long-Term Stock Exchange plans to petition the Securities and Exchange Commission to eliminate the quarterly earnings report requirement and instead give companies the option to share results twice a year, the group told The Wall Street Journal. It says the idea would save companies millions of dollars and allow executives to focus on long-term goals instead of worrying about hitting quarterly targets or prepping for earnings calls. \n\n\"We hear a lot about how it's overly burdensome to be a public company,\" said Bill Harts, the exchange's chief executive officer. \"This is an idea whose time has come.\" President Trump briefly explored the idea during his first term, and current SEC leadership has signaled an interest in reducing regulation. \n\nLTSE representatives recently discussed their proposal with SEC officia",
        "id": 3533531,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/09/1535229/the-renewed-bid-to-end-quarterly-earnings-reports?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Renewed Bid To End Quarterly Earnings Reports",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T17:15:13.820158+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T16:01:00+00:00",
        "description": "U.S. jobs growth was much slower than previously reported, according to revised data released on Tuesday. From a report: The number of jobs created in the United States from April 2024 to March 2025 was revised down by 911,000 by the Bureau of Labor Statistics. That would roughly amount to 76,000 fewer jobs created each month of the year up until March. The revision draws fresh attention to the weakening U.S. labor market, which added an average of only 29,000 jobs in each of the three most recent months. \n\nThe August jobs report showed that the U.S. added only 22,000 jobs that month and also revised June's job growth down to a loss of 13,000 jobs. Those datapoints have led economists and some policymakers to conclude that the U.S. labor market is now at a standstill. \"The jobs engine that has been integral to U.S. economic growth defying expectations for the past four years is stalling,\" Sarah House, a senior economist at Wells Fargo, said in a note on Friday.<p><div class=\"share_sub",
        "id": 3533532,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/09/1513203/us-created-911000-fewer-jobs-than-previously-thought-in-the-12-months-through-march?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Created 911,000 Fewer Jobs Than Previously Thought in the 12 Months Through March",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T15:58:32.668779+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T15:20:00+00:00",
        "description": "Apollo Chief Economist Torsten Slok, writing in a blog post There are fewer public companies to invest in, and firms that decide to do an IPO are getting older and older. \n\nIn 1999, the median age of IPOs was five years. In 2022, it was eight years, and today, the median age of IPOs has increased to 14 years. \n\nThe rise in the age of companies going public is not only a result of the Fed raising interest rates in 2022, but also the consequence of more companies wanting to stay private for longer to avoid the burdens of being public. \n\nCombined with the domination of passive investing, failure of active managers and high correlation in public markets, and high concentration in a few stocks, the reality is that there is no alpha left in public markets.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=No+Alpha+Left+in+Public+Markets%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F09%2F1126247%2F%3Futm_source%3Dtwitter%",
        "id": 3532811,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/09/1126247/no-alpha-left-in-public-markets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "No Alpha Left in Public Markets",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T14:44:55.029481+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T14:40:00+00:00",
        "description": "An Associated Press investigation based on tens of thousands of leaked documents revealed Tuesday that American technology companies designed and built core components of China's surveillance apparatus over the past 25 years, selling billions of dollars in equipment to Chinese police and government agencies despite warnings about human rights abuses. \n\nIBM partnered with Chinese defense contractor Huadi in 2009 to develop predictive policing systems for the \"Golden Shield\" project, AP reports, citing classified government blueprints. The technology enabled mass detentions in Xinjiang, where administrators assigned 100-point risk scores to Uyghurs with deductions for growing beards or being aged 15-55. Dell promoted a laptop with \"all-race recognition\" capabilities on its WeChat account in 2019. Thermo Fisher Scientific marketed DNA kits as \"designed\" for ethnic minorities including Uyghurs and Tibetans until August 2024. \n\nOracle, Microsoft, HP, Cisco, Intel, NVIDIA, and VMware sold g",
        "id": 3532130,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/09/1124247/us-tech-companies-enabled-the-surveillance-and-detention-of-hundreds-of-thousands-in-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Tech Companies Enabled the Surveillance and Detention of Hundreds of Thousands in China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T14:44:55.147800+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T14:01:00+00:00",
        "description": "Pakistan has built surveillance systems that it is actively using to spy on millions of its citizens and to block millions of internet sessions, according to Amnesty International. The Asian nation's Lawful Intercept Management System enables intelligence agencies to tap calls and texts across all four major mobile operators. \n\nA Chinese-built firewall, WMS 2.0, currently blocks approximately 650,000 web links and restricts platforms including YouTube, Facebook, and X. The surveillance infrastructure combines technology from Chinese company Geedge Networks, U.S.-based Niagara Networks, France's Thales DIS, Germany's Utimaco, and UAE-based Datafusion. Balochistan province has experienced years-long internet blackouts under the system.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Pakistan+Spying+On+Millions+Through+Phone-Tapping+And+Firewall%2C+Amnesty+Says%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F09%2F09%2",
        "id": 3532131,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/09/113252/pakistan-spying-on-millions-through-phone-tapping-and-firewall-amnesty-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pakistan Spying On Millions Through Phone-Tapping And Firewall, Amnesty Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T13:27:53.294388+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: X enthusiast and Reddit shareholder Sam Altman had an epiphany on Monday: Bots have made it impossible to determine whether social media posts are really written by humans, he posted. The realization came while reading (and sharing) some posts from the r/Claudecode subreddit, which were praising OpenAI Codex. OpenAI launched the software programming service that takes on Anthropic's Claude Code in May. Lately, that subreddit has been so filled with posts from self-proclaimed Code users announcing that they moved to Codex that one Reddit user even joked: \"Is it possible to switch to codex without posting a topic on Reddit?\"\n \nThis left Altman wondering how many of those posts were from real humans. \"I have had the strangest experience reading this: I assume it's all fake/bots, even though in this case I know codex growth is really strong and the trend here is real,\" he confessed on X. He then live-analyzed his reasoning. \"I think the",
        "id": 3531493,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/09/0048216/sam-altman-says-bots-are-making-social-media-feel-fake?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sam Altman Says Bots Are Making Social Media Feel 'Fake'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T11:07:58.044563+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T10:00:00+00:00",
        "description": "Starting in 2026, Red Hat's back-office staff in HR, finance, legal, and accounting will be transferred to IBM, while engineering, product, sales, and marketing teams remain at Red Hat -- at least for now. The Register reports: According to a communication sent to employees, those in General &amp; Administrative areas will join IBM, including the lion's share of the people working in the HR, finance, accounting, and legal units at Red Hat. A source told us the switch will be \"implemented this year,\" although in some countries \"it might take longer due to legal constraints.\" The leadership running those teams will remain within the Red Hat fold. Some are nervous about the move, with tech companies -- notably IBM -- eliminating duplicated roles to consolidate back-office functions. In January -- as has happened in recent years -- IBM again forecast annual savings of $3.5 billion, partly through job cuts.\n \nThere is no public data on the size of the G&amp;A population within Red Hat but ",
        "id": 3530388,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/09/09/0039236/red-hat-back-office-team-moving-to-ibm-from-2026?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Red Hat Back-Office Team Moving To IBM From 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T07:35:21.636827+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T07:00:00+00:00",
        "description": "Google rolled out three big Gemini updates: the app now supports audio uploads (with tiered limits for free vs. paid users), Search gains AI Mode in five new languages, and NotebookLM expands to generate reports, study guides, quizzes, and other formats in over 80 languages. The Verge reports: According to a Monday post on X by Josh Woodward, vice president of Google Labs and Gemini, audio file compatibility was the \"#1 request\" to the Gemini app. Free Gemini users max out at 10 minutes of audio, and five free prompts each day. AI Pro or AI Ultra users, meanwhile, can upload audio up to three hours in length. All Gemini prompts accommodate up to 10 files across various file formats, including within ZIP files.\n \nAdditionally, Google Search's AI Mode has rolled out five new language options: Hindi, Indonesian, Japanese, Korean, and Brazilian Portuguese, thanks to the integration of Gemini 2.5 with Search, according to a company blog: \"With this expansion, more people can now use AI Mod",
        "id": 3529134,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/09/0030209/gemini-app-finally-expands-to-audio-files?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gemini App Finally Expands To Audio Files",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T04:05:00.262948+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: For decades, scientists believed Prochlorococcus, the smallest and most abundant phytoplankton on Earth, would thrive in a warmer world. But new research suggests the microscopic bacterium, which forms the foundation of the marine food web and helps regulate the planet's climate, will decline sharply as seas heat up. A study published Monday in the journal Nature Microbiology found Prochlorococcus populations could shrink by as much as half in tropical oceans over the next 75 years if surface waters exceed about 82 degrees Fahrenheit (27.8 Celsius). Many tropical and subtropical sea surface temperatures are already trending above average and are projected to regularly surpass 86 degrees Fahrenheit (30 Celsius) over that same period.\n \n\"These are keystone species -- very important ones,\" said Francois Ribalet, a research associate professor at the University of Washington's School of Oceanography and the study's lead author",
        "id": 3528311,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/08/2214205/warming-seas-threaten-key-phytoplankton-species-that-fuels-the-food-web?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Warming Seas Threaten Key Phytoplankton Species That Fuels the Food Web",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-09T00:43:18.321826+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-09T00:30:00+00:00",
        "description": "alternative_right shares a report from The Guardian: It has been estimated that during the height of the coronavirus pandemic 129bn disposable face masks, mostly made from polypropylene and other plastics, were being used every month around the world. With no recycling stream, most ended up either in landfill or littered in streets, parks, beaches, waterways and rural areas, where they have now begun to degrade. Recent research has reported a significant presence of disposable face masks in both terrestrial and aquatic environments. \nThey left newly bought masks of several different kinds for 24 hours in flasks containing 150ml of purified water, then filtered the liquid through a membrane to see what came out. Every mask examined ... leached microplastics, but it was the FFP2 and FFP3 masks -- marketed as the gold-standard protection against the transmission of the virus -- that leached the most, releasing four to six times as many. And they made an even more worrying discovery.\n \nSu",
        "id": 3527559,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/08/2157248/disposable-face-masks-used-during-covid-have-left-chemical-timebomb?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Disposable Face Masks Used During Covid Have Left Chemical Timebomb",
        "vote": 0
    }
]