[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-22T18:30:23+00:00",
        "description": "Final Fantasy 7 Rebirth launches on January 23rd for PC, bringing the acclaimed role-playing game to the platform after nearly a year of exclusivity on PS5. There's a lot to be excited about, especially given the mixed reactions to the PS5 version's visuals. Some aspects remain to be improved and optimized. However, this may be the best way to experience the title.\n\nAlongside three graphical presets, the PC version supports resolutions up to 4K and frame rates up to 120 FPS. You can customize the usual - texture quality, ocean detail, fog detail, etc. Adjusting the number of displayed characters and their shadow distance is a nice addition, with the biggest omission being the lack of DLSS modes. Support for other upscaling methods is also missing.\n\nThere are also some noticeable frame drops in some cases, though performance is solid all around. Regardless of its blemishes, Final Fantasy 7 Rebirth is a worthwhile experience on PC and a massive upgrade over PS5.",
        "id": 1958845,
        "language": null,
        "link": "https://www.youtube.com/watch?v=T1n5GBe2Wt4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/T1n5GBe2Wt4/hqdefault.jpg",
        "title": "Final Fantasy 7 Rebirth PC vs PS5 Graphics Comparison - Is PC The Best-Looking Version?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-22T14:01:01+00:00",
        "description": "One of the greatest games of last year, based on one of the best titles ever made, finally comes to PC. Final Fantasy 7 Rebirth is pretty much identical in content, but its feature set includes higher resolutions and frame rates, customizable mouse and keyboard controls, and improved lighting throughout.\n\nThere isn't any DLC or additional story a la Final Fantasy 7 Remake Intergrade, but that doesn't take away from the experience. With dozens of hours of quality content, a memorable storyline (albeit with an iffy ending), excellent combat, a gorgeous world to explore, and stellar characterization, it builds on everything from its predecessor and then some.\n\nWhile the PC version isn't perfect - there are slight frame drops here and there while pop-in is noticeable in the larger open-world areas - it's still the best way to experience Final Fantasy 7 Rebirth. The visual enhancements and image quality make it shine even more than before.",
        "id": 1956692,
        "language": null,
        "link": "https://www.youtube.com/watch?v=kc62PLSmnQA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kc62PLSmnQA/hqdefault.jpg",
        "title": "Final Fantasy 7 Rebirth PC Review - An Excellent Port",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-22T10:00:19+00:00",
        "description": "Monster Hunter has turned into an absolute juggernaut. Though it had never been a stranger to widespread success, the franchise broke out into the global mainstream in 2018 with the release of Monster Hunter World, which itself has become the series' highest selling game of all time. \n\nIt’s safe to say, then, that there’s a lot of excitement surrounding the future of Monster Hunter- and that future is right around the corner. Monster Hunter Wilds is releasing soon, and based on everything that we have seen of it so far (which is quite a bit), it’s looking like yet another exciting leap forward for the beloved action RPG franchise. As we prepare for its release, here, we’ll talking  about why it’s got us so excited.",
        "id": 1955281,
        "language": null,
        "link": "https://www.youtube.com/watch?v=FOz7oWMZgqg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FOz7oWMZgqg/hqdefault.jpg",
        "title": "Why Monster Hunter Wilds May Be the Biggest Game of the Year",
        "vote": 0
    }
]