[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-07T18:30:43+00:00",
        "description": "I've stuck with The Legend of Heroes: Trails series since Trails in the Sky: FC. My enthusiasm may have waned at some points, especially when Cold Steel 4 was done and dusted, but it's always enthralled me with its characterization, larger narrative, combat, and world-building.\n\nMany of those tenets still apply in The Legend of Heroes: Trails through Daybreak. Van Arkride and his \"assistants\" are still as endearing as ever. The Republic of Calvard still offers numerous secrets and a distinguished atmosphere compared to other locations. Even the combat system has seen some much-needed additions and improvements.\n\nHowever, Falcom has seemingly missed the boat on the larger narrative. A new storytelling mechanic proves completely hands-off and overdone to the point of absurdity; the LGC Alignment system feels irrelevant; and it feels like the characters deserve better. I wouldn't completely skip this entry because there's a lot of good stuff but it's easily the weakest entry yet.",
        "id": 2066750,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oRWLh6BHWcQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oRWLh6BHWcQ/hqdefault.jpg",
        "title": "The Legend of Heroes: Trails Through Daybreak 2 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-07T15:30:05+00:00",
        "description": "Even though suggestions that purely single player games aren’t commercially viable simply refuse to go away (in spite of all the evidence to the contrary), we thankfully continue to see excellent new single player experiences on a consistent basis. \n\nKingdom Come: Deliverance 2 is the latest exclusively single player experience that has come along and taken the masses by storm. From its massive, authentic, and richly detailed open world to its captivating writing and storytelling, from how deeply engaging its system sandbox open world systems are to the vast emphasis it places on player choice, Kingdom Come: Deliverance 2 is brimming with things that have instantly made it a big success, both critically and commercially- never mind its complete lack of live service elements.",
        "id": 2065137,
        "language": null,
        "link": "https://www.youtube.com/watch?v=E4-vmLItPKQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/E4-vmLItPKQ/hqdefault.jpg",
        "title": "Kingdom Come Deliverance 2 Proves GAMERS WANT ENGAGING SINGLE PLAYER GAMES",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-07T09:00:45+00:00",
        "description": "A good game opener can make or break one’s impression of a game. It’s no surprise, then, that the first hours and starting tutorials are usually the last thing to polish up in game development. We’ve compiled 15 of the most compelling game openers that have such an enticing hook, we were glued to the screen and didn’t want to quit. \n\nOf course, there’s more than one way to achieve a magnetic initial hook in a game opening. Some of the best game introductions kick the player off in the middle of the action with a taste of power from the get-go. \n\nAnother way games pull us into their world is by giving us a reason to care about the setting and the motivations of characters. What’s interesting is that all of these 15 games don’t skimp on quality throughout the full runtime.",
        "id": 2062480,
        "language": null,
        "link": "https://www.youtube.com/watch?v=_l1N_jioxY0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_l1N_jioxY0/hqdefault.jpg",
        "title": "15 Single Player Games That Will Suck You In Within The FIRST 30 MINUTES",
        "vote": 0
    }
]