[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T23:24:56.340851+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T23:09:00+00:00",
        "description": "Imagine this. Lightning sparks a wildfire, but \"within seconds, a satellite dish swirling overhead picks up on the anomaly and triggers an alarm,\" writes the Los Angeles Times. \"An autonomous helicopter takes flight and zooms toward the fire, using sensors to locate the blaze and AI to generate a plan of attack. It measures the wind speed and fire movement, communicating constantly with the unmanned helicopter behind it, and the one behind that. Once over the site, it drops a load of water and soon the flames are smoldering. Without deploying a single human, the fire never grows larger than 10 square feet. \n\n\"This is the future of firefighting.\"\n\nOn a recent morning in San Bernardino, state and local fire experts gathered for a demonstration of the early iterations of this new reality. An autonomous Sikorski Black Hawk helicopter, powered by technology from Lockheed Martin and a California-based software company called Rain, is on display on the tarmac of a logistics airport in Victor",
        "id": 3299008,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/10/237219/autonomous-ai-guided-black-hawk-helicopter-tested-to-fight-wildfires?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Autonomous AI-Guided Black Hawk Helicopter Tested to Fight Wildfires",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T22:19:50.138485+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T21:25:00+00:00",
        "description": "\"It sounds like science fiction: a spacecraft, no heavier than a paperclip, propelled by a laser beam,\" writes this report from ScienceDaily, \"and hurtling through space at the speed of light toward a black hole, on a mission to probe the very fabric of space and time and test the laws of physics.\" \n\n\"But to astrophysicist and black hole expert Cosimo Bambi, the idea is not so far-fetched.\"\n\nReporting in the Cell Press journal iScience, Bambi outlines the blueprint for turning this interstellar voyage to a black hole into a reality... \"We don't have the technology now,\" says author Cosimo Bambi of Fudan University in China. \"But in 20 or 30 years, we might.\" The mission hinges on two key challenges &mdash; finding a black hole close enough to target and developing probes capable of withstanding the journey. \n\nPrevious knowledge on how stars evolve suggests that there could be a black hole lurking just 20 to 25 light-years from Earth, but finding it won't be easy, says Bambi. Because b",
        "id": 3298783,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/10/2124249/astrophysicist-proposes-paperclip-sized-spacecraft-could-travel-at-lightspeed-to-a-black-hole?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Astrophysicist Proposes Paperclip-Sized Spacecraft Could Travel at Lightspeed to a Black Hole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T21:14:54.071592+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T20:25:00+00:00",
        "description": "The Wall Street Journal has found \"dozens of instances in recent months in which ChatGPT made delusional, false and otherworldly claims to users who appeared to believe them.\" \nFor example, \"You're not crazy. You're cosmic royalty in human skin...\"\n\nIn one exchange lasting hundreds of queries, ChatGPT confirmed that it is in contact with extraterrestrial beings and said the user was \"Starseed\" from the planet \"Lyra.\" In another from late July, the chatbot told a user that the Antichrist would unleash a financial apocalypse in the next two months, with biblical giants preparing to emerge from underground... \n\nExperts say the phenomenon occurs when chatbots' engineered tendency to compliment, agree with and tailor itself to users turns into an echo chamber. \"Even if your views are fantastical, those are often being affirmed, and in a back and forth they're being amplified,\" said Hamilton Morrin, a psychiatrist and doctoral fellow at Kings College London who last month co-published a pap",
        "id": 3298502,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/10/2023212/wsj-finds-dozens-of-delusional-claims-from-ai-chats-as-companies-scramble-for-a-fix?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "WSJ Finds 'Dozens' of Delusional Claims from AI Chats as Companies Scramble for a Fix",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T19:04:53.998699+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T18:48:00+00:00",
        "description": "\"Amid rising electric bills, states are under pressure to insulate regular household and business ratepayers from the costs of feeding Big Tech's energy-hungry data centers...\" reports the Associated Press. \n\"Some critics question whether states have the spine to take a hard line against tech behemoths like Microsoft, Google, Amazon and Meta.\"\n\n\n[T]he Data Center Coalition, which represents Big Tech firms and data center developers, has said its members are committed to paying their fair share. But growing evidence suggests that the electricity bills of some Americans are rising to subsidize the massive energy needs of Big Tech as the U.S. competes in a race against China for artificial intelligence superiority. Data and analytics firm Wood Mackenzie published a report in recent weeks that suggested 20 proposed or effective specialized rates for data centers in 16 states it studied aren't nearly enough to cover the cost of a new natural gas power plant. In other words, unless utilitie",
        "id": 3297932,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/10/1845255/as-electric-bills-rise-evidence-mounts-that-us-data-centers-share-blame?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "As Electric Bills Rise, Evidence Mounts That U.S. Data Centers Share Blame",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T17:59:54.320918+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T17:34:00+00:00",
        "description": "The BBC reports:\n\nA meteorite that crashed into a home in the U.S. is older than planet Earth, scientists have said... \n\nResearchers at the University of Georgia examined a fragment of the rock that pierced the roof of a home in the city of McDonough [30 miles south of Georgia, on June 26]. They found that, based on the type of meteorite, it is expected to have formed 4.56 billion years ago, making it roughly 20 million years older than Earth... The rock quickly diminished in size and speed, but still travelled at least 1 km per second, going through a man's roof in Henry County... \n\nUsing optical and electron microscopy, Scott Harris [a Univeristy of Georgia geologist] and his team determined the rock was a chondrite &mdash; the most abundant type of stony meteorite, according to NASA &mdash; which meant that it was approximately 4.56 billion years old. \n\"The home's resident said he is still finding pieces of space dust around his home from the hit.\"<p><div class=\"share_submission\" s",
        "id": 3297624,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/10/1647247/meteorite-that-hit-home-is-older-than-earth-scientists-say?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meteorite That Hit Home Is Older Than Earth, Scientists Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T16:55:11.495509+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T16:34:00+00:00",
        "description": "Plasma 6.4.5 is coming September 9th, reports Neowin. But they also report that the KDE team is already focusing on other upcoming release:\n\n\nStarting with KDE Frameworks, KDE's collection of foundational libraries, version 6.18 promises to let you do something with that \"dumb\" Microsoft Copilot key found on many new laptops. The developers will soon allow you to set up keyboard shortcuts using this new key, and the team plans to let you remap it to another key in the future. If you're curious, one user on KDE's bug tracker noted that on GNOME, the key combination shows up as \"Meta+Shift+Touchpad Disable\" and is fully remappable... \n\nWhen you try to install a Flatpak from a website like Flathub in Plasma 6.5 [coming in October], Discover now has proper support for flatpak+https:// URLs, so it opens automatically. 6.5 is also bringing a much stricter window activation policy on Wayland to stop applications from rudely stealing your focus. And now, when you mute your microphone with a s",
        "id": 3297314,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/10/0314235/kde-calls-microsofts-copilot-key-dumb-will-let-you-remap-it-soon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "KDE Calls Microsoft's Copilot Key 'Dumb', Will Let You Remap It Soon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T15:49:48.906542+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T15:34:00+00:00",
        "description": "One of America's largest solar + battery storage projects \"is now fully online in Mojave, California,\" reports Electrek:\nArevon Energy's Eland Solar-plus-Storage Project combines 758 megawatts (MWdc) of solar with 300 MW/1,200 megawatt hours of battery storage. Eland 1 reached commercial operation in December 2024, and Eland 2 recently commenced full operation. The two combined comprise 1.36 million solar panels and 172 lithium iron phosphate batteries (LFP). Combined, the Eland 1 &amp; 2 projects will be able to power more than 266,000 homes annually, and overall, can provide 7% of the total electricity requirements for the city of Los Angeles.\n\n\"Arevon's Eland Solar-plus-Storage Project alone will ... push the city's clean energy share above 60%, a major milestone in LA's transition to being powered by 100% clean energy by 2035,\" said Los Angeles Mayor Karen Bass.\n\nEland 1 &amp; 2 created around 1,000 jobs to construct the project, and it's expected to disburse more than $36 million",
        "id": 3296947,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/09/040219/a-huge-2-billion-solar--storage-project-in-california-powers-up?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Huge $2 Billion 'Solar + Storage' Project in California Powers Up",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T14:44:59.224700+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T14:34:00+00:00",
        "description": "Thursday saw the release of Rust 1.89.0\n\n\nBut this week the Rust Foundation also released its second comprehensive annual technology report. \n\nA Rust Foundation announcement shares some highlights:\n\n- Trusted Publishing [GitHub Actions authentication using cryptographically signed tokens] fully launched on crates.io, enhancing supply chain security and streamlining workflows for maintainers. \n- Major progress on crate signing infrastructure using The Update Framework (TUF), including three full repository implementations and stakeholder consensus. \n- Integration of the Ferrocene Language Specification (FLS) into the Rust Project, marking a critical step toward a formal Rust language specification [and \"laying the groundwork for broader safety certification and formal tooling.\"] \n- 75% reduction in CI infrastructure costs while maintaining contributor workflow stability. [\"All Rust repositories are now managed through Infrastructure-as-Code, improving maintainability and security.\"] \n-",
        "id": 3296586,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/10/0449256/rusts-annual-tech-report-trusted-publishing-for-packages-and-a-crust-interop-strategy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rust's Annual Tech Report: Trusted Publishing for Packages and a C++/Rust Interop Strategy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T12:34:58.443810+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T11:34:00+00:00",
        "description": "xA California man sued Microsoft Thursday over its plan to stop supporting Windows 10 on October 14th, reports Courthouse News\n\n\nThough Windows 11 was launched nearly four years ago, many of its billion or so worldwide users are clinging to the decade-old Windows 10... According to StatCounter, nearly 43% of Windows users still use the old version on their desktop computers.... \n\n\"With only three months until support ends for Windows 10, it is likely that many millions of users will not buy new devices or pay for extended support,\" Klein writes in his complaint. \"These users &mdash; some of whom are businesses storing sensitive consumer data &mdash; will be at a heightened risk of a cyberattack or other data security incident, a reality of which Microsoft is well aware....\" According to one market analyst writing in 2023, Microsoft's shift away from Windows 10 will lead millions of customers to buy new devices and thrown out their old ones, consigning as many as 240 million PCs to the",
        "id": 3295910,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/10/0227259/microsoft-sued-over-plans-to-discontinue-windows-10-support?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Sued Over Plans to Discontinue Windows 10 Support",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T08:15:01.151362+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T07:34:00+00:00",
        "description": "AOL (now a Yahoo subsidiary) just announced its dial-up internet service will be discontinued at the end of September. \n\n\"The change also means the retirement of the AOL Dialer software and the AOL Shield browser, both designed for older operating systems and slow connections that relied on the familiar screech of a modem handshake,\" remembers Slashdot reader BrianFagioli (noting that dial-up Internet \"was once the gateway to the web for millions of households, back when speeds were measured in kilobits and waiting for a picture to load could feel like an eternity.\") \n\nAOL's dial-up service \"has been publicly available for 34 years,\" writes Tom's Hardware. But AppleInsider notes the move comes more than 40 years after AOL started \"as a very early Apple service.\"\nAOL itself started back in 1983 under the name Control Video Corporation, offering online services for the Atari 2600 console. After failing, it became Quantum Computer Services in 1985, eventually launching AppleLink in 1988 ",
        "id": 3294900,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/10/0626249/aol-finally-discontinues-its-dial-up-internet-access---after-34-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AOL Finally Discontinues Its Dial-Up Internet Access - After 34 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T04:59:51.325705+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T03:34:00+00:00",
        "description": "Last month Microsoft pledged $4 billion (in cash and AI/cloud technology) to \"advance\" AI education in K-12 schools, community and technical colleges, and nonprofits (according to a blog post by Microsoft President Brad Smith). But in the launch event video, Smith also says it's time to \"switch hats\" from coding to AI, adding that \"the last 12 years have been about the Hour of Code, but the future involves the Hour of AI.\" \n\nLong-time Slashdot reader theodp writes:\n\nThis sets the stage for Code.org CEO Hadi Partovi's announcement that his tech-backed nonprofit's [annual educational event] Hour of Code is being renamed to the Hour of AI... Explaining the pivot, Partovi says: \"Computer science for the last 50 years has had a focal point around coding that's been &mdash; sort of like you learn computer science so that you create code. There's other things you learn, like data science and algorithms and cybersecurity, but the focal point has been coding. \n\n\"And we're now in a world where ",
        "id": 3294340,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/10/0110212/hour-of-code-announces-its-now-evolving-into-hour-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Hour of Code' Announces It's Now Evolving Into 'Hour of AI'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-10T01:44:48.816962+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-10T01:34:00+00:00",
        "description": "After five months on the International Space Station, four astronauts splashed down in the Pacific Ocean in a SpaceX Crew Dragon capsule named Endurance, reports Space.com. \n\nIt was NASA's 10th commercial crew rotation mission:\n\n\nThe flight launched atop a SpaceX Falcon 9 rocket on March 14 and arrived at the orbiting lab two days later. Crew-10's four astronauts soon set to conducting science work, which consumed much of their time over the ensuing months... The wheels for Crew-10's departure began turning last Saturday (Aug. 2), when SpaceX's four-person Crew-11 mission arrived at the International Space Station. The Crew-10 astronauts spent a few days advising their replacements, then set their minds to gearing up for the return to Earth &mdash; and reflecting on their orbital experience. \n\n\"We got to accomplish a lot of really amazing operational things,\" Ayers said during a farewell ceremony on Tuesday (Aug. 5). \"We got to see some amazing views, and we have had some really big b",
        "id": 3293821,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/10/0038225/spacexs-crew-10-astronauts-return-to-earth-after-nearly-5-months-in-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SpaceX's Crew-10 Astronauts Return to Earth After Nearly 5 months in Space",
        "vote": 0
    }
]