[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T16:38:47.434205+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T16:30:07+00:00",
        "description": "Metal Gear Solid Delta: Snake Eater is finally bringing its long-awaited multiplayer mode, codenamed FOX Hunt, to accompany Konami's excellent recreation of the iconic story that showcased the origins of Big Boss. There's a lot to like, and a lot to learn about this online component that blends stealth and action into a gameplay loop that could get quite addictive.\n\nYou're going to want to learn more about your AT-CAMO Suit and Sense abilities before you dive in with your buddies, as this one will test your tactical skills and your nerves in equal measure. Join us as we take a dive into everything we know about FOX Hunt, and the potential roles we could take on as an operative of the mysterious unit.",
        "id": 3933691,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=8ROe5YTMIpc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8ROe5YTMIpc/hqdefault.jpg",
        "title": "Metal Gear Solid: Delta - Snake Eater Fox Hunt Mode -  EVERYTHING You Need To Know",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T15:28:16.410984+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T15:00:33+00:00",
        "description": "There is a very strong case to be made that Dragon Quest 1 and 2 HD2D is the best, most definitive version of these games to date – something that is hard to achieve when you are working with games of this stature, and doubly so when those games have had as many varying re-releases over the years as these two have had, and all of which have their own various fans and detractors. \n\nI feel like they bring together all the best parts of the previous releases of the game, add their own modern updates on top, wrap it all up in absolutely gorgeous audiovisual presentation, and do all of this without losing all the various merits, whether intended or borne out of the limitations that come from being a pioneer. And cumulatively, I think that makes both of these games well worth checking out in 2025. They are not the best Dragon Quest games, they are not the best RPGs you can play today - but they are still very much worth playing.",
        "id": 3932933,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=DsbHP1A8BQ4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DsbHP1A8BQ4/hqdefault.jpg",
        "title": "DRAGON QUEST I And II HD-2D Remake Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T14:14:33.352793+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T13:30:52+00:00",
        "description": "Everstone Studios’ Where Winds Meet is just around the corner and we're quite excited to try out its wuxia-based combat and traversal mechanics for ourselves. Its open world seems packed with things to do and discover and of course, enemies to fight and showcase your best moves against. \n\nWith a staggering amount of possible builds for your character and a story that's looking quite unpredictable with branching narrative paths, this one's sure to keep you entertained for quite a while. If you're thinking about diving into the game when it launches for the PC and PS5, you might want to check out our list of everything you need to know about it, and decide if it's the right fit for you.",
        "id": 3932282,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=_6VktqDS8I0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_6VktqDS8I0/hqdefault.jpg",
        "title": "Where Winds Meet PS5 Console Exclusive - 15 Things You NEED TO KNOW Before You Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T11:13:55.936433+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T09:45:05+00:00",
        "description": "The world – or Southern California, as Battlefield Studios tells me following its extended logo reveal – has changed. What seems like an innocuous disaster originating from Fort Lyndon could be a larger attack by the Pax Armata (aka those other guys you shot during the campaign). Your job is to jump, obtain intel and get out before other teams can stop you.\n\nIs this the most original approach for Battlefield: RedSec, EA's new free-to-play battle royale mode and the series' second stab at the genre following the underrated but ultimately underperforming Firestorm? Well, no. But, man, if it doesn't make for a stunning sight when dozens of helicopters swoop in over the ruined landscape, with military chatter buzzing through your headset. The same goes for the imaginatively-named Circle of Death – a slowly advancing wave of explosions that offers actual fear from instant death if caught inside.",
        "id": 3930768,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=zH7bx95M75s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zH7bx95M75s/hqdefault.jpg",
        "title": "Battlefield: RedSec Review - The Final Verdict",
        "vote": 0
    }
]