[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T22:46:07.778352+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T22:40:00+00:00",
        "description": "Grammarly is rebranding itself as \"Superhuman\" following its acquisition of the email client, while keeping its existing product names for now. Along with the rebrand, the company is launching \"Superhuman Go,\" an AI assistant that integrates with tools like Gmail, Jira, and Google Drive to enhance writing and automate productivity tasks. \"The assistant can use these connections to do tasks like logging tickets or fetching your availability when you're scheduling a meeting,\" adds TechCrunch. \"Superhuman said it plans to add functionality to enable the assistant to fetch data from sources like CRMs and internal systems to suggest changes to your emails.\"\n \n\"Users can try Superhuman Go by turning on a toggle in the Grammarly extension, which will let them connect it to different apps. Users can also try out different agents in the company's agent store, which include a plagiarism checker and a proofreader, launched in August.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<",
        "id": 3936914,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/29/2110239/grammarly-rebrands-to-superhuman-launches-a-new-ai-assistant",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Grammarly Rebrands To 'Superhuman,' Launches a New AI Assistant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T22:46:08.006155+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T22:02:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: Character.AI said on Wednesday that it would bar people under 18 from using its chatbots starting late next month, in a sweeping move to address concerns over child safety. The rule will take effect Nov. 25, the company said. To enforce it, Character.AI said, over the next month the company will identify which users are minors and put time limits on their use of the app. Once the measure begins, those users will not be able to converse with the company's chatbots. \"We're making a very bold step to say for teen users, chatbots are not the way for entertainment, but there are much better ways to serve them,\" said Karandeep Anand, Character.AI's chief executive. He said the company also plans to establish an AI safety lab.\n \nLast October, a Florida teenager took his own life after interacting for months with Character.AI chatbots imitating fictitious characters from the Game of Thrones. His mother filed a lawsuit against the co",
        "id": 3936915,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/29/213211/characterai-to-bar-children-under-18-from-using-its-chatbots",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Character.AI To Bar Children Under 18 From Using Its Chatbots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T21:31:46.418573+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T21:21:00+00:00",
        "description": "An anonymous reader shares a report: The FCC adopted a notice of proposed rulemaking (NPRM) to rescind and revise certain rules attached to consumer broadband labels. The measure passed on a two-to-one vote, with Commissioner Anna Gomez, the lone Democrat on the FCC, voting no and calling the notice \"one of the most anti-consumer items I have seen.\" \n\nThe vote was held at the Commission's open meeting for the month of October. As per a draft notice circulated earlier this month, the FCC is looking to roll back several rules, including requirements that service providers read the label to consumers via phone, itemize state and local pass-through fees, and display labels in consumer account portals, among others. Advocates at Public Knowledge urged the Commission to reconsider, saying in a recent filing that \"the Commission could create a permission structure for ISPs to continue to act without accountability.\" \n\nIn her remarks during Tuesday's open meeting, Commissioner Gomez appeared ",
        "id": 3936332,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/29/1744228/fccs-gomez-slams-move-to-revise-broadband-labels-as-anti-consumer",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FCC's Gomez Slams Move To Revise Broadband Labels as 'Anti-Consumer'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T21:31:46.515859+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T20:42:00+00:00",
        "description": "Microsoft shipped its first Xbox handheld nearly two weeks ago. The $600 white Xbox Ally cannot reliably sleep, wake, or hold a charge while asleep. Neither Microsoft nor Asus would admit there's a problem or offer a timeline to fix it after repeated requests by The Verge. Asus said it needs more time to test. \n\nInstalling Bazzite, a Linux-based operating system, solves the problems, the publication reports. The same hardware runs games up to 30% faster than Windows and beats the Steam Deck in all but one benchmark. Steam runs more responsively without Windows bloat. The device can be used like a Nintendo Switch, pausing games with the power button and resuming hours or days later. Bazzite initially had sleep issues but fixed them two days after programmer Antheas Kapenekakis obtained the hardware and consulted with two AMD contacts. The black Xbox Ally X, which doesn't have as many sleep issues, gets a similar speed boost with Bazzite. \n\nTwo Xbox Ally units tested on Windows repeated",
        "id": 3936333,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/29/1739232/windows-is-the-problem-with-windows-handhelds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows is the Problem With Windows Handhelds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T20:06:51.335086+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T20:01:00+00:00",
        "description": "Nvidia chief executive Jensen Huang said that maintaining the US edge in AI will require a steady approach that ensures China remains hooked on American technology. From a report: The chipmaker is in an \"awkward place\" as President Donald Trump prepares to meet with his Chinese counterpart Xi Jinping later this week, Huang told reporters Tuesday at a company conference in Washington. The Nvidia chief praised Trump's commitment to winning but urged careful engagement with China because of the country's massive software developer base and its growing technology capabilities. \n\nDuring the meeting, Trump and Xi are expected to finalize an agreement to ease trade tensions between the world's two largest economies. When it comes to those negotiations, Huang said he has \"no idea\" if GPUs -- the chips central to artificial intelligence capabilities -- will be a topic between Trump and Xi. \n\nHuang was careful to leave the negotiating to Trump but encouraged US leadership to think longer term o",
        "id": 3935755,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/29/1722259/us-needs-finesse-to-stay-ahead-of-china-nvidia-boss-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Needs 'Finesse' to Stay Ahead of China, Nvidia Boss Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T20:06:51.419461+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T19:21:00+00:00",
        "description": "An anonymous reader shares a report: The transition to the more-secure HTTPS web protocol has plateaued, according to Google. As of 2020, 95 to 99 percent of navigations in Chrome use HTTPS. To help make it safer for users to click on links, Chrome will enable a setting called Always Use Secure Connections for public sites for all users by default. This will happen in October 2026 with the release of Chrome 154. \n\nThe change will happen earlier for those who have switched on Enhanced Safe Browsing protections in Chrome. Google will enable Always Use Secure Connections by default in April when Chrome 147 drops. When this setting is on, Chrome will ask for your permission before it first accesses a public website that doesn't use HTTPS.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Chrome+Will+Finally+Default+To+Secure+HTTPS+Connections+Starting+in+April%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F10%2F2",
        "id": 3935756,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/29/1715202/google-chrome-will-finally-default-to-secure-https-connections-starting-in-april",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Chrome Will Finally Default To Secure HTTPS Connections Starting in April",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T18:48:37.112907+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T18:41:00+00:00",
        "description": "Blogger and technologist Anil Dash, writing about OpenAI's recently launched browser, Atlas: When I first got Atlas up and running, I tried giving it the easiest and most obvious tasks I could possibly give it. I looked up \"Taylor Swift showgirl\" to see if it would give me links to videos or playlists to watch or listen to the most popular music on the charts right now; this has to be just about the easiest possible prompt. \n\nThe results that came back looked like a web page, but they weren't. Instead, what I got was something closer to a last-minute book report written by a kid who had mostly plagiarized Wikipedia. The response mentioned some basic biographical information and had a few photos. Now we know that AI tools are prone to this kind of confabulation, but this is new, because it felt like I was in a web browser, typing into a search box on the Internet. And here's what was most notable: there was no link to her website. \n\nI had typed \"Taylor Swift\" in a browser, and the resp",
        "id": 3935063,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/29/177230/chatgpts-atlas-the-browser-thats-anti-web",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'ChatGPT's Atlas: The Browser That's Anti-Web'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T18:48:37.229703+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T18:01:00+00:00",
        "description": "YouTube says it will automatically upscale videos uploaded below 1080p (full-HD to higher resolution using AI. The Google-owned platform, however, assured that it will give creators and viewers the option to opt out of the enhancement. The feature will apply only to videos uploaded in resolutions from 240p to 720p and will not affect videos that creators have already remastered to 1080p. Creators will retain control over their original files, and viewers will be able to watch videos in their uploaded resolution through a settings option. \n\nYouTube said it plans to support upscaling to 4K in the near future. The company also said it is expanding the video thumbnail size limit from 2MB to 50MB to support 4K images. On videos with tagged products, viewers will soon be able to scan a QR code on TV screens to purchase items directly.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+Plans+Automatic+Upscaling+for+Low",
        "id": 3935064,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/29/1516225/youtube-plans-automatic-upscaling-for-low-res-videos",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Plans Automatic Upscaling for Low-Res Videos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T17:29:42.165787+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T17:22:00+00:00",
        "description": "The best way to innovate in gaming is to have good margins, that's according to Microsoft chief executive Satya Nadella. He made the comments during an interview days after Bloomberg reported that Microsoft has expected unrealistic profit margins from its gaming division, which the report suggested was a likely reason for studio closures, game cancelations and thousands of layoffs at Xbox. \n\nNadella used the word \"innovation\" at least five times during the interview but never offered specifics about what he meant by it. He said Microsoft needs to \"invent, maybe, some new interactive media\" because gaming's competition is short-form video rather than other games. The CEO described Microsoft's new gaming strategy as being \"everywhere, on every platform\" after comparing the company's game publishing business to Microsoft Office. He said \"the biggest gaming business is the Windows business\" and added that he is looking forward to \"the next console, the next PC gaming.\"<p><div class=\"share",
        "id": 3934345,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/29/1543218/microsoft-ceo-nadella-says-gaming-needs-good-margins-to-innovate-compares-strategy-to-office",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft CEO Nadella Says Gaming Needs Good Margins To Innovate, Compares Strategy To Office",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T17:29:42.361984+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T16:40:00+00:00",
        "description": "Hedge fund Apollo has reached a deal to sell AOL to Italian tech holding group Bending Spoons in a deal valued at roughly $1.5 billion, Axios reported Wednesday From the report: AOL still drives hundreds of millions of dollars of free cash flow. Bending Spoons CEO Luca Ferrari said AOL has around 30 million monthly active users across its email and web content properties. That \"incredibly loyal user base,\" as he called it, could be better served with greater investments in AOL's product and user experience, he noted. \n\n[...] Bending Spoons is a privately held Italian holding company that acquires assets with large user bases and invests in their turnaround with technology improvements. The company tends to sit on their investments long term after acquiring them. Some of the other companies Bending Spoons has acquired include Vimeo, Evernote, WeTransfer, Brightcove.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AOL+",
        "id": 3934346,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/29/1631223/aol-to-be-sold-to-bending-spoons-for-roughly-15-billion",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AOL To Be Sold To Bending Spoons For Roughly $1.5 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T16:17:38.412738+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T16:00:00+00:00",
        "description": "schwit1 writes: China has enacted a new law regulating social media influencers, requiring them to hold verified professional qualifications before posting content on sensitive topics such as medicine, law, education, and finance, IOL reported. The new law went into effect on Saturday. \n\nThe regulation was introduced by the Cyberspace Administration of China (CAC) as part of its broader effort to curb misinformation online. Under the new rules, influencers must prove their expertise through recognized degrees, certifications, or licenses before discussing regulated subjects. Major platforms such as Douyin (China's TikTok), Bilibili, and Weibo are now responsible for verifying influencer credentials and ensuring that content includes clear citations, disclaimers, and transparency about sources. \n\nAudiences expect influencers to be both creative and credible. Yet when they blur the line between opinion and expertise, the impact can be severe. A single misleading financial tip could wipe",
        "id": 3933521,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/29/147251/china-bars-influencers-from-discussing-professional-topics-without-relevant-degrees",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Bars Influencers From Discussing Professional Topics Without Relevant Degrees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T16:17:38.610124+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T15:21:00+00:00",
        "description": "Computer scientists at the University of Pennsylvania have proved that pricing algorithms can drive up prices even when they lack the capacity to collude. Aaron Roth and four colleagues studied so-called no-swap-regret algorithms, which are designed to minimize losses and were previously thought to guarantee competitive pricing. The researchers found that when such an algorithm faces an opponent using a nonresponsive strategy -- one that randomly selects from predetermined price probabilities without reacting to competitor moves -- both players can end up in equilibrium at high prices. \n\nNeither has an incentive to switch strategies because their profits are nearly equal and as high as possible under the circumstances. The nonresponsive strategy cannot express threats because it does not respond to opponent behavior, yet it effectively coaxes the learning algorithm into raising prices. Mallesh Pai, an economist at Rice University not involved in the research, said the finding matters ",
        "id": 3933522,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/29/1418252/the-game-theory-of-how-algorithms-can-drive-up-prices",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Game Theory of How Algorithms Can Drive Up Prices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T15:06:20.088931+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T14:26:00+00:00",
        "description": "Nvidia became the world's first $5 trillion company on Wednesday after its stock climbed 5% in early Wall Street trading to push its market capitalization to $5.13 trillion. The Silicon Valley chipmaker reached the milestone three months after hitting $4 trillion and three years after it was valued at roughly $400 billion before the debut of ChatGPT. \n\nNvidia chief executive Jensen Huang said Tuesday that Nvidia had secured half a trillion dollars in orders for its AI chips over the next five quarters. The stock had already gained 5% on Tuesday and added more than $200 billion to its market value. President Donald Trump said Wednesday he planned to discuss Nvidia's Blackwell chip with China's President Xi Jinping when the two leaders meet later this week. Nvidia's latest generation of graphics processing units is not currently available in China because of US export controls. The company's shares have risen more than 85% in the past six months.<p><div class=\"share_submission\" style=\"p",
        "id": 3932846,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/29/1426231/nvidia-becomes-worlds-first-5-trillion-company",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Becomes World's First $5 Trillion Company",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T15:06:20.461193+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T14:00:00+00:00",
        "description": "Bill Gates is retreating from his earlier warnings about climate change. The Microsoft co-founder now argues that what he called the \"doomsday view of climate change\" has caused the climate community to focus too heavily on near-term emissions goals and divert resources from addressing poverty and disease in the world's poorest countries. \n\nIn a blog post, Gates wrote that climate change will have serious consequences but will not lead to humanity's demise. He acknowledges that some climate advocates will call him a hypocrite given his own carbon footprint and his 2021 book warning that climate change could be as deadly as COVID-19 by mid-century and five times as deadly by 2100. \n\nThe poorest countries receive less than 1% of rich countries' budgets at their highest level and that this share is shrinking as wealthy nations cut aid and low-income countries struggle with debt, he wrote. Rising temperatures are now inevitable and that the current consensus suggests Earth's average tempe",
        "id": 3932847,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/29/1356258/gates-retreats-from-doomsday-climate-view-prioritizes-aid-to-poorest-countries",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gates Retreats From 'Doomsday' Climate View, Prioritizes Aid To Poorest Countries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T13:51:10.908079+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Politico: Sen. Tom Cotton wasn't fast enough in 2022 to block Senate passage of legislation that would make daylight saving time permanent. Three years later, he wasn't about to repeat that same mistake. The Arkansas Republican was on hand Tuesday afternoon to thwart a bipartisan effort on the chamber floor to pass a bill that would put an end to changing the clocks twice a year, including this coming Sunday. [...] A cross-party coalition of lawmakers has been trying for years to make daylight saving time the default, which would result in more daylight in the evening hours with less in the morning, plus bring to a halt to biannual clock adjustments.\n \nPresident Donald Trump endorsed the concept this spring, calling the changing of the clocks \"a big inconvenience and, for our government, A VERY COSTLY EVENT!!!\" His comments coincided with a hearing, then a markup, of Scott's legislation in the Senate Commerce Committee. It set off an intense lo",
        "id": 3932116,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/29/0321225/senator-blocks-trump-backed-effort-to-make-daylight-saving-time-permanent",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Senator Blocks Trump-Backed Effort To Make Daylight Saving Time Permanent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T10:40:55.207303+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T10:00:00+00:00",
        "description": "Longtime Slashdot reader zuki writes: According to a recent report over at Tom's Hardware, a number of those among early buyers who have been able to put the highly-coveted $4,000.00 DGX Spark mini-AI workstation through its paces are reporting throttling at 100W (rather than the advertised 240W capacity), spontaneous reboots, and thermal issues under sustained load. The workstation came under fire after John Carmack, the former CTO of Oculus VR, began raising questions about its real-world performance and power draw. \"His comments were enough to draw tech support from Framework and even AMD, with the offer of an AMD-driven Strix Halo-powered alternative,\" reports Tom's Hardware.\n \n\"What's causing this suboptimal performance, such as a firmware-level cap or thermal throttling, is not clear,\" the report adds. \"Nvidia hasn't commented publicly on Carmack's post or user-reported instability. Meanwhile, several threads on Nvidia's developer forums now include reports of GPU crashes and un",
        "id": 3930675,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/29/035247/early-reports-indicate-nvidia-dgx-spark-may-be-suffering-from-thermal-issues",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Early Reports Indicate Nvidia DGX Spark May Be Suffering From Thermal Issues",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T08:03:32.482786+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T07:00:00+00:00",
        "description": "China is accelerating its biotech ambitions by pushing the limits of animal testing and gene editing (source paywalled; alternative source) while Western countries tighten ethical restrictions. \"Editing the genes of large animals such as pigs, monkeys and dogs faces scant regulation in China,\" reports Bloomberg. \"Meanwhile, regulators in the US and Europe demand layers of ethical reviews, rendering similar research involving large animals almost impossible.\" From the report: Backing the work of China's scientists is not only permissiveness but state money. In 2023 alone, the Chinese government funneled an estimated $3 billion into biotech. Its sales of cell and gene therapies are projected to reach $2 billion by 2033 from $300 million last year. On the Chinese researchers' side are government-supported breeding and research centers for gene-edited animals and a public largely in approval of pushing the boundaries of animal testing.\n \nThe country should become \"a global scientific and ",
        "id": 3928589,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/29/0256250/china-pushes-boundaries-with-animal-testing-to-win-global-biotech-race",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Pushes Boundaries With Animal Testing to Win Global Biotech Race",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T08:03:32.561797+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Tuesday, Westinghouse announced that it had reached an agreement with the Trump administration that would purportedly see $80 billion of new nuclear reactors built in the US. And the government indicated that it had finalized plans for a collaboration of GE Vernova and Hitachi to build additional reactors. Unfortunately, there are roughly zero details about the deal at the moment. The agreements were apparently negotiated during President Trump's trip to Japan. An announcement of those agreements indicates that \"Japan and various Japanese companies\" would invest \"up to\" $332 billion for energy infrastructure. This specifically mentioned Westinghouse, GE Vernova, and Hitachi. This promises the construction of both large AP1000 reactors and small modular nuclear reactors. The announcement then goes on to indicate that many other companies would also get a slice of that \"up to $332 billion,\" many for basic grid infrastructure. The",
        "id": 3928590,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/28/2334207/westinghouse-is-claiming-a-nuclear-deal-would-see-80-billion-of-new-reactors",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Westinghouse Is Claiming a Nuclear Deal Would See $80 Billion of New Reactors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T08:03:32.643845+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T02:10:00+00:00",
        "description": "At TechCrunch Disrupt 2025, Waymo co-CEO Tekedra Mawakana said society will ultimately accept a fatal robotaxi crash as part of the broader tradeoff for safer roads overall. TechCrunch reports: The topic of a fatal robotaxi crash came up during Mawakana's interview with Kristen Korosec, TechCrunch's transportation editor, during the first day of the outlet's annual Disrupt conference in San Francisco. Korosec asked Mawakana about Waymo's ambitions and got answer after answer about the company's all-consuming focus on safety. The most interesting part of the interview arrived when Korosec brought on a thought experiment. What if self-driving vehicles like Waymo and others reduce the number of traffic fatalities in the United States, but a self-driving vehicle does eventually cause a fatal crash, Korosec pondered. Or as she put it to the executive: \"Will society accept that? Will society accept a death potentially caused by a robot?\"\n \n\"I think that society will,\" Mawakana answered, slo",
        "id": 3928591,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/28/2325205/society-will-accept-a-death-caused-by-a-robotaxi-waymo-co-ceo-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Society Will Accept a Death Caused By a Robotaxi, Waymo Co-CEO Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T08:03:32.728377+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T01:30:00+00:00",
        "description": "NVIDIA has introduced NVQLink, an open system architecture that directly connects quantum processors with GPU-based supercomputers. The Quantum Insider reports: The new platform connects the high-speed, high-throughput performance of NVIDIA's GPU computing with quantum processing units (QPUs), allowing researchers to manage the intricate control and error-correction workloads required by quantum devices. According to a NVIDIA statement, the system was developed with guidance from researchers at major U.S. national laboratories including Brookhaven, Fermi, Lawrence Berkeley, Los Alamos, MIT Lincoln, Oak Ridge, Pacific Northwest, and Sandia.\n \nQubits, the basic units of quantum information, are extremely sensitive to noise and decoherence, making them prone to errors. Correcting and stabilizing these systems requires near-instantaneous feedback and coordination with classical processors. NVQLink is meant to meet that demand by providing an open, low-latency interconnect between quantum ",
        "id": 3928592,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/28/2316251/nvidias-new-product-merges-ai-supercomputing-with-quantum",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia's New Product Merges AI Supercomputing With Quantum",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T08:03:32.874104+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T00:50:00+00:00",
        "description": "darwinmac writes: Ubuntu Unity is staring at a possible shutdown. A community moderator has gone public pleading for help, admitting the project is \"broken and needs to be fixed.\" Neowin reports the distro is suffering from critical bugs so severe that upgrades from 25.04 to 25.10 are failing and even fresh installs are hit. The moderator admits they lack the technical skill or time to perform a full rescue and is asking the broader community, including devs, testers, and UI designers, to step in so Ubuntu Unity can reach 26.04 LTS. If no one steps in soon, this community flavor might quietly fade away once more.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ubuntu+Unity+Faces+Possible+Shutdown+As+Team+Member+Cries+For+Help%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F28%2F231256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashp",
        "id": 3928593,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/28/231256/ubuntu-unity-faces-possible-shutdown-as-team-member-cries-for-help",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ubuntu Unity Faces Possible Shutdown As Team Member Cries For Help",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-29T08:03:33.035568+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-29T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from NBC News: Two senators said they are announcing bipartisan legislation on Tuesday to crack down on tech companies that make artificial intelligence chatbot companions available to minors, after complaints from parents who blamed the products for pushing their children into sexual conversations and even suicide. The legislation from Sens. Josh Hawley, R-Mo, and Richard Blumenthal, D-Conn., follows a congressional hearing last month at which several parents delivered emotional testimonies about their kids' use of the chatbots and called for more safeguards.\n \n\"AI chatbots pose a serious threat to our kids,\" Hawley said in a statement to NBC News. \"More than seventy percent of American children are now using these AI products,\" he continued. \"Chatbots develop relationships with kids using fake empathy and are encouraging suicide. We in Congress have a moral duty to enact bright-line rules to prevent further harm from this new technology.\" Sens. Ka",
        "id": 3928594,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/28/2113256/senators-announce-bill-that-would-ban-ai-chatbot-companions-for-minors",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Senators Announce Bill That Would Ban AI Chatbot Companions For Minors",
        "vote": 0
    }
]