[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-23T20:36:35.339142+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-23T19:30:03+00:00",
        "description": "Despite the relative lack of new triple-A racing sims, 2025 has been pretty kind with the indie and double-A titles. Assetto Corsa EVO is shaping up decently in early access after a troubled launch, and Tokyo Xtreme Racer is already adored (though its 1.0 version has been pushed back). JDM: Japanese Drift Master from Gaming Factory seemed to be another worthwhile addition.\n\nThe concept focuses on the street racing culture of Japan from the perspective of Thomas, who goes from sushi delivery to race wars, dealing with shadowy individuals and more, all told through manga. The gameplay offers an extensive open world and challenges you to get good at drifting.\n\nUnfortunately, iffy implementation, contradictory mission design, annoying AI, and much more get in the way. JDM: Japanese Drift Master still has some potential, but for now, more polish and content are needed to make it shine.",
        "id": 2757490,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ChBcuMrdcnA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ChBcuMrdcnA/hqdefault.jpg",
        "title": "JDM Japanese Drift Master Review - Could’ve Been So Much More",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-23T15:49:35.856137+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-23T15:30:29+00:00",
        "description": "Saber Interactive brought Space Marine back from a prolonged hiatus last year with Warhammer 40,000: Space Marine 2, and after the impressive critical and commercial success that the third person action game has enjoyed, Sega has now announced that it is set to release a remaster of the original Space Marine title, close to a decade and a half from its launch. \n\nWith 4K visuals, enhanced textures and character models, remastered audio, modernized controls, and more, the upcoming Warhammer 40,000: Space Marine – Master Crafted Edition is promising some solid improvements to the 2011 title, so we’re more than a little excited to get our hands on it.",
        "id": 2755169,
        "language": null,
        "link": "https://www.youtube.com/watch?v=c5m3sW-w25g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/c5m3sW-w25g/hqdefault.jpg",
        "title": "They're Remastering Warahmmer 40,000: Space Marine, And I’ve Never Been MORE READY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-23T14:44:27.602008+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-23T13:30:24+00:00",
        "description": "FBC: Firebreak is the upcoming co-operative shooter from Remedy Entertainment, a team famed for their signature weirdness and unpredictability in titles such as Alan Wake and Control. \n\nSet within the shapeshifting confines of the Bureau of Control’s The Oldest House, FBC: Firebreak presents a set of missions to eradicate the swarming transcendental threat, the Hiss, and restore order to the FBC’s headquarters before the Hiss spill out into the world at large. \n\nFirebreak is playable solo, but the game is designed for teams of three. There’s an assortment of unique skills, powers, and weapons to unlock which we’ll go over in this feature alongside what is sure to please many: this is not a live service game. \n\nCanonically set within Remedy’s Connected Universe, FBC: Firebreak will deliver a distinct spin on Remedy’s brand of trans-dimensional storytelling.",
        "id": 2754663,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Zr3Dvp_9Uw8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Zr3Dvp_9Uw8/hqdefault.jpg",
        "title": "FBC: Firebreak - 15 Things YOU NEED TO KNOW Before You Buy",
        "vote": 0
    }
]