[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T16:51:32.523291+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T16:00:44+00:00",
        "description": "Many extraction shooters have come and gone. Some have laid claim to the crown, notably Embark's ARC Raiders. However, the original, which started it all and has been in development since 2012, is finally emerging from the closed beta trenches. We're, of course, talking about Battlestate Games' Escape from Tarkov, a PvEvP extraction shooter set in the titular fictional city that's deteriorated into an anything-goes no man's land.\n\nLaunching on November 15th, Version 1.0 will add the finishing touches to the release and even mark the game's arrival on Steam. What can you expect, and how does this massive update cap off years of support? Let's dive into all of it.",
        "id": 4041234,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=QYpcWjB3Ziw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QYpcWjB3Ziw/hqdefault.jpg",
        "title": "Escape From Tarkov 1.0 - 15 NEW Things You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T13:45:39.629596+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T13:30:28+00:00",
        "description": "With Where Winds Meet now days away from its final release, the game's hype train is going full steam ahead, helped along by a new gameplay showcase that has us very interested to see what the adventure has to offer. \n\nThe world that Everstone has created seems to have layer upon layer of mystery, intrigue, lore, treasure, and legends to uncover as you make your way through Qinghe and Kiafeng. \n\nWith the lure of a post-launch roadmap of content, more details on the combat system and boss designs, and some exciting news on the exploratory and collectible fronts, join us for more things you should know about this ambitious action RPG, whose size and scope might just change the way developers and players think about the genre forever.",
        "id": 4039626,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Pla5cRZ5hV8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Pla5cRZ5hV8/hqdefault.jpg",
        "title": "Where Winds Meet - 15 BRAND NEW Details You May NOT KNOW",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T10:38:00.119067+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T10:00:19+00:00",
        "description": "Can a remaster of Sacred 2 manage to capture the magic of the original game in all its glory? That's what we set out to find out in our review, and there are some interesting thoughts that come up. Yes, it's a good idea to bring back classics for modern audiences to enjoy. But is a remaster enough? For Sacred 2, its story and the obvious charm of its world needed nothing new. \n\nBut sadly, that's not the case with its mechanics, combat systems, and animations. Other games have far surpassed the bold things the game aimed to do, and no amount of visual polishing can disguise the fact that the game's mechanics are too dated to be entertaining to audiences outside of enthusiasts. \n\nHowever, for those of you looking for that nostalgia factor, this one might be worth your time. It's a reminder of an era of gaming now forgotten, and perhaps that is its biggest strength.",
        "id": 4038407,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=86NNSCMvJLA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/86NNSCMvJLA/hqdefault.jpg",
        "title": "Sacred 2 Remaster Review - A Disappointing Effort",
        "vote": 0
    }
]