[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T23:47:43.179863+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T23:20:00+00:00",
        "description": "Dave Knott writes: Microsoft has released Visual Studio 2026, the first major version of their flagship compiler in almost four years. Release notes are available here. The compiler has also been updated, including improved (but not yet 100%) C++23 core language and standard library implementations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Visual+Studio+2026+Released%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F11%2F11%2F2213205%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F11%2F11%2F2213205%2Fvisual-studio-2026-released%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/25/11/11/2213205/visual-studio",
        "id": 4044666,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/11/2213205/visual-studio-2026-released",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Visual Studio 2026 Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T23:47:43.385011+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T22:50:00+00:00",
        "description": "Sony reported that PlayStation 5 sales have reached 84.2 million units, officially surpassing every Xbox console ever released. IGN reports: The PlayStation 5 is now up to 84.2 million copies sold after shifting an additional 3.9 million units during the three-month period ending September 30, Sony has announced. That's a slight increase on the 3.8 million PS5 units Sony sold during the same quarter last year, but it's an impressive result given the price of the console has actually gone up over the course of this generation, rather than come down. [...]\n \nAs an aside, unlike Sony, Microsoft does not make Xbox Series X and S sales figures public, but analysts have suggested the combined Xbox Series effort is being outsold by the PS5 by at least a factor of 2:1. The more appropriate comparison for the PS5 then, is with its predecessor, the PlayStation 4. Five years into the current console generation, the PS5 is slightly behind the PS4 (the PS4 sold-in to retailers more than 86.1 milli",
        "id": 4044667,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/11/2131217/ps5-has-now-officially-outsold-every-xbox-console-ever-released",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PS5 Has Now Officially Outsold Every Xbox Console Ever Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T22:47:03.768818+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T22:10:00+00:00",
        "description": "A Munich court ruled that OpenAI violated German copyright law by training its models on lyrics from nine songs and allowing ChatGPT to reproduce them. OpenAI now faces damages as it considers an appeal. Reuters reports: The regional court in Munich found that the company trained its AI on protected content from nine German songs, including Groenemeyer's hits \"Maenner\" and \"Bochum.\" The case was brought by German music rights society GEMA, whose members include composers, lyricists and publishers, in another sign of artists around the world fighting back against data scraping by AI.\n \nPresiding judge Elke Schwager ordered OpenAI to pay damages for the use of copyrighted material, without disclosing a figure.\nGEMA legal advisor Kai Welp said GEMA hoped discussions could now take place with OpenAI on how copyright holders can be remunerated. OpenAI had argued that its language models did not store or copy specific training data but, rather, reflected what they had learned based on the e",
        "id": 4044210,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/11/2124206/openai-used-song-lyrics-in-violation-of-copyright-laws-german-court-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Used Song Lyrics In Violation of Copyright Laws, German Court Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T21:37:24.850598+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T21:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The Big G is finally making good on its promise to add its market-leading Nano Banana image-editing model to the app. The model powers a couple of features, and it's not just for Google's Android platform. Nano Banana edits are also coming to the iOS version of the app. [...] The Photos app already had conversational editing in the \"Help Me Edit\" feature, but it was running an older non-fruit model that produced inferior results. Nano Banana editing will produce AI slop, yes, but it's better slop.\n \nGoogle says the updated Help Me Edit feature has access to your private face groups, so you can use names in your instructions. For example, you could type \"Remove Riley's sunglasses,\" and Nano Banana will identify Riley in the photo (assuming you have a person of that name saved) and make the edit without further instructions. You can also ask for more fantastical edits in Help Me Edit, changing the style of the image from top to bott",
        "id": 4043711,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/11/2119221/google-announces-even-more-ai-in-photos-app-powered-by-nano-banana",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Announces Even More AI In Photos App, Powered By Nano Banana",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T21:37:25.037335+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T20:48:00+00:00",
        "description": "FFmpeg, the open source multimedia framework that powers video processing in Google Chrome, Firefox, YouTube and other major platforms, has called on Google to either fund the project or stop burdening its volunteer maintainers with security vulnerabilities found by the company's AI tools. The maintainers patched a bug that Google's AI agent discovered in code for decoding a 1995 video game but described the finding as \"CVE slop.\" \n\nThe confrontation centered on a Google Project Zero policy announced in July that publicly discloses reported vulnerabilities within a week and starts a ninety-day countdown to full disclosure regardless of patch availability. FFmpeg, written primarily in assembly language, handles format conversion and streaming for VLC, Kodi and Plex but operates without adequate funding from the corporations that depend on it. Nick Wellnhofer resigned as maintainer of libxml2, a library used in all major web browsers, because of the unsustainable workload of addressing ",
        "id": 4043712,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/11/1947215/ffmpeg-to-google-fund-us-or-stop-sending-bugs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FFmpeg To Google: Fund Us or Stop Sending Bugs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T20:35:21.818034+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T20:09:00+00:00",
        "description": "Democratic U.S. Senator Elizabeth Warren is escalating pressure on the defense industry to stop opposing military right-to-repair legislation, as House and Senate negotiators work to finalize the fiscal 2026 National Defense Authorization Act. From a report: In a sharply-worded November 5 letter to the National Defense Industrial Association (NDIA) obtained by Reuters, Warren accused the industry group of attempting to undermine bipartisan efforts to give the Pentagon greater ability to repair weapons and equipment it owns. \n\nShe called the group's opposition \"a dangerous and misguided attempt to protect an unacceptable status quo of giant contractor profiteering.\" Currently, the government is often required to pay contractors like NDIA members Lockheed Martin, Boeing and RTX to use expensive original equipment and installers to service broken parts, versus having trained military maintainers 3D print spares in the field and install them faster and more cheaply.<p><div class=\"share_su",
        "id": 4043222,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/11/1917226/us-senator-challenges-defense-industry-on-right-to-repair-opposition",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Senator Challenges Defense Industry on Right-to-Repair Opposition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T20:35:22.086593+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T19:30:00+00:00",
        "description": "China has introduced a visa that will allow young foreign researchers in science, technology, engineering and mathematics to move there without having to secure a job first. From a report: Before the introduction of the K visa, most foreign STEM researchers hoping to move to China had to find a job in advance and then apply for a work visa. The Chinese government is making \"a serious bid\" to attract the world's brightest minds in STEM, says Jeremy Neufeld, the director of immigration policy at the Institute for Progress, a think tank in Washington DC. South Korea, Singapore and several other countries have also launched STEM-oriented visa programmes. \n\nThe K visa was officially rolled out on 1 October, but Nature understands that applications are yet to open. Few details about eligibility have been released, except that restrictions will apply on the basis of an applicant's age, education and work experience. Foreign researchers who have graduated from 'famous' universities or institu",
        "id": 4043223,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/11/1857233/chinas-new-scientist-visa-is-a-serious-bid-for-the-worlds-top-talent",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's New Scientist Visa is a 'Serious Bid' For the World's Top Talent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T19:33:54.194357+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T18:54:00+00:00",
        "description": "Animal testing in science would be phased out faster under a new plan to increase the use of artificial intelligence and 3D bioprinted human tissues, a UK minister has said. The Guardian: The roadmap unveiled by the science minister, Patrick Vallance, backs replacing certain animal tests that are still used where necessary to determine the safety of products such as life-saving vaccines and the impact pesticides have on living beings and the environment. The strategy says phasing out the use of animals in science can only happen when reliable and effective alternative methods with the same level of safety for human exposure can replace them. \n\nThe government said new funding for researchers and streamlined regulation would help develop methods such as organ-on-a-chip systems -- tiny devices that mimic how human organs work using real human cells. Greater use of AI to analyse vast amounts of data about molecules and predict whether new medicines will be safe and work well on humans wou",
        "id": 4042769,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/11/1854230/uk-unveils-plan-to-cut-animal-testing-through-greater-use-of-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Unveils Plan To Cut Animal Testing Through Greater Use of AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T18:30:45.926532+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T18:10:00+00:00",
        "description": "BrianFagioli writes: Mozilla has released Firefox 145.0, and the standout change in this version is the official end of support for 32-bit Linux systems. Users on 32-bit distributions will no longer receive updates and are being encouraged to switch to the 64-bit build to continue getting security patches and new features. While most major Linux distributions have already moved past 32-bit support, this shift will still impact older hardware users and lightweight community projects that have held on to 32-bit for the sake of performance or preservation. \n\nThe rest of the update introduces features such as built-in PDF comments, improved fingerprinting resistance for private browsing, tab group previews, password management in the sidebar, and minor UI refinements. Firefox also now compresses local translation models with Zstandard to reduce storage needs. But the end of 32-bit Linux support is the change that will leave the biggest mark, signaling another step toward a web ecosystem f",
        "id": 4042235,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/11/1757229/firefox-145-drops-support-for-32-bit-linux",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Firefox 145 Drops Support For 32-bit Linux",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T18:30:46.252989+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T17:30:00+00:00",
        "description": "The furious push by AI hyperscalers to build out data centers will need about $1.5 trillion of investment-grade bonds over the next five years and extensive funding from every other corner of the market, according to an analysis by JPMorgan. From a report: \"The question is not 'which market will finance the AI-boom?' Rather, the question is 'how will financings be structured to access every capital market?'\" according to strategists led by Tarek Hamid. \n\nLeveraged finance is primed to provide around $150 billion over the next half decade, they said. Even with funding from the investment-grade and high-yield bond markets, as well as up to $40 billion per year in data-center securitizations, it will still be insufficient to meet demand, the strategists added. Private credit and governments could help cover a remaining $1.4 trillion funding gap, the report estimates. The bank calculates an at least $5 trillion tab that could climb as high as $7 trillion, singlehandedly driving a reaccele",
        "id": 4042236,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/11/1730232/ais-5-trillion-cost-needs-every-debt-market-jpmorgan-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI's $5 Trillion Cost Needs Every Debt Market, JPMorgan Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T17:26:55.476026+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T16:42:00+00:00",
        "description": "The iPad Pro went on sale ten years ago, launching with a 12.9-inch screen that Apple believed would redefine computing through size alone. The company initially resisted making the device a laptop replacement and maintained strict limitations on multitasking, browser capabilities, and app installation. Over the past decade, Apple reversed course. The iPad Pro gained USB-C ports, external drive support, keyboard and trackpad accessories, and an improved Files app. \n\nThe current M5 model includes OLED screens in 13- and 11-inch sizes. iPadOS 26 added free-form multitasking, a menu bar and the Preview app. The webcam now sits in landscape orientation. Despite these advances, the device remains constrained by App Store-only software installation, The Verge writes, limited system access, and the absence of desktop-class browsers. Apple spent years positioning the iPad as a third category between phones and computers. The hardware and accessories now support full computer functionality, bu",
        "id": 4041721,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/11/1618220/the-ipad-pro-at-10-a-decade-of-unrealized-potential",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The iPad Pro at 10: a Decade of Unrealized Potential",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T16:26:30.646841+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T16:02:00+00:00",
        "description": "Apple has launched the iPhone Pocket, a knitted bag designed to hold iPhones. The limited edition collaboration with Japanese designer Issey Miyake costs $229.95 for the crossbody version. A shorter version is priced at $149.95. Apple said the 3D-knitted design was inspired by \"a piece of cloth\" and was born from the idea of creating an additional pocket for any iPhone and small everyday items. Yoshiyuki Miyamae, design director at Miyake Design Studio, said the product \"speaks to the bond between iPhone and its user\" and explores \"the joy of wearing iPhone in your own way.\" Steve Jobs mocked similar $29 iPod Socks as \"a revolutionary new product\" in 2004.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple's+%24230+iPhone+Sock%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F11%2F11%2F1533206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"",
        "id": 4041077,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/11/1533206/apples-230-iphone-sock",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's $230 iPhone Sock",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T16:26:30.914275+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T15:25:00+00:00",
        "description": "Sam Altman's Tools for Humanity has verified around 17.5 million people through its iris-scanning Orb device. The company has set a goal of reaching 1 billion users, so it is less than 2% of the way there. The startup has raised $240 million from investors including Andreessen Horowitz, Bain Capital and Khosla Ventures. PitchBook estimates its valuation at $2.5 billion. \n\nThe Orb is a volleyball-sized metal sphere that scans irises to generate a World ID. Users can claim tokens of the cryptocurrency Worldcoin, currently worth around 80 cents per coin. Business Insider spoke to former Tools for Humanity employees, a former Orb operator from Kenya, and a former head of operations in Mexico City. Some questioned whether the company had a clear long-term strategy. Nick Maynard, vice president of fintech market research at Juniper Research, said he does not see a killer use case that will drive major traction. The company also continues to face regulatory headwinds. In October, agencies in",
        "id": 4041078,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/11/158200/sam-altmans-worldcoin-project-struggles-toward-billion-user-ambition-with-175-million-sign-ups",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sam Altman's Worldcoin Project Struggles Toward Billion-User Ambition With 17.5 Million Sign-Ups",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T15:23:43.237131+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T14:45:00+00:00",
        "description": "Samsung is rolling out new conversational AI across its 2025 TVs that lets users ask questions about what's on the screen and beyond it. From a report: First announced in September, the generative AI update is rolling out now with support for several languages. Vision AI Companion is based on an upgraded, generative AI-based version of Samsung's virtual assistant Bixby. Samsung suggests you can use it to ask questions about on-screen content -- what that actor is famous for, who painted that artwork, or what the final score was in a football game. It can go beyond that though, offering TV and movie recommendations along with cooking advice, travel tips, and local restaurant discovery.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung+Brings+Generative+AI-Powered+Bixby+To+Its+TVs%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F11%2F11%2F1444257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img sr",
        "id": 4040518,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/11/1444257/samsung-brings-generative-ai-powered-bixby-to-its-tvs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung Brings Generative AI-Powered Bixby To Its TVs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T14:22:51.682539+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T14:01:00+00:00",
        "description": "The UK and China today signed a new bilateral agreement on scientific collaboration [non-paywalled source], narrowing the scope of their partnership to exclude sensitive technologies. Lord Patrick Vallance, Britain's science and technology minister, met his Chinese counterpart Chen Jiachang in Beijing and agreed to focus cooperation on health, climate, planetary sciences, and agriculture. \n\nThe previous agreement from 2017 had included satellites, remote sensing technology and robotics. Those fields are absent from the new accord. The countries announced no new funding for joint research. Vallance said the UK had \"deliberately gone for areas which we think are not carrying such a security risk.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK+Signs+Scaled-Back+Scientific+Collaboration+With+China%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F11%2F11%2F1355205%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"",
        "id": 4039987,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/11/1355205/uk-signs-scaled-back-scientific-collaboration-with-china",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Signs Scaled-Back Scientific Collaboration With China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T10:16:04.247408+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T10:00:00+00:00",
        "description": "Longtime Slashdot reader theodp writes: The UK Department for Education is \"replacing its narrowly focused computer science GCSE with a broader, future-facing computing GCSE [General Certificate of Secondary Education] and exploring a new qualification in data science and AI for 16-18-year-olds.\" The move aims to correct unintended consequences of a shift made more than a decade ago from the existing ICT (Information and Communications Technology) curriculum, which focused on basic digital skills, to a more rigorous Computer Science curriculum at the behest of major tech firms and advocacy groups to address concerns about the UK's programming talent pipeline.\n \nThe UK pivot from rigorous CS to AI literacy comes as tech-backed nonprofit Code.org leads a similar shift in the U.S., pivoting from its original 2013 mission calling for rigorous CS for U.S. K-12 students to a new mission that embraces AI literacy. Code.org next month will replace its flagship Hour of Code event with a new Ho",
        "id": 4038305,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/11/0125233/uk-secondary-schools-pivoting-from-narrowly-focused-cs-curriculum-to-ai-literacy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Secondary Schools Pivoting From Narrowly Focused CS Curriculum To AI Literacy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T07:10:39.122123+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T07:00:00+00:00",
        "description": "China's CO2 emissions have been flat or falling for 18 months, \"adding evidence to the hope that the world's biggest polluter has managed to hit its target of peak CO2 emissions well ahead of schedule,\" reports the Guardian. From the report: Rapid increases in the deployment of solar and wind power generation -- which grew by 46% and 11% respectively in the third quarter of this year -- meant the country's energy sector emissions remained flat, even as the demand for electricity increased. China added 240GW of solar capacity in the first nine months of this year, and 61GW of wind, putting it on track for another renewable record in 2025. Last year, the country installed 333GW of solar power, more than the rest of the world combined. [...]\n \nThe analysis by the Centre for Research on Energy and Clean Air (Crea), for the science and climate policy website Carbon Brief, found China's CO2 emissions were unchanged from a year earlier in the third quarter of 2025, thanks in part to declinin",
        "id": 4037532,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/11/0119210/chinas-co2-emissions-have-been-flat-or-falling-for-past-18-months-analysis-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's CO2 Emissions Have Been Flat Or Falling For Past 18 Months, Analysis Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T04:07:01.593944+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Gizmodo: It appears that Neom -- Saudi Arabia's hugely expensive, architecturally bizarre urban development project -- is floundering and close to collapse. A new report from the Financial Times cites high-level sources within the project to paint a picture of dysfunction and failure at the heart of the quixotic effort. Neom was envisioned as a vast series of fantastical urban developments spread across the coast of the Red Sea. At the center of the project is The Line -- a proposed 105-mile-long city which developers had initially projected could house as many as 9 million people by the year 2030.\n \nThe Line is defined by bizarre architectural flourishes that, as the story notes, have seemed impossible even to the execs tasked with making them a reality. One such addition is an upside-down building, dubbed \"the chandelier,\" that is supposed to hang over a \"gateway\" marina to the city: \"As architects worked through the plans, the chandelier beg",
        "id": 4036740,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/10/238215/saudi-arabias-dystopian-futuristic-city-project-is-crashing-and-burning",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Saudi Arabia's Dystopian Futuristic City Project Is Crashing and Burning",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T03:06:22.641778+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T02:20:00+00:00",
        "description": "Slashdot reader alternative_right shares an exclusive BBC interview with Vyacheslav \"Tank\" Penchukov, once a top-tier cyber-crime boss behind Jabber Zeus, IcedID, and major ransomware campaigns. His story traces the evolution of modern cybercrime from early bank-theft malware to today's lucrative ransomware ecosystem, marked by shifting alliances, Russian security-service ties, and the paranoia that ultimately consumes career hackers. Here's an excerpt from the report: In the late 2000s, he and the infamous Jabber Zeus crew used revolutionary cyber-crime tech to steal directly from the bank accounts of small businesses, local authorities and even charities. Victims saw their savings wiped out and balance sheets upended. In the UK alone, there were more than 600 victims, who lost more than $5.2 million in just three months. Between 2018 and 2022, Penchukov set his sights higher, joining the thriving ransomware ecosystem with gangs that targeted international corporations and even a hos",
        "id": 4036506,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/10/2320251/a-jailed-hacking-kingpin-reveals-all-about-cybercrime-gang",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Jailed Hacking Kingpin Reveals All About Cybercrime Gang",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T02:03:02.339272+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T01:40:00+00:00",
        "description": "The European Commission is considering turning its non-binding 2020 guidance on \"high-risk vendors\" into a legal requirement that would effectively force EU member states to phase out Huawei and ZTE from mobile and fixed-line networks. Bloomberg reports: Commission Vice President Henna Virkkunen wants to convert the European Commission's 2020 recommendation to stop using high-risk vendors in mobile networks into a legal requirement, according to the people, who asked not to be identified because the negotiations are private. While infrastructure decisions rest with national governments, Virkkunen's proposal would compel EU countries to align with the commission's security guidance.\n \nThe EU is increasingly focused on the risks posed by Chinese telecom equipment makers as trade and political ties with its second-largest trading partner fray. The concern is that handing over control of critical national infrastructure to companies with such close ties to Beijing could compromise nationa",
        "id": 4036197,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/11/10/2257257/eu-eyes-banning-huawei-zte-corp-from-mobile-networks-of-member-countries",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU Eyes Banning Huawei, ZTE Corp From Mobile Networks of Member Countries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T01:02:44.011961+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T01:00:00+00:00",
        "description": "Linux kernel developers are moving toward enabling Microsoft C Extensions (-fms-extensions) by default in Linux 6.19, with Linus Torvalds signaling no objection. While some dislike relying on Microsoft-style behavior, the patches in kbuild-next suggest the project is ready to \"bite the bullet\" and adopt the extensions system-wide. Phoronix reports: Rasmus Villemoes argued with Kbuild: enable -fms-extensions that would allow for \"prettier code\" and others have noted in the past the potential for saving stack space and all around being beneficial in being able to leverage the Microsoft C behavior: \"Once in a while, it turns out that enabling -fms-extensions could allow some slightly prettier code. But every time it has come up, the code that had to be used instead has been deemed 'not too awful' and not worth introducing another compiler flag for. That's probably true for each individual case, but then it's somewhat of a chicken/egg situation. If we just 'bite the bullet' as Linus says ",
        "id": 4035958,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/10/2250251/the-linux-kernel-looks-to-bite-the-bullet-in-enabling-microsoft-c-extensions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Linux Kernel Looks To 'Bite the Bullet' In Enabling Microsoft C Extensions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-11T01:02:44.345609+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-11T00:20:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Privacy activists say proposed changes to Europe's landmark privacy law, including making it easier for Big Tech to harvest Europeans' personal data for AI training, would flout EU case law and gut the legislation. The changes proposed by the European Commission are part of a drive to simplify a slew of laws adopted in recent years on technology, environmental and financial issues which have in turn faced pushback from companies and the U.S. government.\n \nEU antitrust chief Henna Virkkunen will present the Digital Omnibus, in effect proposals to cut red tape and overlapping legislation such as the General Data Protection Regulation, the Artificial Intelligence Act, the e-Privacy Directive and the Data Act, on November 19. According to the plans, Google, Meta Platforms, OpenAI and other tech companies may be allowed to use Europeans' personal data to train their AI models based on legitimate interest.\n \nIn addition, companies may be exe",
        "id": 4035959,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/10/2237230/critics-call-proposed-changes-to-landmark-eu-privacy-law-death-by-a-thousand-cuts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Critics Call Proposed Changes To Landmark EU Privacy Law 'Death By a Thousand Cuts'",
        "vote": 0
    }
]