[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T20:34:38.496450+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T19:30:03+00:00",
        "description": "The wait for GTA 6 may be longer than we initially anticipated but thankfully, a 2D GTA-like can tide us over, right? Well, it might if you can tolerate the zany gameplay and lopsided story. Deliver At All Costs is a wacky delivery game in an isometric view from the debut indie studio, Far Out Games. \n\nOne of the main things I admire about it is how varied each of the missions are. There’s also a free roam aspect in between these missions, which allows players to explore the mid 20th century towns. Though mind the long loading in between districts in addition to poor graphical quality.\n\nOn top of the gameplay, there’s also quite an involved story here, though your milage may vary as to its quality.",
        "id": 2811160,
        "language": null,
        "link": "https://www.youtube.com/watch?v=YU_5wTh-8RI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YU_5wTh-8RI/hqdefault.jpg",
        "title": "Can This 2D GTA-Like Game Tide Us Over Until GTA 6? [Deliver At All Costs Review]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T16:13:37.416396+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T15:30:08+00:00",
        "description": "We have been hoping for a Half-Life 3 for what feels like an eternity at this point, and though we have had no shortage of rumors and reports about the same over the years, it’s gotten to a point where it’s hard not to just instantly dismiss such claims. \n\nRecently, however, there have been plenty more reports that have once again claimed that a new non-VR mainline Half Life game is in development at Valve, and advanced enough in production that it could actually be fairly close to an announcement. \n\nWhether or not that’s actually true remains to be seen, but here, we unpack this fresh batch of rumors.",
        "id": 2808945,
        "language": null,
        "link": "https://www.youtube.com/watch?v=FNY68PdVSwQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FNY68PdVSwQ/hqdefault.jpg",
        "title": "Is Half-Life 3 REALLY HAPPENING?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T15:08:28.109927+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T14:00:07+00:00",
        "description": "Between the encroaching Night's Tide, numerous hostile bosses, and teammates who seem to know the ins and outs of the map, Elden Ring Nightreign can be an overwhelming experience. There doesn't seem to be enough time to understand what's going on, and while repeated runs will help, it's good to know a few things beforehand.\n\nFor example, every boss has a weakness, and it's a good idea to stock up on weapons or spells that exploit that, even if they don't seem to \"fit\" your Nightfarer. Vendors can help obtain certain weapons, but you're better off visiting them on Day 2 since enough loot drops as is. Coordinating attacks with your teammates is all well and good, but if you can combo Ultimates, then it makes some of the battles much easier.\n\nThese are only a handful of tips. Let's break down even more to ensure a smooth experience, especially when dealing with the tougher challenges that Limveld has to offer.",
        "id": 2808290,
        "language": null,
        "link": "https://www.youtube.com/watch?v=4BBosCVs8KY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4BBosCVs8KY/hqdefault.jpg",
        "title": "15 Things I Wish I Knew Before Playing Elden Ring Nightreign",
        "vote": 0
    }
]