[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T23:25:54.693767+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T22:50:00+00:00",
        "description": "Instagram now supports 3:4 aspect ratio photos, allowing users to upload images that \"appear just exactly as you shot it.\" Instagram head Adam Mosseri announced the update in a Threads post, noting that \"almost every phone camera defaults to\" that format. The Verge reports: An image from Instagram's broadcast channel shows how the change makes a difference. You can already post images with a rectangular aspect ratio of 4:5, but with 3:4, your photo won't be cropped at the ends. 3:4 photos are supported with single-photo uploads and with carousels, according to the channel. If you want, you can still post photos with a square or 4:5 aspect ratio.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Instagram+Isn't+Just+For+Square+Photos+Anymore%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F05%2F30%2F2146239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a",
        "id": 2812250,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/30/2146239/instagram-isnt-just-for-square-photos-anymore?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Instagram Isn't Just For Square Photos Anymore",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T22:21:45.893426+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T22:10:00+00:00",
        "description": "BrianFagioli shares a report from BetaNews: Microsoft just can't leave well enough alone. The company is now injecting formatting features into Notepad, a program that has long been appreciated for one thing -- its simplicity. You see, starting with version 11.2504.50.0, this update is rolling out to Windows Insiders in the Canary and Dev Channels, and it adds bold text, italics, hyperlinks, lists, and even headers. Sadly, this isn't a joke. Notepad is actually being turned into a watered-down word processor, complete with a formatting toolbar and Markdown support. Users can even toggle between styled content and raw Markdown syntax. And while Microsoft is giving you the option to disable formatting or strip it all out, it's clear the direction of the app is changing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Tests+Notepad+Text+Formatting+In+Windows+11%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2",
        "id": 2811956,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/30/2138237/microsoft-tests-notepad-text-formatting-in-windows-11?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Tests Notepad Text Formatting In Windows 11",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T22:21:46.050886+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T21:35:00+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: If you've left a comment on a YouTube video, a new website claims it might be able to find every comment you've ever left on any video you've ever watched. Then an AI can build a profile of the commenter and guess where you live, what languages you speak, and what your politics might be. The service is called YouTube-Tools and is just the latest in a suite of web-based tools that started life as a site to investigate League of Legends usernames. Now it uses a modified large language model created by the company Mistral to generate a background report on YouTube commenters based on their conversations. Its developer claims it's meant to be used by the cops, but anyone can sign up. It costs about $20 a month to use and all you need to get started is a credit card and an email address.\n \nThe tool presents a significant privacy risk, and shows that people may not be as anonymous in the YouTube comments sections as they may think. The sit",
        "id": 2811957,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/30/2133227/developer-builds-tool-that-scrapes-youtube-comments-uses-ai-to-predict-where-users-live?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Developer Builds Tool That Scrapes YouTube Comments, Uses AI To Predict Where Users Live",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T21:15:45.686861+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T20:50:00+00:00",
        "description": "Amazon has quietly removed billions of product listings through a confidential initiative called \"Bend the Curve,\" according to Business Insider. The project planned to eliminate at least 24 billion ASINs -- unique product identifiers -- from Amazon's marketplace, reducing the total from a projected 74 billion to under 50 billion by December 2024. The purge targets \"unproductive selection\" including poor-selling items, listings without actual inventory, and product pages inactive for over two years. \n\nThe initiative represents a shift for the company that built its reputation as \"The Everything Store\" through three decades of relentless catalog expansion. Bend the Curve forms part of CEO Andy Jassy's broader cost-cutting strategy, saving Amazon's retail division over $22 million in AWS server costs during 2024 by reducing the number of hosted product pages.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Purge",
        "id": 2811539,
        "language": null,
        "link": "https://slashdot.org/story/25/05/30/1954240/amazon-purges-billions-of-product-listings-in-cost-cutting-drive?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Purges Billions of Product Listings in Cost-Cutting Drive",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T21:15:45.862561+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T20:10:00+00:00",
        "description": "United Airlines CEO Scott Kirby has harsh words for budget carriers, calling their business model \"dead.\" \n\n\"It's dead. Look, it's a crappy model. Sorry,\" he said when asked about the budget airline approach. Kirby argued that budget carriers like Southwest, Spirit, and Frontier built their operations around what he characterized as customer-hostile practices, saying \"The model was, screw the customer ... Trick people, get them to buy, get them to come, and then charge them a whole bunch of fees that they aren't expecting.\" \n\nHe said he believes that these airlines struggle to retain customers once they reach sufficient scale to require repeat business.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=United+Chief+Dismisses+Budget+Airline+Model+as+'Dead'+and+'Crappy'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F30%2F1946239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_",
        "id": 2811540,
        "language": null,
        "link": "https://slashdot.org/story/25/05/30/1946239/united-chief-dismisses-budget-airline-model-as-dead-and-crappy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "United Chief Dismisses Budget Airline Model as 'Dead' and 'Crappy'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T20:10:19.633462+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T19:30:00+00:00",
        "description": "WordPress.com parent company Automattic is changing direction... again. From a report: In a blog post titled \"Returning to Core\" published Thursday evening, Automattic announced it will unpause its contributions to the WordPress project. This is despite having said only last month that the 6.8 WordPress release would be the final major release for all of 2025. \n\n\"After pausing our contributions to regroup, rethink, and plan strategically, we're ready to press play again and return fully to the WordPress project,\" the new blog post states. \"Expect to find our contributions across all of the greatest hits -- WordPress Core, Gutenberg, Playground, Openverse, and WordPress.org. This return is a moment of excitement for us as it's about continuing the mission we've always believed in: democratizing publishing for everyone, everywhere,\" it reads. \n\nAutomattic says it's learned a lot from the pause in terms of the many ways WordPress is used, and that it's now committed to helping it \"grow a",
        "id": 2811077,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/30/1918217/automattic-says-it-will-start-contributing-to-wordpress-again-after-pause?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Automattic Says It Will Start Contributing To WordPress Again After Pause",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T20:10:19.790981+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T18:54:00+00:00",
        "description": "Major broadband lobby groups have asked the Trump administration to sue states that require internet service providers to offer low-cost plans to low-income residents, following their unsuccessful court challenges against such laws. The cable, telecom, and mobile industry associations filed the request this week with the Justice Department's new Anticompetitive Regulations Task Force, specifically targeting New York's law that mandates $15 and $20 monthly broadband options for eligible customers. \n\nThe industry groups suffered a significant legal defeat when the Supreme Court refused to hear their challenge to New York's affordability mandate in December 2024, after losing in federal appeals court. Now they face a potential wave of similar legislation, with California proposing $15 plans offering 100 Mbps speeds and ten other states considering comparable requirements.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=",
        "id": 2811078,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/30/1854205/isps-ask-justice-department-to-sue-states-over-low-income-broadband-mandates-after-court-losses?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "ISPs Ask Justice Department To Sue States Over Low-Income Broadband Mandates After Court Losses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T18:54:12.155757+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T18:15:00+00:00",
        "description": "Lovable, a Swedish startup that allows users to create websites and apps through natural language prompts, failed to address a critical security vulnerability for months after being notified, according to a new report. A study by Replit employees found that 170 of 1,645 Lovable-created applications exposed sensitive user information including names, email addresses, financial data, and API keys that could allow hackers to run up charges on customers' accounts. \n\nThe vulnerability, published this week in the National Vulnerabilities Database, stems from misconfigured Supabase databases that Lovable's AI-generated code connects to for storing user data. Despite being alerted to the problem in March, Lovable initially dismissed concerns and only later implemented a limited security scan that checks whether database access controls are enabled but cannot determine if they are properly configured.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://",
        "id": 2810514,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/30/1810246/the-hottest-new-vibe-coding-startup-may-be-a-sitting-duck-for-hackers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Hottest New Vibe Coding Startup May Be a Sitting Duck For Hackers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T17:49:09.828605+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T17:41:00+00:00",
        "description": "An anonymous reader shares a report: In a landmark ruling advancing efforts to hold major polluters accountable for transnational climate-related harms, on May 28 a German court concluded that a corporation can be held liable under civil law for its proportional contribution to global climate change, Climate Rights International said today. \n\nFiled in 2015, the case against German energy giant RWE AG challenged the corporation to pay for its proportional share of adaptation costs needed to protect the Andean city of Huaraz, Peru, from a flood from a glacial lake exacerbated by global warming. RWE AG, one of Europe's largest emitters, is estimated to be responsible for approximately 0.47% of global historical global greenhouse gas emissions. \n\n\"This groundbreaking ruling confirms that corporate emitters can no longer hide behind borders, politics, or scale to escape responsibility,\" said Lotte Leicht, Advocacy Director at Climate Rights International. \"The court's message is clear: maj",
        "id": 2810029,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/30/1741255/german-court-confirms-civil-liability-for-corporate-climate-harms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "German Court Confirms Civil Liability for Corporate Climate Harms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T17:49:09.988776+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T16:44:00+00:00",
        "description": "An anonymous reader shares a report: Some of the citations that underpin the science in the White House's sweeping \"MAHA Report\" appear to have been generated using artificial intelligence [non-paywalled source], resulting in numerous garbled scientific references and invented studies, AI experts said Thursday. Of the 522 footnotes to scientific research in an initial version of the report sent to The Washington Post, at least 37 appear multiple times, according to a review of the report by The Post. \n\nOther citations include the wrong author, and several studies cited by the extensive health report do not exist at all, a fact first reported by the online news outlet NOTUS on Thursday morning. Some references include \"oaicite\" attached to URLs -- a definitive sign that the research was collected using artificial intelligence. The presence of \"oaicite\" is a marker indicating use of OpenAI, a U.S. artificial intelligence company. A common hallmark of AI chatbots, such as ChatGPT, is unu",
        "id": 2810030,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/30/1643248/maha-report-found-to-contain-citations-to-nonexistent-studies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "MAHA Report Found To Contain Citations To Nonexistent Studies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T16:44:12.585903+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T16:13:00+00:00",
        "description": "The three largest U.S. airlines are charging solo travelers higher fares than passengers booking for two or more people on select domestic routes, a pricing strategy analysts believe targets business travelers, according to fare analysis by travel publication Thrifty Traveler. \n\nAmerican Airlines, United Airlines and Delta Air Lines implement the practice by opening different fare categories based on passenger count. United charges $269 for a solo traveler flying from Chicago O'Hare to Peoria, while two passengers pay $181 each for identical seats. American's Charlotte-to-Fort Myers route costs solo travelers $422 versus $266 per person for pairs. \n\nThe airlines appear to be \"segmenting\" customers by charging business travelers paying with corporate cards more while offering better deals to families booking together. Solo travelers are more likely to be business flyers using employer funds and \"less likely to care about paying another $80 or more,\" according to the analysis.<p><div cl",
        "id": 2809415,
        "language": null,
        "link": "https://slashdot.org/story/25/05/30/1614212/us-airlines-are-quietly-hitting-solo-and-business-travelers-with-higher-fares?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Airlines Are Quietly Hitting Solo and Business Travelers With Higher Fares",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T15:39:13.394045+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T15:25:00+00:00",
        "description": "Almost 40% of glaciers in existence today are already doomed to melt due to climate-heating emissions from fossil fuels, a study has found. The Guardian: The loss will soar to 75% if global heating reaches the 2.7C rise for which the world is currently on track. The massive loss of glaciers would push up sea levels, endangering millions of people and driving mass migration, profoundly affecting the billions reliant on glaciers to regulate the water used to grow food, the researchers said. \n\nHowever, slashing carbon emissions and limiting heating to the internationally agreed 1.5C target would save half of glacier ice. That goal is looking increasingly out of reach as emissions continue to rise, but the scientists said that every tenth-of-a-degree rise that was avoided would save 2.7tn tonnes of ice.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Almost+40%25+of+World's+Glaciers+Already+Doomed+Due+To+Climate+Crisis%3",
        "id": 2808777,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/30/153212/almost-40-of-worlds-glaciers-already-doomed-due-to-climate-crisis?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Almost 40% of World's Glaciers Already Doomed Due To Climate Crisis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T15:39:13.551887+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T14:48:00+00:00",
        "description": "Google has begun automatically generating AI-powered email summaries for Gmail Workspace users, eliminating the need to manually trigger the feature that has been available since last year. The company's Gemini AI will now independently determine when longer email threads or messages with multiple replies would benefit from summarization, displaying these summaries above the email content itself. The automatic summaries currently appear only on mobile devices for English-language emails and may take up to two weeks to roll out to individual accounts, with Google providing no timeline for desktop expansion or availability to non-Workspace Gmail users.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Gmail's+AI+Summaries+Now+Appear+Automatically%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F30%2F1448240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a ",
        "id": 2808778,
        "language": null,
        "link": "https://slashdot.org/story/25/05/30/1448240/gmails-ai-summaries-now-appear-automatically?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gmail's AI Summaries Now Appear Automatically",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T14:34:11.764007+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T14:07:00+00:00",
        "description": "An anonymous reader shares a report: Negotiations are under way between the UAE and OpenAI that may make the company's ChatGPT Plus artificial intelligence chatbot available to all residents free of charge, though a final deal has not been reached. \n\nAn agreement involving ChatGPT Plus would be part of the recently announced Stargate UAE infrastructure plan to create an AI hub in Abu Dhabi, according to a source familiar with the country's AI strategy. Abu Dhabi's AI company G42 has partnered with OpenAI, Oracle and Nvidia to set up Stargate UAE, a 1-gigawatt computing cluster that will operate in the newly established 5GW UAE -- US AI Campus.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+and+UAE+in+Talks+For+Free+ChatGPT+Plus+For+All%2C+Report+Says%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F30%2F147218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_larg",
        "id": 2808238,
        "language": null,
        "link": "https://slashdot.org/story/25/05/30/147218/openai-and-uae-in-talks-for-free-chatgpt-plus-for-all-report-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI and UAE in Talks For Free ChatGPT Plus For All, Report Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T10:54:59.302722+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T10:00:00+00:00",
        "description": "sinij shares a report from the BBC: France's National Assembly has voted to abolish low-emission zones, a key measure introduced during President Emmanuel Macron's first term to reduce city pollution. So-called ZFEs (zones a faibles emissions) have been criticized for hitting those who cannot afford less-polluting vehicles the hardest. A handful of MPs from Macron's party joined opposition parties from the right and far right in voting 98-51 to scrap the zones, which have gradually been extended across French cities since 2019. [...]\n \nThe low-emission zones began with 15 of France's most polluted cities in 2019 and by the start of this year had been extended to every urban area with a population of more than 150,000, with a ban on cars registered before 1997. Those produced after 1997 need a round \"Crit'Air\" sticker to drive in low-emission zones, and there are six categories that correspond to various types of vehicle. The biggest restrictions have been applied in the most polluted ",
        "id": 2806491,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/30/0410208/french-mps-vote-to-scrap-low-emission-zones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "French MPs Vote To Scrap Low-Emission Zones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T07:40:01.265585+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T07:00:00+00:00",
        "description": "For the first time, scientists have directly observed atmospheric sputtering in action on Mars -- an erosion process driven by solar wind ions that may have played a major role in the planet's atmospheric and water loss. ScienceAlert reports: The only spacecraft with the equipment and orbital configuration to make these observations is NASA's MAVEN. The researchers carefully pored over the data collected by the spacecraft since it arrived in Mars orbit in September 2014, looking to find simultaneous observations of the solar electric field and an upper atmosphere abundance of argon -- one of the sputtered particles, used as a tracer for the phenomenon. They found that, above an altitude of 350 kilometers (217 miles), argon densities vary depending on the orientation of the solar wind electric field, compared to argon densities at lower altitudes that remain consistent.\n \nThe results showed that lighter isotopes of argon vary, leaving behind an excess of heavy argon -- a discrepancy th",
        "id": 2805330,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/30/040234/scientists-have-clear-evidence-of-martian-atmosphere-sputtering?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Have Clear Evidence of Martian Atmosphere 'Sputtering'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T04:22:47.027346+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Whether it is doing sums or working out what to text your new date, some tasks produce a furrowed brow. Now scientists say they have come up with a device to monitor such effort: an electronic tattoo, stuck to the forehead. The researchers say the device could prove valuable among pilots, healthcare workers and other professions where managing mental workload is crucial to preventing catastrophes. \"For this kind of high-demand and high-stake scenario, eventually we hope to have this real-time mental workload decoder that can give people some warning and alert so that they can self-adjust, or they can ask AI or a co-worker to offload some of their work,\" said Dr Nanshu Lu, an author of the research from the University of Texas at Austin, adding the device may not only help workers avoid serious mistakes but also protect their health.\n \nWriting in the journal Device, Lu and colleagues describe how using questionnaires to investigate",
        "id": 2804473,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/29/222251/e-tattoo-could-track-mental-workload-for-people-in-high-stake-jobs-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'E-Tattoo' Could Track Mental Workload For People In High-Stake Jobs, Study Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T01:07:46.223905+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-30T00:20:00+00:00",
        "description": "Amazon has launched a new innovation-focused team called ZeroOne, led by Xbox co-creator J Allard, to develop breakthrough consumer products across hardware and software. CNBC reports: The ZeroOne team is spread across Seattle, San Francisco and Sunnyvale, California, and is focused on both hardware and software projects, according to job postings from the past month. The name is a nod to its mission of developing emerging product ideas from conception to launch, or \"zero to one.\" [...] The new group is being led by J Allard, who spent 19 years at Microsoft, most recently as technology chief of consumer products, a role he left in 2010, according to his LinkedIn profile. He was a key architect of the Xbox game console, as well as the Zune, a failed iPod competitor.\n \nAllard joined Amazon in September, and the company confirmed at the time that he would be part of the devices and services team under Panos Panay, who left Microsoft for Amazon in 2023 to lead the group. An Amazon spokesp",
        "id": 2803732,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/29/2149241/amazon-taps-xbox-co-founder-to-develop-breakthrough-consumer-products?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Taps Xbox Co-Founder To Develop 'Breakthrough' Consumer Products",
        "vote": 0
    }
]