[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-15T16:22:32.878785+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-15T15:30:37+00:00",
        "description": "FromSoftware’s Elden Ring Nightreign is an upcoming standalone, co-op multiplayer experience nestled within Elden Ring’s nightmarish universe. It looks like Elden Ring, with combat very reminiscent of the skirmishes you’ll have overcome in The Lands Between, but the overall experience is something different: rapid-fire exploration, loot gathering, streamlined upgrades, and a cast of pre-determined characters. \n\nCharacters whom we’ve dubbed heroes for this feature as assessing Elden Ring Nightreign at face value it appears FromSoftware are trying their hand at the hero shooter, potentially rivalling Apex Legends or Fortnite. \n\nAs Elden Ring Nightreign is landing close to a host of other upcoming co-op games, ARC Raiders, Marathon, etc,  there’s a lot resting on its shoulders if it’s to climb to the top of the pile.",
        "id": 2688110,
        "language": null,
        "link": "https://www.youtube.com/watch?v=z3_zFamcyIQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z3_zFamcyIQ/hqdefault.jpg",
        "title": "Why Elden Ring Nightreign Will Undoubtedly Be The BIGGEST GAME OF THE YEAR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-15T14:12:28.204597+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-15T13:30:36+00:00",
        "description": "More than a decade on from Mario Kart 8’s original launch, the next game in the beloved kart racing series is finally almost here, and it’s arriving in the form of the flagship launch title for the next big Nintendo console. \n\nMario Kart World’s launch is not too far away now, and it’s shaping up to be an exciting launch title for the Nintendo Switch 2, with everything from its new open world approach to new gameplay mechanics both big and small coming together in promising fashion based on everything that we have seen of the game so far. \n\nHere, we’re going to look at all of those details and more.",
        "id": 2686703,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ey2gIxNtlh4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ey2gIxNtlh4/hqdefault.jpg",
        "title": "Mario Kart World - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]