[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T19:13:16.412844+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T18:01:04+00:00",
        "description": "#shorts #tedx #ted #birds #migration #nature #ornithology #science",
        "id": 4172569,
        "language": "en",
        "link": "https://www.youtube.com/shorts/pTK-TV1eOis",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pTK-TV1eOis/hqdefault.jpg",
        "title": "Lessons from a bird's journey #shorts #tedx",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:53.306330+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T17:01:49+00:00",
        "description": "In this deeply human talk, Rashida Jones reflects on the stories that have stayed with her throughout her career—from breaking news to moments of quiet bravery. She makes the case that journalism, at its best, is an act of service: a way to witness, to hold power accountable, and to remind us of our shared humanity. At a moment when trust is fragile, Jones offers a hopeful vision for how storytelling can still move society forward. Rashida Jones is a television executive and the former President of MSNBC, making history as the first Black woman to lead a major cable news network. She became president in February 2021 and previously served as Senior Vice President at NBC News and MSNBC, where she was an executive producer for major events and programming. A graduate of Hampton University, her career also includes producing roles at The Weather Channel and local news stations. \nEarly career: Jones started her career as a producer for local news affiliates, including WTKR-TV, and later m",
        "id": 4171810,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=46zDmJPUhb8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/46zDmJPUhb8/hqdefault.jpg",
        "title": "The stories that shape us: Why journalism still matters | Rashida Jones | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:53.487056+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T17:01:35+00:00",
        "description": "This is a profoundly moving dialogue between Leonor Varela and Mono Gana, two women who have transformed deep pain into a path of service and connection.\n\nThey explore how the memory of a loved one who 'moves on to another plane' can be kept alive through everyday gestures and moments that capture their essence. They discuss the discovery of a new secret language, rich with synchronicities and deciphered only by the heart, that emerges in absence and redefines connection, transcending life itself.\n\nDrawing from her work at Casa Familia Foundation, Mono Gana joins Leonor to reflect on the nature of unconditional love, resilience and the profound meaning of empathy during life's most challenging times. This encounter invites us to recognise new ways of loving and remembering. Leonor Varela is an internationally recognized actress and dedicated activist. She is also a prominent Chilean cultural figure and mother. Varela is the author of the memoir, \"Ir al cielo y Volver\" (Go to Heaven an",
        "id": 4171811,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=M9LY48Ut3L8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/M9LY48Ut3L8/hqdefault.jpg",
        "title": "Grief to Synchronicity: Dialogue on Unconditional Love | Leonor Varela & Monica Gana | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:53.668289+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T17:01:21+00:00",
        "description": "Riya Sharma raises a question: what if the future is already reading everything we do today? Through vivid storytelling and insightful examples from buried time capsules to the digital footprints of social media, Riya shows how ordinary actions, creativity, and choices quietly shape the legacy of humanity. Her talk invites audiences to see daily life as a living archive, where kindness, curiosity, and imagination can inspire generations to come. A call to action for thoughtful, intentional living: “Create today, inspire endless tomorrows.” Riya Sharma is currently pursuing  Bachelor of Business Administration from GNA University and is in her second year of study. She has a strong interest in learning about the business concepts, management strategies and the functioning of organizations in today’s competitive world. Apart from her academic pursuits, Riya is passionate about reading books, especially fictional stories, which allow her to explore different worlds, characters, and emoti",
        "id": 4171812,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CdyUplKAlo4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CdyUplKAlo4/hqdefault.jpg",
        "title": "What if the future is already reading everything done today? | Riya Sharma | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:53.860569+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T17:01:08+00:00",
        "description": "What if laziness isn’t a personal flaw, but a symptom of misalignment? In this talk, I challenge the myth that people don’t care or don’t try and suggest instead that many people are mismatched to environments that don’t activate their energy, values, or sense of purpose.  Siphiwe Moyo is a sought-after and highly rated International Keynote Speaker, Author, and OD Facilitator. A Southern African Speaker Hall of Fame and a Southern African Educator Hall of Fame Inductee, Siphiwe is a safe pair of hands for Executives trying to solve people-related issues in organisations. He’s a seasoned HR practitioner and Organisational Behaviour specialist. He is the Executive Director at the Organisational Behaviour Institute. \nSiphiwe's unique blend of academically sound content, motivating storytelling, humour, and practical, implementable takeaway points—relatable to executives and the shop floor—sets him apart as a distinguished global speaker.\nSiphiwe designed the initial postgraduate module ",
        "id": 4171813,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ANp-5SGknuU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ANp-5SGknuU/hqdefault.jpg",
        "title": "You're not lazy, just mismatched | Siphiwe Moyo | TEDxUniversityofJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:54.064187+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T17:00:46+00:00",
        "description": "In my talk, I introduce the term Ukonga, a Zulu word that is likely familiar to most African households. It means using sparingly, avoiding waste, and consuming with others in mind. In other words: Reduce, Reuse, Recycle. \n\n“We were sustainable long before it became an urgent call to action or a catchphrase.” \n Sibonisile Ngubane Cossa is an Award-winning Public Relations Specialist with over a decade experience in  Marketing & Communications. She is the founder of Purecoms, a Sustainability Marketing Agency aimed at advancing people and the planet through purposeful communication. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4171814,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pyyBTVxFiZE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pyyBTVxFiZE/hqdefault.jpg",
        "title": "Ukonga: Africa’s Forgotten Blueprint | Sibonisile Ngubane Cossa | TEDxUniversityofJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:54.268267+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T17:00:37+00:00",
        "description": "In this talk, I aim to draw attention to the often-overlooked role of the architect not just as a designer of “pretty buildings,” but as someone who shapes the way we live, breathe, heal, connect, and grow. Architecture is not just about structures; it’s about systems. It's about shaping environments that shape people. The chairs we sit on, the classrooms we learn in, the homes we find comfort in, these are not accidents. They are designed. So, what do architects really do? We create life’s silent framework.  O’haji Vuyani Ndlovu is a professional senior architectural technologist, writer, and creative thinker based in South Africa. Currently studying his B Arch Hons at The Graduate School of Architecture (GSA), Faculty of Art, Design & Architecture at the University of Johannesburg. He explores the intersection between design, ethics, and everyday life. O’haji is passionate about creating spaces that not only look good, but feel right—spaces that foster connection, dignity, and care.",
        "id": 4171815,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FcUxSxsWgf8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FcUxSxsWgf8/hqdefault.jpg",
        "title": "What do architects really do? | O'Haji Vuyani Ndlovu | TEDxUniversityofJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:54.402770+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T17:00:01+00:00",
        "description": "We’ve long been told that leaders should be decisive, unshakable, and always in control. But what if the real power of leadership lies in something quieter—something braver?\n\nVulnerability.\n\nThis series explores the strength it takes to admit you don’t have all the answers, to ask for help, to say, “I was wrong.” In a culture that rewards polished exteriors, we’re celebrating the leaders who choose honesty over perfection, connection over control.\n\nThrough their stories, we’ll witness how vulnerability can drive trust, fuel innovation, and transform workplaces—and lives. These talks are not about breakdowns, but breakthroughs. About the courage to be seen, even when it's uncomfortable. Especially when it matters most.\n\nThis is not leadership as usual. This is leadership, redefined Sonal Bhatia, MD is introducing mindful leadership as the norm, rather than the exception. \n\nShe was a physician first. Then the first woman to serve as Chief Medical Officer in Pfizer’s Rare Disease divisio",
        "id": 4171816,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=i22bK-3DHsE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/i22bK-3DHsE/hqdefault.jpg",
        "title": "Breaking the cycle of normative misery | Sonal Bhatia, MD | TEDxYorkville Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:54.602217+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:59:49+00:00",
        "description": "Speaking as a voice, an echo from the future, my message is both simple and urgent: there is always a choice to choose otherwise. Even in compromised systems, even in moments that feel insignificant (like my morning commutes), our choices reverberate. As we navigate the present, we are constantly shaping the kind of society we will pass down to future generations. This talk is a call to awareness and courage. It is a reminder that our everyday decisions, whether seen or unseen, are seeds of our collective legacy. Thatohatsi Radihlare is a passionate difference maker and proud alumna of the University of Johannesburg. She believes that regardless of circumstances, we are all in the process of becoming: constantly evolving toward an elevated version of ourselves. With authenticity, integrity, and excellence at the heart of her work, Thatohatsi leads conversations that inspire change and choices that shape a better tomorrow.\n\nHer journey began in Bloemfontein at the Central University of",
        "id": 4171817,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1hchdAO1LN8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1hchdAO1LN8/hqdefault.jpg",
        "title": "The legacy of everyday choices | Thatohatsi Radihlare | TEDxUniversityofJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:54.844207+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:59:45+00:00",
        "description": "What if the most transformative leadership strategy isn’t power, pressure, or perfection - but love? In her TEDx talk, Yuliia Paslon challenges traditional leadership by showing how trust, empathy and psychological safety outperform fear-driven cultures. She reveals that love isn’t a feeling in leadership, it’s a measurable action that fuels creativity, retention and courageous contribution. Yuliia Paslon (also known as Julia Paslyon) is a dynamic force in the hotel industry with over a decade of leadership in sales, marketing and brand development across some of the sector’s most iconic properties.\n\nFrom heritage-rich city hotels in Dubai to high-volume clusters in Moscow and leisure hubs in St. Petersburg, Julia has consistently driven commercial success and brand innovation. Currently leading Sales & Marketing at the first Radisson RED in the Middle East, she has helped pioneer bold initiatives including outside catering divisions, event concepts and entirely new revenue streams, s",
        "id": 4171818,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=JjFd4bttDU4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JjFd4bttDU4/hqdefault.jpg",
        "title": "What If Love Was The Strategy? | Yuliia Paslon | TEDxAl Wasl",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:55.107362+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:58:51+00:00",
        "description": "We’ve long been told that leaders should be decisive, unshakable, and always in control. But what if the real power of leadership lies in something quieter—something braver?\n\nVulnerability.\n\nThis series explores the strength it takes to admit you don’t have all the answers, to ask for help, to say, “I was wrong.” In a culture that rewards polished exteriors, we’re celebrating the leaders who choose honesty over perfection, connection over control.\n\nThrough their stories, we’ll witness how vulnerability can drive trust, fuel innovation, and transform workplaces—and lives. These talks are not about breakdowns, but breakthroughs. About the courage to be seen, even when it's uncomfortable. Especially when it matters most.\n\nThis is not leadership as usual. This is leadership, redefined From the time her younger brother was old enough to sit at a desk, Beth Cocuzza knew she was a teacher. She worked in the classroom until 2002, and then pivoted to work in higher education management. She he",
        "id": 4171819,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=o2GxnG1CWbQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/o2GxnG1CWbQ/hqdefault.jpg",
        "title": "How Fiction Helped me Recover from a Toxic Workplace | Beth Cocuzza | TEDxYorkville Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:55.437691+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:58:42+00:00",
        "description": "In this insightful Talk, Shweta draws from her dual experiences as a tech professional and a contributor to Army women’s welfare to explore how meaningful creation truly happens. She explains the cycle of creation — beginning with an idea, moving through ideation, prototyping, testing, empathizing, and finally evolving into something impactful. Shweta Poddar is a seasoned Technology Advisor with over 15 years of corporate IT experience, currently working with a leading MNC. An alumna of IIT Roorkee, she has guided several Fortune 500 firms through their digital transformation journeys worldwide.\n\nBeyond the boardroom, Shweta chairs the Family Welfare Organization (FWO) under the Army Women Welfare Association (AWWA), empowering over 500 Army families through initiatives in education, wellness, and financial independence. A passionate mental health advocate, she collaborates with the Art of Living Foundation to promote peace and emotional well being. This talk was given at a TEDx event",
        "id": 4171820,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=A4pW13XbKSQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/A4pW13XbKSQ/hqdefault.jpg",
        "title": "Ideas In Motion | Shweta Poddar | TEDxYouth@TheModernSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:55.735992+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:58:39+00:00",
        "description": "We’ve long been told that leaders should be decisive, unshakable, and always in control. But what if the real power of leadership lies in something quieter—something braver?\n\nVulnerability.\n\nThis series explores the strength it takes to admit you don’t have all the answers, to ask for help, to say, “I was wrong.” In a culture that rewards polished exteriors, we’re celebrating the leaders who choose honesty over perfection, connection over control.\n\nThrough their stories, we’ll witness how vulnerability can drive trust, fuel innovation, and transform workplaces—and lives. These talks are not about breakdowns, but breakthroughs. About the courage to be seen, even when it's uncomfortable. Especially when it matters most.\n\nThis is not leadership as usual. This is leadership, redefined Bridgett Strickler sits in the \"adult learner space\" as Vice President of Coalition Strategy at CAEL (Council for Adult and Experiential Learning).\n\nWhen she got sober 14 years ago and understood for the fir",
        "id": 4171821,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wWOOlg2o7gU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wWOOlg2o7gU/hqdefault.jpg",
        "title": "How community can help rebuild your life | Bridgett Strickler | TEDxYorkville Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:55.944571+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:58:31+00:00",
        "description": "In this insightful Talk, Shweta draws from her dual experiences as a tech professional and a contributor to Army women’s welfare to explore how meaningful creation truly happens. She explains the cycle of creation — beginning with an idea, moving through ideation, prototyping, testing, empathizing, and finally evolving into something impactful. Dr. Swayam Prabha Das, a Humphrey Fellow (2007–08), heads Policy Research and Planning at Development Alternatives Group. With 26 years in climate change, circular economy, and sustainable livelihoods, she has contributed to India’s G20 climate agenda and actively engages with global forums advancing environmental policy, equity, and education. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4171822,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2jVuUNpetHg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2jVuUNpetHg/hqdefault.jpg",
        "title": "Ocean's Cry for Care | Swayamprabha Das | TEDxYouth@TheModernSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:56.121653+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:58:23+00:00",
        "description": "We’ve long been told that leaders should be decisive, unshakable, and always in control. But what if the real power of leadership lies in something quieter—something braver?\n\nVulnerability.\n\nThis series explores the strength it takes to admit you don’t have all the answers, to ask for help, to say, “I was wrong.” In a culture that rewards polished exteriors, we’re celebrating the leaders who choose honesty over perfection, connection over control.\n\nThrough their stories, we’ll witness how vulnerability can drive trust, fuel innovation, and transform workplaces—and lives. These talks are not about breakdowns, but breakthroughs. About the courage to be seen, even when it's uncomfortable. Especially when it matters most.\n\nThis is not leadership as usual. This is leadership, redefined Patrizia Angela Casubolo is an inventor. Her divorce devastated her whole world, but put her on a path to reinvention herself.\n\nWhile pregnant with her first child, Francesca, she went seeking waistband exte",
        "id": 4171823,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=u_jPJytaZ5g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/u_jPJytaZ5g/hqdefault.jpg",
        "title": "Adaptable Conviction: Build Something from Nothing | Patrizia Angela Casubolo | TEDxYorkville Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:59:56.531538+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:58:15+00:00",
        "description": "In this reflective Talk, Sarita Nirjhara invites us on a journey of self-awareness, empathy, adaptability, and creativity — the four threads that weave a meaningful human experience. Through a series of simple yet powerful stories and reflections, she explores how genuine care and conscious connection can awaken the creator within each of us. Sarita Nirjhra is the founder of Manthan Foundation and KalaManthan, where she champions emotional intelligence and digital awareness among children and women in rural India. With a background in early childhood education and soft skills training, she leverages storytelling and engagement to cultivate empathetic learners and responsible digital citizens. As a freelance writer for The Times of India, Sarita blends educational insight with cultural narratives, crafting meaningful dialogues on learning, safety, and growth. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more",
        "id": 4171824,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Z2URJCL4SmM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z2URJCL4SmM/hqdefault.jpg",
        "title": "Meeting The World Gently | Sarita Nirjhara | TEDxYouth@TheModernSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:42.951808+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:16:27+00:00",
        "description": "\"... เวลานี้เราขาดคนที่จะยอมตนเป็น \"อิฐก้อนแรก\" ที่ทิ้งลงไปและจมอยู่ที่นั่น เพื่อให้ก้อนอื่นๆ ถมทับตนอยู่ที่นั่น และเสร็จแล้วเจ้าก้อนที่จะปรากฏเป็นผู้รู้จักของสังคม ก็คือก้อนที่อยู่เหนือคนอื่นสุด ส่วนก้อนแรกสุดก็จมดินอยู่นั่นเอง...\" — โกมล คีมทอง\n\nในโลกของการออกแบบและการศึกษา อาจไม่ใช่ทุกคนที่เลือกจะเป็น \"อิฐก้อนแรก\" แต่ อาจารย์พรเทพ ฉัตรภิญญาคุปต์ คือหนึ่งในไม่กี่คนที่ทำเช่นนั้นมาตลอดชีวิตการทำงาน\n\nอดีตประธานหลักสูตร Industrial Design คณะสถาปัตยกรรมศาสตร์และการออกแบบ มจธ. อดีตผู้อำนวยการ KMUTT City Center (CODE) และอาจารย์ผู้สอนและวิจัยด้าน Human-Centered Design มากว่า 20 ปี อาจารย์พรเทพเลือกจะวางรากฐานให้กับการออกแบบที่เชื่อมโยง \"มนุษย์ สังคม และวัฒนธรรม\"\nแทนที่จะออกแบบเพื่อความหวือหวา อาจารย์เลือกออกแบบเพื่อ “ชีวิตจริง” ของผู้คน\n\nทอล์กของอาจารย์พรเทพจะไม่ได้มีแค่เรื่องของการออกแบบ\nแต่คือการตั้งคำถามว่า... เราพร้อมจะยอมเป็นอิฐก้อนแรก เพื่อสร้างสิ่งที่ใหญ่กว่าตัวเราหรือยัง? - This talk was given at a TEDx event using the TED conference format but independently organized by a local co",
        "id": 4171032,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MKtQlmXjsOA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MKtQlmXjsOA/hqdefault.jpg",
        "title": "(มอง) เห็น เป็น เปล่า | Pornthep Chatpinyakoop | TEDxKMUTT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:43.113902+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:16:19+00:00",
        "description": "Rahul Sachar challenges the common belief that financial freedom is about earning more. He reframes freedom as a mindset shaped by awareness, discipline, and early habits. Through simple principles, real-life examples, and the power of compounding, he demystifies modern investment avenues and shows how anyone, regardless of background can build long-term financial security. It’s a call to shift from income-focused thinking to informed decision-making, proving that financial freedom begins not with money, but with understanding. Rahul Sachar, founder of PunjiBaazar Pvt. Ltd., has established the company as an early-stage investment platform focused on high-growth businesses entering the J-curve of expansion. With over 11 years of experience in the investing ecosystem, he has developed deep expertise in India’s unlisted and pre-IPO markets. Turning his passion for investing into a successful enterprise, he has achieved multiple high-value exits across startups and pre-IPO opportunities.",
        "id": 4171033,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Wh-Z5hcH3sM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Wh-Z5hcH3sM/hqdefault.jpg",
        "title": "Financial Freedom Beyond Money | Rahul Sachar | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:43.324872+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:16:11+00:00",
        "description": "Beena Srivastava reframes selling from a pressured transaction into an act of empowerment. She explores the “Helper’s Paradox”, the belief that one can serve others but shouldn’t receive in return and reveals how genuine selling helps people invest in their own growth. Through relatable insights and honest reflections, she shows how selling rooted in integrity becomes a catalyst for belief, confidence, and meaningful transformation. With over a decade of corporate experience working with international brands, Beena Srivastava wanted a life of freedom, balance, and deeper purpose. She transitioned from the corporate world to help people live and lead with authenticity. Along the way, she realized that many talented mentors failed not because they lacked skill, but because they couldn’t align with pushy sales tactics. That insight led her to create her Heart-Centered Sales System — a soulful, ethical way to sell that creates impact and income with ease. Today, Beena empowers people to b",
        "id": 4171034,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zN-OmiojQTs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zN-OmiojQTs/hqdefault.jpg",
        "title": "The Helper’s Paradox: The Transformative Power of Selling | Beena Srivastava | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:43.595877+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:16:03+00:00",
        "description": "In her talk, Arshdeep Kaur explores why authenticity has become one of the rarest and most powerful, forms of courage today. She reflects on how societal expectations, silent pressures, and everyday conditioning slowly push people away from their true selves. Through relatable insights and practical reflections, she reveals how small acts of honesty can rebuild confidence, deepen connection, and inspire a quiet but transformative rebellion: the choice to be real in a world of constant performance. Arshdeep Kaur, currently pursuing bachelors of commerce (Honours) at GNA University. Driven by deep interest in the fields of accounting and finance, she has chosen this academic path as a stepping stone towards a distinguished professional carrier as a Chartered Accountant.  She is currently a part of NEC E-Cell IIT Bombay and IIC member. Known for her ability to multitask effectively, she is a dedicated and enthusiastic individual. She has done many declamation as well as anchoring in her ",
        "id": 4171035,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qQ6GkRC13iw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qQ6GkRC13iw/hqdefault.jpg",
        "title": "The Courage to Be Real | Arshdeep Kaur | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:43.786072+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:15:55+00:00",
        "description": "Atul Bhardwaj addresses one of India’s deepest dilemmas: the confusion millions of students face after class 10. Through compelling stories, including the journey of a young boy, Atul illustrates how societal pressure and lack of guidance often steer talented youth away from their true potential. He reframes career guidance as life approach, emphasizing self-awareness, clarity, and purpose over mere academic choices. With actionable advice for students and parents alike, Atul inspires a shift from confusion to clarity—helping every young Indian chart a path that aligns with their mind, passion, and potential. Atul Bhardwaj is an Educational Consultant, Mind Trainer, Author and Social Worker with over 35 years of experience in mentoring students and professionals. His association with Shaheed Sukhdev College of Business Studies, University of Delhi, and other academic institutions has enabled him to guide thousands in academic pathways, career clarity, life skills and personal developm",
        "id": 4171036,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=AsU_Id96rAM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AsU_Id96rAM/hqdefault.jpg",
        "title": "Find Your Spark: Fuel Your Career | Atul Bhardwaj | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:44.003147+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:15:42+00:00",
        "description": "Mitali Jain is redefining what it means to live life with courage, dignity, and unstoppable spirit. Born with Down syndrome, just at the age of 19, she has transformed every label into a stepping stone; mastering swimming, dance, computers, theatre, and even entrepreneurship. In her talk, Mitali shares how confidence, consistent effort, and a strong sense of self-worth helped her rise above judgment and build a life filled with purpose. She inspires a larger idea: when society replaces limitation with inclusion, extraordinary potential unfolds. An artist, performer, and entrepreneur, Mitali is redefining what it means to live life to the fullest. Born with Down syndrome, she has turned every challenge into a canvas of possibility — from painting vibrant artworks and performing on stage to walking fashion ramps with confidence. As the proud founder of P.Pods by Mitali, a healthy snack brand promoting mindful living, she proves that passion knows no limits. Mitali’s journey is a celebra",
        "id": 4171037,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wtKEVxrl_J4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wtKEVxrl_J4/hqdefault.jpg",
        "title": "Courage: The Real Ability | Mitali Jain | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:44.154396+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:15:39+00:00",
        "description": "At just the age of 9 years, Rayirth Mahajan shows us that age is no barrier to making a real difference. In his heartfelt talk, he shares the moment that changed his life, a visit to Renuka Lake, where he saw nature’s beauty marred by pollution. From that moment, Rayirth embraced a simple yet powerful mission: to protect our Earth, starting with small, everyday actions like recycling, reducing waste, and spreading awareness. Through his story, he inspires everyone to understand that even the smallest hearts can safeguard the biggest home we share. Rayirth Mahajan is a 9-year-old young environmentalist, bright scholar, and confident public speaker who believes that even small hands can create big change. His love for nature began after witnessing plastic waste at Renuka Lake, which inspired him to spread awareness about the 3Rs — Reduce, Reuse, and Recycle. An all-rounder, Rayirth excels in academics, consistently securing A+ grades, and has won gold medals thrice and silver medals twi",
        "id": 4171038,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zQcpZJHbI2s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zQcpZJHbI2s/hqdefault.jpg",
        "title": "Waste is not waste; Until we waste it. | Rayirth Mahajan | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:44.398323+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:15:26+00:00",
        "description": "Dr. Koushik Chatterjee challenges the traditional belief that leadership must always be serious. Through sharp observations, real workplace moments, and science-backed insights, he reveals how levity strengthens trust, boosts morale, and transforms team dynamics. He argues that humour is not a distraction but an underrated leadership skill, one that lifts emotional weight, sparks connection, and makes teams more human in an increasingly automated world. Dr. Koushik Chatterjee is an Executive and Leader with extensive experience in developing leaders across corporate and educational environments. Having spent three decades working at the intersection of technology, leadership, and people development, he focuses on helping individuals navigate pressure, communicate with clarity, and cultivate meaningful workplace relationships. As the founder of XForm Learning, his work centers on strengthening leadership thinking and supporting professionals in building confidence, resilience, and pers",
        "id": 4171039,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PEvuBHWYxeU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PEvuBHWYxeU/hqdefault.jpg",
        "title": "I Do My Work With Humour. Seriously | Dr. Koushik Chatterjee | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:44.578319+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:15:13+00:00",
        "description": "Manjula Sularia explores a difficult truth: for many survivors, the stigma that follows their trauma hurts more than the incident itself. She highlights how judgment, silence, and social bias imprison victims long after the event. Her talk calls for a cultural shift from scrutiny to safe spaces, from shame to support. Through insight and empathy, she reveals how collective compassion can help survivors reclaim dignity, voice, and healing.\n Life Skills trainer, Social Entrepreneur, POCSO & POSH Trainer. She is the CEO of The Transformers Value Creators, Committed to the Cause of Prevention of Abuse amongst all ages and all genders she has been a Trailblazer in breaking the silence and being the voice against abuse, violence, harassment, stigmas and taboos.Trained and counseled over 1 million individuals in skills enhancement, mental health, emotional intelligence, professionalism, and entrepreneurship. Working with the Indian Army's Sadbhavana Project for over a decade, to strengthen t",
        "id": 4171040,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BkhebjshiNQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BkhebjshiNQ/hqdefault.jpg",
        "title": "When Stigma Hurts More Than Harm | Manjula Sularia | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:44.803747+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:15:04+00:00",
        "description": "In a world overflowing with information, we often mistake knowing for understanding. Pooja Agarwal Shaikh examines the growing gap between intelligence and wisdom; how smart systems, fast decisions, and constant inputs have created an era of clarity loss. She explores why progress without reflection leads to overwhelm, and how reclaiming wisdom, through discernment, depth, and conscious awareness, may be the most essential human skill of our time. Because intelligence can build the future, but only wisdom can guide it. Pooja Agarwal Shaikh is a globally recognized Spiritual Business Mentor and an Author of “The Spiritual Millionaire.” She is the Founder of The WiseOak – Spiritual Wealth Academy, dedicated to empowering women to align purpose with prosperity through entrepreneurship. Pooja blends science, strategy, and spirituality to help conscious leaders rise with clarity and confidence. She has mentored clients across the globe, been featured in leading publications, and shared sta",
        "id": 4171041,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=E8y_oS993P8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/E8y_oS993P8/hqdefault.jpg",
        "title": "Reclaiming Human Wisdom in the Age of AI | Pooja Agarwal Shaikh | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:45.002072+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:14:56+00:00",
        "description": "Hemlata Rathi explores why modern success often leaves people exhausted despite achieving everything they once dreamed of. Through relatable everyday moments, she reveals how subtle energy drains, constant digital noise, and unconscious reactions quietly disconnect us from our inner balance. Her talk introduces simple awareness rituals that help people shift from overwhelm to clarity. With a focus on alignment over achievement, she shows how true brilliance emerges not from doing more, but from living with presence, intention, and inner steadiness. Hemlata Rathi is a transformative well-being facilitator with over 22 years of experience in helping individuals build clarity, balance, and purpose in their lives. With an MSc in Nutrition, she blends scientific understanding with practical self-development methods to guide people toward healthier mind–body awareness. Her work focuses on overcoming internal barriers, strengthening emotional resilience, and enhancing personal effectiveness.",
        "id": 4171042,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Uas743qmQGM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Uas743qmQGM/hqdefault.jpg",
        "title": "Burnout to Brilliance | Hemlata Rathi | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:45.254446+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:14:48+00:00",
        "description": "K V Premraj talks about a powerful truth: we prepare children for every subject except the one they need daily-money. Through relatable stories and real-life consequences, he reveals how financial illiteracy silently erodes dignity, security, and freedom. His talk highlights why early money awareness is essential, how compounding becomes a life-shaping force, and why families and schools must treat financial literacy as a survival skill, a compass every child deserves before entering adulthood. K.V. Premraj carries 38 years of professional experience in banking, across geographies and generations, where he discovered that money may move markets—but stories move people. A natural communicator, he has co-authored seven books and hosted plenty of talk shows that explore ideas, resilience, and human connection. Today, he channels his experience into giving back—through social service as a Rotarian and by mentoring young minds in business schools. Known for his empathy, clarity, and storyt",
        "id": 4171043,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vm8YrcXFHzE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vm8YrcXFHzE/hqdefault.jpg",
        "title": "The Missing Compass | K V Premraj | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:45.482390+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:14:40+00:00",
        "description": "Rashoo Sachdeva explores how leadership begins long before we speak—it starts with the energy we bring into a room. Through practical insights and simple inner-shift practices, her talk shows how alignment, awareness, and emotional steadiness influence performance far more than speed or skill. She reveals how even a 1% internal shift can recalibrate conversations, decisions, and outcomes. At its core, the talk offers a powerful path to mastering our inner state to transform the world around us. Rashoo Sachdeva brings over two decades of corporate leadership experience, having built and scaled products and businesses with remarkable impact. As an evangelist and thought leader for CEOs and CXOs across India and the Middle East, she has guided many global and Indian brands through transformative digital journeys and advised founders on aligning vision with powerful execution. In 2012, an unexpected inner shift opened a path she had never imagined, moving her from business leadership into",
        "id": 4171044,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XmQHsrEb06I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XmQHsrEb06I/hqdefault.jpg",
        "title": "The 1% Shift to Extraordinary Leadership | Rashoo Sachdeva | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:45.703622+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:14:32+00:00",
        "description": "Dr. Sheela Dubey explores how the essence of human connection has remained unchanged despite shifting from classrooms to digital screens. Drawing from decades of observing young people, she highlights why vulnerability, mutual effort, emotional awareness, and authenticity matter more than ever in a hyper-connected world. Her talk reveals how technology has changed the medium, not the meaning of relationships, reminding us that true connection still begins with self-understanding and the courage to be real. Dr. Sheela Dubey is a seasoned academic and mentor with over 30 years of distinguished experience in teaching, research, and academic administration at Delhi University. A retired Associate Professor from Gargi College, she is widely recognized for her contributions to commerce education, student mentorship, and curriculum innovation. Her passion for teaching extends beyond classrooms into community development through adult education, mentoring the underprivileged, and supporting N",
        "id": 4171045,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9R3RQHmWGwQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9R3RQHmWGwQ/hqdefault.jpg",
        "title": "From Classrooms to Communities: The Power of Connections | Dr. Sheela Dubey | TEDxGNA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:48:45.931595+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:14:29+00:00",
        "description": "Dr. Mohammed Hussain Shaikh unpacks the overlooked power of land as a finite, foundational resource that shapes economies, societies, and generational wealth. He explores why land ownership remains concentrated, how value multiplies through development, and why land literacy is crucial for future decision-makers. Blending history, economics, and practical insight, his talk calls for conscious stewardship; reminding us that land is not just an asset to acquire, but a legacy to protect for sustainable progress. With over 24 years of experience in India’s real estate and land governance ecosystem, Dr. Mohammed Hussain Shaikh is redefining how we understand, manage, and value land in the modern economy. As the Founder of LandMaster’s Advisory, he has pioneered innovative approaches to Land Acquisition, Finance Strategy, and Data Intelligence, helping bridge the long-standing gap between industry practice and academic learning. His work integrates policy, planning, and purpose ensuring tha",
        "id": 4171046,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XZZq3i6MUMQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XZZq3i6MUMQ/hqdefault.jpg",
        "title": "The Land Secrets Decoded | Dr. Mohammed Hussain Shaikh | TEDxGNA University",
        "vote": 0
    }
]