[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:38:09.006858+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:00:17+00:00",
        "description": "Resident Evil Requiem looms large on the horizon of great games in 2026, and we couldn't be more excited to see what Grace Ashcroft's search for Alyssa brings to the horror franchise's canon.\n\nIt's a game that seems to take a keen interest in the franchise's early days, with the story attempting to bridge the past and the present through the eyes of a character with ties to both. But there could be one other such character joining her search, and fans have been quite enthusiastic about the chance to see Leon come back to the fold after his absence in previous titles. \n\nBut will the story have a place for him if he does manage to make an appearance? Join us as we examine what Leon's role could look like if he is going to be a part of Requiem.",
        "id": 4171004,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=BVveb1vDBzo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BVveb1vDBzo/hqdefault.jpg",
        "title": "Resident Evil Requiem’s Biggest Secret: Where The Hell Is Leon S. Kennedy?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T14:22:16.395446+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T13:30:37+00:00",
        "description": "A.I.L.A. is a horror game about being a game tester tasked with the QA for a brand new AI-based technology that can seemingly create bespoke experiences depending entirely on the user. The core premise largely revolves around you testing A.I.L.A., by partaking in the various experiences it is creating for the protagonist, Samuel. \n\nThrough this, we’re supposed to learn about the character’s dark thoughts and deepest fears, while we also get to see the breakdown of the AI over the course of the game. While the premise itself is incredibly interesting, A.I.L.A. tends to suffer from quite a few problems. \n\nOwing to the self-contained nature of the experiences you get, there is little in the way of storytelling continuity aside from your occasional conversations with the AI. Along with this, the action segments feel fine, but the puzzle gameplay feels downright nonsensical at times and levels are often designed in confusing ways that, while fun to look at, sometimes end up feeling like a ",
        "id": 4169811,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=WjlttgbD9_o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WjlttgbD9_o/hqdefault.jpg",
        "title": "A.I.L.A. Review - A Unique Horror Game With A Lot of Potential",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T10:08:14.426882+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T10:00:59+00:00",
        "description": "The current state of the console gaming market is quite interesting to see. Even dating back all the way back to the 80s and 90s, it has been largely dominated by between two and three big companies in terms of console hardware, and aside from Nintendo being the only real constant since the release of the NES back in 1983, we’ve seen big players come and go. \n\nMore recent events have indicated that Microsoft, a company that enjoyed quite a dominant position in the industry during the late 2000s, might also be facing a major downturn in its Xbox division. This is in large part down to major stumbles made by corporate leadership, mixed messaging with some of its console releases, and a failure to provide any real reason to opt for an Xbox these days over any other console. \n\nTo understand more recent events that might have led to this, however, it is worth going back all the way to the beginning, to look at why Microsoft decided to enter the gaming market, and what road the company has ",
        "id": 4167847,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=YIRC7a3z6Ec",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YIRC7a3z6Ec/hqdefault.jpg",
        "title": "The Xbox Collapse - How Microsoft Fumbled An Entire Generation",
        "vote": 0
    }
]