[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T23:01:36.027039+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T22:41:00+00:00",
        "description": "China's pharmaceutical industry has quietly evolved from a hub for generics and clinical trials into something more ambitious -- a genuine competitor in drug discovery that Western giants are now courting to fill gaps left by looming patent expirations worth over $300 billion by 2030. In the first half of 2025, nearly a third of global licensing agreements signed by big pharma involved Chinese firms, Economist reports, four times the share from 2021. Pfizer agreed in May to pay $1.25 billion to 3SBio for an experimental cancer drug, and GlaxoSmithKline followed in June with a deal valued at up to $12 billion with Hengrui. Chinese companies now run about a third of the world's clinical trials, up from 5% a decade ago.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Chinese+Pharma+is+On+the+Cusp+of+Going+Global%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F11%2F26%2F1949202%2F%3Futm_source%3Dtwitter%26utm_medium",
        "id": 4174401,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/26/1949202/chinese-pharma-is-on-the-cusp-of-going-global",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Pharma is On the Cusp of Going Global",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T23:01:36.130827+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T22:01:00+00:00",
        "description": "As Stranger Things releases the first four episodes of its final season today, nearly a decade after its July 2016 premiere, the Netflix series has come to represent something broader than its own popularity -- the embodiment of streaming television's algorithmic philosophy. When the show first appeared, streaming was still finding its footing. Netflix had been producing original series for only a few years, and services like Disney+, Apple TV and HBO Max did not yet exist. \n\nThe question then was what form streaming originals would take: experimental fare like Sense8, nonlinear storytelling like the revived Arrested Development, or prestige dramas like House of Cards. The answer came from a popcorn horror thriller set in 1980s small-town Hawkins, Indiana. Matt and Ross Duffer built Stranger Things from vintage pop-culture parts -- Spielberg's coming-of-age sensibilities from E.T., Stephen King's horror and adolescent bonding, John Hughes' mean jocks and soulful goths, and references ",
        "id": 4174402,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/26/1942237/how-stranger-things-defined-the-era-of-the-algorithm",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How 'Stranger Things' Defined the Era of the Algorithm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T21:54:36.590520+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T21:25:00+00:00",
        "description": "The European Parliament has passed a non-binding resolution urging an EU-wide minimum age of 16 to access social media, video-sharing platforms, and AI chatbots, with parental consent allowed for ages 13-16 and a hard ban for anyone under 13. \"It also proposes additional measures, including a ban on addictive design features that keep children hooked to screens and manipulative advertising and gambling-like elements,\" reports Reuters. Furthermore, the draft \"calls for the outright blocking of websites that don't follow EU rules and to address AI tools that can create fake or inappropriate content.\"\n \nThe resolution \"carries no legal weight\" but reflects the growing concern on the issue of AI companions and algorithm-driven platforms even. \"Any binding legislation would require formal proposals from the European Commission, followed by negotiations between EU member states and Parliament in a process that typically takes years to complete,\" notes the report.<p><div class=\"share_submiss",
        "id": 4173919,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/26/1945257/european-lawmakers-seek-eu-wide-minimum-age-to-access-ai-chatbots-social-media",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "European Lawmakers Seek EU-Wide Minimum Age To Access AI Chatbots, Social Media",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T21:54:36.869905+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T20:45:00+00:00",
        "description": "An anonymous reader quotes a report from the Conversation: The line between human and machine authorship is blurring, particularly as it's become increasingly difficult to tell whether something was written by a person or AI. Now, in what may seem like a tipping point, the digital marketing firm Graphite recently published a study showing that more than 50% of articles on the web are being generated by artificial intelligence. [...]\n \nIt's important to clarify what's meant by \"online content,\" the phrase used in the Graphite study, which analyzed over 65,000 randomly selected articles of at least 100 words on the web. These can include anything from peer-reviewed research to promotional copy for miracle supplements. A closer reading of the Graphite study shows that the AI-generated articles consist largely of general-interest writing: news updates, how-to guides, lifestyle posts, reviews and product explainers.\n \nThe primary economic purpose of this content is to persuade or inform, n",
        "id": 4173920,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/26/1937217/more-than-half-of-new-articles-on-the-internet-are-being-written-by-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Than Half of New Articles On the Internet Are Being Written By AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T20:46:21.445251+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T20:05:00+00:00",
        "description": "The Securities and Exchange Commission's possible plan to grant crypto companies relief from regulation to sell \"tokenised\" stocks risks harming investors, a group of stock exchanges said in a letter to the U.S. regulator this week. From a report: Several crypto companies plan to sell crypto tokens linked to listed equities to retail investors who want to get exposure to stocks without owning them directly. But to sell the products in the U.S., crypto companies which are not registered as broker-dealers would need the SEC to give them a no-action letter or an exemption. \n\nSEC Chair Paul Atkins has said the agency is working on crafting an \"innovation exemption\" from securities laws which would enable crypto players to experiment with new business models. The World Federation of Exchanges (WFE), a group whose members include the U.S. Nasdaq and Germany's Deutsche Boerse, said in a letter dated November 21 that an exemption could create market integrity risks and undermine investor prot",
        "id": 4173486,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/26/1930205/sec-must-not-let-crypto-companies-bypass-rules-stock-exchanges-say",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SEC Must Not Let Crypto Companies 'Bypass' Rules, Stock Exchanges Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T19:36:33.068436+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T19:26:00+00:00",
        "description": "An anonymous reader shares a report: The Pentagon concluded that Alibaba Group, Baidu and BYD should be added to a list of companies that aid the Chinese military, according to a letter to Congress sent roughly three weeks before Donald Trump and Xi Jinping agreed to a broad trade truce. \n\nDeputy Defense Secretary Stephen Feinberg informed lawmakers of the conclusion in the Oct. 7 letter, a copy of which was seen by Bloomberg News, to the heads of the House and Senate Armed Services Committees. It wasn't clear whether the companies have been formally included in the the Pentagon's so-called 1260H list, which carries no direct legal repercussions but serves as a major warning to US investors.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Pentagon+Cited+Alibaba+on+China+Military+Aid+in+Oct.+7+Letter%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F26%2F1926201%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><",
        "id": 4172891,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/26/1926201/pentagon-cited-alibaba-on-china-military-aid-in-oct-7-letter",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pentagon Cited Alibaba on China Military Aid in Oct. 7 Letter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T19:36:33.236643+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T18:45:00+00:00",
        "description": "OpenAI will need to raise at least $207 billion in new funding by 2030 to sustain operations while continuing to lose money, according to a new analysis from HSBC that models the company's cloud computing commitments against projected revenue. The bank's US software team updated its forecasts after OpenAI announced a $250 billion cloud compute rental deal with Microsoft in late October and a $38 billion deal with Amazon days later, bringing total contracted compute capacity to 36 gigawatts. \n\nHSBC projects cumulative rental costs of $792 billion through 2030. Revenue growth remains strong in the model -- the bank expects OpenAI to reach 3 billion users by decade's end, up from roughly 800 million today -- but costs rise in lockstep, meaning OpenAI will still be subsidizing users well into the next decade. If revenue growth disappoints and investors turn cautious, the company's best option might be walking away from some data center commitments.<p><div class=\"share_submission\" style=\"p",
        "id": 4172892,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/26/1842249/openai-needs-at-least-207-billion-by-2030-just-to-keep-losing-money-hsbc-estimates",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Needs At Least $207 Billion By 2030 Just To Keep Losing Money, HSBC Estimates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T18:27:08.374328+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T18:11:00+00:00",
        "description": "European manufacturers are facing a two-front assault from China that has German industry associations warning of deindustrialisation: on one side, artificially cheap Chinese goods are flooding into Europe, and on the other, Beijing has demonstrated its willingness to abruptly cut off access to critical inputs like rare earths and semiconductors. \n\nThe alarm intensified in October when China added five rare earths to its export-licensing regime and then banned exports of computer chips made by Nexperia, a Dutch-headquartered but Chinese-owned chipmaker that supplies numerous European carmakers, according to The Economist. \n\nSeveral European firms warned of production stoppages, and some German companies put workers on leave without pay. Germany's trade deficit with China hit $76.52 billion last year and is expected to surge to around $100.87 billion this year, The Economist reported, driven by collapsing German exports and a rush of imports in categories like cars, chemicals, and mach",
        "id": 4172226,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/26/1811238/chinas-dual-squeeze-on-european-industry-intensifies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's Dual Squeeze on European Industry Intensifies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T18:27:08.823495+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T17:28:00+00:00",
        "description": "An anonymous reader shares a report: It is shocking but not surprising. Lightning crackles on Mars, scientists reported on Wednesday. What they observed, however, were not jagged, high-voltage bolts like those on Earth, arcing thousands of feet from cloud to ground. Rather, the phenomenon was more like the shock you feel when you scuff your feet on the carpet on a cold winter morning and then touch a metal doorknob. \n\n\"This is like mini-lightning on Mars,\" Baptiste Chide, a scientist at the Research Institute in Astrophysics and Planetary Science in Toulouse, France, said of the centimeter-scale electrical discharges. Dr. Chide and his colleagues reported the findings in a paper published on Wednesday in the journal Nature. The electrical sparks, although not as dramatically violent as on Earth, could play an important role in chemical reactions in the Martian atmosphere.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?stat",
        "id": 4172227,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/26/1728223/nasa-rover-makes-a-shocking-discovery-lightning-on-mars",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Rover Makes a Shocking Discovery: Lightning on Mars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:17:21.023328+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:53:00+00:00",
        "description": "Dell has predicted PC sales will be flat next year, despite the potential of the AI PC and the slow replacement of Windows 10. From a report: \"We have not completed the Windows 11 transition,\" COO Jeffrey Clarke said during Dell's Q3 earnings call on Tuesday. \"In fact, if you were to look at it relative to the previous OS end of support, we are 10-12 points behind at that point with Windows 11 than we were the previous generation.\" Clarke said that means 500 million PCs can't run Windows 11, while the same number didn't need an upgrade to handle Microsoft's latest desktop OS. The COO therefore predicted the PC market will \"flourish,\" but then defined the word as meaning \"roughly flat\" sales despite Dell chalking up mid-to high single digits PC sales growth over the last year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Dell+Says+Windows+11+Transition+is+Far+Slower+Than+Windows+10+Shift+as+PC+Sales+Stall%3A+https%",
        "id": 4171560,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/26/1653232/dell-says-windows-11-transition-is-far-slower-than-windows-10-shift-as-pc-sales-stall",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dell Says Windows 11 Transition is Far Slower Than Windows 10 Shift as PC Sales Stall",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T17:17:21.187456+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T16:24:00+00:00",
        "description": "Apple will retake its crown as the world's largest smartphone maker for the first time in more than a decade, lifted by the successful debut of a new iPhone series and a rush of consumers upgrading devices, according to Counterpoint Research. From a report: The iPhone 17 models introduced in September have been a hit both domestically in the US and in Apple's other critical market, China. They've enticed more people to upgrade, leading to double-digit year-over-year sales growth in both markets, according to the researchers. The US company also is benefiting from a cooling of US-China trade tensions and a depreciating dollar that has boosted purchases in emerging markets, they added. The growth will propel Apple past longtime rival Samsung this year, according to Counterpoint's figures. Shipments of the iPhone are set to grow at 10% in 2025, compared with 4.6% for Samsung.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?sta",
        "id": 4171561,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/11/26/1624232/apple-set-to-become-worlds-top-phone-maker-overtaking-samsung",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Set To Become World's Top Phone Maker, Overtaking Samsung",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T16:04:48.499198+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T15:22:00+00:00",
        "description": "An anonymous reader shares a report: AI is not a core part of operations at most of the world's central banks and digital assets are off the table, according to a survey released on Wednesday by the Official Monetary and Financial Institutions Forum. The working group of 10 central banks from Europe, Africa, Latin America and Asia managing roughly $6.5 trillion in assets also found that the institutions that have delved deepest so far into AI are the most cautious about the risks. \n\nThe primary concern is that AI-driven behaviour could \"accelerate future crises,\" the survey showed. \"AI helps us see more, but decisions must remain with people,\" one participant was quoted as saying in the group's report. More than 60% of respondents said that AI tools - which have sparked layoffs already at technology companies and retail and investment banks - are not yet supporting core operations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com",
        "id": 4170798,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/26/1456209/worlds-central-banks-are-wary-of-ai-and-struggling-to-quit-the-dollar-survey-shows",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World's Central Banks Are Wary of AI and Struggling To Quit the Dollar, Survey Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T14:53:39.874735+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T14:48:00+00:00",
        "description": "The roughly 500 fiber-optic cables lying on the ocean floor carry more than 95% of all internet data -- not satellites, as many might assume -- and they face growing threats from natural disasters, terrorists and nation-states capable of disrupting global communications by dragging anchors or deploying submarines against the infrastructure. \n\nThe cables are protected by layers of copper, steel, and plastics, but they remain vulnerable at multiple points: earthquakes can disturb them on the seafloor, and the connections where cables meet land-based infrastructure present targets for bad actors. National actors including Russia, China and the US possess the capability to attack these cables. \n\nA bipartisan Senate bill co-sponsored by Democrat Jeanne Shaheen and Republican John Barrasso is under consideration. The legislation would require a report to Congress within six months on Chinese and Russian sabotage efforts, mandate sanctions against foreign parties responsible for attacks, and",
        "id": 4170147,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/26/1448212/the-underwater-cables-that-carry-the-internet-are-in-trouble",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Underwater Cables That Carry the Internet Are in Trouble",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T14:53:39.946680+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T14:00:00+00:00",
        "description": "Malaysia's Johor, one of Southeast Asia's fastest-growing data center hubs, has announced it will no longer approve applications for Tier 1 and Tier 2 data centers because of their enormous water consumption -- up to 50 million liters daily, or roughly 200 times what higher-tier facilities require. \n\nThe Malaysian state has approved 51 data center projects as of November 2025. 17 centers are already operational, 11 are under construction and 23 received approval this year. The announcement follows concerns raised by a local politician who pointed to water supply disruptions in Georgia in the US after a data center began operations and protests in Uruguay over fears that data centers could affect farms.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Malaysia's+Johor+Bans+Low-Tier+Data+Centers+Over+Water+Strain%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F26%2F1332218%2F%3Futm_source%3Dtwitter%26utm_medium%3",
        "id": 4170148,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/26/1332218/malaysias-johor-bans-low-tier-data-centers-over-water-strain",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Malaysia's Johor Bans Low-Tier Data Centers Over Water Strain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T13:52:33.610649+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T13:00:00+00:00",
        "description": "Texas has purchased $5 million worth of BlackRock's bitcoin ETF as an initial step toward creating the first state-level bitcoin reserve in the U.S.\n\"[O]ther states having previously invested in such funds with public-employee retirement money,\" notes CoinDesk. \"Michigan has been building such an investment, and Wisconsin sold its $350 million pension-fund stake in the BlackRock ETF in May. From the report: A few weeks ago, Texas moved past its deadline to \"capture the industry's best practices so it can utilize these practices in the implementation and management\" of its bitcoin BTC reserve, according to its formal request for information issued in September. Entities across the industry provided input on how it could set up and manage the stockpile conceived of in the Texas Strategic Bitcoin Reserve and Investment Act.\n \nLast week, the state comptroller's office moved to secure $5 million in BlackRock's iShares Bitcoin Trust (IBIT) as a placeholder, a spokesman for the Texas Comptro",
        "id": 4169630,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/26/0010222/texas-buys-5-million-in-btc-etf-as-states-edge-toward-first-government-crypto-reserves",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Texas Buys $5 Million In BTC ETF As States Edge Toward First Government Crypto Reserves",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T10:40:09.561036+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T10:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: Nearly a century ago, scientists proposed that a mysterious invisible substance they named dark matter clumped around galaxies and formed a cosmic web across the universe. What dark matter is made from, and whether it is even real, are still open questions, but according to a study, the first direct evidence of the substance may finally have been glimpsed. More work is needed to rule out less exotic explanations, but if true, the discovery would go down as a turning point in the decades-long search for the elusive substance that is said to make up 27% of the cosmos.\n \n\"This could be a crucial breakthrough in unraveling the nature of dark matter,\" said Prof Tomonori Totani, an astrophysicist at the University of Tokyo, who said gamma rays emanating from the centre of the Milky Way appeared to bear the signature of the substance. [...] To search for potential dark matter signals, Totani analysed data from Nasa's Fermi Gamma-ray Spac",
        "id": 4168110,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/26/0018227/study-claims-to-provide-first-direct-evidence-of-dark-matter",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Study Claims To Provide First Direct Evidence of Dark Matter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T07:29:25.352541+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T07:00:00+00:00",
        "description": "China launched an uncrewed Shenzhou 22 spacecraft to serve as an emergency lifeboat for three astronauts aboard the Tiangong space station after a docked return craft was found to have a cracked window likely caused by space debris. \"A Long March 2F rocket fired its engines and lifted off with the Shenzhou 22 spacecraft, carrying cargo instead of a crew, at 11:11 pm EST Monday (04:11 UTC Tuesday),\" reports Ars Technica. \"The spacecraft docked with the Tiangong station nearly 250 miles (400 kilometers) above the Earth about three-and-a-half hours later.\" From the report: Chinese engineers worked fast to move up the launch of the Shenzhou 22, originally set to fly next year. On November 4, astronauts discovered one of the two crew ferry ships docked to the Tiangong station had a damaged window, likely from an impact with a small fragment of space junk. [...] Now, 20 days after the saga began, the Tiangong outpost again has a lifeboat for its long-term residents. Astronauts Zhang Lu, Fu ",
        "id": 4167129,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/26/005203/china-launches-an-emergency-lifeboat-to-bring-three-astronauts-back-to-earth",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Launches An Emergency Lifeboat To Bring Three Astronauts Back To Earth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T04:21:26.011028+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T03:30:00+00:00",
        "description": "The UK is seeking to fast-track new atomic development to meet soaring energy demands driven by AI and electrification. According to a new report published by the government's Nuclear Regulatory Taskforce, excessive regulation has made Britain the most expensive place in the world to build nuclear projects. The report is calling for a sweeping overhaul to accelerate reactor construction -- everything from \"streamlining regulation\" to relaxing environmental and safety constraints. The Register reports: The document outlines 47 recommendations for the government, which come under five general areas: providing clearer leadership and direction for the nuclear sector; simplifying the regulatory approval process for atomic projects; reducing risk aversion; addressing incentives to delay progress; and working with the nuclear sector to speed delivery and boost innovation. Among the recommendations is that a Commission for Nuclear Regulation should be established, becoming a \"unified decision",
        "id": 4166285,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/25/231251/britain-plots-atomic-reboot-as-datacenter-demand-surges",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Britain Plots Atomic Reboot As Datacenter Demand Surges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T02:19:04.054516+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T02:02:00+00:00",
        "description": "Plex is beginning to enforce new restrictions on remote streaming for its TV apps, requiring either a Plex Pass or the cheaper Remote Watch Pass to watch media from servers outside your home network. How-To Geek reports: Plex is now rolling out the remote watch changes to its Roku TV app. This means that you will need a Plex Pass or Remote Watch Pass for your Plex account if you want to stream media from a server outside your home. If you're only watching media from your own server on the same local network as your Roku device, or the owner of the server you're streaming from has Plex Pass, you don't have to do anything.\n \nPlex says this change will come to the other TV apps in 2026, such as Fire TV, Apple TV, and Android TV. Presumably, that will happen when the redesigned app arrives on those platforms. Roku was just the first TV platform to get the new app, which caused a wave of complaints from users about removed functionality and a more clunky redesign. Plex is addressing some o",
        "id": 4165788,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/25/239252/plex-is-now-enforcing-remote-play-restrictions-on-tvs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Plex Is Now Enforcing Remote Play Restrictions On TVs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T02:19:04.239115+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T01:25:00+00:00",
        "description": "HP plans to cut 4,000-6,000 jobs by 2028 \"as part of a plan to streamline operations and adopt artificial intelligence,\" reports Reuters. From the report: HP's teams focused on product development, internal operations and customer support will be impacted by the job cuts, CEO Enrique Lores said during a media briefing call. \"We expect this initiative will create $1 billion in gross run rate savings over three years,\" Lores added. The company laid off an additional 1,000 to 2,000 employees in February, as part of a previously announced restructuring plan. Demand for AI-enabled PCs has continued to ramp externally, reaching over 30% of HP's shipments in the fourth quarter ended October 31.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=HP+To+Cut+About+6%2C000+Jobs+By+2028%2C+Ramps+Up+AI+Efforts%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F25%2F2319238%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"ht",
        "id": 4165789,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/25/2319238/hp-to-cut-about-6000-jobs-by-2028-ramps-up-ai-efforts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "HP To Cut About 6,000 Jobs By 2028, Ramps Up AI Efforts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T01:16:47.034142+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T00:45:00+00:00",
        "description": "Warner Music Group has reached a licensing deal with Suno that will let users create AI-generated music using the voices and likenesses of artists who opt in. WMG says participating artists will have \"full control\" over how their likeness and music are used. \"These will be new creation experiences from artists who do opt in, which will open up new revenue streams for them and allow you to interact with them in new ways,\" Suno says, adding that users will be able to \"build around\" an artist's sounds \"and ensure they get compensated.\" WMG is also dropping its previous lawsuit accusing Suno of scraping copyrighted material.\n \n\"Along with the licensing agreement, Suno is planning to use licensed music from WMG to build next-gen music generation models that it claims will surpass its flagship v5 model,\" adds The Verge. \"It will also start requiring users to have a paid account to download songs starting next year, with each tier providing a specific number of downloads each month.\"\n \nFurth",
        "id": 4165523,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/25/2240236/warner-music-group-partners-with-suno-to-offer-ai-likenesses-of-its-artists",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Warner Music Group Partners With Suno To Offer AI Likenesses of Its Artists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-26T00:13:23.118740+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-26T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from PCMag: Four new features are coming to Google Maps, including a way to hide your identity in reviews. Maps will soon let you use a nickname and select an alternative profile picture for online reviews, so you can rate a business without linking it to full name and Google profile photo. Google says it will monitor for \"suspicious and fake reviews,\" and every review is still associated with an account on Google's backend, which it believes will discourage bad actors.\n \nLook for a new option under Your Profile that says Use a custom name &amp; picture for posting. You'll then be able to pick an illustration to represent you and add a nickname. Google didn't explain why it is introducing anonymous reviews; it pitched the idea as a way to be a business's \"Secret Santa.\" Some users are nervous to publicly post reviews for local businesses as it may be used to track their location or movements. It may encourage more people to contribute honest feedbac",
        "id": 4165148,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/25/2221221/google-maps-will-let-you-hide-your-identity-when-writing-reviews",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Maps Will Let You Hide Your Identity When Writing Reviews",
        "vote": 0
    }
]