[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-03T17:30:04+00:00",
        "description": "Of the many Undertale-inspired titles over the past several years, Foreign Gnomes' Everhood stood out for its sheer style and approach to rhythm-based combat. \n\nEverhood 2 is comparatively more off-the-top and chaotic. It's multi-dimensional, embracing different art styles and encompassing various dimensions filled with multitudes of bizarre phenomena. The story may start as simply as it can, with the character drafted to defeat the Dragon and ultimately take down the core of all evil, but the journey is anything but predictable.\n\nWhile veering off-course is a major part of the narrative, Everhood 2 backs it up with an excellent soundtrack and battles with a surreal approach that has to be seen to be believed (as eye-straining as it can be at times). Even with its idiosyncrasies, it's a wild journey packed with much to do and many reasons to revisit.",
        "id": 2237778,
        "language": null,
        "link": "https://www.youtube.com/watch?v=MdWhmVudFiM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MdWhmVudFiM/hqdefault.jpg",
        "title": "Everhood 2 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-03T13:30:03+00:00",
        "description": "In response to swathes of player feedback following MLB The Show 24’s middling reception, The Show developer San Diego Studio have pledged that this year’s edition will demonstrate the biggest year-on-year improvement since the team took over the long-standing baseball series. \n\nSports simulations are renowned for incremental changes every year, of course, but going beyond this MLB The Show 25 is said to include substantial graphical overhaul, advances in player animation and AI, plus deeper and more complex game modes. \n\nImmersion and longevity appear top of the list SD Studio have worked on to probably make The Show 25 the best entry yet, but whether it’s enough to make those who already own last year’s iteration buy this year is debatable.",
        "id": 2235642,
        "language": null,
        "link": "https://www.youtube.com/watch?v=4gtG3XJb2Uc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4gtG3XJb2Uc/hqdefault.jpg",
        "title": "MLB The Show 25 - 15 Things YOU NEED To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-03T09:30:10+00:00",
        "description": "Assassin’s Creed is one of the biggest gaming properties around, and Assassin’s Creed Shadows is the series’ first full-fledged flagship release in close to five years, which obviously makes the upcoming action RPG one of 2025’s most significant releases by default. \n\nBut there are other factors at play that make it an even bigger game. First and foremost, there’s the fact that this is finally the Assassin’s Creed game set in feudal Japan that we have been waiting for for so long, while on top of that the game is also promising the kind of significant improvements in crucial areas such as stealth, parkour, and exploration that fans have been hoping to see. \n\nUnless it messes up spectacularly (which isn’t a complete impossibility), Assassin’s Creed Shadows will be worth keeping an eye on.",
        "id": 2234343,
        "language": null,
        "link": "https://www.youtube.com/watch?v=JG5MRsB41-0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JG5MRsB41-0/hqdefault.jpg",
        "title": "Assassin's Creed Shadows Is Shaping Up To Be One of The Biggest Games of The Year",
        "vote": 0
    }
]