[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T21:25:54.677780+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T21:00:00+00:00",
        "description": "An anonymous reader shares a report: A typosquatted domain impersonating the Microsoft Activation Scripts (MAS) tool was used to distribute malicious PowerShell scripts that infect Windows systems with the 'Cosmali Loader'. BleepingComputer has found that multiple MAS users began reporting on Reddit yesterday that they received pop-up warnings on their systems about a Cosmali Loader infection. \n\nBased on the reports, attackers have set up a look-alike domain, \"get[dot]activate[dot]win,\" which closely resembles the legitimate one listed in the official MAS activation instructions, \"get[dot]activated[dot]win.\" Given that the difference between the two is a single character (\"d\"), the attackers bet on users mistyping the domain.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Fake+MAS+Windows+Activation+Domain+Used+To+Spread+PowerShell+Malware%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F12%2F25%2F2058205%2F%3Futm_so",
        "id": 4406193,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/25/2058205/fake-mas-windows-activation-domain-used-to-spread-powershell-malware",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fake MAS Windows Activation Domain Used To Spread PowerShell Malware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T20:00:28.893314+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T19:01:00+00:00",
        "description": "Goldman Sachs analysts have identified a notable shift in how investors respond to corporate layoff announcements, finding that even job cuts attributed to automation and AI-driven restructuring are now causing stock prices to fall rather than rise. The investment bank linked recent layoff announcements to public companies' earnings reports and stock market data, concluding that stocks dropped by an average of 2% following such announcements, and companies citing restructurings faced even harsher punishment. \n\nThe traditional Wall Street playbook held that layoffs tied to strategic restructuring would boost stock prices, while cuts driven by declining sales would hurt them. That distinction appears to have collapsed. \n\nGoldman's analysts suggest investors simply don't believe what companies are saying -- firms announcing layoffs have experienced higher capex, debt and interest expense growth alongside lower profit growth compared to industry peers this year. The real driver, analysts ",
        "id": 4405896,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/25/1727221/wall-street-has-stopped-rewarding-strategic-layoffs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wall Street Has Stopped Rewarding 'Strategic' Layoffs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T18:44:18.555406+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T18:00:00+00:00",
        "description": "An anonymous reader shares a report: Chinese social media users criticized two key government policies, rare signs of public dissent in the country where the internet is heavily censored. The death of the former head of China's one-child policy agency -- which for decades forced women to carry out abortions and sterilizations -- sparked criticism of the demographic effort, with one netizen lamenting the \"children who were lost.\" \n\nOthers, meanwhile, criticized Beijing's leadership over its ongoing row with Tokyo, sparked by Japanese Prime Minister Sanae Takaichi saying her country could intervene to defend Taiwan in a potential Chinese attack on the self-ruled island, which Beijing claims as its own.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Chinese+Social+Media+Users+Criticize+Authorities+in+Rare+Sign+of+Dissent%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F12%2F25%2F1632226%2F%3Futm_source%3Dtwitter%26utm",
        "id": 4405573,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/25/1632226/chinese-social-media-users-criticize-authorities-in-rare-sign-of-dissent",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Social Media Users Criticize Authorities in Rare Sign of Dissent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T17:35:22.809595+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T17:01:00+00:00",
        "description": "Framework has announced yet another price increase for memory modules, the second in roughly a month, and the company is now actively encouraging customers to source their own RAM elsewhere if they can find better deals. The laptop maker cited \"extreme memory shortages and price volatility\" as the reason for the hike, noting that 32GB modules and smaller currently cost around $10 per gigabyte while 48GB modules run approximately $13 per gigabyte. \n\nFramework said it expects to raise prices again by January as its suppliers continue increasing costs, a trend analysts predict will persist through 2026. Framework plans to add a direct link to PCPartPicker in its configurators so DIY Edition buyers can compare prices and find cheaper alternatives. The company said its pricing still compares favorably to Apple's roughly $25 per gigabyte and pledged to stay as close as possible to acquisition costs. Storage price increases are also on the horizon, Framework warned.<p><div class=\"share_submi",
        "id": 4405309,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/25/1627223/framework-raises-memory-prices-again-suggests-customers-bring-their-own-ram",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Framework Raises Memory Prices Again, Suggests Customers Bring Their Own RAM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T16:29:28.535519+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T16:01:00+00:00",
        "description": "Waymo's fleet of autonomous robotaxis can navigate city streets and compete with human taxi drivers, but they become stranded when a passenger leaves a door ajar -- prompting the company to pay tow truck operators around $20 to $24 through an app called Honk just to push a door shut. The owner of a towing company in Inglewood, California, completes up to three such jobs a week for Waymo, sometimes freeing vehicles by removing seat belts caught in doors. Another Los Angeles tow operator said locating stuck robotaxis can take 10 minutes to an hour because the precise location isn't always provided, forcing workers to search on foot through narrow streets too narrow for flatbed rigs. \n\nTow operators also retrieve Waymos that run out of battery before reaching charging stations, earning $60 to $80 per tow -- rates that aren't always profitable after factoring in fuel and labor. During a San Francisco power outage last weekend, multiple operators received a flurry of retrieval requests as ",
        "id": 4405000,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/25/1541258/waymo-pays-workers-22-to-close-doors-on-stranded-robotaxis",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymo Pays Workers $22 To Close Doors on Stranded Robotaxis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T15:24:05.637229+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T15:01:00+00:00",
        "description": "Nvidia has agreed to buy assets from Groq, a designer of high-performance artificial intelligence accelerator chips, for $20 billion in cash, according to Alex Davis, CEO of Disruptive, which led the startup's latest financing round in September. From a report: Davis, whose firm has invested more than half a billion dollars in Groq since the company was founded in 2016, said the deal came together quickly. \n\nGroq raised $750 million at a valuation of about $6.9 billion three months ago. Investors in the round included Blackrock and Neuberger Berman, as well as Samsung, Cisco, Altimeter and 1789 Capital, where Donald Trump Jr. is a partner. Groq said in a blog post on Wednesday that it's \"entered into a non-exclusive licensing agreement with Nvidia for Groq's inference technology,\" without disclosing a price. With the deal, Groq founder and CEO Jonathan Ross along with Sunny Madra, the company's president, and other senior leaders \"will join Nvidia to help advance and scale the license",
        "id": 4404655,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/25/152201/nvidia-buying-groqs-assets-for-20-billion-in-its-largest-deal-on-record",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Buying Groq's Assets For $20 Billion in Its Largest Deal on Record",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T14:16:51.345243+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T14:00:00+00:00",
        "description": "The Trump administration has announced it would replace the lottery programme used to grant H-1B visas for skilled foreign workers with a system that prioritises higher-paid individuals. From a report: The Department of Homeland Security said it would begin to implement a \"weighted\" selection process to give an advantage to higher-skilled and higher-paid applicants from February, according to a statement posted on its website. Matthew Tragesser, Citizenship and Immigration Services spokesperson, said: \"The existing random selection process of H-1B registrations was exploited and abused by US employers who were primarily seeking to import foreign workers at lower wages than they would pay American workers.\" \n\nThe move is the latest in a broad crackdown on US immigration by President Donald Trump, who has dramatically stepped up deportations of immigrants and sent enforcement agents into cities across the country to carry out arrests. The change also follows moves earlier this year to c",
        "id": 4404313,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/25/0929209/trump-administration-to-overhaul-lottery-system-for-h-1b-visas",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Administration To Overhaul Lottery System For H-1B Visas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T13:07:43.854851+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Wall Street Journal: It's harder than ever to mine bitcoin. And less profitable, too. But mining-company stocks are still flying, even with cryptocurrency prices in retreat. That's because these firms have something in common with the hottest investment theme on the planet: the massive, electricity-hungry data centers expected to power the artificial-intelligence boom. Some companies are figuring out how to remake themselves as vital suppliers to Alphabet, Amazon, Meta, Microsoft and other \"hyperscalers\" bent on AI dominance.\n \nBitcoin-mining -- using vast computer power to solve equations to unlock the digital currency -- has been a lucrative and cutting-edge pursuit in its own right. Lately, however, increased competition and other challenges have eroded profit margins. But just as the bitcoin-mining business began to cool, the AI build-out turned white hot. The AI arms race has created an insatiable demand for some assets the miners alre",
        "id": 4403993,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/24/2125245/bitcoin-miners-pivot-to-ai-has-lifted-bitcoin-mining-etf-by-about-90-this-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bitcoin Miners' Pivot To AI Has Lifted Bitcoin-Mining ETF By About 90% This Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T10:54:02.656149+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T10:00:00+00:00",
        "description": "alternative_right shares a report from Euronews: France's President Emmanuel Macron discovered news of his own supposed overthrow, after he received a message of concern, along with a link to a Facebook video. \"On Sunday (14 December) one of my African counterparts got in touch, writing 'Dear president, what's happening to you? I'm very worried,'\" Macron told readers of French local newspaper La Provence on December 16.\n \nAlongside the message, a compelling video showcasing a swirling helicopter, military personnel, crowds and -- what appears to be -- a news anchor delivering a piece to camera. \"Unofficial reports suggest that there has been a coup in France, led by a colonel whose identity has not been revealed, along with the possible fall of Emmanuel Macron. However, the authorities have not issued a clear statement,\" she says.\n \nExcept, nothing about this video is authentic: it was created with AI. After discovering the video, Macron asked Pharos -- France's official portal for si",
        "id": 4403421,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/24/2133243/fake-video-claiming-coup-in-france-goes-viral",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fake Video Claiming 'Coup In France' Goes Viral",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T07:36:11.120451+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T07:00:00+00:00",
        "description": "With NASA's Mars Sample Return mission delayed into the 2030s, engineers are certifying the Perseverance rover to keep operating for many more years while it continues collecting and safeguarding Martian rock samples. Ars Technica reports: The good news is that the robot, about the size of a small SUV, is in excellent health, according to Steve Lee, Perseverance's deputy project manager at NASA's Jet Propulsion Laboratory (JPL). \"Perseverance is approaching five years of exploration on Mars,\" Lee said in a press briefing Wednesday at the American Geophysical Union's annual fall meeting. \"Perseverance is really in excellent shape. All the systems onboard are operational and performing very, very well. All the redundant systems onboard are available still, and the rover is capable of supporting this mission for many, many years to come.\"\n \nThe rover's operators at JPL are counting on sustaining Perseverance's good health. The rover's six wheels have carried it a distance of about 25 mil",
        "id": 4402757,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/24/2116243/nasa-will-soon-find-out-if-the-perseverance-rover-can-really-persevere-on-mars",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Will Soon Find Out If the Perseverance Rover Can Really Persevere On Mars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T04:22:51.745153+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Financial Post: A Texas power developer is proposing to repurpose nuclear reactors from Navy warships to power the United States grid as the Trump administration pushes to secure massive amounts of energy for the artificial intelligence boom. HGP Intelligent Energy LLC filed an application to the Energy Department to redirect two retired reactors to a data center project proposed at Oak Ridge, Tennessee, according to a letter submitted to the agency's Office of Energy Dominance Financing. The project, filed for the White House's Genesis Mission, would produce about 450-520 megawatts of around-the-clock electricity, or enough to power roughly 360,000 homes. The proposal would rewire reactors from naval vessels, originally built by Westinghouse Electric Company and General Electric, at a fraction of the cost of new builds.\n \nAccording to the report, The developer expects to seek a loan guarantee from the U.S. Department of Energy and raise ro",
        "id": 4402216,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/24/1920243/nuclear-developer-proposes-using-navy-reactors-for-data-centers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nuclear Developer Proposes Using Navy Reactors For Data Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T02:14:58.408243+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T01:25:00+00:00",
        "description": "\"In the age of Spotify and AI slop, tapes remind us what we're missing when we stop taking risks,\" writes author Janus Rose in an article for 404 Media. Here's an excerpt: There are lots of advantages to the cassette lifestyle. Unlike vinyl records, tapes are compact and super-portable, and unlike streaming, you never have to worry about a giant company suddenly taking them away from you. They can be easily duplicated, shared, and made into mixtapes using equipment you find in a junk shop. When I was a kid, the first music I ever owned were tapes I recorded from MTV with a Kids' Fisher Price tape recorder. I had no money, so I would listen to those tapes for hours, relishing every word Kim Gordon exhaled on my bootlegged copy of Sonic Youth's \"Bull in the Heather.\" Just like back then, my rediscovery of cassettes has led me to start listening more intentionally and deeply, devoting more and more time to each record without the compulsion to hit \"skip.\" Most of the cassettes I bought i",
        "id": 4401862,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/24/219224/why-i-quit-streaming-and-got-back-into-cassettes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Why I Quit Streaming And Got Back Into Cassettes'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T01:08:33.468063+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T00:45:00+00:00",
        "description": "Apple will allow alternative iOS app stores and external payment systems in Brazil after settling an antitrust case with the country's competition authority, following a lawsuit brought by MercadoLibre back in 2022. Thurrott reports: Yesterday, Brazil's Conselho Administrativo de Defesa Economica (CADE) explained in its press release that it has approved a Term of Commitment to Cease (TCC) submitted by Apple. To settle the lawsuit, the iPhone maker has agreed to allow third-party iOS app stores in Brazil and to let developers use external payment systems. The company will also use neutral wording in the warning messages about third-party app stores and external payment systems that iOS users in Brazil will see.\n \nAs part of the settlement, Apple has 105 days to implement these changes to avoid a fine of up to $27.1 million. A separate report from Brazilian blog Tecnoblog revealed that Apple will still take a 5% \"Core Technology Commission\" fee on transactions going through alternative",
        "id": 4401655,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/24/2055236/apple-to-allow-alternative-app-stores-for-ios-users-in-brazil",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple To Allow Alternative App Stores For iOS Users In Brazil",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T01:08:33.563161+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-25T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: Two years ago, Lizmary Fernandez took a detour from studying to be an immigration attorney to join a free Apple course for making iPhone apps. The Apple Developer Academy in Detroit launched as part of the company's $200 million response to the Black Lives Matter protests and aims to expand opportunities for people of color in the country's poorest big city. But Fernandez found the program's cost-of-living stipend lacking -- \"A lot of us got on food stamps,\" she says -- and the coursework insufficient for landing a coding job. \"I didn't have the experience or portfolio,\" says the 25-year-old, who is now a flight attendant and preparing to apply to law school. \"Coding is not something I got back to.\"\n \nSince 2021, the academy has welcomed over 1,700 students, a racially diverse mix with varying levels of tech literacy and financial flexibility. About 600 students, including Fernandez, have completed its 10-month course of half-days at Mic",
        "id": 4401656,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/24/1957228/apples-app-course-runs-20000-a-student-is-it-really-worth-it",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's App Course Runs $20,000 a Student. Is It Really Worth It?",
        "vote": 0
    }
]