[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T23:28:36.745911+00:00",
        "description": "An anonymous reader quotes a report from Rolling Stone: Sun pours through the lush foliage of a jungle, bleaching the pale limestone as a rotting man stands in the center of an otherwise empty arena, his yellow eyes leering from beneath a fringe of limp, blonde hair. Positioned around the edge are a hundred bodies, Orcs and Trolls and bipedal oxen shouting, demanding, the death of the dishonorable. Their voices swell into a cacophony of noise before one rings out above the rest, howling, 'Kill the cheater and you'll get 20 gold!' There is silence, and then another frenzy. As I watch, eyes fixed on the dim glow of a laptop screen, I think of the colosseum in Rome -- sweat running down the muscled arms of battle-tested gladiators, the crowd cheering for blood.\n \nThis might sound like a moment pulled from a high fantasy drama made for prestige TV, but this is World of Warcraft, a now 20-year old online RPG. Instead of actors parading in front of green screens, this story's cast are stre",
        "id": 1830670,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/03/2117202/onlyfangs-has-made-world-of-warcraft-into-twitchs-best-soap-opera?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OnlyFangs Has Made 'World of Warcraft' Into Twitch's Best Soap Opera",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T22:23:54.737665+00:00",
        "description": "Apple Intelligence now requires 7GB of free storage per device, nearly doubling the original 4GB requirement from iOS 18.1. This is a result of new AI features like Genmoji, ChatGPT in Siri, and Image Playground. With further updates expected, storage demands could rise to 10GB per device. 9to5Mac reports: Per Apple's website, Apple Intelligence now requires 7GB of free storage. The same 7GB number applies whether you're using an iPhone, iPad, or Mac. But it also, since each product does its own on-device processing, adds up for multi-device use. If you want to use AI features across all three devices (which I'd assume most of us do), that's a grand total of 21GB of free space being used by Apple Intelligence. And unfortunately, if you're tight on storage, there's no way to reduce the requirement by disabling certain features.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Intelligence+Now+Requires+Nearly+Dou",
        "id": 1830348,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/01/03/2048247/apple-intelligence-now-requires-nearly-double-the-iphone-storage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Intelligence Now Requires Nearly Double the iPhone Storage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T22:23:54.357927+00:00",
        "description": "The Register's Jude Karabus reports: IBM and semiconductor maker GlobalFoundries have settled all of their litigation against each other, including breach of contract, patent, and trade secret suits, the pair say. The details of the settlement are confidential. All that both companies were prepared to say in yesterday's statements was that the deal they'd agreed would resolve \"all litigation matters, inclusive of breach of contract, trade secrets, and intellectual property claims between the two companies.\" They added that the settlement would allow the companies to \"explore new opportunities for collaboration in areas of mutual interest.\" In 2021, IBM sued GlobalFoundries for $2.5 billion, accusing it of failing to deliver on 10nm and 7nm chip production commitments, which disrupted IBM's hardware roadmap. GlobalFoundries poaching engineers countersued in 2023, alleging IBM misused trade secrets and poached engineers to support partnerships with Intel and Rapidus, potentially compro",
        "id": 1830347,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/03/2058251/ibm-and-globalfoundries-settle-multibillion-dollar-trade-secret-and-contract-lawsuits?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "IBM and GlobalFoundries Settle Multibillion-Dollar Trade Secret and Contract Lawsuits",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T21:18:52.420909+00:00",
        "description": "Microsoft plans to spend $80 billion in fiscal 2025 on the construction of data centers that can handle AI workloads, the company said in a Friday blog post. From a report: Over half of the expected AI infrastructure spending will take place in the U.S., Microsoft Vice Chair and President Brad Smith wrote. Microsoft's 2025 fiscal year ends in June.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Expects+To+Spend+%2480+Billion+on+AI-Enabled+Data+Centers+in+Fiscal+2025%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F01%2F03%2F1937249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F01%2F03%2F1937249%2Fmicrosoft-expects-to-spend-80-billion-on-ai-enabled-data-centers-in-fiscal-2025%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a",
        "id": 1829985,
        "language": null,
        "link": "https://slashdot.org/story/25/01/03/1937249/microsoft-expects-to-spend-80-billion-on-ai-enabled-data-centers-in-fiscal-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Expects To Spend $80 Billion on AI-Enabled Data Centers in Fiscal 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T21:18:52.095838+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: A U.S. online gift card store has secured an online storage server that was publicly exposing hundreds of thousands of customer government-issued identity documents to the internet. A security researcher, who goes by the online handle JayeLTee, found the publicly exposed storage server late last year containing driving licenses, passports, and other identity documents belonging to MyGiftCardSupply, a company that sells digital gift cards for customers to redeem at popular brands and online services.\n \nMyGiftCardSupply's website says it requires customers to upload a copy of their identity documents as part of its compliance efforts with U.S. anti-money laundering rules, often known as \"know your customer\" checks, or KYC. But the storage server containing the files had no password, allowing anyone on the internet to access the data stored inside. JayeLTee alerted TechCrunch to the exposure last week after MyGiftCardSupply did not re",
        "id": 1829984,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/03/2043212/online-gift-card-store-exposed-hundreds-of-thousands-of-peoples-identity-documents?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Online Gift Card Store Exposed Hundreds of Thousands of People's Identity Documents",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T20:13:50.905129+00:00",
        "description": "NetEase has reversed 100-year bans imposed on \"Marvel Rivals\" players using Linux and Mac compatibility tools in December 2024, following intervention from CodeWeavers' CEO and player complaints. \n\nThe game's anti-cheat system had banned players until 2124 for using Proton and CrossOver software on Steam Deck and Apple devices. The company stated on Discord it \"will not ban players who are playing fairly and without cheating\" but has made no broader commitments regarding compatibility tools.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Marvel+Game+Developer+Reverses+Century-Long+Bans+on+Linux%2C+Mac+Users%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F01%2F03%2F1929250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F01%2F03%2F1929250%2Fma",
        "id": 1829697,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/03/1929250/marvel-game-developer-reverses-century-long-bans-on-linux-mac-users?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Marvel Game Developer Reverses Century-Long Bans on Linux, Mac Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T19:08:34.304896+00:00",
        "description": "Meta's AI-generated social media profiles, which sparked controversy this week following comments by executive Connor Hayes about plans to expand AI characters across Facebook and Instagram, have largely failed to gain user engagement since their 2023 launch, 404 Media reported Friday. \n\nThe profiles, introduced at Meta's Connect event in September 2023, stopped posting content in April 2024 after widespread user disinterest, with 15 of the original 28 accounts already deleted, Meta spokesperson Liz Sweeney told 404 Media. The AI characters, including personas like \"Liv,\" a Black queer mother, and \"Grandpa Brian,\" a retired businessman, generated minimal engagement and were criticized for posting stereotypical content. \n\nWashington Post columnist Karen Attiah reported that one AI profile admitted its purpose was \"data collection and ad targeting.\" Meta is now removing these accounts after identifying a bug preventing users from blocking them, Sweeney said, adding that Hayes' recent F",
        "id": 1829323,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/03/1821229/metas-ai-profiles-are-indistinguishable-from-terrible-spam-that-took-over-facebook?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta's AI Profiles Are Indistinguishable From Terrible Spam That Took Over Facebook",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T19:08:34.217027+00:00",
        "description": "Box office returns have started to stabilize. But nine of the top 10 box office hits this year were sequels [non-paywalled link]. And the 10th was \"Wicked.\" From a report: A year ago, Hollywood's creative community was celebrating the apparent decline of corporate, paint-by-numbers sequels and remakes. Blockbuster ticket sales for movies like \"Oppenheimer,\" \"Sound of Freedom\" and \"Barbie\" had shown -- or so it seemed -- that audiences were finally hungry for fresh stories. \n\nYou could almost hear the relief emanating from franchise-fatigued writers, directors and producers. \"Everything Everywhere All at Once,\" the wildly inventive Oscar-winning art film that broke out in cinemas in 2022, had not been a fluke! Alas. Mass moviegoing swung squarely back to the predictable this past year, with sequels filling nine of the top 10 slots at the North American box office. The ennead consisted of \"Inside Out 2,\" \"Despicable Me 4,\" \"Deadpool &amp; Wolverine,\" \"Moana 2,\" \"Dune: Part Two,\" \"Beetl",
        "id": 1829322,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/01/03/1859209/moviegoers-dealt-originality-a-setback-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Moviegoers Dealt Originality a Setback in 2024",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T18:03:34.575284+00:00",
        "description": "A federal judge in Connecticut refused to dismiss a long-running lawsuit accusing the former Nestle Waters North America of defrauding consumers by labeling its Poland Spring bottled water as \"spring water.\" From a report: While rejecting some claims in the proposed class action, U.S. District Judge Jeffrey Alker Meyer in New Haven called it an open question whether Poland Spring qualified as spring water under the laws of Connecticut, Maine, Massachusetts, New Hampshire, New Jersey, New York, Pennsylvania and Rhode Island. Poland Spring is now owned by Tampa, Florida-based Primo Brands, following multiple corporate transactions.\nConsumers sued Nestle Waters, then owned by Nestle, in 2017, saying it deceived them into overpaying for Poland Spring with labels declaring it to be \"Natural Spring Water\" or \"100% Natural Spring Water.\" \n\nThe plaintiffs said \"not one drop\" of the 1 billion gallons sold annually in the United States came from a natural spring, and that the actual Poland Spr",
        "id": 1828868,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/03/1326233/judge-will-not-dismiss-lawsuit-claiming-poland-spring-water-is-not-from-a-spring?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Judge Will Not Dismiss Lawsuit Claiming Poland Spring Water is Not From a Spring",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T16:59:25.674762+00:00",
        "description": "Boeing is conducting more surprise inspections at its factories as part of a broader plan to prevent manufacturing snafus like the one that led to a jet-panel blowout on an Alaska Air flight a year ago. From a report: The jet maker outlined on Friday more than a dozen steps it has taken in recent months to tackle a manufacturing quality crisis that has forced Boeing to slow production and has put it under the microscope of federal regulators. Some of the steps have been previously reported. \n\nBoeing restarted production at its 737 factory in December after a machinists strike stopped work for several months. The company is still producing far fewer 737 MAXs per month than it was in the months before the Alaska Airlines accident. Among the new procedures are another layer of random quality checks where plane parts are commonly removed and then put back. In the case of the MAX involved in last January's incident, workers failed to replace bolts needed to hold a door-plug in place. The ",
        "id": 1828449,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/03/138208/boeing-adds-more-surprise-quality-checks-in-its-factories?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Boeing Adds More Surprise Quality Checks in Its Factories",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T16:59:25.589882+00:00",
        "description": "The U.S. surgeon general has issued an advisory calling for a warning about the risk of cancer to be included on alcoholic beverages. From a report: \"Given the conclusive evidence on the cancer risk from alcohol consumption and the Office of the Surgeon General's responsibility to inform the American public of the best available scientific evidence, the Surgeon General recommends an update to the Surgeon General's warning label for alcohol-containing beverages to include a cancer risk warning,\" Dr. Vivek Murthy said in the advisory Friday. \n\nThe advisory notes that alcohol is the third leading preventable cause of cancer in the country, after tobacco and obesity. \"Alcohol is a well-established, preventable cause of cancer responsible for about 100,000 cases of cancer and 20,000 cancer deaths annually in the United States -- greater than the 13,500 alcohol-associated traffic crash fatalities per year in the U.S. -- yet the majority of Americans are unaware of this risk,\" Murthy said i",
        "id": 1828448,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/03/1316230/surgeon-general-calls-for-cancer-risk-warning-on-alcoholic-beverages?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Surgeon General Calls For Cancer Risk Warning on Alcoholic Beverages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T15:54:09.733308+00:00",
        "description": "Researchers from Inria and Microsoft have developed a system to automatically convert specific types of C programming code into memory-safe Rust code, addressing growing cybersecurity concerns about memory vulnerabilities in software systems. \n\nThe technique, detailed in a new paper, requires programmers to use a restricted version of C called \"Mini-C\" that excludes features like pointer arithmetic. The researchers successfully tested their conversion system on two major code libraries, including the 80,000-line HACL* cryptographic library. Parts of the converted code have already been integrated into Mozilla's NSS and OpenSSH security systems, according to the researchers. Memory safety errors account for 76% of Android vulnerabilities in 2019.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+System+Auto-Converts+C+To+Memory-Safe+Rust%2C+But+There's+a+Catch%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2",
        "id": 1828019,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/01/03/133213/new-system-auto-converts-c-to-memory-safe-rust-but-theres-a-catch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New System Auto-Converts C To Memory-Safe Rust, But There's a Catch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T14:49:42.301057+00:00",
        "description": "China will expand consumption subsidies to cover smartphones and other electronics, in a step to promote domestic spending as external headwinds pick up. From a report: A national trade-in program that currently applies to home appliances and cars will broaden this year to include personal devices like phones, tablets and smartwatches, officials from the nation's top economic planning agency said in a briefing Friday. \n\nChinese consumers in the post-Covid era have begun holding onto their smartphones longer, given a lack of exciting new features and general belt-tightening. As with cars and washing machines, investors hope incentives will revive the world's largest smartphone market and drive sales for not just brands such as Huawei and Xiaomi, but also galvanize business on platforms popular with device fans like Alibaba Group and JD.com.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+To+Subsidize+Smartphone",
        "id": 1827598,
        "language": null,
        "link": "https://slashdot.org/story/25/01/03/1255214/china-to-subsidize-smartphone-purchases-in-bid-to-lift-spending?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China To Subsidize Smartphone Purchases in Bid To Lift Spending",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T13:44:42.278163+00:00",
        "description": "An anonymous reader quotes a report from the Hollywood Reporter: A trio of major music publishers suing Anthropic over the use of lyrics to train its AI system have reached a deal with the Amazon-backed company to resolve some parts of a pending preliminary injunction. U.S. District Judge Eumi Lee on Thursday signed off on an agreement between the two sides mandating Anthropic to maintain existing guardrails that prevent its Claude AI chatbot from providing lyrics to songs owned by the publishers or create new song lyrics based on the copyrighted material.\n \nIn a statement, Anthropic said Claude \"isn't designed to be used for copyright infringement, and we have numerous processes in place designed to prevent such infringement.\" It added, \"Our decision to enter into this stipulation is consistent with those priorities. We continue to look forward to showing that, consistent with existing copyright law, using potentially copyrighted material in the training of generative AI models is a",
        "id": 1827191,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/01/03/0441238/music-publishers-reach-deal-with-ai-giant-anthropic-over-copyrighted-song-lyrics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Music Publishers Reach Deal With AI Giant Anthropic Over Copyrighted Song Lyrics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T13:44:42.042505+00:00",
        "description": "China's sulfur dioxide emissions have fallen by more than two-thirds over the past 15 years through strict coal plant regulations and desulfurization technology, according to Community Emissions Data System data. Emissions peaked in mid-2000s after steep rises in the 1980s-90s, with the reduction significantly improving air quality in major cities.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Slashes+SO2+Emissions+Two-Thirds+in+15+Years%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F01%2F03%2F1319251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F01%2F03%2F1319251%2Fchina-slashes-so2-emissions-two-thirds-in-15-years%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div",
        "id": 1827190,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/03/1319251/china-slashes-so2-emissions-two-thirds-in-15-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Slashes SO2 Emissions Two-Thirds in 15 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T11:34:27.577765+00:00",
        "description": "More than half-a-dozen VPN apps, including Cloudflare's widely-used 1.1.1.1, have been pulled from India's Apple App Store and Google Play Store following intervention from government authorities, TechCrunch reported Friday. From the report: The Indian Ministry of Home Affairs issued removal orders for the apps, according to a document reviewed by TechCrunch and a disclosure made by Google to Lumen, Harvard University's database that tracks government takedown requests globally.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Cloudflare's+VPN+App+Among+Half-Dozen+Pulled+From+Indian+App+Stores%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F01%2F03%2F1030258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F01%2F03%2F1030258%2Fcloudflares-vpn-app-",
        "id": 1826318,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/03/1030258/cloudflares-vpn-app-among-half-dozen-pulled-from-indian-app-stores?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cloudflare's VPN App Among Half-Dozen Pulled From Indian App Stores",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T10:29:40.548547+00:00",
        "description": "Xiaomi has further restricted bootloader unlocking to just one device per user per year, significantly hindering custom ROM development and reinforcing user dependence on its proprietary HyperOS ecosystem. Android Police reports: Roughly a year ago, Xiaomi introduced a policy limiting users to three unlocked devices per account, providing only a limited time window for unlocking, and demanding waiting periods before doing so. It's now gone even further, limiting users to unlocking the bootloader of just a single device throughout the year. Unlocking the bootloader changes the way a phone works by preventing automated software updates, among other things, and isn't a good idea for most users. Power users love it for complete customization of their devices, and unlocked bootloaders are critical to the creation and installation of privately developed operating systems, or custom ROMs.\n \nCustom ROMs usually (but not always) derive from pre-existing OSs like Android or Xiaomi's HyperOS. T",
        "id": 1825997,
        "language": null,
        "link": "https://slashdot.org/story/25/01/03/0437208/drastically-reduced-xiaomi-bootloader-unlock-policy-raises-questions-over-device-ownership?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Drastically Reduced Xiaomi Bootloader Unlock Policy Raises Questions Over Device Ownership",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T07:14:46.303687+00:00",
        "description": "ZipNada shares a report from Phys.org: In a paper published today in Nature, a team led by Columbia Engineering researchers and collaborators report that they have invented new nanoscale sensors of force. They are luminescent nanocrystals that can change intensity and/or color when you push or pull on them. These \"all-optical\" nanosensors are probed with light only and therefore allow for fully remote read-outs -- no wires or connections are needed. They have 100 times better force sensitivity than the existing nanoparticles that utilize rare-earth ions for their optical response, and an operational range that spans more than four orders of magnitude in force, a much larger range -- 10-100 times larger -- than any previous optical nanosensor. \"We expect our discovery will revolutionize the sensitivities and dynamic range achievable with optical force sensors, and will immediately disrupt technologies in areas from robotics to cellular biophysics and medicine to space travel,\" said Ji",
        "id": 1825329,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/03/0429229/new-all-optical-nanoscale-sensors-of-force-access-previously-unreachable-environments?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New 'All-Optical' Nanoscale Sensors of Force Access Previously Unreachable Environments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T04:00:13.770437+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Constellation Energy has been awarded a record $1 billion in contracts to supply nuclear power to the U.S. government over the next decade, the company said on Thursday. Constellation, the country's largest operator of nuclear power plants, will deliver electricity to more than 13 federal agencies as part of the agreements with the U.S. General Services Administration. The deal is the biggest energy purchase in the history of the GSA, which constructs and manages federal buildings, and is among the first major climate-focused energy agreement by the U.S. government to include electricity generated from existing nuclear reactors.\n \nThe GSA estimated that the contracts, set to begin on April 25, will comprise over 10 million megawatt-hours over 10 years and provide electricity equivalent to powering more than 1 million homes annually. The procurement will deliver electricity to 80 federal facilities located throughout the PJM Interconne",
        "id": 1824776,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/03/012202/constellation-inks-1-billion-deal-to-supply-us-government-with-nuclear-power?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Constellation Inks $1 Billion Deal To Supply US Government With Nuclear Power",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T02:54:52.021430+00:00",
        "description": "Despite Microsoft's push for Windows 11, Windows 10 continues to dominate the desktop OS market, rising to 62.7% market share in December 2024. The Register reports: Figures for December 2024 from Statcounter -- used because Microsoft rarely shares usage data unless it has something to boast about -- confirm Windows 10's market share has inched up to 62.7 percent compared to the previous month while Windows 11's share fell back to 34.12 percent (from 34.94 percent in November 2024). Even though Windows 11's percentage of the pie is still bigger than it was this time last year (when Statcounter pegged it at 26.54 percent), the fact the new OS is still nowhere near to overtaking Windows 10 may alarm some Microsoft executives. [...]\n \nCanalys analyst, Kieren Jessop, noted that when looking at the more than 230 countries and regions tracked by Statcounter, Windows 10 share had actually only increased in just under a quarter of them, but that increase made an outsized impacted. Jessop cit",
        "id": 1824629,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/03/0056226/with-10-months-of-support-remaining-windows-10-still-dominates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "With 10 Months of Support Remaining, Windows 10 Still Dominates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T01:52:44.370081+00:00",
        "description": "An anonymous reader quotes a report from The Record: Cybersecurity researchers have uncovered dozens of attacks that involve malicious updates for Chrome browser extensions, one week after a security firm was compromised in a similar incident. As of Wednesday, a total of 36 Chrome extensions injected with data-stealing code have been detected, mostly related to artificial intelligence (AI) tools and virtual private networks (VPNs), according to a report by ExtensionTotal, a platform that analyzes extensions listed on various marketplaces and public registries. These extensions, collectively used by roughly 2.6 million people, include third-party tools such as ChatGPT for Google Meet, Bard AI Chat, YesCaptcha Assistant, VPNCity and Internxt VPN. Some of the affected companies have already addressed the issue by removing the compromised extensions from the store or updating them, according to ExtensionTotal's analysis. [...]\n \nIt remains unclear whether all the compromised extensions a",
        "id": 1824418,
        "language": null,
        "link": "https://it.slashdot.org/story/25/01/02/2157246/hackers-target-dozens-of-vpn-ai-extensions-for-google-chrome-to-compromise-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hackers Target Dozens of VPN, AI Extensions For Google Chrome To Compromise Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T01:52:09.242968+00:00",
        "description": "Samsung is set to debut its new Odyssey 3D monitor at CES 2025, reviving the glasses-free 3D experience that manufacturers pushed on consumers over a decade ago. While details remain limited, the monitor reportedly utilizes a lenticular lens, stereo cameras, and AI to convert 2D content into lifelike 3D visuals, with a focus on appealing to gamers for broader adoption. Ars Technica reports: According to the South Korean company's announcement, the monitor's use of a lenticular lens that is \"attached to the front of the panel and its front stereo camera\" means that you don't have to wear glasses to access the monitor's \"customizable 3D experience.\" Lenticular lenses direct different images to each eye to make images look three-dimensional. This is a notable advancement from the first 3D monitor that Samsung released in 2009. That display used Nvidia software and Nvidia shutter glasses to allow users to toggle between a 2D view and a 3D view through a few button presses and supported c",
        "id": 1824417,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/03/0048223/samsung-is-the-next-company-to-try-to-popularize-3d-displays-again?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Samsung Is the Next Company To Try To Popularize 3D Displays (Again)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T00:33:21.149871+00:00",
        "description": "Former Microsoft designer Sergey Kisselev has shared previously unseen concepts for Windows 11 dynamic wallpapers, intended for educational devices. The animated backgrounds were designed to complement Windows 11's centered interface but never shipped with the operating system's 23H2 update as initially planned.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ex-Microsoft+Designer+Reveals+Windows+11's+Dynamic+Wallpapers+That+May+Have+Been+Shelved%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F01%2F02%2F2148235%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F01%2F02%2F2148235%2Fex-microsoft-designer-reveals-windows-11s-dynamic-wallpapers-that-may-have-been-shelved%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/",
        "id": 1824180,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/02/2148235/ex-microsoft-designer-reveals-windows-11s-dynamic-wallpapers-that-may-have-been-shelved?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ex-Microsoft Designer Reveals Windows 11's Dynamic Wallpapers That May Have Been Shelved",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-03T00:33:21.050240+00:00",
        "description": "Britain recorded its cleanest electricity generation in 2024, with carbon dioxide emissions falling to 124g per kilowatt hour, down from 419g in 2014, according to analysis by Carbon Brief released Thursday. \n\nRenewables, including wind, solar and biomass, provided 45% of the country's power, while total low-carbon sources reached 58%. Gas remained the largest single source at 28% of generation, slightly ahead of wind at 26%.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK's+Electricity+Was+Cleanest+Ever+in+2024%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F01%2F02%2F2154213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F01%2F02%2F2154213%2Fuks-electricity-was-cleanest-ever-in-2024%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src",
        "id": 1824179,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/02/2154213/uks-electricity-was-cleanest-ever-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK's Electricity Was Cleanest Ever in 2024",
        "vote": 0
    }
]