[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-26T19:30:02+00:00",
        "description": "The first-person shooter genre is one of the oldest in gaming, but it continues to be one of the most popular to this date. Modern advancements in game engines and technology have morphed this once homogenous genre into a large umbrella that’s home to plenty of different kinds of experiences ranging from open world to survival to arena shooters and much more. \n\nTo probably no one’s surprise, the coming weeks and months are going to see the releases of many exciting games of this ilk - and we are all there for it. With this video, we will be taking a look at 20 of the best single player FPS games that are releasing in 2025 and beyond that fans shouldn’t miss out on.",
        "id": 2202689,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Re9Bpn9ZGWg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Re9Bpn9ZGWg/hqdefault.jpg",
        "title": "20 Exciting Upcoming Single Player Focused First Person Shooter Games You Can't Afford To Miss",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-26T15:30:09+00:00",
        "description": "Excitement surrounding Assassin’s Creed Shadows continues to build as the open world action RPG approaches its release. This is, after all, the Assassin’s Creed game set in feudal Japan that we’ve all been waiting for so long, and it’s one that we’ve spent a lot of time talking about in the lead up to its release. \n\nThere’s a lot that has been revealed about the game, however, which means there’s plenty still that we haven’t yet covered. Here, then, that’s exactly what we’ll be doing- going over more significant details about Assassin’s Creed Shadows’ core gameplay features and systems, its two protagonists, technical details for its PC and console versions, and more.",
        "id": 2200931,
        "language": null,
        "link": "https://www.youtube.com/watch?v=JVt3ERfVA0Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JVt3ERfVA0Y/hqdefault.jpg",
        "title": "Assassin's Creed Shadows - 15 Things You ABSOLUTELY Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-26T07:45:02+00:00",
        "description": "After years of silence on Monolith Productions' Wonder Woman and reports of troubled development, Warner Bros. Games has announced the project's cancellation. It also confirmed that the studio will shut down alongside Player First Games (MultiVersus) and WB Games San Diego.\n\nIf rumors of Wonder Woman's massive budget, 2024 reboot and failure to \"coalesce\" are true, it makes some sense that WB Games would pull the plug. However, seeing such a renowned studio unceremoniously shut down in this fashion after delivering some of the most memorable first-person shooters and action-adventure games is just terrible.\n\nPlayer First Games' predicament is no better, especially since MultiVersus servers will go down in May. WB Games San Diego's situation is also dismal since it was established to develop free-to-play mobile titles and hasn't really delivered. All these decisions reportedly trace back to the terrible leadership, but it's the developers who have to pay for it.",
        "id": 2197419,
        "language": null,
        "link": "https://www.youtube.com/watch?v=my9GmtCA2gs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/my9GmtCA2gs/hqdefault.jpg",
        "title": "Wonder Woman Game And Monolith Are Dead - What The Hell Is Going On At WB Games?",
        "vote": 0
    }
]