[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T16:19:01.185700+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T16:00:08+00:00",
        "description": "This year’s F1 driver’s championship is the most unpredictable it’s been for years so Codemasters and EA Sports have a tall order on their hands if F1 25 is going to replicate even a modicum of the real-life season’s on-track excitement. \n\nAs it happens, F1 25 has potential to be the series’ best for years – matching the current driver’s championship in that regard at least. Countless overhauls are coming, from My Team and Career mode updates, much-needed revisions to car handling, graphical innovations, customisation options, even circuits in reverse! \n\nIn fact, there’re so many novel elements to year’s iteration that it’s been near-impossible to select the top fifteen things you need to know before you buy.",
        "id": 2669207,
        "language": null,
        "link": "https://www.youtube.com/watch?v=5KloUI6UHok",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5KloUI6UHok/hqdefault.jpg",
        "title": "F1 25 - 15 Things YOU NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T15:13:29.122804+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T14:01:29+00:00",
        "description": "It’s no secret that the original Nintendo Switch was a smash success; it sold more than 100 million units thanks to innovative hardware and an excellent library of video games. \n\nThe Japanese gaming company has finally revealed plans for releasing the Nintendo Switch 2, which is an evolution of what came before in more ways than one. \n\nWith upgraded hardware and new features, the Switch 2 can handle a lot more graphically demanding titles than its predecessors - meaning more third-party games are on the way. \n\nWith this video, we will be taking a look at 25 of the biggest Nintendo Switch 2 releases that you should keep an eye out for right from ports of older games to brand new exclusives and more.",
        "id": 2668449,
        "language": null,
        "link": "https://www.youtube.com/watch?v=y_qAcgP7KeQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/y_qAcgP7KeQ/hqdefault.jpg",
        "title": "25 NEW Nintendo Switch 2 Games To Look Forward To",
        "vote": 0
    }
]