[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T23:12:13.794837+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T22:40:00+00:00",
        "description": "An anonymous reader quotes a report from the BBC: A student's robot has beaten the world record for solving a four-by-four Rubik's cube -- by 33 seconds. Matthew Pidden, a 22-year-old University of Bristol student, built and trained the \"Revenger\" over 15 weeks for his computer science bachelor's degree. The robot solved the cube in 45.305 seconds, obliterating the world record of 1 minute 18 seconds. However, the human record for solving the cube is 15.71 seconds.\n \nMr Pidden's robot uses dual webcams to scan the cube, a custom mechanism to manipulate the faces, and a fully self-built solving algorithm to generate efficient solutions. The student now plans to study for a master's degree in robotics at Imperial College London.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Student's+Robot+Obliterates+4x4+Rubik's+Cube+World+Record%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F05%2F13%2F213239%2F%3Futm_source%",
        "id": 2672361,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/13/213239/students-robot-obliterates-4x4-rubiks-cube-world-record?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Student's Robot Obliterates 4x4 Rubik's Cube World Record",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T22:07:14.197020+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T22:02:00+00:00",
        "description": "Google is enhancing Android's Factory Reset Protection (FRP) to make stolen phones virtually unusable by detecting setup wizard bypasses and requiring a second factory reset until ownership is verified. Android Authority reports: You can factory reset an Android phone in several ways. However, triggering a reset through the Android recovery menu or Google's Find My Device service activates Factory Reset Protection (FRP). During setup after such a reset, the wizard requires you to verify ownership by either signing into the previously associated Google account or entering the device's former lock screen PIN, password, or pattern. Failing this verification step blocks setup completion, rendering the device unusable. [...]\n \nFactory Reset Protection (FRP) is a valuable feature that discourages theft by rendering stolen Android phones useless to potential buyers if wiped improperly. However, FRP isn't foolproof; thieves have discovered numerous methods over the years to circumvent it. The",
        "id": 2672038,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/05/13/2056206/google-wants-to-make-stolen-android-phones-basically-unsellable?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Wants To Make Stolen Android Phones Basically Unsellable",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T22:07:14.322050+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T21:20:00+00:00",
        "description": "Nextcloud has accused Google of sabotaging its Android Files app by revoking the \"All files access\" permission, which the company says\ncripples functionality for its 824,000 users and forces reliance on limited alternatives like SAF and MediaStore. The Register reports: Nextcloud's Android Files app is a file synchronization tool that, according to the company, has long had permission to read and write all file types. \"Nextcloud has had this feature since its inception in 2016,\" it said, \"and we never heard about any security concerns from Google about it.\" That changed in 2024, when someone or something at Google's Play Store decided to revoke the permission, effectively crippling the application. Nextcloud was instructed to use \"a more privacy-aware replacement.\" According to Nextcloud, \"SAF cannot be used, as it is for sharing/exposing our files to other apps ... MediaStore API cannot be used as it does not allow access to other files, but only media files.\"\n \nAttempts to raise the",
        "id": 2672040,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/13/2045258/nextcloud-cries-foul-over-google-play-store-app-rejection?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nextcloud Cries Foul Over Google Play Store App Rejection",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T21:02:14.890968+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T20:40:00+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: Late last night, House Republicans introduced new language to the Budget Reconciliation bill that will immiserate the lives of millions of Americans by cutting their access to Medicaid, and making life much more difficult for millions more by making them pay higher fees when they seek medical care. While a lot of attention will be justifiably given to these cuts, the bill has also crammed in new language that attempts to entirely stop states from enacting any regulation against artificial intelligence.\n \n\"...no State or political subdivision thereof may enforce any law or regulation regulating artificial intelligence models, artificial intelligence systems, or automated decision systems during the 10 year period beginning on the date of the enactment of this Act,\" says the text of the bill introduced Sunday night by Congressman Brett Guthrie of Kentucky, Chairman of the House Committee on Energy and Commerce. The text of the bill wil",
        "id": 2671573,
        "language": null,
        "link": "https://politics.slashdot.org/story/25/05/13/2033237/republicans-try-to-cram-decade-long-ai-regulation-ban-into-budget-reconciliation-bill?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Republicans Try To Cram Decade-Long AI Regulation Ban Into Budget Reconciliation Bill",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T19:52:39.783802+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T19:10:00+00:00",
        "description": "New submitter Synonymous Homonym writes: This year's USENIX ATC will be the last, but other USENIX conferences will keep happening.Since USENIX's inception in 1975, it has been a key gathering place for innovators in the advanced computing systems community. The early days of meetings evolved into the two annual conferences, the USENIX Summer and Winter Conferences, which in 1995 merged into the single Annual Technical Conference that has continued to evolve and serve thousands of our constituents for 30 years.USENIX recognizes the pivotal role that USENIX ATC has played in the shaping of the Association itself as well as the lives and careers of its many attendees and members. We also realize that change is inevitable, and all good things must come to an end:\nThe last ATC will include both a celebration of USENIX's 50th anniversary on the evening of Monday, July 7, and a tribute to USENIX ATC on the evening of Tuesday, July 8.<p><div class=\"share_submission\" style=\"position:relative;",
        "id": 2671106,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/13/1839205/usenix-sunsets-annual-technical-conference-after-30-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "USENIX Sunsets Annual Technical Conference After 30 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T18:44:22.074476+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T18:35:00+00:00",
        "description": "An anonymous reader shares a report: During the Android Show leading up to Google I/O, Google on Tuesday offered a brief update on the adoption of the RCS (Rich Communication Services) protocol, an upgrade to SMS that offers high-resolution photos and videos, typing indicators, read receipts, improved group chat, and more. The company shared that the messaging standard now supports over a billion messages per day in the U.S. \n\nThis metric is based on an average of the last 28 days, Google noted. The stat is notable because Google fought for years to get Apple to adopt support for RCS on iOS, allowing for better communication between Android and Apple devices. Previously, iPhone users who received texts from friends on Android had to deal with blurry videos and images, and couldn't as easily manage group chats when their green-bubbled friends joined. Unlike with iMessage, group chats with Android users couldn't be renamed, nor could people be added or removed, and you couldn't exit whe",
        "id": 2670590,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/13/1835253/google-says-over-1-billion-rcs-messages-sent-in-the-us-daily?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Says Over 1 Billion RCS Messages Sent in the US Daily",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T17:38:42.930211+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T17:21:00+00:00",
        "description": "Microsoft has quietly extended support for Office applications running on Windows 10 well beyond the operating system's October 14, 2025 end-of-support deadline. Microsoft 365 subscribers will now receive updates through October 2028, while perpetual license versions will follow their standard lifecycle policies -- Office 2021 until October 2026 and Office 2024 until October 2029. \n\nWindows Defender malware definitions will also continue \"through at least October 2028\" despite Windows 10's imminent retirement. This reverses Microsoft's previous stance that all Office applications would become unsupported when Windows 10 reaches end-of-life.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Office+Apps+on+Windows+10+No+Longer+Tied+To+October+2025+End-of-Support+Date%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F05%2F13%2F177238%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_i",
        "id": 2670098,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/13/177238/office-apps-on-windows-10-no-longer-tied-to-october-2025-end-of-support-date?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Office Apps on Windows 10 No Longer Tied To October 2025 End-of-Support Date",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T17:38:43.088045+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T16:42:00+00:00",
        "description": "The Department of Commerce officially rescinded the Biden administration's Artificial Intelligence Diffusion Rule on Tuesday, just days before its May 15 implementation date. The rule would have imposed first-ever export restrictions on U.S.-made AI chips to dozens of countries while tightening existing controls on China and Russia. \n\nInstead of implementing blanket restrictions, the DOC signaled a shift toward direct country-by-country negotiations. The department released interim guidance reminding companies that using Huawei's Ascend AI chips anywhere violates U.S. export rules and warned about consequences of allowing U.S. chips to train AI models in China. Commerce Secretary for Industry and Security Jeffery Kessler criticized the previous administration's approach, calling it \"ill-conceived and counterproductive.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Trump+Administration+Scraps+Biden's+AI+Chip+Export",
        "id": 2670099,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/13/1641252/trump-administration-scraps-bidens-ai-chip-export-controls?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Administration Scraps Biden's AI Chip Export Controls",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T16:32:33.142828+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T16:05:00+00:00",
        "description": "Intel has certified Shell's lubricant-based method for cooling servers more efficiently within data centers used for AI. From a report: The announcement on Tuesday, which follows the chipmaker's two-year trial of the technology, offers a way to use less energy at AI facilities, which are booming and are expected to double their electricity demand globally by 2030, consuming as much power then as all of Japan today, according to the International Energy Agency. \n\nSo far, companies have largely used giant fans to reduce temperatures inside AI data centers, which generate more heat in order to run at a higher power. Increasingly, these fans consume electricity at a rate that rivals the computers themselves, something the facilities' operators would prefer to avoid, Intel Principal Engineer Samantha Yates said in an interview.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel+Certifies+Shell+Lubricant+for+Cooling+AI+",
        "id": 2669382,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/13/165215/intel-certifies-shell-lubricant-for-cooling-ai-data-centers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Certifies Shell Lubricant for Cooling AI Data Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T15:26:20.118229+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T15:20:00+00:00",
        "description": "Linux creator Linus Torvalds has abandoned his six-month experiment with a quieter low-profile keyboard in favor of his old mechanical one with Cherry MX Blue switches. In a post about Linux 6.15-rc6 on LKML.org, Torvalds explained that his typing accuracy suffered without the tactile feedback. \n\n\"It seems I need the audible (or perhaps tactile) feedback to avoid the typing mistakes that I just kept doing,\" Torvalds wrote. The famously outspoken developer couldn't recall why he initially switched to the quieter keyboard, as he doesn't work in a shared office where the noise would disturb others. After the failed experiment with the unnamed quiet keyboard, Torvalds has now returned to what he describes as a \"noisy clackety-clack\" input device. He joked that since he can no longer blame his keyboard for typos, \"going forward, I will now conveniently blame autocorrect.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Li",
        "id": 2668658,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/13/1442229/linus-torvalds-returns-to-mechanical-keyboard-after-making-too-many-typos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linus Torvalds Returns To Mechanical Keyboard After Making Too Many Typos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T15:26:20.276169+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T14:32:00+00:00",
        "description": "Microsoft is laying off 3% of employees across all levels and geographies, the company said Tuesday. \"We continue to implement organizational changes necessary to best position the company for success in a dynamic marketplace,\" a spokesperson told CNBC. Microsoft had 228,000 employees worldwide at the end of June, meaning that the move will affect thousands of employees.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+is+Cutting+3%25+of+All+Workers%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F13%2F1432232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F13%2F1432232%2Fmicrosoft-is-cutting-3-of-all-workers%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a ",
        "id": 2668659,
        "language": null,
        "link": "https://slashdot.org/story/25/05/13/1432232/microsoft-is-cutting-3-of-all-workers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft is Cutting 3% of All Workers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T14:18:02.744807+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T14:00:00+00:00",
        "description": "Gaming pioneer John Carmack believes we're not nearly as dependent on cutting-edge silicon as most assume -- we just lack the economic incentive to prove it. Responding to a \"CPU apocalypse\" thought experiment on X, the id Software founder and former Oculus CTO suggested that software inefficiency, not hardware limitations, is our greatest vulnerability. \"More of the world than many might imagine could run on outdated hardware if software optimization was truly a priority,\" Carmack wrote, arguing that market pressures would drive dramatic efficiency improvements if new chips stopped arriving. \n\nHis solution? \"Rebuild all the interpreted microservice based products into monolithic native codebases!\" -- essentially abandoning modern development patterns for the more efficient approaches of earlier computing eras. The veteran programmer noted that such changes would come with significant tradeoffs: \"Innovative new products would get much rarer without super cheap and scalable compute.\"<p",
        "id": 2668063,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/13/1321259/carmack-world-could-run-on-older-hardware-if-software-optimization-was-priority?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Carmack: World Could Run on Older Hardware if Software Optimization Was Priority",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T13:14:11.243507+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T12:16:00+00:00",
        "description": "Apple is embracing the world of brain computer interfaces, unveiling a new technology that one day could revolutionize how humans interact with their devices. From a report: The company is taking early steps to enable people to control their iPhones with neural signals captured by a new generation of brain implants. It could make Apple devices more accessible to tens of thousands of people who can't use their hands because of severe spinal cord injuries or diseases such as amyotrophic lateral sclerosis, or ALS. \n\n[...] Historically, humans interacted with their computers mechanically, using keyboards and mice. Smartphones introduced touch, a behavioral input, but still an observable physical movement. The new capability means Apple devices won't need to see the user make specific movements, the devices can detect user intentions from decoded brain signals. Apple has worked on the new standard with Synchron, which makes a stent-like device that is implanted in a vein atop the brain's m",
        "id": 2667427,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/13/1216217/apple-wants-people-to-control-devices-with-their-thoughts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Wants People To Control Devices With Their Thoughts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T11:04:13.359027+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T10:00:00+00:00",
        "description": "Amazon's decade-old acquisition of Annapurna Labs has emerged as a pivotal element in its AI strategy, with the once-secretive Israeli chip design startup now powering AWS infrastructure. The $350 million deal, struck in 2015 after initial talks between Annapurna co-founder Nafea Bshara and Amazon executive James Hamilton, has equipped the tech giant with custom silicon capabilities critical to its cloud computing dominance. \n\nAnnapurna's chips, particularly the Trainium processor for AI model training and Graviton for general-purpose computing, now form the foundation of Amazon's AI infrastructure. The company is deploying hundreds of thousands of Trainium chips in its Project Rainier supercomputer being delivered to AI startup Anthropic this year. Amazon CEO Andy Jassy, who led AWS when the acquisition occurred, described it as \"one of the most important moments\" in AWS history.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/",
        "id": 2666369,
        "language": null,
        "link": "https://slashdot.org/story/25/05/12/2124207/the-stealthy-lab-cooking-up-amazons-secret-sauce?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Stealthy Lab Cooking Up Amazon's Secret Sauce",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T07:48:13.982684+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T07:00:00+00:00",
        "description": "Dutch researchers have recalculated the timeline for cosmic decay via Hawking-like radiation and found that the universe may end much sooner than previously thought -- around 10^78 years, rather than 10^1100. Phys.Org reports: The research by black hole expert Heino Falcke, quantum physicist Michael Wondrak, and mathematician Walter van Suijlekom (all from Radboud University, Nijmegen, the Netherlands) is a follow-up to a 2023 paper by the same trio. In that paper, they showed that not only black holes, but also other objects such as neutron stars, can \"evaporate\" via a process akin to Hawking radiation. After that publication, the researchers received many questions from inside and outside the scientific community about how long the process would take. They have now answered this question in the new article.\n \nThe researchers calculated that the end of the universe is about 1078 years away, if only Hawking-like radiation is taken into account. This is the time it takes for white dwar",
        "id": 2665245,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/13/0057207/universe-expected-to-decay-much-sooner-than-previously-thought?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Universe Expected To Decay Much Sooner Than Previously Thought",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T05:36:33.864402+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T05:30:00+00:00",
        "description": "Over 400 prominent UK media and arts figures -- including Paul McCartney, Elton John, and Ian McKellen -- have urged the prime minister to support an amendment to the Data Bill that would require AI companies to disclose which copyrighted works they use for training. The Register reports: The UK government proposes to allow exceptions to copyright rules in the case of text and data mining needed for AI training, with an opt-out option for content producers. \"Government amendments requiring an economic impact assessment and reports on the feasibility of an 'opt-out' copyright regime and transparency requirements do not meet the moment, but simply leave creators open to years of copyright theft,\" the letter says.\n \nThe group -- which also includes Kate Bush, Robbie Williams, Tom Stoppard, and Russell T Davies -- said the amendments tabled for the Lords debate would create a requirement for AI firms to tell copyright owners which individual works they have ingested. \"Copyright law is not",
        "id": 2664627,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/12/2033217/creatives-demand-ai-comes-clean-on-what-its-scraping?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Creatives Demand AI Comes Clean On What It's Scraping",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T04:31:43.045496+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T03:30:00+00:00",
        "description": "ZDNet's Steven Vaughan-Nichols marks Reddit's 20 years of being \"the front page of the internet,\" recalling its evolution from a scrappy startup into a cultural powerhouse that shaped online discourse, meme culture, and the way millions consume news and entertainment. Slashdot is also given a subtle nod in the opening line of the article. An anonymous reader shares an excerpt: In 2005, if you were into social networks focused on links, you probably used Digg or Slashdot. However, two guys, Steve Huffman and Alexis Ohanian, recent graduates from the University of Virginia, wanted to create a hub where users could find, share, and discuss the internet's most interesting content. Little did they know where this idea would take them. After all, their concept was nothing new. Still, after Paul Graham, co-founder of Y Combinator, the startup accelerator and seed capital firm, had shot down their first idea -- a mobile food-ordering app -- they pitched what would become Reddit to Graham, and",
        "id": 2664412,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/12/2112256/reddit-turns-20?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Reddit Turns 20",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T02:17:42.506648+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T01:25:00+00:00",
        "description": "An anonymous reader shares a report: After weeks of news about Google's antitrust travails, the tech giant will try to reset the narrative next week by highlighting advances it is making in artificial intelligence, cloud and Android technology at its annual I/O developer conference. \n\nAhead of I/O, Google has been demonstrating to employees and outside developers an array of different products, including an AI agent for software development. Known internally as a \"software development lifecycle agent,\" it is intended to help software engineers navigate every stage of the software process, from responding to tasks to documenting code, according to three people who have seen demonstrations of the product or been told about it by Google employees. Google employees have described it as an always-on coworker that can help identify bugs to fix or flag security vulnerabilities, one of the people said, although it's not clear how close it is to being released.<p><div class=\"share_submission\" ",
        "id": 2663921,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/12/225206/google-developing-software-ai-agent?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Developing Software AI Agent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T01:11:27.280132+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T00:42:00+00:00",
        "description": "Requesting concise answers from AI chatbots significantly increases their tendency to hallucinate, according to new research from Paris-based AI testing company Giskard. The study found that leading models -- including OpenAI's GPT-4o, Mistral Large, and Anthropic's Claude 3.7 Sonnet -- sacrifice factual accuracy when instructed to keep responses short. \n\n\"When forced to keep it short, models consistently choose brevity over accuracy,\" Giskard researchers noted, explaining that models lack sufficient \"space\" to acknowledge false premises and offer proper rebuttals. Even seemingly innocuous prompts like \"be concise\" can undermine a model's ability to debunk misinformation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Asking+Chatbots+For+Short+Answers+Can+Increase+Hallucinations%2C+Study+Finds%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F12%2F2114214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"h",
        "id": 2663624,
        "language": null,
        "link": "https://slashdot.org/story/25/05/12/2114214/asking-chatbots-for-short-answers-can-increase-hallucinations-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Asking Chatbots For Short Answers Can Increase Hallucinations, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-13T00:05:50.007552+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-13T00:02:00+00:00",
        "description": "Google has launched the AI Futures Fund, a new initiative to invest in AI startups that are building with the latest tools from Google DeepMind. TechCrunch reports: The fund will back startups from seed to late stage and will offer varying degrees of support, including allowing founders to have early access to Google AI models from DeepMind, the ability to work with Google experts from DeepMind and Google Labs, and Google Cloud credits. Some startups will also have the opportunity to receive direct investment from Google.\n \n\"The AI Futures Fund doesn't follow a batch or cohort model,\" a Google spokesperson told TechCrunch. \"Instead, we consider opportunities on a rolling basis -- there's no fixed application window or deadline. When we come across companies that align with the fund's thesis, we may choose to invest. We're not announcing a specific fund size at this time, and check sizes vary based on the company's stage and needs -- typically early to mid-stage, with flexibility for l",
        "id": 2663314,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/12/2059257/google-launches-new-initiative-to-back-startups-building-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Launches New Initiative To Back Startups Building AI",
        "vote": 0
    }
]