[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T23:38:25+00:00",
        "description": "A proposed class-action lawsuit accuses Amazon of secretly tracking consumers' movements through their cellphones via its Amazon Ads SDK embedded in third-party apps, allegedly collecting sensitive geolocation data without consent. The complaint, filed by a California resident in a San Francisco federal court, claims Amazon violated state laws on unauthorized computer access in the process. Reuters reports: This allegedly enabled Amazon to collect an enormous amount of timestamped geolocation data about where consumers live, work, shop and visit, revealing sensitive information such as religious affiliations, sexual orientations and health concerns. \"Amazon has effectively fingerprinted consumers and has correlated a vast amount of personal information about them entirely without consumers' knowledge and consent,\" the complaint said.\n \nThe complaint was filed by Felix Kolotinsky of San Mateo, California, who said Amazon collected his personal information through the \"Speedtest by Ook",
        "id": 2008843,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/30/220209/lawsuit-accuses-amazon-of-secretly-tracking-consumers-through-cellphones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lawsuit Accuses Amazon of Secretly Tracking Consumers Through Cellphones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T23:38:25+00:00",
        "description": "Longtime Slashdot reader nunya_bizns shares a report from Reuters: The U.S. Department of Justice has sued to block Hewlett Packard Enterprise's $14 billion deal to acquire networking gear maker Juniper Networks, arguing that it would stifle competition, according to a complaint filed on Thursday. The DOJ argued that the acquisition would eliminate competition and would lead to only two companies -- Cisco Systems and HPE -- controlling more than 70% of the U.S. market for networking equipment. More than a year ago, the server maker said that it would buy Juniper Networks for $14 billion in an all-cash deal, as it looks to spruce up its artificial intelligence offerings.\n \n\"Juniper has also introduced innovative tools that have materially decreased the cost of operating a wireless network for many customers. This competitive pressure has forced HPE to discount its offerings and invest in its own innovation,\" the DOJ said in its complaint. Stiff competition from Juniper forced HPE to s",
        "id": 2008844,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/30/2237250/us-doj-sues-to-block-hewlett-packard-enterprises-14-billion-juniper-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US DOJ Sues To Block Hewlett Packard Enterprise's $14 Billion Juniper Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T22:34:50+00:00",
        "description": "The Register's Dan Robinson reports: Google promised a decade of updates for its Chromebooks in 2023 to stop them being binned so soon after purchase, but many are still set to reach the end of the road sooner than later. The appliance-like laptop devices were introduced by megacorp in 2011, running its Linux-based ChromeOS platform. They have been produced by a number of hardware vendors and proven popular with buyers such as students, thanks to their relatively low pricing. The initial devices were designed for a three-year lifespan, or at least this was the length of time Google was prepared to issue automatic updates to add new features and security fixes for the onboard software.\n \nGoogle has extended this Auto Update Expiration (AUE) date over the years, prompted by irate users who purchased a Chromebook only to find that it had just a year or two of software updates left if that particular model had been on the market for a while. The latest extension came in September 2023, w",
        "id": 2008557,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/30/2152242/googles-10-year-chromebook-lifeline-leaves-old-laptops-headed-for-silicon-cemetery?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's 10-Year Chromebook Lifeline Leaves Old Laptops Headed For Silicon Cemetery",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T22:34:50+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Thursday, OpenAI announced that it is deepening its ties with the US government through a partnership with the National Laboratories and expects to use AI to \"supercharge\" research across a wide range of fields to better serve the public. \"This is the beginning of a new era, where AI will advance science, strengthen national security, and support US government initiatives,\" OpenAI said. The deal ensures that \"approximately 15,000 scientists working across a wide range of disciplines to advance our understanding of nature and the universe\" will have access to OpenAI's latest reasoning models, the announcement said.\n \nFor researchers from Los Alamos, Lawrence Livermore, and Sandia National Labs, access to \"o1 or another o-series model\" will be available on Venado -- an Nvidia supercomputer at Los Alamos that will become a \"shared resource.\" Microsoft will help deploy the model, OpenAI noted. OpenAI suggested this access could pr",
        "id": 2008558,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/30/2142256/openai-teases-new-era-of-ai-in-us-deepens-ties-with-government?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Teases 'New Era' of AI In US, Deepens Ties With Government",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T20:24:34+00:00",
        "description": "The company that Jeff Bezos founded has gone to court to keep the newspaper he owns from finding out too much about the inner workings of its business. From a report: Amazon is suing Washington state to limit the release of public records to The Washington Post from a series of state Department of Labor and Industries investigations of an Amazon Project Kuiper satellite facility in the Seattle area. \n\nThe lawsuit, filed this week in King County Superior Court in Seattle, says the newspaper on Nov. 26 requested \"copies of inspection records, investigation notes, interview notes, complaints,\" and other documents related to four investigations at the Redmond, Wash., facility between August and October 2024. It's not an unusual move by the company, and in some ways it's a legal technicality. \n\nAmazon says it's not seeking to block the records release entirely, but rather seeking to protect from public disclosure certain records that contain proprietary information and trade secrets about",
        "id": 2007752,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/30/1914238/amazon-sues-wa-state-over-washington-post-request-for-kuiper-records?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Sues WA State Over Washington Post Request for Kuiper Records",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T19:20:00+00:00",
        "description": "Google is offering U.S. employees in its Platforms &amp; Devices division a voluntary exit program with severance packages, following last year's merger of its Pixel hardware and Android software teams. \n\nThe program affects staff working on Android, Chrome, Google Photos, Pixel, Fitbit, and Nest products, according to a memo from Senior Vice President Rick Osterloh. The move comes after the hardware division cut hundreds of roles last January when it reorganized into a functional model. Google said the program aims to retain employees committed to the combined organization's mission, though it does not coincide with any product changes.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Offering+'Voluntary+Exit'+For+Employees+Working+on+Pixel%2C+Android%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F01%2F30%2F199236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_ico",
        "id": 2007285,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/30/199236/google-offering-voluntary-exit-for-employees-working-on-pixel-android?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Offering 'Voluntary Exit' For Employees Working on Pixel, Android",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T17:09:31+00:00",
        "description": "The Authors Guild -- one of the largest associations of writers in the US -- has launched a new project that allows authors to certify that their book was written by a human, and not generated by artificial intelligence. From a report: The Guild says its \"Human Authored\" certification aims to make it easier for writers to \"distinguish their work in increasingly AI-saturated markets,\" and that readers have a right to know who (or what) created the books they read. Human Authored certifications will be listed in a public database that anyone can access.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Books+Written+By+Humans+Are+Getting+Their+Own+Certification%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F01%2F30%2F1124208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.sl",
        "id": 2006359,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/30/1124208/books-written-by-humans-are-getting-their-own-certification?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Books Written By Humans Are Getting Their Own Certification",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T17:09:31+00:00",
        "description": "Nearly 90% of Oracle Java customers are looking to abandon the software maker's products following controversial licensing changes made in 2023, according to research firm Dimensional Research. \n\nThe exodus reflects growing frustration with Oracle's shift to per-employee pricing for its Java platform, which critics called \"predatory\" and could increase costs up to five times for the same software, Gartner found. The dissatisfaction runs deepest in Europe, where 92% of French and 95% of German users want to switch to alternative providers like Bellsoft Liberica, IBM Semeru, or Azul Platform Core.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Oracle+Faces+Java+Customer+Revolt+After+'Predatory'+Pricing+Changes%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F01%2F30%2F1617210%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=",
        "id": 2006358,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/01/30/1617210/oracle-faces-java-customer-revolt-after-predatory-pricing-changes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Oracle Faces Java Customer Revolt After 'Predatory' Pricing Changes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T16:02:05+00:00",
        "description": "France's Mistral AI is facing mounting pressure over its future as an independent European AI champion, as competition intensifies from U.S. tech giants and China's emerging players. The Paris-based startup, valued at $6.5 billion and backed by Microsoft and Nvidia, has struggled to keep pace with larger rivals despite delivering advanced AI models with a fraction of their resources. \n\nThe pressure increased this week after China's DeepSeek released a cutting-edge open-source model that challenged Mistral's efficiency-focused strategy. Mistral CEO Arthur Mensch dismissed speculation about selling to Big Tech companies, saying the firm hopes to go public eventually. However, one investor told the Financial Times that \"they need to sell themselves.\" \n\nThe stakes are high for Europe's tech ambitions. Mistral remains the region's only significant player in large language models, the technology behind ChatGPT, after Germany's Aleph Alpha pivoted away from the field last year. The company ",
        "id": 2005810,
        "language": null,
        "link": "https://slashdot.org/story/25/01/30/117225/has-europes-great-hope-for-ai-missed-its-moment?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Has Europe's Great Hope For AI Missed Its Moment?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T16:02:05+00:00",
        "description": "An anonymous reader shares a report: SoftBank is in talks to invest as much as $25 billion into OpenAI [non-paywalled source], in a deal that would make it the ChatGPT maker's biggest financial backer, as the pair partner on a huge new artificial intelligence infrastructure project. \n\nThe two companies announced last week they would lead a joint venture that would spend $100 billion on Stargate -- a sprawling data centre project touted by US President Donald Trump -- with the figure rising to as much as $500 billion over the next four years. \n\nSoftBank is in talks to invest $15 billion to $25 billion directly into OpenAI on top of its commitment of more than $15 billion to Stargate, according to multiple people with direct knowledge of the negotiations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SoftBank+in+Talks+To+Invest+Up+To+%2425+Billion+in+OpenAI%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F01%2F30%2F1114",
        "id": 2005809,
        "language": null,
        "link": "https://slashdot.org/story/25/01/30/1114205/softbank-in-talks-to-invest-up-to-25-billion-in-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SoftBank in Talks To Invest Up To $25 Billion in OpenAI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T14:41:08+00:00",
        "description": "India's IT minister on Thursday praised DeepSeek's progress and said the country will host the Chinese AI lab's large language models on domestic servers, in a rare opening for Chinese technology in India. From a report: \"You have seen what DeepSeek has done -- $5.5 million and a very very powerful model,\" IT Minister Ashwini Vaishnaw said on Thursday, responding to criticism New Delhi has received for its own investment in AI, which has been much less than many other countries. \n\nSince 2020, India has banned more than 300 apps and services linked to China, including TikTok and WeChat, citing national security concerns. The approval to allow DeepSeek to be hosted in India appears contingent on the platform storing and processing all Indian users' data domestically, in line with India's strict data localization requirements. [...] DeepSeek's models will likely be hosted on India's new AI Compute Facility. The facility is powered by 18,693 graphics processing units (GPUs), nearly doubl",
        "id": 2004983,
        "language": null,
        "link": "https://slashdot.org/story/25/01/30/1058204/india-lauds-chinese-ai-lab-deepseek-plans-to-host-its-models-on-local-servers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "India Lauds Chinese AI Lab DeepSeek, Plans To Host Its Models on Local Servers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T13:35:54+00:00",
        "description": "An anonymous reader quotes a report from Techdirt: While most of our conversations about Nintendo recently have focused on the somewhat bizarre patent lawsuit the company filed against Pocketpair over the hit game Palworld, traditionally our coverage of the company has focused more on the very wide net of IP bullying it engages in. This is a company absolutely notorious for behaving in as protectionist a fashion as possible with anything even remotely related to its IP. That reputation is so well known, in fact, that it serves the company's bullying purposes. When smaller entities get threat letters or oppositions to applied-for trademarks and the like, some simply back down without a fight.\n \nBut not the Super Mario shop in Costa Rica, it seems. The supermarket store owned by a man named Mario (hence the name), has had a trademark on its name since 2013. But when Mario's son, Charlito, went to renew the registration, Nintendo's lawyers suddenly came calling. Last year it was time to",
        "id": 2004443,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/30/0532233/nintendo-loses-trademark-battle-with-a-costa-rican-grocery-store?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nintendo Loses Trademark Battle With a Costa Rican Grocery Store",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T10:13:49+00:00",
        "description": "Mr. Dollar Ton shares a report from the BBC: The chemical building blocks of life have been found, among many other complex chemical compounds, in the grainy dust of an asteroid called Bennu, an analysis reveals. Samples of the space rock, which were scooped up by a Nasa spacecraft and brought to Earth, contain a rich array of minerals and thousands of organic compounds. These include amino acids, which are the molecules that make up proteins, as well as nucleobases -- the fundamental components of DNA. The findings are published in two papers in the journal nature.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Asteroid+Contains+Building+Blocks+of+Life%2C+Say+Scientists%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F01%2F30%2F0520218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=htt",
        "id": 2003173,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/30/0520218/asteroid-contains-building-blocks-of-life-say-scientists?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Asteroid Contains Building Blocks of Life, Say Scientists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T08:03:40+00:00",
        "description": "Astronomers have discovered a newly identified asteroid that has a 1-in-83 chance of striking Earth on December 22, 2032, though the most likely scenario is a close miss. Designated as 2024 YR4, the asteroid measures in at 196 feet wide and is currently 27 million miles away. Space.com reports: The near-Earth object (NEO) discovered in 2024, which is around half as wide as a football field is long, will make a very close approach to Earth on Dec. 22, 2032. It's estimated to come within around 66,000 miles (106,200 kilometers) of Earth on that day, according to NASA's Center of NEO Studies (CNEOS). However, when orbital uncertainties are considered, that close approach could turn out to be a direct hit on our planet.\n \nSuch an impact could cause an explosion in the atmosphere, called an \"airburst,\" or could cause an impact crater when it slams into the ground. This is enough to see asteroid 2024 YR4 leap to the top of the European Space Agency's NEO impact Risk List and NASA's Sentry ",
        "id": 2002711,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/30/0218237/astronomers-discover-196-foot-asteroid-with-1-in-83-chance-of-hitting-earth-in-2032?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Astronomers Discover 196-Foot Asteroid With 1-In-83 Chance of Hitting Earth In 2032",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T03:43:35+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: US Rep. Zoe Lofgren (D-Calif.) today proposed a law that would let copyright owners obtain court orders requiring Internet service providers to block access to foreign piracy websites. The bill would also force DNS providers to block sites. Lofgren said in a press release that she \"work[ed] for over a year with the tech, film, and television industries\" on \"a proposal that has a remedy for copyright infringers located overseas that does not disrupt the free Internet except for the infringers.\" Lofgren said she plans to work with Republican leaders to enact the bill. [...]\n \nLofgren's bill (PDF) would impose site-blocking requirements on broadband providers with at least 100,000 subscribers and providers of public domain name resolution services with annual revenue of over $100 million. The bill has exemptions for VPN services and \"similar services that encrypt and route user traffic through intermediary servers\"; DNS providers th",
        "id": 2001919,
        "language": null,
        "link": "https://politics.slashdot.org/story/25/01/30/028201/democrat-teams-up-with-movie-industry-to-propose-website-blocking-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Democrat Teams Up With Movie Industry To Propose Website-Blocking Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T02:38:54+00:00",
        "description": "The U.S. Copyright Office has ruled that AI-assisted works can receive copyright protection if they contain perceptible human creativity, such as creative modifications or arrangements. However, fully machine-generated content remains ineligible for copyright. The Associated Press reports: An AI-assisted work could be copyrightable if an artist's handiwork is perceptible. A human adapting an AI-generated output with \"creative arrangements or modifications\" could also make it fall under copyright protections. The report follows a review that began in 2023 and fielded opinions from thousands of people that ranged from AI developers, to actors and country singers.\n \nIt shows the copyright office will continue to reject copyright claims for fully machine-generated content. A person simply prompting a chatbot or AI image generator to produce a work doesn't give that person the ability to copyright that work, according to the report. \"Extending protection to material whose expressive eleme",
        "id": 2001732,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/30/0157258/ai-assisted-works-can-get-copyright-with-enough-human-creativity-says-us-copyright-office?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI-Assisted Works Can Get Copyright With Enough Human Creativity, Says US Copyright Office",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T01:34:41+00:00",
        "description": "jjslash shares a report from TechSpot: Atari teamed up with luxury watch brand Nubeo to celebrate the 45th anniversary of Asteroids with a collection of five limited-edition timepieces. Each watch, originally priced at $1,650 but discounted to $499, was limited to 125 pieces -- and they sold out almost immediately. The watches feature a unique Japanese automatic movement, where three rotating discs replace traditional hands. The smallest disc, featuring the classic Asteroids spaceship, acts as the second hand, while the minute and hour hands are represented by asteroid-filled outer discs.\n \nWhile they're not smartwatches, the timepieces feature Swiss Super-LumiNova glow-in-the-dark ink sitting underneath a sapphire lens within a stainless-steel case. They're water resistant up to 21 ATM (atmospheres) and have a screw-down crown, so you can show them off while at the beach or diving.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.c",
        "id": 2001510,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/29/2234210/atari-limited-edition-asteroids-watches-sell-out-instantly-for-45th-anniversary?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Atari Limited-Edition Asteroids Watches Sell Out Instantly For 45th Anniversary",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T01:34:41+00:00",
        "description": "NordVPN has introduced NordWhisper, a new protocol designed to bypass VPN blocks in restrictive countries like Russia and India by making VPN traffic appear like regular internet activity. Gizmodo reports: NordVPN claims to have found a way to make traffic from its service look normal, though admits that it may not always work perfectly. It also says the NordWhisper protocol may introduce more latency. The protocol is rolling out first to users on Windows, Linux, and Android. Support for other platforms will come in the future.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=NordVPN+Says+Its+New+Protocol+Can+Circumvent+VPN+Blockers%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F01%2F29%2F2242242%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F",
        "id": 2001509,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/29/2242242/nordvpn-says-its-new-protocol-can-circumvent-vpn-blockers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NordVPN Says Its New Protocol Can Circumvent VPN Blockers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-30T00:28:04+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Sony's game publishing arm has done a 180-degree turn on a controversial policy of requiring PC players to sign in with PlayStation accounts for some games, according to a blog post by the company. A PlayStation account will \"become optional\" for Marvel's Spider-Man 2, God of War Ragnarok, The Last of Us Part II Remastered, and Horizon Zero Dawn Remastered. Sony hasn't lost hope that players will still go ahead and use a PlayStation account, though, as it's tying several benefits to signing in.\n \nLogging in with PlayStation will be required to access trophies, the PlayStation equivalent of achievements. (Steam achievements appear to be supported regardless.) It will also allow friend management, provided you have social contacts on the PlayStation Network. Additionally, Sony is providing some small in-game rewards to each title that are available if you log in with its account system. You'll get early unlocks of the Spider-Man 20",
        "id": 2001203,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/29/2224212/sony-removes-playstation-account-requirement-from-4-single-player-steam-games?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sony Removes PlayStation Account Requirement From 4 Single-Player Steam Games",
        "vote": 0
    }
]