[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-20T17:30:01+00:00",
        "description": "It doesn’t seem so long ago that co-operative gaming was reduced to a niche mode, an afterthought of game developers looking to shoehorn extra ways to play into their games rather than building their experiences specifically around working together. \n\nIn 2025, after a few years’ renaissance, co-operative gaming is firmly back in favour. Working in teams with others, after all, is always a blast, even more so if they’re sat on the sofa with you. \n\nThis year could be the best offering for co-operative gaming ever, with a raft of two, three, or four player games coming from big name developers. Some are local only, most feature online co-op, but all are worth grabbing the controller together.",
        "id": 2159001,
        "language": null,
        "link": "https://www.youtube.com/watch?v=5gC2STSPxZk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5gC2STSPxZk/hqdefault.jpg",
        "title": "15 NEW Co-Op Games of 2025 To Look Forward To",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-20T15:30:03+00:00",
        "description": "Monster Hunter World and Rise have been firing on all cylinders for as long as anyone can remember, and unless things go spectacularly and unexpectedly wrong, it’s looking like the upcoming Monster Hunter Wilds is going to keep the beloved action RPG franchise’s upward trajectory going. \n\nFrom major new gameplay features to smaller but smart tweaks and improvements on the tried-and-true Monster Hunter formula, Wilds is looking to improve upon its predecessors in several ways- and like all of the series’ many, many fans, we can’t wait to dive into the game and get a taste of all of it ourselves. \n\nAs we count the days down to its release, then, here, that’s exactly what we’ll be discussing.",
        "id": 2157814,
        "language": null,
        "link": "https://www.youtube.com/watch?v=EFpPw7Z1vXs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EFpPw7Z1vXs/hqdefault.jpg",
        "title": "Monster Hunter Wilds - 10 Things We CAN'T WAIT TO DO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-20T10:30:01+00:00",
        "description": "Despite Assassin’s Creed forgoing its stealth-orientated roots for the RPG reboots Origins and Odyssey reception of these games was generally quite favourable. Thus, Assassin’s Creed Valhalla – coming on the cusp of a new console generation – garnered heaps of promise, plus a healthy dose of trepidation. \n\nVikings, after all, aren’t assassins. However, despite Valhalla harbouring something of an identity crisis the game functions quite well as an open world action adventure if not a stealth-orientated game. However, divisive efforts towards historical realism did bring problems which we’ll discuss at length in this video alongside story related issues (hint: it’s ginormous length and the usual Ubisoft bloat). \n\nAssassin’s Creed Valhalla is not a bad game by any stretch, but the jury is still out on whether it’s a good Assassin’s Creed game.",
        "id": 2155659,
        "language": null,
        "link": "https://www.youtube.com/watch?v=au6uwAV6Pmc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/au6uwAV6Pmc/hqdefault.jpg",
        "title": "Why Was Assassin's Creed Valhalla So DIVISIVE Among Gamers?",
        "vote": 0
    }
]