[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T21:15:05+00:00",
        "description": "An anonymous reader shares a report: PCI Express 7 is nearing completion, the PCI Special Interest Group said, and the final specification should be released later this year. PCI Express 7, the backbone of the modern motherboard, is at the stage 0.9, which the PCI-SIG characterizes as the \"final draft\" of the specification. The technology was at version 0.5 a year ago, almost to the day, and originally authored in 2022. \n\nThe situation remains the same, however. While modern PC motherboards are stuck on PCI Express 5.0, the specification itself moves ahead. PCI Express has doubled the data rate about every three years, from 64 gigtransfers per second in PCI Express 6.0 to the upcoming 128 gigatransfers per second in PCIe 7. (Again, it's worth noting that PCIe 6.0 exists solely on paper.) Put another way, PCIe 7 will deliver 512GB/s in both directions, across a x16 connection. \n\nIt's worth noting that the PCI-SIG doesn't see PCI Express 7 living inside the PC market, at least not init",
        "id": 2362034,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/19/201211/pci-express-70s-blazing-speeds-are-nearly-here-but-pcie-6-is-still-vapor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "PCI Express 7.0's Blazing Speeds Are Nearly Here, But PCIe 6 is Still Vapor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T21:15:05+00:00",
        "description": "Streaming service provider Plex announced Wednesday its first price increase in a decade for its premium Plex Pass subscription, raising monthly rates to $6.99 from $4.99, yearly subscriptions to $69.99 from $39.99, and lifetime access to $249.99 from $119.99, effective April 29. The company is also making remote playback of personal media a paid feature, introducing a Remote Watch Pass subscription at $1.99 monthly or $19.99 annually for users who don't need full Plex Pass features, and removing its one-time mobile activation fee. \n\nThe price increase applies to new and existing subscriptions, with the exception of existing Lifetime Plex Pass holders, the company said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Plex+Raises+Premium+Subscription+Prices+for+First+Time+in+Decade%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F03%2F19%2F1928245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"",
        "id": 2362035,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/19/1928245/plex-raises-premium-subscription-prices-for-first-time-in-decade?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Plex Raises Premium Subscription Prices for First Time in Decade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T17:38:11+00:00",
        "description": "SourceHut, an open-source-friendly git-hosting service, says web crawlers for AI companies are slowing down services through their excessive demands for data. From a report: \"SourceHut continues to face disruptions due to aggressive LLM crawlers,\" the biz reported Monday on its status page. \"We are continuously working to deploy mitigations. We have deployed a number of mitigations which are keeping the problem contained for now. However, some of our mitigations may impact end-users.\" \n\nSourceHut said it had deployed Nepenthes, a tar pit to catch web crawlers that scrape data primarily for training large language models, and noted that doing so might degrade access to some web pages for users. \"We have unilaterally blocked several cloud providers, including GCP [Google Cloud] and [Microsoft] Azure, for the high volumes of bot traffic originating from their networks,\" the biz said, advising administrators of services that integrate with SourceHut to get in touch to arrange an exceptio",
        "id": 2360472,
        "language": null,
        "link": "https://slashdot.org/story/25/03/19/1027251/ai-crawlers-havent-learned-to-play-nice-with-websites?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Crawlers Haven't Learned To Play Nice With Websites",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T17:38:11+00:00",
        "description": "The devastating impacts of the climate crisis reached new heights in 2024, with scores of unprecedented heatwaves, floods and storms across the globe, according to the UN's World Meteorological Organization. From a report: The WMO's report on 2024, the hottest year on record, sets out a trail of destruction from extreme weather that took lives, demolished buildings and ravaged vital crops. More than 800,000 people were displaced and made homeless, the highest yearly number since records began in 2008. \n\nThe report lists 151 unprecedented extreme weather events in 2024, meaning they were worse than any ever recorded in the region. Heatwaves in Japan left hundreds of thousands of people struck down by heatstroke. Soaring temperatures during heatwaves peaked at 49.9C at Carnarvon in Western Australia, 49.7C in the city of Tabas in Iran, and 48.5C in a nationwide heatwave in Mali. \n\nRecord rains in Italy led to floods, landslides and electricity blackouts; torrents destroyed thousands of",
        "id": 2360473,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/19/1022245/more-than-150-unprecedented-climate-disasters-struck-world-in-2024-says-un?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "More Than 150 'Unprecedented' Climate Disasters Struck World in 2024, Says UN",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T16:33:08+00:00",
        "description": "Federal authorities have broken up an international crime ring that stole thousands of iPhones from porches nationwide [non-paywalled link], arresting 13 people last month after a sophisticated operation that combined high-tech tools with old-fashioned bribery. \n\nThe thieves created software to scrape FedEx tracking numbers and paid AT&amp;T store employees to provide customer order details and delivery addresses, according to WSJ, which cites prosecutors. Armed with this information, runners intercepted packages at doorsteps moments after delivery. \n\nDemetrio Reyes Martinez, known online as \"CookieNerd,\" developed code that circumvented FedEx limits on delivery-data requests, while AT&amp;T employee Alejandro Then Castillo used his credentials to track hundreds of shipments and reportedly received up to $2,500 for recruiting other employees. Stolen devices were funneled through Wyckoff Wireless in Brooklyn, a store owned by Joel Suriel, who was already on supervised release from a p",
        "id": 2359790,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/19/0927253/fedex-data-scraping-and-telecom-insider-bribes-powered-nationwide-iphone-theft-operation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FedEx Data Scraping and Telecom Insider Bribes Powered Nationwide iPhone Theft Operation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T15:28:06+00:00",
        "description": "Nature: A Microsoft researcher [this week] presented results behind the company's controversial claim last month to have created the first 'topological' qubits -- a long-sought goal of quantum computing. In front of a packed room at a meeting of the American Physical Society (APS), Chetan Nayak, a theoretical physicist leading Microsoft's quantum computing effort in Redmond, Washington, explained how the company is developing topological qubits, which would be the building blocks for a noise-resistant quantum computer. \n\nPhysicists in the audience told Nature's news team they are still unsure whether Microsoft really has made the first topological qubits, however. \"It's a hard problem,\" says Ali Yazdani, an experimental physicist at Princeton University in New Jersey. To anyone trying to make topological qubits, he says, \"good luck.\" When Nayak displayed measurement data during his presentation, he acknowledged that a characteristic signal was difficult to see due to electrical noise",
        "id": 2359263,
        "language": null,
        "link": "https://slashdot.org/story/25/03/19/088253/microsoft-quantum-computing-claim-still-lacks-evidence?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Quantum Computing Claim Still Lacks Evidence",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T14:23:38+00:00",
        "description": "Sony has developed a new TV display technology combining individual red, green, and blue LEDs for backlighting, potentially offering a middle ground between existing Mini LED and OLED panels. Dubbed \"General RGB LED Backlight Technology,\" the system enables precise color control without sacrificing brightness, reaching 4000 cd/m2 -- matching Sony's professional reference monitors. \n\nUnlike conventional Mini LED TVs that use arrays of blue LEDs, Sony's RGB implementation delivers significantly improved color accuracy and viewing angles. In side-by-side comparisons with Sony's premium Bravia 9 Mini LED TV, the RGB prototype displayed deeper color gradations and eliminated the characteristic bluish blooming effect around bright objects on dark backgrounds. \n\nThe technology isn't entirely novel, the Verge reports -- Sony released a Qualia TV with RGB backlighting in 2004 and demonstrated \"Crystal LED\" prototypes in 2012. Competitors including Hisense, TCL, and Samsung are developing simi",
        "id": 2358636,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/19/0743248/sony-unveils-rgb-led-backlight-tech-that-outperforms-traditional-mini-led?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sony Unveils RGB LED Backlight Tech That Outperforms Traditional Mini LED",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T13:18:50+00:00",
        "description": "An anonymous reader quotes a report from Reuters: The Belgian prosecutor's office said on Tuesday that it has charged five people in connection with a bribery investigation in the European Parliament allegedly linked to China's Huawei. The five were detained last week. Four have now been arrested and charged with active corruption and involvement in a criminal organization, while a fifth faces money laundering charges and has been released conditionally. The prosecutor's officer did not disclose the names of those involved or give information that could identify them.\n \nIt said new searches had taken place on Monday, this time at European Parliament offices. Huawei said last week it took the allegations seriously. \"Huawei has a zero tolerance policy towards corruption or other wrongdoing, and we are committed to complying with all applicable laws and regulations at all times,\" it said. The prosecutors have said the alleged corruption took place \"very discreetly\" since 2021 under the ",
        "id": 2358074,
        "language": null,
        "link": "https://slashdot.org/story/25/03/18/2321249/five-charged-in-european-parliament-huawei-bribery-probe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Five Charged In European Parliament Huawei Bribery Probe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T11:07:58+00:00",
        "description": "The abstract of a paper published on National Bureau of Economic Research: Ensuring broad access to the patent system is crucial for fostering innovation and promoting economic growth. To support this goal, the U.S. Patent and Trademark Office offers reduced fees for small and micro entities. This paper investigates whether fee rates affect the filing of applications by small and micro entities. Exploiting recent fee reforms, the study evaluates the relationship between fee changes and the number of new entrants, controlling for potential confounding factors such as legislative changes. The findings suggest that fee reductions alone are insufficient to significantly increase participation in the patent system among small and micro entities.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Effect+of+Application+Fees+on+Entry+into+Patenting%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F03%2F18%2F2047251%2F%3Futm",
        "id": 2357128,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/18/2047251/the-effect-of-application-fees-on-entry-into-patenting?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Effect of Application Fees on Entry into Patenting",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T07:52:52+00:00",
        "description": "During the company's GTC 2025 keynote today, Nvidia founder and CEO Jensen Huang announced Isaac GR00T N1 -- the company's first open-source, pre-trained yet customizable foundation model designed to accelerate the development and capabilities of humanoid robots. \"The age of generalist robotics is here,\" said Huang. \"With Nvidia Isaac GR00T N1 and new data-generation and robot-learning frameworks, robotics developers everywhere will open the next frontier in the age of AI.\" The Verge reports: Huang demonstrated 1X's NEO Gamma humanoid robot performing autonomous tidying jobs using a post-trained policy built on the GR00T N1 model. [...] Other companies developing humanoid robots who have had early access to the GR00T N1 model include Boston Dynamics, the creators of Atlas; Agility Robotics; Mentee Robotics; and Neura Robotics. Originally announced as Project GR00T a year ago, the GR00T N1 foundation model utilizes a dual-system architecture inspired by human cognition.\n \nSystem 1, as",
        "id": 2356074,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/18/2312229/nvidia-says-the-age-of-generalist-robotics-is-here?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia Says 'the Age of Generalist Robotics Is Here'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T03:34:54+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: [A] team of Korean researchers [describe] how they've engineered a bacterial strain that can make a useful polymer starting with nothing but glucose as fuel. The system they developed is based on an enzyme that the bacteria use when they're facing unusual nutritional conditions, and it can be tweaked to make a wide range of polymers. The researchers focused on the system bacterial cells use for producing polyhydroxyalkanoates (PHAs). These chemicals are formed when the bacterial cells continue to have a good supply of carbon sources and energy, but they lack some other key nutrients needed to grow and divide. Under these circumstances, the cell will link together small molecules that contain a handful of carbons, forming a much larger polymer. When nutritional conditions improve, the cell can simply break down the polymer and use the individual molecules it contained.\n \nThe striking thing about this system is that it's not especi",
        "id": 2355203,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/18/2243230/researchers-engineer-bacteria-to-produce-plastics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Engineer Bacteria To Produce Plastics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T02:28:39+00:00",
        "description": "Italian newspaper Il Foglio claims to have published the world's first entirely AI-generated edition as part of a month-long experiment to explore AI's impact on journalism. The special four-page supplement, available in print and online, features AI-written articles, headlines, and reader letters. The only thing the human journalists provided were prompts. The Guardian reports: The front page of the first edition of Il Foglio AI carries a story referring to the US president, Donald Trump, describing the \"paradox of Italian Trumpians\" and how they rail against \"cancel culture\" yet either turn a blind eye, or worse, \"celebrate\" when \"their idol in the US behaves like the despot of a banana republic.\" The front page also features a column headlined \"Putin, the 10 betrayals,\" with the article highlighting \"20 years of broken promises, torn-up agreements and words betrayed\" by Vladimir Putin, the Russian president.\n \nIn a rare upbeat story about the Italian economy, another article point",
        "id": 2355061,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/18/2231255/italian-newspaper-says-it-has-published-worlds-first-ai-generated-edition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Italian Newspaper Says It Has Published World's First AI-Generated Edition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T02:28:39+00:00",
        "description": "Trend Micro uncovered an eight-year-long spying campaign exploiting a Windows vulnerability involving malicious .LNK shortcut files, which attackers padded with whitespace to conceal commands. Despite being reported to Microsoft in 2023, the company considers it a UI issue rather than a security risk and has not prioritized a fix. The Register reports: The attack method is low-tech but effective, relying on malicious .LNK shortcut files rigged with commands to download malware. While appearing to point to legitimate files or executables, these shortcuts quietly include extra instructions to fetch or unpack and attempt to run malicious payloads. Ordinarily, the shortcut's target and command-line arguments would be clearly visible in Windows, making suspicious commands easy to spot. But Trend's Zero Day Initiative said it observed North Korea-backed crews padding out the command-line arguments with megabytes of whitespace, burying the actual commands deep out of sight in the user inter",
        "id": 2355062,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/18/2226205/microsoft-isnt-fixing-8-year-old-shortcut-exploit-abused-for-spying?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Isn't Fixing 8-Year-Old Shortcut Exploit Abused For Spying",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T01:23:38+00:00",
        "description": "According to Politico, Gov. Gavin Newsom has distributed prepaid burner phones to around 100 California business leaders, giving them direct access to him and reinforcing his pro-business stance. \"If you ever need anything, I'm a phone call away,\" read one of the notes. From the report: It was Newsom's idea, a representative said, and has already yielded some \"valuable interactions.\" That arrangement surprised some people POLITICO spoke with, largely because Newsom is already known as an inveterate texter whose digits live in many business titans' contacts. He's also long been seen as more aligned with business interests than the Legislature, the proverbial adult in the room when private pillars like Silicon Valley need a sympathetic ear or a veto. But Newsom wanted to convey that he's intent on maintaining California's competitive edge. Phones are still going out.\n \nThe California Protocol Foundation picked up the tab. That organization gets money from businesses and nonprofits for ",
        "id": 2354783,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/03/18/2220249/gavin-newsom-is-reportedly-sending-burner-phones-to-tech-ceos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gavin Newsom Is Reportedly Sending Burner Phones To Tech CEOs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T00:19:55+00:00",
        "description": "NASA's SpaceX Crew-9 has returned to Earth safely after a stay of more than nine months aboard the International Space Station. The crew remained in space longer than expected due to issues with Boeing's Starliner capsule, which was originally scheduled to bring them home sooner.\n \nWhile the mission has been politically fraught, the astronauts said in a rare space-to-earth interview last month that they were neither stranded nor abandoned. \"That's been the rhetoric. That's been the narrative from day one: stranded, abandoned, stuck -- and I get it. We both get it,\" [NASA astronaut Butch] Wilmore said. \"But that is, again, not what our human spaceflight program is about. We don't feel abandoned, we don't feel stuck, we don't feel stranded.\" Wilmore added a request: \"If you'll help us change the rhetoric, help us change the narrative. Let's change it to 'prepared and committed.' That's what we prefer...\" CNN has more details on the arrival: Williams and Wilmore, alongside NASA's Nick H",
        "id": 2354494,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/18/2258246/starliner-astronauts-return-to-earth-after-more-than-9-months-in-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Starliner Astronauts Return To Earth After More Than 9 Months In Space",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T00:19:55+00:00",
        "description": "U.S. music streaming services surpassed 100 million subscribers in 2024 [PDF] while industry revenue hit a record $14.9 billion, up 4% from the previous year, according to the Record Industry Association of America (RIAA). \n\nPhysical media sales outpaced digital growth, with vinyl records increasing 7% to $1.4 billion, outselling CDs ($541 million) for the third consecutive year. Digital downloads plummeted 14.9%, now representing just 2% of industry revenue.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Music+Streaming+Tops+100+Million+Subscribers%3B+Vinyl+Outsells+CDs+For+Third+Year%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F03%2F18%2F2052244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F03%2F18%2F2052244%2Fus-mu",
        "id": 2354493,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/18/2052244/us-music-streaming-tops-100-million-subscribers-vinyl-outsells-cds-for-third-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Music Streaming Tops 100 Million Subscribers; Vinyl Outsells CDs For Third Year",
        "vote": 0
    }
]