[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T17:01:07+00:00",
        "description": "When it was first released, Garou: Mark of the Wolves didn't have the universal appeal or extensive marketing campaign of a new Street Fighter or Tekken. Nevertheless, SNK's newest mainline title in the Fatal Fury series offered incredible balance, an excellent roster of characters with differing styles, and new interesting gameplay mechanics.\n\nNearly three decades later, Garou is getting a sequel in Fatal Fury: City of the Wolves. On top of a fully 3D art style, it features newcomers like Preecha and Vox Reaper alongside Fatal Fury characters like Mai Shiranui and Billy Kane. There's also the REV System, which adds more strategy and encourages an aggressive play style.\n\nWith 26 years between them, there are numerous differences between the two titles. Here are the 15 biggest differences you should know before picking up Fatal Fury: City of the Wolves on April 24th for Xbox Series X/S, PS5, PS4, and PC.",
        "id": 2360511,
        "language": null,
        "link": "https://www.youtube.com/watch?v=tmFu0RPha0I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tmFu0RPha0I/hqdefault.jpg",
        "title": "Fatal Fury: City of The Wolves vs. Mark of The Wolves: What's NEW After Almost 25 Years?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-19T09:30:20+00:00",
        "description": "Assassin’s Creed Shadows is here, finally delivering the feudal Japan open world setting in an Assassin’s Creed game we’ve been waiting for for so long, and sure enough, it’s absolutely packed full of things to do and see. \n\nFrom exploring its vast and gorgeous open world to tracking down its abundant optional activities, from diving into the nitty gritties of its multilayered progression mechanics to fully utilizing its many gameplay systems- there’s a lot to juggle at any given time. \n\nTo help ensure you juggle it all well, here, we’ve compiled a few pointers that you should keep in mind as you begin your odyssey through feudal Japan as Naoe the shinobi and Yasuke the samurai.",
        "id": 2356698,
        "language": null,
        "link": "https://www.youtube.com/watch?v=V4LOK8zAiIM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/V4LOK8zAiIM/hqdefault.jpg",
        "title": "15 Things I Wish I Knew Before Playing Assassin's Creed Shadows",
        "vote": 0
    }
]