[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T23:26:26+00:00",
        "description": "Automotive historian Dan Albert loves the \"adorable tiny truck\" he's driving. It's one of the small Japan-made \"kei\" pickups and minivans that \"make up about a third of car sales in Japan.\" Americans can legally import older models for less than $10,000, and getting 40 miles per gallon they're \"Cheap to buy and run... rugged, practical, no-frills machines &mdash; exactly what the American-built pickup truck used to be.\" \n\nBut unfortunately, kei buyers face \"bureaucratic roadblocks that states like Massachusetts have erected to keep kei cars and trucks out of the hands of U.S. drivers.\"\n\nSeveral state departments of motor vehicles (DMVs) have balked at registering the imported machines, saying that they're too unsafe for American streets. Owners have responded with a righteous mix of good humor, lobbying and lawsuits... Kei trucks do not meet the Federal Motor Vehicle Safety Standards, or FMVSS &mdash; the highly specific rules US-market new cars must meet. But since 1988, the Importe",
        "id": 2440179,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/29/2126251/why-did-the-government-declare-war-on-my-adorable-tiny-truck?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Why Did the Government Declare War on My Adorable Tiny Truck?'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T21:17:59+00:00",
        "description": "\"I am having conversations every day with people whose careers are sort of over,\" a 53-year-old film and TV director told the New York Times:\n\nIf you entered media or image-making in the '90s &mdash; magazine publishing, newspaper journalism, photography, graphic design, advertising, music, film, TV &mdash; there's a good chance that you are now doing something else for work. That's because those industries have shrunk or transformed themselves radically, shutting out those whose skills were once in high demand... When digital technology began seeping into their lives, with its AOL email accounts, Myspace pages and Napster downloads, it didn't seem like a threat. But by the time they entered the primes of their careers, much of their expertise had become all but obsolete. \n\nMore than a dozen members of Generation X interviewed for this article said they now find themselves shut out, economically and culturally, from their chosen fields. \"My peers, friends and I continue to navigate t",
        "id": 2439620,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/29/0626254/are-tech-driven-career-meltdowns-hitting-generation-x?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Are Tech-Driven 'Career Meltdowns' Hitting Generation X?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T20:12:53+00:00",
        "description": "Last week an Air France flight to the Caribbean had to turn around and return to Paris, reports the Washington Post, \"after a passenger could not locate their cellphone.\" \n\nBecause of fears that an unattended cellphone could overheat &mdash; and because the passenger and crew couldn't find the phone &mdash; the Boeing 777 turned around off the coast of France \"and returned to the airport, according to the flight-tracking service FlightAware. It landed back where it started a little more than two hours after taking off, with 375 passengers, 12 cabin crew and two pilots on board...\"\n\nIt was the airline's second Caribbean-bound flight to turn around because of a phone since early February as the aviation industry grapples with the risk of fires sparked by lithium batteries... Air France did not say where on the plane the phone was lost &mdash; or where it was ultimately located. \"After checks by the maintenance teams, the device was found and the aircraft was able to take off again quic",
        "id": 2439348,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/03/29/0236203/why-a-lost-cellphone-forced-an-airplane-to-turn-around-in-mid-flight?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why a Lost Cellphone Forced an Airplane to Turn Around in Mid-Flight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T19:08:13+00:00",
        "description": "In 1999 Slashdot reader Jeremie announced \"a new project I recently started to create a complete open-source platform for Instant Messaging with transparent communication to other IM systems (ICQ, AIM, etc).\" It was the first release of the eXtensible Messaging and Presence Protocol, and by 2008 Slashdot was asking if XMPP was \"the next big thing.\" Facebook even supported it for third-party chat clients until 2015. \n\nAnd here in 2025, the chair of the nonprofit XMPP Standards Foundation is long-time Slashdot reader ralphm, who is now issuing this call to action at XMPP.org:\n\nThe European Digital Markets Act (DMA) is designed to break down walled gardens and enforce messaging interoperability. As a designated gatekeeper, Meta&mdash;controlling WhatsApp and Messenger&mdash;must comply. However, its current proposal falls short, risking further entrenchment of its dominance rather than fostering genuine competition. [..]\n\n A Call to Action\n\n The XMPP Standards Foundation urges Meta to a",
        "id": 2439097,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/29/1831231/an-open-letter-to-meta-support-true-messaging-interoperability-with-xmpp?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'An Open Letter To Meta: Support True Messaging Interoperability With XMPP'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T18:03:16+00:00",
        "description": "Long-time Slashdot reader Baron_Yam writes:\n\nNo more burning fossil fuels, playing with fissile material, damming rivers, erecting wind mills, or making solar panels. All of our energy needs could potentially be supplied by the angular kinetic energy of the Earth &mdash; and because of the mass of the planet, doing so would slow its rotation down by a mere 7ms per century. [Which is similar to speed changes caused by natural phenomena such as the Moon's pull and changing dynamics inside the planet's core.\"]\n\n\n Normally this would be considered impossible as the Earth's large and uniform field does not induce a current in conductors, but researchers believe that a hollow cylinder of manganese, zinc and iron can alter the interaction with our planetary magnetic field and allow the extraction of energy from it. So far, the results are positive but still below the level where they cannot be explained by multiple possible causes of experimental error. Further research is required to confi",
        "id": 2438741,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/29/0536241/scientists-may-have-discovered-how-to-extract-power-from-the-earths-rotation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists May Have Discovered How To Extract Power From the Earth's Rotation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T16:58:15+00:00",
        "description": "An anonymous reader shared this report from the Mercury News:\n\nAfter a year of fastidious planning, a microscopic sample of the ultra-rare radioactive element berkelium arrived at a Berkeley Lab. With just 48 hours to experiment before it would become unusable, a group of nearly 20 researchers focused intently on creating a brand-new molecule. Using a chemical glove box, a polycarbonate glass box with protruding gloves that shields substances from oxygen and moisture, scientists combined the berkelium metal with an organic molecule containing only carbon and hydrogen to create a chemical reaction... [Post-doc researcher Dominic] Russo, researcher Stefan Minasian, and 17 other scientists at Lawrence Berkeley National Laboratory had created berkelocene, a new molecule that usurps theorists' expectations about how carbon bonds with heavy-metal elements. \n\nIn the future, berkelocene may help humanity safely dispose of nuclear waste, according to a study published in the academic journal ",
        "id": 2438361,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/29/0315205/scientists-create-new-heavy-metal-molecule-berkelocene?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Create New Heavy-Metal Molecule:  'Berkelocene'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T15:52:51+00:00",
        "description": "The Washington Post reports that after months of polar darkness, the extent of sea ice blanketing the Arctic this winter \"fell to the lowest level on record, researchers announced this week... the smallest maximum extent in the 47-year satellite record, according to the National Snow and Ice Data Center. \n\n\"Since then, the ice has already begun to melt again.\"\n \"Sea ice is acting like the old canary in the coal mine,\" Dartmouth University geophysicist Don Perovich said. \"It's saying loud and clear that warming is occurring....\" \n\nIn the summer, when the sun's radiation shines down on the Arctic for 24 hours a day, the ice acts as a shield, reflecting more than half of the light that hits it back into space.... With so little sea ice in the Arctic this year, more sunlight will be able to reach the open ocean, which absorbs more than 90 percent of the radiation that hits it. This will further warm the region, accelerating ice melt and exposing even more water to the light. This feedbac",
        "id": 2438014,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/29/0435221/as-the-arctics-winter-sea-ice-hits-a-new-record-low---what-happens-next?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "As the Arctic's Winter Sea Ice Hits a New Record Low - What Happens Next?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T14:47:46+00:00",
        "description": "An anonymous reader shared this report from BleepingComputer:\n\n\n\nThree security bypasses have been discovered in Ubuntu Linux's unprivileged user namespace restrictions, which could be enable a local attacker to exploit vulnerabilities in kernel components. The issues allow local unprivileged users to create user namespaces with full administrative capabilities and impact Ubuntu versions 23.10, where unprivileged user namespaces restrictions are enabled, and 24.04 which has them active by default... \n\nUbuntu added AppArmor-based restrictions in version 23.10 and enabled them by default in 24.04 to limit the risk of namespace misuse. Researchers at cloud security and compliance company Qualys found that these restrictions can be bypassed in three different ways... The researchers note that these bypasses are dangerous when combined with kernel-related vulnerabilities, and they are not enough to obtain complete control of the system... Qualys notified the Ubuntu security team of their ",
        "id": 2437661,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/29/0555241/new-ubuntu-linux-security-bypasses-require-manual-mitigations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Ubuntu Linux Security Bypasses Require Manual Mitigations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T13:43:10+00:00",
        "description": "An anonymous reader quotes a report from MIT Technology Review: The first clinical trial of a therapy bot that uses generative AI suggests it was as effective as human therapy for participants with depression, anxiety, or risk for developing eating disorders. Even so, it doesn't give a go-ahead to the dozens of companies hyping such technologies while operating in a regulatory gray area. A team led by psychiatric researchers and psychologists at the Geisel School of Medicine at Dartmouth College built the tool, called Therabot, and the results were published on March 27 in the New England Journal of Medicine. Many tech companies are building AI therapy bots to address the mental health care gap, offering more frequent and affordable access than traditional therapy. However, challenges persist: poorly worded bot responses can cause harm, and forming meaningful therapeutic relationships is hard to replicate in software. While many bots rely on general internet data, researchers at Dart",
        "id": 2437316,
        "language": null,
        "link": "https://slashdot.org/story/25/03/29/101206/first-trial-of-generative-ai-therapy-shows-it-might-help-with-depression?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "First Trial of Generative AI Therapy Shows It Might Help With Depression",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T10:28:37+00:00",
        "description": "Despite recent test failures, NASA has added SpaceX's Starship to its Launch Services Program contract, allowing it to compete for future science missions once it achieves a successful orbital flight. Florida Today reports: NASA announced the addition Friday to its current launch provider contract with SpaceX, which covers the Falcon 9 and Falcon Heavy. This opens the possibility of Starship flying future NASA science missions -- that is once Starship reaches a successful orbital flight.\n \n\"NASA has awarded SpaceX of Starbase, Texas, a modification under the NASA Launch Services (NLS) II contract to add Starship to their existing Falcon 9 and Falcon Heavy launch service offerings,\" NASA's statement reads. Th announcement is simply an onboarding of Starship as an option, as the contract runs through 2032. However, SpaceX is under pressure to get Starship operational by next year as the company plans not only to send an uncrewed Starship to Mars by late 2026, but the NASA Artemis III m",
        "id": 2436475,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/29/0950235/nasa-adds-spacexs-starship-to-launch-services-program-fleet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA Adds SpaceX's Starship To Launch Services Program Fleet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T07:12:39+00:00",
        "description": "A new study warns that toxic Martian dust contains fine particles and harmful substances like silica and metals that pose serious health risks to astronauts, making missions to Mars more dangerous than previously thought. The Guardian reports: During Apollo missions to the moon, astronauts suffered from exposure to lunar dust. It clung to spacesuits and seeped into the lunar landers, causing coughing, runny eyes and irritated throats. Studies showed that chronic health effects would result from prolonged exposure. Martian dust isn't as sharp and abrasive as lunar dust, but it does have the same tendency to stick to everything, and the fine particles (about 4% the width of a human hair) can penetrate deep into lungs and enter the bloodstream. Toxic substances in the dust include silica, gypsum and various metals.\n \n\"A mission to Mars does not have the luxury of rapid return to Earth for treatment,\" the researchers write in the journal GeoHealth. And the 40-minute communication delay w",
        "id": 2435746,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/29/0035216/martian-dust-may-pose-health-risk-to-humans-exploring-red-planet-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Martian Dust May Pose Health Risk To Humans Exploring Red Planet, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T03:57:45+00:00",
        "description": "An anonymous reader quotes a report from The Verge: A concert on Monday night at New York's Radio City Music Hall was a special occasion for Frank Miller: his parents' wedding anniversary. He didn't end up seeing the show -- and before he could even get past security, he was informed that he was in fact banned for life from the venue and all other properties owned by Madison Square Garden (MSG). After scanning his ticket and promptly being pulled aside by security, Miller was told by staff that he was barred from the MSG properties for an incident at the Garden in 2021. But Miller says he hasn't been to the venue in nearly two decades.\n \n\"They hand me a piece of paper letting me know that I've been added to a ban list,\" Miller says. \"There's a trespass notice if I ever show up on any MSG property ever again,\" which includes venues like Radio City, the Beacon Theatre, the Sphere, and the Chicago Theatre. He was baffled at first. Then it dawned on him: this was probably about a T-shirt",
        "id": 2435288,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/29/0028217/madison-square-garden-bans-fan-after-surveillance-system-ids-him-as-critic-of-its-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Madison Square Garden Bans Fan After Surveillance System IDs Him as Critic of Its CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T01:47:22+00:00",
        "description": "New research suggests that Prototaxites, once believed to be a giant fungus, may actually represent an entirely extinct and previously unknown branch of complex life, distinct from fungi, plants, animals, and protists. Live Science reports: The researchers studied the fossilized remains of one Prototaxites species named Prototaxites taiti, found preserved in the Rhynie chert, a sedimentary deposit of exceptionally well-preserved fossils of early land plants and animals in Scotland. This species was much smaller than many other species of Prototaxites, only growing up to a few inches tall, but it is still the largest Prototaxites specimen found in this region. Upon examining the internal structure of the fossilized Prototaxites, the researchers found that its interior was made up of a series of tubes, similar to those within a fungus. But these tubes branched off and reconnected in ways very unlike those seen in modern fungi. \"We report that Prototaxites taiti was the largest organism",
        "id": 2434921,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/28/238210/giant-fungus-like-organism-may-be-completely-unknown-branch-of-life?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Giant, Fungus-Like Organism May Be Completely Unknown Branch of Life",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T00:45:08+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Imagine working with special cameras that capture light your eyes can't even see -- ultraviolet rays that cause sunburn, infrared heat signatures that reveal hidden writing, or specific wavelengths that plants use for photosynthesis. Or perhaps using a special camera designed to distinguish the subtle visible differences that make paint colors appear just right under specific lighting. Scientists and engineers do this every day, and they're drowning in the resulting data. A new compression format called Spectral JPEG XL might finally solve this growing problem in scientific visualization and computer graphics. Researchers Alban Fichet and Christoph Peters of Intel Corporation detailed the format in a recent paper published in the Journal of Computer Graphics Techniques (JCGT). It tackles a serious bottleneck for industries working with these specialized images. These spectral files can contain 30, 100, or more data points per pix",
        "id": 2434651,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/28/232215/a-new-image-file-format-efficiently-stores-invisible-light-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "A New Image File Format Efficiently Stores Invisible Light Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-29T00:45:08+00:00",
        "description": "The Federal Deposit Insurance Corporation (FDIC) says banks no longer need prior approval before engaging in crypto-related activities, such as holding digital currency assets or partnering with companies in the industry. Axios reports: After publishing a general caution against banks participating in the industry just two years ago, the FDIC is the latest Trump administration regulator to change its tune entirely amid the president's warm embrace of crypto. \"With today's action, the FDIC is turning the page on the flawed approach of the past three years,\" FDIC acting chairman Travis Hill said in a statement.\n \nThe OCC was the first of those regulators to revise their guidance, telling banks it supervises earlier this month that they no longer need permission to engage in certain common cryptocurrency-related activities. The Fed as of Friday had not issued any update, though chair Jerome Powell told lawmakers during a congressional hearing last month that the central bank would take ",
        "id": 2434650,
        "language": null,
        "link": "https://slashdot.org/story/25/03/28/2252217/fdic-rescinds-guidance-around-banks-and-crypto?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FDIC Rescinds Guidance Around Banks and Crypto",
        "vote": 0
    }
]