[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-22T23:16:23.361796+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-22T23:00:09+00:00",
        "description": "Mortal Kombat is a franchise that needs no introduction for fighting game fans, having made a name for itself in the many years it has been around. Digital Eclipse's effort to bring the best of its early days back into the spotlight via the Mortal Kombat Legacy Kollection might be a very exciting release for those of you who've been a part of that journey.\n\nOr perhaps you're new to the franchise and are interested to see how and why it has earned such a reputation over the years. Either way, we've put together a few things you may want to know before you decide to take the plunge into the past and pick up your copy of the game.",
        "id": 3879652,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=AFZorPGi1NY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AFZorPGi1NY/hqdefault.jpg",
        "title": "Mortal Kombat Legacy Kollection - 15 Things You ABSOLUTELY NEED To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-22T15:37:04.860625+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-22T13:30:44+00:00",
        "description": "It's been a long wait, but Ninja Gaiden 4 is finally available and receiving relatively positive impressions from critics and fans. However, when you look back on previous games in the series, specifically the peak of Ninja Gaiden Black, it's interesting to see how drastically the execution has changed. Certain design choices remain the same (though some have different sensibilities), and yet, the essence of Ninja Gaiden is very much intact.\n\nOf course, Black is known for taking everything about the first Ninja Gaiden and essentially enhancing it, adding new difficulty options (including the series' staple Master Ninja), Mission Mode, new bosses, and even improvements to the camera. The difficulty also changed numerous encounters, resulting in different enemy layouts and thus more challenging scenarios.\n\nSo, how much better is Ninja Gaiden 4 over Ninja Gaiden Black? Does it set a new standard for the series, or does it fall behind? Let's dive in and find out.",
        "id": 3875817,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=i8tr0wVImBY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/i8tr0wVImBY/hqdefault.jpg",
        "title": "Does Ninja Gaiden 4 SURPASS Ninja Gaiden Black?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-22T09:59:31.651127+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-22T09:30:33+00:00",
        "description": "Jurassic World Evolution 3 isn’t a huge step forward, nor does it do anything radically different from its predecessors in a way that would convince those who didn’t like the first two Evolution games to dive into this newest entry. \n\nBut for fans of the genre, the Evolution games, and the Jurassic Park series as a whole, Jurassic World Evolution 3 is an excellent love letter to all of those things, making it a must buy, just like its predecessors. Once again, Frontier Developments has made sure that life finds a way.",
        "id": 3873268,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=c9V7i4pZalY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/c9V7i4pZalY/hqdefault.jpg",
        "title": "Jurassic World Evolution 3 Review - The Final Verdict",
        "vote": 0
    }
]