[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-31T15:30:29+00:00",
        "description": "PlayStation users are eating good with regard to racing games nowadays. The recently released Test Drive Unlimited: Solar Crown added yet another open world racer to the PS5 catalog. The Crew Motorfest offers a solid open world racing experience that keeps getting great free updates. But none of those can really replace Forza Horizon, even if they did a great job pacifying PS players for a time.\n\nThat all changes on April 28th when Forza Horizon 5 enters the PS5 ecosystem. And it crashes onto the console with a new update featuring additional environments and eight new cars to boot.\n\nWhether you’re into sim racing games like Gran Turismo and Assetto Corsa, open world exploration games like The Crew, or you favor a more off-the-walls arcade experience the likes of which Hot Wheels Unleashed provides, PlayStation has you covered.",
        "id": 2450815,
        "language": null,
        "link": "https://www.youtube.com/watch?v=sXy_8lUM9tA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sXy_8lUM9tA/hqdefault.jpg",
        "title": "With Forza Horizon 5 Coming To PS5, There's Never Been A Better Time For PlayStation Racing Fans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-31T09:30:18+00:00",
        "description": "Sony bagged a big win with the PlayStation 2, selling well over 160 million units with a manufacturing lifecycle that lasted over a decade. While there were many contributing factors to the exorbitant degrees of PS2’s success, chief among them has to be the exquisite library of games both of the first party and third party ilk. \n\nFrom revolutionary shooters to realistic racing sims and action adventures, the PS2 was home to many defining hits that so many fans continue to hold in high regard all these years later. With this video, we will be taking a look at 15 such games that are not only best in class but also hold up quite well in the modern day and age.",
        "id": 2448160,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ez_Jt1mNR-o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ez_Jt1mNR-o/hqdefault.jpg",
        "title": "15 Legendary PS2 Games That Are STILL Amazing Today [2025 Edition]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-31T06:30:19+00:00",
        "description": "Nexon and Neople’s The First Berserker: Khazan is the latest in an endless line of Soulslike action RPGs, and as several reviews (including our very own) have said, it’s a game with quite a few strengths, as well as several weaknesses. \n\nWhere its flaws are concerned, The First Berserker is often let down by quite a few significant ones, from its limited exploration and overly linear level design to its bland protagonist, uninteresting storytelling, and more.\n\nLuckily, however, in a lot of areas that many might argue are of chief importance to a Soulslike, The First Berserker impresses. With stunning combat, unforgettable boss fights, grueling difficulty, and engaging progression, there’s a lot to like here for fans of Soulslike action games.",
        "id": 2447300,
        "language": null,
        "link": "https://www.youtube.com/watch?v=vPE0hETcYIg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vPE0hETcYIg/hqdefault.jpg",
        "title": "Despite Its Flaws, The First Berserker: Khazan Is A CRACKING Soulslike",
        "vote": 0
    }
]