[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T23:37:47.611825+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T22:40:00+00:00",
        "description": "Regardless of who ends up owning Warners Bros., \"the outlook for theatrical movies is dimming,\" writes a Wall Street Journal tech columnist, noting that this year's U.S. box office of $8.3 billion (as of December 25) \"is a bit below last year's and well below prepandemic levels of around $11 billion.\"\n\n\n\nWarner has historically been one of Hollywood's largest producers of theatrical films, averaging about 22 releases annually in the pre-Covid years of 2015 to 2019, according to data from Comscore. Its franchises include \"Harry Potter,\" the DC Comics characters and \"Lord of the Rings.\" But the current bidding war between Netflix and Paramount Skydance means Warner's future will ultimately be in the hands of either a streaming giant with a longstanding distaste for movie theaters, or a rival studio that will carry a sky-high debt load and therefore a need to sharply cut costs... [Though later the article cites a Wedbush analyst's observation that the current theatrical slate has already",
        "id": 4424241,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/28/2238219/no-happy-ending-for-movie-theatres-argues-wsj---no-matter-who-wins-warner-bros",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'No Happy Ending for Movie Theatres', Argues WSJ - No Matter Who Wins Warner Bros.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T21:33:49.412902+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T21:00:00+00:00",
        "description": "Artist Keith Thomson is a modern (and whimsical) Edward Hopper. And Apple TV says he created the \"festive artwork\" shared on X by Apple CEO Tim Cook on Christmas Eve, \"made on MacBook Pro.\" \n\nIts intentionally-off picture of milk and cookies was meant to tease the season finale of Pluribus. (\"Merry Christmas Eve, Carol...\" Cook had posted.) \n\nBut others were convinced that the weird image was AI-generated. \n\nTech blogger John Gruber was blunt. \"Tim Cook posts AI Slop in Christmas message on Twitter/X, ostensibly to promote 'Pluribus'.\"\n\nAs for sloppy details, the carton is labeled both \"Whole Milk\" and \"Lowfat Milk\", and the \"Cow Fun Puzzle\" maze is just goofily wrong. (I can't recall ever seeing a puzzle of any kind on a milk carton, because they're waxy and hard to write on. It's like a conflation of milk cartons and cereal boxes.) \n\nTech author Ben Kamens &mdash; who just days earlier had blogged about generating mazes with AI &mdash; said the image showed the \"specific quirks\" of ",
        "id": 4423712,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/28/2048225/did-tim-cook-post-ai-slop-in-his-christmas-message-promoting-pluribus",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Did Tim Cook Post AI Slop in His Christmas Message Promoting 'Pluribus'?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T20:25:19.409077+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T20:00:00+00:00",
        "description": "An anonymous reader shared this report from The Guardian:\n\nA Texas father used the parental controls on his teenage daughter's cell phone to find and help rescue her after she was kidnapped at knifepoint while walking her dog on Christmas, authorities allege... Her father subsequently located her phone through the device's parental controls, the agency's statement said. The phone was about 2 miles (3.2km) away from him in a secluded, partly wooded area in neighboring Harris county... She then managed to escape with a hand from her father, who called law enforcement officials, said the statement from the Montgomery sheriff's office.\n\n \n\nThe suspect has since been \narrested and charged.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Texas+Father+Rescues+Kidnapped+15-Year-Old+Daughter+After+Tracking+Her+Phone's+Location+%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F25%2F12%2F28%2F197250%2F%3Futm_source%3Dtwitter%26ut",
        "id": 4423432,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/12/28/197250/texas-father-rescues-kidnapped-15-year-old-daughter-after-tracking-her-phones-location",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Texas Father Rescues Kidnapped 15-Year-Old Daughter After Tracking Her Phone's Location",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T19:16:26.196408+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T18:58:00+00:00",
        "description": "Even after its acquisition by Qualcomm, the EFF believes Arduino \"isn't imposing any new bans on tinkering with or reverse engineering Arduino boards,\" (according to Mitch Stoltz, EFF director for competition and IP litigation). While Adafruit's managing editor Phillip Torrone had claimed to 36,000+ followers on LinkedIn that Arduino users were now \"explicitly forbidden from reverse engineering,\" Arduino corrected him in a blog post, noting that clause in their Terms &amp; Conditions was only for Arduino's Software-as-a-Service cloud applications. \"Anything that was open, stays open.\" \n\nAnd this week EE Times spoke to Guneet Bedi, SVP of Arduino, \"who was unequivocal in saying that Arduino's governance structure had remained intact even after the acquisition.\"\n\"As a business unit within Qualcomm, Arduino continues to make independent decisions on its product portfolio, with no direction imposed on where it should or should not go,\" Bedi said. \"Everything that Arduino builds will remai",
        "id": 4423153,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/28/1855208/up-next-for-arduino-after-qualcomm-acquisition-high-performance-computing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Up Next for Arduino After Qualcomm Acquisition: High-Performance Computing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T18:15:35.220794+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T17:34:00+00:00",
        "description": "An anonymous reader shared this report from the CBC:\n\n\nCape Breton fiddler Ashley MacIsaac says he may have been defamed by Google after it recently produced an AI-generated summary falsely identifying him as a sex offender. The Juno Award-winning musician said he learned of the online misinformation last week after a First Nation north of Halifax confronted him with the summary and cancelled a concert planned for Dec. 19. \"You are being put into a less secure situation because of a media company &mdash; that's what defamation is,\" MacIsaac said in a telephone interview with The Canadian Press, adding he was worried about what might have happened had the erroneous content surfaced while he was trying to cross an international border... \n\nThe 50-year-old virtuoso fiddler said he later learned the inaccurate claims were taken from online articles regarding a man in Atlantic Canada with the same last name... [W]hen CBC News reached him by phone on Christmas Eve, he said he'd already rece",
        "id": 4422837,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/28/035234/googles-ai-overview-wrongly-accused-a-musician-of-being-a-sex-offender",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's 'AI Overview' Wrongly Accused a Musician of Being a Sex Offender",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T17:07:38.042919+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T16:34:00+00:00",
        "description": "Laptop makers are facing record-setting memory prices next year. The site Notebookcheck catalogs how different companies are responding:\n\n\n Sources told [Korean business newspaper] Chosun Biz that some manufacturers have signed preliminary contracts with Samsung, Micron, and SK Hynix. Even so, it won't prevent DDR5 RAM prices from soaring 45% higher by the end of 2026.... Before the memory shortage, PC sales had been on the upswing in part because of forced Windows 11 upgrades. That trend will likely reverse in 2026, as buyers avoid Lenovo laptops and alternatives from its rivals. \n\nRealizing a slowdown in purchases is inevitable, postponed launches are one potential outcome. Other manufacturers, including Dell and Framework have already announced impending price hikes... [The article also cites reports that one laptop manufacturer \"plans to raise the prices of high-end models by as much as 30%.\"] U.S.-based Maingear now encourages customers to mail in their own modules to complete cu",
        "id": 4422456,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/28/0524219/how-will-rising-ram-prices-affect-laptop-companies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Will Rising RAM Prices Affect Laptop Companies?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T15:59:26.846075+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T15:34:00+00:00",
        "description": "The Register reports on challenges facing Europe's pursuit of \"digital sovereignty\":\n\n\n\nThe US CLOUD Act of 2018 allows American authorities to compel US-based technology companies to provide requested data, regardless of where that data is stored globally. This places European organizations in a precarious position, as it directly clashes with Europe's own stringent privacy regulation, the General Data Protection Regulation (GDPR)... Furthermore, these warrants often come with a gag order, legally prohibiting the provider from informing their customer that their data has been accessed. This renders any contractual clauses requiring transparency or notification effectively meaningless. While technical measures like encryption are often proposed as a solution, their effectiveness depends entirely on who controls the encryption keys. If the US provider manages the keys, as is common in many standard cloud services, they can be forced to decrypt the data for authorities, making such safe",
        "id": 4422062,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/28/0642206/challenges-face-european-governments-pursuing-digital-sovereignty",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Challenges Face European Governments Pursuing 'Digital Sovereignty'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T12:39:49.289594+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T12:34:00+00:00",
        "description": "An anonymous reader shared this report from the BBC:\n\nThere is growing controversy over recent evidence suggesting that a mysterious force known as dark energy might be changing in a way that challenges our current understanding of time and space. An analysis by a South Korean team has hinted that, rather than the Universe continuing to expand, galaxies could be pulled back together by gravity, ending in what astronomers call a \"Big Crunch\". \n\nThe scientists involved believe that they may be on the verge of one of the biggest discoveries in astronomy for a generation. Other astronomers have questioned these findings, but these critics have not been able to completely dismiss the South Korean team's assertions... \n\nThe controversy began in March with unexpected results from an instrument on a telescope in the Arizona desert called the Dark Energy Spectroscopic Instrument (Desi)... The data hinted that acceleration of the galaxies had changed over time, something not in line with the st",
        "id": 4421111,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/28/0234206/is-dark-energy-weakening",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is Dark Energy Weakening?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T09:27:26.088899+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T08:37:00+00:00",
        "description": "\"I believe artificial intelligence will displace workers at a scale many people don't yet realize,\" says Sal Kahn (founder/CEO of the nonprofit Khan Academy). But in an op-ed in the New York Times he also proposes a solution that \"could change the trajectory of the lives of millions who will be displaced...\" \n\n\n\"I believe that every company benefiting from automation &mdash; which is most American companies &mdash; should... dedicate 1 percent of its profits to help retrain the people who are being displaced.\"\n\n\n\nThis isn't charity. It is in the best interest of these companies. If the public sees corporate profits skyrocketing while livelihoods evaporate, backlash will follow &mdash; through regulation, taxes or outright bans on automation. Helping retrain workers is common sense, and such a small ask that these companies would barely feel it, while the public benefits could be enormous... \n\n\nRoughly a dozen of the world's largest corporations now have a combined profit of over a tri",
        "id": 4420357,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/28/023202/sal-khan-companies-should-give-1-of-profits-to-retrain-workers-displaced-by-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sal Khan: Companies Should Give 1% of Profits To Retrain Workers Displaced By AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T05:06:02.033192+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T04:44:00+00:00",
        "description": "An anonymous reader shared this report from the Wall Street Journal:\n\nSending drones and robots into battle, rather than humans, has become a tenet of modern warfare. Nowhere does that make more sense than in the frozen expanses of the Arctic. But the closer you get to the North Pole, the less useful cutting-edge technology becomes. Magnetic storms distort satellite signals; frigid temperatures drain batteries or freeze equipment in minutes; navigation systems lack reference points on snowfields. \nDuring a seven-nation polar exercise in Canada earlier this year to test equipment worth millions of dollars, the U.S. military's all-terrain arctic vehicles broke down after 30 minutes because hydraulic fluids congealed in the cold. Swedish soldiers participating in the exercise were handed $20,000 night-vision optics that broke because the aluminum in the goggles couldn't handle the minus 40 degree Fahrenheit conditions.... \n\n\nAn arctic conflict would force war planners back to basics. Ext",
        "id": 4419637,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/28/0040238/military-planners-dread-the-arctic-where-drones-drop-dead-and-gps-goes-haywire",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Military Planners Dread the Arctic, 'Where Drones Drop Dead and GPS Goes Haywire'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-28T01:48:17.493084+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-28T01:34:00+00:00",
        "description": "An anonymous reader shared this report from Engadget:\n\n\nOpenAI is looking for a new Head of Preparedness who can help it anticipate the potential harms of its models and how they can be abused, in order to guide the company's safety strategy. \n\nIt comes at the end of a year that's seen OpenAI hit with numerous accusations about ChatGPT's impacts on users' mental health, including a few wrongful death lawsuits. In a post on X about the position, OpenAI CEO Sam Altman acknowledgedthat the \"potential impact of models on mental health was something we saw a preview of in 2025,\" along with other \"real challenges\" that have arisen alongside models' capabilities. The Head of Preparedness \"is a critical role at an important time,\" he said. \n\nPer the job listing, the Head of Preparedness (who will make $555K, plus equity), \"will lead the technical strategy and execution of OpenAI's Preparedness framework, our framework explaining OpenAI's approach to tracking and preparing for frontier capabil",
        "id": 4419090,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/27/2347200/openai-is-hiring-a-new-head-of-preparedness-to-predictmitigate-ais-harms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI is Hiring a New 'Head of Preparedness' to Predict/Mitigate AI's Harms",
        "vote": 0
    }
]