[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-18T15:59:25.801662+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-18T15:30:09+00:00",
        "description": "In case you haven't heard, Void Interactive's Ready or Not recently landed on Xbox Series X/S and PS5, and it's pretty good. You're probably thinking, “You would know that if you played the PC release!” and you know what? Fair enough, but better late than never, especially with all the additional content, fixes (fake surrenders are less rare than before) and improvements. \n\nPerhaps the most surprising thing for me, especially after I've heard about the game in passing for so long, is how good playing solo can be.",
        "id": 3198552,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=HRGINt3DpGs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HRGINt3DpGs/hqdefault.jpg",
        "title": "Ready or Not’s SOLO Mode On PS5 And Xbox Is Better Than You’d Expect",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-18T13:49:11.645977+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-18T13:30:01+00:00",
        "description": "Mafia: The Old Country is Hangar 13’s two-decade-plus series’ fourth mainline entry, and it sees the series retreat to early 1900s Sicily to explore the origins of Sicilian crime families and their pre-eminent tussles for power and control. \n\nPromising newfound immersion thanks to painstaking research during development, Mafia: The Old Country is period-correct in every way; weapons, vehicles, costumes, and characters, plus the beautiful landscape in which this story takes place are created with an authenticity-first mantra. \n\nAnd on the subject of story, Mafia: The Old Country is a narrative-led, linear experience, pledging unexpected twists and turns as we follow underling Enzo Favara as he rises through the Torrisi crime family’s ranks. This feature discusses 15 things you need to know - both the good and the concerning - before deciding whether to buy.",
        "id": 3197402,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=aIzsSyhz-Gw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aIzsSyhz-Gw/hqdefault.jpg",
        "title": "Mafia: The Old Country - 15 NEW Things You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-18T10:33:39.142184+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-18T09:30:26+00:00",
        "description": "Shadow Labyrinth is a gritty, sci-fi reimagining of Pac-Man that’s filled to the brim with nostalgic secrets and delightfully challenging bosses. While it’s no Soulslike title, it comes pretty close thanks to intuitive mechanics that bake its challenge into the game’s DNA. It is a rewarding experience that sets a strong pace for its story while allowing its players to enjoy exploring its well-designed world. \n\nWhether you’re out exploring its complex levels or taking on its deadly bosses, there’s always something to keep you entertained around every corner of its visually stunning world. This is a game that can be your next big obsession and is one that can keep you occupied for many hours as you try to tease out all of the secrets that it hides so well.",
        "id": 3195962,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=_2SBuaFo9cU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_2SBuaFo9cU/hqdefault.jpg",
        "title": "Shadow Labyrinth Review - The Final Verdict",
        "vote": 0
    }
]