[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T23:15:06.414680+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T22:26:00+00:00",
        "description": "Cybersecurity researchers have flagged three malicious npm packages that target the macOS version of AI-powered code-editing tool Cursor, reports The Hacker News:\n\n\n\"Disguised as developer tools offering 'the cheapest Cursor API,' these packages steal user credentials, fetch an encrypted payload from threat actor-controlled infrastructure, overwrite Cursor's main.js file, and disable auto-updates to maintain persistence,\" Socket researcher Kirill Boychenko said. All three packages continue to be available for download from the npm registry. \"Aiide-cur\" was first published on February 14, 2025... \n\nIn total, the three packages have been downloaded over 3,200 times to date.... The findings point to an emerging trend where threat actors are using rogue npm packages as a way to introduce malicious modifications to other legitimate libraries or software already installed on developer systems... \"By operating inside a legitimate parent process &mdash; an IDE or shared library &mdash; the ma",
        "id": 2654504,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/11/2222257/over-3200-cursor-users-infected-by-malicious-credential-stealing-npm-packages?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Over 3,200 Cursor Users Infected by Malicious Credential-Stealing npm Packages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T22:09:24.756770+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T21:02:00+00:00",
        "description": "18 years ago Slashdot covered the creation of Spaceport America. \nToday Space.com hails it as \"the first purpose-built commercial spaceport in the world.\" But engineer/executive director Scott McLaughlin has plans to grow even more.\n\n\nAlready home to an array of commercial space industry tenants, such as Virgin Galactic, SpinLaunch, Up Aerospace, and Prismatic, Spaceport America is a \"rocket-friendly environment of 6,000 square miles of restricted airspace, low population density, a 12,000-foot by 200-foot runway, vertical launch complexes, and about 340 days of sunshine and low humidity,\" the organization boasts on its website... \n\nSpace.com: What changes do you see that make Spaceport America even more viable today? \n\nMcLaughlin: I think opening ourselves up to doing different kinds of work. We're more like a civilian test range now. We've got high-altitude UAVs [Unmanned Aerial Vehicles]. We're willing to do engine production. We believe we're about to sign a data center, one that'",
        "id": 2654240,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/11/2040256/how-spaceport-america-will-grow?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Spaceport America Will Grow",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T21:03:36.092955+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T20:02:00+00:00",
        "description": "Whoop fitness trackers had promised free upgrades to anyone who'd been a member for at least six months &mdash; and then reneged. \"After customers began complaining, the company responded with a Reddit post, according to a report from TechCrunch:\n\nNow, anyone with more than 12 months remaining on their subscription is eligible for a free upgrade to Whoop 5.0 (or a refund if they've already paid the fee). And customers with less than 12 months can extend their subscription to get the upgrade at no additional cost. \nWhoop acknowledged that they'd previously said anyone who'd been a member for six months would receive a free upgrade. Friday they described that blog article as \"incorrect\". (\"This was never our policy and should never have been posted... We removed that blog article... We're sorry for any confusion this may have caused.\") \nTechCrunch explains:\n While the company said it's making these changes because it \"heard your feedback,\" it also suggested that its apparent stinginess ",
        "id": 2653982,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/11/1959255/whoop-promises-free-upgrades---but-some-users-will-have-to-pay-to-extend-their-subscriptions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Whoop Promises Free Upgrades - But Some Users Will Have to Pay to Extend Their Subscriptions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T19:58:10.074826+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T19:01:00+00:00",
        "description": "OpenAI is currently in \"a tough negotiation\" with Microsoft, the Financial Times reports, citing \"one person close to OpenAI.\" \n\nOn the road to building artificial general intelligence, OpenAI hopes to unlock new funding (and launch a future IPO), according to the article, which says both sides are at work \"rewriting the terms of their multibillion-dollar partnership in a high-stakes negotiation....\" \n\nMicrosoft, meanwhile, wants to protect its access to OpenAI's cutting-edge AI models...\n\n\n[Microsoft] is a key holdout to the $260bn start-up's plans to undergo a corporate restructuring that moves the group further away from its roots as a non-profit with a mission to develop AI to \"benefit humanity\". A critical issue in the deliberations is how much equity in the restructured group Microsoft will receive in exchange for the more than $13bn it has invested in OpenAI to date. \n\nAccording to multiple people with knowledge of the negotiations, the pair are also revising the terms of a wid",
        "id": 2653644,
        "language": null,
        "link": "https://slashdot.org/story/25/05/11/1854234/openai-enters-tough-negotiation-with-microsoft-hopes-to-raise-money-with-ipo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Enters 'Tough Negotiation' With Microsoft, Hopes to Raise Money With IPO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T18:33:41.538418+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T18:01:00+00:00",
        "description": "\"When Rust developers think of us C++ folks, they picture a cursed bloodline,\" writes professional game developer Mamadou Babaei (also a *nix enthusiast who contributes to the FreeBSD Ports collection). \"To them, every line of C++ we write is like playing Russian Roulette &mdash; except all six chambers are loaded with undefined behavior.\"\nBut you know what? We don't need a compiler nanny. No borrow checker. No lifetimes. No ownership models. No black magic. Not even Valgrind is required. Just raw pointers, raw determination, and a bit of questionable sanity.\n \nHe's created a video on \"how to hunt down memory leaks like you were born with a pointer in one hand and a debugger in the other.\" (It involves using a memory leak tracker &mdash; specifically, Visual Studio's _CrtDumpMemoryLeaks, which according to its documentation \"dumps all the memory blocks in the debug heap when a memory leak has occurred,\" identifying the offending lines and pointers.) \n\n\"If that sounds unreasonably dang",
        "id": 2653289,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/11/1759213/who-needs-rusts-borrow-checking-compiler-nanny-c-devs-arent-helpless?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Who Needs Rust's Borrow-Checking Compiler Nanny?  C++ Devs Aren't Helpless'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T17:27:28.831042+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T16:34:00+00:00",
        "description": "\"A China-linked unnamed threat actor dubbed Chaya_004 has been observed exploiting a recently disclosed security flaw in SAP NetWeaver,\" reports The Hacker News:\n\nForescout Vedere Labs, in a report published Thursday, said it uncovered a malicious infrastructure likely associated with the hacking group weaponizing CVE-2025-31324 (CVSS score: 10.0) since April 29, 2025. CVE-2025-31324 refers to a critical SAP NetWeaver flaw that allows attackers to achieve remote code execution (RCE) by uploading web shells through a susceptible \"/developmentserver/metadatauploader\" endpoint. \n\nThe vulnerability was first flagged by ReliaQuest late last month when it found the shortcoming being abused in real-world attacks by unknown threat actors to drop web shells and the Brute Ratel C4 post-exploitation framework. According to [SAP cybersecurity firm] Onapsis, hundreds of SAP systems globally have fallen victim to attacks spanning industries and geographies, including energy and utilities, manufactu",
        "id": 2652913,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/11/0544252/chinese-hackers-exploit-sap-netweaver-rce-flaw?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chinese Hackers Exploit SAP NetWeaver RCE Flaw",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T16:22:13.605747+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T15:34:00+00:00",
        "description": "Fast Company's \"AI Decoded\" newsletter makes the case that the first \"killer app\" for generative AI... is coding.\n\n\nTools like Cursor and Windsurf can now complete software projects with minimal input or oversight from human engineers... Naveen Rao, chief AI officer at Databricks, estimates that coding accounts for half of all large language model usage today. A 2024 GitHub survey found that over 97% of developers have used AI coding tools at work, with 30% to 40% of organizations actively encouraging their adoption.... Microsoft CEO Satya Nadella recently said AI now writes up to 30% of the company's code. Google CEO Sundar Pichai echoed that sentiment, noting more than 30% of new code at Google is AI-generated. \n\nThe soaring valuations of AI coding startups underscore the momentum. Anysphere's Cursor just raised $900 million at a $9 billion valuation &mdash; up from $2.5 billion earlier this year. Meanwhile, OpenAI acquired Windsurf (formerly Codeium) for $3 billion. And the tools a",
        "id": 2652574,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/11/0623242/what-happens-if-ai-coding-keeps-improving?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What Happens If AI Coding Keeps Improving?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T15:17:27.381964+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T14:34:00+00:00",
        "description": "Exposure-management company Tenable recently discussed how the MCP tool-interfacing framework for AI can be \"manipulated for good, such as logging tool usage and filtering unauthorized commands.\" (Although \"Some of these techniques could be used to advance both positive and negative goals.\") \n\nNow an anonymous Slashdot reader writes: In a demonstration video put together by security researcher Seth Fogie, an AI client given a simple prompt to 'Scan and exploit' a web server leverages various connected tools via MCP (nmap, ffuf, nuclei, waybackurls, sqlmap, burp) to find and exploit discovered vulnerabilities without any additional user interaction \n\n\nAs Tenable illustrates in their MCP FAQ, \"The emergence of Model Context Protocol for AI is gaining significant interest due to its standardization of connecting external data sources to large language models (LLMs). While these updates are good news for AI developers, they raise some security concerns.\" With over 12,000 MCP servers and c",
        "id": 2652200,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/11/0027236/can-an-mcp-powered-ai-client-automatically-hack-a-web-server?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Can an MCP-Powered AI Client Automatically Hack a Web Server?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T12:01:30.740839+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T11:34:00+00:00",
        "description": "Slashdot reader BrianFagioli writes:\n\nThe new Nintendo Switch 2 is almost here. Next month, eager fans will finally be able to get their hands on the highly anticipated follow-up to the wildly popular hybrid console. But before you line up (or frantically refresh your browser for a preorder), you might want to read the fine print, because Nintendo might be able to kill your console. \n\n\nYes, really. That's not just speculation, folks. According to its newly updated user agreement, Nintendo has granted itself the right to make your Switch 2 \"permanently unusable\" if you break certain rules. Yes, the company might literally brick your device. Buried in the legalese is a clause that says if you try to bypass system protections, modify software, or mess with the console in a way that's not approved, Nintendo can take action. And that action could include completely disabling your system. \n\n\nThe exact wording makes it crystal clear: Nintendo may \"render the Nintendo Account Services and/or ",
        "id": 2651156,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/11/0351246/nintendo-can-render-your-switch-2-permanently-unusable-if-you-break-their-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nintendo Can Render Your Switch 2 'Permanently Unusable' If You Break Their Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T08:45:34.738574+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T07:35:00+00:00",
        "description": "\"Login credentials belonging to an employee at both the Cybersecurity and Infrastructure Security Agency and the Department of Government Efficiency have appeared in multiple public leaks from info-stealer malware,\" reports Ars Technica, \"a strong indication that devices belonging to him have been hacked in recent years.\"\n\n\nAs an employee of DOGE, [30-something Kyle] Schutt accessed FEMA's proprietary software for managing both disaster and non-disaster funding grants [to Dropsite News]. Under his role at CISA, he likely is privy to sensitive information regarding the security of civilian federal government networks and critical infrastructure throughout the U.S. According to journalist Micah Lee, user names and passwords for logging in to various accounts belonging to Schutt have been published at least four times since 2023 in logs from stealer malware... Besides pilfering login credentials, stealers can also log all keystrokes and capture or record screen output. The data is then s",
        "id": 2650411,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/11/0451222/cisadoge-software-engineers-login-credentials-appeared-in-multiple-leaks-from-info-stealing-malware-in-recent-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CISA/DOGE Software Engineer's Login Credentials Appeared in Multiple Leaks From Info-Stealing Malware in Recent Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T04:27:45.826623+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T04:15:00+00:00",
        "description": "\"The Overwatch 2 team at Blizzard has unionized,\" reports Kotaku:\n\nThat includes nearly 200 developers across disciplines ranging from art and testing to engineering and design. Basically anyone who doesn't have someone else reporting to them. It's the second wall-to-wall union at the storied game maker since the World of Warcraft team unionized last July... Like unions at Bethesda Game Studios and Raven Software, the Overwatch Gamemakers Guild now has to bargain for its first contract, a process that Microsoft has been accused of slow-walking as negotiations with other internal game unions drag on for years. \n\"The biggest issue was the layoffs at the beginning of 2024,\" Simon Hedrick, a test analyst at Blizzard, told Kotaku... \"People were gone out of nowhere and there was nothing we could do about it,\" he said. \"What I want to protect most here is the people....\" Organizing Blizzard employees stress that improving their working conditions can also lead to better games, while the opp",
        "id": 2649660,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/11/0328248/blizzards-overwatch-team-just-voted-to-unionize?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Blizzard's 'Overwatch' Team Just Voted to Unionize",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T02:17:40.182472+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T01:49:00+00:00",
        "description": "\"The romantic partner of Theranos fraudster Elizabeth Holmes has launched a start-up that sounds eerily similar to the venture that landed his girlfriend behind bars,\" writes The Daily Beast. \nHe's incorporated \"Haemanthus\" in Delaware a year and a half ago (though the company operates out of his neighborhood in Austin), according to the New York Times. Haemanthus appears to have around 10 employees. \n\nFrom The Daily Beast:\nCalifornia hotel heir Billy Evans' new company is a blood-testing firm that markets itself as \"the future of diagnostics,\" offering \"a radically new approach to health testing,\" according to The New York Times. In other words, exactly what Theranos said it would do. Holmes is even advising the start-up from the Texas prison where she is serving out an 11-year prison sentence for fraud, sources told NPR... Evans has managed to raise nearly $20 million in funds from both friends and established investors in Austin and San Francisco, according to the investor material",
        "id": 2649328,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/11/0147212/theranos-fraudsters-partner-launches-his-own-blood-testing-startup?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Theranos Fraudster's Partner Launches His Own Blood-Testing Startup",
        "vote": 0
    }
]