[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T15:01:16.818651+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T14:00:30+00:00",
        "description": "DOOM: The Dark Ages is finally upon us, and excitement surrounding the newest entry in id Software’s long running ripping-and-tearing shooter series is understandably high.\n\nGameplay tweaks and new ideas combine to lend a new style and flavor to the moment to moment gameplay, with the core combat experience still retaining the aggression and brutality that you would expect from a DOOM game. \n\nAll of that, of course, means that there’s a lot going on at any given moment in DOOM: The Dark Ages, with players being challenged to juggle a lot at once in the heat of the hottest of firefights. \n\nHere, we’ve put together a few tips and tricks to help you get to grips with the game that much faster.",
        "id": 2652093,
        "language": null,
        "link": "https://www.youtube.com/watch?v=F2fOjGGjX7c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/F2fOjGGjX7c/hqdefault.jpg",
        "title": "15 Things I Wish I Knew Before Starting DOOM: The Dark Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-11T10:40:45.764742+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-11T10:00:54+00:00",
        "description": "Onimusha is an outsider amongst other big names. Still, that hasn’t stopped the series accumulating something of a cult following, with fans of the medieval Japanese adventure praising the series’ marquee hack and slash combat combined with environmental puzzling, exploration, and pacing of survival horror. \n\nOnimusha 2: Samurai’s Destiny follows a remaster of the first game in the series – Onimusha: Warlords – and this sequel arguably betters its predecessor in every way. The time is nigh to step into the horror-tinted historical Japan again, blade in hand and demons to slay. \n\nThis video highlights fifteen things to know before you hit that buy now button.",
        "id": 2650760,
        "language": null,
        "link": "https://www.youtube.com/watch?v=YVN6qrhjpEk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YVN6qrhjpEk/hqdefault.jpg",
        "title": "Onimusha 2: Samurai's Destiny Remaster - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]