[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T14:18:26.398796+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T14:00:02+00:00",
        "description": "Open world games are a dime a dozen, but even given the deluge of options available, few of them deliver the sort of emergent sandbox large-scale experience that Elder Scrolls games do. \n\nThat is exactly why the prospect of experiencing the open world of a masterpiece like The Elder Scrolls 4: Oblivion, which is allegedly getting a remake in the imminent future, is such an exciting one. \n\nTouting a bevy of content, well-written guild questlines, excellently implemented systems, and a stupid amount of real estate to explore, the RPG’s open world still shines today, even with a few issues. \n\nDepending on how significantly the rumored remake/remaster enhances the original, Oblivion’s open world could blow everyone out of the water, but even delivered in its original form, it would be hard to say no to.",
        "id": 2579658,
        "language": null,
        "link": "https://www.youtube.com/watch?v=0GnPVNU3kzI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0GnPVNU3kzI/hqdefault.jpg",
        "title": "This Is The ONE THING I Can't Wait To See In The Elder Scrolls 4 Oblivion Remastered/Remake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T10:41:34.127452+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T10:01:30+00:00",
        "description": "Coming from Edinburgh-headquartered Build a Rocket Boy, a studio comprising former Rockstar talent under the leadership of Leslie Benzies, the visionary video game producer and overseer of Grand Theft Auto V and Red Dead Redemption, is MindsEye. \n\nThis is a thrilling, third-person action-adventure taking place in the desert metropolis of Redrock, a city where power, corruption, and greed together with the promises and perils of fully automated tech shape the everyday lives of its citizens. \n\nIn command of amnesiac soldier Jacob Diaz, players will attempt to unravel the secrets behind his memory loss and the origin of his mysterious neural implant. Grand Theft Auto V comparisons are easy to make given the studio’s prior experience, but there’re defining elements to MindsEye which elevates it beyond a GTA copycat into its own thing entirely.",
        "id": 2578019,
        "language": null,
        "link": "https://www.youtube.com/watch?v=zknz88xFjfk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zknz88xFjfk/hqdefault.jpg",
        "title": "This Is THE Game That Will Hold Us Until GTA 6 RELEASES",
        "vote": 0
    }
]