[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T20:38:16.232743+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T20:38:15+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: There's a somewhat concerning new trend going viral: People are using ChatGPT to figure out the location shown in pictures. This week, OpenAI released its newest AI models, o3 and o4-mini, both of which can uniquely \"reason\" through uploaded images. In practice, the models can crop, rotate, and zoom in on photos -- even blurry and distorted ones -- to thoroughly analyze them. These image-analyzing capabilities, paired with the models' ability to search the web, make for a potent location-finding tool. Users on X quickly discovered that o3, in particular, is quite good at deducing cities, landmarks, and even restaurants and bars from subtle visual clues.\n \nIn many cases, the models don't appear to be drawing on \"memories\" of past ChatGPT conversations, or EXIF data, which is the metadata attached to photos that reveal details such as where the photo was taken. X is filled with examples of users giving ChatGPT restaurant menus, neighb",
        "id": 2582898,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/17/1941258/chatgpt-models-are-surprisingly-good-at-geoguessing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "ChatGPT Models Are Surprisingly Good At Geoguessing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T19:31:08.417358+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T19:31:08+00:00",
        "description": "During Meta's antitrust trial this week, lawyers representing Apple, Google, and Snap each expressed irritation with Meta over the slides it presented on Monday that The Verge found to contain easy-to-remove redactions. From a report: Attorneys for both Apple and Snap called the errors \"egregious,\" with Apple's representative indicating that it may not be able to trust Meta with its internal information in the future. Google's attorney also blamed Meta for jeopardizing the search giant's data with the mistake. \n\nDetails about the attorneys' comments come from The Verge's Lauren Feiner, who is currently in the courtroom where proceedings are taking place today. Apple, Google, and Meta did not immediately respond to The Verge's request for comment. Snap declined to comment. Snap's attorney maligned Meta's \"cavalier approach and casual disregard\" of other companies swept into the case, and wondered if \"Meta would have applied meaningful redactions if it were its own information that was ",
        "id": 2582384,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/17/1839249/google-apple-and-snap-arent-happy-about-metas-poorly-redacted-slides?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google, Apple, and Snap Aren't Happy About Meta's Poorly-redacted Slides",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T19:31:08.204269+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T19:31:08+00:00",
        "description": "Synology's upcoming Plus Series NAS systems will restrict full functionality to users who install the company's self-branded hard drives, Tom's Hardware is reporting, marking a significant shift in the consumer NAS market. While third-party drives will still work for basic storage, critical features including drive health monitoring, volume-wide deduplication, lifespan analysis, and automatic firmware updates will be disabled, the publication said. \n\nThe restriction doesn't apply to Synology's 2024 and older models, only affecting new Plus Series devices targeted at SMBs and advanced home users. Synology itself doesn't manufacture drives but rebrands HDDs from major manufacturers like Seagate, Western Digital, and Toshiba, often with custom firmware that functions as DRM. According to Synology, the change follows successful implementation in their enterprise solutions and will deliver \"higher performance, increased reliability, and more efficient support.\" A workaround exists: users c",
        "id": 2582383,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/17/197239/synology-locks-key-nas-features-behind-proprietary-drive-requirement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Synology Locks Key NAS Features Behind Proprietary Drive Requirement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T18:25:50.299780+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T18:25:50+00:00",
        "description": "Canonical today released Ubuntu 25.04 \"Plucky Puffin,\" bringing significant upgrades to the non-LTS distribution including Linux kernel 6.14, GNOME 48 with triple buffering, and expanded hardware support. \n\nFor the first time, Ubuntu ships an official generic ARM64 desktop ISO targeting virtual machines and Snapdragon-based devices, with initial enablement for the Snapdragon X Elite platform. The release also adds full support for Intel Core Ultra Xe2 integrated graphics and \"Battlemage\" discrete GPUs, delivering improved ray tracing performance and hardware-accelerated video encoding. \n\nNetworking improvements include wpa-psk-sha256 Wi-Fi support and enhanced DNS resolution detection. The installer now better handles BitLocker-protected Windows partitions for dual-boot scenarios. Other notable changes include JPEG XL support by default, NVIDIA Dynamic Boost enabled on supported laptops, Papers replacing Evince as the default document viewer, and APT 3.0 becoming the standard package ",
        "id": 2581472,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/17/1631222/ubuntu-2504-plucky-puffin-arrives-with-linux-614-gnome-48-and-arm64-desktop-iso?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ubuntu 25.04 'Plucky Puffin' Arrives With Linux 6.14, GNOME 48, and ARM64 Desktop ISO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T16:20:50.827732+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T16:20:50+00:00",
        "description": "Fraud rings using fake \"bot\" students have infiltrated America's community colleges, stealing over $11 million from California's system alone in 2024. The nationwide scheme, which began in 2021, targets open-admission institutions where scammers enroll fictitious students in online courses to collect financial aid disbursements. \n\n\"We didn't used to have to decide if our students were human,\" said Eric Maag, who has taught at Southwestern College for 21 years. Faculty now spend hours vetting suspicious enrollees and analyzing AI-generated assignments. At Southwestern in Chula Vista, professor Elizabeth Smith discovered 89 of her 104 enrolled students were fraudulent. The California Community College system estimates 25% of all applicants statewide are bots. Community college administrators describe fighting an evolving technological battle against increasingly sophisticated fraud tactics. The fraud crisis has particularly impacted asynchronous online courses, crowding real students ou",
        "id": 2580673,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/17/1611216/bot-students-siphon-millions-in-financial-aid-from-us-community-colleges?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bot Students Siphon Millions in Financial Aid from US Community Colleges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T16:20:51.483294+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T16:20:50+00:00",
        "description": "A global gambling syndicate led by secretive Tasmanian gambler Zeljko Ranogajec and London bookmaker Bernard Marantelli successfully executed an unprecedented operation to claim a $57.8 million Texas lottery jackpot in 2023. \n\nThe group, operating through a limited partnership called Rook TX, purchased 99.3% of all possible number combinations, printing over 25 million tickets across four makeshift workshops in Texas. Using dozens of official lottery terminals and working nearly around the clock for three days, the team systematically printed hundreds of tickets per second. \n\nTexas officials have since launched investigations, with Lt. Governor Dan Patrick calling it \"the biggest theft from the people of Texas in the history of Texas.\" The Texas Rangers are now investigating the operation. Through legal representation, the syndicate maintains they \"followed all applicable laws, rules and regulations\" throughout the process.<p><div class=\"share_submission\" style=\"position:relative;\">\n<",
        "id": 2580675,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/17/1440236/how-a-secretive-gambler-called-the-joker-took-down-the-texas-lottery?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How a Secretive Gambler Called 'The Joker' Took Down the Texas Lottery",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T16:20:51.164091+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T16:20:50+00:00",
        "description": "Meta has disabled Apple Intelligence features across its iOS applications, including Facebook, WhatsApp, and Threads, according to Brazilian tech blog Sorcererhat Tech. The block affects Writing Tools, which enable text creation and editing via Apple's AI, as well as Genmoji generation. Users cannot access these features via the standard text field interface in Meta apps. Instagram Stories have also lost previously available keyboard stickers and Memoji functionality. \n\nWhile Meta hasn't explained the decision, it likely aims to drive users toward Meta AI, its own artificial intelligence service that offers similar text and image generation capabilities. The move follows failed negotiations between Apple and Meta regarding Llama integration into Apple Intelligence, which reportedly collapsed over privacy disagreements. The companies also maintain ongoing disputes regarding App Store policies.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://",
        "id": 2580674,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/17/1539231/meta-blocks-apple-intelligence-in-ios-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Blocks Apple Intelligence in iOS Apps",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T14:34:07.618706+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T14:34:07+00:00",
        "description": "India's three largest IT services companies are facing their steepest growth slowdown in years as corporations curtail large technology projects amid global economic uncertainty and geopolitical challenges. From a report: Infosys, the country's second-largest IT services provider, on Thursday forecast revenue growth of just 0-3% for the fiscal year through March 2026, far below analysts' expectations of 6.3%. The guidance follows a quarter where net income fell 12% to $823 million, though this exceeded analyst estimates of $780 million. The disappointing outlook echoes similar concerns from rivals Tata Consultancy Services and Wipro, as US President Donald Trump's tariff policies add fresh headwinds to an industry already struggling with cautious client spending.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=India's+IT+Services+Giants+Hit+With+Steepest+Growth+Slowdown+in+Years%3A+https%3A%2F%2Ftech.slashdot.org%2Fs",
        "id": 2579840,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/17/1339247/indias-it-services-giants-hit-with-steepest-growth-slowdown-in-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "India's IT Services Giants Hit With Steepest Growth Slowdown in Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T13:31:34.035626+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T13:31:33+00:00",
        "description": "China is banning automakers from using the terms \"smart driving\" and \"autonomous driving\" when they advertise driving assistance features, and it will tighten scrutiny of such technology upgrades. From a report: The mandate on vehicle advertising was delivered by the Ministry of Industry and Information Technology in its meeting with nearly 60 representatives from automakers on Wednesday, according to a transcript seen by Reuters and confirmed by one of the attendees. The move follows a fatal accident involving Xiaomi's best-selling SU7 sedan in March that triggered widespread concerns over vehicle safety.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Bans+'Smart'+and+'Autonomous'+Driving+Terms+From+Vehicle+Ads%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F17%2F0813228%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" hr",
        "id": 2579178,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/17/0813228/china-bans-smart-and-autonomous-driving-terms-from-vehicle-ads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Bans 'Smart' and 'Autonomous' Driving Terms From Vehicle Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T10:15:36.668700+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T10:15:34+00:00",
        "description": "Nintendo's lawyers systematically dismantled Atari Games in a landmark 1989 legal battle that reshaped the gaming industry, killing off the Tengen brand until its surprise resurrection recently. \n\nWhen Atari Games (operating as Tengen) attempted to circumvent Nintendo's control by reverse-engineering the NES security system, Nintendo's legal team discovered a fatal flaw in their rival's approach: Atari had fraudulently obtained Nintendo's proprietary code from the Copyright Office by falsely claiming they were defendants in a nonexistent lawsuit. \n\nThough courts ultimately established that reverse engineering was legal under fair use principles, Atari's deception proved catastrophic. The judge invoked the centuries-old \"unclean hands\" doctrine, ruling that Atari could not claim fair use protection after approaching the court in bad faith. \n\n\"As a result of its lawyers' filthy hands, Atari was barred from manufacturing games for the NES. Nintendo, with its stronger legal team, subseque",
        "id": 2577735,
        "language": null,
        "link": "https://games.slashdot.org/story/25/04/17/0715235/how-nintendos-legal-team-destroyed-atari-games-through-courtroom-strategy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Nintendo's Legal Team Destroyed Atari Games Through Courtroom Strategy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T08:05:52.397543+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T08:05:52+00:00",
        "description": "LG is partnering with Zenapse to integrate AI-driven emotional intelligence into its smart TVs, enabling hyper-targeted ads based on viewers' psychological traits, emotions, and behaviors. Ars Technica reports: The upcoming advertising approach comes via a multi-year licensing deal with Zenapse, a company describing itself as a software-as-a-service marketing platform that can drive advertiser sales \"with AI-powered emotional intelligence.\" LG will use Zenapse's technology to divide webOS users into hyper-specific market segments that are supposed to be more informative to advertisers. LG Ad Solutions, LG's advertising business, announced the partnership on Tuesday.\n \nThe technology will be used to inform ads shown on LG smart TVs' homescreens, free ad-supported TV (FAST) channels, and elsewhere throughout webOS, per StreamTV Insider. LG will also use Zenapse's tech to \"expand new software development and go-to-market products,\" it said. LG didn't specify the duration of its licensing",
        "id": 2577121,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/16/2240228/lg-tvs-integrated-ads-get-more-personal-with-tech-that-analyzes-viewer-emotions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "LG TVs' Integrated Ads Get More Personal With Tech That Analyzes Viewer Emotions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T05:56:28.933805+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T05:56:28+00:00",
        "description": "Astronomers have detected what may be the strongest evidence yet of extraterrestrial life on K2-18b, a massive exoplanet orbiting a star 120 light-years from Earth. The research team, led by Cambridge astronomer Nikku Madhusudhan, published their findings today in the Astrophysical Journal Letters. \n\nUsing the James Webb Space Telescope, researchers found significant concentrations of dimethyl sulfide and dimethyl disulfide in K2-18b's atmosphere. On Earth, these sulfur compounds are exclusively produced by living organisms, particularly marine algae. \"It is in no one's interest to claim prematurely that we have detected life,\" said Madhusudhan, though he described the findings as \"a revolutionary moment\" and \"the first time humanity has seen potential biosignatures on a habitable planet.\" \n\nThe team detected the signals during two separate observations, with the second showing an even stronger signature. Their analysis suggests K2-18b may be a \"Hycean\" planet -- covered with warm oce",
        "id": 2576337,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/17/0429213/astronomers-detect-a-possible-signature-of-life-on-a-distant-planet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Astronomers Detect a Possible Signature of Life on a Distant Planet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T05:56:29.031849+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T05:56:28+00:00",
        "description": "In a recent interview with Wired, Nobel laureate Venkatraman Ramakrishnan discusses his book Why We Die, in which he argues that death is not genetically programmed but rather a consequence of evolution favoring reproduction over longevity. Here are some of the most thought-provoking excerpts: \nWIRED: Professor Ramakrishnan, the crucial question in your book is why we die. But exactly what is death?\nVenki Ramakrishnan: By death, we mean the irreversible loss of the ability to function as a coherent individual. It is the result of the failure of a critical system or apparatus, for example, heart, brain, lung, or kidney failure. In this sense there is an apparent paradox: When our organism, as a whole, is alive, millions of cells within us are constantly dying, and we do not even realize it. On the other hand, at the time of death, most of the cells in our bodies are still alive, and entire organs are still functioning and can be donated to people in need of transplantation. But at that",
        "id": 2576338,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/16/2229250/we-are-not-programmed-to-die-says-nobel-laureate-venki-ramakrishnan?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'We Are Not Programmed to Die,' Says Nobel Laureate Venki Ramakrishnan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T02:45:59.735960+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T02:45:58+00:00",
        "description": "After more than a decade of development, Harvard's insect-sized flying robot, RoboBee, has successfully learned to land using dragonfly-inspired legs and improved flight controls. The researchers see RoboBee as a potential substitute for endangered bees, assisting in the pollination of plants. From a report: RoboBee is a micro flying robot that Harvard has been developing since 2013. As the name suggests, it is the size of a bee, capable of flying like a bee and hovering in mid-air. Its wings are 3 cm long and it weighs only 0.08 g. The weight was reduced by using light piezoelectric elements instead of motors. Piezoelectric elements change shape when an electric current flows through them. The researchers were able to make RoboBee flap its wings 120 times per second by turning the current on and off, which is similar to actual insects.\n \nWhile RoboBee exhibited flight capabilities comparable to those of a bee, the real problem was landing. Being too light and having short wings, it c",
        "id": 2575982,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/16/2018225/harvards-robobee-masters-landing-paving-way-for-agricultural-pollination?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Harvard's RoboBee Masters Landing, Paving Way For Agricultural Pollination",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T02:45:59.577766+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T02:45:58+00:00",
        "description": "Microsoft has acknowledged that Classic Outlook can mysteriously transform into a system resource hog, causing CPU usage spikes between 30-50% and significantly increasing power consumption on both Windows 10 and 11 systems. \n\nUsers first reported the issue in November 2024, but Microsoft only confirmed the problem this week, offering little resolution beyond stating that \"the Outlook Team is investigating this issue.\" The company's sole workaround involves forcing a switch to the Semi-Annual Channel update through registry edits -- an approach many enterprise environments will likely avoid. Microsoft hasn't announced a definitive end date for Classic Outlook, but the company continues pushing users toward its New Outlook client despite its incomplete feature set.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Confirms+Classic+Outlook+CPU+Usage+Spikes%2C+Offers+No+Fix%3A+https%3A%2F%2Fit.slashdot.org%2Fsto",
        "id": 2575981,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/16/2021236/microsoft-confirms-classic-outlook-cpu-usage-spikes-offers-no-fix?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Confirms Classic Outlook CPU Usage Spikes, Offers No Fix",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T01:40:33.536750+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T01:40:33+00:00",
        "description": "Researchers at the University of Tokyo have created what they believe is the largest single piece of lab-grown meat to date: a chicken nugget-sized chunk measuring 7 centimeters long, 4 centimeters wide, and 2.25 centimeters thick, weighing 11 grams. The breakthrough, reported today in Trends in Biotechnology, uses an artificial circulatory system to overcome a fundamental limitation in cultured meat production. \n\nThe team, led by biohybrid system engineer Shoji Takeuchi, grew cells around a network of semipermeable hollow fibers -- similar to those used in water filters and dialysis machines -- that deliver nutrients and oxygen throughout the tissue. Unlike most commercial approaches that produce tiny meat fragments later assembled with binders or scaffolds, this method creates a single coherent piece with more natural structure and texture. \n\nThis is the first working model using tubes to grow muscle tissue into a thick slab, according to Mark Post, chief science officer at Mosa Mea",
        "id": 2575782,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/16/2013255/researchers-grow-record-sized-lab-meat?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Grow Record-sized Lab Meat",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T00:35:40.358255+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T00:35:40+00:00",
        "description": "Discord has begun testing age verification via facial scans or ID uploads for users in the UK and Australia seeking access to sensitive content. \"The chat app's new process has been described as an 'experiment,' and comes in response to laws passed in those countries that place guardrails on youth access to online platforms,\" reports Gizmodo. From the report: Users may be asked to verify their age when encountering content that has been flagged by Discord's systems as being sensitive in nature, or when they change their settings to enable access to sensitive content. The app will ask users to scan their face through a computer or smartphone webcam; alternatively, they can scan a driver's license or other form of ID. \"We're currently running tests in select regions to age-gate access to certain spaces or user settings,\" a spokesperson for Discord said in a statement. \"The information shared to power the age verification method is only used for the one-time age verification process and ",
        "id": 2575553,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/16/2010241/discord-begins-testing-facial-recognition-scans-for-age-verification?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Discord Begins Testing Facial Recognition Scans For Age Verification",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-17T00:35:40.458772+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-17T00:35:40+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: As part of the company's months-long obsession with catching employees leaking internal developments to the press, staff at Wordpress parent company Automattic recently noticed individually-unique watermarks on internal sites, according to employees who spoke to 404 Media. Automattic added the watermarks to an internal employee communications platform called P2. P2 is a WordPress product other workplaces can also use. There are hundreds of P2 sites across teams at Automattic alone; many are team-specific, but some are company-wide for announcements. The watermarks in Automattic's P2 instance are nearly invisible, rendered as a pattern overlaid on the site's white page backgrounds. Zooming in or manually changing the background color reveals the pattern. If, for example, a journalist published a screenshot leaked to them that was taken from P2, Automattic could theoretically identify the employee who shared it.\n \nIn October, as part o",
        "id": 2575554,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/16/1959227/following-layoffs-automattic-employees-discover-leak-catching-watermarks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Following Layoffs, Automattic Employees Discover Leak-Catching Watermarks",
        "vote": 0
    }
]