[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T14:00:38+00:00",
        "description": "Xenoblade Chronicles X Definitive releases internationally on March 20th, just 10 years after its original Wii U launch. Xenoblade Chronicles X Definitive is wrapped in a slew of new convenience features and upgraded visuals. But that’s not all, there’s even some additional story tidbits for fans to look forward to.\n\nDespite how vast and intricate this game’s systems and open world are, the numerous quality of life adjustments added to this remaster might make Xenoblade Chronicles X: Definitive Edition one of the more approachable titles in the genre.",
        "id": 2281687,
        "language": null,
        "link": "https://www.youtube.com/watch?v=YtiVebGF_xE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YtiVebGF_xE/hqdefault.jpg",
        "title": "Xenoblade Chronicles X: Definitive Edition - WHAT'S NEW?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T09:30:01+00:00",
        "description": "Exploration is something that every open world game banks on heavily, but nailing that aspect is far easier said than done. As a franchise, Assassin’s Creed has usually prided itself on consistently delivering incredibly crafted and immaculately detailed period settings that are begging to be explored, and the upcoming Assassin’s Creed Shadows is seemingly not going to buck that trend by any means. \n\nIn fact, if anything, it’s promising to be one of the series’ stronger outings in the exploration department. Not only is the upcoming action RPG promising to deliver a gorgeous Sengoku era Japanese setting, it’s also making changes to exploration, traversal, and more that can elevate the experience in several ways- if done right. Thankfully, there’s reason to be optimistic that they will be.",
        "id": 2280165,
        "language": null,
        "link": "https://www.youtube.com/watch?v=1nCDoHXfxdk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1nCDoHXfxdk/hqdefault.jpg",
        "title": "Assassin's Creed Shadows' Open World Is Looking Fantastic, And I Can't Wait To Explore It",
        "vote": 0
    }
]