[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T23:57:00+00:00",
        "description": "NPR reports on \"a monster black hole that's been lurking unseen in the galaxy next door.\"\n\nThis appears to be the closest supermassive black hole outside our Milky Way galaxy, according to a report that's appearing in The Astrophysical Journal... \"Now that there is strong evidence that it should be there, you can rest assured that we are very excitedly following up,\" says Jesse Han of the Center for Astrophysics, Harvard &amp; Smithsonian, who led the study... \n\nHan and his colleagues realized that this black hole must exist when they were studying so-called hypervelocity stars... [T]hey started out as normal stars that were part of a binary system, or two stars orbiting each other. When that kind of pair ventures too close to a supermassive black hole, says Han, \"what can happen is one of the stars can get captured by the black hole. It is basically ripped apart from its companion.\" The bereft companion star, meanwhile, gets flung away, going at ridiculously high speeds. It's as if ",
        "id": 2284089,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/09/2316231/that-galaxy-next-door-its-home-to-a-monster-black-hole?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "That Galaxy Next Door?  It's Home to a Monster Black Hole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T22:52:03+00:00",
        "description": "gdm (Slashdot reader #97,336) writes:\nA study published in Transportation Research Interdisciplinary Perspectives investigates how ants avoid traffic jams.... Quoting the abstract: \"The results show that ants adopt specific traffic strategies (platoon formation, quasi-constant speed and no overtaking maneuvers) that help avoid jam phenomena, even at high density.\"\n\n \"Researchers are now studying these insects' cooperative tactics to learn how to program self-driving cars that don't jam up,\" writes Scientific American:\n\n\n \"We're maximizing the interests of individuals, [which] is why, at a given point, you start to have a traffic jam,\" says study co-author Nicola Pugno, who studies sustainable engineering at the University of Trento in Italy. But self-driving cars, if they one day become ubiquitous, could have more cooperative programming. In one vision of this future, autonomous vehicles would share information with nearby cars to optimize traffic flow &mdash; perhaps, the researcher",
        "id": 2283840,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/09/2144209/can-ants-teach-us-how-to-program-self-driving-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Can Ants Teach Us How to Program Self-Driving Cars?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T20:42:07+00:00",
        "description": "Philosophy/ethics professor Troy Jollimore looks at the implications of a world where many students are submitting AI-generated essays. (\"Sometimes they will provide quotations, giving page numbers that, as often as not, do not seem to correspond to anything in the actual world...\") Ideally if the students write the essays themselves, \"some of them start to feel it. They begin to grasp that thinking well, and in an informed manner, really is different from thinking poorly and from a position of ignorance. That moment, when you start to understand the power of clear thinking, is crucial. \n\n\"The trouble with generative AI is that it short-circuits that process entirely.\"\n\nOne begins to suspect that a great many students wanted this all along: to make it through college unaltered, unscathed. To be precisely the same person at graduation, and after, as they were on the first day they arrived on campus. As if the whole experience had never really happened at all. I once believed my studen",
        "id": 2283075,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/09/1929235/i-used-to-teach-students-now-i-catch-chatgpt-cheats?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'I Used to Teach Students. Now I Catch ChatGPT Cheats'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T20:42:07+00:00",
        "description": "Slashdot covered the Bulwer-Lytton Fiction Contest in 2008 and 2010 &mdash; though it's been running since 1983. Entrants competed to write the worst-possible first sentence for a novel, in a contest started by English professor Scott E. Rice at San Jose State University (which sponsored the contest). In its first year it drew over 10,000 entries! \n\nOver the years the bad first sentences were even collected into actual books (that were edited by Rice). But after 43 years, Rice delivered his own disappointing first sentence. \"It is with deep regrets that I announce the conclusion of the Bulwer-Lytton Fiction Contest.\"\nBeing a year and a half older than Joseph Biden, I find the BLFC becoming increasingly burdensome and would like to put myself out to pasture while I still have some vim and vigor! \n\n\n When I initiated the competition in 1983, inviting entrants to submit bad opening sentences to imaginary novels, I never dreamed that we would receive thousands of entrants from all over t",
        "id": 2283076,
        "language": null,
        "link": "https://idle.slashdot.org/story/25/03/09/1740239/professor-ends-bulwer-lytton-bad-writing-contest-after-43-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Professor Ends Bulwer-Lytton Bad Writing Contest After 43 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T18:35:01+00:00",
        "description": "Damaged corneas were repaired at a Harvard teaching hospital in a unique clinical trial, reports New Atlas:\n\nSince it's on the frontline of potential hazards from the outside world, the cornea features a population of limbal epithelial stem cells, which repair minor damage to keep the surface smooth and functional... The new study, conducted by scientists at Massachusetts Eye and Ear, investigated a new treatment called cultivated autologous limbal epithelial cells (CALEC). This involves removing stem cells from a patient's uninjured eye, growing their population in the lab for a few weeks, then surgically transplanting them into the injured eye. \nThe phase 1/2 trial recruited 14 patients to undergo the procedure, and followed them for 18 months afterwards... By the first checkup at three months, the corneas of seven (50%) of the participants had been completely restored. By the 12-month mark, that number had increased to 11 (79%) patients. Two other participants met the definition f",
        "id": 2282660,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/09/1612213/stem-cell-therapy-trial-reverses-irreversible-damage-to-cornea?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Stem Cell Therapy Trial Reverses 'Irreversible' Damage to Cornea",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T17:30:17+00:00",
        "description": "Slashdot reader databasecowgirl writes: The Times is reporting an interesting study published in Science in which mice demonstrated doing first aid. In the replicated study, an anaesthetised mouse is exposed to another mouse who recognises the distress and clears airway to revive the unconscious mouse.\n \nThe mice had never seen an unconscious animal before, so the behaviour is thought to be instinctive. \n\nFrom the Times:\n\n\nLarge social mammals have previously been documented lending assistance to each other. Chimpanzees have been seen tending to wounded companions, dolphins are known to push distressed pod members to the surface to help them breathe, and elephants have been observed assisting their ailing relatives. Never before, however, has such a meticulous, paws-on approach to first aid been recorded in a creature as small as a mouse.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Mice+Give+First+Aid%3A+https%",
        "id": 2282322,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/08/2133224/mice-give-first-aid?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mice Give First Aid",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T16:24:40+00:00",
        "description": "\"McDonald's is giving its 43,000 restaurants a technology makeover,\" reports the Wall Street Journal, including AI-enabled drive-throughs and AI-powered tools for managers &mdash; as well as internet-connected kitchen equipment. \n\n\"Technology solutions will alleviate the stress....\" says McDonald's CIO Brian Rice.\nMcDonald's tapped Google Cloud in late 2023 to bring more computing power to each of its restaurants &mdash; giving them the ability to process and analyze data on-site... a faster, cheaper option than sending data to the cloud, especially in more far-flung locations with less reliable cloud connections, said Rice... Edge computing will enable applications like predicting when kitchen equipment &mdash; such as fryers and its notorious McFlurry ice cream machines &mdash; is likely to break down, Rice said. The burger chain said its suppliers have begun installing sensors on kitchen equipment that will feed data to the edge computing system and give franchisees a \"real-time\" ",
        "id": 2281984,
        "language": null,
        "link": "https://slashdot.org/story/25/03/09/070211/will-an-ai-makeover-help-mcdonalds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Will an 'AI Makeover' Help McDonald's?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T15:20:36+00:00",
        "description": "A blog post from the Stanford University School of Medicine attempts to answer the question: What's the deal with the gut-brain connection?\n\n\nIt affects your mood, your sleep, even your motivation to exercise. There's convincing evidence that it's the starting point for Parkinson's disease and could be responsible for long COVID's cognitive effects. And it sits about 2 feet below your brain. The gut plays an obvious role in our health by digesting what we eat and extracting nutrients. But there's a growing appreciation among scientists that our digestive systems affect our general well-being in a much broader fashion. \n\n One fascinating aspect of the gut's widespread impact on health is its direct influence on and communication with the brain, a conduit known as the gut-brain axis. Through direct signals from the vagus nerve, [which] connects the brain and the gut, as well as through molecules secreted into the bloodstream from our gut microbes and immune cells that traffic from the ",
        "id": 2281667,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/09/0513235/how-your-gut-influences-your-brain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Your Gut Influences Your Brain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T12:04:32+00:00",
        "description": "Last week Google urged the U.S. government not to break up the company &mdash; but apparently, it didn't work.\nIn a new filing Friday, America's Justice Department \"reiterated its November proposal that Google be forced to sell its Chrome web browser,\" reports the Washington Post, \"to address a federal judge finding the company guilty of being an illegal monopoly in August.\"\n\nThe government also kept a proposal that Google be banned from paying other companies to give its search engine preferential placement on their apps and phones. At the same time, the government dropped its demand that Google sell its stakes in AI start-ups after one of the start-ups, Anthropic AI, argued that it needed Google's money to compete in the fast-growing industry. \n\nThe government's final proposal \"reaffirms that Google must divest the Chrome browser &mdash; an important search access point &mdash; to provide an opportunity for a new rival to operate a significant gateway to search the internet, free o",
        "id": 2280723,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/09/0232250/americas-justice-department-still-wants-google-to-sell-chrome?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's Justice Department Still Wants Google to Sell Chrome",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T08:50:16+00:00",
        "description": "U.S. president Donald Trump called Daylight Saving Time \"very costly to our nation\" and \"inconvenient\" in December. Today the Washington Post remembers he'd vowed his Republican party would use their \"best efforts\" to eliminate it. \n\nBut it's still proving to be politically difficult...\n\nPolls have shown that most Americans oppose the time shifts but disagree on what should replace them... [U.S. political leaders] also say they are grappling with whether the nation should permanently move the clocks forward one hour, an idea championed by lawmakers on the coasts who say it would allow for more sunshine during the winter, or remain on year-round standard time, which is favored by neurologists who say it aligns with our circadian rhythms. That decision would rest with Congress, not the president. The split often reflects regional, not political, differences, based on where time zones fall; a year-round \"spring forward\" would mean winter sunrises that could creep past 9 a.m. in cities s",
        "id": 2279950,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/09/0359219/is-america-closer-to-ending-daylight-saving-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is America Closer to Ending Daylight Saving Time?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T06:32:44+00:00",
        "description": "As Christie's auction house planned the first-ever auction dedicated to AI-generated art works, over 5,600 people signed an online letter urging them to cancel it. \"Many of the artworks you plan to auction were created using AI models that are known to be trained on copyrighted work without a license,\" the letter complained. \n\"These models, and the companies behind them, exploit human artists, using their work without permission or payment to build commercial AI products that compete with them. Your support of these models, and the people who use them, rewards and further incentivizes AI companies' mass theft of human artists' work.\" CNET reports that the signers \"range from illustrators to authors to art therapists to cinematographers, from countries all across the globe.\" \n\nChristie's ignored them all and held the auction anyways. So what happened when it was over on Wednesday morning?\n\nMore than 30 lots attracted hundreds of bids and brought in $728,784, Christie's reports. And th",
        "id": 2279515,
        "language": null,
        "link": "https://slashdot.org/story/25/03/09/0132251/ignoring-protests-christies-holds-ai-art-auction-makes-big-money?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ignoring Protests, Christie's Holds AI Art Auction, Makes Big Money",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T02:12:44+00:00",
        "description": "\"The early web was fun,\" Reddit co-founder Alexis Ohanian posted Wednesday on X.com. \"It was weird. It was community-driven. It's time to rebuild that. \n\n\"Which is why Kevin Rose and I just bought back Digg.\" \n\nThe amount of that purchase is \"undisclosed,\" reports CNBC:\n\nThe deal is backed by venture capital firms True Ventures, where Rose is a partner, and Ohanian's Seven Seven Six.... The company said in a release that it aims to differentiate itself in the social media market by \"focusing on AI innovations designed to enhance the user experience and build a human-centered alternative....\" Rose said in a post on X that he and Ohanian \"dreamed up features that weren't even possible with yesterday's tech.\" \n\n\"We're bringing more transparency and community partnership,\" according to Rose's post, \"unlike anything you've seen, plus AI that unlocks creativity without sanitizing the human element. The timing is finally right to reimagine what's possible.\" \n\n\"I really disliked you for a lo",
        "id": 2278941,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/08/2252242/reddit-and-digg-cofounders-plan-relaunch-of-human-centered-digg-with-ai-innovations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Reddit and Digg Cofounders Plan Relaunch of 'Human-Centered' Digg With AI Innovations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-09T01:07:34+00:00",
        "description": "This week the Free Software Foundation \"backed a lone developer's brave effort to overturn a pivotal court ruling that threatens to undermine the AGPLv3 &mdash; the foundation's GNU Affero General Public License, version 3,\" reports the Register. \n\n\"At stake is the future of not just the AGPLv3, but the FSF's widely used GNU Public License it is largely based on, and the software covered by those agreements.\"\n\n A core tenet of the GPL series is that free software remains free forever, and this is woven into the licenses' fine print. This ongoing legal battle is a matter of whether people can alter those licenses and redistribute code as they see fit in a non-free way, or if they must stick to the terms of an agreement that says the terms cannot be changed...\nIf the Ninth Circuit upholds the [original district court] ruling, it's likely to create a binding precedent that would limit one of the major freedoms that AGPLv3 and other GPL licenses aim to protect &mdash; the ability to remo",
        "id": 2278748,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/08/0613217/free-software-foundation-rides-to-defend-agplv3-against-neo4j-license-add-ons?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Free Software Foundation Rides To Defend AGPLv3 Against Neo4j License Add-ons",
        "vote": 0
    }
]