[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:27.745588+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T18:00:12+00:00",
        "description": "Meet Asia’s Romantic Balladeer: Christian Bautista. He is a well-known OPM artist, as well as an actor, host, and model. He first captured the public’s attention as a finalist in the singing competition Star in a Million, an ABS-CBN TV channel show that aired in 2003. During the competition, he finished 4th. Despite this, after the contest, his career skyrocketed, signing his contract with big music companies such as Warner Music Philippines. Following this, he released his first self-titled album: Christian Bautista. With two decades of experience in the showbiz industry, he is also recognized in other Southeast Asian countries, such as Indonesia, Singapore, Malaysia, and Thailand. \n\nThe artist has left a lasting impression on our childhoods and graced our radios with hit songs like “The Way You Look at Me,” “Hands to Heaven,” and “Please Be Careful With My Heart.” Currently, he works exclusively with GMA Network. Today, he talks about how finishing 4th was the best thing that had ev",
        "id": 4248984,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CDOjYO4m_GQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CDOjYO4m_GQ/hqdefault.jpg",
        "title": "4 things to learn from finishing fourth | Christian Bautista | TEDxYouth@SJCS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:27.930405+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:59:18+00:00",
        "description": "Life is not only the things you experience, but also the way you respond to those things. 28 Aralık 1977, Milas / Muğla doğumlu. Tam adı Keremcem Dürük. Avukat bir babanın çocuğu olan Keremcem’in adı, annesinin verdiği Cem ile babasının verdiği Kerem isminin birleştirilmesiyle oluştu. İlköğrenimini Milas Sakarya İlkokulunda tamamladı. \nMüzikle haşır neşir olması ilkokul yıllarında başladı. Müzik altyapısını, klasik müzikten hoşlanan babasının zengin Türk Sanat Müziği ve Türk Halk Müziği arşiviyle iç içe olması oluşturdu. Çok uzun sürmemesine karşın henüz altı yaşındayken piyano dersleri almaya başladı. Orta öğrenimini İzmir Özel Fatih Kolej’nde tamamladıktan sonra Muğla Turgutreis Lisesi’nden 1995 yılında mezun oldu. Lise yıllarında gitarla tanıştı. Bu yıllarda Bodrum’a yakın olan Güllük’teki barlarda kuzeniyle birlikte çıkmaya başladı. Üniversiteyi kazandığı 1996 yılında sonradan ilk albümüne de alacağı “Elimde Değil” şarkısının söz ve müziğini yaptı. Yüksek öğrenimini Ege Üniversite",
        "id": 4248985,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1rs7-2Yw-d4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1rs7-2Yw-d4/hqdefault.jpg",
        "title": "Hayat, Başınıza Gelenler Değil, Sizin Onlara Verdiğiniz Tepkilerdir. | Kerem Cem Dürük | TEDxAtapark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:28.205722+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:58:36+00:00",
        "description": "Sticks and stones may break my bones, but words will never hurt me\"—one of the most damaging lies we tell children. Words don't just hurt in the moment; neuroscience shows they literally rewire our brains for avoidance, perfectionism, and procrastination. Discover how one discouraging comment can create a behavioral prison—and how the transformative art of encouragement can set us free. Tobi is a cultural architect and talent powerhouse. Trained at Philadelphia’s legendary Freedom Theatre, he has shared the screen with Hollywood heavyweights in Ray, The Dukes of Hazzard, Glory Road, and Just My Luck. A visionary entrepreneur, he co-founded Manifesto Consulting Group to use arts education for community empowerment and later launched GadCity, LLC. He is also the founder of The Actors District, Philadelphia’s premier acting program, where his students dominate major productions for Marvel, Netflix, CBS, ABC, Peacock, and Amazon Prime. With 75–85% of films shot in Philadelphia featuring A",
        "id": 4248986,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=j4JHAzTWYGo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/j4JHAzTWYGo/hqdefault.jpg",
        "title": "One Word Away: The Transformative Art of Encouragement | Tobi Gadison | TEDxBuckheadAve",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:28.371981+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:58:23+00:00",
        "description": "The problems we experience in life begin in the mind, and through transformation methods we can learn to cope with these challenges and renew ourselves. Bilinçaltı dönüşüm ve kişisel gelişim alanında uzman bir regresyon terapisti, konuşmacı ve eğitmendir.\n\nBireylerin bilinçaltındaki kalıpları dönüştürerek öz güçlerini ortaya çıkarmalarına rehberlik eder.\n\nÇocuklukta yaşadığı ifade kısıtlılığını, kendini özgürce ifade edebilen binlerce insana ilham veren bir hikâyeye dönüştürmüştür.\n\nYedi yılı aşkın süredir, insanların içsel potansiyellerini açığa çıkarmalarına, duygusal blokajlarını çözmelerine ve yaşam yönlerini bulmalarına eşlik etmektedir.\n\nKurucusu olduğu Spiritus Akademi aracılığıyla, bireylerin görünmeyen içsel engellerini fark etmelerine ve kaderlerini bilinçle yeniden şekillendirmelerine katkı sağlar. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4248987,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Vp2hQWrYNLs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Vp2hQWrYNLs/hqdefault.jpg",
        "title": "Çocuk Bilincinden Yetişkin Bilincine Geçmek | Nagihan Bayrak | TEDxAtapark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:28.551969+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:58:09+00:00",
        "description": "From past to present, the education systems and the changes brought to education and our lives by emerging artificial intelligence technologies. Öğretmenlik kariyeri uluslararası prestijli ödüllerle dolu olan Dr. Selçuk Yusuf Arslan, 2023 yılında JCI tarafından Çevre Korumacılığı ve Ahlaki Önderlik kategorisinde Dünyanın En Başarılı Genci seçilen ilk Türk öğretmen olmuştur. 2021 yılında eğitim nobeli olarak gösterilen Global Teacher Prize’da dünyanın en iyi 50 öğretmeninden biri gösterilen Arslan, özellikle kız öğrencilerin kodlama becerilerinin geliştirilmesi, iklim değişikliği ve STEM yaklaşımı üzerine çalışmaktadır. Arslan’ın çevre ve kodlama eğitimini bütünleştirği eğitim modeli ETF ve UNESCO tarafından Green Skills Award (Yeşil Beceriler) ile ödüllendirilmiştir. STEM Stands Together projesi ile Cambridge Üniversitesinin de dikkatini çekmiş ve Dedicated Teacher (Mesleğe Adanmışlık) ödüllerinde Avrupa kıtası birincisi olmuştur. Bir bilişim teknolojileri öğretmeni olarak Microsoft, ",
        "id": 4248988,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CatchYMf86I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CatchYMf86I/hqdefault.jpg",
        "title": "Yapay Zekâ Çağında Eğitim | Selçuk Yusuf Arslan | TEDxAtapark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:28.706513+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:57:21+00:00",
        "description": "At 23, Ngugi built and sold his first startup in India. On paper, it was a success. In reality, he lost all his money, his sense of direction, and almost himself. Searching for answers, he did something radical, he gave it all up and spent two years as a monk.\nIn this talk, Ngugi shares the lessons from chasing achievement to finding balance. He reveals the hidden costs behind the way we define success, and how stillness, humility, and balance can become the foundation for sustainable growth.\nHis journey is not just about failure and reinvention, it’s about discovering that success is less about the heights you reach, and more about the peace you carry while climbing.\n\n Ngugi is an entrepreneur by profession and a traveler by natural inclination. After building and selling his first startup in India, and losing everything in the process, he stepped away from business to search for deeper meaning. That journey led him to spend two years as a monk, immersing himself in Eastern philosoph",
        "id": 4248989,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TnspRmqCpC0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TnspRmqCpC0/hqdefault.jpg",
        "title": "Balance: The Quiet Power Behind Lasting Success | Ngugi Garega | TEDxNairobi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:28.842177+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:57:07+00:00",
        "description": "To chase your dreams, you must give up your current comfort and step out of your comfort zone. 1978 Bozcaada doğumlu sanatçı, tüm çocukluğunu bu adada geçirmiş ve Bozcaada'nın doğasından ilhan alan ilk resimlerinden sonra, Uludağ Üniversitesi, Marmara GSF ve Hacettepe GSF fakültelerinde lisans ve yüksek lisans eğitimi almıştır. Ressam bir süre okyanus ötesi Fransa'nın La Reunion adasına yaşamış, yurt içi ve yurt dışında özellikle Fransa ve Almanya'da çeşitli galerilerde ve sanat fuarlarında resimlerini sergilemiştir. Halen çalışmalarını İstanbul'da sürdürmektedir. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4248990,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=J8wR9DsKdis",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/J8wR9DsKdis/hqdefault.jpg",
        "title": "Bozcaada’dan Dünyaya: \"Bir Sanat Yolculuğu” | Pınar Tınç | TEDxAtapark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:28.952797+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:56:47+00:00",
        "description": "What Happens When We Learn the History They Never Taught Us.\nIn this talk, Ciku Kimeria unveils Africa’s hidden histories—challenging colonial narratives, sharing personal stories, and inspiring pride in the continent’s true legacy, showing how reclaiming our past fuels the power of the future, shaping generations unapologetic and confident in their identity.\n Ciku Kimeria is an author, journalist, communications and strategy specialist, and adventurer who has traveled to 60 countries, half in Africa. She writes fiction and non-fiction spotlighting untold African stories and hosts The Griot’s Path, a podcast uncovering the continent’s hidden histories. An Opinion Columnist at Bloomberg and former Quartz Africa editor, she has also written for African Arguments, OkayAfrica, and The Africa Report. She speaks English, Swahili, and French, and holds a B.Sc. in Management from MIT. This talk was given at a TEDx event using the TED conference format but independently organized by a local co",
        "id": 4248991,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Z3dHjejmRsI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z3dHjejmRsI/hqdefault.jpg",
        "title": "Reclaming Identity, One Story at the Time | Ciku Kimeria | TEDxNairobi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:29.090724+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:56:14+00:00",
        "description": "The problems we experience throughout our lives actually help us grow and mature. 1986 yılında İstanbul’da doğdu. Anaokulundan başlayarak üniversiteye kadar FMV Özel Ayazağa Işık Lisesinde okudu. Hayalindeki mesleği yapabilmek için Marmara Üniversitesi İletişim Fakültesi Gazetecilik bölümünde lisans eğitimini tamamladı. Aynı bölümde yüksek lisans yaptı.\nBir yıl Almanya’da Kültürlerarası İletişim eğitimi aldı. Ardından ABD’de San Francisco’da Yeni Medya eğitimi alanında çalışmalar yaptı. Nokta, BirGün, Hürriyet gibi yayınlarda çalıştı.\n2018 yılında kızı Derin’in hayatına girmesiyle dünyaya bakışı değişti. Aynı yıl İstanbul Üniversitesinde Çocuk Gelişimi eğitimi alırken çocukların büyülü dünyasının içine girdi.\nDerin’le birlikte içindeki çocuğu da büyütürken İzmir’in Seferihisar ilçesine taşındı. İlk kitabı “Benim Birçok Evim Var”ı yazdı.\nŞimdi Hürriyet gazetesinde eğitim editörü olarak çalışıyor. Bir yandan da çocuk kitabı serüvenine devam ediyor. This talk was given at a TEDx event us",
        "id": 4248992,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_R0Jwhfz6-s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_R0Jwhfz6-s/hqdefault.jpg",
        "title": "Kırıldığımız Yerden Büyüyoruz | Zülal Atagün | TEDxAtapark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:29.242197+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:55:56+00:00",
        "description": "Whatever job we do, our focus should be on people and the value of their lives. Cem Arslan biyografi25 Mayıs 1970, İstanbul doğumlu olan Cem Arslan ilk, orta ve lise eğitimimi Küçükyalı'da tamamladı. Hayata bakkal çırağı olarak başladı. Müşterileri genelde cemiyet insanlarıydı. Sanat, tıp, medya, spor alanlarında etkinlik gösteren bu insanlardan sosyal medyanın olmadığı yıllarda çok kıymetli deneyimler edindi. Üniversite adına yüksek hedefleri vardı ama şartlar AÖF eğitimini getirdi, sonradan onu da yarım bırakmak zorunda kaldı. Şoförlükten beyaz eşyaya, emlakçılıktan borsaya kadar birçok sektörde çalıştıktan sonra, 90'lı yılların başında yeni kurulan ATV kanalına, 94 yılında Kanal6 kanalına geçti. 1994 yılında TV ile aynı dönemde Radyo Fener'de radyo serüveni başladı. Radyo Klas, Numberone ve ardından Best FM, Süper Fm, Show Radyo’da \"Gazoz Ağacı\" programını yaptı.  Halen Kafa Radyo’da \"Gazoz Ağacı\" 12:00-14:00 arasında program devam ediyor. Uzun yıllar çeşitli üniversitelerde \"Radyo",
        "id": 4248993,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jLATOpj43FI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jLATOpj43FI/hqdefault.jpg",
        "title": "İşimiz Gücümüz İNSAN | Cem Arslan | TEDxAtapark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:29.434431+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:55:24+00:00",
        "description": "Challenges women experience in their lives and the turning points they go through. Hatay İskenderun’da doğan Betül Uslu, lise eğitimini İskenderun Demir Çelik Anadolu Lisesi’nde tamamladıktan sonra üniversite eğitimi için Eskişehir’e taşındı. Anadolu Üniversitesi’nde Kimya Mühendisliği, İnsan Kaynakları ve Sosyoloji bölümlerinde eğitim aldı. Kariyerine bağımsız çalışmalar yaparak başlayan Uslu, dijital pazarlama ve sosyal medya alanlarında uzmanlaştıktan sonra Mux Dijital’i kurarak markalara sosyal medya yönetimi, içerik üretimi, eğitim ve danışmanlık hizmetleri sunmaya başladı. Ajans yöneticiliği ve eğitmenlik yaparak birçok işletmenin dijital dünyada etkili bir şekilde varlık göstermesine katkıda bulundu. Sosyal medya stratejileri geliştirme, metin yazarlığı, dijital reklam yönetimi ve marka iletişimi konularında uzman olan Uslu, şuanda kendi bağımsız işlerinin yanı sıra AcunMedya Akademi’de ve AçıkBeyin Eğitim ve Danışmanlık’ta eğitmenlik yapmaktadır. This talk was given at a TEDx ",
        "id": 4248994,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=i87G_m7ffAE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/i87G_m7ffAE/hqdefault.jpg",
        "title": "Kadınlık Aygıtı, İnşa ve Çöküş | Betül Uslu | TEDxAtapark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:29.610520+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:55:09+00:00",
        "description": "Ibrahim explains how becoming a champion starts with a single choice: to push beyond limits and embrace growth. This talk guides you on taking the first steps, building resilience, and developing the mindset that turns potential into achievement. Ibrahim is an AI engineer at a Silicon Valley unicorn startup with extensive experience as an engineer and a manager in the AI and satellite imaging industries. He has contributed to groundbreaking projects, including developing image processing software for cameras on the International Space Station and building a new machine learning team at a leading satellite imaging company. He is a recipient of the Developer 30 Under 30 award in Canada.\n\nHaving lived in five different countries, he brings a global perspective. Beyond his professional achievements, he is a proud father of two, always seeking to inspire the next generation of innovators. This talk was given at a TEDx event using the TED conference format but independently organized by a l",
        "id": 4248995,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5Mtsy3szUWQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5Mtsy3szUWQ/hqdefault.jpg",
        "title": "Charting your career path in the age of AI | Ibrahim Muhamed | TEDxBISM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:29.759859+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:54:59+00:00",
        "description": "This talk explores why the future is shaped not by those who wait, but by those who dare to speak up today. The speaker highlights the power of youth voices, the importance of expressing ideas early, and how courage in communication can influence change. It’s a call for young people to claim their space, share their thoughts, and take part in shaping the world’s future direction. Giandra is a driven and well-rounded student with a strong passion for personal growth and learning. Specializing in both academics and sports, Giandra has developed discipline and focus through activities such as futsal, basketball, and archery. Known for his curiosity and initiative, he built much of his English proficiency independently through YouTube, reflecting his ability to learn beyond the classroom. As a dedicated learner, Giandra continually seeks opportunities to improve himself and broaden his experiences. With a forward-looking mindset and a commitment to becoming better each day, Giandra carrie",
        "id": 4248996,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iffGhCmGDYM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iffGhCmGDYM/hqdefault.jpg",
        "title": "The Future Belongs To Those Who Speaks Today | Giandra Hanif Nareswara | TEDxCRIBS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:29.890479+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:54:42+00:00",
        "description": "In this talk, it unpacks how creators are building sustainable income through digital storytelling, personal branding, and niche expertise. By weaving in lessons from the speaker's creative and financial journey, practical tips on how students can build purposeful platforms, monetize their skills, and create value with their voice should be offered. Tomide Williams is a product marketing manager, top LinkedIn marketing strategist, and a personal development enthusiast. With over 40,000 engaged followers on LinkedIn, Tomide is widely recognized for his ability to help businesses and individuals build powerful online identities, generate high-quality leads, and position themselves for long-term success. As the founder of CoterieX, a fast-growing personal development community, and LeadBound, a\nmarketing agency focused on LinkedIn lead generation, Tomide specializes in growth strategies that blend digital advertising, audience psychology, and go-to-market execution. His approach helps te",
        "id": 4248997,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SaR0oJY_3qs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SaR0oJY_3qs/hqdefault.jpg",
        "title": "The Rise of the Creator Economy | Tomide Williams | TEDxUniOsun",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T18:40:29.998088+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:54:30+00:00",
        "description": "Nada explores the first bold steps anyone can take to unleash their potential: setting a clear purpose, showing up with discipline, and choosing growth over comfort. It’s a reminder that champions are not born; they are built through small, consistent actions, resilience in the face of setbacks, and the courage to keep going when others would stop.\nA journey of greatness starts with one decision: to believe you can become more than you are today. Nada is a year 9 student who has passion for reading and sports. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4248998,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hEPoNL7gutg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hEPoNL7gutg/hqdefault.jpg",
        "title": "How to start the journey of being a champion | Nada Ashraf | TEDxBISM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.070675+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:32:54+00:00",
        "description": "Camila Ruge Durón utiliza el trauma de la inundación de Villahermosa en 2020 para lanzar una pregunta urgente: ¿Por qué hay gente que lo pierde todo mientras otros logran anticiparse al desastre? A través de su experiencia personal, Camila revela que la respuesta no está en el pronóstico del clima, sino en la memoria de la tierra. Muestra cómo el conocimiento local y las señales de la naturaleza permitieron a algunas familias sobrevivir, mientras que la indiferencia dejó a miles sin hogar. Su plática es un poderoso testimonio sobre la fragilidad del clima y una celebración de la acción comunitaria, demostrando que la única forma de mitigar el desastre es organizarse en conjunto, escuchar las señales de la tierra y prepararse para los cambios abruptos. is a student at Colegio Americano Xalapa whose work centers on environmental advocacy and community resilience. She utilizes her platform to challenge conventional thinking on sustainability and resource management. Her talk focuses on a",
        "id": 4248332,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6akbuNi-OPM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6akbuNi-OPM/hqdefault.jpg",
        "title": "El Agua Tiene Memoria | Camila Ruge Durón | TEDxColegio Americano Xalapa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.150510+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:32:39+00:00",
        "description": "Mariana Duarte Rangel loves fashion, but she refuses to let it destroy the planet. She exposes how the rise of ultra-cheap, low-quality clothing (often made of non-biodegradable polyester) fuels hyper-consumption, creating mountains of textile waste in places like the Atacama Desert and causing massive water pollution (up to 10,000 liters per single pair of jeans). Mariana demonstrates that this chain of pollution ultimately affects our own health through microplastics. Her talk is a practical call to action, providing concrete strategies for how to shop consciously, embrace reuse, and demand quality, proving that style and sustainability are not mutually exclusive. is a student at Colegio Americano Xalapa whose work centers on environmental advocacy and community resilience. She utilizes her platform to challenge conventional thinking on sustainability and resource management. Her talk focuses on actionable strategies necessary for our community to join the global effort against clim",
        "id": 4248333,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EzHzS9HLak4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EzHzS9HLak4/hqdefault.jpg",
        "title": "Smart Not Fast Fashion | Mariana Duarte Rangel | TEDxColegio Americano Xalapa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.228476+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:32:33+00:00",
        "description": "Social networks and digital platforms do more than show content: they shape behaviors, perceptions, and even intimate decisions, from consumer preferences to political positions. Micro-targeting creates personalized versions of reality for each individual, tailored to emotions, vulnerabilities, and navigation patterns, silently reducing our freedom of choice. Doutor em Tecnologias da Inteligência e Design Digital da PUC-SP (TIDD) área de concentração Modelagem de Software. Professor da PUC-SP desde 1995,   Chefe do Depto de Computação da PUC-SP(2016-2018), atual Coordenador do Curso de Ciência da Computação. Sócio fundador da Interelo Sistemas , trabalhando em diversas empresas como consultor de TI dos mais diferentes ramos do mercado tais como Bank of America (financeiro), MultiBanco(financeiro), IGESP(Hospitalar), AACL(Plano de Sáudo), ATIVI(Crédito Digital), NET(TV a cabo), Akzo Nobel (Indústria Química),entre outras. This talk was given at a TEDx event using the TED conference for",
        "id": 4248334,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mFz8SXUsBcw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mFz8SXUsBcw/hqdefault.jpg",
        "title": "Are social networks and digital micro-targeting choosing for us? | Eduardo Savino Gomes | TEDxFECAP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.306804+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:32:24+00:00",
        "description": "In the age of AI, the true human advantage lies not in what we can do, but in what we choose to take responsibility for intention, responsibility, and impact. Everything that can be automated will be. What continues to exist depends on our character, not on the technology. Profissional de marketing e estratégia com mais de 15 anos conduzindo iniciativas de crescimento, reposicionamento de marca e inovação em diferentes setores. Atualmente lidera o marketing da FECAP, direcionando ações institucionais, digitais e de branding para fortalecer a competitividade de uma instituição com mais de um século de história. Publicitário por formação e Diretor de Arte, é Mestrando em Administração e possui MBAs em Gestão, Empreendedorismo e Marketing, e em Business Innovation. Sua trajetória inclui atuação em agências de propaganda, educação, hotelaria e gastronomia, além da experiência como fundador de uma agência própria. Participa continuamente de programas de aperfeiçoamento em estratégia, marca",
        "id": 4248335,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vvcX6E01HlM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vvcX6E01HlM/hqdefault.jpg",
        "title": "Unbreakable Humanity: What remains truly yours in the age of AI? | Rafael Cerqueira Lima | TEDxFECAP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.386226+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:32:12+00:00",
        "description": "Artificial intelligence is not just an automation tool, but a transformative force that can enhance human capabilities, from medical diagnostics to artistic creativity, when used with ethical awareness and critical intention. Mentora e consultora de negócios criativos em tecnologia e desenvolvimento humano. Dirige o Instituto Criativo, ONG de educação disruptiva, maker e experiencial. Doutora em Engenharia Elétrica da USP, mestre em Ciência da Computação na USP, MBA em Educação, Hipnoterapia e Neurociência, graduada em Matemática e técnica em Administração, especializações em IA, comportamento humano, criatividade e soft skills. 33 anos de experiência em empreendedorismo, people analytics e educação e 27 anos em TIC. É palestrante, escritora, empresária, diretora de patrocínios da Maratona SBC de Computação. Atua como docente e coordenadora na PUC-SP, XP Educação, FECAP e OMNI, promovendo workshops, eventos e competições científicas. Defende a liderança disruptiva, o autoconhecimento ",
        "id": 4248336,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=oHzPimgMVaE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oHzPimgMVaE/hqdefault.jpg",
        "title": "Is Artificial Intelligence replacing us or expanding us? | Lucy Mari Tabuti | TEDxFECAP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.491950+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:31:59+00:00",
        "description": "Hanna aborda una pregunta clave: ¿cuál es el verdadero problema que enfrenta el planeta? A través de su investigación, argumenta que la escasez de agua y la contaminación son solo síntomas. La raíz que alimenta la destrucción es el consumismo inconsciente, la tendencia a comprar sin necesidad que obliga a la producción excesiva y a la contaminación. Con ejemplos que van desde la moda rápida hasta la obsolescencia programada de los smartphones, Hanna demuestra que cada compra deja una huella que el planeta no puede absorber. Esta plática es un llamado urgente a dejar de ser víctimas de la tiranía del mercado y a transformar la pregunta: en lugar de \"¿Cuál es el mayor problema?\", debemos preguntarnos: \"¿Cuál es mi mayor acto de consumo inconsciente... y qué voy a parar hoy?\" is a student at Colegio Americano Xalapa whose work centers on environmental advocacy and community resilience. She utilizes her platform to challenge conventional thinking on sustainability and resource management.",
        "id": 4248337,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SaCNMmOXn0c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SaCNMmOXn0c/hqdefault.jpg",
        "title": "El Consumo O La Contaminación | Hanna Saffí Cárdenas Huerta | TEDxColegio Americano Xalapa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.642906+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:29:48+00:00",
        "description": "In the digital age, detail has become strategy. Technological micro-decisions, a click, an algorithmic adjustment, an automation, an AI parameter, have the power to amplify outcomes, alter behaviors, redesign operations, and redefine entire markets. The Butterfly Effect in the Digital Age shows that major transformations begin with small choices, and that leaders who can perceive and act upon these subtle signals are the ones who build the future of organizations. Doutora em Administração (Gestão de Projetos), Mestre em Cidades Inteligentes e Sustentáveis, pós-graduada em Finanças e Banking e graduada em Administração. Atua com foco em inovação, empreendedorismo e transformação digital. É criadora do EITD Diagnóstico Corporativo, tecnologia patenteada que avalia a maturidade organizacional em inovação e transformação digital. Desenvolve soluções educacionais alinhadas ao mercado e lidera disciplinas nas áreas de tecnologia, negócios e comunicação. É avaliadora científica de revistas c",
        "id": 4248338,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_GXevCl1Skg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_GXevCl1Skg/hqdefault.jpg",
        "title": "The Butterfly Effect in the Digital Age | Debora Machado | TEDxFECAP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.785115+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:29:40+00:00",
        "description": "Digital games are now one of the main environments for sociability, informal learning, and cultural expression among young people, but their impact depends on how, why, and in what context they are used. It’s time to stop asking “Is gaming good or bad?” and start asking “For what purpose, and how, are we playing?” Professor da FECAP, USCS, CULT SP PRO e PUC nos curso de Desenvolvimento de Jogos, Ciência da Computação, Inteligência Artificial e Gamification. Foi Vice-Lider de Pesquisa da Marinha do Brasil atuando no Laboratório de Simulação e Cenários da Escola de Guerra Naval, Diretor de Ciência e Tecnologia da Associação dos Diplomados da Escola Superior de Guerra de São Paulo, fundador da LAB VR e atualmente é CEO da MESSIER Data Creative e apresentador do canal Playcast Games. Possui Doutorado em Tecnologias da Inteligência do Design Digital, Mestrado em Desenvolvimento de jogos e em Negócios Internacionais, MBA em Inteligencia Artificial e Machine Learning, MBA em Mercado Financei",
        "id": 4248339,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UB8ixeSP2ZQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UB8ixeSP2ZQ/hqdefault.jpg",
        "title": "are we creating a more creative generation or a more alienated one? | Rafael Rossetti | TEDxFECAP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:19.974659+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:29:25+00:00",
        "description": "A pesar de que el cambio climático se enseña desde hace décadas, ¿por qué seguimos en un ciclo de inacción? La Dra. Pohema de Jesús González Viveros argumenta que la raíz del problema es que lo enseñamos como un concepto y no como una experiencia viva. Basándose en la psicología y el Modelo de Creencias de Salud, explica que la negación climática surge cuando no percibimos el peligro como real e inminente. La Dra. González nos demuestra que la educación debe ir más allá del CO2 y las definiciones: debe mostrar cómo la alteración de una sola esfera (como la pérdida de manglares) desata un efecto dominó global. Esta es una llamada a transformar la enseñanza del clima, haciéndola tangible y cercana, para que la conciencia colectiva se convierta en la chispa que enciende el cambio real. I have dedicated more than ten years to teaching subjects related to the atmosphere and climate change, at both the high school and university levels. Over this time, I’ve realized that while climate chang",
        "id": 4248340,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OSsmXyEz94g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OSsmXyEz94g/hqdefault.jpg",
        "title": "Conciencia para el CambioClimático | Pohema de Jesús González Viveros | TEDxColegio Americano Xalapa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:20.178777+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:29:09+00:00",
        "description": "México tiene suficiente sol para cubrir todas sus necesidades energéticas, entonces, ¿por qué el 70% de nuestra electricidad sigue dependiendo de los combustibles fósiles? Dana Medellín aborda esta pregunta con un argumento claro: el obstáculo no es la falta de recursos, sino la falta de decisión. Su plática revela cómo la dependencia de petróleo y gas encarece la vida de las familias y daña la salud. Usando ejemplos como el inmenso potencial solar de Sonora y la capacidad eólica de Oaxaca is a student at Colegio Americano Xalapa whose work centers on environmental advocacy and community resilience. She utilizes her platform to challenge conventional thinking on sustainability and resource management. Her talk focuses on actionable strategies necessary for our community to join the global effort against climate change. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4248341,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nHNm1UglXXk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nHNm1UglXXk/hqdefault.jpg",
        "title": "Energías Renovables | Dana Victoria Guevara Medellin | TEDxColegio Americano Xalapa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:20.475202+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:29:01+00:00",
        "description": "Bruno Segura nos lleva a una profunda reflexión: ¿puede una ficción ser tan poderosa como para cambiar la naturaleza? El ponente argumenta que la historia que hoy nos tiene entre la espada y la pared es la cosmogonía del capitalismo, una ficción colectiva (como el dinero) que nos hizo creer que los recursos del planeta eran ilimitados y estaban a nuestra exclusiva disposición. Utilizando la figura de Alexander von Humboldt (explorador del siglo XIX) como un crítico visionario, Bruno nos muestra que los peligros del \"progreso\" y el cálculo del valor de la naturaleza por su productividad no son nuevos. Esta plática es un llamado a cuestionar la narrativa dominante y a replantear la pregunta clave: ¿Qué historia queremos contarnos hoy para materializar el mundo del mañana? He is committed to finding scalable solutions for climate resilience. His research and perspective emphasize the critical need for localized environmental action. He aims to equip the audience with the knowledge requir",
        "id": 4248342,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=YrsknS_BqOM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YrsknS_BqOM/hqdefault.jpg",
        "title": "La Historia En La Que Vivimos | Bruno Leonardo Segura Galicia | TEDxColegio Americano Xalapa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:20.861110+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:27:12+00:00",
        "description": "Privacy is not an individual matter of “if you have nothing to hide, you have nothing to fear,” but a collective right that protects freedom, democracy, and personal autonomy in a digitalized world. Bacharel em ciência da computação, estudei diversas áreas como desenvolvimento/programação de software, banco de dados, redes de computadores, servidores, manutenção de computadores e desenvolvimento web. Desde 2010 me dedico ao desenvolvimento de software, jogos e simulação. Tenho MBA em Gestão Empresarial. Sou o primeiro Mestre em Desenvolvimento de Jogos Digitais no Brasil, meus estudos/práticas foram focados em gamificação com inteligência artificial aplicada à educação. Hoje, tenho o título de Doutor em Ciência/Engenharia da Computação com foco em sistemas gamificados. Trabalho como professor de graduação da FECAP nos cursos de Ciência da Computação, Análise e Desenvolvimento de Sistemas, sou coordenador do instituto FECAP Tech. Internacionalmente, também sou professor do mestrado e g",
        "id": 4248344,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=JbpBKSKV2yY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JbpBKSKV2yY/hqdefault.jpg",
        "title": "Digital privacy in times of hyperconnectivity | Victor Rosetti de Quiroz | TEDxFECAP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:21.239027+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:26:58+00:00",
        "description": "This outstanding lecture explores the frontiers of gait analysis, describes its huge impact on orthopedics and emphasizes its essential value in diagnosis and patient management. This topic brilliantly illustrates how the contemporary technologies shape our understanding of pathologies, for building a healthier society. Sevan Yeritsian, M.D. is a pediatric orthopaedic surgeon at Armenia Republican Medical Center in Yerevan, Armenia, specializing in gait analysis and demonstrating a strong enthusiasm for medical technology. Beyond his clinical practice, Dr. Yeritsian co-founded GAIT HUB, a startup focused on innovative solutions in gait analysis, which was recognized at the EPIC Incubation Program's Demo Day in Spring 2023. Currently, Dr. Yeritsian is also a lecturer at the University of Traditional Medicine of Armenia (UTMA) and the Chief Operational Officer of Foldink, a bioengineering company. This talk was given at a TEDx event using the TED conference format but independently orga",
        "id": 4248345,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=isGX8UWq994",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/isGX8UWq994/hqdefault.jpg",
        "title": "Gait analysis and its impact on pediatric orthopedics | Sevan Yeritsian | TEDxUTMA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:21.556765+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:26:27+00:00",
        "description": "Come possiamo educare alla sostenibilità in modo davvero efficace? Franco Pistono ci guida in un viaggio dove scienza, arte e gioco diventano strumenti per comprendere la Terra. Attraverso esperienze sensoriali e percorsi formativi, propone un nuovo modo di imparare la cura ambientale. Autore e divulgatore, unisce ricerca e creatività per costruire comunità più consapevoli e armoniche con la natura. Franco Pistono si occupa di educazione ambientale e alla sostenibilità con un approccio multidisciplinare che mescola scienza, musica e comunicazione. Autore di saggi, progetti e composizioni, porta avanti percorsi educativi e formativi che aiutano a sviluppare competenze personali e collettive dedicate alla cura del pianeta. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4248346,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_QoQiFdhClU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_QoQiFdhClU/hqdefault.jpg",
        "title": "Dove si impara a rispettare il pianeta | Franco Pistono | TEDxNovara",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:34:21.767610+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:26:12+00:00",
        "description": "Cosa c’è di umano in un violino? Adele Sbernini intreccia scienza, arte e poesia nel racconto del suo mestiere. Dopo anni di apprendistato nel laboratorio del padre, oggi costruisce strumenti ad arco riconosciuti a livello internazionale. In questo talk ci accompagna in un viaggio dove ogni legno, forma e suono rivelano il legame profondo tra la vita e la creazione, tra la materia e l’anima. Adele Sbernini, biologa molecolare di formazione, ha scelto la liuteria come luogo di espressione e manualità. Dopo un lungo apprendistato nel laboratorio del padre, maestro liutaio, nel 2012 apre la propria attività in provincia di Verbania. Oggi costruisce strumenti ad arco, portando avanti una tradizione artigianale riconosciuta con premi e menzioni internazionali. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4248347,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PSjpIQgE3Pc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PSjpIQgE3Pc/hqdefault.jpg",
        "title": "Quando un violino racconta la vita | Adele Sbernini | TEDxNovara",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T16:25:05.534138+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T16:00:21+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker’s personal views and understanding of trauma, personal growth, and the brain, which some viewers may find stigmatizing. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nIn Fight to Win the War from Within, mental fitness expert Andy Riise shares the surprisingly simple truth discovered through years of training soldiers, athletes, and high performers:\nwe don’t rise to the level of our goals — we fall to the strength of our inner foundation. Andy Riise is a retired U.S. Army Lieutenant Colonel, keynote speaker, and trusted Mental Performance and Leadership Coach. A West Point graduate and former Army football player, Andy spent over 20 years leading in high-stakes environments, including multiple combat tours and five years with two elite Special Forces units. \n\nToday, Andy serves as the Chi",
        "id": 4247663,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OqfGswgro6E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OqfGswgro6E/hqdefault.jpg",
        "title": "Fight to Win the War from Within  | Andy Riise | TEDxApex",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T16:25:05.649565+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T15:58:09+00:00",
        "description": "NOTE FROM TED: This talk contains a discussion of mass casualties which some viewers may find distressing. This only represents the speaker's personal views and experiences in law enforcement. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nJoin us for an insightful TEDxDSU talk by Dr. Ravikumar Y S, IPS, Inspector General of Police for State Security Intelligence. With a distinguished career across high-responsibility roles, he shares powerful lessons on preparedness, crisis leadership and managing disasters with clarity and courage.\n Hosted at Dayananda Sagar University, celebrated as India’s First AI-First University, this session highlights the intersection of human decision-making and technology-enabled resilience.\nConnect with DSU:\n Linke",
        "id": 4247664,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FmSFBCX8oxE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FmSFBCX8oxE/hqdefault.jpg",
        "title": "Disaster and Mishap Response for a Safer Future | Dr. Ravikumar Y S, IPS | TEDxDSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T16:25:05.776787+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T15:49:04+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker’s personal political views. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nConor Savoy, Non-Resident Fellow at the Center for Global Development, reflects on the evolving role of U.S. foreign aid in advancing American ideals and strategic interests. In his talk, he discusses how foreign aid has increasingly faced challenges from disinformation, political extremism, and the dismantling of USAID. Conor recounts the dramatic defunding and closure of USAID in early 2025, warning of the long-term risks of the U.S. retreating from international engagement. Conor Savoy is a leading expert with nearly 20 years of experience focused on the nexus between global development, international economics, and national security. This talk was given at a TEDx event using the TED conference format but indepe",
        "id": 4247665,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=dJBOIJAdAfY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dJBOIJAdAfY/hqdefault.jpg",
        "title": "Beyond the Border: Why U.S. Foreign Aid Still Matters | Conor Savoy | TEDxBeaverCountryDaySchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T16:25:05.887026+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T15:30:39+00:00",
        "description": "Una serie de eventos desafortunados, transformaron las desgracias en sentir. Y ese sentir, en canciones. Hoy Iván nos relata esta experiencia musical para regalarnos un pedazo de su vida. Iván es Cantautor y estudiante de psicología. \nParticipante de La Voz Argentina 2025 que hace canción cada emoción fuerte que transita. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4247666,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QAXc_Lw3Dpo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QAXc_Lw3Dpo/hqdefault.jpg",
        "title": "La emoción hecha canción | Iván Horrocks | TEDxUTNCórdoba",
        "vote": 0
    }
]