[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T23:15:50.790787+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T22:22:00+00:00",
        "description": "Meta is acquiring AI wearable startup Limitless, maker of a pendant that records conversations and generates summaries. \"We're excited that Limitless will be joining Meta to help accelerate our work to build AI-enabled wearables,\" a Meta spokesperson said in a statement. CNBC reports: Limitless CEO Dan Siroker revealed the deal on Friday via a corporate blog post but did not disclose the financial terms. \"Meta recently announced a new vision to bring personal superintelligence to everyone and a key part of that vision is building incredible AI-enabled wearables,\" Siroker said in the post and an accompanying video. \"We share this vision and we'll be joining Meta to help bring our shared vision to life.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Acquires+AI+Wearable+Company+Limitless%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F12%2F05%2F2114250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img",
        "id": 4251044,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/05/2114250/meta-acquires-ai-wearable-company-limitless",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Acquires AI Wearable Company Limitless",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T22:13:21.023300+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T21:21:00+00:00",
        "description": "India is weighing a proposal to mandate always-on satellite tracking in smartphones for precise government surveillance -- an idea strongly opposed by Apple, Google, Samsung, and industry groups. Reuters reports: For years, the [Prime Minister Narendra Modi's] administration has been concerned its agencies do not get precise locations when legal requests are made to telecom firms during investigations. Under the current system, the firms are limited to using cellular tower data that can only provide an estimated area location, which can be off by several meters.\n \nThe Cellular Operators Association of India (COAI), which represents Reliance's Jio and Bharti Airtel, has proposed that precise user locations should only be provided if the government orders smartphone makers to activate A-GPS technology -- which uses satellite signals and cellular data -- according to a June internal federal IT ministry email. That would require location services to always be activated in smartphones with",
        "id": 4250672,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/05/2110209/india-reviews-telecom-industry-proposal-for-always-on-satellite-location-tracking",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India Reviews Telecom Industry Proposal For Always-On Satellite Location Tracking",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T21:10:01.850308+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T20:20:00+00:00",
        "description": "The New York Times is suing Perplexity for copyright infringement, accusing the AI startup of repackaging its paywalled reporting without permission. TechCrunch reports: The Times joins several media outlets suing Perplexity, including the Chicago Tribune, which also filed suit this week. The Times' suit claims that \"Perplexity provides commercial products to its own users that substitute\" for the outlet, \"without permission or remuneration.\" [...] \"While we believe in the ethical and responsible use and development of AI, we firmly object to Perplexity's unlicensed use of our content to develop and promote their products,\" Graham James, a spokesperson for The Times, said in a statement. \"We will continue to work to hold companies accountable that refuse to recognize the value of our work.\"\n \nSimilar to the Tribune's suit, the Times takes issue with Perplexity's method for answering user queries by gathering information from websites and databases to generate responses via its retriev",
        "id": 4250207,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/05/2021202/the-new-york-times-is-suing-perplexity-for-copyright-infringement",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The New York Times Is Suing Perplexity For Copyright Infringement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T20:07:05.243961+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T19:19:00+00:00",
        "description": "Cloudflare says it blocked 416 billion AI scraping attempts in five months and warns that AI is reshaping the internet's economic model -- with Google's combined crawler creating a monopoly-style dilemma where opting out of AI means disappearing from search altogether. Tom's Hardware reports: \"The business model of the internet has always been to generate content that drive traffic and then sell either things, subscriptions, or ads, [Cloudflare CEO Matthew Prince] told Wired. \"What I think people don't realize, though, is that AI is a platform shift. The business model of the internet is about to change dramatically. I don't know what it's going to change to, but it's what I'm spending almost every waking hour thinking about.\"\n \nWhile Cloudflare blocks almost all AI crawlers, there's one particular bot it cannot block without affecting its customers' online presence -- Google. The search giant combined its search and AI crawler into one, meaning users who opt out of Google's AI crawle",
        "id": 4249719,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/05/1940241/cloudflare-says-it-blocked-416-billion-ai-scraping-requests-in-5-months",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cloudflare Says It Blocked 416 Billion AI Scraping Requests In 5 Months",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T19:04:05.146679+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T18:18:00+00:00",
        "description": "Netflix is buying Warner Bros. Discovery in an $82.7 billion deal that gives it HBO, iconic franchises, and major studio infrastructure. \"Warner Bros. shareholders will receive $27.75 a share in cash and stock in Netflix,\" notes Bloomberg. \"The total equity value of the deal is $72 billion, while the enterprise value of the deal is about $82.7 billion.\" From the report: Prior to the closing of the sale, Warner Bros. will complete the planned spinoff of its networks division, which includes cable channels such as CNN, TBS and TNT. That transaction is now expected to be completed in the third quarter of 2026, Netflix said in a statement. With the purchase, Netflix becomes owner of the HBO network, along with its library of hit shows like The Sopranos and The White Lotus. Warner Bros. assets also include its sprawling studios in Burbank, California, along with a vast film and TV archive that includes Harry Potter and Friends.\n \nNetflix said it expects to maintain Warner Bros.' current op",
        "id": 4249267,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/05/1728256/netflix-to-buy-warner-bros-in-72-billion-cash-stock-deal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Netflix To Buy Warner Bros. In $72 Billion Cash, Stock Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T17:57:35.952566+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T17:17:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: A few years ago, Paul Wieland, a 44-year-old information technology professional living in New York's Adirondack Mountains, was wrapping up a home renovation when he ran into a hiccup. He wanted to be able to control his new garage door with his smartphone. But the options available, including a product called MyQ, required connecting to a company's internet servers. He believed a \"smart\" garage door should operate only over a local Wi-Fi network to protect a home's privacy, so he started building his own system to plug into his garage door. By 2022, he had developed a prototype, which he named RATGDO, for Rage Against the Garage Door Opener. He had hoped to sell 100 of his new gadgets just to recoup expenses, but he ended up selling tens of thousands. That's because MyQ's maker did what a number of other consumer device manufacturers have done over the last few years, much to the frustration of their customers: It changed t",
        "id": 4248642,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/05/0315226/why-one-man-is-fighting-for-our-right-to-control-our-garage-door-openers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why One Man Is Fighting For Our Right To Control Our Garage Door Openers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T16:48:42.431606+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T16:16:00+00:00",
        "description": "On Dec. 2, QuickTime turned 34, and despite its origins in Apple's chaotic 1990s (1991 to be exact), \"it's still the backbone of video on our devices,\" writes Macworld's Jason Snell. That includes MP4 and Apple's immersive video formats for Vision Pro. From the report: By the late '80s and early '90s, digital audio had been thoroughly integrated into Macs. (PCs needed add-on cards to do much more than issue beeps.) The next frontier was video, and even better, synchronized video and audio. There were a whole lot of challenges: the Macs of the day were not really powerful to decode and display more than a few frames per second, which was more of a slideshow than a proper video. Also, the software written to decode and encode such video (called codecs) was complex and expensive, and there were lots of different formats, making file exchange unreliable.\n \nApple's solution wasn't to invent entirely new software to cover every contingency, but to build a framework for multimedia creation a",
        "id": 4248002,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/05/031249/quicktime-turns-34",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "QuickTime Turns 34",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T15:42:32.302452+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T15:15:00+00:00",
        "description": "Two Virginia brothers Muneeb and Sohaib Akhter, previously convicted of hacking the U.S. State Department, were rehired as federal contractors and are now charged with conspiring to steal sensitive data and destroy government databases after being fired. \"Following the termination of their employment, the brothers allegedly sought to harm the company and its U.S. government customers by accessing computers without authorization, issuing commands to prevent others from modifying the databases before deletion, deleting databases, stealing information, and destroying evidence of their unlawful activities,\" the Justice Department said in a Wednesday press release. BleepingComputer reports: According to court documents, Muneeb Akhter deleted roughly 96 databases containing U.S. government information in February 2025, including Freedom of Information Act records and sensitive investigative documents from multiple federal agencies. One minute after deleting a Department of Homeland Security",
        "id": 4247400,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/05/0251201/contractors-with-hacking-records-accused-of-wiping-96-government-databases",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Contractors With Hacking Records Accused of Wiping 96 Government Databases",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T14:30:29.297421+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T14:14:00+00:00",
        "description": "Netflix says its open AV1 video codec now powers about 30% of all streaming on the platform and is rapidly becoming its primary delivery format thanks to major gains in compression, bandwidth efficiency, HDR support, and film-grain rendering. TVTechnology reports: The blog by Liwei Guo, Zhi Li, Sheldon Radford and Jeff Watts comes at a time when AV2 is on the horizon. [...] The blog revisits Netflix's AV1 journey to date, highlights emerging use cases, and shares adoption trends across the device ecosystem. It noted that since entering the streaming business in 2007, Netflix has primarily relied on H.264/AVC as its streaming format. \"Looking ahead, we are excited about the forthcoming release of AV2, announced by the Alliance for Open Media for the end of 2025,\" said the authors. \"AV2 is poised to set a new benchmark for compression efficiency and streaming capabilities, building on the solid foundation laid by AV1. At Netflix, we remain committed to adopting the best open technologie",
        "id": 4246710,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/05/0146253/av1-open-video-codec-now-powers-30-of-netflix-streaming",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AV1 Open Video Codec Now Powers 30% of Netflix Streaming",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T13:19:28.150420+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T13:13:00+00:00",
        "description": "An anonymous reader quotes a report from MIT Technology Review: New research reveals that AI chatbots can shift voters' opinions in a single conversation -- and they're surprisingly good at it. A multi-university team of researchers has found that chatting with a politically biased AI model was more effective than political advertisements at nudging both Democrats and Republicans to support presidential candidates of the opposing party. The chatbots swayed opinions by citing facts and evidence, but they were not always accurate -- in fact, the researchers found, the most persuasive models said the most untrue things. The findings, detailed in a pair of studies published in the journals Nature and Science, are the latest in an emerging body of research demonstrating the persuasive power of LLMs. They raise profound questions about how generative AI could reshape elections.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?stat",
        "id": 4246177,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/12/05/0141235/ai-chatbots-can-sway-voters-better-than-political-ads",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Chatbots Can Sway Voters Better Than Political Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T11:12:48.829160+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T10:10:00+00:00",
        "description": "NASA and CNES's SWOT satellite captured the first high-resolution, wide-swath image of a major tsunami in the open ocean after the July 2025 Kuril-Kamchatka quake. \"Instead of a single neat crest racing across the basin, the image revealed a complicated, braided pattern of energy dispersing and scattering over hundreds of miles,\" reports Earth.com. \"These are details that traditional instruments almost never resolve. They suggest the physics we use to forecast tsunami hazards -- especially the assumption that the largest ocean-crossing waves travel as largely \"non-dispersive\" packets -- need a revision.\" From the report: Three takeaways emerge. First, high-resolution satellite altimetry can see the internal structure of a tsunami in mid-ocean, not just its presence. Second, researchers now argue that dispersion -- often downplayed for great events -- may shape how energy spreads into leading and trailing waves, which could alter run-up timing and the force on harbor structures. Third,",
        "id": 4245238,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/05/0135228/satellite-captures-the-first-detailed-look-at-a-massive-tsunami",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Satellite Captures the First Detailed Look At a Massive Tsunami",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T08:01:41.014243+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T07:07:00+00:00",
        "description": "NASA's OSIRIS-REx samples from asteroid Bennu have revealed bio-essential sugars, a never-before-seen \"space gum\" polymer, and unusually high levels of supernova-origin dust. The findings bolster the RNA-world hypothesis, suggest complex organics formed early on Bennu's parent body, and show preserved presolar grains that escaped alteration for billions of years.\n \n\"All five nucleobases used to construct both DNA and RNA, along with phosphates, have already been found in the Bennu samples brought to Earth by OSIRIS-REx,\" said lead scientist Yoshihiro Furukawa of Tohoku University. \"The new discovery of ribose means that all of the components to form the molecule RNA are present in Bennu.\"\n \nThe findings have been published in three new papers by the journals Nature Geosciences and Nature Astronomy. NASA also published a video on YouTube detailing the discovery.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sugars%2",
        "id": 4244226,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/04/2237242/sugars-gum-stardust-found-in-nasas-asteroid-bennu-samples",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sugars, 'Gum,' Stardust Found In NASA's Asteroid Bennu Samples",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T03:51:32.195013+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T03:33:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: A Donald Trump-backed push has failed to wedge a federal measure that would block states from passing AI laws for a decade into the National Defense Authorization Act (NDAA). House Majority Leader Steve Scalise (R-La.) told reporters Tuesday that a sect of Republicans is now \"looking at other places\" to potentially pass the measure. Other Republicans opposed including the AI preemption in the defense bill, The Hill reported, joining critics who see value in allowing states to quickly regulate AI risks as they arise.\n \nFor months, Trump has pressured the Republican-led Congress to block state AI laws that the president claims could bog down innovation as AI firms waste time and resources complying with a patchwork of state laws. But Republicans have continually failed to unite behind Trump's command, first voting against including a similar measure in the \"Big Beautiful\" budget bill and then this week failing to negotiate a solutio",
        "id": 4243213,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/12/04/2228233/republicans-drop-trump-ordered-block-on-state-ai-laws-from-defense-bill",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Republicans Drop Trump-Ordered Block On State AI Laws From Defense Bill",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T02:44:40.967969+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T02:02:00+00:00",
        "description": "alternative_right quotes a report from the Guardian: The statue looms and glints at more than 11 feet tall and weighing 3,500 pounds, looking out at the city with, how to put it ... a characteristically stern expression? Despite its daunting appearance and history as a crimefighter of last resort, the giant new bronze figure of the movie character RoboCop is being seen as a symbol of hope, drawing fans and eliciting selfie mania since it began standing guard over Detroit on Wednesday afternoon. It has been 15 years in the making. Even in a snowstorm in the dark, people were driving by to see it, said Jim Toscano, co-owner of the Free Age film production company, where the statue now stands firmly bolted down near the sidewalk. RoboCop hit theaters in 1987, portraying a near-future Detroit as crime-ridden and poorly protected by a beleaguered and outgunned police force, until actor Peter Weller appeared as a nearly invincible cyborg, apparently created by a nefarious corporation bent o",
        "id": 4242933,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/04/2211225/robocop-statue-rises-in-detroit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "RoboCop Statue Rises In Detroit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T01:35:47.081007+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T01:01:00+00:00",
        "description": "U.S. regulators are pressing Waymo for answers after Texas officials reported 19 instances of its self-driving cars illegally passing stopped school buses, including cases that occurred after Waymo claimed to have deployed a software fix. Longtime Slashdot reader BrendaEM shares the report from Reuters: In a November 20 letter posted by NHTSA, the Austin Independent School District said five incidents occurred in November after Waymo said it had made software updates to resolve the issue and asked the company to halt operations around schools during pick-up and drop-off times until it could ensure the vehicles would not violate the law. \"We cannot allow Waymo to continue endangering our students while it attempts to implement a fix,\" a lawyer for the school district wrote, citing one incident involving a Waymo that was \"recorded driving past a stopped school bus only moments after a student crossed in front of the vehicle, and while the student was still in the road.\"\n \nThe letter pro",
        "id": 4242581,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/04/2158221/us-probes-reports-waymo-self-driving-cars-illegally-passed-school-buses-19-times",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Probes Reports Waymo Self-Driving Cars Illegally Passed School Buses 19 Times",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-05T00:28:56.250794+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-05T00:00:00+00:00",
        "description": "Ancient Slashdot user Alain Williams shares a report from Al Jazeera: The Irish Council for Civil Liberties (ICCL) has announced it filed a complaint against Microsoft, accusing the global tech giant of unlawfully processing data on behalf of the Israeli military and facilitating the killings of Palestinian civilians in Gaza. In the complaint, the council asked the Data Protection Commission -- the European Union's lead data regulator for the company -- to \"urgently investigate\" Microsoft Ireland's processing.\n \n\"Microsoft's technology has put millions of Palestinians in danger. These are not abstract data-protection failures -- they are violations that have enabled real-world violence,\" Joe O'Brien, ICCL's executive director, said in a statement. \"When EU infrastructure is used to enable surveillance and targeting, the Irish Data Protection Commission must step in -- and it must use its full powers to hold Microsoft to account.\"\n \nAfter months of complaints from rights groups and Mic",
        "id": 4242281,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/04/2153226/microsoft-faces-new-complaint-for-unlawfully-processing-data-on-behalf-of-israeli-military",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Faces New Complaint For Unlawfully Processing Data On Behalf of Israeli Military",
        "vote": 0
    }
]