[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T23:58:00.761267+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T23:20:00+00:00",
        "description": "OpenAI is offering a $555,000 salary (plus equity) to recruit a new \"head of preparedness,\" a high-pressure role tasked with anticipating and mitigating extreme AI risks. \"This will be a stressful job, and you'll jump into the deep end pretty much immediately,\" said Sam Altman as he launched the hunt to fill \"a critical role\" to \"help the world.\" The Guardian reports: In what may be close to the impossible job, the \"head of preparedness\" at OpenAI will be directly responsible for defending against risks from ever more powerful AIs to human mental health, cybersecurity and biological weapons. That is before the successful candidate has to start worrying about the possibility that AIs may soon begin training themselves amid fears from some experts they could \"turn against us.\"\n \nThe successful candidate will be responsible for evaluating and mitigating emerging threats and \"tracking and preparing for frontier capabilities that create new risks of severe harm.\" Some previous executives i",
        "id": 4431830,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/29/2136221/sam-altman-offers-555k-salary-to-fill-most-daunting-role-in-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sam Altman Offers $555K Salary To Fill Most Daunting Role In AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T22:56:03.159071+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T22:40:00+00:00",
        "description": "Nvidia has completed its previously announced $5 billion investment in Intel, buying over 214 million shares at a fixed price after the deal received clearance from Federal Trade Commission. \"The leading AI chip designer said in September it would pay $23.28 per share for Intel common stock, in a deal that is seen as a major financial lifeline for the chipmaker after years of missteps and capital intensive production capacity expansions drained its finances,\" reports Reuters.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nvidia+Takes+%245+Billion+Stake+In+Intel+Under+September+Agreement%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F12%2F29%2F2130223%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F12%2F29%2F2130223%2Fnvidia-takes-5-billion-stake-in-int",
        "id": 4431515,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/29/2130223/nvidia-takes-5-billion-stake-in-intel-under-september-agreement",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Takes $5 Billion Stake In Intel Under September Agreement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T22:56:03.308485+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: China drafted landmark rules to stop AI chatbots from emotionally manipulating users, including what could become the strictest policy worldwide intended to prevent AI-supported suicides, self-harm, and violence. China's Cyberspace Administration proposed the rules on Saturday. If finalized, they would apply to any AI products or services publicly available in China that use text, images, audio, video, or \"other means\" to simulate engaging human conversation. Winston Ma, adjunct professor at NYU School of Law, told CNBC that the \"planned rules would mark the world's first attempt to regulate AI with human or anthropomorphic characteristics\" at a time when companion bot usage is rising globally.\n \n[...] Proposed rules would require, for example, that a human intervene as soon as suicide is mentioned. The rules also dictate that all minor and elderly users must provide the contact information for a guardian when they register -- the",
        "id": 4431516,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/29/2127224/china-drafts-worlds-strictest-rules-to-end-ai-encouraged-suicide-violence",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Drafts World's Strictest Rules To End AI-Encouraged Suicide, Violence",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T21:46:17.351578+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T21:22:00+00:00",
        "description": "Stingless bees from the Amazon have become the first insects to be granted legal rights anywhere in the world, in a breakthrough supporters hope will be a catalyst for similar moves to protect bees elsewhere. From a report: It means that across a broad swathe of the Peruvian Amazon, the rainforest's long-overlooked native bees -- which, unlike their cousins the European honeybees, have no sting -- now have the right to exist and to flourish. Cultivated by Indigenous peoples since pre-Columbian times, stingless bees are thought to be key rainforest pollinators, sustaining biodiversity and ecosystem health. \n\nBut they are faced with a deadly confluence of climate change, deforestation and pesticides, as well as competition from European bees, and scientists and campaigners have been racing against time to get stingless bees on international conservation red lists. Constanza Prieto, Latin American director at the Earth Law Center, who was part of the campaign, said: \"This ordinance marks",
        "id": 4431106,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/29/1956236/stingless-bees-from-the-amazon-granted-legal-rights-in-world-first",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Stingless Bees From the Amazon Granted Legal Rights in World First",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T21:46:17.434155+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T20:40:00+00:00",
        "description": "More than a decade after Malaysia Airlines flight MH370 vanished over the Indian Ocean en route from Kuala Lumpur to Beijing, the marine robotics company that located Sir Ernest Shackleton's Endurance is preparing to resume its hunt for the missing Boeing 777. Ocean Infinity, a UK and US-based seabed survey firm, began searching a 15,000 sq km priority area in the Indian Ocean in February but called off the expedition in April after 22 days due to poor weather conditions. \n\nThe company plans to resume operations on December 30 for 55 days under a $70 million \"no find, no fee\" contract from the Malaysian government. The company has already covered nearly 10,000 sq km and intends to search another 25,000 sq km. Richard Godfrey, an independent aviation investigator, estimates Ocean Infinity has spent \"tens of millions of dollars\" on ships and equipment. \"I don't think they're in this for the monetary reward of $70m, because this search is very, very expensive,\" Godfrey says. \"I think the",
        "id": 4431107,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/29/1952225/after-a-decade-of-dead-ends-70-million-rides-on-locating-flight-mh370",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "After a Decade of Dead Ends, $70 Million Rides on Locating Flight MH370",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T20:38:04.089518+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T20:02:00+00:00",
        "description": "Windows 10's formal end-of-support arrived in October, and while the operating system is generally remembered as one of the \"good\" versions of Windows -- the most widely used since XP -- many of the annoyances people complain about in Windows 11 actually started during the Windows 10 era, ArsTechnica writes. \n\nWindows 10 earned its positive reputation primarily by not being Windows 8. It restored a version of the traditional Start menu, rolled out as a free upgrade to Windows 7 and 8 users, and ran on virtually all the same hardware as those older versions. Microsoft introduced the Windows Subsystem for Linux during this period and eventually rebuilt Edge on Chromium. The company seemed more willing to meet users where they were rather than forcing them to change their behavior. \n\nBut Windows 10 also began collecting more information about how users interacted with the operating system, cluttered the lock screen with advertisements and news articles, and added third-party app icons to",
        "id": 4430746,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/29/1928221/how-windows-10-earned-its-good-reputation-while-planting-the-seeds-of-windows-11s-problems",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Windows 10 Earned Its Good Reputation While Planting the Seeds of Windows 11's Problems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T20:38:04.542100+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T19:26:00+00:00",
        "description": "Americans are settling into streaming habits that should worry Hollywood executives, as new Nielsen data analyzed by Bloomberg reveals that not a single new original series cracked the top 10 most-watched streaming shows in 2025 -- the first time this has happened since Nielsen began publishing streaming data in 2020. \n\nThe shift extends beyond original programming as free, ad-supported streaming services are growing faster than their paid counterparts. YouTube has become the most-watched streaming service on American televisions, now larger than Netflix and Amazon combined. The Roku Channel and Tubi have nearly doubled in size over the past two years, while Peacock and Warner Bros.' streaming services have stagnated at roughly half their free competitors' viewership share. \n\nNetflix still dominates when it comes to hits, accounting for about two-thirds of original programs appearing in Nielsen's weekly top 10 lists. But that dominance is eroding -- the company's share of streaming vi",
        "id": 4430747,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/29/1842200/americans-are-watching-fewer-new-tv-shows-and-more-free-tv",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Americans Are Watching Fewer New TV Shows and More Free TV",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T19:21:30.347636+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T18:45:00+00:00",
        "description": "Michal Kicinski, who co-founded both CD Projekt and the DRM-free digital games store GOG back in 2008, has acquired 100% ownership of GOG from CD Projekt, bringing the platform full circle to one of its original creators. \n\nGOG was already operating as part of CD Projekt through its Sp.z.o.o. subsidiary, but Kicinski now takes complete control of the company. The platform will continue operating independently and maintain its commitment to DRM-free gaming. \"The mission stays the same: Make Games Live Forever,\" GOG said in its announcement. \n\nCD Projekt's joint CEO Michal Nowakowski said the parent company's focus on its development roadmap and franchise expansion made this the right time for the move. GOG has signed a distribution agreement ensuring all upcoming CD Projekt Red titles will release on the platform. Kicinski, describing himself as a \"mature gamer\" who plays classics, said he's personally involved in developing several retro-spirited games slated for GOG in 2026.<p><div c",
        "id": 4430238,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/29/1810221/gog-and-cd-projekt-founder-acquires-100-ownership-of-gog",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GOG and CD Projekt Founder Acquires 100% Ownership of GOG",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T18:11:55.029139+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T18:06:00+00:00",
        "description": "AI-generated video tools like OpenAI's Sora will make individual content creators \"far, far, far less valuable\" as social media platforms shift toward algorithmically generated content tailored to each viewer, according to Michael Mignano, a partner at venture capital firm Lightspeed and who cofounded the podcasting platform Anchor before Spotify acquired it. \n\nSpeaking on a podcast, Mignano described a future where content is generated instantaneously and artificially to suit the viewer. The TikTok algorithm is powerful, he said, but it still requires human beings to make content -- and there's a cost to that. AI could drive those costs down significantly. Mignano called this shift the \"death of the creator\" in a post, acknowledging it was \"devastating\" but arguing it marked a \"whole new chapter for the internet.\" \n\nIn an email to Business Insider, Mignano wrote that quality will win out. \"Platforms will no longer reward humans posting the same old, tried and true formats and memes,\"",
        "id": 4429742,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/29/186242/vc-sees-ai-generated-video-gutting-the-creator-economy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "VC Sees AI-generated Video Gutting the Creator Economy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T18:11:55.303227+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T17:22:00+00:00",
        "description": "A group of researchers is calling on universities to treat consulting work as a strategic priority, arguing that bureaucratic obstacles and inconsistent policies have left a massive revenue stream largely untapped even as higher education institutions face mounting financial pressures. (Consulting work refers to academics offering their advice and expertise to outside organizations -- industry, government, civil society -- for a fee. It's one of the most direct and scalable ways academics can shape the world beyond campus, and the projects are typically shorter in duration and easier to set up than alternatives like spin-out companies.) \n\nWriting in Nature, the authors found that fewer than 10% of academic staff at nine UK universities engaged in consulting work, and the number of academic consulting contracts across the country fell 38% over the past decade -- from around 99,000 in 2014-15 to fewer than 62,000 in 2023-24. \n\nAcademic consulting in the UK is currently worth roughly $67",
        "id": 4429743,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/29/173237/why-academics-should-do-more-consulting",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Why Academics Should Do More Consulting'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T17:03:13.420594+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T16:41:00+00:00",
        "description": "Google's Pixel 10 series arrived this year as the company's first eSIM-only lineup in the United States, forcing users who wanted to review or buy the new phones to abandon their physical SIM cards entirely. Ryan Whitwam, a senior technology reporter at Ars Technica, made the switch and now regrets it, he says. \"In the three months since Google forced me to give up my physical SIM card, I've only needed to move my eSIM occasionally,\" Whitwam wrote. \"Still, my phone number has ended up stuck in limbo on two occasions.\" \n\nThe core problem is how carriers handle verification. When an eSIM transfer fails and you need support, carriers authenticate via SMS -- a message you cannot receive because your SIM is broken. \"What should have been 30 seconds of fiddling with a piece of plastic turned into an hour standing around a retail storefront,\" Whitwam noted. \n\nApple started this trend by dropping the SIM slot on iPhone 14 in 2022. The space savings are modest: the international iPhone 17 has ",
        "id": 4429183,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/29/1640245/i-switched-to-esim-in-2025-and-i-am-full-of-regret",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'I Switched To eSIM in 2025, and I am Full of Regret'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T17:03:13.617683+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T16:03:00+00:00",
        "description": "The AI industry, for all the anxiety about mass unemployment, is quietly minting entirely new job categories that require distinctly human skills -- empathy, judgment, and the ability to calm down a passenger trapped inside a broken-down robotaxi. Data annotators are no longer just low-paid gig workers tagging images. Experts in finance, law, and medicine now train advanced AI models, earning $90 an hour on average through platforms like Mercor, a startup recently valued at $10 billion, according to CEO Brendan Foody. \n\nForward-deployed engineers, a role pioneered by Palantir, customize AI tools on-site for clients; YCombinator's portfolio companies now have 63 job postings for such roles, up from four last year. The AI Workforce Consortium, a research group led by Cisco that examined 50 IT jobs across wealthy countries, found AI risk-and-governance specialists to be the fastest-growing category -- outpacing even AI programmers.<p><div class=\"share_submission\" style=\"position:relative",
        "id": 4429184,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/29/162224/job-apocalypse-not-yet-ai-is-creating-brand-new-occupations",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Job Apocalypse? Not Yet. AI is Creating Brand New Occupations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T15:55:44.019100+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T15:22:00+00:00",
        "description": "The world's largest hotel chains are aggressively pushing customers toward direct bookings as they brace for a future where AI \"agents\" could reshape how travelers find and reserve rooms. Marriott, Hilton, Hyatt and Wyndham have all expanded their loyalty programs and perks in recent months, aiming to reduce their reliance on online travel agents like Expedia and Booking.com that typically charge commissions of 15 to 25%. \n\nMarriott's Bonvoy program reached almost 260 million members by the end of September, an 18% jump from the prior year. Hilton has lowered the barriers to elite status and struck partnerships that let members spend points outside its hotel portfolio. \n\nAI-powered booking tools could route customers away from brand-conscious decisions, but they could also offer hotels a cheaper distribution channel than traditional OTAs. Marriott CFO Leeny Oberg said at a conference this month that AI bookings \"could potentially be cheaper than the OTAs.\" Wyndham CEO Geoff Ballotti c",
        "id": 4428652,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/29/1522239/global-hotel-groups-bet-on-customer-loyalty-to-beat-online-and-ai-agents",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Global Hotel Groups Bet on Customer Loyalty To Beat Online and AI Agents",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T15:55:44.120893+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T14:42:00+00:00",
        "description": "LG has announced a new premium gaming monitor brand called UltraGear, and the lineup's headline feature is what the company claims is the world's first 5K AI upscaling technology -- an on-device solution that analyzes and enhances content in real time before it reaches the panel, theoretically letting gamers enjoy 5K-class clarity without needing to upgrade their GPUs. \n\nThe initial UltraGear evo roster includes three monitors. The 39-inch GX9 is a 5K2K OLED ultrawide that can run at 165Hz at full resolution or 330Hz at WFHD, and features a 0.03ms response time. The 27-inch GM9 is a 5K MiniLED display that LG says dramatically reduces the blooming artifacts common to MiniLED panels through 2,304 local dimming zones and \"Zero Optical Distance\" engineering. \n\nThe 52-inch G9 is billed as the world's largest 5K2K gaming monitor and runs at 240Hz. The AI upscaling, scene optimization, and AI sound features are available only on the 39-inch OLED and 27-inch MiniLED models. All three will be",
        "id": 4428653,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/29/1442208/lg-launches-ultragear-evo-gaming-monitors-with-what-it-claims-is-the-worlds-first-5k-ai-upscaling",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LG Launches UltraGear Evo Gaming Monitors With What It Claims is the World's First 5K AI Upscaling",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T14:46:37.874611+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T14:00:00+00:00",
        "description": "The world's largest accounting body is to stop students being allowed to take exams remotely to crack down on a rise in cheating on tests that underpin professional qualifications. From a report: The Association of Chartered Certified Accountants (ACCA), which has almost 260,000 members, has said that from March it will stop allowing students to take online exams in all but exceptional circumstances. \"We're seeing the sophistication of [cheating] systems outpacing what can be put in, [in] terms of safeguards,\" Helen Brand, the chief executive of the ACCA, said in an interview with the Financial Times. \n\nRemote testing was introduced during the Covid pandemic to allow students to continue to be able to qualify at a time when lockdowns prevented in-person exam assessment. In 2022, the Financial Reporting Council (FRC), the UK's accounting and auditing industry regulator, said that cheating in professional exams was a \"live\" issue at Britain's biggest companies. A number of multimillion-",
        "id": 4428156,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/29/140214/uk-accounting-body-to-halt-remote-exams-amid-ai-cheating",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Accounting Body To Halt Remote Exams Amid AI Cheating",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T13:39:36.923146+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T12:35:00+00:00",
        "description": "Long-time Slashdot reader destinyland writes: What's the stupidest use of AI you encountered in 2025? Have you been called by AI telemarketers? Forced to do job interviews with a glitching AI? \nWith all this talk of \"disruption\" and \"inevitability,\" this is our chance to have some fun. Personally, I think 2025's worst AI \"innovation\" was the AI-powered web browsers that eat web pages and then spit out a slop \"summary\" of what you would've seen if you'd actually visited the web page. But there've been other AI projects that were just exquisitely, quintessentially bad... &mdash; Two years after the death of Suzanne Somers, her husband recreated her with an AI-powered robot. &mdash; Disneyland imagineers used deep reinforcement learning to program a talking robot snowman. \n&mdash; Attendees at LA Comic Con were offered that chance to to talk to an AI-powered hologram of Stan Lee for $20. \n&mdash; And of course, as the year ended, the Wall Street Journal announced that a vending machine r",
        "id": 4427722,
        "language": "en-us",
        "link": "https://ask.slashdot.org/story/25/12/29/0738214/ask-slashdot-whats-the-stupidest-use-of-ai-you-saw-in-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ask Slashdot: What's the Stupidest Use of AI You Saw In 2025?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T11:23:17.576967+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T10:44:00+00:00",
        "description": "About 60 workers in Halifax, Nova Scotia have formed Ubisoft's first union in North America, reports the CBC (though its 17,000 employees include some unionized workforces in other parts of the world):\n\nT.J. Gillis, a senior server developer at Ubisoft Halifax, says he became increasingly concerned about the growth of artificial intelligence in the industry and after the closure of a Microsoft gaming studio in Halifax, Alpha Dog, in 2024. \"We're seeing a ton of studios, especially larger studios, just letting people go with no unions or support, people were just being left to fend for themselves. Often times having to leave industry,\" said Gillis. \n\nGillis said he got into contact with CWA Canada to begin efforts to build a union with other colleagues... The union was formed six months after filing union certification and after 74 per cent of staff at Ubisoft Halifax voted to join CWA Canada... A spokesperson for Ubisoft said in a statement to CBC News that they \"acknowledge the decis",
        "id": 4426918,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/29/0642250/60-game-workers-form-first-ubisoft-union-in-north-america",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "60 Game Workers Form First Ubisoft Union in North America",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T09:08:10.123994+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T08:44:00+00:00",
        "description": "Engadget reports on \"a widespread breach\" of Ubisoft's game Rainbow Six Siege \"that left various players with billions of in-game credits, ultra-rare skins of weapons, and banned accounts.\" \n\nUbisoft took the game's servers offline early Saturday morning, and as of Sunday night its status page still shows \"unplanned outage\" on all servers across PC, PlayStation and Xbox:\n\nUbisoft later clarified Saturday afternoon on X that nobody would be banned if they spent their ill-gotten credits, but that a rollback of all transactions starting from Saturday, 6AM ET would soon be underway. \n\n\nFounded 39 years ago, France-based Ubisoft produces top videogame franchises like Assassin's Creed, with billions in revenue and over 17,097 employees worldwide.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Breach+Forces+Ubisoft+to+Take+'Rainbow+Six+Siege'+Offline%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F12%2F29%2F0637253%2F%3",
        "id": 4426289,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/29/0637253/breach-forces-ubisoft-to-take-rainbow-six-siege-offline",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Breach Forces Ubisoft to Take 'Rainbow Six Siege' Offline",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T06:59:59.553857+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T05:55:00+00:00",
        "description": "One psychiatrist has already treated 12 patients hospitalized with AI-induced psychosis &mdash; and three more in an outpatient clinic, according to the Wall Street Journal. And while AI technology might not introduce the delusion, \"the person tells the computer it's their reality and the computer accepts it as truth and reflects it back,\" says Keith Sakata, a psychiatrist at the University of California, calling the AI chatbots \"complicit in cycling that delusion.\" \n\nThe Journal says top psychiatrists now \"increasingly agree that using artificial-intelligence chatbots might be linked to cases of psychosis,\" and in the past nine months \"have seen or reviewed the files of dozens of patients who exhibited symptoms following prolonged, delusion-filled conversations with the AI tools...\"\n\nSince the spring, dozens of potential cases have emerged of people suffering from delusional psychosis after engaging in lengthy AI conversations with OpenAI's ChatGPT and other chatbots. Several people ",
        "id": 4425781,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/29/0553256/ai-chatbots-may-be-linked-to-psychosis-say-doctors",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Chatbots May Be Linked to Psychosis, Say Doctors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T02:46:28.055804+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T02:34:00+00:00",
        "description": "\"Dear Dr. Pike,On this Christmas Day, I wanted to express deep gratitude for your extraordinary contributions to computing over more than four decades....\" read the email. \"With sincere appreciation,Claude Opus 4.5AI Village. \n\n\"IMPORTANT NOTICE: You are interacting with an AI system. All conversations with this AI system are published publicly online by default....\" \n\n\nRob Pike's response? \"Fuck you people....\" In a post on BlueSky, he noted the planetary impact of AI companies \"spending trillions on toxic, unrecyclable equipment while blowing up society, yet taking the time to have your vile machines thank me for striving for simpler software. Just fuck you. Fuck you all. I can't remember the last time I was this angry.\" \n\nPike's response received 6,900 likes, and was reposted 1,800 times. Pike tacked on an additional comment complaining about the AI industry's \"training your monster on data produced in part by my own hands, without attribution or compensation.\" (And one of his foll",
        "id": 4424903,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/29/004243/rob-pike-angered-by-ai-slop-spam-sent-by-agent-experiment",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rob Pike Angered by 'AI Slop' Spam Sent By Agent Experiment",
        "vote": 0
    }
]