[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T16:31:58.155755+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T15:30:00+00:00",
        "description": "Given the suite of post-launch updates and content drops, it feels like the right time to revisit Far Cry 6. Commercially successful yet divisive amongst players, The latest mainline entry in the exotic open-world shooter series transported players to Yara, a fictional stand-in for Cuba, to lead a revolution against the island’s tyrannical dictator. On launch, the game’s inconsistent performance, clunky UI, and unpredictable AI were sour notes, as was the game’s copy-paste formula suggesting series fatigue. \n\nOur reviewer posted a nine-out-of-ten, citing an immersive world, tactical combat, and rich customisation. We are not undercutting that review; instead, let's look at how Far Cry 6 has evolved and if the weak points highlighted by the community have truly been fixed. The question we’ll answer is this: in 2025, is Far Cry 6 fixed? And perhaps, if it is fixed, who will enjoy playing it?",
        "id": 4428934,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Z24RWXE8vmU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z24RWXE8vmU/hqdefault.jpg",
        "title": "Four Years Later, Is Far Cry 6 FIXED?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-29T09:47:08.920784+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-29T09:30:00+00:00",
        "description": "While it's been a solid year all around for gaming as a whole, we've had some real beauties to play on the PC. But if you don't live and breathe games for a living, it's kind of hard to keep track of all the great titles coming your way, and a few might just slip through the cracks. \n\nIf you're wondering if there are any such titles you've missed this year, you're more than welcome to join us and see if there's something that catches your eye. From roguelikes, shooters, beat ‘em ups, and puzzles, there's something for you no matter the kind of experience you're looking for. \n\nYou can't go wrong with these ones, and the winner is probably not going to be too much a surprise either if you've played it already. If you haven't, well, you're going to thank us for the recommendation.",
        "id": 4426434,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=SdrC3rJB428",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SdrC3rJB428/hqdefault.jpg",
        "title": "20 Must Play PC Games of 2025",
        "vote": 0
    }
]