[
    {
        "age": null,
        "album": "",
        "author": "Joshua Fluke",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T21:52:30.748213+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T20:35:06+00:00",
        "description": "Verizon just fired 13,000 people in one massive blast — and just like every other giant layoff announcement, the stock magically jumped right after. This isn’t about “restructuring,” “innovation,” or “AI skills for the future.” It’s a stock-price inflation button CEOs slam whenever the board needs a quick dopamine hit.\n\nIn this video, I break down why companies announce huge layoffs publicly, why the stock always spikes, and why these mass cuts have nothing to do with “fixing the business” and everything to do with making shareholders smile for 24 hours.\n\nWe look at the WARN Act, how companies decide between mass layoffs vs. quiet “forever layoffs,” why Verizon’s new CEO needed to make a splash, and how corporate PR teams wrap all of this in the most absurd excuses imaginable.\n\nBecause let’s be honest: if you don’t own the company, you’re not part of the plan. You’re an expense to be trimmed when the stock dips or when Wall Street gets grumpy. These decisions aren’t strategic. They’re",
        "id": 4145851,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Ihs2r2O-b5s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 169,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC-91UA-Xy2Cvb98deRXuggA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Ihs2r2O-b5s/hqdefault.jpg",
        "title": "Verizon Cut 13,000 Jobs — Why Did the Stock Jump?",
        "vote": 0
    }
]