[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T23:05:18.384097+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T22:09:00+00:00",
        "description": "In October cryptologist/CS professor Daniel J. Bernstein alleged that America's National Security\nAgency (and its UK counterpart GCHQ) were attempting to influence NIST to adopt weaker post-quantum cryptography\nstandards without a \"hybrid\" approach that would've also included pre-quantum ECC. \n\nBernstein is of the opinion that \"Given how\nmany post-quantum proposals have been broken and the continuing flood of side-channel attacks, any competent engineering evaluation will conclude that\nthe best way to deploy post-quantum [PQ] encryption for TLS, and for the Internet more broadly, is as double encryption: post-quantum cryptography on top of ECC.\" But\nhe says he's seen it playing out differently:\n\n\nBy 2013, NSA had a quarter-billion-dollar-a-year\nbudget to \"covertly influence and/or overtly leverage\"\nsystems to \"make the systems in question exploitable\"; in\nparticular, to \"influence policies, standards and specification\nfor commercial public key technologies\". NSA is quietly\nusing stron",
        "id": 4146231,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/23/226258/cryptologist-djb-criticizes-push-to-finalize-non-hybrid-security-for-post-quantum-cryptography",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cryptologist DJB Criticizes Push to Finalize Non-Hybrid Security for Post-Quantum Cryptography",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T22:04:41.461496+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T21:09:00+00:00",
        "description": "\"Three years ago, Google removed JPEG XL support from Chrome, stating there wasn't enough interest at the time,\" writes the blog Windows Report. \"That position has now changed.\"\n\nIn a recent note to developers, a Chrome team representative confirmed that work has restarted to bring JPEG XL to Chromium and said Google \"would ship it in Chrome\" once long-term maintenance and the usual launch requirements are met. \n\nThe team explained that other platforms moved ahead. Safari supports JPEG XL, and Windows 11 users can add native support through an image extension from Microsoft Store. The format is also confirmed for use in PDF documents. There has been continuous demand from developers and users who ask for its return. \n\nBefore Google ships the feature in Chrome, the company wants the integration to be secure and supported over time. A developer has submitted new code that reintroduces JPEG XL to Chromium. This version is marked as feature complete. The developer said it also \"includes a",
        "id": 4145963,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/23/2026246/google-revisits-jpeg-xl-in-chromium-after-earlier-removal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Revisits JPEG XL in Chromium After Earlier Removal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T21:01:03.516720+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T20:09:00+00:00",
        "description": "\"Fresh from announcing it is building an AI browsing mode in Firefox and laying the groundwork for agentic interactions in the Firefox 145 release, the corp arm of Mozilla is now flexing its AI muscles in the direction of those more likely to care,\" writes the blog OMG Ubuntu:\n\n\n\nIf you're a developer building AI agents, you can sign up to get early access to Mozilla's TABS API, a \"powerful web content extraction and transformation toolkit designed specifically for AI agent builders\"... The TABS API enables devs to create agents to automate web interactions, like clicking, scrolling, searching, and submitting forms \"just like a human\". Real-time feedback and adaptive behaviours will, Mozilla say, offer \"full control of the web, without the complexity.\" \n\n\n\n\nAs TABS is not powered by a Mozilla-backed LLM you'll need to connect it to your choice of third-party LLM for any relevant processing... Developers get 1,000 requests monthly on the free tier, which seems reasonable for prototypin",
        "id": 4145637,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/23/206245/mozilla-announces-tabs-api-for-developers-building-ai-agents",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mozilla Announces 'TABS API' For Developers Building AI Agents",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T20:00:31.271975+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T18:52:00+00:00",
        "description": "Long-time Slashdot reader jenningsthecat shared this article from IEEE Spectrum:\n\nBy dropping a nuclear reactor 1.6 kilometers (1 mile) underground, Deep Fission aims to use the weight of a billion tons of rock and water as a natural containment system comparable to concrete domes and cooling towers. With the fission reaction occurring far below the surface, steam can safely circulate in a closed loop to generate power. \n\n\nThe California-based startup announced in October that prospective customers had signed non-binding letters of intent for 12.5 gigawatts of power involving data center developers, industrial parks, and other (mostly undisclosed) strategic partners, with initial sites under consideration in Kansas, Texas, and Utah... The company says its modular approach allows multiple 15-megawatt reactors to be clustered on a single site: A block of 10 would total 150 MW, and Deep Fission claims that larger groupings could scale to 1.5 GW. Deep Fission claims that using geological ",
        "id": 4145358,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/23/1850236/one-companys-plan-to-sink-nuclear-reactors-deep-underground",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "One Company's Plan to Sink Nuclear Reactors Deep Underground",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T17:51:23.317643+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T17:34:00+00:00",
        "description": "With some animated graphics, CNN \"reimagined\" what three of America's busiest air and road travel routes would look like with high-speed trains, for \"a glimpse into a faster, more connected future.\"\n\n\nThe journey from New York City to Chicago could take just over six hours by high-speed train at an average speed of 160 mph, cutting travel time by more than 13 hours compared with the current Amtrak route... The journey from San Francisco to Los Angeles could be completed in under three hours by high-speed train... The journey from Atlanta to Orlando could be completed in under three hours by high-speed train that reaches 160 mph, cutting travel time by over half compared with driving... \n\n\n\nWhile high-speed rail remains a fantasy in the United States, it is already hugely successful across the globe. Passengers take 3 billion trips annually on more than 40,000 miles of modern high-speed railway across the globe, according to the International Union of Railways. China is home to the wor",
        "id": 4144673,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/22/201221/could-high-speed-trains-shorten-us-travel-times-while-reducing-emissions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could High-Speed Trains Shorten US Travel Times While Reducing Emissions?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T16:49:18.588525+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T16:34:00+00:00",
        "description": "\"Security, development, and AI now move as one,\" says Microsoft's director of cloud/AI security\nproduct marketing. \n\n\n\nMicrosoft and GitHub \"have launched a native integration between Microsoft Defender for Cloud and GitHub Advanced Security that aims to address what one executive calls decades of accumulated security debt in enterprise codebases...\" according to The New Stack:\n\nThe integration, announced this week in San Francisco at the\nMicrosoft\nIgnite 2025 conference and now available in public preview,\nconnects runtime intelligence from production environments directly\ninto developer workflows. The goal is to help organizations\nprioritize which vulnerabilities actually matter and use AI to fix\nthem faster. \"Throughout my career, I've seen vulnerability\ntrends going up into the right. It didn't matter how good of a\ndetection\nengine and how accurate our detection engine was, people just\ncouldn't fix things fast enough,\" said Marcelo\nOliveira, VP of product management at GitHub, who",
        "id": 4144367,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/23/0116256/microsoft-and-github-preview-new-tool-that-identifies-prioritizes-and-fixes-vulnerabilities-with-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft and GitHub Preview New Tool That Identifies, Prioritizes, and Fixes Vulnerabilities With AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T15:46:51.784273+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T15:34:00+00:00",
        "description": "\"On the slopes of an Oregon volcano, engineers are building the hottest geothermal power plant on Earth,\" reports the Washington Post:\n\nThe plant will tap into the infernal energy of Newberry Volcano, \"one of the largest and most hazardous active volcanoes in the United States,\" according to the U.S. Geological Survey. It has already reached temperatures of 629 degrees Fahrenheit, making it one of the hottest geothermal sites in the world, and next year it will start selling electricity to nearby homes and businesses. But the start-up behind the project, Mazama Energy, wants to crank the temperature even higher &mdash; north of 750 degrees &mdash; and become the first to make electricity from what industry insiders call \"superhot rock.\" Enthusiasts say that could usher in a new era of geothermal power, transforming the always-on clean energy source from a minor player to a major force in the world's electricity systems. \n\n\"Geothermal has been mostly inconsequential,\" said Vinod Khosla",
        "id": 4143970,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/22/0547231/engineers-are-building-the-hottest-geothermal-power-plant-on-earth---next-to-a-us-volcano",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Engineers are Building the Hottest Geothermal Power Plant on Earth - Next to a US Volcano",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T12:39:15.980927+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T12:34:00+00:00",
        "description": "\"The internet did transform work &mdash; but not the way 1998 thought...\" argues the Wall Street Journal. \"The internet slipped inside almost every job and rewired how work got done.\" \n\nSo while the number of single-task jobs like travel agent dropped, most jobs \"are bundles of judgment, coordination and hands-on work,\" and instead the internet brought \"the quiet transformation of nearly every job in the economy... Today, just 10% of workers make minimal use of the internet on the job &mdash; roles like butcher and carpet installer.\"\n\n[T]he bigger story has been additive. In 1998, few could conceive of social media &mdash; let alone 65,000 social-media managers &mdash; and 200,000 information-security analysts would have sounded absurd when data still lived on floppy disks... Marketing shifted from campaign bursts to always-on funnels and A/B testing. Clinics embedded e-prescribing and patient portals, reshaping front-office and clinical handoffs. The steps, owners and metrics shifted",
        "id": 4142897,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/23/0812238/how-the-internet-rewired-work---and-what-that-tells-us-about-ais-likely-impact",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How the Internet Rewired Work - and What That Tells Us About AI's Likely Impact",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T09:33:21.181519+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T08:34:00+00:00",
        "description": "\"Copilot Actions on Windows 11\" is currently available in Insider builds (version 26220.7262) as part of Copilot Labs, according to a recent report, \"and is off by default, requiring admin access to set it up.\" \n\nBut maybe it's off for a good reason...besides the fact that it can access any apps installed on your system:\n\nIn a support document, Microsoft admits that features like Copilot Actions introduce \" novel security risks .\" They warn about cross-prompt injection (XPIA), where malicious content in documents or UI elements can override the AI's instructions. The result? \" Unintended actions like data exfiltration or malware installation .\" \n\nYeah, you read that right. Microsoft is shipping a feature that could be tricked into installing malware on your system. Microsoft's own warning hits hard: \"We recommend that you only enable this feature if you understand the security implications.\" When you try to enable these experimental features, Windows shows you a warning dialog that yo",
        "id": 4142067,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/23/060221/microsoft-warns-its-windows-ai-feature-brings-data-theft-and-malware-risks-and-occasionally-may-hallucinate",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Warns Its Windows AI Feature Brings Data Theft and Malware Risks, and 'Occasionally May Hallucinate'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T06:28:58.740800+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T05:34:00+00:00",
        "description": "A promotional video for Amazon's Kiro software development system took a unique approach, writes GeekWire. \"Instead of product diagrams or keynote slides, a crew from Seattle's Packrat creative studio used action figures on a miniature set to create a stop-motion sequence...\" \n\n\n\"Can the software development hero conquer the 'AI Slop Monster' to uncover the gleaming, fully functional robot buried beneath the coding chaos?\"\n\n\nKiro (pronounced KEE-ro) is Amazon's effort to rethink how developers use AI. It's an integrated development environment that attempts to tame the wild world of vibe coding... But rather than simply generating code from prompts [in \"vibe mode\"], Kiro breaks down requests into formal specifications, design documents, and task lists [in \"spec mode\"]. This spec-driven development approach aims to solve a fundamental problem with vibe coding: AI can quickly generate prototypes, but without structure or documentation, that code becomes unmaintainable... \n\n\nThe market f",
        "id": 4141476,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/23/0450211/amazons-ai-powered-ide-kiro-helps-vibe-coders-with-spec-mode",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's AI-Powered IDE Kiro Helps Vibe Coders with 'Spec Mode'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T03:21:00.499212+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T02:35:00+00:00",
        "description": "A week ago Bitcoin was at $93,714. Saturday it dropped to $85,300. \n\n\nLate Thursday, market researcher Ed Yardeni blamed some of Thursday's stock market sell-off on \"the ongoing plunge in bitcoin's price,\" reports Fortune:\n\n\n\n\n\"There has been a strong correlation between it and the price of TQQQ, an ETF that seeks to achieve daily investment results that correspond to three times (3x) the daily performance of the Nasdaq-100 Index,\" [Yardeni wrote in a note]. Yardeni blamed bitcoin's slide on the GENIUS Act, which was enacted on July 18, saying that the regulatory framework it established for stablecoins eliminated bitcoin's transactional role in the monetary system. \"It's possible that the rout in bitcoin is forcing some investors to sell stocks that they own,\" he added... Traders who used leverage to make crypto bets would need to liquidate positions in the event of margin calls. \nSteve Sosnick, chief strategist at Interactive Brokers, also said bitcoin could swing the entire stock m",
        "id": 4140945,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/23/0144214/did-bitcoin-play-a-role-in-thursdays-stock-sell-off",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Did Bitcoin Play a Role in Thursday's Stock Sell-Off?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-23T02:20:30.829343+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-23T01:35:00+00:00",
        "description": "\"PHP 8.5 landed on Thursday with a long-awaited pipe operator and a new standards-compliant URI parser,\" reports the Register, \"marking one of the scripting language's more substantial updates... \"\n\n\n\nThe pipe operator allows function calls to be chained together, which avoids the\nextraneous variables and nested statements that might otherwise be\ninvolved. Pipes tend to make code more readable than other ways to\nimplement serial operations. Anyone familiar with the Unix/Linux\ncommand line or programming languages like R,\nF#,\nClojure, or\nElixir\nmay have used the pipe operator. In JavaScript, aka ECMAScript, a\npipe operator has been proposed, though there are alternatives\nlike method chaining.\n \n\nAnother significant addition is the URI\nextension, which allows developers to parse and modify URIs and\nURLs based on both the RFC 3986 and the WHATWG URL standards. Parsing\nwith URIs and URLs &#226;\" reading them and breaking them down into their\ndifferent parts &#226;\" is a rather common task",
        "id": 4140788,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/23/0021216/php-85-brings-long-awaited-pipe-operator-adds-new-uri-tools",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PHP 8.5 Brings Long-Awaited Pipe Operator, Adds New URI Tools",
        "vote": 0
    }
]