[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T23:02:27.734327+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T22:49:00+00:00",
        "description": "Toyota sold just 61 BZ models in September, reports Electrek. \n\n\"Including the Lexus RZ, which managed 86 sales, Toyota sold just 147 all-electric vehicles in the US last month, over 90% less than the 1,847 it sold in September 2024.\"\n\n\nToyota's total sales were up 14% with over 185,700 vehicles sold, meaning EVs accounted for less than 0.1%... So, why is Toyota struggling to sell EVs when the market is booming? For one, Toyota recalled over 95,000 electric vehicles last month, including the bZ4X, Lexus RZ, and Subaru Solterra, all of which are built on the same platform. The recall was due to a faulty defroster, but Toyota instructed its dealers to halt sales of the bZ4X, Lexus RZ, and Subaru Solterra. \n\nToyota hopes to turn things around with a new and improved lineup. The 2026 Toyota BZ (formerly the bZ4X) is arriving at US dealerships, promising to fix some of the biggest complaints with the outgoing electric SUV. Powered by a larger 74.7 kWh battery, the 2026 Toyota BZ offers up ",
        "id": 3736755,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/04/2210244/toyotas-ev-sales-plunged-in-september-after-recall-but-plans-improved-lineup",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Toyota's EV Sales Plunged in September After Recall, But Plans Improved Lineup",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T23:02:27.856785+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T21:49:00+00:00",
        "description": "\"Microsoft buys a lot of GPUs from both Nvidia and AMD,\" writes the Register. \"But moving forward, Redmond's leaders want to shift the majority of its AI workloads from GPUs to its own homegrown accelerators...\"\n\nDriving the transition is a focus on performance per dollar, which for a hyperscale cloud provider is arguably the only metric that really matters. Speaking during a fireside chat moderated by CNBC on Wednesday, Microsoft CTO Kevin Scott said that up to this point, Nvidia has offered the best price-performance, but he's willing to entertain anything in order to meet demand. \n\nGoing forward, Scott suggested Microsoft hopes to use its homegrown chips for the majority of its datacenter workloads. When asked, \"Is the longer term idea to have mainly Microsoft silicon in the data center?\" Scott responded, \"Yeah, absolutely... \n\nMicrosoft is reportedly in the process of bringing a second-generation Maia accelerator to market next year that will no doubt offer more competitive comput",
        "id": 3736756,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/04/2142243/microsofts-cto-hopes-to-swap-most-amd-and-nvidia-gpus-for-in-house-chips",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft's CTO Hopes to Swap Most AMD and NVIDIA GPUs for In-House Chips",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T21:48:56.058503+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T20:49:00+00:00",
        "description": "The Greater Manchester Police force has 12,677 employees. But they've now suspended work-from-home privileges, reports the BBC, \"following an investigation into so-called 'key-jamming', which can allow people to falsely appear to be working. \"Twenty-six police officers, staff and contractors are facing misconduct proceedings following the probe, the force said.\" \n\n\nOne constable told a hearing that a police detective working from home had made it look like his computer was in use on 38 different occasions over 12 days, according to an earlier BBC article. The evidence \"showed lengthy periods where the only activity is single keystrokes, pressing the 'H' key about 30 times, between 10:28 and 11:56 GMT on 3 December, and then the 'I' key more than 16,000 times.\" The detective \"used key jamming for 45 hours out of a total of 85 he was logged in for and was frequently away from the keyboard for half of his working day.\" \n\nThe constable said the detective's motivation was \"laziness\" &mdash",
        "id": 3736504,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/04/209200/a-uk-police-force-suspends-working-from-home-after-finding-automated-keystroke-scam",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A UK Police Force Suspends Working From Home After Finding Automated Keystroke Scam",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T20:34:47.320200+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T19:19:00+00:00",
        "description": "From 10 a.m. to 7 p.m. today (EDT), the Free Software Foundation celebrates its 40th anniversary with an online and in-person event. \"We will broadcast the talks and workshops via a fully free software livestream on fsf.org/live,\" according to the FSF's official \"FSF40 Celebration\" page. \"Everyone will be able to join the discussion via the #fsf40 IRC channel on Libera.Chat.\" \n\n\"4 decades, 4 freedoms, 4 all users\" is the event's slogan. \n\nAnd during the ceremony, a 40th-anniversary cake was sliced by newly-elected FSF president Ian Kelling (who was unanimously confirmed by FSF board members):\n\nKelling, age 43, has held the role of a board member and a voting member since March 2021. The board said of Kelling's confirmation: \"His hands-on technical experience resulting from his position as the organization's senior systems administrator proved invaluable for his work on the board of directors... He has the technical knowledge to speak with authority on most free software issues, and he",
        "id": 3736137,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/04/1854250/the-free-software-foundation-is-livestreaming-its-40th-anniversary-celebration",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Free Software Foundation is Livestreaming Its 40th Anniversary Celebration",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T19:18:30.146985+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T18:49:00+00:00",
        "description": "An anonymous reader shared this report from the Washington Post:\n\nWomen tend to live longer than men. There are traditional explanations: Men smoke more. They drink more. They tend to engage in riskier behavior. But the fact that this lifespan gap holds true regardless of country or century indicates something deeper is also at play. \n\nA growing body of evidence suggests that women's relative longevity may derive, in part, from having double X chromosomes, a redundancy that protects them against harmful mutations. That theory was further bolstered Wednesday with the publication of the most sweeping analysis to date of the lifespan differences between males and females in more than 1,000 mammal and bird species... \n\nIf a baby has a pair of X chromosomes, she's a girl. If the baby inherits an X chromosome and a Y chromosome, he's a boy. In birds, however, the situation is reversed. Female birds have a pair of unlike sex chromosomes while males have the like pair... For their study, Colc",
        "id": 3735759,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/04/0427230/why-do-women-outlive-men-a-study-of-1176-species-points-to-an-answer",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Do Women Outlive Men?  A Study of 1,176 Species Points to an Answer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T18:08:02.415620+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T17:49:00+00:00",
        "description": "Long-time Slashdot reader theodp writes: CBS News has a TL;DR video report, but Jeremy Stern's earlier epic Class Dismissed [at Collosus.com] offers a deep dive into Alpha School, \"the teacherless, homeworkless, K-12 private school in Austin, Texas, where students have been testing in the top 0.1% nationally by self-directing coursework with AI tutoring apps for two hours a day. \n\nAlpha students are incentivized to complete coursework to \"mastery-level\" (i.e., scoring over 90%) in only two hours via a mix of various material and immaterial rewards, including the right to spend the other four hours of the school day in 'workshops,' learning things like how to run an Airbnb or food truck, manage a brokerage account or Broadway production, or build a business or drone.\" Founder MacKenzie Larson's dream that \"kids must love school so much they don't want to go on vacation\" drew the attention of &mdash; and investments of money and time from &mdash; mysterious tech billionaire Joe Liemandt",
        "id": 3735427,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/04/1746211/the-school-that-replaces-teachers-with-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The School That Replaces Teachers With AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T16:47:58.274525+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T16:34:00+00:00",
        "description": "The food delivery robots that arrived in Atlanta in June \"are not our friends,\" argues a headline at CNN. \nThe four-wheeled Serve Robotics machines \"get confused at crosswalks. They move with the speed and caution of a first-time driver, stilted and shy, until they suddenly speed up without warning. Their four wheels look like they were made for off-roading, but they still get stuck in the cracks of craggy sidewalks. Most times I see the bots, they aren't moving at all... \"\n\nCyclists swerve to avoid them like any other obstacle in the road. Patrons of Shake Shack (a national partner of Serve) weave around the mess of robots parked in front of the restaurant to make their way inside and place orders on iPads... The dawn of everyday, \"friendly\" robots may be here, but they haven't proven themselves useful &mdash; or trustworthy &mdash; yet. \"People think they are your friends, but they're actually cameras and microphones of corporations,\" said Joanna Bryson, a longtime AI scholar and pr",
        "id": 3734969,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/04/0257229/cnn-warns-food-delivery-robots-are-not-our-friends",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CNN Warns Food Delivery Robots 'Are Not Our Friends'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T16:47:58.344670+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T15:34:00+00:00",
        "description": "\"A small number of researchers are making real progress trying to create computers out of living cells,\" reports the BBC:\n\n\nAmong those leading the way are a group of scientists in Switzerland, who I went to meet. One day, they hope we could see data centres full of \"living\" servers which replicate aspects of how artificial intelligence (AI) learns &mdash; and could use a fraction of the energy of current methods. \n\nThat is the vision of Dr Fred Jordan, co-founder of the FinalSpark lab I visited. We are all used to the ideas of hardware and software in the computers we currently use. The somewhat eyebrow-raising term Dr Jordan and others in the field use to refer to what they are creating is \"wetware\". In simple terms, it involves creating neurons which are developed into clusters called organoids, which in turn can be attached to electrodes &mdash; at which point the process of trying to use them like mini-computers can begin... \n\nFor FinalSpark, the process begins with stem cells de",
        "id": 3734970,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/04/0729235/scientists-grow-mini-human-brains-to-power-computers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Grow Mini Human Brains To Power Computers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T15:34:44.863925+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T14:34:00+00:00",
        "description": "Amazon will be adding facial recognition to its camera-equipped Ring doorbells for the first time in December, according to the Washington Post. \n\n\"While the feature will be optional for Ring device owners, privacy advocates say it's unfair that wherever the technology is in use, anyone within sight will have their faces scanned to determine who's a friend or stranger.\"\n The Ring feature is \"invasive for anyone who walks within range of your Ring doorbell,\" said Calli Schroeder, senior counsel at the consumer advocacy and policy group Electronic Privacy Information Center. \"They are not consenting to this.\" Ring spokeswoman Emma Daniels said that Ring's features empower device owners to be responsible users of facial recognition and to comply with relevant laws that \"may require obtaining consent prior to identifying people...\" \n\nOther companies, including Google, already offer facial recognition for connected doorbells and cameras. You might use similar technology to unlock your iPho",
        "id": 3734564,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/04/0357255/amazons-ring-plans-to-scan-everyones-face-at-the-door",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's Ring Plans to Scan Everyone's Face at the Door",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T08:09:40.956539+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T07:00:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: Signal has introduced the Sparse Post Quantum Ratchet (SPQR), a new upgrade to its encryption protocol that mixes quantum safe cryptography into its existing Double Ratchet. The result, which Signal calls the Triple Ratchet, makes it much harder for even future quantum computers to break private chats. The change happens silently in the background, meaning users do not need to do anything, but once fully rolled out it will make harvested messages useless even to adversaries with quantum power.\n \nThe company worked with researchers and used formal verification tools to prove the new protocol's security. Signal says the upgrade preserves its guarantees of forward secrecy and post compromise security while adding protection against harvest now, decrypt later attacks. The move raises a bigger question: will this be enough when large scale quantum computers arrive, or will secure messaging need to evolve yet again?<p><div class=\"share_submission",
        "id": 3732478,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/03/234236/signal-braces-for-quantum-age-with-spqr-encryption-upgrade",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Signal Braces For Quantum Age With SPQR Encryption Upgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T04:38:22.004717+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Indonesia has suspended TikTok's registration to provide electronic systems after it failed to hand over all data relating to the use of its live stream feature, a government official said on Friday. The suspension could in theory prevent access to TikTok, which has more than 100 million accounts based in Indonesia.\n \nAlexander Sabar, an official at Indonesia's communications and digital ministry, said in a statement some accounts with ties to online gambling activities used TikTok's live stream feature during national protests. [...] Sabar said the government had asked the company for its traffic, streaming and monetization data. The company, owned by China's ByteDance, did not provide complete data, citing its internal procedures, Sabar said without giving further detail.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Indonesia+Suspends+TikTok+Registration+With+Ove",
        "id": 3731846,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/03/231243/indonesia-suspends-tiktok-registration-with-over-100-million-accounts-at-risk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Indonesia Suspends TikTok Registration With Over 100 Million Accounts At Risk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T02:15:11.674785+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T02:02:00+00:00",
        "description": "Google will discontinue Gmailify and POP email support in January 2026, forcing users who rely on these features to switch to IMAP. PCWorld reports: These changes only affect future emails. Emails that have already been synchronized in the Gmail account will remain the same. External accounts can still be used in the Gmail app, but only via IMAP. Google also recommends that users with work or education accounts contact their administrators if a Google Workspace migration is needed.\n \nFor many Gmail users, these changes will likely mean getting used to the new system. Anyone who previously upgraded their external email accounts with Gmailify or integrated them via POP will have to switch to IMAP by January 2026 at the latest and do without some convenient functions, like spam filters and automatic sorting.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Is+Ending+Gmailify+and+POP+Support%3A+https%3A%2F%2Ftech.s",
        "id": 3731471,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/03/2248228/google-is-ending-gmailify-and-pop-support",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Is Ending Gmailify and POP Support",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T02:15:11.808394+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T01:25:00+00:00",
        "description": "The University of San Francisco issued a campuswide alert after reports of a man using Meta Ray-Ban AI glasses to film students while making \"unwanted comments and inappropriate dating questions.\" Although no violence has been reported, officials said he may be uploading footage to TikTok and Instagram. SFGate reports: University officials said \"no threats or acts of violence\" have been reported, but they have been unable to identify all students who appear in the videos. They urged any school members affected to alert the app platform and the USF Department of Public Safety. \"As a community, we share the responsibility of caring for ourselves, each other, and this place,\" school officials said in the alert. \"By looking out for one another and promptly reporting concerns, we help ensure a safe and supportive environment for all.\"\n \nThe glasses feature a small camera that can be used for recording by pressing a button or using voice controls. Meta advises users to act \"responsibly\" whe",
        "id": 3731472,
        "language": "en-us",
        "link": "https://meta.slashdot.org/story/25/10/03/2235209/bay-area-university-issues-warning-over-man-using-meta-ai-glasses-on-campus",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bay Area University Issues Warning Over Man Using Meta AI Glasses On Campus",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T01:04:58.558933+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T00:45:00+00:00",
        "description": "The SEC has approved the Texas Stock Exchange (TXSE), the first new fully integrated U.S. stock exchange in decades and the only one based in Texas. TXSE is set to launch trading services, as well as exchange-traded products, known as ETPs, and corporate listings, in 2026. CBS News reports: Exchange-traded products are financial instruments that follow the performance of underlying assets such as stocks, indexes or other financial benchmarks. Like stocks, ETPs are traded on public exchanges, allowing investors to buy and sell them throughout the trading day at market prices that fluctuate in real time.\n \nTXSE was backed by wealth management giant BlackRock and market maker Citadel Securities, among other firms. The Texas company said in June 2024 that it raised a total of $120 million from more than two dozen investors. TXSE's headquarters in Dallas opened this spring, the group said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.",
        "id": 3731175,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/03/2224246/sec-approves-texas-stock-exchange",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SEC Approves Texas Stock Exchange",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T01:04:58.668682+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Google is bringing its AI coding agent Jules deeper into developer workflows with a new command-line interface and public API, allowing it to plug into terminals, CI/CD systems, and tools like Slack -- as competition intensifies among tech companies to own the future of software development and make coding more of an AI-assisted task.\n \nUntil now, Jules -- Google's asynchronous coding agent -- was only accessible via its website and GitHub. On Thursday, the company introduced Jules Tools, a command-line interface that brings Jules directly into the developer's terminal. The CLI lets developers interact with the agent using commands, streamlining workflows by eliminating the need to switch between the web interface and GitHub. It allows them to stay within their environment while delegating coding tasks and validating results. \"We want to reduce context switching for developers as much as possible,\" Kathy Korevec, director of product",
        "id": 3731176,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/03/2140223/googles-jules-enters-developers-toolchains-as-ai-coding-agent-competition-heats-up",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's Jules Enters Developers' Toolchains As AI Coding Agent Competition Heats Up",
        "vote": 0
    }
]