[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T17:51:23.848313+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T17:30:12+00:00",
        "description": "One of Nintendo’s biggest releases for the year will be Pokemon Legends Z-A, the follow up to the surprise 2022 rethinking of the Pokemon franchise in Pokemon Legends Arceus. Arceus was a breath of fresh air for a franchise that had long since been crying out for a change from the shackles of routine – and it instantly went on to become one of the most beloved and popular Pokemon games of all time as a result. \n\nNow, four and a half years later, we are getting a full follow-up to that game. But where it would have been very easy for Game Freak and The Pokemon Company to simply reskin Arceus and push out more of what players already loved, they have taken a very different tac with Legends Z-A, which seems to be following in Arceus’ footsteps by keeping alive its spirit of experimentation and shaking things up, but going in completely different directions in the process. Here are ten critical differences between Legends Z-A, and Legends Arceus.",
        "id": 3735340,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=s1wEmAE_T2E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s1wEmAE_T2E/hqdefault.jpg",
        "title": "Pokémon Legends: Z-A vs. Pokemon Legends: Arceus - 10 BIGGEST DIFFERENCES You Need To Know",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T16:31:31.111914+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T15:30:28+00:00",
        "description": "By now, those who picked up Ghost of Yotei will have doubtless spent hours traversing its gorgeous world. As demanding as the narrative can sometimes be – the Yotei Six won't wipe themselves out, after all – and as addictive as it can be to get lost in the side content, Ezo is brimming with spectacular details.\n\nSome of these will become immediately obvious as you move through grass, snow and flowers. Others really become noticeable when venturing into the options menu and changing the settings. However, there is a lot to discover, whether you're basking in the visual glory of Sucker Punch's latest masterpiece or unraveling the many secrets within Ezo.\n\nHere are 14 stunning details you should notice and discover for the full Ghost of Yotei experience.",
        "id": 3734885,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=uTT7YjfoJIs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uTT7YjfoJIs/hqdefault.jpg",
        "title": "Ghost of Yotei - 14 INCREDIBLY STUNNING Details You Missed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T07:53:20.396550+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T07:30:11+00:00",
        "description": "At the end of the day, this isn't about a subscription service with multiple times its value costing more now than it did before. It's also not about criticizing a major corporation for pursuing profits - you might as well browbeat a shark when it senses blood in the water. \n\nRather, it's about the bigger picture – how Microsoft sacrificed first-party game sales for the sake of Game Pass, torpedoed its own console (and the previous generation) multiple times over, laid off employees and shuttered studios when its own management is lacking, and so on. And instead of investing in some kind of goodwill, or at the very least, trying to keep its current base satisfied in the sole area that it's done so thus far, it wants to fleece them further.\n\nIt's a bold strategy, and like many that Microsoft has pursued thus far, I'm not sure how well it will work out in the long term. But at this point, it's in too deep to really do anything else but keep digging.",
        "id": 3732400,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=MaRY3YsAIVk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MaRY3YsAIVk/hqdefault.jpg",
        "title": "Xbox Keeps Eroding Gamers' Goodwill Even After Game Pass Price Hikes",
        "vote": 0
    }
]