[
    {
        "age": null,
        "album": "",
        "author": "MiniWarGaming",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-04T16:13:39.446167+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-04T15:01:11+00:00",
        "description": "Game two drops our Deathwatch misfits right where they left off and then kicks the ladder away. Skari guides Kill Team 99 through a labyrinth of grimy corridors after their Corvus Blackstar turns out to be a very expensive paperweight. \n\nWith the Auspex pinging like a guilt ridden servo skull and claxons howling across the complex, Rex keeps the shield high, Echo checks every cogitator twice, Crosshair practices stealth by not being stealthy, Wrecker looks for something suitably smashable, and Hunter does what Hunter does. Inquisition crates whisper temptations, vents cough up unwelcome surprises, and somewhere ahead a teleport relay promises salvation or another terrible idea.\n\n Expect Purge the Alien energy, door drama, and that classic hold the door moment as the team carves their own secondary objectives on the fly. No spoilers, just tense corridors, bad vibes, and the Deathwatch trying very hard not to become a footnote in some Magos field report.\n\nMembers to watch the Night Lord",
        "id": 3734773,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eqtfNObg2SY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 768,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC2mQ7x6K74NBfmxBoMwZCnw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eqtfNObg2SY/hqdefault.jpg",
        "title": "Into The Breach - Deathwatch vs Genestealer Cult - 4th Edition Kill Team Battle Report Ep 2",
        "vote": 0
    }
]