[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-01T19:30:03+00:00",
        "description": "Golf is simultaneously a game of calm concentration and stressful anticipation. Capturing that feeling - along with the physics, responsiveness, and fierce competition - that make up the sport is no easy task. Even HB Studios seemed to falter in this endeavor with PGA Tour 2K23.\n\nTwo years later, it's back with a much more refined and polished product, even if MyCareer can play it a little safe. You create a MyPlayer again and embark on a quest to conquer the PGA Tour (or start at earlier points). The various Archetypes, attributes, skill trees, and customizable equipment may seem overwhelming, but there's some incredible atmosphere and gameplay to experience.\n\nSo it's a shame that such a significant chunk is hindered by the progression, which has seen massive nerfs to the amount of VC players can earn. Don't get us wrong - PGA Tour 2K25 stands strong in many areas that matter, but less stingy progression would have gone a long way.",
        "id": 2225852,
        "language": null,
        "link": "https://www.youtube.com/watch?v=VKsMNQxmlXk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VKsMNQxmlXk/hqdefault.jpg",
        "title": "PGA Tour 2K25 Review - One of The Best PGA Games In Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-01T15:30:24+00:00",
        "description": "After occupying the Soulslike space for the better part of a decade with Nioh and Wo Long: Fallen Dynasty, developer Team Ninja came out with its first ever open world title last year in the form of Rise of the Ronin, which released exclusively for the PS5. \n\nNow, a year later, the action RPG is ready to expand its audience. Koei Tecmo is bringing Rise of the Ronin to PC, and to prepare you (and ourselves) for its upcoming PC release, here, we are going to talk about some crucial details that you should know about the game itself and the experience that it offers, as well as the specific tech features that its upcoming PC version will tout.",
        "id": 2224845,
        "language": null,
        "link": "https://www.youtube.com/watch?v=bLJtvy1uEJI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bLJtvy1uEJI/hqdefault.jpg",
        "title": "Rise of the Ronin PC - 15 Things You ABSOLUTELY Need To Know Before You Buy This PS5 Cult Classic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-01T09:30:10+00:00",
        "description": "Given the success that radical reimaging style remakes like Resident Evil 2 and (to a lesser extent) Silent Hill 2 have enjoyed, it’s understandable that many were hoping that that was the path that Konami would pick for a remake of Metal Gear Solid 3. \n\nThe fact that the upcoming Metal Gear Solid Delta: Snake Eater is being billed as a conventional remake that will stick closely to its source material may have, as such, caused some disappointment for many- though that decision may also end up enabling the remake to prove once again just how timelessly perfect the original Metal Gear Solid 3’s stealth design is.",
        "id": 2223023,
        "language": null,
        "link": "https://www.youtube.com/watch?v=NAqF9_qA3h8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NAqF9_qA3h8/hqdefault.jpg",
        "title": "One Thing The Metal Gear Solid Delta Snake Eater Remake IS SURE TO GET RIGHT",
        "vote": 0
    }
]