[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T15:30:12+00:00",
        "description": "Of the many games this year, especially in the coming weeks, Rebellion's Atomfall is one of the more curious. The post-nuclear approach may remind you of Fallout, while its survival elements could call to mind various similar titles from the genre.\n\nHowever, this isn't a Fallout clone, much less a survival crafting sandbox. Though you start as an amnesiac protagonist, Atomfall is much more narrative-driven, with players carving their own path through Northern England and ideally trying to escape the quarantine. They can trust everyone or no one, venture on a pacifist path, or go on a rampage, killing anything (even important non-playable characters).\n\nThe choice is really up to you,and there are various narrative branches to pursue, multiple endings to unlock, and wildly varying playtime depending on how deeply you wish to explore. And thankfully, there's a well-designed, solidly-connected world linking it all together.",
        "id": 2341976,
        "language": null,
        "link": "https://www.youtube.com/watch?v=gAF2V6RxYds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gAF2V6RxYds/hqdefault.jpg",
        "title": "Atomfall's World Is Mysterious, Inviting, And Downright Addictive To Explore",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T09:30:19+00:00",
        "description": "Assassin’s Creed Shadows’ long awaited release continues to draw closer, and yet details on the game also keep coming in thick and fast- including quite a few that we haven’t spoken of in our coverage of the game, which is saying something, because we’ve covered it extensively, to put it mildly. \n\nBut the developer continues to build up the open world action RPG’s hype by sharing a steady stream of new tidbits and glimpses at its combat, stealth, progression, open world, side activities, and more. As we cross the days off in the lead up to Assassin’s Creed Shadows’ launch, here, we are going to go over a few more details that you should know about it.",
        "id": 2339516,
        "language": null,
        "link": "https://www.youtube.com/watch?v=l5tP_LvOxkE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/l5tP_LvOxkE/hqdefault.jpg",
        "title": "Assassin’s Creed Shadows - 10 NEW DETAILS You Need To Know Before You Pick It Up",
        "vote": 0
    }
]