[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T23:19:52+00:00",
        "description": "Google's parent company Alphabet is reportedly in talks to acquire cybersecurity startup Wiz for approximately $30 billion. Last July, negotiations had advanced on a $23 billion deal, but the talks were put on hold to prioritize Wiz's IPO. Around the same time, Alphabet also walked away from a potential acquisition of online marketing software company HubSpot. Reuters reports: The startup provides cloud-based cybersecurity solutions powered by artificial intelligence that help companies identify and remove critical risks on cloud platforms. A buyout of this size will most likely face regulatory scrutiny as tech giants are kept under close watch for possible monopolistic practices.\n \nIf the deal goes through, it could help Alphabet tap into the cybersecurity industry and expand its booming cloud infrastructure segment, which generated more than $43 billion in revenue last year. Wiz was last valued at $12 billion in a private funding round in May 2024.<p><div class=\"share_submission\" s",
        "id": 2345402,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/17/215231/alphabet-back-in-talks-to-buy-wiz-for-30-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Alphabet Back In Talks To Buy Wiz For $30 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T22:14:42+00:00",
        "description": "GIMP 3.0 has been released after over a decade of development. Highlights include a refined GTK3 interface with scroll wheel tab navigation, a new splash screen, improved HiDPI icon support, enhanced color management, a stable public API, and support for more file formats. 9to5Linux reports: GIMP 3.0 also brings improvements to non-destructive editing by introducing an optional \"Merge Filters\" checkbox at the bottom of NDE filters that merges down the filter immediately after it's committed, along with non-destructive filters on layer groups and the implementation of storing version of filters in GIMP's XCF project files. Among other noteworthy changes, the GEGL and babl components have been updated with new features and many improvements, such as Inner Glow, Bevel, and GEGL Styles filters, some plugins saw small enhancements, and it's now possible to export images with different settings while leaving the original image unchanged.\n \nThere's also a new PDB call that allows Script-Fu ",
        "id": 2344981,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/17/1948219/gimp-30-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "GIMP 3.0 Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T21:11:31+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Last week, Google expanded access to its Gemini 2.0 Flash model's image generation feature, which lets the model natively generate and edit image content. It's a powerful capability, by all accounts. But it also appears to have few guardrails. Gemini 2.0 Flash will uncomplainingly create images depicting celebrities and copyrighted characters, and -- as alluded to earlier -- remove watermarks from existing photos.\n \nAs several X and Reddit users noted, Gemini 2.0 Flash won't just remove watermarks, but will also attempt to fill in any gaps created by a watermark's deletion. Other AI-powered tools do this, too, but Gemini 2.0 Flash seems to be exceptionally skilled at it -- and free to use. To be clear, Gemini 2.0 Flash's image generation feature is labeled as \"experimental\" and \"not for production use\" at the moment, and is only available in Google's developer-facing tools like AI Studio. The model also isn't a perfect watermark re",
        "id": 2344610,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/17/1939254/people-are-using-googles-new-ai-model-to-remove-watermarks-from-images?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "People Are Using Google's New AI Model To Remove Watermarks From Images",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T21:11:31+00:00",
        "description": "Most mobile apps fail to reach $1,000 in monthly revenue within their first two years, according to a new report from RevenueCat examining data from over 75,000 mobile apps. Across all categories, only about 20% of apps achieve the $1,000 threshold, while just 5% reach $10,000 monthly. \n\nIn 2025, the top 5% of apps generate 500 times more revenue than the remaining 95% -- up from 200 times in 2024. After one year, elite performers in gaming, photo and video, health and fitness, and social categories exceed $5,000 monthly, while those in the 25th percentile earn a meager $5-20 per month. The report also highlights North American developers' heavy iOS dependence, with 76.1% making over 80% of their revenue from Apple's platform. Subscription retention presents another challenge, with barely 10% of monthly subscribers staying beyond the first year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sobering+Revenue+Stats+",
        "id": 2344609,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/17/1946256/sobering-revenue-stats-of-70k-mobile-apps-show-why-devs-beg-for-subscriptions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sobering Revenue Stats of 70K Mobile Apps Show Why Devs Beg For Subscriptions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T20:03:31+00:00",
        "description": "Huawei will no longer be able to produce or sell Windows-based PCs as Microsoft's supply license to the Chinese tech company expires this month, according to Chinese tech site MyDrivers. The restriction comes as Huawei remains on the U.S. Department of Commerce's Entity List, requiring American companies to obtain special export licenses to conduct business with the firm. \n\nRichard Yu, executive director of Huawei's consumer business unit, said the company is preparing to pivot to alternative operating systems. Huawei had previously announced plans to abandon Windows for future PC generations. The Chinese tech giant will introduce a new \"AI PC\" laptop in April running its own Kunpeng CPU and HarmonyOS, alongside a MateBook D16 Linux Edition, its first Linux-based laptop.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Huawei+To+Pivot+To+Linux%2C+HarmonyOS+as+Microsoft+Windows+License+Expires%3A+https%3A%2F%2Ftech.sl",
        "id": 2344161,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/17/183209/huawei-to-pivot-to-linux-harmonyos-as-microsoft-windows-license-expires?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Huawei To Pivot To Linux, HarmonyOS as Microsoft Windows License Expires",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T18:58:14+00:00",
        "description": "Harvard University on Monday announced that tuition will be free for students from families with annual incomes of $200,000 or less starting in the 2025-26 academic year. From a report: \"Putting Harvard within financial reach for more individuals widens the array of backgrounds, experiences, and perspectives that all of our students encounter, fostering their intellectual and personal growth,\" Harvard University President Alan M. Garber said in a statement. \"By bringing people of outstanding promise together to learn with and from one another, we truly realize the tremendous potential of the University.\" \n\nThe new plan will enable about 86% of U.S. families to qualify for Harvard financial aid and expand the Ivy League college's commitment to providing all undergrads the resources they need to enroll and graduate, according to Garber.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Harvard+Says+Tuition+Will+Be+Free+",
        "id": 2343665,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/17/1740242/harvard-says-tuition-will-be-free-for-families-making-200k-or-less?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Harvard Says Tuition Will Be Free For Families Making $200K or Less",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T18:58:14+00:00",
        "description": "An anonymous reader shares a report: Xbox 360 modders have discovered a new way to get homebrew apps and games running on the console. A new software-only exploit known as BadUpdate allows you to use a USB key to hack past Microsoft's Hypervisor protections and run unsigned code and games. \n\nModern Vintage Gamer has tested BadUpdate and found that you don't even have to open up your Xbox 360 console to get it running. Unlike the RGH or JTAG exploits for the Xbox 360, this BadUpdate method just requires a USB key. If you have the time and patience to get this running successfully, you'll be able to run the Xbox 360 homebrew store which includes games, apps, emulators, utilities, and even custom dashboards.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Xbox+360+Consoles+Can+Now+Be+Hacked+With+Just+a+USB+Key%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F03%2F17%2F1747227%2F%3Futm_source%3Dtwitter%26utm_medium%3D",
        "id": 2343664,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/17/1747227/xbox-360-consoles-can-now-be-hacked-with-just-a-usb-key?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Xbox 360 Consoles Can Now Be Hacked With Just a USB Key",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T17:53:50+00:00",
        "description": "Alphabet is spinning out Taara, a laser-based internet company from its X \"moonshot\" incubator, securing backing from Series X Capital while retaining a minority stake. \n\nTaara's technology transmits data at 20 gigabits per second over 20km by firing pencil-width light beams between traffic light-sized terminals, extending traditional fiber-optic networks with minimal construction costs. \n\nBased in Sunnyvale, California, the company operates in 12 countries, including India and parts of Africa, where it created a 5km laser link over the Congo River between Brazzaville and Kinshasa. The two-dozen-strong team partners with telecommunications firms like Bharti Airtel and T-Mobile to extend core fiber-optic networks to remote locations or dense urban areas. \n\nTaara originated from Project Loon, which was shut down in 2021 after facing regulatory challenges. The company is developing silicon photonic chips to replace mirrors and lenses in its terminals and potentially enable multiple conn",
        "id": 2343101,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/17/0723230/alphabet-spins-off-laser-based-internet-project-taara-from-moonshot-unit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Alphabet Spins Off Laser-Based Internet Project Taara From 'Moonshot' Unit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T16:47:56+00:00",
        "description": "More than 80 signatories representing about 100 European tech organizations have urged EU leaders to take \"radical action\" to reduce reliance on foreign digital infrastructure, according to a letter sent to European Commission President Ursula von der Leyen. \n\nThe coalition, including Airbus, Proton, and OVHCloud, warns Europe \"will lose out on digital innovation\" and become almost completely dependent on non-European technologies \"in less than three years at current rates.\" \n\nThe group calls for public procurement requirements mandating European-made tech solutions, development of common standards, and creation of a \"Sovereign Infrastructure Fund\" for capital-intensive areas like chips and quantum computing. \"Our reliance on non-European technologies will become almost complete in less than three years at current rates,\" the letter states, citing concerns over U.S. technological dominance following recent comments from Vice President JD Vance criticizing European regulations.<p><div",
        "id": 2342571,
        "language": null,
        "link": "https://slashdot.org/story/25/03/17/0628241/european-tech-firms-push-eu-for-buy-european-tech-mandate?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "European Tech Firms Push EU for 'Buy European' Tech Mandate",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T16:47:56+00:00",
        "description": "Across high-income countries, humans' ability to reason and solve problems appears to have peaked in the early 2010s and declined since. Despite no changes in fundamental brain biology, test scores for both teenagers and adults show deteriorating performance in reading, mathematics and science. In an eye-opening statistic, 25% of adults in high-income countries now struggle to \"use mathematical reasoning when reviewing statements\" -- rising to 35% in the US. \n\nThis cognitive decline coincides with a fundamental shift in our relationship with information. Americans reading books has fallen below 50%, while difficulty thinking and concentrating among 18-year-olds has climbed sharply since the mid-2010s. The timing points to our changing digital habits: a transition from finite web pages to infinite feeds, from active browsing to passive consumption, and from focused attention to constant context-switching. \n\nResearch shows that intentional use of digital technologies can be beneficial,",
        "id": 2342572,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/17/0954252/have-humans-passed-peak-brain-power?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Have Humans Passed Peak Brain Power?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T15:43:11+00:00",
        "description": "Prolonged exposure to extreme heat accelerates biological aging in older adults, increasing the risk of age-related illnesses, according to research published in Science Advances. \n\nIn a nationally representative study of 3,686 U.S. adults over age 56, scientists found that long-term exposure to high heat days was associated with accelerated epigenetic aging - molecular changes that affect how genes function without altering DNA itself. \n\nResearchers from the University of Southern California discovered that individuals living in areas where heat index values regularly exceed 90F showed signs of being biologically older than those in cooler regions, even after controlling for factors like wealth, education, and lifestyle habits. Six-year cumulative heat exposure linked to as much as 2.48 years of accelerated aging in one measurement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Heat+Can+Age+You+As+Much+As+Smoking",
        "id": 2341938,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/17/1435237/heat-can-age-you-as-much-as-smoking-a-new-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Heat Can Age You As Much As Smoking, a New Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T15:43:11+00:00",
        "description": "Abstract of a paper published on National Bureau of Economic Research: This paper investigates self-reported wedges between how much people work and how much they want to work, at their current wage. More than two-thirds of full-time workers in German survey data are overworked -- actual hours exceed desired hours. We combine this evidence with a simple model of labor supply to assess the welfare consequences of tighter weekly hours limits via willingness-to-pay calculations. According to counterfactuals, the optimal length of the workweek in Germany is 37 hours. Introducing such a cap would raise welfare by .8-1.6% of GDP. The gains from a shortened workweek are largest for workers who are married, female, white collar, middle aged, and high income. An extended analysis integrates a non-constant wage-hours relationship, falling capital returns, and a shrinking tax base.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?stat",
        "id": 2341937,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/17/0749239/should-friday-be-the-new-saturday?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Should Friday be the New Saturday?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T14:38:23+00:00",
        "description": "HR software provider Rippling has sued competitor Deel for allegedly planting a spy in its Dublin office to steal trade secrets, court documents [PDF] showed on Monday. Rippling claims the employee, identified as D.S., systematically searched internal Slack channels for competitor information, including sales leads and pitch decks. \n\nThe company discovered the alleged scheme through a \"honeypot\" trap -- a specially created Slack channel mentioned in a letter to Deel executives. When served with a court order to surrender his phone, D.S. locked himself in a bathroom before fleeing, according to the lawsuit. \"We're all for healthy competition, but we won't tolerate when a competitor breaks the law,\" said Vanessa Wu, Rippling's general counsel. Both companies operate multibillion-dollar HR platforms, with Rippling valued at $13.5 billion and Deel at over $12 billion.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=HR+T",
        "id": 2341351,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/17/146214/hr-tech-firm-rippling-sues-rival-deel-for-corporate-espionage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "HR Tech Firm Rippling Sues Rival Deel for Corporate Espionage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T12:27:48+00:00",
        "description": "This week the Free Software Foundation published memorabilia items for an online silent auction &mdash; part of their big 40th anniversary celebration. \"Starting March 17, the FSF will unlock items each day for bidding on the LibrePlanet wiki at 12:00 EDT.. Bidding on all items will conclude at 15:00 EDT on March 21, 2025... \n\n\"During the auction, the FSF welcomes everyone who supports user freedom to bid on historical and symbolic free software memorabilia,\" they annouced this week:\n\nThe auction is split into two parts: a silent auction hosted on the LibrePlanet wiki from March 17 through March 21 and a live auction held on the FSF's Gal&egrave;ne videoconferencing server on March 23 from 14:00-17:00. The auction is only the opening act to a months-long itinerary celebrating forty years of free software activism... \n\nExecutive director Zo&euml; Kooyman adds: \"These items are valuable pieces of FSF history, and some of them are emblematic of the free software movement. We want to ent",
        "id": 2340337,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/17/0012207/fsfs-memorabilia-silent-auction-begins-today?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FSF's Memorabilia Silent Auction Begins Today",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T08:07:45+00:00",
        "description": "An anonymous reader shared this article from TechCrunch:\n\n\nSocial network Bluesky recently published a proposal on GitHub outlining new options it could give users to indicate whether they want their posts and data to be scraped for things like generative AI training and public archiving. \n\nCEO Jay Graber discussed the proposal earlier this week, while on-stage at South by Southwest, but it attracted fresh attention on Friday night, after she posted about it on Bluesky. Some users reacted with alarm to the company's plans, which they saw as a reversal of Bluesky's previous insistence that it won't sell user data to advertisers and won't train AI on user posts.... Graber replied that generative AI companies are \"already scraping public data from across the web,\" including from Bluesky, since \"everything on Bluesky is public like a website is public.\" So she said Bluesky is trying to create a \"new standard\" to govern that scraping, similar to the robots.txt file that websites use to co",
        "id": 2338900,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/17/0434237/bluesky-proposes-new-standard-for-when-scraping-data-for-ai-training?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "BlueSky Proposes 'New Standard' for When Scraping Data for AI Training",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T03:47:27+00:00",
        "description": "Google collaborated with Imperial College London and its \"Fleming Initiative\" partnership with Imperial NHS, giving their scientists \"access to a powerful new AI designed\" built with Gemini 2.0 \"to make research faster and more efficient,\" according to an announcement from the school. And the results were surprising... \n\n\n\"Jos&eacute; Penad&eacute;s and his colleagues at Imperial College London spent 10 years figuring out how some superbugs gain resistance to antibiotics,\" writes LiveScience. \"But when the team gave Google's 'co-scientist'' &mdash; an AI tool designed to collaborate with researchers &mdash; this question in a short prompt, the AI's response produced the same answer as their then-unpublished findings in just two days.\"\n\nAstonished, Penad&eacute;s emailed Google to check if they had access to his research. The company responded that it didn't. The researchers published their findings [about working with Google's AI] Feb. 19 on the preprint server bioRxiv... \n\n\"What our",
        "id": 2338057,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/17/039241/googles-ai-co-scientist-solved-a-10-year-superbug-problem-in-two-days?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's AI 'Co-Scientist' Solved a 10-Year Superbug Problem in Two Days",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T02:42:15+00:00",
        "description": "Long-time Slashdot reader chicksdaddy writes:\nA group of U.S. consumer advocacy groups on Wednesday proposed legislation to address the growing epidemic of \"zombie\" Internet of Things (IoT) devices that have had software support cut off by their manufacturer, Fight To Repair News reports. \n\n\nThe Connected Consumer Product End of Life Disclosure Act is a collaboration between Consumer Reports, US PIRG, the Secure Resilient Future Foundation (SRFF) and the Center for Democracy and Technology. It requires manufacturers of connected consumer products to disclose for how long they will provide technical support, security updates, or bug fixes for the software and hardware that are necessary for the product to operate securely. \n\nThe groups proposed legal requirements that manufacturers \"must notify consumers when their devices are nearing the end of life and provide guidance on how to handle the device's end of life,\" while end-of-life notifications \"must include details about features th",
        "id": 2337874,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/17/0126204/consumer-groups-push-new-law-fighting-zombie-iot-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Consumer Groups Push New Law Fighting 'Zombie' IoT Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-17T00:33:05+00:00",
        "description": "Zillow CEO Jeremy Wacksman \"recently told Entrepreneur magazine that almost five years of remote work has 'been fantastic for us,'\" writes the Seattle Times.\n\n\nZillow shifted to allowing people to work fully remote during the pandemic. It's been a recruiting and retention tool for Zillow as they \"now see four times the number of job applicants for every job we have versus what we did before the pandemic,\" Wacksman said. \n\nWhile Zillow still lists its corporate headquarters as Seattle, the company bills itself as \"cloud-headquartered,\" with remote workers and satellite offices. Wacksman's comments are backed by serious real estate moves the company has made over the past five years. An annual report detailing Zillow's financial results for 2024 shows its Seattle headquarters and offices across the country are shrinking. In 2019, Zillow had 386,275 square feet of office space in Seattle after steadily gobbling up floors of the Russell Investments Center downtown over the prior five yea",
        "id": 2337458,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/16/2333228/remote-working-saved-zillow-money-helped-recruiting-and-maintained-productivity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Remote Working Saved Zillow Money, Helped Recruiting, and Maintained Productivity",
        "vote": 0
    }
]