[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T20:08:38.091961+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T19:00:24+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Aggressive Mastery explains how they leveraged Unreal Engine’s destruction system for Giantess Playground.\n\nThe game Giantess Playground, slated for release later this year, features a Godzilla-sized woman destroying a city as she walks through it. \n\nThis level of destruction naturally requires numerous physics simulations to run in real time. To prevent the game from choking the CPU in a struggle to keep up, developer Micah Berninghausen, CEO of Aggressive Mastery, created a plugin called Nanite Niagara to offload physics impacts to the GPU via Niagara, creating a hybrid CPU/GPU solution for physics.\n\nLearn how Berninghausen managed bottlenecks and increased the number of simulated fragments, and efficiently spawned particles and exported data from Niagara GPU systems in his work on Giantess Playground. \n\nThis session also covers topics like assessing the impact of volume and overhead via Unreal Insights, determining when and wher",
        "id": 4084851,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Rt0RPP0hUqs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Rt0RPP0hUqs/hqdefault.jpg",
        "title": "Speeding Up Destruction in Giantess Playground | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T17:06:23.535984+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T17:00:59+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Josh Benzing of 404 Creative takes you on an immersive journey into level design, tailored specifically for Fortnite creators, where he shares standard level design practices as well as expert advice from industry professionals.  \n\nWhether you're a seasoned builder or just getting started, this video will equip you with the tools and knowledge to create standout Fortnite experiences. \n\nThe session dives into the complete level design process, from concept to completion, exploring the purpose and importance of each step. Using a level Benzing built and documented exclusively for this session, he provides practical demonstrations, tips, and tricks, and showcases how to implement industry-standard practices within Fortnite. \n\nThe session also includes a high-level introduction to common Fortnite game types such as parkour, build modes, shooters, and adventure/horror. \n\nLearn how to design levels that work seamlessly for each game type",
        "id": 4083895,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VdwV1VdIKnI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VdwV1VdIKnI/hqdefault.jpg",
        "title": "Level up Your Level Design: Pro Tips for Fortnite Creators | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T16:05:55.774633+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T15:00:17+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Adam Kiraly of Tanglewood Games walks you through some ways you can utilize Unreal Engine’s tools to profile, debug, and optimize VFX in scenes with minimal content disruption. \n\nNiagara is used widely for all sorts of incidental and persistent effects from muzzle flashes to ambient dust; these systems on their own might not be expensive, but in a game world the cost can add up quickly, especially on platforms with fewer cores.\n\nThe presentation includes examples of real-world issues and solutions using profiling tools and frameworks provided by Epic, such as Effect Types, Effect Budgets, and the experimental Data Channels feature as well as system pooling.\n\nThe session also discusses when to use persistent systems vs. dynamically spawned ones, how to use scalability within Niagara, and how to set up pooling.\n\nFind out more about using Unreal Engine to create games here: unrealengine.com/uses/games\n\n#TanglewoodGames, #NiagaraVFX, #",
        "id": 4083556,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=71c5yv-XeY8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/71c5yv-XeY8/hqdefault.jpg",
        "title": "Optimizing Niagara: a Practical Approach to Performant Worlds | Unreal Fest Orlando 2025",
        "vote": 0
    }
]