[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T23:50:47.887045+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T23:41:00+00:00",
        "description": "An anonymous reader shared this report from CNBC:\n\n[T]he computing power of crypto mining generates a lot of\nheat, most which just ends up vented into the air. According to\ndigital assets brokerage, K33, the bitcoin mining industry generates about 100 TWh of heat annually &mdash; enough to heat all of\nFinland.This energy waste within a very energy-intense\nindustry is leading entrepreneurs to look for ways to repurpose\nthe heat for homes, offices, or other locations, especially in colder\nweather months. \n\nDuring a frigid snap earlier this year, The\nNew York Times reviewed HeatTrio, a $900 space heater that also\ndoubles as a bitcoin mining rig. Others use the heat from their own\nin-home cryptocurrency mining to spread warmth throughout their\nhouse. \"I've seen bitcoin rigs running quietly in attics, with\nthe heat they generate rerouted through the home's ventilation\nsystem to offset heating costs. It's a clever use of what would\notherwise be wasted energy,\" said Jill Ford, CEO of Bitford",
        "id": 4085912,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/16/2339215/some-americans-are-trying-to-heat-their-homes-with-bitcoin-mining",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some Americans Are Trying to Heat Their Homes With Bitcoin Mining",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T22:48:00.185136+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T22:10:00+00:00",
        "description": "From the Business Standard:\n\n\nApple has accelerated its succession plans as the company prepares for Chief Executive Tim Cook to potentially step down as early as next year, Financial Times reported. Apple's board and senior leaders have recently increased their focus on a smooth leadership transition after Cook's more than 14 years at the helm of the $4 trillion tech giant, the news report said. \n\nJohn Ternus, senior Vice-President of hardware engineering, is seen by many inside Apple as the top contender to become the next CEO. However, no final decision has been made yet. The leadership shift has been in the works for years and is not connected to its present performance, the news report said. Apple expects a strong year-end sales season, especially for the iPhone... Cook, who turned 65 this month, became Apple's CEO in 2011 after the passing of co-founder Steve Jobs. Under his leadership, Apple's market value has grown from around $350 billion in 2011 to $4 trillion today. Apple's",
        "id": 4085640,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/16/228215/apple-speeds-planning-for-replacing-ceo-tim-cook-next-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Speeds Planning for Replacing CEO Tim Cook Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T21:47:05.965420+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T20:47:00+00:00",
        "description": "An anonymous reader shared this report from the Guardian:\n\n\n\n\nThe number of deaths linked to superbugs that do not respond to frontline antibiotics increased by 17% in England last year, according to official figures that raise concerns about the ongoing increase in antimicrobial resistance. \n\nThe figures, released by the UK Health Security Agency, also revealed a large rise in private prescriptions for antibiotics, with 22% dispensed through the private sector in 2024. The increase in private prescribing is partly explained by the Pharmacy First scheme, a flagship policy of Rishi Sunak's government that allows patients to be prescribed antibiotics for common illnesses without seeing a GP, raising questions about whether the shift in prescribing patterns risks contributing to the rise in resistance. \n\"Antibiotic resistance is one of the greatest health threats we face,\" said the UKHSA's chief executive, Prof Susan Hopkins. \"More people than ever are acquiring infections that cannot be",
        "id": 4085352,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/16/2042254/deaths-linked-to-antibiotic-resistant-superbugs-rose-17-in-england-in-2024",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Deaths Linked to Antibiotic-Resistant Superbugs Rose 17% in England in 2024",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T19:32:31.140874+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T18:55:00+00:00",
        "description": "CNN profiled the non-profit Internet Archive today &mdash; and included this tidbit about how they archive parts of the internet that are now \"tucked in conversations with AI chatbots.\"\n\n\nThe rise of artificial intelligence and AI chatbots means the Internet Archive is changing how it records the history of the internet. In addition to web pages, the Internet Archive now captures AI-generated content, like ChatGPT answers and those summaries that appear at the top of Google search results.\n The Internet Archive team, which is made up of librarians and software engineers, are experimenting with ways to preserve how people get their news from chatbots by coming up with hundreds of questions and prompts each day based on the news, and recording both the queries and outputs, [says Wayback Machine Director Mark Graham]. \n\nIt sounds like a fun place to work...\n\n\nArchivists use bespoke machines to digitize books page by page, livestreaming their work on YouTube for all to see (alongside some",
        "id": 4084754,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/16/1852218/the-internet-archive-now-captures-ai-generated-content-including-googles-ai-overviews",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Internet Archive Now Captures AI-Generated Content (Including Google's AI Overviews)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T18:31:56.503813+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T17:34:00+00:00",
        "description": "Tech entrepreneur/blogger Anil Dash has been critical of AI browsers like ChatGPT Atlas. (He's written that Atlas \"substitutes its own AI-generated content for the web, but it looks like it's showing you the web,\" while its prompt-based/command-line interface resembles a clunky text adventure, and it's true purpose seems to be ingesting more training data.) \n\n\nAnd at the Mozilla Festival in Spain, \"Virtually everyone shared some version of what I'd articulated as the majority view on AI, which is approximately that LLMs can be interesting as a technology, but that Big Tech, and especially Big AI, are decidedly awful and people are very motivated to stop them from committing their worst harms upon the vulnerable.\" \n\nBut...\n\n\nAnother reality that people were a little more quiet in acknowledging, and sometimes reluctant to engage with out loud, is the reality that hundreds of millions of people are using the major AI tools every day... I don't know why today's Firefox users, even if they",
        "id": 4084431,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/15/2242238/could-firefox-be-the-browser-that-protects-the-privacy-of-ai-users",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could Firefox Be the Browser That Protects the Privacy of AI Users?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T17:31:23.255722+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T16:34:00+00:00",
        "description": "Residential utility bills in America \"rose 6% on average nationwide in August compared with the same period in the previous year,\" reports CNBC, citing statistics from the U.S. Energy Information Administration:\n\nThe reasons for price increases are often complex and vary by region. But in at least three states with high concentrations of data centers, electric bills climbed much faster than the national average during that period. Prices, for example, surged by 13% in Virginia, 16% in Illinois and 12% in Ohio. \n\n\nThe tech companies and AI labs are building data centers that consume a gigawatt or more of electricity in some cases, equivalent to more than 800,000 homes, the size of a city essentially... \"The techlash is real,\" said Abraham Silverman, who served as general counsel for New Jersey's public utility board from 2019 until 2023 under outgoing Democratic Gov. Phil Murphy. \"Data centers aren't always great neighbors,\" said Silverman, now a researcher at Johns Hopkins University.",
        "id": 4084115,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/15/069251/are-data-centers-raising-americas-electricity-prices",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are Data Centers Raising America's Electricity Prices?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T16:30:46.160492+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T15:34:00+00:00",
        "description": "An anonymous reader shared this report from The Register:\n\n\nYet another supply chain attack has hit the npm registry in what Amazon describes as \"one of the largest package flooding incidents in open source registry history\" &mdash; but with a twist. Instead of injecting credential-stealing code or ransomware into the packages, this one is a token farming campaign. \n\nAmazon Inspector security researchers, using a new detection rule and AI assistance, originally spotted the suspicious npm packages in late October, and, by November 7, the team had flagged thousands. By November 12, they had uncovered more than 150,000 malicious packages across \"multiple\" developer accounts. These were all linked to a coordinated tea.xyz token farming campaign, we're told. This is a decentralized protocol designed to reward open-source developers for their contributions using the TEA token, a utility asset used within the tea ecosystem for incentives, staking, and governance. \n\nUnlike the spate of packag",
        "id": 4083767,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/16/0712239/security-researchers-spot-150000-function-less-npm-packages-in-automated-token-farming-scheme",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Security Researchers Spot 150,000 Function-less npm Packages in Automated 'Token Farming' Scheme",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T13:28:21.356541+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T12:34:00+00:00",
        "description": "An anonymous reader shared this report from Electrek:\n\n\nSolar and wind are growing fast enough to meet all new electricity demand worldwide for the first three quarters of 2025, according to new data from energy think tank Ember. \n\nThe group now expects fossil power to stay flat for the full year, marking the first time since the pandemic that fossil generation won't increase. Solar and wind aren't just expanding; they're outpacing global electricity demand itself. Solar generation jumped 498 TWh (+31%) compared to the same period last year, already topping all the solar power produced in 2024. Wind added another 137 TWh (+7.6%). Together, they supplied 635 TWh of new clean electricity, beating out the 603 TWh rise in global demand (+2.7%). That lifted solar and wind to 17.6% of global electricity in the first three quarters of the year, up from 15.2% year-over-year. That brought the total share of renewables in global electricity -solar, wind, hydro, bioenergy, and geothermal &mdash;",
        "id": 4082674,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/15/0633205/solar-and-wind-are-covering-all-new-power-demand-in-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Solar and Wind are Covering ALl New Power Demand in 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T09:26:40.016409+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T08:34:00+00:00",
        "description": "An anonymous reader shared this report from PC World:\n\n It won't whip the llama's ass, but Opera has added a Spotify visualizer to its latest iteration of its free Opera One browser. Known as Sonic, the visualizer will be part of Opera's Dynamic Themes, which use the WebGPU standard to employ a dynamic theme that runs in the background of the browser. It's essentially a shader, which uses your PC's graphics engine to generate the moving background. \n\n\nThe browser also comes with a music player, which is set to Spotify by default. Users will have an opportunity to upgrade to Spotify Premium as part of the browser upgrade, Opera said. Opera's Sonic theme... takes the Spotify input and transforms it into a dynamic background. \n\n\"As any old tech head knows, the original visualizer was found in Winamp, which would sync visualizations to the beat and flow of music being played,\" the article points out. \n\nAnd 27 years later, WinAmp arrived as an app in Apple's App Store and Google Play and i",
        "id": 4081560,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/16/0827245/holy-winamp-opera-puts-a-music-visualizer-inside-its-browser",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Holy Winamp! Opera Puts a Music Visualizer Inside Its Browser'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T07:25:14.908962+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T05:58:00+00:00",
        "description": "It's been trying to measure the popularity of programming languages since 2000 using metrics like the number of engineers, courses, and third-party vendors. And \"The November 2025 TIOBE Index brings another twist below Python's familiar lead,\" writes TechRepublic. \"C solidifies its position as runner-up, C++ and Java lose some ground, and C# moves sharply upward, narrowing the gap with Java to less than a percentage point...\" \n\n\nTIO CEO Paul Jansen said this month that \"Instead of Python, programming language C# is now the fastest rising language,\"\n\nHow did C# achieve this? Java and C# are battling for a long time in the same areas. Right now it seems like C# has removed every reason why not to use C# instead of Java: it is cross platform nowadays, it is open source and it contains all new language features a developer wants. While the financial world is still dominated by Java, all other terrains show equal shares between Java and C#. Besides this, Microsoft is going strong and C# is",
        "id": 4081154,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/16/0516224/could-c-overtake-java-in-tiobes-programming-language-popularity-rankings",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could C# Overtake Java in TIOBE's Programming Language Popularity Rankings?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T04:22:00.469036+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T03:58:00+00:00",
        "description": "Slashdot reader spatwei writes: It is now more common for data to leave companies through copying and pasting than through file transfers and uploads, LayerX revealed in its Browser Security Report 2025. This shift is largely due to generative AI (genAI), with 77% of employees pasting data into AI prompts, and 32% of all copy-pastes from corporate accounts to non-corporate accounts occurring within genAI tools. 'Traditional governance built for email, file-sharing, and sanctioned SaaS didn't anticipate that copy/paste into a browser prompt would become the dominant leak vector,' LayerX CEO Or Eshed wrote in a blog post summarizing the report. \n\n\n\"GenAI now accounts for 11% of enterprise application usage,\" notes this article from SC World, \"with adoption rising faster than many data loss protection (DLP) controls can keep up. Overall, 45% of employees actively use AI tools, with 67% of these tools being accessed via personal accounts and ChatGPT making up 92% of all use...\" \n\n\n\"With t",
        "id": 4080626,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/16/0355217/copy-and-paste-now-exceeds-file-transferring-as-the-top-corporate-data-exfiltration-vector",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Copy-and-Paste Now Exceeds File Transferring as the Top Corporate Data Exfiltration Vector",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T02:20:45.064250+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T01:34:00+00:00",
        "description": "\"Google is going to court to help put an end to, or at least limit, the prevalence of phishing scams over text message,\" reports BGR:\n\n\nGoogle said it's bringing suit against Lighthouse, an impressively large operation that allegedly provides tools customers can buy to set up their own specialized phishing scams. All told, Google estimates that Lighthouse-affiliated scams in the U.S. have stolen anywhere between 12.7 million and 115 million credit cards. \"Bad actors built Lighthouse as a phishing-as-a-service kit to generate and deploy massive SMS phishing attacks,\" Google notes. \"These attacks exploit established brands like E-Z Pass to steal people's financial information.\" \n\nGoogle's legal action is comprehensive and is intent on completely dismantling Lighthouse's operations. The search giant is bringing claims under RICO, the Lanham Act, and the Computer Fraud and Abuse Act (CFAA). RICO, which often comes up in movies and television shows, allows authorities to treat Lighthouse's",
        "id": 4080313,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/16/0112236/google-begins-aggresively-using-the-law-to-stop-text-message-scams",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Begins Aggresively Using the Law To Stop Text Message Scams",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-16T01:20:10.788082+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-16T00:22:00+00:00",
        "description": "The dream of quantum computers has been hampered by the challenge of error correction, writes the Harvard Gazette, since qubits \"are inherently susceptible to slipping out of their quantum states and losing their encoded information.\" \n\nBut in a newly-published paper, a research team \"combined various methods to create complex circuits with dozens of error correction layers\" that \"suppresses errors below a critical threshold &mdash; the point where adding qubits further reduces errors rather than increasing them.\"\n\n\n\"For the first time, we combined all essential elements for a scalable, error-corrected quantum computation in an integrated architecture,\" said Mikhail Lukin, co-director of the Quantum Science and Engineering Initiative, Joshua and Beth Friedman University Professor, and senior author of the new paper. \"These experiments &mdash; by several measures the most advanced that have been done on any quantum platform to date &mdash; create the scientific foundation for practical",
        "id": 4080089,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/16/004220/a-quantum-error-correction-breakthrough",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Quantum Error Correction Breakthrough?",
        "vote": 0
    }
]