[
    {
        "age": null,
        "album": "",
        "author": "/u/Gay_For_Gary_Oldman",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T22:30:31.822718+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T22:04:39+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Before starting this novel, I knew very little about it. I have seen it called plotless, or about tennis, but not really about tennis. A campus novel. After reading Roadside Picnic, I saw it referred to as a book with dystopian scifi area. There are as many people say they cannot get past page 100, as say it is the best thing they&#39;ve ever read.</p> <p>My take? This is a book about obsession, compulsion, addiction, discipline, loneliness, and intelligence all in one, and their unifying interrelatedness. It is about how drug addiction, sports ambition, and patriotism are children of the same impulse. How entertainment and elitism are born from the same wellspring. That Ambition = Obsession = Addiction = Entertainment, and they all exist just to distract us from existential Boredom.</p> <p>I strongly disliked reading Gravity&#39;s Rainbow, but even in that distaste, I recognised the work of a hyper detail-oriented polymath, and the novel at least cul",
        "id": 3674184,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nredip/reading_infinite_jest_in_30_days_my_thoughts_on",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Reading Infinite Jest in 30 Days: my thoughts on The (Anti)Entertainment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/AyyDelta",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T17:23:52.431422+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T16:59:33+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I just finished Mayra by Nicky Gonzalez and really felt a connection with it. A big part of that is the main characters are from the same hometown as me, so it hit a lot of familiar notes.</p> <p>I was surprised to see the average rating sitting around 3.1. It made me wonder if some people didn&#39;t click with it because it didn&#39;t meet their expectations of where the story should go or what kind of book it should be. Perhaps some people were expecting it to lean more into horror?</p> <p>Has anyone else here read it? And if you grew up in Miami, did that change the way the book landed for you?</p> <p>Personally I was a big fan.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/AyyDelta\"> /u/AyyDelta </a> <br/> <span><a href=\"https://www.reddit.com/r/books/comments/1nr6q7v/mayra_by_nicky_gonzalez/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1nr6q7v/mayra_by_nicky_gonzalez/\">[c",
        "id": 3672247,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nr6q7v/mayra_by_nicky_gonzalez",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mayra by Nicky Gonzalez",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Hookton",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T17:23:52.174857+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T16:52:03+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not talking about your Watership Down death scenes or the dead wives scene in Bluebeard or the weird sex scene in IT when you read it far too young, but the more workaday scenes that broke your heart.</p> <p>The one that springs immediately to my mind and still makes me cry:</p> <p>In The Tree that Sat Down, where Mrs Rabbit gets swindled into spending all of her family&#39;s money on an imported box of Rien or Nicht.</p> <p>Or in one of Paul Jennings&#39; stories, an evil salesman is going round selling super-strength glue that&#39;ll hold anything. One of his customers/victims is a lonely old lady whose pride and joy is her collection of porcelain horses that she&#39;s been gifted over the years. Naturally, a day later, the shelf collapses and smashes all her horses. The final scene (iirc, I haven&#39;t read it since I was about 12) is her kneeling amongst all these shattered figures cradling the front leg of one that her father had given he",
        "id": 3672246,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nr6j9n/what_books_lowkey_traumatised_you_as_a_kid",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What books lowkey traumatised you as a kid?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/vinay1668",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T16:19:00.329041+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T15:31:37+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Before starting I had an idea that it&#39;s going to be a nice and clam read based on the bookcover. But I feel it is too calm. Nothing much really happens during the entireity of the book. I liked the idea of living in the bookshop and able to read a lot of books but I don&#39;t really like the rest of things that are happening.</p> <p>I beleive that any book that you read should make you uncomfortable with the ideas it presents or atleast question the things that are happening and make you feel disturbed a little. Or else what will be the point ?</p> <p>I know we read books because it feels good at that point but is that it? Because as long as I am reading this book I feel good, peaceful and I want to read more but after I completed it I don&#39;t feel anything. There is nothing to think or worry about this book </p> <p>Let me know what are your thoughts.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/vinay166",
        "id": 3671713,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nr4gah/just_read_days_at_the_morisaki_bookshop",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Just read \"Days at the Morisaki Bookshop\"",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/mustytomato",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T15:18:27.993503+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T14:36:06+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I had to DNF this book halfway because it simply never reeled me in. </p> <p>The premise borrows heavily from The Handmaid’s Tale which would be fine if it had anything more original than the 100 words a day to offer. </p> <p>None of the characters made me care about them in the slightest (except maybe Jackie - I’d read a book about her) and the anger of the protagonist felt almost fake in that it was often described but rarely shown. Also I have a very hard time imagining a 40-something doctor and advisor to the president constantly calling his wife “babe”. </p> <p>I’m sure there is something interesting with the whole “they planned the Wernicke’s leasions all along!” but I simply cannot be bothered to get to that point. Which is sad, because it could’ve been good. The description promised good, even though the ratings are lukewarm. </p> <p>All in all, a disappointing read that I will not give a second chance. </p> </div><!-- SC_ON --> &#32; submitte",
        "id": 3671216,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nr30ns/what_did_you_think_of_vox_by_christina_dalcher",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What did you think of Vox by Christina Dalcher?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Jarita12",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T13:10:59.161307+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T12:58:30+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I don´t even know where to start. It was a beautiful book. I read The Last Thing She Told Me by Linda Green last year and I really liked it but I loved this one more.</p> <p>It is such a &quot;simple&quot; story, yet very human. It is not overdone, it is not a thriller, it is not full of twists for the sake of having them. Yes, you are slowly getting to the &quot;one moment&quot; that brought all these people together and it keeps you invested but otherwise, it is a description of a few people who just live their lives and at one moment, they meet and help each other.</p> <p>Kaz is such a great character, whose struggle is real and honest and her relationship with Finn is beautiful and genuine. She is a naturally strong person because of life circumstances but never loses hope and rarely ever her optimism in the way that &quot;it will be OK&quot;. </p> <p>Even Finn´s dad, who we sort of see as a bit of a &quot;Bad guy&quot; because of his misunderstan",
        "id": 3670149,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nr0og4/one_moment_by_linda_green",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "One Moment by Linda Green",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Erisanne",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T11:17:52.323899+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T11:08:32+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>ChatGPT defines classic literature as having:</p> <ul> <li><p>Timeless themes – It explores ideas like love, identity, power, morality, or human struggle that are still relevant long after the book was written.</p></li> <li><p>Literary quality – The writing is distinctive, skillful, or innovative in style, language, or structure.</p></li> <li><p>Cultural or historical influence – It has shaped, reflected, or challenged society, often influencing later writers, thinkers, or even politics.</p></li> <li><p>Enduring readership – People keep reading and discussing it for decades or centuries, not just when it was first published.</p></li> <li><p>Universal appeal – Even though it may come from a specific culture or era, readers from different backgrounds can still connect with it.</p></li> </ul> <p>Looking at these criterias, Harry Potter seems to meet 4 of 5 points. However, I&#39;m not sure if it would be considered as &quot;literature&quot;. I know in th",
        "id": 3669653,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nqygy2/which_modern_contemporary_books_will_be",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Which modern, contemporary books will be considered as \"Classic Literature\" 500 years in the future, and taught in schools?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/AutoModerator",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T10:17:23.184388+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T10:00:33+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to our weekly recommendation thread! A few years ago now the mod team decided to condense the many &quot;suggest some books&quot; threads into one big mega-thread, in order to consolidate the subreddit and diversify the front page a little. Since then, we have removed suggestion threads and directed their posters to this thread instead. This tradition continues, so let&#39;s jump right in!</p> <p><strong>The Rules</strong></p> <ul> <li><p>Every comment in reply to this self-post must be a request for suggestions.</p></li> <li><p>All suggestions made in this thread must be direct replies to other people&#39;s requests. Do not post suggestions in reply to this self-post.</p></li> <li><p>All unrelated comments will be deleted in the interest of cleanliness.</p></li> </ul> <hr/> <p><strong>How to get the best recommendations</strong></p> <p>The most successful recommendation requests include a description of the kind of book being sought. This mig",
        "id": 3669259,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nqxb6o/weekly_recommendation_thread_september_26_2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Weekly Recommendation Thread: September 26, 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Zehreelakomdareturns",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-26T07:39:55.892498+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-26T06:50:10+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Just finished reading Matt Haig’s <em>The Midnight Library</em>(2020), which builds on a compelling idea: In a realm between life and death, a woman who committed suicide, explores alternate versions of her life, each reflecting choices she might have made differently. The premise taps into a universal feeling of regret and offers a comforting thought experiment about letting go of the “what ifs.”</p> <p>The initial chapters leading up to the suicide do a great job conveying the disorienting isolation, shame and hoplessness the protagonist feels (should definitely come with a trigger warning.) For people who struggle with regrets, its message, that different choices would not necessarily lead to better outcomes, can feel cathartic. Overall the novel is accessible, digestible and uplifting. </p> <p>That said the story itself is predictable and repetitive with clunky writing in places. The ending is obvious as soon as the plot opens up and in the pursui",
        "id": 3668384,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nque6v/the_midnight_library_by_matt_haig_a_review",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Midnight Library by Matt Haig, a review.",
        "vote": 0
    }
]