[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T23:57:52.457013+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T23:20:00+00:00",
        "description": "An anonymous reader quotes a report from InsideEVs: On Monday morning, I spoke to a Volvo EX90 owner who reported a litany of issues with her 2025 EX90: malfunctioning phone-as-a-key functionality, a useless keyfob, a keycard that rarely worked quickly, constant phone connection issues, infotainment glitches and error messages. I was surprised not because I hadn't heard of these kinds of problems, but because I experienced them myself over a year ago at the EX90 first drive again. At the time, Volvo said software fixes were imminent. Today, we know the issues go deeper. To solve them, Volvo announced on Tuesday that it will replace the central computer of every 2025 EX90 with the new one from the 2026 EX90. It's a tacit admission that the company can't solve the EX90's issues while simultaneously launching its next-generation software-defined vehicles, and that it's easier to replace the original computer than to build bug-free software for it. But for some, the damage to the Volvo br",
        "id": 3649603,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/23/2139249/why-volvo-is-replacing-every-ex90s-central-computer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Volvo Is Replacing Every EX90's Central Computer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T22:51:52.117700+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T22:40:00+00:00",
        "description": "MLB has approved the use of robot umpires in the 2026 season. According to ESPN, the system will give teams two challenges per game for balls and strikes where hitters, pitchers, and catchers can request reviews. From the report: Hitters, pitchers and catchers will be the only ones allowed to trigger the system by tapping their head, and if a challenge is successful -- the pitch will be shown on in-stadium videoboards -- teams will retain it. While the vote in favor of the automated ball-strike challenge system was not unanimous -- some of the four players on the 11-man committee voted no, according to sources -- the vote was a fait accompli, with MLB owners all in favor and in possession of a six-seat majority on the committee.\n \nThe ABS system uses similar technology to the line-calling system in tennis, with 12 cameras in each ballpark tracking the ball with a margin of error around one-sixth of an inch. The ABS zone will be a two-dimensional plane in the middle of the plate that s",
        "id": 3649230,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/23/2131259/mlb-approves-robot-umps-in-2026-for-challenges?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MLB Approves Robot Umps In 2026 For Challenges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T22:51:52.288593+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T22:00:00+00:00",
        "description": "YouTube's parent company, Alphabet, said it will reinstate creators previously banned for spreading COVID-19 misinformation and false election claims, citing free expression and shifting policy guidelines. The Hill reports: \"Reflecting the Company's commitment to free expression, YouTube will provide an opportunity for all creators to rejoin the platform if the Company terminated their channels for repeated violations of COVID-19 and elections integrity policies that are no longer in effect,\" the company said in a letter to Rep. Jim Jordan (R-Ohio), chair of the House Judiciary Committee. \"YouTube values conservative voices on its platform and recognizes that these creators have extensive reach and play an important role in civic discourse. The Company recognizes these creators are among those shaping today's online consumption, landing 'must-watch' interviews, giving viewers the chance to hear directly from politicians, celebrities, business leaders, and more,\" it added in the five-p",
        "id": 3649231,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/23/2123257/youtube-reinstating-creators-banned-for-covid-19-election-content?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Reinstating Creators Banned For COVID-19, Election Content",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T21:46:53.626361+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T21:20:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: While many vibe-coding startups have become unicorns, with valuations in the billions, one area where AI-assisted coding has not yet taken off is on mobile devices. Despite the numerous apps now available that offer vibe-coding tools on mobile platforms, none are gaining noticeable downloads, and few are generating any revenue at all. According to an analysis of global app store trends by the app intelligence provider Appfigures, only a small handful of mobile apps offering vibe-coding tools have seen any downloads, let alone generated revenue.\n \nThe largest of these is Instance: AI App Builder, which has seen only 16,000 downloads and $1,000 in consumer spending. The next largest app, Vibe Studio, has pulled in just 4,000 downloads but has made no money. This situation could still change, of course. The market is young, and vibe-coding apps continue to improve and work out the bugs. New apps in this space are arriving all the time,",
        "id": 3648868,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/23/2115212/dedicated-mobile-apps-for-vibe-coding-have-so-far-failed-to-gain-traction?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dedicated Mobile Apps For Vibe Coding Have So Far Failed To Gain Traction",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T20:36:53.326753+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T20:02:00+00:00",
        "description": "An analysis of a literature database finds that text-generating AI tools -- including ChatGPT and Gemini -- can be used to rewrite scientific papers and produce 'copycat' versions that are then passed off as new research. Nature: In a preprint posted on medRxiv on 12 September, researchers identified more than 400 such papers published in 112 journals over the past 4.5 years, and demonstrated that AI-generated biomedicine studies could evade publishers' anti-plagiarism checks. \n\nThe study's authors warn that individuals and paper mills -- companies that produce fake papers to order and sell authorships -- might be exploiting publicly available health data sets and using large language models (LLMs) to mass-produce low-quality papers that lack scientific value. \n\n\"If left unaddressed, this AI-based approach can be applied to all sorts of open-access databases, generating far more papers than anyone can imagine,\" says Csaba Szabo, a pharmacologist at the University of Fribourg in Switze",
        "id": 3648363,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/23/1825258/journals-infiltrated-with-copycat-papers-that-can-be-written-by-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Journals Infiltrated With 'Copycat' Papers That Can Be Written By AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T19:27:42.411999+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T19:21:00+00:00",
        "description": "Microsoft has successfully tested a microfluidic cooling system that removed heat up to three times better than cold plates currently used in datacenters. The technology etches tiny channels directly into silicon chips, allowing cooling liquid to flow directly onto the heat source. In lab tests announced September 23, 2025, the system reduced the maximum temperature rise inside GPUs by 65%. The channels, roughly the width of human hair, were optimized using AI to create bio-inspired patterns resembling leaf veins. \n\nMicrosoft collaborated with Swiss startup Corintis on the design. The cooling fluid can operate at temperatures as high as 70C (158F) while maintaining effectiveness. The company demonstrated the technology on servers running Microsoft Teams services, where the improved cooling enables overclocking during demand spikes that occur when meetings start on the hour and half-hour. Microsoft is investigating incorporating microfluidics into future generations of its first-party ",
        "id": 3647838,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/23/1758250/microsoft-brings-microfluidics-to-datacenter-cooling-with-3x-performance-gain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Brings Microfluidics To Datacenter Cooling With 3X Performance Gain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T19:27:42.520443+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T18:41:00+00:00",
        "description": "Pope Leo XIV declined to authorize an AI avatar that would have provided virtual papal audiences to Catholics worldwide. The first American pontiff rejected the proposal during an interview with papal biographer Elise Allen. \"Someone recently asked authorization to create an artificial me so that anybody could sign onto this website and have a personal audience with 'the Pope,'\" he said. \"This artificial intelligence Pope would give them answers to their questions, and I said, 'I'm not going to authorize that.'\" \n\nThe Pope expressed broader concerns about AI's societal impact. He warned that automation could leave only a few people able to live meaningful lives while others merely survive. These concerns influenced his papal name choice, taking inspiration from Pope Leo XIII, who authored Rerum novarum addressing workers' rights during the Industrial Revolution. Leo XIV maintained he isn't opposed to technological innovation but believes links between faith, humanity, and science must",
        "id": 3647839,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/23/1748209/pope-leo-xiv-rejects-ai-avatar-for-virtual-papal-audiences?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pope Leo XIV Rejects AI Avatar for Virtual Papal Audiences",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T18:16:54.969294+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T18:02:00+00:00",
        "description": "Nearly a quarter of workers aged 18-34 fear they'll lose their jobs to AI within two years, according to a Deutsche Bank survey of 10,000 people across the US and major European economies. The survey, conducted from June through August, found 24% of younger respondents scored their concern at 8 or above on a 10-point scale, compared to just 10% among workers 55 and older. Workers anticipate growing AI risk over time. 22% expressed high concern over a five-year horizon versus 18% for the two-year timeframe, the bank wrote in a report, reviewed by Slashdot. \n\nAmericans show greater concern than Europeans across all time periods, scoring roughly five percentage points higher. The survey also revealed major differences in AI adoption patterns. The US leads workplace adoption at 56%, while Spain shows the highest home adoption at 68% over three months. Germany and the UK demonstrate contrasting behaviors -- both countries report similar home usage above 50%, but workplace adoption differs ",
        "id": 3647182,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/23/1729234/quarter-of-workers-under-35-expect-ai-to-take-their-jobs-within-two-years-deutsche-bank-survey-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Quarter of Workers Under 35 Expect AI To Take Their Jobs Within Two Years, Deutsche Bank Survey Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T18:16:55.100056+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T17:22:00+00:00",
        "description": "Abstract of a paper on pre-print server Arxiv: Elites disproportionately influence policymaking, yet little is known about their fairness and efficiency preferences -- key determinants of support for redistributive policies. We investigate these preferences in an incentivized lab experiment with a group of future elites -- Ivy League MBA students. We find that MBA students implement substantially more unequal earnings distributions than the average American, regardless of whether inequality stems from luck or merit. Their redistributive choices are also highly responsive to efficiency costs, with an effect that is an order of magnitude larger than that found in representative U.S. samples. Analyzing fairness ideals, we find that MBA students are less likely to be strict meritocrats than the broader population. These findings provide novel insights into how elites' redistributive preferences may shape high levels of inequality in the U.S.<p><div class=\"share_submission\" style=\"position",
        "id": 3647183,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/23/1719228/are-elites-meritocratic-and-efficiency-seeking-evidence-from-mba-students?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are Elites Meritocratic and Efficiency-Seeking? Evidence from MBA Students",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:13.645637+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T16:48:00+00:00",
        "description": "Customs and Border Protection collected DNA from nearly 2,000 US citizens between 2020 and 2024 and sent the samples to the FBI's CODIS crime database, according to Georgetown Law's Center on Privacy &amp; Technology analysis of newly released government data. The collection included approximately 95 minors, some as young as 14, and travelers never charged with crimes. \n\nCongress never authorized DNA collection from citizens, children or civil detainees. DHS has contributed 2.6 million profiles to CODIS since 2020, with 97% collected under civil rather than criminal authority. The expansion followed a 2020 Justice Department rule that revoked DHS's waiver from DNA collection requirements. Former FBI director Christopher Wray testified in 2023 that monthly DNA submissions jumped from a few thousand to 92,000, creating a backlog of 650,000 unprocessed kits. Georgetown researchers project DHS could account for one-third of CODIS by 2034. The DHS Inspector General found in 2021 that the d",
        "id": 3646464,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/23/1648213/dhs-has-been-collecting-us-citizens-dna-for-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DHS Has Been Collecting US Citizens' DNA for Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:13.918584+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T16:05:00+00:00",
        "description": "An anonymous reader shares a report: Battered by funding cuts, bombarded by the White House and braced for demographic changes set to send enrollment into a nosedive, America's colleges and universities have spent this year in flux. But one of higher education's rituals resurfaced again on Tuesday, when U.S. News &amp; World Report published the college rankings that many administrators obsessively track and routinely malign. And, at least in the judgment of U.S. News, all of the headline-making upheaval has so far led to ... well, a lot of stability. \n\nPrinceton University, the Massachusetts Institute of Technology and Harvard University retained the top three spots in the publisher's rankings of national universities. Stanford University kept its place at No. 4, though Yale University also joined it there. Williams College remained U.S. News's pick for the best national liberal arts college, just as Spelman College was again the top-ranked historically Black institution. In one nota",
        "id": 3646465,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/23/166206/us-news-rankings-are-out-after-a-tumultuous-year-for-colleges?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "U.S. News Rankings Are Out After a Tumultuous Year for Colleges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:14.185008+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T15:20:00+00:00",
        "description": "mrspoonsi writes: The US Secret Service says it has dismantled a network of more than 300 SIM servers and 100,000 SIM cards in the New York area that were capable of crippling telecom systems. \n\nThe devices were \"concentrated within 35 miles of the global meeting of the UN General Assembly now under way in New York City\" and an investigation has been launched, it adds in a press statement. \n\nThe Secret Service says the dangers posed included \"disabling cell phone towers, enabling denial of services attacks, and facilitating anonymous, encrypted communication between potential threat actors and criminal enterprises.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Secret+Service+'Dismantles+Telecommunications+Threat'%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F23%2F1441229%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" hr",
        "id": 3646466,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/23/1441229/us-secret-service-dismantles-telecommunications-threat?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Secret Service 'Dismantles Telecommunications Threat'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:14.414151+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T14:40:00+00:00",
        "description": "40% of U.S. employees have received \"workslop\" -- AI-generated content that appears polished but lacks substance -- in the past month, according to research from BetterUp Labs and Stanford Social Media Lab. The survey of 1,150 full-time workers found recipients spend an average of one hour and 56 minutes addressing each incident of workslop, costing organizations an estimated $186 per employee monthly. For a 10,000-person company, lost productivity totals over $9 million annually. \n\nProfessional services and technology sectors are disproportionately affected. Workers report that 15.4% of received content qualifies as workslop. The phenomenon occurs primarily between peers at 40%, though 18% flows from direct reports to managers and 16% moves down the hierarchy. Beyond financial costs, workslop damages workplace relationships -- half of recipients view senders as less creative, capable, and reliable, while 42% see them as less trustworthy.<p><div class=\"share_submission\" style=\"positio",
        "id": 3646467,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/23/092205/ai-generated-workslop-is-destroying-productivity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI-Generated 'Workslop' Is Destroying Productivity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:14.549189+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T14:00:00+00:00",
        "description": "AI companies like OpenAI have been quick to unveil plans for spending hundreds of billions of dollars on data centers, but they have been slower to show how they will pull in revenue to cover all those expenses. Now, the consulting firm Bain &amp; Co. is estimating the shortfall could be far larger than previously understood. Bloomberg: By 2030, AI companies will need $2 trillion in combined annual revenue to fund the computing power needed to meet projected demand, Bain said in its annual Global Technology Report released Tuesday. Yet their revenue is likely to fall $800 billion short of that mark as efforts to monetize services like ChatGPT trail the spending requirements for data centers and related infrastructure, Bain predicted. \n\nThe report is set to raise further questions about the AI industry's valuations and business model. The increasing popularity of services such as OpenAI's ChatGPT and Google's Gemini, as well as AI efforts by companies across the planet, means demand fo",
        "id": 3646468,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/23/0733235/an-800-billion-revenue-shortfall-threatens-ai-future-bain-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "An $800 Billion Revenue Shortfall Threatens AI Future, Bain Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:14.665846+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: MediaTek is launching a mobile processor more capable of handling agentic AI tasks on devices, positioning to better compete with Qualcomm. The new Dimensity 9500 will provide users with better summaries of calls and meetings, improved output from AI models and superior 4K photos, the Taiwanese company said in a statement. The chip is made using an advanced 3-nanometer process by Taiwan Semiconductor Manufacturing Co., according to MediaTek, and handsets carrying the new chip will become available in the fourth quarter.\n \nXiaomi is set to launch its latest handset range powered by Qualcomm's newest Snapdragon processor later this week, and the Chinese smartphone maker is aiming to benchmark its upcoming devices against Apple Inc.'s iPhone 17. MediaTek's processor, meanwhile, is expected to give Xiaomi's rivals including Vivo a boost in the premium segment. [...] Separately, the Taiwanese company is preparing to place chip orders for ",
        "id": 3646469,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/23/0434209/mediatek-launches-improved-ai-processor-to-compete-with-qualcomm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MediaTek Launches Improved AI Processor To Compete With Qualcomm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:14.790094+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T10:00:00+00:00",
        "description": "alternative_right shares a report from ScienceDaily: Scientists have developed a new multi-layered metalens design that could revolutionize portable optics in devices like phones, drones, and satellites. By stacking metamaterial layers instead of relying on a single one, the team overcame fundamental limits in focusing multiple wavelengths of light. Their algorithm-driven approach produced intricate nanostructures shaped like clovers, propellers, and squares, enabling improved performance, scalability, and polarization independence. [...] Mr Joshua Jordaan, from the Research School of Physics at the Australian National University and the ARC Centre of Excellence for Transformative Meta-Optical Systems (TMOS), said the ability to make metalenses to collect a lot of light will be a boon for future portable imaging systems. \"The metalenses we have designed would be ideal for drones or earth-observation satellites, as we've tried to make them as small and light as possible,\" he said. The ",
        "id": 3646470,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/23/0441203/tiny-new-lenses-smaller-than-a-hair-could-transform-phone-and-drone-cameras?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tiny New Lenses, Smaller Than a Hair, Could Transform Phone and Drone Cameras",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:14.903017+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T07:00:00+00:00",
        "description": "NASA has unveiled 10 new astronaut candidates drawn from over 8,000 applicants. The diverse group includes four men and six women -- pilots, scientists, and medical professionals -- who will train for future missions to the ISS, the moon, and eventually Mars. CBS News reports: This is NASA's first astronaut class with more women than men. It includes six pilots with experience in high-performance aircraft, a biomedical engineer, an anesthesiologist, a geologist and a former SpaceX launch director. Among the new astronaut candidates is 39-year-old Anna Menon, a mother of two who flew to orbit in 2024 aboard a SpaceX Crew Dragon as a private astronaut on a commercial, non-NASA flight. [...]\n \nThe other members of the 2025 astronaut class are:\n- Army Chief Warrant Officer 3 Ben Bailey, 38, a graduate of the Naval Test Pilot School with more than 2,000 hours flying more than 30 different aircraft, including recent work with UH-60 Black Hawk and CH-47F Chinook helicopters.\n- Lauren Edgar, ",
        "id": 3646471,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/23/0428201/nasa-introduces-10-new-astronaut-candidates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Introduces 10 New Astronaut Candidates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:59:15.014772+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: A new dark web portal to recruit spies for the UK was launched last Friday (19th September), as the UK steps up its commitment to national security. Harnessing the anonymity of the dark web for the first time, MI6's new secure messaging platform -- Silent Courier -- enables anyone, anywhere in the world with access to sensitive information relating to terrorism or hostile intelligence activity to securely contact the UK and offer their services. Instructions on how to access the portal will be publicly available on MI6's verified YouTube channel as the UK reaches out to potential new agents in Russia and around the world. MI6 advises individuals accessing its portal to use trustworthy VPNs and devices not linked to themselves, to mitigate risks which exist in some countries.\n \nThe announcement was made by the outgoing Chief of MI6, Sir Richard Moore, in Istanbul where he stated that the platform will make it easier for MI6 to recruit a",
        "id": 3646472,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/22/2317237/mi6-launches-dark-web-portal-to-attract-spies-in-russia?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MI6 Launches Dark Web Portal To Attract Spies In Russia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T01:53:41.346163+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T01:10:00+00:00",
        "description": "Longtime Slashdot reader hackingbear writes: The Chinese People's Liberation Army Navy (PLAN) has demonstrated its ability to launch and recover aircraft from its first electromagnetic catapult-equipped aircraft carrier, the CNS Fujian. Official imagery released by the PLAN today confirms that the new J-35 naval stealth fighters, KJ-600 airborne early warning and control aircraft, and J-15T fighter jet are carrying out carrier trials. Ben Lewis, a co-founder of PLATracker, told USNI News that the test was a \"significant milestone\" for the Chinese military's carrier program. \"Once operational, the PLAN will have the capacity to field fifth-generation stealth carrier aircraft, supported by fixed-wing carrier-based airborne early warning and command aircraft, across the first island chain and Western Pacific Ocean,\" Lewis said.\n \nElectromagnetic catapults offer several advantages, not least the fact that they can be more finely tuned to very different aircraft types, including ones that ",
        "id": 3641031,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/22/239219/china-launches-stealth-jet-from-electromagnetic-catapult-aircraft-carrier?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Launches Stealth Jet From Electromagnetic Catapult Aircraft Carrier",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T00:45:39.887550+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T00:30:00+00:00",
        "description": "The Supreme Court has temporarily allowed President Trump to fire Rebecca Slaughter, the last Democrat on the FTC. \"The court's action is technically temporary, since the justices said they will hear arguments in the case in December, but every indication is that the conservative court majority will use the case to reverse a major Supreme Court precedent that dates back almost a century,\" reports NPR. From the report: Congress created the FTC and lots of other agencies to be multi-member, bipartisan regulatory agencies. And the Supreme Court in 1935 upheld those statutes ruling ruled against then-President Franklin D. Roosevelt's claim that he could fire FTC commissioners at will. In a unanimous opinion at the time, the court said Congress acted within its powers in declaring that a commissioner could only be fired for misconduct -- not for a policy disagreement. But now, prodded by President Trump, the court's six-member conservative majority seems poised to remake the way independen",
        "id": 3640759,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/22/233257/supreme-court-allows-trump-to-fire-remaining-democrat-on-ftc?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Supreme Court Allows Trump to Fire Remaining Democrat On FTC",
        "vote": 0
    }
]