[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T16:27:44.672445+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T15:30:22+00:00",
        "description": "Deep Rock Galactic is a co-op shooter well-known for not only its excellent gameplay and atmosphere, but also its generally-unique take on the co-op shooter genre. Deep Rock Galactic: Survivor is a spin-off that is trying to bring the same vibes to the genre that was made famous by Vampire Survivors. \n\nPutting you in the mining boots of a dwarf, you’re tasked with fighting off alien flora and fauna as you mine the planet for precious minerals. Generally speaking, Deep Rock Galactic: Survivor is an excellent game that is only really let down by the fact that it doesn’t bring over its older sibling’s co-op gameplay. \n\nThe second-to-second gameplay is a lot of fun, and there are plenty of levels to dig through as you unlock all of the classes and their sub-classes. Along with this, the meta progression systems also unlock at a steady pace without feeling too frustrating.",
        "id": 3646200,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=bb7wQewzyJs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bb7wQewzyJs/hqdefault.jpg",
        "title": "Deep Rock Galactic: Survivor Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T14:00:05.999420+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T13:30:58+00:00",
        "description": "Aiden's adventures in Villedor had many Dying Light fans thrilled to have a new face take the center stage in the franchise's meta-narrative. But Kyle Crane's return in Dying Light: The Beast has been nothing short of extraordinary, with the franchise's OG protagonist managing to bring a new set of skills and a very dark, personal tale of revenge to the table this time around.\n\nBut is The Beast objectively better than Dying Light 2? That's the question we try to answer with this one. You might be surprised by a few of our opinions, while some others are sure to have you grinning at your screen in agreement. Either way, dive in and check out what we have to say about this very unique match up.",
        "id": 3644765,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=n2DvuE3N9x0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/n2DvuE3N9x0/hqdefault.jpg",
        "title": "Does Dying Light: The Beast DESTROY Dying Light 2: Stay Human?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-23T11:41:16.537435+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-23T10:45:01+00:00",
        "description": "The Silent Hill franchise needs no introduction to a gamer who has seen a few generations of consoles go by. Even younger audiences could be quite familiar with its unique brand of psychological horror thanks to The Bloober Team's excellent remake of Silent Hill 2. However, some installments in the franchise's long history are simply better than the others, despite each of them bringing something good to the table.\n\nWe take a look at all of the games that the franchise has given to us, ranking them from the worst to the best in an attempt to examine where each one succeeded while others failed in the lead up to Silent Hill f, which could very well be the one that rules them all if NeoBard and Konami manage to deliver on expectations.",
        "id": 3643710,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Agqa3yjh-so",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Agqa3yjh-so/hqdefault.jpg",
        "title": "All The Silent Hill Games Ranked From WORST TO BEST",
        "vote": 0
    }
]