[
    {
        "age": null,
        "album": "",
        "author": "Magia Natury",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T09:45:34.891283+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T09:01:30+00:00",
        "description": "Oto bezsprzecznie najbardziej jadowity wąż świata - jego przeciętne ukąszenie wstrzykuje ofierze 44 mg bardzo silnie toksycznego jadu. Dawka ta może zabić 220 tys. mysz. Bywa jednak, że największe osobniki aplikują większą dawkę, która może zabić pół miliona mysz lub 100 dorosłych ludzi. A zatem wąż ten dysponuje bronią, której jeden wystrzał, przynajmniej teoretycznie jest tak silny, że zdolny jest zabić kilka plutonów żołnierzy, grupę słoni, czy całą masę, setki, a nawet setki tysięcy mniejszych zwierząt. \n\nTo tajpan pustynny - siła jego jadu mogłaby wskazywać, że żywi się on bardzo dużymi zwierzętami, które trudno jest powalić - pojedyncza dawka jego jadu, gdyby została wprowadzona do krwioobiegu, prawdopodobnie zabiła by triceratopsa, czy nawet tyranozaura, a tymczasem wąż też żywi się niedużymi gryzoniami, głównie, szybkimi i zwinnymi szczurami długowłosymi. Z czego zatem wynika ta rozrzutność natury? Po co tajpanowi tak silny jad? Co ciekawe, wiele gatunków węży dysponuje jadem,",
        "id": 3398964,
        "language": "pl",
        "link": "https://www.youtube.com/watch?v=w8A2wUfLXlw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 461,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfDX69pxC4q6yKSaugs196g",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/w8A2wUfLXlw/hqdefault.jpg",
        "title": "Może Zabić 100 ludzi! - TAJPAN - Po Co Mu Tak Silny JAD?",
        "vote": 0
    }
]