[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T22:42:51.973363+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T22:34:00+00:00",
        "description": "The U.S. government's 10% stake in Intel \"is a mistake,\" writes the Washington Post's editorial board, calling Intel \"an aging also-ran in critical markets\" that \"has spent recent years stumbling on execution and missing one strategic opportunity after another.\" \n\nBut TechCrunch points out that the U.S. government \"does not appear to be committing new funds. Instead, it's simply making good on what Intel described as 'grants previously awarded, but not yet paid, to Intel.'\"\n\nSpecifically, the $8.9 billion is supposed to come from $5.7 billion awarded-but-not-paid to Intel under the Biden administration's CHIPS Act, as well as $3.2 billion also awarded by the Biden administration through the Secure Enclave program. In a post on his social network Truth Social, Trump wrote, \"The United States paid nothing for these shares...\" Trump has been critical of the CHIPS Act, calling it a \"horrible, horrible thing\" and calling on House Speaker Mike Johnson to \"get rid\" of it... \n\nAccording to Th",
        "id": 3402822,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/23/1851227/intels-new-funding-came-from-already-awarded-grants-so-what-happens-next?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel's New Funding Came From Already-Awarded Grants. So What Happens Next?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T21:38:40.610404+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T21:34:00+00:00",
        "description": "Last weekend New Zealand experienced an hour-long air traffic control failure that disrupted flights, leaving five plans circling and four others unable to take off, according to Radio New Zealand. \n\nThe country's sole air traffic service provider, Airways, now says it was caused by a software glitch when flight data was unable to be transferred between systems:\n[Airways chief executive James Young told Morning Report] \"We noticed that was not occurring as it should and as a result of that our air traffic controllers took measures to manage traffic, either by holding on the ground or in an air hold.\" Airways operated a modern air traffic control system that involved back up systems but Young said they were not instantaneous and it took time to validate flight information data. \n\n\"At no point did we lose control of all aircraft. We were able to communicate with all aircraft and we had line of sight of all aircraft,\" Young said. He said flights in the New Zealand air space were held, pu",
        "id": 3402568,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/23/046230/new-zealand-air-traffic-control-failure-likely-caused-by-data-transfer-issue?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Zealand Air Traffic Control Failure Likely Caused By Data Transfer Issue",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T21:38:40.790079+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T20:34:00+00:00",
        "description": "\"Only a tiny fraction of the more than 7,000 languages on Earth are supported by artificial intelligence models,\" reported SiliconANGLE this week. So Nvidia announced \"a massive new AI-ready dataset and models to support the development of high-quality AI translation for European languages.\"\n\n\n\nThe new dataset, named Granary, is a massive open-source corpus of multilingual audio, including more than a million hours of audio, plus 650,000 hours of speech recognition and 350,000 hours of speech translation. Nvidia's speech AI team collaborated with researchers from Carnegie Mellon University and Fondazione Bruno Kessler to process unlabeled audio and public speech data into information usable for AI training... Granary includes 25 European languages, representing nearly all of the European Union's 24 official languages, plus Russian and Ukrainian. The dataset also contains languages with limited available data, such as Croatian, Estonian and Maltese. This is critically important because",
        "id": 3402569,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/23/1731237/nvidia-release-massive-ai-ready-open-european-language-dataset-and-tools?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Release Massive AI-Ready Open European Language Dataset and Tools",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T20:32:47.302974+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T19:34:00+00:00",
        "description": "\"James Cameron has a confession: he can't write Terminator 7...\" according to the Guardian, \"because reality keeps nicking his plotlines.\"\n\n\n\"I'm at a point right now where I have a hard time writing science-fiction,\" Cameron told CNN this week. \"I'm tasked with writing a new Terminator story [but] I don't know what to say that won't be overtaken by real events. We are living in a science-fiction age right now....\" \n\nWhat Cameron should be looking for is a complete system reboot to reinvigorate the saga in the way Prey brought fans back to Predator and Alien: Romulus restored interest in slimy Xenomorphs. All evidence suggests that the 70-year-old film-maker is far more interested in the current challenges surrounding AI, superintelligences and humankind's constant efforts to destroy itself, which doesn't exactly lend itself to the sort of back-to-basics, relentless-monsters-hunt-a-few-unlucky-humans-for-two-hours approach that has worked elsewhere.\nThe challenge here seems to be to f",
        "id": 3402249,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/08/23/0318236/james-cameron-struggles-with-real-world-horrors-for-terminator-7-and-new-hiroshima-movie?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "James Cameron Struggles With Real-World Horrors for 'Terminator 7' and New Hiroshima Movie",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T19:15:48.118155+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T18:34:00+00:00",
        "description": "Threads now has more than 400 million monthly active users. But who are these people who are actually using Threads, asks Mashable? And what is their cultural footprint?\n\n\n\nThreads is the Big Bang Theory of social media. Bland, boring, largely unoffensive, and somehow, it was the most popular show on television for years... At any given time, \"Twitter\" and \"X\" are searched somewhere between 12 and 30 times more than \"Threads\" on Google, according to the search engine's Trends data. Threads is a popular platform without much of an identity... \n\n[Threads] is consistently good at one thing users really want from a social media platform: for their posts to be seen and engaged with. Threads might be boring in comparison to its competitors, but its users say it might be the only place on the internet right now where they don't feel they are screaming into the void.... Much like TikTok, you don't actually have to have thousands of followers to find decent engagement on the app. One user, com",
        "id": 3401940,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/23/0554228/threads-has-400-million-monthly-users-but-who-are-they?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Threads Has 400 Million Monthly Users.  But Who Are They?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T18:10:43.544127+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T17:34:00+00:00",
        "description": "The Free Software Foundation announced a special photography contest honoring its 40th anniversary:\n\nThe technology we use every day has changed dramatically since our founding nearly forty years ago, including the way we interact with it... We're incredibly grateful for the countless hours that developers and users have put into the free software programs that exist today. Without all the people who cared enough to make and use software that respects the four freedoms four decades or even a year ago, we wouldn't have much to celebrate. \n\nWe want to honor the hard work that has gone into free software and its development with the FSF40 Photo Contest. Starting on August 14, 2025, we're inviting free software supporters worldwide to share how they use free software on a daily basis. While we can think of hundreds of ways that free software can be used, there's almost certainly many of you who have thought of much more creative ways to involve libre software every day! \n\nShortly after th",
        "id": 3401612,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/23/0436210/fsf-announces-photo-contest-honoring-40-years-of-free-software?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FSF Announces Photo Contest Honoring 40 Years of Free Software",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T17:07:10.294473+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T16:34:00+00:00",
        "description": "\"Some joyless ne'er-do-well has loosed a botnet on the community-driven Arch Linux distro,\" reports the Register, with a distributed denial of service (DDoS) attack that apparently started a week ago. \n\nArch maintainer Cristian Heusel announced Thursday on the project's web site that the attack \"primarily impacts our main webpage, the Arch User Repository (AUR), and the Forums.\"\n\nWe are aware of the problems that this creates for our end users and will continue to actively work with our hosting provider to mitigate the attack. We are also evaluating DDoS protection providers while carefully considering factors including cost, security, and ethical standards... As a volunteer-driven project, we appreciate the community's patience as our DevOps team works to resolve these issues. \n\nA status update Friday acknowledged \"we are suffering from partial outages.\" The Register reports:\nThe attack comes as the project has been enjoying a boost in mainstream success. The distro was picked by Val",
        "id": 3401249,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/08/23/0513229/arch-linux-faces-ongoing-ddos-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Arch Linux Faces 'Ongoing' DDoS Attack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T16:01:51.343955+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T15:34:00+00:00",
        "description": "The Washington Post looks at the rise of low-effort, high-volume \"AI slop\" videos:\n\n The major social media platforms, scared of driving viewers away, have tried to crack down on slop accounts, using AI tools of their own to detect and flag videos they believe were synthetically made. YouTube last month said it would demonetize creators for \"inauthentic\" and \"mass-produced\" content. But the systems are imperfect, and the creators can easily spin up new accounts &mdash; or just push their AI tools to pump out videos similar to the banned ones, dodging attempts to snuff them out. \n\nOne place where they're coming from...\n\nJiaru Tang, a researcher at the Queensland University of Technology who recently interviewed creators in China, said AI video has become one of the hottest new income opportunities there for workers in the internet's underbelly, who previously made money writing fake news articles or running spam accounts. Many university students, stay-at-home moms and the recently une",
        "id": 3400887,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/23/022223/making-cash-off-ai-slop-the-surreal-video-business-taking-over-the-web?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Making Cash Off 'AI Slop': the Surreal Video Business Taking Over the Web",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T19:15:48.391405+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T14:34:00+00:00",
        "description": "British telecommunications service provider Colt Telecom \"has offices in over 30 countries across North America, Europe, and Asia, reports CPO magazine. \"It manages nearly 1,000 data centers and roughly 75,000 km of fiber infrastructure.\" \n\nBut now \"a cyber attack has caused widespread multi-day service disruption...\"\n\n\nOn August 14, 2025, the telecom giant said it had detected a cyber attack that began two days earlier, on August 12. Upon learning of the cyber intrusion, the telecommunications service provider responded by proactively taking some systems offline to contain the cyber attack. Although Colt Telecom's cyber incident response team was working around the clock to mitigate the impacts of the cyber attack, service disruption has persisted for days. However, the service disruption did not affect the company's core network infrastructure, suggesting that Colt customers could still access its network services... The company also did not provide a clear timeline for resolving th",
        "id": 3401941,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/23/0910226/amid-service-disruption-colt-confirms-criminal-group-accessed-their-data-as-ransomware-gang-threatens-to-sell-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amid Service Disruption, Colt Confirms 'Criminal Group' Accessed Their Data, As Ransomware Gang Threatens to Sell It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T14:56:05.117557+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T14:34:00+00:00",
        "description": "British telecommunications service provider Colt Telecom \"has offices in over 30 countries across North America, Europe, and Asia, reports CPO magazine. \"It manages nearly 1,000 data centers and roughly 75,000 km of fiber infrastructure.\" \n\nBut now \"a cyber attack has caused widespread multi-day service disruption...\"\n\n\nOn August 14, 2025, the telecom giant said it had detected a cyber attack that began two days earlier, on August 12. Upon learning of the cyber intrusion, the telecommunications service provider responded by proactively taking some systems offline to contain the cyber attack. Although Colt Telecom's cyber incident response team was working around the clock to mitigate the impacts of the cyber attack, service disruption has persisted for days. However, the service disruption did not affect the company's core network infrastructure, suggesting that Colt customers could still access its network services... The company also did not provide a clear timeline for resolving th",
        "id": 3400541,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/23/0910226/amid-service-disruption-colt-telecom-confirms-criminal-group-accessed-their-data-as-ransomware-gang-threatens-to-sell-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amid Service Disruption, Colt Telecom Confirms 'Criminal Group' Accessed Their Data, As Ransomware Gang Threatens to Sell It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T13:51:05.725136+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: There's an overwhelming sense of deja vu at multiplexes these days. In August alone, \"Black Swan\" (2010) is returning to theaters, along with the Tim Burton \"Batman\" movies from 1989 and 1992. Audiences will be able to revisit the oceanic terror of \"Jaws\" (1975), as well as the comic mystery (and multiple endings) of \"Clue\" (1985). Or they could groove to Prince's \"Sign o' the Times\" concert film from 1987. And it doesn't look like the rerelease trend is slowing down. In September, \"The Breakfast Club\" (1985) is returning, Pixar is bringing back \"Toy Story\" (1995), and \"Apollo 13\" (1995) is blasting off again. \"Casper\" (1995) will haunt screens for nearly the entire month of October, while \"Avatar: The Way of Water\" (2022) will run for about five days, teeing up the forthcoming \"Avatar: Fire and Ash.\" And there are still more to come before the end of the year.\n \nRereleases have long been part of the theatrical ecosystem. Af",
        "id": 3400168,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/08/23/0134245/hollywoods-newest-formula-for-success-rereleasing-old-movies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hollywood's Newest Formula For Success: Rereleasing Old Movies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T10:36:14.014861+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T10:00:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: LibreOffice 25.8 has landed, and while it packs in new features and speed improvements, the biggest headline is who just got left behind. If you are still running Windows 7 or Windows 8/8.1, this is the end of the road. LibreOffice will not run on those systems anymore, and there are no workarounds. The suite has slammed the door shut.\n \nFor years, LibreOffice kept older Windows users afloat while Microsoft and other developers moved on. That lifeline is gone. Anyone stubbornly clinging to Windows 7 or 8 now has two choices: upgrade or stay stuck on outdated software. LibreOffice has made it clear that it will not carry dead platforms any further. And the cuts do not stop there. 32-bit Windows builds are on their way out, with deprecation already in place. On the Mac side, 25.8 is the last release that runs on macOS 10.15. Starting with LibreOffice 26.2, only macOS 11 and newer will be supported. In other words, if your computer is too old ",
        "id": 3399227,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/23/0124202/libreoffice-258-slams-the-door-on-windows-7-and-8x?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LibreOffice 25.8 Slams the Door On Windows 7 and 8.x",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T07:21:00.544174+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T07:00:00+00:00",
        "description": "alternative_right shares a report from Phys.org: All the critical minerals the U.S. needs annually for energy, defense and technology applications are already being mined at existing U.S. facilities, according to a new analysis published in the journal Science. The catch? These minerals, such as cobalt, lithium, gallium and rare earth elements like neodymium and yttrium, are currently being discarded as tailings of other mineral streams like gold and zinc, said Elizabeth Holley, associate professor of mining engineering at Colorado School of Mines and lead author of the new paper.\n \nTo conduct the analysis, Holley and her team built a database of annual production from federally permitted metal mines in the U.S. They used a statistical resampling technique to pair these data with the geochemical concentrations of critical minerals in ores, recently compiled by the U.S. Geological Survey, Geoscience Australia and the Geologic Survey of Canada. Using this approach, Holley's team was abl",
        "id": 3398442,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/23/0120237/us-is-throwing-away-the-critical-minerals-it-needs-analysis-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Is Throwing Away the Critical Minerals It Needs, Analysis Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T04:05:47.262489+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T03:30:00+00:00",
        "description": "Google has released (PDF) a new analysis of its AI's environmental impact, showing that it has cut the energy use of AI text queries by a factor of 33 over the past year. Each prompt now consumes about 0.24 watt-hours -- the equivalent of watching nine seconds of TV. An anonymous reader shares an excerpt from an Ars Technica article: \"We estimate the median Gemini Apps text prompt uses 0.24 watt-hours of energy, emits 0.03 grams of carbon dioxide equivalent (gCO2e), and consumes 0.26 milliliters (or about five drops) of water,\" they conclude. To put that in context, they estimate that the energy use is similar to about nine seconds of TV viewing. The bad news is that the volume of requests is undoubtedly very high. The company has chosen to execute an AI operation with every single search request, a compute demand that simply didn't exist a couple of years ago. So, while the individual impact is small, the cumulative cost is likely to be considerable.\n \nThe good news? Just a year ago,",
        "id": 3397788,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/22/2118234/google-says-it-dropped-the-energy-cost-of-ai-queries-by-33x-in-one-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Says It Dropped the Energy Cost of AI Queries By 33x In One Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-23T00:50:48.678670+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-23T00:20:00+00:00",
        "description": "Bluesky has blocked access to its service in Mississippi rather than comply with a new state law requiring age verification for all social media users. TechCrunch reports: In a blog post published on Friday, the company explains that, as a small team, it doesn't have the resources to make the substantial technical changes this type of law would require, and it raised concerns about the law's broad scope and privacy implications. Mississippi's HB 1126 requires platforms to introduce age verification for all users before they can access social networks like Bluesky. On Thursday, U.S. Supreme Court justices decided to block an emergency appeal that would have prevented the law from going into effect as the legal challenges it faces played out in the courts. As a result, Bluesky had to decide what it would do about compliance.\n \nInstead of requiring age verification before users could access age-restricted content, this law requires age verification of all users. That means Bluesky would ",
        "id": 3397217,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/22/2327213/bluesky-blocks-service-in-mississippi-over-age-assurance-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bluesky Blocks Service In Mississippi Over Age Assurance Law",
        "vote": 0
    }
]