[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-01T21:05:32.542152+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-01T20:42:05+00:00",
        "description": "Today's links Apple faces criminal sanctions for defying App Store antitrust order: They lied to the judge, then covered it up, and now she's PISSED. Hey look at this: Delights to delectate. Object permanence: 2005, 2010, 2015, 2020, 2024 Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All the rest. Apple faces criminal sanctions for defying App Store antitrust order (permalink) Epic, makers of the wildly popular Fortnite video-game, have waged a one-company war against the \"app tax\" &#8211; the 15-30% rake that the mobile duopoly of Apple/Google take out of every penny we spend inside of apps. Epic's own digital practices are hardly spotless: just this year, the company was caught cheating players &#8211; many of them children &#8211; with deceptive practices and had to refund over $72m: https://www.ftc.gov/enforcement/refunds/fortnite-r",
        "id": 2577626,
        "language": "en-US",
        "link": "https://pluralistic.net/2025/05/01/its-not-the-crime",
        "manual_status_code": 0,
        "page_rating": 30,
        "page_rating_contents": 95,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 253,
        "source_url": "https://pluralistic.net/feed",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pluralistic: Apple faces criminal sanctions for defying App Store antitrust order (01 May 2025)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-01T01:33:47.189212+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-01T00:58:40+00:00",
        "description": "Today's links Republicans want to force students to pay off scam college loans: Incredibly, they've found a way to make student debt WORSE. Hey look at this: Delights to delectate. Object permanence: 2005, 2010, 2015, 2020, 2024 Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All the rest. Republicans want to force students to pay off scam college loans (permalink) House Republicans have a great plan to pay for Trump's tax-cuts for the rich: jacking up the cost of federal student loans, while eliminating protections for students who are scammed by fake universities: https://prospect.org/education/2025-04-30-republicans-education-upper-class-privilege-student-loans/ Every GOP legislator and especially Congressional committee chairs are scrambling to find cuts that can offset Trump's plans to make his 2017 tax cuts permanent and then add mo",
        "id": 2570404,
        "language": "en-US",
        "link": "https://pluralistic.net/2025/04/30/trump-u",
        "manual_status_code": 0,
        "page_rating": 30,
        "page_rating_contents": 95,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 253,
        "source_url": "https://pluralistic.net/feed",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pluralistic: Republicans want to force students to pay off scam college loans (30 Apr 2025)",
        "vote": 0
    }
]