[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-01T18:35:54.744610+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-01T18:00:09+00:00",
        "description": "When you think of Doom, two things come to mind: The old-school games with their immaculate pacing and high-octane shooting or the newer titles with glorious carnage and extensive mobility. The one thing that probably doesn't come to mind is Elden Ring, much less a campaign that draws many parallels to FromSoftware's classic.\n\nDOOM: The Dark Ages looks to be the exception, though, seemingly elevating the franchise beyond what its previous entries could offer. Not only is it delivering heavily requested features like piloting the Atlan mech, but it's expanding the level design into more sandbox-like environments. It's focusing more on close-range combat to match the Slayer's new tank-like playstyle.\n\nPerhaps most impressive is that it's giving the lore the attention it deserves with more extensive cinematics. How these will go down with diehard fans remains to be seen, but DOOM: The Dark Ages is a big step forward for the franchise and a marquee title to look out for when it launches o",
        "id": 2576425,
        "language": null,
        "link": "https://www.youtube.com/watch?v=AHCdIekrUuE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AHCdIekrUuE/hqdefault.jpg",
        "title": "Why DOOM: The Dark Ages Could Be id Software’s Elden Ring",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-01T14:15:58.251953+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-01T14:01:23+00:00",
        "description": "Though the main story is often nowhere close to the top of the list of priorities for many who play Elder Scrolls games, if that is how you have chosen to play the recently released Oblivion Remastered, there’s a good chance that, once you’ve hit credits, you’re going to be looking for more to do in Cyrodiil. \n\nThankfully, there’s no lack of things to appease you on that front. From guild questlines that legitimately stand out as some of the best and most captivating content on offer in the entire game to systems and mechanics that are begging to be explored more deeply, Oblivion Remastered offers up a bevy of things to keep you engaged long after you’ve finished the main story.",
        "id": 2574105,
        "language": null,
        "link": "https://www.youtube.com/watch?v=z0LBLd-w6fU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z0LBLd-w6fU/hqdefault.jpg",
        "title": "The Elder Scrolls 4: Oblivion Remastered - 10 Things To Do After FINISHING The Game",
        "vote": 0
    }
]