[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-01T18:47:37.088020+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-01T18:18:00+00:00",
        "description": "<p>The Python Software Foundation has had infrastructure hosted with the <a href=\"https://osuosl.org/\" target=\"_blank\">Oregon State University Open Source Lab (OSUOSL)</a> since 2012. For many years our core infrastructure was hosted there, and to this day the host our x86 benchmark server for CPython that feeds speed.python.org.</p><div>We are saddened to hear that The Open Source Lab at Oregon State University has reached a <a href=\"https://osuosl.org/blog/osl-future/\" target=\"_blank\">funding crisis point</a>, and want to send our heartfelt gratitude to Lance, the student employees, and teams of volunteers who have provided infrastructure to projects like us since their inception in 2004.</div>",
        "id": 2576607,
        "language": null,
        "link": "https://pyfound.blogspot.com/2025/05/a-thank-you-to-oregon-state-university.html",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 267,
        "source_url": "https://pyfound.blogspot.com/feeds/posts/default?alt=rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "A thank you to the Oregon State University Open Source Lab",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-01T14:27:41.414267+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-01T14:08:00+00:00",
        "description": "As the Python programming language continues to grow in popularity, our work here at PSF is also growing and evolving. To support our ongoing success, the Python Software Foundation (PSF) is promoting Loren Crary to Deputy Executive Director effective immediately. <br /><br />\"Loren Crary’s promotion to Deputy Executive Director is a testament to her outstanding contributions, both within and beyond her official scope as Director of Resource Development. Her leadership and dedication have been instrumental in advancing the Python Software Foundation’s mission, and her new role marks another fantastic step forward for our organization. The entire community benefits from her vision and expertise, and we are thrilled she has accepted this position.\" Dawn Wages, PSF Board Chair<br /><br />Crary’s work at the PSF has been exemplary and she is constantly widening the frame on the work that she does here. This promotion serves to formally recognize that Loren’s role here has expanded, and th",
        "id": 2574198,
        "language": null,
        "link": "https://pyfound.blogspot.com/2025/04/congrats-loren.html",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 267,
        "source_url": "https://pyfound.blogspot.com/feeds/posts/default?alt=rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Python Software Foundation Names New Deputy Executive Director",
        "vote": 0
    }
]