[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-27T21:00:15+00:00",
        "description": "The storied Japanese gangster series returns to the Hawaiian setting established in last year’s Like a Dragon: Infinite Wealth in what is sure to be the most bonkers Like a Dragon game yet. \n\nLike a Dragon: Pirate Yakuza in Hawaii features everyone’s favourite comedic villain Goro Majima, with him mysteriously washing up on shore with amnesia, his mission being to plunder as much treasure as he can hold. \n\nAs expected, there’s a wealth of entertainment awaiting Pirate Yakuza players, with this feature discussing ship-to-ship combat, Majima’s fighting styles, the oceanic Hawaiian setting, and the smorgasbord of side activity which has become a mainstay of the series. \n\nWill Pirate Yakuza in Hawaii’s comedic aesthetic lean too far away the series’ balanced melodrama? We’ll have to find out come Februrary 20th when this latest spinoff is released.",
        "id": 1987908,
        "language": null,
        "link": "https://www.youtube.com/watch?v=CDzvfwMnQ9E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CDzvfwMnQ9E/hqdefault.jpg",
        "title": "Why You ABSOLUTELY NEED TO PLAY Like A Dragon: Pirate Yakuza In Hawaii",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-27T16:00:47+00:00",
        "description": "On the surface, there's something undeniably cool about Tails of Iron 2: Whiskers of Winter. The grounded medieval depiction, the anthropomorphic creatures running around inflicting violence, and the stunning 2D art style - all scream, \"Must play!\" Top it off with a sick guitar solo or two by some Dark Wings.\n\nThe \"play\" part is where the problems arise. Initially somewhat clunky to control and with uneven difficulty, Tails of Iron 2's combat quickly becomes repetitive when its Monster Hunter-esque side hunts don't annoy, and its exploration doesn't invoke tedium. Some boss fights can be enjoyable and challenging, but they're just not enough.\n\nEven with Doug Cockle of The Witcher 3 fame providing voiceover narration, Odd Bug Studio's sequel also falters to capitalize on its epic revenge saga. It may appeal to the first game's fans, but Tails of Iron 2: Whiskers of Winter falls short of its potential, especially compared to other side-scrolling action-adventure titles.",
        "id": 1987909,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ljKwVInoKww",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/ljKwVInoKww/hqdefault.jpg",
        "title": "Tails of Iron 2: Whiskers of Winter Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-27T14:00:24+00:00",
        "description": "Sniper Elite: Resistance doesn't pull up any trees with anything that it does, but that has never been what this series has been about. Rebellion's World War 2 franchise has always been perfectly happy to leave the flash and pomp to others, instead delivering spectacular level design, emergent systems, compelling stealth, and tactical shooting time and time again. \n\nThat's exactly what its newest outing does. As a spinoff, Sniper Elite: Resistance obviously doesn't claim to make the sort of significant leaps forward that you would expect from a mainline numbered entry, but in building on the excellent bones of Sniper Elite 5, it nonetheless manages to craft an experience that fans of the stealth genre shouldn't miss.",
        "id": 1985364,
        "language": null,
        "link": "https://www.youtube.com/watch?v=PBJVyrzF_rk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PBJVyrzF_rk/hqdefault.jpg",
        "title": "Sniper Elite: Resistance Review - DON'T SIT ON THIS",
        "vote": 0
    }
]