[
    {
        "age": null,
        "album": "",
        "author": "/u/goat_rodeo_",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-05T20:16:32.382730+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-05T19:42:35+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I have used RSS for a long time to follow my favorite publishers and authors, but most readers have fallen short when I wanted to find more articles on a specific event or trending topic. I don&#39;t mean broad topics like technology, news, etc., but distinct news stories or headlines. Keyword filtering or search tools help here to some extent, but I really wanted something that can group articles by subject without any sort of manual tweaking. </p> <p>While many users of RSS are loath to reach for AI tools (with good reason), utilizing vector embeddings to conduct similarity searches seems quite useful. By generating an embedding for each new RSS item and searching for similar items that have already been ingested, we can easily find related articles and group them together, helping solve the issue mentioned in the first paragraph above. I&#39;ve added this to <a href=\"https://jesterengine.com\">https://jesterengine.com</a> as the &quot;Stories&quot; ",
        "id": 2859629,
        "language": null,
        "link": "https://www.reddit.com/r/rss/comments/1l48kl1/grouping_similar_rss_articles_using_vector",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 482,
        "source_url": "https://www.reddit.com/r/rss/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Grouping Similar RSS Articles Using Vector Embeddings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/iGotYourPistola",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-05T19:11:30.324972+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-05T18:39:25+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Just wanted to share something that&#39;s been game-changing for me. I&#39;ve replaced all my news apps, social feeds, and video subscriptions with RSS feeds. Sounds old school, but hear me out.</p> <p>No algorithms. No sponsored posts. Just chronological content from sources I actually want to read. I get everything from news to YouTube channels to blogs in one clean feed.</p> <p>Put together a <a href=\"https://starikov.co/rss-fieldguide/\">field guide</a> explaining how to set this up, plus a <a href=\"https://starikov.co/rss-starter-set/\">starter pack</a> of feeds I&#39;ve been curating for 10+ years.</p> <p>Been doing this for months now and honestly don&#39;t miss the chaos of traditional social media. Your brain gets used to consuming content intentionally instead of just doom-scrolling whatever the algorithm serves up. Anyone else using RSS like this? Feels like I&#39;m living in 2005 but somehow it&#39;s better than 2025.</p> </div><!-- SC_ON --",
        "id": 2859064,
        "language": null,
        "link": "https://www.reddit.com/r/rss/comments/1l46z8i/after_this_shitshow_at_so_many_social_media",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 482,
        "source_url": "https://www.reddit.com/r/rss/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After this shitshow at so many social media networks, I have turned RSS into my everything app replacing Twitter, Reddit, Instagram, and the like!",
        "vote": 0
    }
]