[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T23:32:49.328150+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T23:20:00+00:00",
        "description": "OpenAI's planned acquisition of Windsurf has fallen apart. Instead, Google is hiring Windsurf CEO Varun Mohan, cofounder Douglas Chen, and parts of its R&amp;D team to join DeepMind and focus on agentic coding for Gemini. Google will not acquire Windsurf but will receive a non-exclusive license to some of its technology, while Windsurf continues independently under new leadership. The Verge reports: Effective immediately, Jeff Wang, Windsurf's head of business, has become interim CEO, and Graham Moreno, its VP of global sales, will be Windsurf's new president. \"Gemini is one of the best models available and we've been investing in its advanced capabilities for developers,\" Chris Pappas, a spokesperson for Google, told The Verge in a statement. \"We're excited to welcome some top AI coding talent from Windsurf's team to Google DeepMind to advance our work in agentic coding.\"\n \n\"We are excited to be joining Google DeepMind along with some of the Windsurf team,\" Mohan and Chen said in a s",
        "id": 3145385,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/11/2246210/openais-windsurf-deal-is-off-windsurfs-ceo-is-going-to-google?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's Windsurf Deal Is Off, Windsurf's CEO Is Going To Google",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T23:32:49.514219+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T22:40:00+00:00",
        "description": "BYD has unveiled fully autonomous Level 4 self-parking across its vehicle lineup, powered by its advanced multi-sensor \"God's Eye\" system that's used by more than 1 million cars across China. \"The company is so confident in the technology that it announced that it will cover any damages to your car or any other vehicle if things go wrong,\" adds Fast Company. \"This means if anything happens, the owner won't have to file a claim and have their premiums go up.\" From the report: BYD's confidence stems from a sophisticated sensor architecture. The God's Eye system deploys multiple sensing technologies working in concert, unlike Tesla's problematic camera-only approach. Even the entry-level God's Eye C variant -- one of three autonomous driving levels included in most affordable models -- includes 12 cameras, 5 millimeter-wave radars, and 12 ultrasonic sensors with 1-centimeter accuracy. The mid-tier God's Eye B adds a lidar sensor, while the premium God's Eye A variant features three lidar",
        "id": 3145386,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/11/1930239/byd-pledges-to-cover-damages-from-self-parking-car-crashes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "BYD Pledges to Cover Damages from Self-Parking Car Crashes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T22:27:50.030536+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: For the second time in a year, Google has announced that it will render some of its past phones almost unusable with a software update, and users don't have any choice in the matter. After nerfing the Pixel 4a's battery capacity earlier this year, Google has now confirmed a similar update is rolling out to the Pixel 6a. The new July Android update adds \"battery management features\" that will make the phone unusable. Given the risks involved, Google had no choice but to act, but it could choose to take better care of its customers and use better components in the first place. Unfortunately, a lot more phones are about to end up in the trash. [...]\n \nPixel 4a units contained one of two different batteries, and only the one manufactured by a company called Lishen was downgraded. For the Pixel 6a, Google has decreed that the battery limits will be imposed when the cells hit 400 charge cycles. Beyond that, the risk of fire becomes too ",
        "id": 3145101,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/11/1921242/google-nerfs-second-pixel-phone-battery-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Nerfs Second Pixel Phone Battery This Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T22:27:50.211042+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T21:22:00+00:00",
        "description": "Apple added the 2013 \"Trash Can\" Mac Pro to its vintage products list alongside the 2019 13-inch MacBook Air, 2019 iMac, 2018 iPad Pro models, and the 128GB iPhone 8. The cylindrical Mac Pro remained on sale until December 2019, when Apple replaced it with the redesigned \"Cheese Grater\" model. \n\nProducts typically reach vintage status five years after their last distribution date. The 2013 Mac Pro's radical cylindrical design prevented internal component upgrades and created thermal limitations that Apple acknowledged in 2017. \"I think we designed ourselves into a bit of a thermal corner,\" Apple hardware chief Craig Federighi said at the time. \n\nApple also moved several AirPort devices to its obsolete list, including the second-generation AirPort Express and AirPort Time Capsules. The 2013 Mac Pro's radical design created thermal limitations that Apple acknowledged in 2017.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?st",
        "id": 3145102,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/07/11/1812202/apple-adds-2013-mac-pro-2019-macbook-air-airports-to-vintage-list?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Adds 2013 Mac Pro, 2019 MacBook Air, AirPorts To Vintage List",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T21:23:02.218378+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T20:40:00+00:00",
        "description": "The U.S. government has canceled a proposed $900 million project to study in unprecedented detail the afterglow of the Big Bang, the cosmic microwave background (CMB) radiation. Science magazine: Known as CMB-S4, the project envisioned new arrays of ultrasensitive microwave telescopes at the South Pole and in Chile's Atacama Desert. Their goal: to detect patterns in the ancient light that would prove the newborn universe expanded in an exponential growth spurt called cosmic inflation. \n\nThe project, which could have delivered smoking gun evidence for a key theory in cosmology, was supposed to be a joint venture between the National Science Foundation (NSF) and the Department of Energy (DOE). However, yesterday, the agencies sent an unsigned statement to the leaders of the collaboration saying the project is off. \"DOE and NSF have jointly decided that they can no longer support the CMB-S4 Project,\" it reads.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop",
        "id": 3144699,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/11/1750256/us-abandons-hunt-for-signal-of-cosmic-inflation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Abandons Hunt For Signal of Cosmic Inflation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T20:18:05.009468+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T20:00:00+00:00",
        "description": "An anonymous reader shares a report: This week has seen the shortest days of the year so far. According to data from the U.S. Naval Observatory and the International Earth Rotation and Reference Systems Service, Tuesday's rotation was about 1.34 milliseconds less than 24 hours. More quick spins are expected this week, later this month and in early August, according to predictions from the website Time and Date. \n\nThis isn't completely out of the ordinary: Our world's spins have been faster than usual lately. The average day has mostly shortened over the past decade, and within the past five years or so, the full rotation has clocked in at a hair less than 24 hours more often than not. Factors driving the change include movements at Earth's core, atmospheric changes and the moon's position. \n\nBut long-term trends do not suggest that the days will shorten in perpetuity. In fact, it is just the opposite. For many millenniums, the days have been growing longer. A Tyrannosaurus rex that li",
        "id": 3144286,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/11/1741218/earth-is-spinning-faster-and-days-are-getting-shorter-for-now?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Earth Is Spinning Faster and Days Are Getting Shorter, for Now",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T20:18:05.191316+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T19:20:00+00:00",
        "description": "Denmark's Parliament adopted a law in May raising the retirement age to 70 by 2040, up from the current 67, affecting anyone born after December 31, 1970. The country indexed its official retirement age to life expectancy in 2006 and revises it every five years, with the age set to increase to 68 in 2030 and 69 in 2035. \n\nFew Danes actually work until the legal retirement age -- in 2022, when the official age was 67, the actual average retirement age was around 64, according to the Organization for Economic Cooperation and Development. About 20% of Danish retirees leave work because they cannot find employment or are too sick to continue. The universal public pension currently provides 7,198 kroner ($1,130) per month, supplemented by mandatory and optional employer-funded pensions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Few+Danes+Work+Until+Official+Retirement+Age+as+Government+Pushes+It+to+70%3A+https%3A%2F",
        "id": 3144287,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/11/1734217/few-danes-work-until-official-retirement-age-as-government-pushes-it-to-70?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Few Danes Work Until Official Retirement Age as Government Pushes It to 70",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T19:10:22.308627+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T18:40:00+00:00",
        "description": "Four years of research following the 2021 western North American heat wave has revealed both the meteorological conditions that fuel extreme temperatures and evidence that heat has physical limits. The 2021 event \"shocked everyone, including specialists working on the subject. People were completely stunned,\" said Robin Noyelle, a postdoctoral researcher in climate science at ETH Zurich. \n\nScientists now focus on temperature departures from local averages rather than absolute readings. The most anomalously warm temperature was recorded in Antarctica, where temperatures rose 39C above average in March 2022. North Pole temperatures surged 20C higher than normal in February, reaching the melting point in winter. \n\nResearch has identified five key factors that enable extreme heat: cloudless skies, high pressure, dark surfaces, lower altitudes, and lack of water. \"Basically all of these conditions are met in Death Valley, but not in many other places in the world,\" said climate scientist F",
        "id": 3143878,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/11/1728246/how-hot-can-it-get-literally-scientists-weigh-in?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Hot Can It Get, Literally? Scientists Weigh In",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T18:06:33.828074+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T18:00:00+00:00",
        "description": "Warner Bros. releases a $225 million Superman reboot this week that executives consider the studio's final chance to build a successful cinematic universe rivaling Marvel's dominance. The film, written and directed by James Gunn, serves as the foundation for DC Studios' planned expansion into multiple films and television shows. \n\nWarner Bros. Discovery CEO David Zaslav appointed Gunn and producer Peter Safran to lead the newly unified DC Studios in 2022, ending decades of corporate infighting that prevented the company's superheroes from matching Marvel's success. The Disney-owned Marvel Cinematic Universe has generated $32 billion across 36 films since 2008. Warner executives want the movie to gross over $500 million globally, according to WSJ. If successful, this would mark the first year since 2008 that DC outperforms Marvel at the box office.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Saving+a+Studio%3F+Thi",
        "id": 3143375,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/07/11/1613249/saving-a-studio-this-looks-like-a-job-for-superman?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Saving a Studio? This Looks Like a Job for Superman!",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T18:06:34.010027+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T17:20:00+00:00",
        "description": "New submitter RJFerret shares a Belkin support page: After careful consideration, we have made the difficult decision to end technical support for older Wemo products, effective January 31, 2026. After this date, several Wemo products will no longer be controllable through the Wemo app. Any features that rely on cloud connectivity, including remote access and voice assistant integrations, will no longer work.' \n\nList of devices found in the link (four Thread based unaffected).<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Belkin+Ending+'Support'+For+Most+Wemo+Smart+Devices%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F07%2F11%2F1520202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F07%2F11%2F1520202%2Fbelkin-ending-support-for-most-wemo-sma",
        "id": 3143376,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/11/1520202/belkin-ending-support-for-most-wemo-smart-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Belkin Ending 'Support' For Most Wemo Smart Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T17:02:06.588451+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T16:40:00+00:00",
        "description": "A Russian professional basketball player has been arrested in France at the request of the United States, which reportedly accused him of being involved in a ransomware group that allegedly targeted hundreds of American companies and federal institutions. From a report: Daniil Kasatkin, 26, was detained in June at Paris's Charles de Gaulle Airport shortly after arriving in the country with his fiancee, according to local media reports. He is currently being held in extradition custody, with a U.S. warrant reportedly issued against him. Kasatkin previously studied and played basketball in the U.S., at Penn State University. \n\nThe unnamed ransomware network Kasatkin is suspected of being part of is believed to have targeted nearly 900 entities between 2020 and 2022. Local media, citing court proceedings in Paris, reported that Kasatkin allegedly helped negotiate ransom payments, though the extent of the damage caused by the attacks has not been disclosed.<p><div class=\"share_submission\"",
        "id": 3142781,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/07/11/1515207/russian-basketball-player-arrested-in-france-over-alleged-ransomware-ties?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russian Basketball Player Arrested in France Over Alleged Ransomware Ties",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T17:02:06.765790+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T16:00:00+00:00",
        "description": "An anonymous reader shares a report: JPMorgan Chase boss Jamie Dimon did not pull his punches when he spoke at Ireland's Department of Foreign Affairs. \n\n\"You're losing,\" he said of European competitiveness with the U.S. and Asia, in comments reported by the Financial Times. \"Europe has gone from 90% U.S. GDP to 65% over 10 or 15 years. That's not good.\" \n\n\"We've got this huge, strong market and our companies are big and successful, have huge kinds of scale that are global. You have that, but less and less,\" Dimon said on Thursday.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Jamie+Dimon's+Blunt+Message+for+Europe%3A+'You're+Losing'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F07%2F11%2F1432259%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F07%2F11",
        "id": 3142782,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/11/1432259/jamie-dimons-blunt-message-for-europe-youre-losing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jamie Dimon's Blunt Message for Europe: 'You're Losing'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T15:56:52.497540+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T15:21:00+00:00",
        "description": "An anonymous reader shares a report: HMD Global, the company best known for licensing the Nokia brand for new phones and tablets over the last decade, has announced that it will \"scale back\" its US operations, and appears to have stopped selling both HMD and Nokia devices entirely. \n\n[...] Based in Finland, HMD was formed in 2016 in order to purchase the Nokia feature phone business from Microsoft, which had in turn bought the ailing brand in 2014. It also secured a license to use the Nokia name on smartphones and tablets, with a focus on affordable and midrange hardware.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=HMD+'Scaling+Back'+in+the+US%2C+Killing+Nokia+All+Over+Again%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F07%2F11%2F1425212%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https",
        "id": 3142290,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/11/1425212/hmd-scaling-back-in-the-us-killing-nokia-all-over-again?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "HMD 'Scaling Back' in the US, Killing Nokia All Over Again",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T15:56:52.687460+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T14:40:00+00:00",
        "description": "The University of Washington's Paul G. Allen School of Computer Science &amp; Engineering is overhauling its approach to computer science education as AI reshapes the tech industry. Director Magdalena Balazinska has declared that \"coding, or the translation of a precise design into software instructions, is dead\" because AI can now handle that work. \n\nThe Pacific Northwest's premier tech program now allows students to use GPT tools in assignments, requiring them to cite AI as a collaborator just as they would credit input from a fellow student. The school is considering \"coordinated changes to our curriculum\" after encouraging professors to experiment with AI integration.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='Coding+is+Dead'%3A+University+of+Washington+CS+Program+Rethinks+Curriculum+For+the+AI+Era%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F07%2F11%2F1418225%2F%3Futm_source%3Dtwitter%26utm_medi",
        "id": 3142291,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/07/11/1418225/coding-is-dead-university-of-washington-cs-program-rethinks-curriculum-for-the-ai-era?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Coding is Dead': University of Washington CS Program Rethinks Curriculum For the AI Era",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T15:56:52.837322+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T14:00:00+00:00",
        "description": "Fertility rates have fallen to historically low levels [PDF] in virtually all high-income countries due to a fundamental reordering of adult priorities rather than economic factors, according to a new National Bureau of Economic Research study. Economists Melissa Schettini Kearney and Phillip B. Levine analyzed cohort data and found rising childlessness at all observed ages alongside falling completed fertility rates. \n\nTotal fertility rates have dropped below replacement level in nearly all OECD countries, with many sustaining rates below 1.5. Some East Asian countries including South Korea, Singapore, and China now have fertility rates at or below one child per woman. The researchers concluded that period-based explanations focused on short-term income or price changes cannot explain the widespread decline. Instead, evidence points to \"shifting priorities\" involving changing norms, evolving economic opportunities, and broader social and cultural forces that have diminished parenthoo",
        "id": 3142292,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/11/0755248/why-is-fertility-so-low-in-high-income-countries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Is Fertility So Low in High Income Countries?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T15:56:53.042704+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Dexerto: It's been ten years since YouTube first introduced its trending page in 2015, and the platform is finally sunsetting the program in favor of a new system. [...] As announced by YouTube in a support thread on July 10, 2025, the site is now set on introducing Charts, a new system for ranking popular content on its platform. \"Back when we first launched the Trending page in 2015, the answer to 'What's trending?' was a lot simpler to capture with a singular list of viral videos that everyone was talking about,\" the post reads. \"But today, trends consist of many videos created by many fandoms, and there are more micro-trends enjoyed by diverse communities than ever before.\"\n \nAs a result, YouTube says that its Trending page has seen \"significantly\" less traffic in the last five years, prompting them to make a change. Now, YouTube Charts will break up trends from one, all-encompassing page into separate, category-specific lists. The current ",
        "id": 3142293,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/11/0359240/youtube-is-shutting-down-its-trending-page-after-10-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Is Shutting Down Its 'Trending' Page After 10 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T10:30:37.906104+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T10:00:00+00:00",
        "description": "A new study found that psilocybin treatment significantly delayed cellular aging, extending human cell lifespan by over 50% and increasing survival in aged mice by 30%. The compound appeared to achieve these effects by reducing oxidative stress, preserving telomeres, and improving DNA repair. Neuroscience News reports: A newly published study in Nature Partner Journals' Aging demonstrates that psilocin, a byproduct of consuming psilocybin, the active ingredient in psychedelic mushrooms, extended the cellular lifespan of human skin and lung cells by more than 50%. In parallel, researchers also conducted the first long-term in vivo study evaluating the systemic effects of psilocybin in aged mice of 19 months, or the equivalent of 60-65 human years. Results indicated that the mice that received an initial low dose of psilocybin of 5 mg, followed by a monthly high dose of 15 mg for 10 months, had a 30% increase in survival compared to mice that did not receive any. These mice also display",
        "id": 3139683,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/11/0354259/psilocybin-treatment-extends-cellular-lifespan-improves-survival-of-aged-mice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Psilocybin Treatment Extends Cellular Lifespan, Improves Survival of Aged Mice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T07:16:37.267551+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T07:00:00+00:00",
        "description": "Senator Dick Durbin questioned a Texas-led effort to move Space Shuttle Discovery from the Smithsonian to Space Center Houston, describing it as an expensive \"heist\" costing an estimated $305 million, not the $85 million initially budgeted. \"This is not a transfer. It's a heist,\" said Durbin during a budget markup hearing before the Senate Appropriations Committee. \"A heist by Texas because they lost a competition 12 years ago.\" In April, Texas Senators John Cornyn and Ted Cruz introduced legislation to move the Space Shuttle Discovery from Virginia to Houston, which ultimately passed into law on July 4 as part of the \"One Big Beautiful Bill.\" Ars Technica reports: \"In the reconciliation bill, Texas entered $85 million to move the space shuttle from the National Air and Space Museum in Chantilly, Virginia, to Texas. Eighty-five million dollars sounds like a lot of money, but it is not nearly what's necessary for this to be accomplished,\" Durbin said. Citing research by NASA and the Sm",
        "id": 3138536,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/11/0349227/senator-calls-out-texas-for-trying-to-steal-shuttle-from-smithsonian?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Senator Calls Out Texas For Trying To Steal Shuttle From Smithsonian",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T04:00:27.009912+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Automated surgery could be trialled on humans within a decade, say researchers, after an AI-trained robot armed with tools to cut, clip and grab soft tissue successfully removed pig gall bladders without human help. The robot surgeons were schooled on video footage of human medics conducting operations using organs taken from dead pigs. In an apparent research breakthrough, eight operations were conducted on pig organs with a 100% success rate by a team led by experts at Johns Hopkins University in Baltimore in the US. [...]\n \nThe technology allowing robots to handle complex soft tissues such as gallbladders, which release bile to aid digestion, is rooted in the same type of computerized neural networks that underpin widely used artificial intelligence tools such as Chat GPT or Google Gemini. The surgical robots were slightly slower than human doctors but they were less jerky and plotted shorter trajectories between tasks. The rob",
        "id": 3137685,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/10/2348238/ai-trained-surgical-robot-removes-pig-gallbladders-without-any-human-help?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI-Trained Surgical Robot Removes Pig Gallbladders Without Any Human Help",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T02:56:53.814010+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T02:02:00+00:00",
        "description": "The city of Centerville, Ohio has deployed AI-enabled garbage trucks that scan residents' trash and send personalized postcards scolding them for improper recycling. Dayton Daily News reports: \"Reducing contamination in our recycling system lowers processing costs and improves the overall efficiency of our collection,\" City Manager Wayne Davis said in a statement regarding the AI pilot program. \"This technology allows us to target problem areas, educate residents and make better use of city resources.\" Residents whose items don't meet the guidelines will be notified via a personalized postcard, one that tells them which items are not accepted and provides tips on proper recycling.\n \nThe total contract amount for the project is $74,945, which is entirely funded through a Montgomery County Solid Waste District grant, Centerville spokeswoman Kate Bostdorff told this news outlet. The project launched Monday, Bostdorff said. \"A couple of the trucks have been collecting baseline recycling d",
        "id": 3137445,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/10/2338216/ohio-city-using-ai-equipped-garbage-trucks-to-scan-your-trash-scold-you-for-not-recycling?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ohio City Using AI-Equipped Garbage Trucks To Scan Your Trash, Scold You For Not Recycling",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T01:50:07.252510+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T01:25:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: Android is changing how it gives developers access to early features. The company is replacing its old Developer Preview model with a new Canary channel that provides rolling updates all year long. This new approach is meant to give developers earlier and more consistent access to experimental tools and APIs. \nPreviously, Developer Previews had to be manually flashed onto devices. They only ran during the earliest stages of each release cycle and stopped once Android entered the beta phase. That meant promising features that were not quite ready for beta had nowhere to go and no way to collect feedback. The Canary channel solves that by running in parallel with the existing beta program and delivering over the air updates automatically.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Replaces+Android+Developer+Preview+With+Rolling+Canary+Channel%3A+https%3A%2F%2Fdev",
        "id": 3137201,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/07/10/2329218/google-replaces-android-developer-preview-with-rolling-canary-channel?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Replaces Android Developer Preview With Rolling Canary Channel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T01:50:07.385328+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T00:45:00+00:00",
        "description": "Longtime Slashdot reader SonicSpike shares a report from Gizmodo: YouTube is inundated with AI-generated slop, and that's not going to change anytime soon. Instead of cutting down on the total number of slop channels, the platform is planning to update its policies to cut out some of the worst offenders making money off \"spam.\" At the same time, it's still full steam ahead adding tools to make sure your feeds are full of mass-produced brainrot.\n \nIn an update to its support page posted last week, YouTube said it will modify guidelines for its Partner Program, which lets some creators with enough views make money off their videos. The video platform said it requires YouTubers to create \"original\" and \"authentic\" content, but now it will \"better identify mass-produced and repetitious content.\" The changes will take place on July 15. The company didn't advertise whether this change is related to AI, but the timing can't be overlooked considering how more people are noticing the rampant p",
        "id": 3137202,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/10/2327220/youtube-cant-put-pandoras-ai-slop-back-in-the-box?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Can't Put Pandora's AI Slop Back in the Box",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-11T00:44:38.161326+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-11T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Straight Arrow News: Hollywood video game performers ended their nearly year-long strike Wednesday with new protections against the use of digital replicas of their voices or appearances. If those replicas are used, actors must be paid at rates comparable to in-person work. The SAG-AFTRA union demanded stronger pay and better working conditions. Among their top concerns was the potential for artificial intelligence to replace human actors without compensation or consent.\n \nUnder a deal announced in a media release, studios such as Activision and Electronic Arts are now required to obtain written consent from performers before creating digital replicas of their work. Actors have the right to suspend their consent for AI-generated material if another strike occurs. \"This deal delivers historic wage increases, industry-leading AI protections and enhanced health and safety measures for performers,\" Audrey Cooling, a spokesperson for the video game ",
        "id": 3136917,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/07/10/2119204/video-game-actors-end-11-month-strike-with-new-ai-protections?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Video Game Actors End 11-Month Strike With New AI Protections",
        "vote": 0
    }
]