[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T23:11:52.674418+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T22:50:00+00:00",
        "description": "Meta has officially launched Horizon TV, a virtual reality \"smart TV\" app for its Quest headsets. The app mirrors modern smart TV interfaces with deep-linked streaming apps and curated recommendations -- but it's still missing major players like Netflix and Disney+. From a report: Except Horizon TV isn't running on a TV or streaming stick, but on the company's Meta Quest headsets. Unveiled at Meta Connect last month, the app is a big part of Meta's push to attract older, less gaming-focused audiences to VR -- a push that also includes a partnership with James Cameron, and investments into sports, and other types of leanback entertainment content.\n \nRe-creating the smart TV experience in virtual reality also represents a monetization opportunity for Meta, which has for some time now tried to figure out how to bring advertising to VR. However, the approach also means that Meta is inheriting some of the very problems smart TV platform operators have struggled with for a long time. And if",
        "id": 3833274,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/16/215216/meta-is-building-a-smart-tv-in-vr",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Is Building a Smart TV In VR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T23:11:52.912340+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T22:10:00+00:00",
        "description": "Google DeepMind is partnering with Commonwealth Fusion Systems (CFS) to use its Torax AI software to simulate and optimize plasma behavior inside the company's Sparc fusion reactor. TechCrunch reports: There's a reason Google keeps coming back to the problem: AI might be uniquely suited to making fusion power possible. One of the biggest challenges facing fusion startups is keeping the plasma inside a reactor hot enough for long enough. Unlike nuclear fission reactions, which are self-sustaining, fusion reactions are difficult to maintain outside of stars like the Sun. Without that sort of mass and gravity, the plasma is constantly in danger of diffusing and snuffing itself out.\n \nIn CFS's reactors, powerful magnets substitute for gravity to help corral the plasma, but they're not perfect. Reactor operators have to develop control software that can enable the device to continuously react to changing plasma conditions. Problem is, there are almost too many knobs to turn, certainly more",
        "id": 3833275,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/16/2048225/google-deepmind-partners-with-fusion-startup",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google DeepMind Partners With Fusion Startup",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T22:03:37.459500+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T21:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: If you've even idly checked in on the robust world of Doom fan development in recent years, you've probably encountered one of the hundreds of gameplay mods, WAD files, or entire commercial games based on GZDoom. The open source Doom port -- which can trace its lineage back to the original launch of ZDoom back in 1998 -- adds modern graphics rendering, quality-of-life additions, and incredibly deep modding features to the original Doom source code that John Carmack released in 1997. Now, though, the community behind GZDoom is publicly fracturing, with a large contingent of developers uniting behind a new fork called UZDoom. The move is in apparent protest of the leadership of GZDoom creator and maintainer Cristoph Oelckers (aka Graf Zahl), who recently admitted to inserting untested AI-generated code into the GZDoom codebase.\n \n\"Due to some disagreements -- some recent; some tolerated for close to 2 decades -- with how collaborati",
        "id": 3832901,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/16/2041249/open-source-gzdoom-community-splinters-after-creator-inserts-ai-generated-code",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Open Source GZDoom Community Splinters After Creator Inserts AI-Generated Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T22:03:37.600268+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T20:51:00+00:00",
        "description": "The U.S. is awash with scam text messages. Officials say it has become a billion-dollar, highly sophisticated business benefiting criminals in China. From a report: Your highway toll payment is now past due, one text warns. You have U.S. Postal Service fees to pay, another threatens. You owe the New York City Department of Finance for unpaid traffic violations. The texts are ploys to get unsuspecting victims to fork over their credit-card details. The gangs behind the scams take advantage of this information to buy iPhones, gift cards, clothing and cosmetics. \n\nCriminal organizations operating out of China, which investigators blame for the toll and postage messages, have used them to make more than $1 billion over the last three years, according to the Department of Homeland Security. Behind the con, investigators say, is a black market connecting foreign criminal networks to server farms that blast scam texts to victims. The scammers use phishing websites to collect credit-card info",
        "id": 3832902,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/16/1934236/chinese-criminals-made-more-than-1-billion-from-those-annoying-texts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Criminals Made More Than $1 Billion From Those Annoying Texts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T20:46:34.594602+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T20:10:00+00:00",
        "description": "Speaking of the new MacBook Pro, which Apple launched on Wednesday, Bloomberg News reports that the company is preparing to launch a touch-screen version of its Mac computer, reversing course on a stance that dates back to co-founder Steve Jobs. From the report: The company is readying a revamped MacBook Pro with a touch display for late 2026 or early 2027 [non-paywalled link], according to people with knowledge of the matter. The new machines, code-named K114 and K116, will also have thinner and lighter frames and run the M6 line of chips. In making the move, Apple is following the rest of the computing industry, which embraced touch-screen laptops more than a decade ago. \n\nThe company has taken years to formulate its approach to the market, aiming to improve on current designs. Bloomberg News first reported in January 2023 that Apple was working on a touch-screen MacBook Pro. The new laptops will feature displays with OLED technology, the same standard used in iPhones and iPad Pros,",
        "id": 3832303,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/16/1912205/apple-readies-high-end-macbook-pro-with-touch-hole-punch-screen",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Readies High-End MacBook Pro With Touch, Hole-Punch Screen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T20:46:34.672883+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T19:30:00+00:00",
        "description": "The TED conference is changing hands, and education pioneer Sal Khan will be the new \"vision steward\" for the institution long headed by Chris Anderson. From a report: The move aims to ensure the future of the organization, while keeping it a not-for-profit entity. Khan, founder and CEO of Khan Academy, will be the public face of TED, with Logan McClure Davda taking over as CEO. \n\nDavda, who previously served as the organization's head of impact and was the co-founder of its fellows program, will run day-to-day operations. Khan remains CEO of Khan Academy while joining TED's board. Jay Herratti, who has served as CEO since 2021, will remain on TED's board. TED announced in February it was seeking new leadership and structure and put out an open call for proposals. The company held dozens of discussions, including some that would have transformed the organization into a for-profit venture. The organization's flagship conference is also headed for a big change, with 2026 being its last ",
        "id": 3832304,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/16/1758203/sal-khan-will-become-the-public-face-of-the-ted-conference",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sal Khan Will Become the Public Face of the TED Conference",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T19:31:08.974417+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T18:50:00+00:00",
        "description": "Oil, gas and coal will continue to dominate the world's energy mix well beyond 2050, as soaring electricity demand outpaces the shift to renewables, according to a new McKinsey report. From a report: McKinsey expects fossil fuels to account for about 41-55% of global energy consumption in 2050, down from today's 64% but higher than previous projections. U.S. data-center-related power demand is expected to grow nearly 25% a year until 2030, while demand from data centers globally would average 17% growth per year between 2022 and 2030, especially in OECD countries. Alternative fuels are not likely to achieve broad adoption before 2040 unless mandated, but renewables do have the potential to provide 61-67% of the 2050 global power mix, McKinsey said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Fossil+Fuels+To+Dominate+Global+Energy+Use+Past+2050%2C+McKinsey+Says%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2",
        "id": 3831686,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/16/1748214/fossil-fuels-to-dominate-global-energy-use-past-2050-mckinsey-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fossil Fuels To Dominate Global Energy Use Past 2050, McKinsey Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T19:31:09.050483+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T18:10:00+00:00",
        "description": "Hanneke Faber, CEO of global tech manufacturing company Logitech, says she'd be open to the idea of having an AI-powered board member. From a report: \"We already use [AI agents] in almost every meeting,\" Faber said at the Fortune Most Powerful Women Summit in Washington, D.C., on Monday. While she said AI agents today (like Microsoft Copilot and internal bots) mostly take care of summarization and idea generation, that's likely to change owing to the pace at which the technology is developing. \n\n\"As they evolve -- and some of the best agents or assistants that we've built actually do things themselves -- that comes with a whole bunch of governance things,\" Faber said. \"You have to keep in mind and make sure you really want that bot to take action. But if you don't have an AI agent in every meeting, you're missing out on some of the productivity.\" \"That bot, in real time, has access to everything,\" she continued.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"sla",
        "id": 3831687,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/16/1725256/logitech-open-to-adding-an-ai-agent-to-board-of-directors-ceo-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Logitech Open To Adding an AI Agent To Board of Directors, CEO Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T18:11:33.035387+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T17:30:00+00:00",
        "description": "The IMF has issued a stark warning over soaring global government debt, saying it is on track to exceed 100% of GDP by 2029. Semafor: Such a ratio would be the highest since 1948, when large economies were rebuilding post-war. Today, \"there is little political appetite for belt-tightening,\" The Economist wrote: Rich nations are reluctant to raise taxes on their beleaguered electorates -- but they're facing pressure to spend more on defense, and on social services for aging populations. \n\nHigher long-term bond yields, meanwhile, suggest investor wariness over governments' balance sheets. In the short term, the debt concerns manifest in political disruption: France's budget fight recently toppled another government, while the US federal shutdown highlights the tension between new spending demands and deficit reduction.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=IMF+Warns+About+Soaring+Global+Government+Debt%3A+htt",
        "id": 3831048,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/16/1716226/imf-warns-about-soaring-global-government-debt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "IMF Warns About Soaring Global Government Debt",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T17:01:31.275179+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T16:55:00+00:00",
        "description": "China now generates well over twice as much electricity as the United States. The country's economy has become substantially larger than America's in real terms, measured at purchasing power parity, economist Paul Krugman wrote this week. The Trump administration has moved aggressively against renewable energy development. It rolled back Biden's tax incentives for renewables through the One Big Beautiful Bill. The administration is attempting to stop a nearly completed offshore wind farm that could power hundreds of thousands of homes. It canceled $7 billion in grants for residential solar panels. A solar energy project that would have powered almost 2 million homes was killed. The administration canceled $8 billion in clean energy grants, mostly in Democratic states, and is reportedly planning to cancel tens of billions more. Energy Secretary Chris Wright said solar power is unreliable because \"you have to have power when the sun goes behind a cloud and when the sun sets, which it do",
        "id": 3830434,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/16/1656206/china-has-overtaken-america",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'China Has Overtaken America'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T17:01:31.349844+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T16:10:00+00:00",
        "description": "South Korea's government has stripped AI-powered textbooks of their official status after a single semester of use. The textbooks were introduced in March for math, English, and computer science classes as a flagship initiative under former President Yoon Suk Yeol. Students and teachers complained about technical problems, factual inaccuracies, and increased workload. \n\nThe government spent more than 1.2 trillion won ($850 million) on the program. Publishers invested around 800 billion won ($567 million). The textbooks were reclassified as supplementary material. Adoption rates dropped from 37% in the first semester to 19% in September. Only 2,095 schools now use them, about half the number from earlier in the year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=South+Korea+Abandons+AI+Textbooks+After+Four-Month+Trial%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F16%2F1551244%2F%3Futm_source%3Dtwitter%26utm",
        "id": 3830435,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/16/1551244/south-korea-abandons-ai-textbooks-after-four-month-trial",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "South Korea Abandons AI Textbooks After Four-Month Trial",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T15:44:16.502545+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T15:33:00+00:00",
        "description": "The California Broadband &amp; Video Association has objected to legislation signed by Governor Gavin Newsom on October 15 that allows apartment tenants to opt out of mandatory bulk billing for internet service. The cable industry group called the measure \"an anti-affordability bill masked as consumer protection.\" \n\nThe association said property owners would have to provide refunds to tenants who decline internet service provided through building contracts. The law \"undermines the basis of the cost savings and will lead to bulk billing being phased out,\" the group said. Assembly member Rhodesia Ransom, who authored the bill, said lobby groups for internet providers and real estate companies worked hard to defeat it. \n\nThe association told the Sacramento Bee it was disappointed Newsom signed the legislation because it would be \"an impediment to utilizing an effective tool\" that helped middle-class Californians get discounted rates. The law takes effect January 1. Tenants who are denied",
        "id": 3829690,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/16/1533223/isps-object-as-california-lets-renters-opt-out-of-bulk-broadband-plans",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ISPs Object as California Lets Renters Opt Out of Bulk Broadband Plans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T15:44:16.640882+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T14:40:00+00:00",
        "description": "BrianFagioli writes: The United States Mint is honoring Steve Jobs and Apple with a new coin for 2026. Part of the American Innovation $1 Coin Program, California's entry depicts a young Jobs seated before rolling northern California hills, accompanied by the words \"Make Something Wonderful.\" The reflective design, created by Elana Hagler and sculpted by Phebe Hemphill, captures how Jobs's surroundings and vision shaped Apple's mission to make technology feel intuitive and human. \n\nThe 2026 series also celebrates Dr. Norman Borlaug for Iowa, the Cray-1 supercomputer for Wisconsin, and mobile refrigeration for Minnesota. The obverse of all coins features the Statue of Liberty and a special Liberty Bell mark commemorating the nation's Semiquincentennial. The Steve Jobs coin stands out as one of the few times the U.S. Mint has recognized a modern tech innovator, and some collectors are already calling it one of the most exciting releases in years.<p><div class=\"share_submission\" style=\"p",
        "id": 3829691,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/16/1436203/steve-jobs-honored-on-new-2026-us-coin-celebrating-innovation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Steve Jobs Honored On New 2026 US Coin Celebrating Innovation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T14:32:38.815884+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T14:03:00+00:00",
        "description": "Microsoft is reshaping Windows around AI, introducing capabilities that let users control their computers through voice and allow Copilot to take autonomous actions on their behalf. The company is now rolling out a \"Hey, Copilot!\" wake word on Windows 11 machines, positioning voice as a \"third input mechanism\" to supplement the keyboard and mouse. \n\nCopilot Vision, which streams what a user sees on their screen, is rolling out globally, enabling the system to troubleshoot PC problems, help with app usage, and provide task guidance. Microsoft is simultaneously testing Copilot Actions through a limited preview, allowing the AI to take autonomous actions on local machines like editing folders of photos. The company is also integrating Copilot into the Windows taskbar and launching advertisements promoting these features, coinciding with Windows 10's end-of-support earlier this week. \n\nYusuf Mehdi, Microsoft's consumer chief marketing officer, said the company wants users upgrading to Win",
        "id": 3828982,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/16/143217/microsoft-wants-you-to-talk-to-your-pc-and-let-ai-control-it",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Wants You To Talk To Your PC and Let AI Control It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T13:19:05.501861+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T13:07:00+00:00",
        "description": "Paxos mistakenly minted $300 trillion of PayPal's PYUSD stablecoin on Wednesday during an internal transfer. Within minutes, the company identified the error and burned the excess tokens. The transaction appeared on Etherscan, then was quietly reversed before any funds moved or users were harmed. \n\nPaxos said there was no security breach and customer funds were safe. The amount exceeded all US dollars in circulation and surpassed the entire cryptocurrency market combined. Stablecoin issuers possess the power to create or delete billions in synthetic dollars instantly -- a capability that distinguishes them from Bitcoin transfers, which are irreversible. Tether mistakenly minted and burned $5 billion in USDT in 2019.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Paxos+Mistakenly+Issues+%24300+Trillion+of+PayPal+Stablecoin%2C+Exceeding+Global+Currency+Supply%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F16%2",
        "id": 3828377,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/16/136237/paxos-mistakenly-issues-300-trillion-of-paypal-stablecoin-exceeding-global-currency-supply",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Paxos Mistakenly Issues $300 Trillion of PayPal Stablecoin, Exceeding Global Currency Supply",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T10:52:06.399294+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T10:00:00+00:00",
        "description": "GrapheneOS, the privacy-focused Android fork once exclusive to Google Pixels, is partnering with a major Android OEM to bring its hardened, de-Googled OS to Snapdragon-powered flagship phones. Android Authority reports: Until now, GrapheneOS has been available only on Pixel phones, making Google's flagships popular among privacy enthusiasts, journalists, and, as a Spanish police report suggested earlier this year, even organized crime groups in Catalonia. But that Pixel exclusivity may end by 2026 or 2027. GrapheneOS revealed in a Reddit thread that it has been working with a \"major Android OEM\" since June 2025 to enable official support for \"future versions of their existing models.\" These devices will reportedly use flagship Snapdragon chips, a notable shift from Google's in-house Tensor processors.\n \nThe project explained that only Pixels have met its strict security and update requirements so far. However, the new partnership suggests that another OEM is finally matching those sta",
        "id": 3827298,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/16/0234244/grapheneos-finally-ready-to-break-free-from-pixels",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GrapheneOS Finally Ready To Break Free From Pixels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T07:18:26.404186+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T07:00:00+00:00",
        "description": "Scientists from Spain and China have successfully repaired the blood-brain barrier in Alzheimer's-model mice, enabling the brain to naturally clear amyloid-beta plaques and reverse cognitive decline. \"After just three drug injections, mice with certain genes that mimic Alzheimer's showed a reversal of several key pathological features,\" adds ScienceAlert. From the report: Within hours of the first injection, the animal brains showed a nearly 45 percent reduction in clumps of amyloid-beta plaques, a hallmark of Alzheimer's disease. The mice had previously shown signs of cognitive decline, but after all three doses, the animals performed on par with their healthy peers in spatial learning and memory tasks. The benefits lasted at least six months.\n \nThese preclinical results don't guarantee success in humans, but they're an encouraging start, which the authors say \"heralds a new era\" in drug research. \"The therapeutic implications are profound,\" claim the international team of researcher",
        "id": 3826234,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/16/0245204/new-alzheimers-treatment-clears-plaques-from-brains-of-mice-within-hours",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Alzheimer's Treatment Clears Plaques From Brains of Mice Within Hours",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T03:46:27.979864+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Conversation: Sound waves at frequencies above the threshold for human hearing are routinely used in medical care. Also known as ultrasound, these sound waves can help clinicians diagnose and monitor disease, and can also provide first glimpses of your newest family members. And now, patients with conditions ranging from cancer to neurodegenerative diseases like Alzheimer's may soon benefit from recent advances in this technology.\n \nI am a biomedical engineer who studies how focused ultrasound -- the concentration of sound energy into a specific volume -- can be fine-tuned to treat various conditions. Over the past few years, this technology has seen significant growth and use in the clinic. And researchers continue to discover new ways to use focused ultrasound to treat disease. [...] Research on focused ultrasound has primarily focused on the most devastating and prevalent diseases, such as cancer and Alzheimer's disease. However, I belie",
        "id": 3825330,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/16/0016229/focused-sound-energy-holds-promise-for-treating-cancer-alzheimers-and-other-diseases",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Focused Sound Energy Holds Promise For Treating Cancer, Alzheimer's and Other Diseases",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T02:33:56.699313+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T02:20:00+00:00",
        "description": "mspohr shares a report from Futurism: Western automotive and green energy executives who visit China are returning humbled -- and even terrified. As The Telegraph reports, the executives are warning that the country's heavily automated manufacturing industry could quickly leave Western nations behind, especially when it comes to electric vehicles. \"We are in a global competition with China, and it's not just EVs,\" Ford CEO Jim Farley told The Verge last month. \"And if we lose this, we do not have a future at Ford.\" Some companies are giving up on new initiatives altogether, with the founder of mining company Fortescue, Andrew Forrest, claiming that his recent trip to China led to him abandoning attempts to produce EV powertrains in-house. \"There are no people -- everything is robotic,\" he told The Telegraph.\n \nOther executives recalled touring \"dark factories\" that don't even need to keep the lights on, as most work is being done around the clock by robots. \"You get this sense of a ch",
        "id": 3825111,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/16/006222/western-executives-shaken-after-visiting-china",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Western Executives Shaken After Visiting China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T02:33:56.780293+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T01:40:00+00:00",
        "description": "Norway has effectively achieved its 2025 goal of 100% electric new car sales, prompting the government to declare \"mission accomplished\" and propose scaling back EV tax exemptions to reflect a mature market. \"We have had a goal that all new passenger cars should be electric by 2025, and ... we can say that the goal has been achieved,\" announced Finance Minister Jens Stoltenberg. Electrek reports: With the finish line in sight, the Norwegian government is now fine-tuning its approach. The current incentive program maintains the crucial VAT exemption for EVs, but only up to a purchase price of 500,000 Norwegian kroner (approximately $49,000 USD). This move is designed to target more expensive, luxury EVs, ensuring that the incentive benefits a broader range of consumers.\n \nHowever, the latest budget proposal aims to reduce the EV tax exemption to vehicles costing 300,000 Norwegian kroner (~30,000 USD). This would apply for 2026, and then the tax exemption would completely end in 2027. A",
        "id": 3825112,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/15/2259207/norway-says-mission-accomplished-on-going-100-ev-proposes-incentive-changes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Norway Says 'Mission Accomplished' On Going 100% EV, Proposes Incentive Changes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T01:22:39.373855+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T01:00:00+00:00",
        "description": "Boris Johnson's former adviser claims that China infiltrated a key UK government data-transfer network for years, compromising highly classified materials and prompting a Whitehall cover-up that prioritized Chinese investment over national security. The Times reports: Dominic Cummings, who served as a senior adviser to Boris Johnson, said that he and the then prime minister were informed about the breach in 2020 but that there had subsequently been a cover-up. He said he was warned at the time that disclosing some specific details of the breach would be a criminal offence. He claimed that the breach included some \"Strap\" material, which is the government term for the highest level of classified information.\n \nThe breach, which was confirmed by two other senior Whitehall sources, was said to have been connected to a Chinese-owned company involved in Britain's critical national infrastructure. Tom Tugendhat, a former Tory security minister, supported Cummings's account. Cummings said th",
        "id": 3824848,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/15/2254230/china-stole-vast-amounts-of-classified-uk-documents-officials-say",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China 'Stole Vast Amounts' of Classified UK Documents, Officials Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-16T01:22:39.459772+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-16T00:20:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: People in London could be hiring driverless taxis from Waymo next year, after the US autonomous vehicle company announced plans to launch its services there. The UK capital will become the first European city to have an autonomous taxi service of the kind now familiar in San Francisco and four other US cities using Waymo's technology.\n \nThe launch pits an innovation sometimes dubbed the \"robotaxi\" against London's famous black cabs, which can trace their history back to the first horse-drawn hackney coaches of the Tudor era. But a representative of the capital's cab drivers said they were not concerned by the arrival of a \"fairground ride\" and questioned the reliability of driverless vehicles. Waymo said its cars were now on their way to London and would start driving on the capital's streets in the coming weeks with \"trained human specialists,\" or safety drivers, behind the wheel.\n \nThe company, originally formed as a spin-off fr",
        "id": 3824849,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/15/2239222/waymos-robotaxis-are-coming-to-london",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymo's Robotaxis Are Coming To London",
        "vote": 0
    }
]