[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T17:00:08+00:00",
        "description": "The Last of Us Part 2 was originally released on the PS4 all the way back in 2020. Since then, the game has been praised for its gameplay, and visuals, and Naughty Dog kept the trend going by bringing the title to the PS5 in the form of its Remastered release. Along with better visuals and frame rates thanks to the better hardware in the current-gen console, the PS5 release of The Last of Us Part 2 also brought with it the No Return mode.\n\nA little over a year later, we now have The Last of Us Part 2 Remastered on PC. While not much has changed since its PS5 release, the game does feature some new content for its No Return mode, along with PC-exclusive features like granular options for graphics and support for ultrawide monitors. The fact that the port performs incredibly well and, outside of one minor bug, it feels like the definitive way to play this game.",
        "id": 2476700,
        "language": null,
        "link": "https://www.youtube.com/watch?v=40cNFBYRZvs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/40cNFBYRZvs/hqdefault.jpg",
        "title": "The Last of Us Part 2 Remastered PC Review - The Definitive Version",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T16:01:17+00:00",
        "description": "Delivering the kind of focused, linear, narrative-driven action-adventure title that is all too rare in this day and age, South of Midnight's very existence should be celebrated, in theory. \n\nThat the game then manages to deliver a strong package in most regards – and a standout one in several others – only serves to make South of Midnight that much more compelling as a package. \n\nWith its incredibly unique setting (that it draws upon aplenty), eye catching aesthetic that instantly makes it stand out from most other similar games you might be able to think of, and of course, its refreshingly to-the-point (if fairly ordinary and by-the-numbers) gameplay, South of Midnight is a game that very much deserves your attention.",
        "id": 2476701,
        "language": null,
        "link": "https://www.youtube.com/watch?v=vIRGJ-j_GH8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vIRGJ-j_GH8/hqdefault.jpg",
        "title": "South of Midnight Review - This Game DESERVES YOUR ATTENTION",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T15:30:14+00:00",
        "description": "Years of waiting later, the Nintendo Switch 2 has finally been revealed. With a larger screen, faster hardware, a better dock for 4K output, and tons of new features and improvements, it's a decent leap over the original. The $449.99 price isn't exactly setting most people's worlds on fire (at least not in a good way), but the game pricing is something else entirely.\n\nNever mind that Nintendo charges $69.99 for a Switch 2 Edition of The Legend of Zelda: Breath of the Wild or a digital version of Donkey Kong Bananza. It's asking a whopping $79.99 for a digital version of Mario Kart World (which is much cheaper if you buy it in a bundle with the Switch 2). Want the Switch 2 version of Tears of the Kingdom, Super Mario Party Jamboree and Kirby and the Forgotten Land? That will also be $79.99.\n\nConsidering the industry has debated whether Rockstar and Take-Two would take the next big pricing leap with Grand Theft Auto 6, it's unprecedented to see Nintendo ahead of the curve.",
        "id": 2476702,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QXrS6zxTx5E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QXrS6zxTx5E/hqdefault.jpg",
        "title": "Nintendo Switch 2 Sets Shocking Precedent With $80 Games - IS GTA 6 NEXT?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T13:30:39+00:00",
        "description": "After a record-breaking run with the Switch, Nintendo is returning to the hybrid console well with the successor to their games industry conquering device. The Nintendo Switch 2 is going to follow up on the original Switch not long from now, and while millions of fans around the world are probably excited to get their hands on the new machine as soon as is possible, it doesn't hurt to know what it is that you're spending money on before you do it. \n\nIn this video, we look at some critical information on Switch 2, which is relevant and nice to have on hand before you go ahead and join the next generation Nintendo party.",
        "id": 2476703,
        "language": null,
        "link": "https://www.youtube.com/watch?v=qipkXkllfZc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qipkXkllfZc/hqdefault.jpg",
        "title": "Nintendo Switch 2 - 15 Things You NEED TO KNOW Before You Buy | Pre-Order",
        "vote": 0
    }
]