[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T23:05:19+00:00",
        "description": "Air conditioning will contribute more to rising global energy demand than data centers through 2030, according to an International Energy Agency. While attention has focused on computing power consumption, the IEA projects data centers will account for less than 10% of increased energy demand by 2030, significantly less than space cooling requirements. Global cooling degree days, a measure of air conditioning need, were 6% higher in 2024 than 2023 and 20% above the long-term average for the first two decades of the century. \n\nChina, India and the United States saw particularly sharp increases. Air conditioning represented 7% of global electricity consumption in 2022, with some U.S. regions reporting that cooling can comprise over 70% of residential energy use during peak periods. The number of air conditioning units worldwide could nearly triple from fewer than 2 billion in 2016 to approximately 6 billion by 2050, creating a growing challenge for power grids.<p><div class=\"share_subm",
        "id": 2479462,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/03/220248/air-conditioning-not-data-centers-driving-global-energy-demand-growth?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Air Conditioning, Not Data Centers, Driving Global Energy Demand Growth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T23:05:19+00:00",
        "description": "Intel and Taiwan Semiconductor Manufacturing Co. have reached a preliminary agreement to form a joint venture operating Intel's chipmaking facilities, with TSMC taking a 20% stake, The Information reports [non-paywalled source]. Intel and other U.S. semiconductor companies would hold the majority of shares in the proposed venture. Instead of capital investment, TSMC has discussed sharing chipmaking methods and training Intel personnel. \n\nThe talks face internal opposition from some Intel executives concerned about widespread layoffs and the abandonment of Intel's own technology, according to the report. The deal could help TSMC neutralize a struggling competitor while potentially giving Taiwan more leverage with the U.S. administration, which recently imposed tariffs on Taiwanese goods excluding chips.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel%2C+TSMC+Tentatively+Agree+To+Form+Chipmaking+Joint+Venture%3A",
        "id": 2479464,
        "language": null,
        "link": "https://slashdot.org/story/25/04/03/2151215/intel-tsmc-tentatively-agree-to-form-chipmaking-joint-venture?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel, TSMC Tentatively Agree To Form Chipmaking Joint Venture",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T23:05:19+00:00",
        "description": "U.S. stock markets suffered their worst day since the Covid pandemic after Donald Trump announced sweeping new tariffs, triggering a global selloff and wiping out $470 billion in value from tech giants Apple and Nvidia. From a report: The tech-heavy Nasdaq fell 6%, while the S&amp;P 500 and the Dow dropped 4.8% and 3.9%, respectively. [...] Meanwhile, the US dollar hit a six-month low, going down at least 2.2% on Thursday morning compared with other major currencies and oil prices sank on fears of a global slowdown. Though the US stock market has been used to tumultuous mornings over the last few weeks, US stock futures -- an indication of the market's likely direction -- had plummeted after the announcement. Hours later, Japan's Nikkei index slumped to an eight-month low and was followed by falls in stock markets in London and across Europe.\n \nMultiple major American business groups have spoken out against the tariffs, including the Business Roundtable, a consortium of leaders of ma",
        "id": 2479463,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/03/2241220/us-stock-markets-see-worst-day-since-covid-pandemic?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Stock Markets See Worst Day Since Covid Pandemic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T22:00:24+00:00",
        "description": "An anonymous reader shares a report: Microsoft's business-oriented \"Link\" mini-desktop PC, which connects directly to the company's Windows 365 cloud service, is now available to buy for $349.99 in the US and in several other countries. Windows 365 Link, which was announced last November, is a device that is more easily manageable by IT departments than a typical computer while also reducing the needs of hands on support.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft's+Miniature+Windows+365+Link+PC+Goes+On+Sale%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F03%2F2143251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F03%2F2143251%2Fmicrosofts-miniature-windows-365-link-pc-goes-on-sale%3Futm_source%3Dslashdot%26utm_medium%",
        "id": 2479092,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/03/2143251/microsofts-miniature-windows-365-link-pc-goes-on-sale?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's Miniature Windows 365 Link PC Goes On Sale",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T19:50:16+00:00",
        "description": "An anonymous reader shares a report: Oracle has told customers that a hacker broke into a computer system and stole old client log-in credentials, according to two people familiar with the matter. It's the second cybersecurity breach that the software company has acknowledged to clients in the last month. \n\nOracle staff informed some clients this week that the attacker gained access to usernames, passkeys and encrypted passwords, according to the people, who spoke on condition that they not be identified because they're not authorized to discuss the matter. Oracle also told them that the FBI and cybersecurity firm CrowdStrike are investigating the incident, according to the people, who added that the attacker sought an extortion payment from the company. Oracle told customers that the intrusion is separate from another hack that the company flagged to some health-care customers last month, the people said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop",
        "id": 2478086,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/04/03/198224/oracle-tells-clients-of-second-recent-hack-log-in-data-stolen?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Oracle Tells Clients of Second Recent Hack, Log-In Data Stolen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T18:45:31+00:00",
        "description": "Despite promises of more efficient streaming, the AV1 video codec hasn't achieved widespread adoption seven years after its 2018 debut, even with backing from tech giants Netflix, Microsoft, Google, Amazon, and Meta. The Alliance for Open Media (AOMedia) claims AV1 is 30% more efficient than standards like HEVC, delivering higher-quality video at lower bandwidth while remaining royalty-free. \n\nMajor services including YouTube, Netflix, and Amazon Prime Video have embraced the technology, with Netflix encoding approximately 95% of its content using AV1. However, adoption faces significant hurdles. Many streaming platforms including Max, Peacock, and Paramount Plus haven't implemented AV1, partly due to hardware limitations. Devices require specific decoders to properly support AV1, though recent products from Apple, Nvidia, AMD, and Intel have begun including them. \"In order to get its best features, you have to accept a much higher encoding complexity,\" Larry Pearlstein, associate pr",
        "id": 2476617,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/03/1526250/av1-is-supposed-to-make-streaming-better-so-why-isnt-everyone-using-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AV1 is Supposed To Make Streaming Better, So Why Isn't Everyone Using It?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T18:45:31+00:00",
        "description": "The climate crisis is on track to destroy capitalism, a top insurer has warned, with the vast cost of extreme weather impacts leaving the financial sector unable to operate. From a report: The world is fast approaching temperature levels where insurers will no longer be able to offer cover for many climate risks, said G&#195;&#188;nther Thallinger, on the board of Allianz SE, one of the world's biggest insurance companies. He said that without insurance, which is already being pulled in some places, many other financial services become unviable, from mortgages to investments. \n\nGlobal carbon emissions are still rising and current policies will result in a rise in global temperature between 2.2C and 3.4C above pre-industrial levels. The damage at 3C will be so great that governments will be unable to provide financial bailouts and it will be impossible to adapt to many climate impacts, said Thallinger, who is also the chair of the German company's investment board and was previously C",
        "id": 2476614,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/03/1820226/climate-crisis-on-track-to-destroy-capitalism-warns-top-insurer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Climate Crisis On Track To Destroy Capitalism, Warns Top Insurer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T18:45:31+00:00",
        "description": "Climate startup Aspiration, which boasted a roster of celebrity backers and arranged carbon credits for Meta Platforms, Microsoft and other large companies, filed bankruptcy weeks after its co-founder was arrested on fraud charges. From a report: CTN Holdings, as the company is now known, has about $170 million in debt. The goal of the bankruptcy is to sell its assets as quickly as possible in order to repay creditors, chief restructuring officer Miles Staglik said in a court filing. The pool of potential bidders is small and the nature of the CTN's ventures will likely require more cash and \"long term horizons before any potential value could be realized for creditors,\" Staglik said. \n\nThe bankruptcy was filed after co-founder Joseph Sanberg was charged by federal prosecutors with conspiring to defraud two investor funds of at least $145 million, according to a US Department of Justice announcement earlier this month. The charges involve his personal conduct and don't implicate CTN ",
        "id": 2476615,
        "language": null,
        "link": "https://slashdot.org/story/25/04/03/1653226/climate-firm-that-partnered-with-meta-microsoft-goes-bankrupt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Climate Firm That Partnered With Meta, Microsoft Goes Bankrupt",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T18:45:31+00:00",
        "description": "Intel has unveiled a refresh of its iconic brand identity, introducing the slogan \"That's the power of Intel Inside\" to reconnect with consumers and highlight the chipmaker's role in modern computing. The new campaign resurrects the familiar \"Intel Inside\" theme that helped transform the company into a household name in the 1990s, when Intel's marketing strategy directly targeted consumers rather than system designers. \n\nBrett Hannath, Intel's chief marketing officer, said the message reflects the company's belief that its products can unlock potential for employees, customers, consumers and partners. The original \"Intel Inside\" campaign, launched in 1991, revolutionized tech marketing by making processors a key selling point for PCs with its recognizable sticker and five-note jingle. The strategy helped Intel differentiate itself from competitors like AMD and Cyrix during the PC market explosion.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"h",
        "id": 2476616,
        "language": null,
        "link": "https://slashdot.org/story/25/04/03/1611223/intel-refreshes-iconic-brand?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Refreshes Iconic Brand",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T18:45:31+00:00",
        "description": "Microsoft has pulled back on data center projects around the world, suggesting the company is taking a harder look at its plans to build the server farms powering artificial intelligence and the cloud. From a report: The software company has recently halted talks for, or delayed development of, sites in Indonesia, the UK, Australia, Illinois, North Dakota and Wisconsin, according to people familiar with the situation. Microsoft is widely seen as a leader in commercializing AI services, largely thanks to its close partnership with OpenAI. Investors closely track Microsoft's spending plans to get a sense of long-term customer demand for cloud and AI services. \n\nIt's hard to know how much of the company's data center pullback reflects expectations of diminished demand versus temporary construction challenges, such as shortages of power and building materials. Some investors have interpreted signs of retrenchment as an indication that projected purchases of AI services don't justify Micr",
        "id": 2476619,
        "language": null,
        "link": "https://slashdot.org/story/25/04/03/144259/microsoft-pulls-back-on-data-centers-from-chicago-to-jakarta?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Pulls Back on Data Centers From Chicago To Jakarta",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T18:45:31+00:00",
        "description": "databasecowgirl writes: Commenting in The Times on the absurdity of Meta's copyright infringement claims, Caitlin Moran defines Schrodinger's economics: where a company is both [one of] the most valuable on the planet yet also too poor to pay for the materials it profits from. \n\nUltimately \"move fast and break things\" means breaking other people's things. Or, possibly worse, going full 'The Talented Mr Ripley': slowly feeling so entitled to the things you are enamored of that you end up clubbing out the brains of your beloved in a boat.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Schrodinger's+Economics%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F03%2F1447221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F03%2F1447221%2Fschro",
        "id": 2476618,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/03/1447221/schrodingers-economics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Schrodinger's Economics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T13:17:23+00:00",
        "description": "Longtime Slashdot reader theodp writes: A coalition of Washington state business leaders -- which includes Microsoft President Brad Smith and Amazon Chief Legal Officer David Zapolsky -- released a letter Wednesday urging state lawmakers to reconsider recently proposed tax and budget measures. \"I actually think it's an almost unprecedented outpouring of support from across the business community,\" said Microsoft's Smith in an interview. In their letter, which reads in part like it could have been penned by a GenAI Marie Antoinette, the WA business leaders question whether any more spending is warranted given how poorly Washington's 4th and 8th graders compare to children in the rest of the nation on test scores. The letter also laments the increase in WA's homeless population as it celebrates WA Governor Bob Ferguson's announcement that he would not sign a proposed wealth tax.\n \nFrom the letter: \"We have long partnered with you in many areas, including education funding. Despite more",
        "id": 2475323,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/03/0253238/microsoft-amazon-execs-call-out-washingtons-low-performing-9-year-olds-in-tax-pushback?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft, Amazon Execs Call Out Washington's Low-Performing 9-Year-Olds In Tax Pushback",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T11:09:22+00:00",
        "description": "The European Space Agency's short film Space Debris: Is it a Crisis? highlights the growing danger of orbital clutter, warning that \"70% of the 20,000 satellites ever launched remain in space today, orbiting alongside hundreds of millions of fragments left behind by collisions, explosions and intentional destruction.\" Inkl reports: The approximately eight-minute-long film \"Space Debris: Is it a Crisis?\" attempts to answer its conjecture with supportive statistics and orbital projections. [...] The film also mentions that the kind of Earth orbit matters when discussing whether we're in a space junk \"crisis\" -- though unfortunately, orbits at risk appear to be those with satellites that help with communication and navigation, as well as our fight against another primarily human-driven crisis: global warming. Still, the film emphasizes that solutions ought to be thought of carefully: \"True sustainability is complex, and rushed solutions risk creating the problem of burden-shifting.\" You",
        "id": 2474308,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/03/0248204/esas-new-documentary-paints-worrying-picture-of-earths-orbital-junk-problem?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "ESA's New Documentary Paints Worrying Picture of Earth's Orbital Junk Problem",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T07:52:29+00:00",
        "description": "Amazon and United Launch Alliance will launch 27 full-scale satellites on April 9 as part of Amazon's Project Kuiper, marking the company's first major step toward building a global satellite internet network to rival SpaceX's Starlink. GeekWire reports: ULA said the three-hour window for the Atlas V rocket's liftoff from Cape Canaveral Space Force Station's Space Launch Complex 41 in Florida is scheduled to open at noon ET (9 a.m. PT) that day. ULA is planning a live stream of launch coverage via its website starting about 20 minutes ahead of liftoff. Amazon said next week's mission -- known as Kuiper-1 or KA-1 (for Kuiper Atlas 1) -- will put 27 Kuiper satellites into orbit at an altitude of 280 miles (450 kilometers).\n \nULA launched two prototype Kuiper satellites into orbit for testing in October 2023, but KA-1 will mark Amazon's first full-scale launch of a batch of operational satellites designed to bring high-speed internet access to millions of people around the world. [...] ",
        "id": 2473231,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/03/0237250/amazon-set-to-launch-first-operational-satellites-for-project-kuiper-network?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Set To Launch First Operational Satellites For Project Kuiper Network",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T03:32:26+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: A \"vibe coded\" AI app developed by entrepreneur and Y Combinator group partner Tom Blomfield has generated recipes that gave users instruction on how to make \"Cyanide Ice Cream,\" \"Thick White Cum Soup,\" and \"Uranium Bomb,\" using those actual substances as ingredients. Vibe coding, in case you are unfamiliar, is the new practice where people, some with limited coding experience, rapidly develop software with AI assisted coding tools without overthinking how efficient the code is as long as it's functional. This is how Blomfield said he made RecipeNinja.AI. [...] The recipe for Cyanide Ice Cream was still live on RecipeNinja.AI at the time of writing, as are recipes for Platypus Milk Cream Soup, Werewolf Cream Glazing, Cholera-Inspired Chocolate Cake, and other nonsense. Other recipes for things people shouldn't eat have been removed.\n \nIt also appears that Blomfield has introduced content moderation since users discovered they could ",
        "id": 2472225,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/03/0230255/vibe-coded-ai-app-generates-recipes-with-very-few-guardrails?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Vibe Coded AI App Generates Recipes With Very Few Guardrails",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T02:28:26+00:00",
        "description": "Robotics and machine learning engineer Naveen Kul developed WattWise, a lightweight open-source CLI tool that monitors power usage via smart plugs and throttles system performance based on electricity pricing and peak hours. Tom's Hardware reports: The simple program, called WattWise, came about when Naveen built a dual-socket EPYC workstation with plans to add four GPUs. It's a power-intensive setup, so he wanted a way to monitor its power consumption using a Kasa smart plug. The enthusiast has released the monitoring portion of the project to the public now, but the portion that manages clocks and power will be released later. Unfortunately, the Kasa Smart app and the Home Assistant dashboard was inconvenient and couldn't do everything he desired. He already had a terminal window running monitoring tools like htop, nvtop, and nload, and decided to take matters into his own hands rather than dealing with yet another app.\n \nNaveen built a terminal-based UI that shows power consumptio",
        "id": 2471998,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/03/0110212/open-source-tool-designed-to-throttle-pc-and-server-performance-based-on-electricity-pricing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Open-Source Tool Designed To Throttle PC and Server Performance Based On Electricity Pricing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T01:22:33+00:00",
        "description": "A joint investigation found that at least five popular VPN apps on the App Store and Google Play have ties to Qihoo 360, a Chinese company with military links. Apple has since removed two of the apps but has not confirmed the status of the remaining three, which 9to5Mac notes have \"racked up more than a million downloads.\" The five apps in question are Turbo VPN, VPN Proxy Master, Thunder VPN, Snap VPN, and Signal Secure VPN (not associated with the Signal messaging app). The Financial Times reports: At least five free virtual private networks (VPNs) available through the US tech groups' app stores have links to Shanghai-listed Qihoo 360, according to a new report by research group Tech Transparency Project, as well as additional findings by the Financial Times. Qihoo, formally known as 360 Security Technology, was sanctioned by the US in 2020 for alleged Chinese military links. The US Department of Defense later added Qihoo to a list of Chinese military-affiliated companies [...] In",
        "id": 2471741,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/02/236215/five-vpn-apps-in-the-app-store-had-links-to-chinese-military?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Five VPN Apps In the App Store Had Links To Chinese Military",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T01:22:33+00:00",
        "description": "NaNoWriMo, the nonprofit behind the annual novel-writing challenge, is shutting down after 20 years but will keep its websites online temporarily so users can retrieve their content. The Guardian reports: A 27-minute YouTube video posted the same day by the organization's interim executive director Kilby Blades explained that it had to close due to ongoing financial problems, which were compounded by reputational damage. In November 2023, several community members complained to the nonprofit's board, Blades said. They believed that staff had mishandled accusations made in May 2023 that a NaNoWriMo forum moderator was grooming children on a different website. The moderator was eventually removed, though this was for unrelated code of conduct violations and occurred \"many weeks\" after the initial complaints. In the wake of this, community members came forward with other complaints related to child safety on the NaNoWriMo sites.\n \nThe organization was also widely criticized last year ov",
        "id": 2471740,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/03/015223/nanowrimo-to-close-after-20-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NaNoWriMo To Close After 20 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T00:09:56+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Anthropic announced on Wednesday that it's launching a new Claude for Education tier, an answer to OpenAI's ChatGPT Edu plan. The new tier is aimed at higher education, and gives students, faculty, and other staff access to Anthropic's AI chatbot, Claude, with a few additional capabilities. One piece of Claude for Education is \"Learning Mode,\" a new feature within Claude Projects to help students develop their own critical thinking skills, rather than simply obtain answers to questions. With Learning Mode enabled, Claude will ask questions to test understanding, highlight fundamental principles behind specific problems, and provide potentially useful templates for research papers, outlines, and study guides.\n \nAnthropic says Claude for Education comes with its standard chat interface, as well as \"enterprise-grade\" security and privacy controls. In a press release shared with TechCrunch ahead of launch, Anthropic said university adm",
        "id": 2471489,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/02/232215/anthropic-launches-an-ai-chatbot-plan-for-colleges-and-universities?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anthropic Launches an AI Chatbot Plan For Colleges and Universities",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-03T00:09:56+00:00",
        "description": "According to Bloomberg, India is set for a surge in tech startup IPOs valued at around $100 billion by 2027, with major players like Flipkart, PhonePe, and Oyo preparing to go public. From a report: A report from Indian investment bank The Rainmaker Group suggests that the new wave of IPO hopefuls is in a stronger financial position than their predecessors. Many of the startups that were listed during the 2021-2022 boom struggled post-IPO, with fintech firm Paytm losing roughly 63% of its value and beauty retailer Nykaa slipping 4% since going public.\n \n\"The financial health of companies set to list in the next two years is significantly better than those that went public earlier,\" said Kashyap Chanchani, managing partner at Rainmaker. He noted that two-thirds of the firms eyeing IPOs are already profitable and have improved transparency, making them more attractive to investors.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/",
        "id": 2471490,
        "language": null,
        "link": "https://slashdot.org/story/25/04/02/2152245/india-set-for-100-billion-startup-ipo-surge-by-2027?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "India Set For $100 Billion Startup IPO Surge By 2027",
        "vote": 0
    }
]