[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-01T17:20:02.579082+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-01T13:30:22+00:00",
        "description": "Everstone Studio's Where Winds Meet has wrapped its final closed beta, and all that's left is for NetEase to announce a release date for the rest of the world. Thus far, the mix of open-world exploration, fast-paced combat and gorgeous art direction has left us beyond impressed, especially considering this is only a fraction of what the full game offers.\n\nBut even more noteworthy is that Where Winds Meet channels the Wuxia genre into its gameplay, narrative and presentation to achieve something that's often unseen in video games. From the turbulent period and story set-up, which sees players venturing out into the unknown and dealing with mysterious foes, to the atmosphere and portrayal of the Five Dynasties and Ten Kingdoms period, it's a dangerous yet enticing place.\n\nWith tons of content for single-player and multiplayer, Where Winds Meet seems poised for success. Learn more about the closed beta and how Everstone channels Wuxia in the best ways.",
        "id": 3224902,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=W7uiB_RPWQE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/W7uiB_RPWQE/hqdefault.jpg",
        "title": "WHERE WINDS MEET Might Just Be the Most Magical Game You’ll Play This Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-01T17:20:02.761560+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-01T09:30:06+00:00",
        "description": "Engaging in melee combat is always going to be fun. However, some video games nail their combat systems better than others, making the entire experience of taking on deadly opponents all the more engaging, and perhaps more rewarding, than titles in which combat exists only as an afterthought. \n\nWe've put together a list of games that we believe take combat quite seriously, and encourage you to do the same in the process. Each of these titles made us think on our feet and respond to the ebb and flow of every fight with swift grace and brutal efficiency, making them rank easily among our favorite melee games to tackle on a PS5.",
        "id": 3224903,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=DawF0GP0Mt0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DawF0GP0Mt0/hqdefault.jpg",
        "title": "10 MUST  PLAY PS5 Games With The Best Melee Combat",
        "vote": 0
    }
]