[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T23:30:24+00:00",
        "description": "Mozilla plans to introduce a suite of paid professional services for its open-source Thunderbird email client, transforming the application into a comprehensive communication platform. Dubbed \"Thunderbird Pro,\" the package aims to compete with established ecosystems like Gmail and Office 365 while maintaining Mozilla's commitment to open-source software. \n\nThe Pro tier will include four core services: Thunderbird Appointment for streamlined scheduling, Thunderbird Send for file sharing (reviving the discontinued Firefox Send), Thunderbird Assist offering AI capabilities powered by Flower AI, and Thundermail, a revamped email client built on Stalwart's open-source stack.\nInitially, Thunderbird Pro will be available free to \"consistent community contributors,\" with paid access for other users. \n\nMozilla Managing Director Ryan Sipes indicated the company may consider limited free tiers once the service establishes a sustainable user base. This initiative follows Mozilla's 2023 announcem",
        "id": 2463132,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/01/2046253/mozilla-to-launch-thunderbird-pro-paid-services?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mozilla To Launch 'Thunderbird Pro' Paid Services",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T22:24:19+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: A professional YouTuber in Queensland has been ordered to pay $350,000 plus interest and costs to the former world record score holder for Donkey Kong, after the Brisbane district court found the YouTuber had defamed him \"recklessly\" with false claims of a link between a lawsuit and another YouTuber's suicide. William \"Billy\" Mitchell, an American gamer who had held world records in Donkey Kong and Pac-Man going back to 1982, as recognized by the Guinness World Records and the video game database Twin Galaxies, brought the case against Karl Jobst, seeking $400,000 in general damages and $50,000 in aggravated damages.\n \nJobst, who makes videos about \"speed running\" (finishing games as fast as possible), as well as gaming records and cheating in games, made a number of allegations against Mitchell in a 2021 YouTube video. He accused Mitchell of cheating, and \"pursuing unmeritorious litigation\" against others who had also accused hi",
        "id": 2462741,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/01/2038234/donkey-kong-champion-wins-defamation-case-against-australian-youtuber-karl-jobst?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Donkey Kong Champion Wins Defamation Case Against Australian YouTuber Karl Jobst",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T22:24:19+00:00",
        "description": "The FTC has warned that any buyer of 23andMe must honor the company's current privacy policy, which ensures consumers retain control over their genetic data and can delete it at will. FTC Chair Andrew Ferguson emphasized that such promises must be upheld, given the uniquely sensitive and immutable nature of genetic information. The Record reports: The letter, sent to the DOJ's United States Trustee Program, highlights several assurances 23andMe makes in its privacy policy, including that users are in control of their data and can determine how and for what purposes it is used. The company also gives users the ability to delete their data at will, the letter says, arguing that 23andMe has made \"direct representations\" to consumers about how it uses, shares and safeguards their personal information, including in the case of bankruptcy.\n \nPointing to statements that the company's leadership has made asserting that user data should be considered an asset, Ferguson highlighted that 23andM",
        "id": 2462742,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/01/2023246/ftc-says-23andme-purchaser-must-uphold-existing-privacy-policy-for-data-handling?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FTC Says 23andMe Purchaser Must Uphold Existing Privacy Policy For Data Handling",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T21:19:53+00:00",
        "description": "A federal judge struck down Arkansas' Social Media Safety Act, ruling it unconstitutional for broadly restricting both adult and minor speech and imposing vague requirements on platforms. Engadget reports: In a ruling (PDF), Judge Timothy Brooks said that the law, known as Act 689 (PDF), was overly broad. \"Act 689 is a content-based restriction on speech, and it is not targeted to address the harms the State has identified,\" Brooks wrote in his decision. \"Arkansas takes a hatchet to adults' and minors' protected speech alike though the Constitution demands it use a scalpel.\" Brooks also highlighted the \"unconstitutionally vague\" applicability of the law, which seemingly created obligations for some online services, but may have exempted services which had the \"predominant or exclusive function [of]... direct messaging\" like Snapchat.\n \n\"The court confirms what we have been arguing from the start: laws restricting access to protected speech violate the First Amendment,\" NetChoice's Ch",
        "id": 2462398,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/01/2016219/arkansas-social-media-age-verification-law-blocked-by-federal-judge?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Arkansas Social Media Age Verification Law Blocked By Federal Judge",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T20:15:40+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: What does it take to get OpenAI and Anthropic -- two competitors in the AI assistant market -- to get along? Despite a fundamental difference in direction that led Anthropic's founders to quit OpenAI in 2020 and later create the Claude AI assistant, a shared technical hurdle has now brought them together: How to easily connect their AI models to external data sources. The solution comes from Anthropic, which developed and released an open specification called Model Context Protocol (MCP) in November 2024. MCP establishes a royalty-free protocol that allows AI models to connect with outside data sources and services without requiring unique integrations for each service.\n \n\"Think of MCP as a USB-C port for AI applications,\" wrote Anthropic in MCP's documentation. The analogy is imperfect, but it represents the idea that, similar to how USB-C unified various cables and ports (with admittedly a debatable level of success), MCP aims ",
        "id": 2461965,
        "language": null,
        "link": "https://slashdot.org/story/25/04/01/208221/mcp-the-new-usb-c-for-ai-thats-bringing-fierce-rivals-together?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "MCP: the New 'USB-C For AI' That's Bringing Fierce Rivals Together",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T19:09:45+00:00",
        "description": "With America's national debt sitting comfortably over the $36.2 trillion mark, BlackRock CEO Larry Fink is warning the burden could one day be the reason the dollar is dethroned as the reserve currency of the world.\n From a report: He argues that decentralized currencies like Bitcoin could replace the dollar as worldwide organizations lose faith in national currencies and seek an independent solution. Fink explained his theory in his 2025 letter to shareholders, writing: \"The U.S. has benefited from the dollar serving as the world's reserve currency for decades. But that's not guaranteed to last forever. \n\n\"The national debt has grown at three times the pace of GDP since Times Square's debt clock started ticking in 1989. This year, interest payments will surpass $952 billion -- exceeding defense spending. By 2030, mandatory government spending and debt service will consume all federal revenue, creating a permanent deficit. If the U.S. doesn't get its debt under control, if deficits k",
        "id": 2461512,
        "language": null,
        "link": "https://slashdot.org/story/25/04/01/1840253/larry-fink-says-bitcoin-could-replace-the-dollar-as-the-worlds-reserve-currency-because-of-national-debt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Larry Fink Says Bitcoin Could Replace the Dollar as the World's Reserve Currency Because of National Debt",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T16:59:30+00:00",
        "description": "Google's AI arm DeepMind has been holding back the release of its world-renowned research, as it seeks to retain a competitive edge in the race to dominate the burgeoning AI industry. From a report: The group, led by Nobel Prize-winner Sir Demis Hassabis, has introduced a tougher vetting process and more bureaucracy that made it harder to publish studies about its work on AI, according to seven current and former research scientists at Google DeepMind. Three former researchers said the group was most reluctant to share papers that reveal innovations that could be exploited by competitors, or cast Google's own Gemini AI model in a negative light compared with others. \n\nThe changes represent a significant shift for DeepMind, which has long prided itself on its reputation for releasing groundbreaking papers and as a home for the best scientists building AI. Meanwhile, huge breakthroughs by Google researchers -- such as its 2017 \"transformers\" paper that provided the architecture behind ",
        "id": 2460340,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/01/1648250/deepmind-is-holding-back-release-of-ai-research-to-give-google-an-edge?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DeepMind is Holding Back Release of AI Research To Give Google an Edge",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T16:59:30+00:00",
        "description": "Credit card interest rates, which averaged 23% in 2023, are significantly higher than any other major loan product primarily due to non-diversifiable default risk and banks' market power, according to research published by the Federal Reserve Bank of New York. \n\nThe comprehensive study, which analyzed 330 million monthly credit card accounts, found that while high default losses contribute to elevated rates, they explain only part of the picture. Even high-FICO borrowers pay spreads exceeding 7% above the federal funds rate. Researchers determined that credit card banks have substantial pricing power, achieved through exceptionally high operating expenses -- about 4-5% of dollar balances annually -- with marketing costs ten times higher than those at other banks. \n\n\"Credit card charge-off rates are highly correlated with default rates on banks' other loans as well as on corporate bonds,\" the researchers said, noting that default risk cannot be diversified away across lending markets,",
        "id": 2460341,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/01/1542236/study-reveals-why-credit-card-interest-rates-remain-stubbornly-high?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Study Reveals Why Credit Card Interest Rates Remain Stubbornly High",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T15:55:45+00:00",
        "description": "London's mayor has axed a cyber crime helpline for the victims of online abuse, triggering a backlash from campaigners who argue that women and girls will be left struggling to access vital support. From a report: The service, which was shut down on Tuesday, assisted victims of fraud, revenge porn and cyberstalking to protect their digital identity. During its 18-months of operation it led to 2,060 cases being opened. The helpline was launched in 2023 as a one-year pilot scheme with $220,000 in funding from the Mayor's Office for Policing and Crime (Mopac), and was later extended by six months. \n\nConservative London Assembly member Emma Best said an informal evaluation showed the helpline \"was working\" and was going to be extended for another year. However, Sadiq Khan said that the scheme would be closed. \"It was a pilot and pilots are what they say on the tin&#226;... we will receive an end of project report, we have collected the data and the results of that report will inform our ",
        "id": 2459684,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/01/1531202/london-mayor-axes-cyber-crime-victim-support-line?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "London Mayor Axes Cyber Crime Victim Support Line",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T14:49:51+00:00",
        "description": "Economic models have systematically underestimated how global heating will affect people's wealth, according to a new study that finds 4C warming will make the average person 40% poorer -- an almost four-fold increase on some estimates. The Guardian: The study by Australian scientists suggests average per person GDP across the globe will be reduced by 16% even if warming is kept to 2C above pre-industrial levels. This is a much greater reduction than previous estimates, which found the reduction would be 1.4%. \n\nScientists now estimate global temperatures will rise by 2.1C even if countries hit short-term and long-term climate targets. Criticisms have mounted in recent years that a set of economic tools known as integrated assessment models (IAM) -- used to guide how much governments should invest in cutting greenhouse gas emissions -- have failed to capture major risks from climate change, particularly extreme weather events. The new study, in the journal Environmental Research Lett",
        "id": 2459091,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/01/135253/average-person-will-be-40-poorer-if-world-warms-by-4c-new-research-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Average Person Will Be 40% Poorer If World Warms By 4C, New Research Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T14:49:51+00:00",
        "description": "Google is rolling out a new encryption model for Gmail that allows enterprise users to send encrypted messages without requiring recipients to use custom software or exchange encryption certificates. The feature, launching in beta today, initially supports encrypted emails within the same organization, with plans to expand to all Gmail inboxes \"in the coming weeks\" and third-party email providers \"later this year.\" \n\nUnlike Gmail's current S/MIME-based encryption, the new system lets users simply toggle \"additional encryption\" in the email draft window. Non-Gmail recipients will receive a link to access messages through a guest Google Workspace account, while Gmail users will see automatically decrypted emails in their inbox.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Gmail+is+Making+It+Easier+For+Businesses+To+Send+Encrypted+Emails+To+Anyone%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F04%2F01%2F1440224%2F%",
        "id": 2459090,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/01/1440224/gmail-is-making-it-easier-for-businesses-to-send-encrypted-emails-to-anyone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gmail is Making It Easier For Businesses To Send Encrypted Emails To Anyone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T13:44:27+00:00",
        "description": "An anonymous reader quotes a report from Reuters: China's Xiaomi said on Tuesday that it was actively cooperating with police after a fatal accident involving a SU7 electric vehicle on March 29 and that it had handed over driving and system data. The incident marks the first major accident involving the SU7 sedan, which Xiaomi launched in March last year and since December has outsold Tesla's Model 3 on a monthly basis. Xiaomi's shares, which had risen by 34.8% year to date, closed down 5.5% on Wednesday, underperforming a 0.2% gain in the Hang Seng Tech index. Xiaomi did not disclose the number of casualties but said initial information showed the car was in the Navigate on Autopilot intelligent-assisted driving mode before the accident and was moving at 116 kph (72 mph).\n \nA driver inside the car took over and tried to slow it down but then collided with a cement pole at a speed of 97 kph, Xiaomi said. The accident in Tongling in the eastern Chinese province of Anhui killed the dri",
        "id": 2458534,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/01/1129255/xiaomi-ev-involved-in-first-fatal-autopilot-crash?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Xiaomi EV Involved in First Fatal Autopilot Crash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T11:33:58+00:00",
        "description": "Britain's flagship AI agency will slash the number of projects it backs and prioritize work on defense, environment and health as it seeks to respond to technological advances and criticism of its record. From a report: The Alan Turing Institute -- named after the pioneering British computer scientist -- will shut or offload almost a quarter of its 101 current initiatives and is considering job cuts as part of a change programme that led scores of staff to write a letter expressing their loss of confidence in the leadership in December. \n\nJean Innes, appointed chief executive in July 2023, argued that huge advances in AI meant the Turing needed to modernise after being founded as a national data science institute by David Cameron's government a decade ago this month. \"The Turing has chalked up some really great achievements,\" Innes said in an interview. \"[But we need] a big strategic shift to a much more focused agenda on a small number of problems that have an impact in the real wor",
        "id": 2457480,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/01/1036204/alan-turing-institute-plans-revamp-in-face-of-criticism-and-technological-change?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Alan Turing Institute Plans Revamp in Face of Criticism and Technological Change",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T06:09:03+00:00",
        "description": "Anthropic said it will start sweeping physical offices for hidden devices as part of a ramped-up security effort as the AI race intensifies. From a report: The company, backed by Amazon and Google, published safety and security updates in a blog post on Monday, and said it also plans to establish an executive risk council and build an in-house security team. Anthropic closed its latest funding round earlier this month at a $61.5 billion valuation, which makes it one of the highest-valued AI startups. \n\nIn addition to high-growth startups, tech giants including Google, Amazon and Microsoft are racing to announce new products and features. Competition is also coming from China, a risk that became more evident earlier this year when DeepSeek's AI model went viral in the U.S. Anthropic said in the post that it will introduce \"physical\" safety processes, such as technical surveillance countermeasures -- or the process of finding and identifying surveillance devices that are used to spy on",
        "id": 2455666,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/01/0226252/anthropic-will-begin-sweeping-offices-for-hidden-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anthropic Will Begin Sweeping Offices For Hidden Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T03:58:25+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The first flight of Isar Aerospace's Spectrum rocket didn't last long on Sunday. The booster's nine engines switched off as the rocket cartwheeled upside-down and fell a short distance from its Arctic launch pad in Norway, punctuating the abbreviated test flight with a spectacular fiery crash into the sea. If officials at Isar Aerospace were able to pick the outcome of their first test flight, it wouldn't be this. However, the result has precedent. The first launch of SpaceX's Falcon 1 rocket in 2006 ended in similar fashion. \"Today, we know twice as much about our launch system as yesterday before launch,\" Daniel Metzler, Isar's co-founder and CEO, wrote on X early Monday. \"Can't beat flight testing. Ploughing through lots of data now.\"\n \nIsar Aerospace, based in Germany, is the first in a crop of new European rocket companies to attempt an orbital launch. If all went according to plan, Isar's Spectrum rocket would have arced to",
        "id": 2455163,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/31/217214/first-flight-of-isar-aerospaces-spectrum-rocket-lasted-just-40-seconds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "First Flight of Isar Aerospace's Spectrum Rocket Lasted Just 40 Seconds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T01:49:43+00:00",
        "description": "Intel Chief Executive Officer Lip-Bu Tan said the chipmaker will spin off assets that aren't central to its mission and create new products including custom semiconductors to try to better align itself with customers. From a report: Intel needs to replace the engineering talent it has lost, improve its balance sheet and better attune manufacturing processes to meet the needs of potential customers, Tan said. Speaking at his first public appearance as CEO, at the Intel Vision conference Monday in Las Vegas, Tan didn't specify what parts of Intel he believes are no longer central to its future. \n\n\"We have a lot of hard work ahead,\" Tan said, addressing the company's customers in the audience. \"There are areas where we've fallen short of your expectations.\" The veteran semiconductor executive is trying to restore the fortunes of a company that dominated an industry for decades, but now finds itself chasing rivals in most of the areas that define success in the field. A key question conf",
        "id": 2454742,
        "language": null,
        "link": "https://slashdot.org/story/25/04/01/0036239/intel-ceo-lip-bu-tan-says-company-will-spin-off-non-core-units?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel CEO Lip-Bu Tan Says Company Will Spin Off Non-Core Units",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T01:49:43+00:00",
        "description": "Software engineer Sergey Tselovalnikov weighs in on the new hype: The term caught on and Twitter quickly flooded with posts about how AI has radically transformed coding and will soon replace all software engineers. While AI undeniably impacts the way we write code, it hasn't fundamentally changed our role as engineers. Allow me to explain. \n\n[...] Vibe coding is interacting with the codebase via prompts. As the implementation is hidden from the \"vibe coder\", all the engineering concerns will inevitably get ignored. Many of the concerns are hard to express in a prompt, and many of them are hard to verify by only inspecting the final artifact. Historically, all engineering practices have tried to shift all those concerns left -- to the earlier stages of development when they're cheap to address. Yet with vibe coding, they're shifted very far to the right -- when addressing them is expensive. \n\nThe question of whether an AI system can perform the complete engineering cycle and build an",
        "id": 2454741,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/04/01/0129224/there-is-no-vibe-engineering?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'There is No Vibe Engineering'",
        "vote": 0
    }
]