[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T14:00:19+00:00",
        "description": "One of the most anticipated games of May, if not 2025 itself, id Software's DOOM: The Dark Ages fills in the gap between the original trilogy and DOOM (2016). Focusing on the Slayer's life, it showcases how the legend earned his reputation while slaying demons in a grim medieval landscape.\n\nThus far, hands-on impressions and previews, especially the most recent, have been quite positive. The combat has received extensive praise for its new additions, from blocking damage with the Shield Saw and ricocheting it against enemy skulls to smacking them with a flail or unleashing the various new weapons. Even piloting an Atlan mech and raining death with the dragon mount looks incredibly hype.\n\nA few things still require polish and may induce some worry before launch, but overall, DOOM: The Dark Ages looks like an unforgettable experience. Here are six things we're hyped about (and four things causing concern) ahead of its launch on May 15th.",
        "id": 2459126,
        "language": null,
        "link": "https://www.youtube.com/watch?v=IsNQ8_MVJ4M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IsNQ8_MVJ4M/hqdefault.jpg",
        "title": "DOOM: The Dark Ages - 6 Reasons We're Hyped (And 4 Reasons For Concern)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-01T09:30:07+00:00",
        "description": "Role-playing games come and go in today's industry, which is a testament to the sheer volume of titles in the genre. However, every so often, something like Sandfall Interactive's Clair Obscur: Expedition 33 comes along and truly stands out with its creative vision.\n\nAs part of the latest expedition, players venture forth on a quest to defeat her, and surely enough, things go awry. Boasting all-star voice-acting talents like Charlie Cox, Ben Starr, and Andy Serkis alongside a gorgeous visual style made possible by Unreal Engine 5, Expedition 33 looks special.\n\nIt also doesn't hurt that Sandfall promises a lengthy adventure and a dynamic combat system. Launching on April 24th for Xbox Series X/S, PS5, and PC (and day one on Game Pass), here's everything you need to know about the title.",
        "id": 2457052,
        "language": null,
        "link": "https://www.youtube.com/watch?v=6B3YhIL_3wM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6B3YhIL_3wM/hqdefault.jpg",
        "title": "Clair Obscur: Expedition - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]