[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T23:45:47.420319+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T22:50:00+00:00",
        "description": "An anonymous reader shared this report from The Conversation:\n\nTo make interplanetary travel faster, safer, and more efficient, scientists need breakthroughs in propulsion technology. Artificial intelligence is one type of technology that has begun to provide some of these necessary breakthroughs. We're a team of engineers and graduate students who are studying how AI in general, and a subset of AI called machine learning in particular, can transform spacecraft propulsion. From optimizing nuclear thermal engines to managing complex plasma confinement in fusion systems, AI is reshaping propulsion design and operations. It is quickly becoming an indispensable partner in humankind's journey to the stars... \n\nEarly nuclear thermal propulsion designs from the 1960s, such as those in NASA's NERVA program, used solid uranium fuel molded into prism-shaped blocks. Since then, engineers have explored alternative configurations &mdash; from beds of ceramic pebbles to grooved rings with intricate",
        "id": 4204076,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/30/2247202/can-ai-transform-space-propulsion",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Can AI Transform Space Propulsion?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T21:44:37.333177+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T21:34:00+00:00",
        "description": "An anonymous reader shared this report from the Associated Press:\n\n\nThe information needed to decipher the last remaining unsolved secret message embedded within a sculpture at CIA headquarters in Virginia sold at auction for nearly $1 million, the auction house announced Friday. The winner will get a private meeting with the 80-year-old artist to go over the codes and charts in hopes of continuing what he's been doing for decades: interacting with would-be cryptanalyst sleuths. \n\nThe archive owned by the artist who created Kryptos, Jim Sanborn, was sold to an anonymous bidder for $963,000, according to RR Auction of Boston. The archive includes documents and coding charts for the sculpture, dedicated in 1990. Three of the messages on the 10-foot-tall (3-meter) sculpture &mdash; known as K1, K2 and K3 &mdash; have been solved, but a solution for the fourth, K-4, has frustrated the experts and enthusiasts who have tried to decipher the S-shaped copper screen... One side has a series of",
        "id": 4203560,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/30/2130226/info-to-decipher-secret-message-in-kryptos-sculpture-at-cia-hq-auctioned-for-nearly-1m",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Info to Decipher Secret Message in Kryptos Sculpture at CIA HQ Auctioned for Nearly $1M",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T19:43:26.013803+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T19:35:00+00:00",
        "description": "A gauge of risk on Oracle debt \"reached a three-year high in November,\" reports Bloomberg. \n\n\"And things are only going to get worse in 2026 unless the database giant is able to assuage investor anxiety about a massive artificial intelligence spending spree, according to Morgan Stanley.\"\n\n\n\nA funding gap, swelling balance sheet and obsolescence risk are just some of the hazards Oracle is facing, according to Lindsay Tyler and David Hamburger, credit analysts at the brokerage. \n\nThe cost of insuring Oracle's debt against default over the next five years rose to 1.25 percentage point a year on Tuesday, according to ICE Data Services. The price on the five-year credit default swaps is at risk of toppling a record set in 2008 as concerns over the company's borrowing binge to finance its AI ambitions continue to spur heavy hedging by banks and investors, they warned in a note Wednesday. The CDS could break through 1.5 percentage point in the near term and could approach 2 percentage points",
        "id": 4202930,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/30/1933216/morgan-stanley-warns-oracle-credit-protection-nearing-record-high",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Morgan Stanley Warns Oracle Credit Protection Nearing Record High",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T18:42:03.391786+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T18:34:00+00:00",
        "description": "27 million people live in Australia. But there's a big change coming if you're under 16, reports CNN:\n\n\n\nFrom December 10, sites that meet the Australian government's definition of an \"age-restricted social media platform\" will need to show that they're doing enough to eject or block children under 16 or face fines of up to 49.5 million Australian dollars ($32 million). The list includes Snapchat, Facebook, Instagram, Kick, Reddit, Threads, TikTok, Twitch, X, and YouTube... \n\nMeta says it'll start deactivating accounts and blocking new Facebook, Instagram and Threads accounts from December 4. Under-16s are being encouraged to download their content. Snap says users can deactivate their accounts for up to three years, or until they turn 16... \n\nThere's another sting in the ban, too, coming at the end of the Australian school year before the summer break in the southern hemisphere. For eight weeks, there'll be no school, no teachers &mdash; and no scrolling. For millions of children, it",
        "id": 4202516,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/30/1746201/what-happens-when-you-kick-millions-of-teens-off-social-media-australias-about-to-find-out",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happens When You Kick Millions of Teens Off Social Media?  Australia's About to Find Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T18:42:03.624438+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T17:34:00+00:00",
        "description": "\"Amazon suggested its engineers eschew AI code generation tools from third-party companies in favor of its own ,\" reports Reuters, \"a move to bolster its proprietary Kiro service, which it released in July, according to an internal memo viewed by Reuters.\"\n\n\n\nIn the memo, posted to Amazon's internal news site, the company said, \"While we continue to support existing tools in use today, we do not plan to support additional third party, AI development tools. \n\n\"As part of our builder community, you all play a critical role shaping these products and we use your feedback to aggressively improve them,\" according to the memo. \n\n\nThe guidance would seem to preclude Amazon employees from using other popular software coding tools like OpenAI's Codex, Anthropic's Claude Code, and those from startup Cursor. That is despite Amazon having invested about $8 billion into Anthropic and reaching a seven-year $38 billion deal with OpenAI to sell it cloud-computing services...\"To make these experiences",
        "id": 4202517,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/30/048214/amazon-tells-its-engineers-use-our-ai-coding-tool-kiro",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Tells Its Engineers: Use Our AI Coding Tool 'Kiro'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T16:40:52.493341+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T16:34:00+00:00",
        "description": "\"OpenAI is now internally testing 'ads' inside ChatGPT,\" reports BleepingComputer:\n\n\nUp until now, the ChatGPT experience has been completelyfree. While there are premium plans and models, you don't see GPT sell you products or show ads. On the other hand, Google Search has ads that influence your buying behaviour. OpenAI is planning to replicate a similar experience. \n\n As spotted [by software engineer Tibor Blaho] on X.com,ChatGPT Android app 1.2025.329 beta includes new references to an \"ads feature\" with \"bazaar content\", \"search ad\" and \"search ads carousel.\" \n\nThis move could disrupt the web economy,as what most people don't understand is that GPT likely knows more about users than Google. For example, OpenAI could create personalised ads on ChatGPT that promote products that you really want to buy... The leak suggests that ads will initially be limited to the search experience only, but this may change in the future.<p><div class=\"share_submission\" style=\"position:relative;\">\n<",
        "id": 4201855,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/30/0510248/is-openai-preparing-to-bring-ads-to-chatgpt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is OpenAI Preparing to Bring Ads to ChatGPT?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T16:40:52.743787+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T15:34:00+00:00",
        "description": "An anonymous reader shared this report from CBS News:\n\nArtificial intelligence can do the work currently performed by nearly 12% of America's workforce, according to a recentstudy from the Massachusetts Institute of Technology. The researchers, relying on a metric called the \"Iceberg Index\" that measures a job's potential to be automated, conclude that AI already has the cognitive and technical capacity to handle a range of tasks in technology, finance, health care and professional services. The index simulated how more than 150 million U.S. workers across nearly 1,000 occupations interact and overlap with AI's abilities... \n\nAI is also already doingsome of the entry-level jobsthat have historically been reserved for recent college graduates or relatively inexperienced workers, the report notes. \"AI systems now generate more than a billion lines of code each day, prompting companies to restructure hiring pipelines and reduce demand for entry-level programmers,\" the researchers wrote. ",
        "id": 4201856,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/29/1737204/ai-can-already-do-the-work-of-12-of-americas-workforce-researchers-find",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Can Already Do the Work of 12% of America's Workforce, Researchers Find",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T13:23:16.942145+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T12:34:00+00:00",
        "description": "\"There are times when World of Tanks feels less like a videogame and more like a giant ad budget looking for something to be spent on,\" writes PC Gamer.\n\nThis year, all those huge sacks with dollar signs on them have been thrown Benedict Cumberbatch's way, making him the game's newest \"Holiday Ambassador\" and the star of an absolutely bizarre Christmas advert. The story has very little to do with Christmas and, frankly, not much connection to tanks either, featuring Cumberbatch as a sort of chaotic, supernatural therapist trying to bring a meek nerd out of his shell with the help of a chaotic crowd of his other patients. It's a good watch, shedding the usual hard man action star vibe of past celebrity trailers in favour of something that feels more like a mischievous one act play. \n\n\nCumberbatch also portrayed Smaug and Sauron in The Hobbit films (2012-2014), Khan in Star Trek Into Darkness (2013), and Dr. Strange in six Marvel movies. And now Amazon has also hired Cumberbatch for wha",
        "id": 4200643,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/30/0257233/benedict-cumberbatch-films-two-bizarre-holiday-ads-for-world-of-tanks-and-amazon",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Benedict Cumberbatch Films Two Bizarre Holiday Ads: for 'World of Tanks' and Amazon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T09:01:29.236601+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T08:34:00+00:00",
        "description": "\"The internet is being increasingly polluted by AI generated text, images and video,\" argues the site for a new browser extension called Slop Evader. It promises to use Google's search API \"to only return content published before Nov 30th, 2022\" &mdash; the day ChatGPT launched &mdash; \"so you can be sure that it was written or produced by the human hand.\" \n\n404 Media calls it \"a scorched earth approach that virtually guarantees your searches will be slop-free.\"\n\nSlop Evader was created by artist and researcher Tega Brain, who says she was motivated by the growing dismay over the tech industry's unrelenting, aggressive rollout of so-called \"generative AI\" &mdash; despite widespread criticism and the wider public's distaste for it. \"This sowing of mistrust in our relationship with media is a huge thing, a huge effect of this synthetic media moment we're in,\" Brain told 404 Media, describing how tools like Sora 2 have short-circuited our ability to determine reality within a sea of arti",
        "id": 4199475,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/29/1838252/browser-extension-slop-evader-lets-you-surf-the-web-like-its-2022",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Browser Extension 'Slop Evader' Lets You Surf the Web Like It's 2022",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T04:40:30.146751+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T04:34:00+00:00",
        "description": "Earlier this month MasterCard noted that even Walmart now allows its customers to make purchases through ChatGPT. And after polling more than 4,000 consumers in the U.S., Canada, U.K., and UAE, they found \"more than four in 10 consumers already use AI tools to help them shop, including 61% of Gen Z and 57% of millennials.\"\n\nMany (50% of Gen Z and 49% of millennials) say they'd even let AI handle all their gift-buying if it meant avoiding stress. Younger shoppers trust AI's taste, with 51% of Gen Z and 55% of millennials relying on it to deliver unique and thoughtful recommendations (sometimes even more than they trust themselves). The most popular uses include getting personalized product recommendations, confirming the best deal before purchasing, and summarizing thousands of reviews instantly.\nThe bottom line: Shoppers are embracing AI as their new personal assistant &mdash; one that knows their budget, style, and patience level... \n\nIf the 2025 holiday shopper could be summed up in",
        "id": 4198740,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/30/0245229/ai-helps-drive-record-118b-in-black-friday-online-spending",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Helps Drive Record $11.8B in Black Friday Online Spending",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T03:35:52.596372+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T02:34:00+00:00",
        "description": "\"By my count, Linux has over 11% of the desktop market,\" writes ZDNet's Steven Vaughan-Nichols:\n\n\n\nIn StatCounter's latest US numbers, which cover through October, Linux shows up as only 3.49%. But if you look closer, \"unknown\" accounts for 4.21%. Allow me to make an educated guess here: I suspect those unknown desktops are actually running Linux. What else could it be? FreeBSD? Unix? OS/2? Unlikely. In addition, ChromeOS comes in at 3.67%, which strikes me as much too low. Leaving that aside, ChromeOS is a Linux variant. It just uses the Chrome web browser for its interface rather than KDE Plasma, Cinnamon, or another Linux desktop environment. Put all these together, and you get a Linux desktop market share of 11.37%... \n\nIf you want to look at the broader world of end-user operating systems, including phones and tablets, Linux comes out even better. In the US, where we love our Apple iPhones, Android &mdash; yes, another Linux distro &mdash; boasts 41.71% of the market share, accor",
        "id": 4198555,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/11/30/008213/are-there-more-linux-users-than-we-think",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are There More Linux Users Than We Think?",
        "vote": 0
    }
]