[
    {
        "age": null,
        "album": "",
        "author": "Today I Found Out",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-30T01:42:08.720797+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-30T01:20:01+00:00",
        "description": "In today's compilation video, we're looking at a slew of Hollywood vs Reality things like whether anyone has ever actually played Russian Roulette or if it's just a Hollywood invention. How Hollywood studios constantly get access to military personnel and equipment and how much movies like Top Gun end up costing the U.S. Taxpayer because of it. Moving on from there we're looking at how doctors actually resuscitate people and how this differs wildly from what generally is shown in movies for some reason. And finally we do a deep dive into what actually happened during Apollo 13 and how it differs from the film.\n\nYou’re going to need socks. You might drink coffee. You probably use soap. You definitely need to clean. Now imagine the money you spent on those items went to helping to make the world a better place instead of in the pockets of random stock holders. That is where Good Store Comes in, donating 100% of their profits to high impact charities. If this sounds interesting to you, s",
        "id": 4198151,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XmbQTprneU4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 862,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC64UiPJwM_e9AqAd7RiD7JA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XmbQTprneU4/hqdefault.jpg",
        "title": "Hollywood vs Reality: Is Russian Roulette a Real Thing? The Military and Top Gun, and Much More",
        "vote": 0
    }
]