[
    {
        "age": null,
        "album": "",
        "author": "Gamers Nexus",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T23:52:06.889974+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T23:07:47+00:00",
        "description": "Sponsor: Antec Flux Pro case on Amazon https://geni.us/CaPv\nIn this video, we crawl through over 450 listings of GPUs from AMD, NVIDIA, and Intel. The one finding that jumps-out more than anything else is that the most available cards at the closest prices to MSRP are 8GB models, particularly when higher capacity models of the \"same\" GPU exist. This further reinforces that MSRP is no longer a reliable metric in GPU reviews (right now, at least) for even baseline comparisons of value. This type of research is limited in scope by nature as even just trying to capture one market accurately required documenting 3 major retailers for hundreds of listings, which took a lot of time to do. Prices will also change with time, making it difficult to keep track of. Still, we wanted to try and better understand what's going on, the best value video cards right now by proximity to MSRP, and which graphics cards people aren't buying.\n\nWatch our Fake MSRP video: https://www.youtube.com/watch?v=SPE95_",
        "id": 3081266,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ZLtlZnWZGt0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 428,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UChIs72whgZI9w6d6FhwGGHA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZLtlZnWZGt0/hqdefault.jpg",
        "title": "It's Working: No One Is Buying 8GB GPUs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Gamers Nexus",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T01:52:00.374275+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T00:53:33+00:00",
        "description": "Sponsor: Thermaltake TR100 mini-ITX Travel Case on Amazon https://geni.us/Yn9DXb\nTRYX has remade parts of its LUCA L70 case in response to one of our most critical case reviews in a few years. We appreciate TRYX's response and some of its changes; however, unfortunately, the case again arrived with out-of-the-box issues that are primarily a result of design and not shipping. Despite persisting issues of varying kinds, the case has at least improved, and the company did at least make several changes that directly resolved some issues. Ultimately, this case is still not competitive against other cases that are cheaper than its (now) $250 price, up from $240, but in the very least, some of the issues have been resolved. You'll have to seriously consider how much you like the look of this case.\n\nWatch the original review: https://www.youtube.com/watch?v=TMvg1GYRKN4\nWatch our review of the Fractal Meshify 3: https://www.youtube.com/watch?v=37p6icPPoi0\nFind the GNCA channel: https://www.you",
        "id": 3072984,
        "language": null,
        "link": "https://www.youtube.com/watch?v=sPjHAkg0ug4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 428,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UChIs72whgZI9w6d6FhwGGHA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sPjHAkg0ug4/hqdefault.jpg",
        "title": "TRYX Responds to GamersNexus Review: LUCA L70 Case Overhaul",
        "vote": 0
    }
]