[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T16:28:59.497515+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T15:30:19+00:00",
        "description": "If there’s one thing players can always rely on when it comes to Kojima games, its secrets and callbacks. Death Stranding 2 not only features a lot of callbacks, but it has some of the most overly-produced and lovingly executed references of any Kojima game yet\n\nThese 15 secrets, references and callbacks do feature heavy spoilers, containing major events, confrontations, and plot points. So, be cautious before watching further unless you don’t care for spoilers or already played the game. \n\nKojima’s signature wackiness is on full display in Death Stranding 2 and these 15 are a prime example of that.",
        "id": 3078308,
        "language": null,
        "link": "https://www.youtube.com/watch?v=RwpcHwHIZTA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RwpcHwHIZTA/hqdefault.jpg",
        "title": "15 CRAZY Death Stranding 2 Secrets, References, And Callbacks You Probably DIDN'T KNOW Existed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T14:19:08.391065+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T13:31:00+00:00",
        "description": "Eriksholm: The Stolen Dream is an upcoming narrative-led stealth puzzle game from Swedish developer River End Games. As a debut title from the studio, Eriksholm: The Stolen Dream looks highly accomplished via its exceptional motion capture cutscenes and immersive environmental design. \n\nIndeed, the fictional city of Eriksholm itself - inspired by turn of the century Nordic cities - is rife with intrigue and distinction. It’s the perfect platform for the game’s story first gameplay; an experience in which players take command of Hanna as she undergoes a desperate search for her missing brother whilst evading the city’s police force. \n\nSecrets and mysteries abound, whilst two extra player-characters form a team with Hanna providing a backbone to the game’s unique environmental puzzle solving.",
        "id": 3077024,
        "language": null,
        "link": "https://www.youtube.com/watch?v=t37O8gAwn28",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/t37O8gAwn28/hqdefault.jpg",
        "title": "15 Things You Need To Know About This Amazing Game YOU’LL LIKELY NEVER PLAY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T08:52:06.669141+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T08:00:50+00:00",
        "description": "A new wave of layoffs has hit Microsoft, less than two months since the last wave, but this is just as brutal. Four percent of its workforce has reportedly been laid off. Affected studios include King, ZeniMax Media, Undead Labs, Compulsion Games, Halo Studios, and Turn 10 Studios, not including layoffs in QA, marketing, and sales.\n\nThe Initiative is gone, with Perfect Dark cancelled. Rare's Everwild has been cancelled, with layoffs seemingly on the way as the studio faces restructuring. ZeniMax Online Studios' new MMORPG is also cancelled, but with how poorly management has handled everything, the jury is still out on whether the people working on it have lost their jobs. But apparently, you shouldn't worry because of Xbox's \"continued momentum\" or...something.\n\nWhere did it all go wrong? How is Microsoft seeing its fourth wave of layoffs in less than two years? What even is the Gaming Division at this point, and why is Xbox so terrible at managing its studios? \n\nUnfortunately, not e",
        "id": 3074687,
        "language": null,
        "link": "https://www.youtube.com/watch?v=b45anzX3TBM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/b45anzX3TBM/hqdefault.jpg",
        "title": "Xbox And Microsoft Are Falling Apart - SERIOUSLY, What’s Even Happening?!",
        "vote": 0
    }
]