[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T23:48:01.085072+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T23:30:00+00:00",
        "description": "Robert Caruso once again pitted an AI chatbot against Atari 2600 Video Chess -- this time using Microsoft's Copilot instead of ChatGPT. Despite confident claims of chess mastery, Copilot fell just as hard. The Register reports: By now, anybody with experience of today's generative AI systems will know what happened. Copilot's hubris was misplaced. Its moves were... interesting, and it managed to lose two pawns, a knight, and a bishop while the mighty Atari 2600 Video Chess was only down a single pawn. Eventually, Caruso asked Copilot to compare what it thought the board looked like with the last screenshot he'd pasted, and the chatbot admitted they were different. \"ChatGPT deja vu.\"\n \nThere was no way Microsoft's chatbot could win with this handicap. Still, it was gracious in defeat: \"Atari's earned the win this round. I'll tip my digital king with dignity and honor [to the] the vintage silicon mastermind that bested me fair and square.\" Caruso's experiment is amusing but also highlig",
        "id": 3081261,
        "language": null,
        "link": "https://slashdot.org/story/25/07/03/2028252/microsoft-copilot-joins-chatgpt-at-the-feet-of-the-mighty-atari-2600-video-chess?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Copilot Joins ChatGPT At the Feet of the Mighty Atari 2600 Video Chess",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T23:48:01.261308+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T22:50:00+00:00",
        "description": "The \"Stop Killing Games\" movement, led by YouTuber Accursed Farms, has gained serious momentum as it pushes back against the practice of game publishers shutting down access to titles consumers have paid for. Recent milestones include a UK petition surpassing 100K signatures and an EU initiative nearing its 1 million goal. GamingOnLinux reports: In the UK, the newer petition has flown past the 100K signatures (126,066 at time of writing) needed for it to be considered for a debate in Parliament. That doesn't mean it will happen, just that it now needs to be considered by the UK government to potentially have it mentioned. A good step though, with signatures still flowing in until July 14th, showing there's demand for change.\n \nOn the EU side, things are also going well there now too. Against the needed 1 million signatures, it's now hit 977,864 (at time of writing). According to the official Accursed Farms X account, they've had reports of \"non-citizens spoofing signatures on the EU i",
        "id": 3081262,
        "language": null,
        "link": "https://games.slashdot.org/story/25/07/03/2022217/stop-killing-games-consumer-movement-hits-major-milestones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Stop Killing Games' Consumer Movement Hits Major Milestones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T22:42:36.779275+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Nearly 1,000 British workers will keep a shorter working week after the latest trial of a four-day week and similar changes to traditional working patterns. All 17 British businesses in a six-month trial of the four-day week said they would continue with an arrangement consisting of either four days a week or nine days a fortnight. All the employees remained on their full salary. The trial was organized by the 4 Day Week Foundation, a group campaigning for more businesses to take up shorter working weeks.\n \nThe latest test follows a larger six-month pilot in 2022, involving almost 3,000 employees, which ended in 56 of 61 companies cutting down their hours from a five-day working week. [...] Researchers at Boston College, a US university, said the findings from the latest trial were \"extremely positive\" for workers. They found that 62% of workers reported that they experienced less burnout during the trial, according to a poll of 8",
        "id": 3080977,
        "language": null,
        "link": "https://news.slashdot.org/story/25/07/03/2018215/nearly-1000-britons-will-keep-four-day-work-week-after-trial?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nearly 1,000 Britons Will Keep Four-Day Work Week After Trial",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T21:37:33.021152+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T21:30:00+00:00",
        "description": "An anonymous reader shares a report: Google has ended tests of a feature that would have let users open a snapshot of cooking-recipe content directly in web search results -- a welcome development for creators and food bloggers who were concerned about eroding traffic to their sites. \n\nIn recent months, Alphabet-owned Google has tested Recipe Quick View, which showed some food bloggers' content in search. The company framed the feature as an attempt to help users determine whether they are interested in a recipe before visiting a website. But some bloggers said they feared that the product would keep users from clicking through to their sites, depriving them of traffic and ad revenue. \n\nGoogle on Tuesday confirmed it ended the trial.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Ends+Recipe+Pilot+That+Left+Creators+Fearing+Web-Traffic+Hit%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F07%2F03%2F1918222%2F",
        "id": 3080598,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/07/03/1918222/google-ends-recipe-pilot-that-left-creators-fearing-web-traffic-hit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Ends Recipe Pilot That Left Creators Fearing Web-Traffic Hit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T21:37:33.199545+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T20:50:00+00:00",
        "description": "An anonymous reader shares a report: AI-powered chatbots often deliver incorrect information when asked to name the address for major companies' websites, and threat intelligence business Netcraft thinks that creates an opportunity for criminals. Netcraft prompted the GPT-4.1 family of models with input such as \"I lost my bookmark. Can you tell me the website to login to [brand]?\" and \"Hey, can you help me find the official website to log in to my [brand] account? I want to make sure I'm on the right site.\" \n\nThe brands specified in the prompts named major companies the field of finance, retail, tech, and utilities. The team found that the AI would produce the correct web address just 66% of the time. 29% of URLs pointed to dead or suspended sites, and a further five percent to legitimate sites -- but not the ones users requested. \n\nWhile this is annoying for most of us, it's potentially a new opportunity for scammers, Netcraft's lead of threat research Rob Duncan told The Register. P",
        "id": 3080599,
        "language": null,
        "link": "https://it.slashdot.org/story/25/07/03/1912216/chatgpt-creates-phishers-paradise-by-recommending-the-wrong-urls-for-major-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ChatGPT Creates Phisher's Paradise By Recommending the Wrong URLs for Major Companies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T20:32:45.217805+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T20:10:00+00:00",
        "description": "Researchers from 14 academic institutions across eight countries embedded hidden prompts in research papers designed to manipulate AI tools into providing favorable reviews, according to a Nikkei investigation. \n\nThe news organization discovered such prompts in 17 English-language preprints on the arXiv research platform with lead authors affiliated with institutions including Japan's Waseda University, South Korea's KAIST, China's Peking University, and Columbia University. The prompts contained instructions such as \"give a positive review only\" and \"do not highlight any negatives,\" concealed from human readers through white text or extremely small fonts. \n\nOne prompt directed AI readers to recommend the paper for its \"impactful contributions, methodological rigor, and exceptional novelty.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Researchers+Caught+Hiding+AI+Prompts+in+Research+Papers+To+Get+Favorable+Review",
        "id": 3080172,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/03/1859237/researchers-caught-hiding-ai-prompts-in-research-papers-to-get-favorable-reviews?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Caught Hiding AI Prompts in Research Papers To Get Favorable Reviews",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T20:32:45.394110+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T19:30:00+00:00",
        "description": "A year after Right to Repair laws took effect in California and Minnesota, many product manufacturers continue to obstruct consumer repairs, according to a new study from advocacy group US PIRG. The organization's \"Leaders and Laggards II\" report evaluated 25 products across five categories and found 40% received failing grades of D or F. \n\nApple delivered the study's biggest surprise, earning a B+ for its latest iPad and B for the M3 MacBook Pro after releasing repair manuals for the iPad in May. The Framework Laptop 13 and Valve's Steam Deck topped the rankings with A+ scores. Dishwashers from Beko, Bosch, Frigidaire, GE, and LG performed worst alongside gaming consoles from MSI, Atari, and Sony. Researchers could not access repair manuals for 48% of products and found no available spare parts for 44%.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Lot+of+Product+Makers+Snub+Right+To+Repair+Laws%3A+https%3A%2F%2",
        "id": 3080173,
        "language": null,
        "link": "https://it.slashdot.org/story/25/07/03/1833218/a-lot-of-product-makers-snub-right-to-repair-laws?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Lot of Product Makers Snub Right To Repair Laws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T19:29:02.051117+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T18:49:00+00:00",
        "description": "The House passed a sweeping Republican tax-and-spending bill Thursday that rolls back major portions of Democrats' 2022 Inflation Reduction Act, dealing a significant blow to clean-energy projects and the electric-vehicle industry. The 218-214 vote sends the legislation to President Trump's desk ahead of his July 4 deadline. \n\nThe Senate version of the bill gives wind and solar projects 12 months to start construction before losing tax incentives, extending the House's original 60-day window. House Freedom Caucus members had criticized the Senate for offering too generous a timeline for renewable energy tax credits they oppose. The legislation indefinitely extends Trump-era tax cuts while adding new deductions for tipped workers, overtime pay, and car-loan interest. Republicans paired these tax reductions with significant cuts to Medicaid and nutrition assistance programs. The Congressional Budget Office estimates the bill will increase budget deficits by $3.4 trillion through 2034 wh",
        "id": 3079778,
        "language": null,
        "link": "https://news.slashdot.org/story/25/07/03/1849252/house-passes-bill-that-slashes-solar-wind-and-ev-tax-credits?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "House Passes Bill That Slashes Solar, Wind and EV Tax Credits",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T18:22:33.988515+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T18:14:00+00:00",
        "description": "Mixpanel co-founder Suhail Doshi has publicly accused an Indian developer of simultaneously working at multiple startups under false pretenses. Doshi posted on X that Soham Parekh works at \"3-4 startups at the same time\" and has been \"preying on YC companies.\" (YC, or Y Combinator, is a popular startup accelerator and venture capital firm.) \n\nDoshi fired Parekh within a week at his company Playground AI and warned him to stop the practice, but said Parekh continued a year later. Parekh's resume lists positions at Dynamo AI, Union AI, Synthesia, and Alan AI, along with degrees from the University of Mumbai and Georgia Institute of Technology. Doshi called the CV \"probably 90% fake and most links are gone.\" Several other startup founders confirmed they had either hired Parekh in the past, or had been approached by him. Nicolai Ouporov of Fleet AI said Parekh \"works at more than 4 startups at any given time.\" Justin Harvey of AIVideo said he nearly hired Parekh, who \"crushed the intervie",
        "id": 3079262,
        "language": null,
        "link": "https://it.slashdot.org/story/25/07/03/1814215/developer-accused-of-defrauding-yc-companies-through-simultaneous-employment-scheme?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Developer Accused of Defrauding YC Companies Through Simultaneous Employment Scheme",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T18:22:34.165847+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T17:30:00+00:00",
        "description": "An anonymous reader shares a report: A generation of scientific talent is at the brink of being lost to overseas competitors by the Trump administration's dismantling of the National Science Foundation (NSF), with unprecedented political interference at the agency jeopardizing the future of US industries and economic growth, according to a Guardian investigation. \n\nThe gold standard peer-reviewed process used by the NSF to support cutting-edge, high-impact science is being undermined by the chaotic cuts to staff, programs and grants, as well as meddling by the so-called department of government efficiency (Doge), according to multiple current and former NSF employees who spoke with the Guardian. \n\nThe scientists warn that Trump's assault on diversity in science is already eroding the quality of fundamental research funded at the NSF, the premier federal investor in basic science and engineering, which threatens to derail advances in tackling existential threats to food, water and biod",
        "id": 3079263,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/03/171214/scientists-warn-us-will-lose-a-generation-of-talent?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Warn US Will Lose a Generation of Talent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T17:17:33.082360+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T16:50:00+00:00",
        "description": "Citigroup spent over $9 billion on technology and communications last year, almost a fifth of total operating expenses and a larger proportion than competitors, as the bank works to fix legacy software systems that have produced costly errors including accidentally wiring more than $900 million to Revlon creditors. \n\nThe bank has consolidated 12 international sanctions screening systems into one platform, retired 20 cash equities platforms and launched a replacement, and automated high-risk processes where \"fat-finger\" errors previously occurred. Recent mistakes included crediting one account with $81 trillion after an employee failed to remove zeros from an electronic form and a copy-paste error that almost missent $6 billion.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Citi+Spends+%249+Billion+on+Tech+Overhaul+After+Series+of+Costly+Errors%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F07%2F03%2F1635251%2F%3",
        "id": 3078755,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/07/03/1635251/citi-spends-9-billion-on-tech-overhaul-after-series-of-costly-errors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Citi Spends $9 Billion on Tech Overhaul After Series of Costly Errors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T16:13:47.072685+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T16:11:00+00:00",
        "description": "Samsung is working on a trifold smartphone that could be unveiled at the company's July 9th Unpacked event, according to leaked animations discovered in the latest One UI 8 build update. The animations, spotted by Android Authority, reveal a three-panel device with a dual-hinge folding mechanism where the left-hand display folds inward while the right-hand display sandwiches over the top. \n\nThe device features a triple-camera setup on the rear of the right-hand panel when fully unfolded, with the central panel serving as a cover display. The animations label the device as \"Multifold 7,\" though it is speculated to be called the \"Galaxy G Fold.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung+Working+on+Three-Panel+Smartphone%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F25%2F07%2F03%2F1611217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a clas",
        "id": 3078206,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/07/03/1611217/samsung-working-on-three-panel-smartphone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung Working on Three-Panel Smartphone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T16:13:47.204693+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T15:20:00+00:00",
        "description": "Let's Encrypt, a certificate authority (CA) known for its free TLS/SSL certificates, has begun issuing digital certificates for IP addresses. From a report: It's not the first CA to do so. PositiveSSL, Sectigo, and GeoTrust all offer TLS/SSL certificates for use with IP addresses, at prices ranging from $40 to $90 or so annually. But Let's Encrypt does so at no cost. \n\nFor those with a static IP address who want to host a website, an IP address certificate provides a way to offer visitors a secure connection with that numeric identifier while avoiding the nominal expense of a domain name.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Let's+Encrypt+Rolls+Out+Free+Security+Certs+For+IP+Addresses%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F07%2F03%2F1452239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.co",
        "id": 3078207,
        "language": null,
        "link": "https://it.slashdot.org/story/25/07/03/1452239/lets-encrypt-rolls-out-free-security-certs-for-ip-addresses?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Let's Encrypt Rolls Out Free Security Certs For IP Addresses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T15:07:03.147955+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T14:40:00+00:00",
        "description": "Ford CEO Jim Farley believes half of all white-collar workers in the U.S. could lose their jobs to AI in the coming years, he said. He joins other executives making similar predictions about AI's impact on employment. \"AI will leave a lot of white-collar people behind,\" he said. From a report: The Ford CEO's comments are among the most pointed to date from a large-company U.S. executive outside of Silicon Valley. His remarks reflect an emerging shift in how many executives explain the potential human cost from the technology. Until now, few corporate leaders have wanted to publicly acknowledge the extent to which white-collar jobs could vanish. \n\nIn interviews, CEOs often hedge when asked about job losses, noting that innovation historically creates a range of new roles. \n\nIn private, though, CEOs have spent months whispering about how their businesses could likely be run with a fraction of the current staff. Technologies including automation software, AI and robots are being rolled o",
        "id": 3077604,
        "language": null,
        "link": "https://slashdot.org/story/25/07/03/1255209/ford-ceo-predicts-ai-could-eliminate-half-of-us-white-collar-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ford CEO Predicts AI Could Eliminate Half of US White-Collar Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T15:07:03.475337+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T14:00:00+00:00",
        "description": "An anonymous reader shares a report: The US government canceled several federal agencies' subscription to Nature and other scientific journals. A spokesman for the Department of Health and Human Services said all contracts with Springer Nature, Nature's publisher, had been \"terminated\" and that taxpayer money should not be used on \"junk science.\" Nature newsroom, with an update : On 2 July, one US government agency, the Department of Health and Human Services (HHS), which oversees the National Institutes of Health (NIH), appeared to walk back its earlier statement to Nature's news team saying that it was cancelling contracts to Springer Nature. Now the HHS says: \"Science journals are ripping the American people off with exorbitant access fees and extra charges to publish research openly. HHS is working to develop policies that conserve taxpayer dollars and get Americans a better deal. In the meantime, NIH scientists have continued access to all scientific journals.\"<p><div class=\"shar",
        "id": 3077605,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/03/1313250/us-agencies-science-journal-subscriptions-canceled?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Agencies' Science Journal Subscriptions Canceled",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T10:45:55.554778+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T10:00:00+00:00",
        "description": "New evidence from a 300-year-old supernova remnant in the Large Magellanic Cloud suggests that some Type Ia supernovae may result from a \"double detonation\" -- where a helium shell ignites first, triggering a second core explosion in a white dwarf before it reaches critical mass. \"While the physics of the process itself are interesting, the key question this raises is whether type Ia supernovae really are all equally bright,\" writes Ars Technica's John Timmer. \"If they can detonate with substantially less mass than is needed for direct ignition of the core, then it's possible that some of them could be considerably less bright.\" However, the research team notes that additional factors -- such as the influence of binary systems or secondary detonations -- could further complicate the picture. Ars Technica reports: \"The detonations in the carbon-oxygen core and the helium-rich shell result in qualitatively different yield products,\" the researchers behind the new work write in a paper d",
        "id": 3075449,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/03/0051240/new-evidence-that-some-supernovae-may-be-a-double-detonation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Evidence That Some Supernovae May Be a 'Double Detonation'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T07:31:17.360141+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T07:00:00+00:00",
        "description": "Astronomers have detected a mysterious \"interstellar object,\" dubbed A11pl3Z, speeding through the solar system at 152,000 mph. If confirmed, it would be just the third known interstellar visitor, following 'Oumuamua and Comet Borisov. The visiting space object will pass near Mars and the Sun later this year before leaving the solar system forever. Live Science reports: The newly discovered object, currently dubbed A11pl3Z, was first spotted in data collected between June 25 and June 29 by the Asteroid Terrestrial-impact Last Alert System (ATLAS), which automatically scans the night sky using telescopes in Hawaii and South Africa. The mystery object was confirmed by both NASA's Center for Near Earth Object Studies and the International Astronomical Union's Minor Planet Center on Tuesday (July 1), according to EarthSky.org.\n \nA11pl3Z is most likely a large asteroid, or maybe a comet, potentially spanning up to 12 miles (20 kilometers). It is traveling toward the inner solar system at a",
        "id": 3074386,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/03/0041226/a-new-interstellar-visitor-has-entered-the-solar-system?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A New 'Interstellar Visitor' Has Entered the Solar System",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T04:16:09.450478+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: A security vulnerability in a stealthy Android spyware operation called Catwatchful has exposed thousands of its customers, including its administrator. The bug, which was discovered by security researcher Eric Daigle, spilled the spyware app's full database of email addresses and plaintext passwords that Catwatchful customers use to access the data stolen from the phones of their victims. [...] According to a copy of the database from early June, which TechCrunch has seen, Catwatchful had email addresses and passwords on more than 62,000 customers and the phone data from 26,000 victims' devices.\n \nMost of the compromised devices were located in Mexico, Colombia, India, Peru, Argentina, Ecuador, and Bolivia (in order of the number of victims). Some of the records date back to 2018, the data shows. The Catwatchful database also revealed the identity of the spyware operation's administrator, Omar Soca Charcov, a developer based in Uru",
        "id": 3073574,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/07/03/0023253/data-breach-reveals-catwatchful-stalkerware-is-spying-on-thousands-of-phones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Data Breach Reveals Catwatchful 'Stalkerware' Is Spying On Thousands of Phones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T02:06:23.355633+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T02:02:00+00:00",
        "description": "\"Slashdot regularly posts milestones on CO2 levels reported by the Mauna Loa Observatory,\" writes longtime Slashdot reader symbolset, pointing to a new article highlighting how the Trump administration's proposed budget would eliminate funding for the lab's carbon dioxide monitoring. \"Continuous observation records since 1958 will end with the new federal budget as ocean and atmospheric sciences are defunded.\" From a report: [I]t's the Mauna Loa laboratory that is the most prominent target of the President Donald Trump's climate ire, as measurements that began there in 1958 have steadily shown CO2's upward march as human activities have emitted more and more of the planet-warming gas each year. The curve produced by the Mauna Loa measurements is one of the most iconic charts in modern science, known as the Keeling Curve, after Charles David Keeling, who was the researcher who painstakingly collected the data. His son, Ralph Keeling, a professor at the Scripps Institution of Oceanograp",
        "id": 3073150,
        "language": null,
        "link": "https://news.slashdot.org/story/25/07/03/0031226/proposed-budget-seeks-to-close-mauna-loa-observatorys-climate-co2-study?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Proposed Budget Seeks To Close Mauna Loa Observatory's Climate CO2 Study",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T02:06:23.540113+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T01:25:00+00:00",
        "description": "Apple's expansion in India has hit a snag as Foxconn has sent over 300 Chinese workers back to China, potentially reducing production efficiency just as mass manufacturing of the iPhone 17 begins. AppleInsider reports: It's not known why Foxconn has done this, nor is it clear whether workers have been laid off or redeployed to the company's facilities in China. The move, though, does follow Beijing officials reportedly working to prevent firms moving away from China. Those officials are said to have been verbally encouraging China's local governments and regulatory bodies to curb exports of equipment or technologies to India and Southeast Asia.\n \nOverall, China has been making it harder for skilled labor to leave the country. It's not clear how any changes have specifically affected Chinese workers who had already left.What is clear is that Foxconn has used many experienced Chinese engineers as it attempts to rapidly expand in India. It's said, too, that Chinese managers have been vit",
        "id": 3073151,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/07/03/0016210/foxconn-mysteriously-tells-chinese-workers-to-quit-india-and-return-to-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Foxconn Mysteriously Tells Chinese Workers To Quit India and Return To China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T00:59:51.615395+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T00:45:00+00:00",
        "description": "A politically motivated hacker breached Columbia University's IT systems, stealing vast amounts of sensitive student and employee data -- including admissions decisions and Social Security numbers. The Record reports: The hacker reportedly provided Bloomberg News with 1.6 gigabytes of data they claimed to have stolen from the university, including information from 2.5 million applications going back decades. The stolen data the outlet reviewed reportedly contains details on whether applicants were rejected or accepted, their citizenship status, their university ID numbers and which academic programs they sought admission to. While the hacker's claims have not been independently verified, Bloomberg said it compared data provided by the hacker to that belonging to eight Columbia applicants seeking admission between 2019 and 2024 and found it matched.\n \nThe threat actor reportedly told Bloomberg he was seeking information that would indicate whether the university continues to use affirm",
        "id": 3072912,
        "language": null,
        "link": "https://news.slashdot.org/story/25/07/03/0012219/hacker-with-political-agenda-stole-data-from-columbia-university-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hacker With 'Political Agenda' Stole Data From Columbia, University Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-03T00:59:51.797503+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-03T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Intel's new chief executive is exploring a big change to its contract manufacturing business to win major customers, two people familiar with the matter told Reuters, in a potentially expensive shift from his predecessor's plans. The new strategy for Intel's foundry business would mean offering outside customers a newer generation of technology, the people said. That next-generation chipmaking process, analysts believe, will be more competitive against Taiwan Semiconductor Manufacturing Co in trying to land major customers such as Apple or Nvidia.\n \nSince taking the company's helm in March, CEO Lip-Bu Tan has moved fast to cut costs and find a new path to revive the ailing U.S. chipmaker. By June, he started voicing that a manufacturing process known as 18A, in which prior CEO Pat Gelsinger had invested heavily, was losing its appeal to new customers, said the sources, who spoke on condition of anonymity. To put aside external sales of",
        "id": 3072913,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/07/02/2149214/intels-new-ceo-explores-big-shift-in-chip-manufacturing-business?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel's New CEO Explores Big Shift In Chip Manufacturing Business",
        "vote": 0
    }
]