[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T23:22:15.682792+00:00",
        "description": "\"Electric vehicles are expected to outsell cars with internal combustion engines in China for the first time next year,\" reports the Financial Times, calling it \"a historic inflection point that puts the world's biggest car market years ahead of western rivals.\"\n\nChina is set to smash international forecasts and Beijing's official targets with domestic EV sales &mdash; including pure battery and plug-in hybrids &mdash; growing about 20 per cent year on year to more than 12mn cars in 2025, according to the latest estimates supplied to the Financial Times by four investment banks and research groups. The figure would be more than double the 5.9mn sold in 2022. At the same time, sales of traditionally powered cars are expected to fall by more than 10 per cent next year to less than 11 million, reflecting a near 30 per cent plunge from 14.8 million in 2022... \n\nRobert Liew, director of Asia-Pacific renewables research at Wood Mackenzie, said China's EV milestone signalled its success in ",
        "id": 1835409,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/04/2231223/chinas-ev-sales-set-to-overtake-traditional-cars-years-ahead-of-west?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China's EV Sales Set To Overtake Traditional Cars Years Ahead of West",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T22:19:44.231643+00:00",
        "description": "It's \"what some experts consider the most advanced military AI initiative ever to be deployed,\" reports the Washington Post. \n\nBut the Israeli military's AI-powered intelligence practices are also \"under scrutiny. Genocide charges against Israel brought to The Hague by South Africa question whether crucial decisions about bombing targets in Gaza were made by software, an investigation that could hasten a global debate about the role of AI technology in warfare.\"\n\nAfter the brutal Oct. 7, 2023, attack by Hamas, the Israel Defense Forces deluged Gaza with bombs, drawing on a database painstakingly compiled through the years that detailed home addresses, tunnels and other infrastructure critical to the militant group. But then the target bank ran low. To maintain the war's breakneck pace, the IDF turned to an elaborate artificial intelligence tool called Habsora &mdash; or \"the Gospel\" &mdash; which could quickly generate hundreds of additional targets. The use of AI to rapidly refill I",
        "id": 1835233,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/04/2141224/how-ai-based-military-intelligence-powered-israels-attacks-on-gaza?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How AI-Based Military Intelligence Powered Israel's Attacks on Gaza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T21:14:45.533501+00:00",
        "description": "\"Robots and AI models share one crucial characteristic,\" writes the Washington Post. \"Whether to move around, conduct conversations or solve problems, they function by constantly taking in and computing increasingly vast quantities of data. It's a brute-force approach to automation. Processing all that data makes them such energy guzzlers that their planet-warming pollution could outweigh any benefits they offer.\" \n\nBut then the article visits the robot soccer team of Ren&eacute; van de Molengraft (chair of robotics at Eindhoven University of Technology in the Netherlands). \"One solution, Molengraft thinks, might lie in 'lazy robotics,' a cheeky term to describe machines doing less and taking shortcuts...\"\n\nThere may be ceilings for laziness: limits to how much superfluous energy use can be stripped away before robots stop functioning as they should. Still, Molengraft said, \"The truth is: Robots are still doing a lot of things that they shouldn't be doing.\" To waste less energy, robo",
        "id": 1835006,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/04/0747205/why-the-world-needs-lazier-robots?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Why the World Needs Lazier Robots'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T20:09:22.878516+00:00",
        "description": "It's weighs less than 15 pounds. It's 17 inches wide. And in June Elon Musk said it was \"easily carried in a backpack. This product will change the world.\" \n\n\nAnd now, CNET reports:\n\nCalling all digital nomads and van-lifers: SpaceX's Starlink Mini is now available everywhere in the US. The small antenna costs $599 and requires a monthly subscription of either $50 or $165, depending on which plan you choose. Thanks to thousands of low Earth orbit satellites, Starlink has the unique ability to send high-speed internet just about anywhere. Standard service is great for home internet in rural areas, while the provider's Roam service and new portable dish are ideal for staying connected on the go... \n\nThe Mini is a satellite dish and Wi-Fi router all in one that's about the size of a laptop. According to Starlink's website, it uses approximately half the power of Starlink's standard dish. It can be powered with a portable USB battery and can \"melt snow and withstand sleet, heavy rain and",
        "id": 1834763,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/04/1920245/starlink-mini-high-speed-internet-fits-in-a-backpack-now-available-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Starlink Mini':  High-Speed Internet, Fits in a Backpack, Now Available in the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T19:04:24.614506+00:00",
        "description": "Politico asked an \"array of thinkers &mdash; futurists, scientists, foreign policy analysts and others &mdash; to lay out some of the possible 'Black Swan' events that could await us in the new year: What are the unpredictable, unlikely episodes that aren't yet on the radar but would completely upend American life as we know it?\" \n\nHere's one from Gary Marcus, a cognitive scientist and author of the book Taming Silicon Valley: How We Can Ensure That AI Works For Us:\n\n2025 could easily see the largest cyberattack in history, taking down, at least for a little while, some sizeable piece of the world's infrastructure, whether for deliberate ransom or to manipulate people to make money off a short on global markets. Cybercrime is already a huge, multi-trillion dollar problem, and one that most victims don't like to talk about. It is said to be bigger than the entire global drug trade. Four things could make it much worse in 2025. \n\n\nFirst, generative AI, rising in popularity and declinin",
        "id": 1834488,
        "language": null,
        "link": "https://it.slashdot.org/story/25/01/04/1839246/dire-predictions-for-2025-include-largest-cyberattack-in-history?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dire Predictions for 2025 Include 'Largest Cyberattack in History'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T17:59:59.691691+00:00",
        "description": "If we dissolve acid-neutralizing rocks in the ocean, will it absorb more carbon dioxide? \n\n Climate ventures and philanthropic funders have been spending millions of dollars to find out, reports the Washington Post. \"Researchers have been exploring this technology for the last five years, but over the last two months, at least a couple of start-ups have begun operation along the Atlantic and Pacific coasts.\"\n\n Planetary, a start-up based in Nova Scotia, removed 138 metric tons of carbon last month for Shopify and Stripe. The start-up Ebb Carbon is running a small site in Washington that can remove up to 100 carbon metric tons per year and committed in October to remove 350,000 metric tons of carbon from the atmosphere over the next decade for Microsoft. \n\nProponents of the technology say it's one of the most promising forms of carbon removal, which experts say will be necessary to meet climate goals even as the world cuts emissions. But in order for this to make a dent, it will need ",
        "id": 1834176,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/04/0318212/can-we-make-oceans-absorb-more-carbon-dioxide-with-a-giant-antacid?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Can We Make Oceans Absorb More Carbon Dioxide with a Giant Antacid?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T16:54:43.355703+00:00",
        "description": "\"The Washington Post's crossword puzzle was recently deemed too offensive for advertisers,\" reports the Wall Street Journal. \"So was an article about thunderstorms. And a ranking of boxed brownie mixes. \n\n\"Marketers have long been wary about running ads in the news media, concerned that their brands will land next to pieces about terrorism or plane crashes or polarizing political stories.\" But \"That advertising no-go zone seems to keep widening.\"\nIt is a headache that news publishers can hardly afford. Many are also grappling with subscriber declines and losses in traffic from Google and other tech platforms, and are now making an aggressive push to change advertisers' perceptions... News organizations recently began publicizing studies that show it really isn't dangerous for a brand to appear near a sensitive story. At the same time, they say blunt campaign-planning tools wind up fencing off even harmless content &mdash; and those stories' potentially large audiences &mdash; from ad",
        "id": 1833924,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/04/0613258/advertisers-expand-their-avoidance-to-news-sites-blacklisting-specific-words?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Advertisers Expand Their Avoidance to News Sites, Blacklisting Specific Words",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T15:50:32.297509+00:00",
        "description": "Remember that massive botnet run by Chinese government hackers? Flax Typhoon \"compromised computer networks in North America, Europe, Africa, and across Asia, with a particular focus on Taiwan,\" according to the U.S. Treasury Department. (The group's botnet breaching this autumn affected \"at least 260,000 internet-connected devices,\" reports the Washington Post, \"roughly half of which were located in the United States.\") \n\nFriday America's Treasury Department sanctioned \"a Beijing-based cybersecurity company for its role in multiple computer intrusion incidents against U.S. victims...\" according to an announcement from the department's Office of Foreign Assets Control. \"Between summer 2022 and fall 2023, Flax Typhoon actors used infrastructure tied to Integrity Tech during their computer network exploitation activities against multiple victims. During that time, Flax Typhoon routinely sent and received information from Integrity Tech infrastructure.\" \n\nFrom the Washington Post:\n\nThe ",
        "id": 1833637,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/04/0431231/us-sanctions-chinese-firm-linked-to-seized-botnet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Sanctions Chinese Firm Linked to Seized Botnet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T13:39:17.408796+00:00",
        "description": "As UK workers face a tougher-than-usual January return to offices, many large employers, including Amazon, BT, PwC, and Santander, are enforcing stricter in-person attendance mandates. The Guardian reports: As of 1 January, BT is requiring its 50,000 office-based employees across the UK and several other countries to attend three days a week in what it calls a \"three together, two wherever\" approach. Workers at the telecoms company have been told that office entry and exit data will be used to monitor attendance. The accountancy firm PwC is also clamping down on remote working; the Spanish-owned bank Santander is formalizing attendance requirements for its 10,000 UK staff; the digital bank Starling has ordered staff back to the office more regularly; and the supermarket chain Asda has made a three-day office week compulsory for thousands of workers at its Leeds and Leicester sites. The international picture is similar. [...]\n \nMultiple studies suggest that the future of work is flexi",
        "id": 1833154,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/03/2149243/uk-bosses-try-to-turn-back-clock-on-hybrid-working?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Bosses Try To Turn Back Clock On Hybrid Working",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T10:24:53.330570+00:00",
        "description": "In 2024, Americans spent 23% less on streaming subscriptions compared to 2023, driven by rising costs, streaming fatigue, and increased password-sharing restrictions. The findings have been reported in Review's annual State of Consumer Media Spending Report. TechSpot reports: Of those surveyed, 27.8 percent said they are experiencing streaming fatigue - or the feeling of being overwhelmed by the growing number of streaming apps on the market. And with the cost of goods and services at an all-time high, it's hitting folks in the wallet as well. The report additionally found that the average American has two streaming subscriptions, and watches three hours and 49 minutes of content each day. More than a quarter of subscribers - 26.5 percent - share subscriptions with others to save on cost although with recent crackdowns on password sharing, that might not be an option for much longer.\n \nAs such, Reviews recommends downsizing the number of subscriptions you pay for each month or spendi",
        "id": 1832435,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/01/04/0052207/americans-are-spending-less-on-streaming-as-fatigue-and-options-grow?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Americans Are Spending Less On Streaming As Fatigue and Options Grow",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T07:08:59.570398+00:00",
        "description": "Cornell Tech researchers have developed a portable device called SoilScanner that uses radio frequency signals and machine learning to detect lead contamination in soil. It offers a cost-effective alternative to traditional methods of testing that \"generally involves either sending samples to a lab for analysis, which relies upon harsh chemicals and can be expensive, or using a portable X-ray fluorescence device,\" notes Phys.org. From the report: \"In recent years, especially during COVID, a lot of us got excited about having our own backyard garden, or spending more time at home,\" said [Rajalakshmi Nandakumar, assistant professor at the Jacobs Technion-Cornell Institute at Cornell Tech] who's also a member of the Department of Information Science in the Cornell Ann S. Bowers College of Computing and Information Science. \"But if you look at instructions for how to grow tomatoes, no one actually tells you that you have to check your soil for lead,\" she said. \"It's all about pH levels. ",
        "id": 1831873,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/04/0044250/new-devices-radio-waves-reveal-lead-contamination-in-soil?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Device's Radio Waves Reveal Lead Contamination In Soil",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T03:51:39.843959+00:00",
        "description": "An anonymous reader quotes a report from Reuters: China's commerce ministry has proposed export restrictions on some technology used to make battery components and process critical minerals lithium and gallium, a document, opens new tab issued on Thursday showed. If implemented, they would be the latest in a series of export restrictions and bans targeting critical minerals and the technology used to process them, areas in which Beijing is globally dominant. Their announcement precedes the inauguration later this month of Donald Trump for a second term during which he is expected to use tariffs and various trade restrictions against other countries, in particular China. [...]\n \nThe proposed expansion and revisions of restrictions on technology used to extract and process lithium or prepare battery components could also hinder the overseas expansion plans of major Chinese battery makers, including CATL, Gotion, and EVE Energy. Some technologies to extract gallium would also be restric",
        "id": 1831430,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/03/223226/china-proposes-further-export-curbs-on-battery-critical-minerals-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Proposes Further Export Curbs On Battery, Critical Minerals Tech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T01:39:30.422513+00:00",
        "description": "According to Bloomberg (paywalled), Getty Images is exploring a merger with its rival Shutterstock. Following the news, Getty's shares were up 20.3% in afternoon trading, while shares of Shutterstock were up 7.7%. Reuters reports: The development comes at a time when Getty Images has struggled to retain customers and replace the lost customers. Its creative and editorial products, two of its largest revenue segments, declined year-over-year in 2023, according to its annual report. The decline in the popularity of stock image websites has coincided with the rise of AI tools like Midjourney and DALL-E 2, which can generate unique images quickly and cheaply. Seattle, Washington-based Getty is considering how to structure a deal that would unite two of the biggest U.S. providers of licensed visual content, the report said. [...] Deliberations are ongoing and Getty could choose not to pursue a deal, the report added.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"s",
        "id": 1831141,
        "language": null,
        "link": "https://slashdot.org/story/25/01/04/0058237/getty-images-explores-merger-with-shutterstock?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Getty Images Explores Merger With Shutterstock",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T00:34:43.524632+00:00",
        "description": "Samsung and Google are introducing Eclipsa Audio, an open-source 3D audio standard set to debut on select YouTube videos and Samsung's 2025 TVs and soundbars. The new format \"could eventually serve as a free alternative to Dolby Atmos, the dominant 3D audio format that hardware makers like Samsung pay to license for TVs and other equipment,\" reports The Verge. \"Samsung says that similar to Atmos, this audio format supports adjusting 'audio data such as the location and intensity of sounds, along with spatial reflections' to create a 3D experience.\" From the report: The two companies first announced a partnership to develop spatial audio technology in 2023, initially calling it Immersive Audio Model and Formats (IAMF). At the time, Samsung spatial audio head WooHyun Nam said the format would provide \"a complete open-source framework for 3D audio, from creation to delivery and playback.\"\n \nThe IAMF spec has also been adopted by the Alliance for Open Media, a group that has been pushing",
        "id": 1830897,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/01/03/2127241/samsung-and-googles-new-spatial-audio-format-will-take-on-dolby-atmos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Samsung and Google's New Spatial Audio Format Will Take On Dolby Atmos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-04T00:34:43.435384+00:00",
        "description": "Windows 11 24H2 continues to experience issues with multifunction devices using the eSCL scan protocol, despite Microsoft marking the problem as resolved. According to a Register reader, \"It works on a Windows 10 machine, but not on Windows 11, unless both the computer and the scanner are on wired Ethernet.\" From the report: Microsoft issued a compatibility safeguard hold on USB-connected devices using the Scanner Communication Language (eSCL) protocol in November after users who installed the Windows update experienced glitches with device discovery. The issue was reported resolved by Microsoft in December. However, it seems that KB5048667 might not have fixed all the problems for Canon owners. According to our reader: \"Canon support tells me that the 24H2 eSCL issue still is not fixed.\" We asked Microsoft about the situation, but despite telling us it was looking into the problem on Friday, December 20, the company has yet to provide any further details. Canon was more forthcoming.",
        "id": 1830896,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/03/2137202/a-new-years-gift-from-microsoft-surprise-your-scanners-dont-work?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "A New Year's Gift From Microsoft: Surprise, Your Scanners Don't Work",
        "vote": 0
    }
]