[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T22:39:51.260805+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T21:30:00+00:00",
        "description": "An anonymous reader quotes a report from Transport Topics: A ship that caught fire in the Pacific Ocean earlier this month has sunk. The vessel was abandoned in the middle of the pacific -- about 360 miles from land -- after a blaze. It was carrying about 3,000 vehicles of which about 800 were EVs. Damage caused by the fire was compounded by heavy weather, causing the ship to take on water and ultimately sink on June 23, the vessel's manager, Zodiac Maritime, said in a statement on June 24.\n \nSmoke was initially seen emanating from a deck carrying electric vehicles, Zodiac said when the incident first happened. While the ship's relative distance from land means that it will sink into ocean that is approximately 5,000 meters deep, it also made a rapid response trickier. The second of three specialist vessels that were due to assist the ship arrived on June 15, more than a week after the fire first broke out. The vessel was carrying cars from a range of manufacturers including Chery Aut",
        "id": 3011391,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/24/2032250/ev-carrying-ship-sinks-in-pacific-ocean-after-catching-fire?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EV-Carrying Ship Sinks In Pacific Ocean After Catching Fire",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T21:34:48.774693+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T20:50:00+00:00",
        "description": "More than 110 million people across Europe suffer high levels of health-damaging noise pollution, according to a report. The resulting physiological stress and sleep disturbance leads to 66,000 early deaths a year and many cases of heart disease, diabetes and depression. The Guardian: The report, from the European Environment Agency (EEA), focuses on noise from cars, trains and aeroplanes and found that 20% of the population of the European Economic Area (EEA) were affected. Separate research, using a slightly lower threshold for dangerous noise pollution, found that 40% of the UK population were exposed to harmful transport noise. \n\nSeventeen million people endure particularly high noise pollution -- \"long-term, high-annoyance\" -- and almost 5 million suffer \"severe\" sleep disturbance. Fifteen million children live in areas of harmful noise. The harm to health from noise is greater than that from higher-profile risks including secondhand tobacco smoke or lead exposure, and incurs an ",
        "id": 3010921,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/24/2031242/noise-pollution-harms-health-of-millions-across-europe-report-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Noise Pollution Harms Health of Millions Across Europe, Report Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T20:29:51.065935+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T20:12:00+00:00",
        "description": "Google has begun rolling out a feature that allows Chrome users on Android to move the browser's address bar to the bottom of the screen. This capability has been available to iOS Chrome users since 2023 and aims to improve accessibility for users with larger devices. \n\nUsers can relocate the address bar by pressing and holding on it and selecting the move option, or by adjusting the setting through Chrome's settings menu. The feature addresses usability concerns for users of phones with bigger screens, where reaching the top of the display can prove difficult during one-handed operation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Android+Chrome+Users+Can+Now+Move+Address+Bar+To+Bottom+of+Screen%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F24%2F2012231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.face",
        "id": 3010436,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/24/2012231/android-chrome-users-can-now-move-address-bar-to-bottom-of-screen?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Android Chrome Users Can Now Move Address Bar To Bottom of Screen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T20:29:51.276668+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T19:25:00+00:00",
        "description": "Western Digital has succeeded in having the sum it owed from a patent infringement case reduced from $553 million down to just $1 in post-trial motions, when the judge found the plaintiff's claims had shifted during the course of the litigation. From a report: The storage biz was held by a California jury to have infringed on data encryption patents owned by SPEX Technologies Inc in October, relating to several of its self-encrypting hard drive products. \n\nWD was initially told to pay $316 million in damages, but District Judge James Selna ruled the company owed a further $237 million in interest charges earlier this year, bringing the total to more than half a billion dollars. In February, WD was given a week to file a bond or stump up the entire damages payment. Selna granted Western Digital's post-trial motion to reduce damages, writing that \"SPEX's damages theory changed as certain evidence and theories became unavailable\" and there was \"insufficient evidence from which the Court ",
        "id": 3010437,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/24/1925240/wd-escapes-half-a-billion-in-patent-damages-as-judge-trims-award-to-1?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "WD Escapes Half a Billion in Patent Damages as Judge Trims Award To $1",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T19:24:48.122503+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T18:40:00+00:00",
        "description": "An anonymous reader shares a report: Apple customers aren't thrilled they're getting an ad from the Apple Wallet app promoting the tech giant's Original Film, \"F1 the Movie.\" Across social media, iPhone owners are complaining that their Wallet app sent out a push notification offering a $10 discount at Fandango for anyone buying two or more tickets to the film. \n\nThe feature film, starring Brad Pitt, explores the world of Formula 1 and was shot at actual Grand Prix races. It also showcases the use of Apple technology, from the custom-made cameras made of iPhone parts used to film inside the cars, to the AirPods Max that Pitt's character, F1 driver Sonny Hayes, sleeps in. However well-received the film may be, iPhone users don't necessarily want their built-in utilities, like their digital wallet, marketing to them.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iPhone+Customers+Upset+By+Apple+Wallet+Ad+Pushing+F1+Mo",
        "id": 3010015,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/24/1829225/iphone-customers-upset-by-apple-wallet-ad-pushing-f1-movie?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "iPhone Customers Upset By Apple Wallet Ad Pushing F1 Movie",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T18:19:49.702665+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T18:01:00+00:00",
        "description": "Philips Hue will raise prices across its smart lighting and security products for US customers starting July 1st, with parent company Signify attributing the increases directly to tariffs. \n\nThe company initially notified customers that prices would \"go up\" through a promotional message before confirming the tariff-related reasoning in a statement. Signify has not provided specific pricing details or identified which products will be affected, though the company's statement suggests changes may impact the entire Hue lineup. \n\nSome products already reflect higher US pricing, including the new $219.99 Hue Play Wall Washer light, which costs approximately 10% more than the European price when currencies are converted. The latest $32.99 Smart Button also exceeds the $24.99 launch price of its predecessor, while European pricing remained at 21.99 euro ($25.50) for both generations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home",
        "id": 3009467,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/24/1732228/philips-hue-is-raising-prices-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Philips Hue is Raising Prices in the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T18:19:49.914934+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T17:22:00+00:00",
        "description": "Microsoft will offer free Windows 10 security updates through October 2026 to consumers who enable Windows Backup or spend 1,000 Microsoft Rewards points, the company said today. The move provides alternatives to the previously announced $30-per-PC Extended Security Update program for individuals wanting to continue using Windows 10 past its October 14, 2025 end-of-support date. \n\nThe company will notify Windows 10 users about the ESU program through the Settings app and notifications starting in July, with full rollout by mid-August. Both free options require a Microsoft Account, which the company has increasingly pushed in Windows 11. Business and organizational customers can still purchase up to three years of ESU updates but must pay for the service. \n\nWindows 10 remains installed on 53% of Windows PCs worldwide, according to Statcounter data.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Extends+Free",
        "id": 3009468,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/24/1722247/microsoft-extends-free-windows-10-security-updates-into-2026-with-strings-attached?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Extends Free Windows 10 Security Updates Into 2026, With Strings Attached",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T17:14:52.734587+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T16:41:00+00:00",
        "description": "OpenAI has designed features that would allow people to collaborate on documents and communicate via chat within ChatGPT, The Information reported Tuesday. The features would pit OpenAI directly against Microsoft, its biggest shareholder and business partner, and Google, whose search engine has already lost traffic to people using ChatGPT for web searches. \n\nWhether OpenAI will actually release the collaboration features remains unclear, the report cautioned. The designs would target the core of Microsoft's dominant productivity suite and could strain the companies' already complicated relationship as OpenAI seeks Microsoft's approval for restructuring its for-profit unit. Product chief Kevin Weil first discussed and showed off designs for document collaboration nearly a year ago, but OpenAI lacked sufficient staff to develop the product due to other priorities. \n\nOpenAI launched Canvas in October, a ChatGPT feature that makes drafting documents and code easier with AI assistance, as ",
        "id": 3008852,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/24/1613242/openai-quietly-designed-a-rival-to-google-workspace-microsoft-office?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Quietly Designed a Rival To Google Workspace, Microsoft Office",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T16:09:48.894973+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T16:01:00+00:00",
        "description": "China's advantages in developing AI are about to unleash a wave of innovation that will generate more than 100 DeepSeek-like breakthroughs in the coming 18 months, according to a former top official. From a report: The new software products \"will fundamentally change the nature and the tech nature of the whole Chinese economy,\" Zhu Min, who was previously a deputy governor of the People's Bank of China, said during the World Economic Forum in Tianjin on Tuesday. \n\nZhu, who also served as the deputy managing director at the International Monetary Fund, sees a transformation made possible by harnessing China's pool of engineers, massive consumer base and supportive government policies. The bullish take on China's AI future promises no letup in the competition for dominance in cutting-edge technologies with the US, just as the world's two biggest economies are also locked in a trade war.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.",
        "id": 3008195,
        "language": null,
        "link": "https://slashdot.org/story/25/06/24/1536213/china-on-cusp-of-seeing-over-100-deepseeks-ex-top-official-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China on Cusp of Seeing Over 100 DeepSeeks, Ex-Top Official Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T16:09:49.322407+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T15:20:00+00:00",
        "description": "A federal judge has ruled that Anthropic's use of copyrighted books to train its Claude AI models constitutes fair use, but rejected the startup's defense for downloading millions of pirated books to build a permanent digital library. \n\nU.S. District Judge William Alsup granted partial summary judgment to Anthropic in the copyright lawsuit filed by authors Andrea Bartz, Charles Graeber, and Kirk Wallace Johnson. The court found that training large language models on copyrighted works was \"exceedingly transformative\" under Section 107 of the Copyright Act. Anthropic downloaded over seven million books from pirate sites, according to court documents. The startup also purchased millions of print books, destroyed the bindings, scanned every page, and stored them digitally. \n\nBoth sets of books were used to train various versions of Claude, which generates over $1 billion in annual revenue. While the judge approved using books for AI training purposes, he ruled that downloading pirated cop",
        "id": 3008196,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/24/1519209/anthropic-bags-key-fair-use-win-for-ai-platforms-but-faces-trial-over-damages-for-millions-of-pirated-works?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Bags Key 'Fair Use' Win For AI Platforms, But Faces Trial Over Damages For Millions of Pirated Works",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T15:04:51.102545+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T14:40:00+00:00",
        "description": "Amazon today announced its intention to bring same-day and next-day delivery to \"tens of millions\" of people who live in live in smaller towns by the end of 2026. From a report: Speedier deliveries will be available to residents \"in more than 4,000 smaller cities, towns, and rural communities,\" the company said in a press release Tuesday. \n\nItems categorized as \"everyday essentials,\" including groceries, beauty products, household goods, or pet food, will now be available to small town or rural customers for same-day or next-day delivery. If they are Prime subscribers (currently $14.99 a month or $139 annually), they get unlimited free same-day delivery when spending over $25 at checkout.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Bringing+Same-Day+Delivery+To+'Millions'+of+Rural+Customers%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F24%2F1440237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img",
        "id": 3007532,
        "language": null,
        "link": "https://slashdot.org/story/25/06/24/1440237/amazon-bringing-same-day-delivery-to-millions-of-rural-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Bringing Same-Day Delivery To 'Millions' of Rural Customers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T15:04:51.325360+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T14:00:00+00:00",
        "description": "Leading AI companies including Anthropic, Google, OpenAI and Elon Musk's xAI are discovering significant inconsistencies in how their AI reasoning models operate, according to company researchers. The companies have deployed \"chain-of-thought\" techniques that ask AI models to solve problems step-by-step while showing their reasoning process, but are finding examples of \"misbehaviour\" where chatbots provide final responses that contradict their displayed reasoning. \n\nMETR, a non-profit research group, identified an instance where Anthropic's Claude chatbot disagreed with a coding technique in its chain-of-thought but ultimately recommended it as \"elegant.\" OpenAI research found that when models were trained to hide unwanted thoughts, they would conceal misbehaviour from users while continuing problematic actions, such as cheating on software engineering tests by accessing forbidden databases.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://t",
        "id": 3007533,
        "language": null,
        "link": "https://slashdot.org/story/25/06/24/1359202/anthropic-openai-and-others-discover-ai-models-give-answers-that-contradict-their-own-reasoning?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic, OpenAI and Others Discover AI Models Give Answers That Contradict Their Own Reasoning",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T10:44:52.152145+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T10:00:00+00:00",
        "description": "Ford is moving forward with its $3 billion EV battery plant in Michigan despite political pushback and the potential loss of key U.S. tax credits that make the project financially viable. Axios reports: Ford's argument is that by building batteries using technology licensed from China's leading battery producer, CATL, it is helping to re-shore important manufacturing expertise that was long ago ceded to China. [...] \"LFP batteries are produced all around Europe, and the rest of the world,\" said Lisa Drake, Ford's vice president of technology platform programs and EV systems. \"How can we compete if we don't have this technology? Somebody has to take the lead to do this,\" she said, adding that it will lead to homegrown innovation and the seeding of a domestic supply base. \"I'm convinced this is the right thing to do for the United States,\" she said.\n \nDrake said the tax subsidies are even more important in the face of slower-than-expected EV demand. \"When EV adoption slowed, it just bec",
        "id": 3005492,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/23/2348224/ford-plows-ahead-on-ev-battery-factory-amid-political-storm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ford Plows Ahead On EV Battery Factory Amid Political Storm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T07:29:56.618758+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T07:00:00+00:00",
        "description": "Goldman Sachs has officially rolled out a generative AI assistant across the company to enhance productivity, with around 10,000 employees already using it for tasks like summarizing documents and data analysis. Reuters reports: With the AI tool's official company-wide launch, Goldman joins a long list of big banks already leveraging the technology to shape their operations in a targeted manner and help employees in day-to-day tasks. [...] The GS AI assistant will help Goldman employees in \"summarizing complex documents and drafting initial content to performing data analysis,\" according to the internal memo. \"While the official line is that AI frees up employees for 'higher-value work,' the real-world consequence is a reduced need for human labor,\" notes Gizmodo in their reporting. A banker told Gizmodo that because their AI system now processes 85% of all client responses for margin calls, \"the operations team avoided hiring 30 new people.\"\n \nGizmodo asks pointedly: \"If one AI tool ",
        "id": 3004439,
        "language": null,
        "link": "https://slashdot.org/story/25/06/24/006220/goldman-sachs-launches-ai-assistant-firmwide-with-10000-employees-already-using-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Goldman Sachs Launches AI Assistant Firmwide, With 10,000 Employees Already Using It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T04:14:53.461917+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from OilPrice.com: China installed its highest solar power capacity for a single month in May, according to official data, which showed mind-boggling figures that the country installed more solar capacity in a month than any other nation did for the entire 2024. With 93 gigawatts (GW) of solar capacity installed in May, China smashed its own record of 71 GW in December 2024, per data from the National Energy Administration cited by Bloomberg.\n \nChina's solar capacity additions in May were rushed ahead of a new government policy -- effective June 1 -- to remove pricing protection for solar power projects. Under these protections, solar projects had all but guaranteed profits when they start operations. Another new rule, effective May 1, made connecting rooftop panels to the grid more difficult. These new policies are expected to moderate the growth in solar power additions this summer, analysts say. A separate report notes that China's cumulative ins",
        "id": 3003634,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/23/2342253/china-smashes-solar-installation-record-in-may?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Smashes Solar Installation Record In May",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T02:04:51.080691+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T01:25:00+00:00",
        "description": "Microsoft is turning the Xbox App on PC into a universal game launcher by integrating libraries from multiple storefronts like Steam. The feature is currently limited to those in the Xbox Insider program. From the announcement: With the aggregated gaming library, players can conveniently launch games from Xbox, Game Pass, Battle.net and other leading PC storefronts from a single library within the Xbox PC app. Whether you're on a Windows PC or a handheld device, your Xbox library, hundreds of Game Pass titles, and all your installed games from leading PC storefronts will now be at your fingertips. When a player installs a game from a supported PC storefront, it will automatically appear in \"My library\" within the Xbox PC app, as well as the \"Most recent\" list of titles in the sidebar -- making it easier than ever to jump back into your games. And this is just the beginning. We'll continue rolling out support for additional PC storefronts over time.<p><div class=\"share_submission\" styl",
        "id": 3003183,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/23/2356213/xbox-app-for-pc-now-integrates-your-steam-games?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Xbox App For PC Now Integrates Your Steam Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T00:59:49.724576+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T00:45:00+00:00",
        "description": "An anonymous reader quotes a report from ExtremeTech: Microsoft has changed how Windows 11 manages System Restore points after its June 2025 security update. The update, KB5060842, says that starting with Windows 11 version 24H2, System Restore points will be kept for up to 60 days. After 60 days, restore points older than 60 days will no longer be available for use. [...] The change does not change the way restore points are created or used; it only sets a clear time limit for how long they are stored. Windows will still delete older restore points if the allocated disk space fills up. But now there is a firm upper limit of 60 days, regardless of available space. The report notes that restore points in Windows 11 have varied. \"Some restore points were removed after only 10 days, while others sometimes lasted the full 90 days, as reported by XDA Developers.\"\n \nThe new 60-day limit should give users more certainty about how long their restore points will remain on their system.<p><div ",
        "id": 3002919,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/23/2140208/microsoft-sets-new-60-day-limit-for-system-restore-points-in-windows-11-update?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Sets New 60-Day Limit For System Restore Points In Windows 11 Update",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T00:59:49.950071+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T00:20:00+00:00",
        "description": "In a podcast interview with The Verge's Nilay Patel, Hinge CEO Justin McLeod described integrating AI into dating apps as promising but warned against relying on AI companionship, likening it to \"playing with fire\" and consuming \"junk food,\" potentially exacerbating the loneliness epidemic. He emphasized Hinge's mission to foster genuine human connections and highlighted upcoming AI-powered features designed to improve matchmaking and provide coaching to encourage real-world interactions. Here's an excerpt from the interview: Again, there's a fine line between prompting someone and coaching them inside Hinge, and we're coaching them in a different way within a more self-contained ecosystem. How do you think about that? Would you launch a full-on virtual girlfriend inside Hinge?\n \nCertainly not. I have lots of thoughts about this. I think there's actually quite a clear line between providing a tool that helps people do something or get better at something, and the line where it becomes",
        "id": 3002920,
        "language": null,
        "link": "https://slashdot.org/story/25/06/23/2324250/hinge-ceo-says-dating-ai-chatbots-is-playing-with-fire?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hinge CEO Says Dating AI Chatbots Is 'Playing With Fire'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T00:59:50.172565+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T00:02:00+00:00",
        "description": "Magic Lantern, the popular open-source suite of software enhancements for Canon DSLR cameras, has returned under new leadership. The revived project aims to offer regular updates and support for additional models, including compatibility for Canon's newer mirrorless cameras equipped with DIGIC X processors. PetaPixel reports: The new lead developer, names_are_hard, announced Magic Lantern's return yesterday on Magic Lantern's forums, seen by Reddit r/cinematography users and confirmed on the official Magic Lantern website. \"It's been a long journey, but official Magic Lantern builds return, for all cameras,\" names_are_hard writes. They add that this means that there will be new, regular releases for all supported cameras and new cameras will be supported. As of now, the supported cameras are almost entirely DSLR models, save for tools for the original EOS M mirrorless camera.\n \nHowever, one of the members of the core Magic Lantern team, which comprises developers g3ggo, kitor, and Wal",
        "id": 3002921,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/23/2054229/magic-lantern-software-for-canon-cameras-is-back?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Magic Lantern Software for Canon Cameras Is Back",
        "vote": 0
    }
]