[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T20:56:42.640059+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T20:30:02+00:00",
        "description": "When you stop and think about it, the Xbox brand has endured some pretty significant downturns throughout the years. The Xbox 360's Red Ring of Death, the Xbox One's awful pre-launch marketing, and the lack of games in the formative years of the Xbox Series X/S - it's almost incredible that Microsoft's console has survived for this long.\n\nIt hasn't been without some consequences, as hardware revenue continues to fall and the brand as a whole has entered a transformative phase, delivering its titles to other platforms. The announcement of the ROG Xbox Ally also indicated a desire to go beyond the traditional console medium.\n\nHowever, with the announcement of a new multi-year deal between Xbox and AMD for the next-gen consoles, you have to wonder if Microsoft is suited to going down this route once more. Then again, it could have other ideas up its sleeve that we haven't considered, revolving around Windows as a universal gaming platform.",
        "id": 3010485,
        "language": null,
        "link": "https://www.youtube.com/watch?v=L81vIp_l_jE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/L81vIp_l_jE/hqdefault.jpg",
        "title": "Can The Next XBOX Redeem Microsoft?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T16:36:31.154572+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T15:30:21+00:00",
        "description": "Incoming from fledgling Swedish studio River End Games is stealth puzzler Eriksholm: The Stolen Dream. Here, players assume command of Hanna, a young woman thrust into a life of subterfuge following the mysterious disappearance of her brother Hermann. \n\nThroughout her journey within the winding expanse of turn-of-the-century Nordic inspired city Eriksholm, she uncovers a truth which could derail her hometown’s future. The game’s isometric viewpoint calls to mind landmark stealth titles such as Commandos and Shadow Tactics: Blades of the Shogun, however - as this feature points out - Eriksholm: The Stolen Dream is a narrative-led experience viewed through a stealth filter. \n\nThis is the stealth game to keep on your radar, as tactical subversion hasn’t married so seamlessly with emotional storytelling quite as much as this.",
        "id": 3008370,
        "language": null,
        "link": "https://www.youtube.com/watch?v=fFfc8GZnVg0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fFfc8GZnVg0/hqdefault.jpg",
        "title": "Eriksholm: The Stolen Dream Could Be The Stealth Game Fans Have Been Waiting For",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-24T14:26:53.609502+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-24T13:31:01+00:00",
        "description": "Death Stranding launched in 2019, and even after gaming transitioned into a new generation, it remains one of the best-looking games of all time. Kojima Productions' use of the Decima Engine provided some incredible environmental textures, dynamic lighting, and draw distance despite originally starting development on the PlayStation 4.\n\nWhile Death Stranding 2: On the Beach retains those fundamentals, it delivers a superior visual experience in many other ways. The addition of a day/night cycle, more diverse weather effects and terrain deformation allows for a more immersive world. Then there's the variety of biomes, allowing for a richer array of lighting scenarios.\n\nOverall, despite the lack of ray tracing, the sequel is easily one of the most visually rich experiences of the year, with solid performance to match its outstanding fidelity. Check out how it compares to the original ahead of its launch on June 26th for PS5.",
        "id": 3006988,
        "language": null,
        "link": "https://www.youtube.com/watch?v=z5s3GyFlG2U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z5s3GyFlG2U/hqdefault.jpg",
        "title": "Death Stranding 2 vs Death Stranding 1 Head To Head Graphics Comparison - An Amazing Evolution",
        "vote": 0
    }
]