[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T23:01:12.390233+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T22:17:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Google's meme-friendly Nano Banana image-generation model is getting an upgrade. The new Nano Banana Pro is rolling out with improved reasoning and instruction following, giving users the ability to create more accurate images with legible text and make precise edits to existing images. It's available to everyone in the Gemini app, but free users will find themselves up against the usage limits pretty quickly. Nano Banana Pro is part of the newly launched Gemini 3 Pro -- it's actually called Gemini 3 Pro Image in the same way the original is Gemini 2.5 Flash Image, but Google is sticking with the meme-y name. You can access it by selecting Gemini 3 Pro and then turning on the \"Create images\" option.\n \nGoogle says the new model can follow complex prompts to create more accurate images. The model is apparently so capable that it can generate an entire usable infographic in a single shot with no weird AI squiggles in place of words. ",
        "id": 4124070,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/20/2215205/googles-new-nano-banana-pro-uses-gemini-3-power-to-generate-more-realistic-ai-images",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's New Nano Banana Pro Uses Gemini 3 Power To Generate More Realistic AI Images",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T22:00:34.299145+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T21:22:00+00:00",
        "description": "An anonymous reader shares a report: Epishine, a company that makes solar cells optimized for indoor lighting, has announced its technology is being used in a new remote control for Google TV devices, as spotted by 9to5Google. The remote will rely on rechargeable batteries instead of disposable ones, and thanks to the use of solar cells on both sides it may only run out of power when it gets buried and forgotten in the dark abyss of your couch cushions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Future+Google+TV+Devices+Might+Come+With+a+Solar-powered+Remote%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F20%2F1951234%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F20%2F1951234%2Ffuture-google-tv-devices-might-come-with-a-solar-po",
        "id": 4123632,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/20/1951234/future-google-tv-devices-might-come-with-a-solar-powered-remote",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Future Google TV Devices Might Come With a Solar-powered Remote",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T20:57:17.047747+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T20:51:00+00:00",
        "description": "Microsoft has released the source code for Zork I, II, and III under the MIT License through a collaboration with Team Xbox and Activision that involved submitting pull requests to historical source repositories maintained by digital archivist Jason Scott. Each repository now includes the original source code and accompanying documentation. \n\nThe games arrived on early home computers in the 1980s as text-based adventures built on the Z-Machine, a virtual machine that allowed the same story files to run across different platforms. Infocom created the Z-Machine after discovering the original mainframe version was too large for home computers. The team split the game into three titles that all ran on the same underlying system. \n\nThe code release covers only the source files and does not include commercial packaging or trademark rights. The games remain available commercially through The Zork Anthology on Good Old Games and can be compiled locally using ZILF, a modern Z-Machine interpret",
        "id": 4123219,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/20/1942250/microsoft-open-sources-classic-text-adventure-zork-trilogy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Open-Sources Classic Text Adventure Zork Trilogy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T20:57:17.180968+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T20:10:00+00:00",
        "description": "Nvidia and Google announced today a new cloud gaming plan called GeForce Now Fast Pass that is exclusive to Chromebooks. Anyone who purchases a new Chromebook will receive a year of the service included with their device at no additional charge. Fast Pass allows Chromebook owners to stream more than 2,000 games from their existing Steam, Epic or Xbox libraries. \n\nThe service removes ads and lets users skip the queue that typically adds two minutes or more of wait time on GeForce Now's free tier. Users get 10 hours of cloud gaming each month. Up to five unused hours can roll over to the following month. Nvidia offers other paid plans starting at $9.99 per month that support higher resolutions, faster frame rates, RTX ray-tracing, and access to a larger game library that includes thousands of additional titles. The companies did not announce pricing for Fast Pass after the first year ends.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitt",
        "id": 4123220,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/20/1924218/nvidia-brings-ad-free-cloud-gaming-to-new-chromebooks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Brings Ad-free Cloud Gaming To New Chromebooks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T19:56:38.662969+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T19:30:00+00:00",
        "description": "A Centers for Disease Control and Prevention webpage that previously made the case that vaccines don't cause autism now says they might. WSJ: The contents of the webpage came up during Health Secretary Robert F. Kennedy Jr. Senate confirmation process. Sen. Bill Cassidy (R., La.) in February said Kennedy had assured him that, if he was confirmed, the CDC would \"not remove statements on their website pointing out that vaccines do not cause autism.\" \n\nThe revised webpage says: \"The claim 'vaccines do not cause autism' is not an evidence-based claim because studies have not ruled out the possibility that infant vaccines cause autism. Studies supporting a link have been ignored by health authorities.\" The new text posted Wednesday also notes that the Department of Health and Human Services has launched \"a comprehensive assessment\" to probe the causes of autism.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=CDC+Changes+",
        "id": 4122643,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/20/1912215/cdc-changes-webpage-to-say-vaccines-may-cause-autism-revising-prior-language",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CDC Changes Webpage To Say Vaccines May Cause Autism, Revising Prior Language",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T19:56:38.735256+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T18:52:00+00:00",
        "description": "Microsoft's push to transform Windows into an \"agentic OS\" that allows AI agents to control PCs is drawing user backlash similar to the Windows 8 controversy, as the company marks the operating system's 40th anniversary this week, writes Tom Warren, a reporter at The Verge who has been covering Microsoft for nearly two decades. Windows chief Pavan Davuluri announced the agentic OS plans in a post on X last week and faced immediate criticism in hundreds of replies before they were locked days later. \n\n\"It's evolving into a product that's driving people to Mac and Linux,\" one person wrote, while another asked for a return to Windows 7's \"clean UI, clean icon, a unified control panel, no bloat apps, no ads, just a pure performant OS.\" Davuluri later responded to software engineer Gergely Orosz, saying \"we care deeply about developers\" and acknowledging Microsoft has \"work to do on the experience, both on the everyday usability, from inconsistent dialogs to power user experiences.\" \n\nMicr",
        "id": 4122644,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/20/1852230/as-windows-turns-40-microsoft-faces-an-ai-backlash",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "As Windows Turns 40, Microsoft Faces an AI Backlash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:56:06.397867+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T18:05:00+00:00",
        "description": "Autonomous electric tractor startup Monarch Tractor -- which we covered in 2022 -- warned staff Thursday it may need to lay off more than 100 employees, or possibly even \"shut down,\" according to a company-wide memo obtained by TechCrunch. The report adds: The memo comes after Monarch Tractor was already cutting some positions over the last few weeks at its California corporate facilities and remote teams in India and Singapore, according to multiple former employees who spoke with TechCrunch on the condition of anonymity. \n\nMonarch Tractor was founded in 2018 by a team that included a former top executive at Tesla's first gigafactory and Carlo Mondavi, a scion of the famous winemaking family. The company raised at least $220 million, including $133 million in 2024, as it pursued a goal of making \"driver optional\" autonomous tractors that could perform tasks at places like wineries and other fruit farms.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" h",
        "id": 4122001,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/20/1752232/monarch-tractor-preps-for-layoffs-and-warns-employees-it-may-shut-down",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Monarch Tractor Preps For Layoffs and Warns Employees It May 'Shut Down'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:50:41.482386+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:32:00+00:00",
        "description": "Android's Quick Share file transfer service can now work with Apple's AirDrop, allowing users to send files between iPhones and Android devices. Google has started rolling out the feature to its Pixel 10 family of smartphones. The cross-platform compatibility includes security protections that the company says independent security experts tested. Google said it built the feature in response to user requests for simpler file sharing between devices regardless of manufacturer. The company plans to expand availability to additional Android devices.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=You+Can+Finally+AirDrop+Files+Between+Android+and+iPhone%2C+Starting+with+Pixel+10%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F11%2F20%2F1732245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3",
        "id": 4121379,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/20/1732245/you-can-finally-airdrop-files-between-android-and-iphone-starting-with-pixel-10",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "You Can Finally AirDrop Files Between Android and iPhone, Starting with Pixel 10",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:50:41.858312+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T16:46:00+00:00",
        "description": "A federal judge in New York denied Disney's request to block Sling TV's short-term passes, which give viewers the ability to stream live content for as little as one day. From a report: In a ruling on Tuesday, US District Judge Arun Subramanian ruled that Disney didn't prove that Sling TV's passes caused \"irreparable harm\" to the entertainment giant, as reported earlier by Cord Cutters. \n\nDisney sued Sling shortly after the live TV streaming service started allowing viewers to purchase temporary access to its library of channels, starting at a single payment of $4.99 for a one-day pass. Several channels included in the package are owned by Disney, including ESPN, ESPN2, ESPN3, and Disney Channel. In its lawsuit, Disney argued that the passes violate an agreement with Sling TV that says the service must give subscribers access to its content through monthly subscriptions. \n\nHowever, Judge Subramanian argues that this claim isn't likely to succeed, as the contract doesn't stipulate a \"m",
        "id": 4121380,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/20/1646232/disney-loses-bid-to-block-sling-tvs-one-day-cable-passes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Disney Loses Bid To Block Sling TV's One-Day Cable Passes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T16:49:46.583686+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T16:03:00+00:00",
        "description": "An anonymous reader shares a report: For the past several years, America has been using its young people as lab rats in a sweeping, if not exactly thought-out, education experiment. Schools across the country have been lowering standards and removing penalties for failure. The results are coming into focus. \n\nFive years ago, about 30 incoming freshmen at UC San Diego arrived with math skills below high-school level. Now, according to a recent report from UC San Diego faculty and administrators, that number is more than 900 -- and most of those students don't fully meet middle-school math standards. Many students struggle with fractions and simple algebra problems. Last year, the university, which admits fewer than 30 percent of undergraduate applicants, launched a remedial-math course that focuses entirely on concepts taught in elementary and middle school. (According to the report, more than 60 percent of students who took the previous version of the course couldn't divide a fraction",
        "id": 4120718,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/20/163208/american-kids-cant-do-math-anymore",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "American Kids Can't Do Math Anymore",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T15:48:40.038829+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T15:20:00+00:00",
        "description": "An anonymous reader writes: U.S. wireless carrier Verizon said Thursday it will cut more than 13,000 jobs in its largest single layoff as it works to shrink costs and restructure operations. Verizon also said it plans to convert 179 corporate-owned retail stores into franchised operations and close one store. \n\nVerizon's new CEO, Dan Schulman, said in a note to employees the company would reduce its workforce by more than 13,000 employees across the organization, and significantly reduce outsourced and other outside labor expenses. \n\nRelated: Delayed September report shows U.S. added 119,000 jobs, more than expected; unemployment rate at 4.4%<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Verizon+Cutting+More+Than+13%2C000+Jobs+As+It+Restructures%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F20%2F1445202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a",
        "id": 4120133,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/20/1445202/verizon-cutting-more-than-13000-jobs-as-it-restructures",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Verizon Cutting More Than 13,000 Jobs As It Restructures",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T14:47:33.923419+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T14:40:00+00:00",
        "description": "An anonymous reader shares a report: A Microsoft executive is questioning why more people aren't impressed with AI, a week after the company touted the evolution of Windows into an \"agentic OS,\" which immediately triggered backlash. \n\n\"Jeez there so many cynics! It cracks me up when I hear people call AI underwhelming,\" tweeted Mustafa Suleyman, the CEO for Microsoft's AI group. Suleyman added that he grew up playing the old-school 2D Snake game on a Nokia phone. \"The fact that people are unimpressed that we can have a fluent conversation with a super smart AI that can generate any image/video is mindblowing to me,\" he wrote.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Exec+Asks%3A+Why+Aren't+More+People+Impressed+With+AI%3F%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F20%2F1441200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a clas",
        "id": 4119482,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/20/1441200/microsoft-exec-asks-why-arent-more-people-impressed-with-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Exec Asks: Why Aren't More People Impressed With AI?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T14:47:34.050720+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T14:01:00+00:00",
        "description": "OpenAI won't say who audits its books. The company, which projects to hit an ARR of $20 billion this year and is valued at $500 billion, has committed to spending about $1.4 trillion on data centers over the next decade. It accounts for roughly two-thirds of unfulfilled contracts at Oracle and two-fifths at CoreWeave. Microsoft alone holds around $375 billion in unfulfilled contracts with OpenAI. \n\nReuters reported the company may target a $1 trillion valuation for a potential IPO in coming years. Most companies at this scale use one of the Big Four accounting firms: Deloitte, EY, KPMG or PwC. OpenAI declined to comment to Financial Times. A person close to the organization told the publication the company has \"an industry standard audit with one of the Big Four firms.\" The company's latest Form 990 filing lists Fontanello, Duffield, &amp; Otake -- a small San Francisco accountancy firm -- as the paid preparer. The form does say an independent accountant audited the statements. \n\nMich",
        "id": 4119483,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/20/0733244/who-is-openais-auditor",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Who is OpenAI's Auditor?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T13:47:07.732627+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Politico: The White House is preparing to issue an executive order as soon as Friday that tells the Department of Justice and other federal agencies to prevent states from regulating artificial intelligence, according to four people familiar with the matter and a leaked draft of the order obtained by POLITICO. The draft document, confirmed as authentic by three people familiar with the matter, would create an \"AI Litigation Task Force\" at the DOJ whose \"sole responsibility\" would be to challenge state AI laws.\n \nGovernment lawyers would be directed to challenge state laws on the grounds that they unconstitutionally regulate interstate commerce, are preempted by existing federal regulations or otherwise at the attorney general's discretion. The task force would consult with administration officials, including the special adviser for AI and crypto -- a role currently occupied by tech investor David Sacks.\n \nThe executive order, in the draft obtai",
        "id": 4118902,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/20/0034235/white-house-prepares-executive-order-to-block-state-ai-laws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "White House Prepares Executive Order To Block State AI Laws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T10:45:01.587753+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T10:00:00+00:00",
        "description": "Canadian librarian Ian Linkletter has ended a five-year legal battle with ed-tech firm Proctorio after being sued for sharing public YouTube help videos that exposed how the company's remote-proctoring AI works. Ars Technica reports: ... Together, the videos, the help center screenshot, and another screenshot showing course material describing how Proctorio works were enough for Proctorio to take Linkletter to court. The ed tech company promptly filed a lawsuit and obtained a temporary injunction by spuriously claiming that Linkletter shared private YouTube videos containing confidential information. Because the YouTube videos -- which were public but \"unlisted\" when Linkletter shared them -- had been removed, Linkletter did not have to delete the seven tweets that initially caught Proctorio's attention, but the injunction required that he remove two tweets, including the screenshots.\n \nIn the five years since, the legal fight dragged on, with no end in sight until last week, as Canad",
        "id": 4117049,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/20/0029245/proctorio-settles-curious-lawsuit-with-librarian-who-shared-public-youtube-videos",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Proctorio Settles Curious Lawsuit With Librarian Who Shared Public YouTube Videos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T07:08:23.886126+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T07:00:00+00:00",
        "description": "Researchers in Germany achieved a major milestone for the future quantum internet by successfully teleporting quantum information between photons generated by two different, physically separated quantum dots -- something never accomplished before due to the difficulty of producing indistinguishable photons from remote sources. Phys.org reports: At the University of Stuttgart, the team succeeded in teleporting the polarization state of a photon originating from one quantum dot to another photon from a second quantum dot. One quantum dot generates a single photon, the other an entangled photon pair. Entangled means that the two particles constitute a single quantum entity, even when they are physically separated. One of the two particles travels to the second quantum dot and interferes with its light particle. The two overlap. Because of this superposition, the information of the single photon is transferred to the distant partner of the pair.\n \nInstrumental for the success of the exper",
        "id": 4116500,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/20/0021228/quantum-teleportation-between-photons-from-two-distant-light-sources-achieved",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Quantum Teleportation Between Photons From Two Distant Light Sources Achieved",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T04:07:10.094754+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: When Mark Zuckerberg, Meta's chief executive, unveiled the company's Superintelligence Lab in June, he named 11 artificial intelligence researchers who were joining his ambitious effort to build a machine more powerful than the human brain. All 11 were immigrants educated in other countries. Seven were born in China, according to a memo viewed by The New York Times. Although many American executives, government officials and pundits have spent months painting China as the enemy of America's rapid push into A.I., much of the groundbreaking research emerging from the United States is driven by Chinese talent.\n \nTwo new studies show that researchers born and educated in China have for years played major roles inside leading U.S. artificial intelligence labs. They also continue to drive important A.I. research in industry and academia, despite the Trump administration's crackdown on immigration and growing anti-China sentiment i",
        "id": 4115730,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/19/2313246/in-the-ai-race-chinese-talent-still-drives-american-research",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "In the AI Race, Chinese Talent Still Drives American Research",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T02:06:20.286541+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T01:25:00+00:00",
        "description": "Longtime Slashdot reader ukoda shares a report from the Associated Press: China is replacing its diesel trucks with electric models faster than expected, potentially reshaping global fuel demand and the future of heavy transport. In 2020, nearly all new trucks in China ran on diesel. By the first half of 2025, battery-powered trucks accounted for 22% of new heavy truck sales, up from 9.2% in the same period in 2024, according to Commercial Vehicle World, a Beijing-based trucking data provider. The British research firm BMI forecasts electric trucks will reach nearly 46% of new sales this year and 60% next year.\n \nChina's trucking fleet, the world's second-largest after the U.S., still mainly runs on diesel, but the landscape is shifting. Transport fuel demand is plateauing, according to the International Energy Agency and diesel use in China could decline faster than many expect, said Christopher Doleman, an analyst at the Institute for Energy Economics and Financial Analysis. Electri",
        "id": 4115183,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/19/2256247/chinas-diesel-trucks-are-shifting-to-electric",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's Diesel Trucks Are Shifting To Electric",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T01:05:48.906230+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T00:45:00+00:00",
        "description": "A Tokyo court ruled that Cloudflare is liable for aiding manga piracy after failing to act on infringement notices and continuing to cache and serve content for major piracy sites, awarding about $3.2 million in damages. TorrentFreak says the decision sets a significant precedent in Japan, suggesting CDN providers can face direct liability when they don't verify customers or respond adequately to large-scale copyright abuse. From the report: After a wait of more than three and a half years, the Tokyo District Court rendered its decision this morning. In a statement provided to TorrentFreak by the publishers, they declare \"Victory Against Cloudflare\" after the Court determined that Cloudflare is indeed liable for the pirate sites' activities. In a statement provided to TorrentFreak, the publishers explain that they alerted Cloudflare to the massive scale of the infringement, involving over 4,000 works and 300 million monthly visits, but their requests to stop distribution were ignored.",
        "id": 4114918,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/19/2247224/tokyo-court-finds-cloudflare-liable-for-manga-piracy-in-long-running-lawsuit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tokyo Court Finds Cloudflare Liable For Manga Piracy in Long-Running Lawsuit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T01:05:49.114521+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T00:02:00+00:00",
        "description": "Adobe is buying Semrush for $1.9 billion in a move to supercharge its AI-driven marketing stack. Reuters reports: Semrush designs and develops AI software that helps companies with search engine optimization, social media and digital advertising. The acquisition, expected to close in the first half of next year, would allow Adobe to help marketers better understand how their brands are viewed by online consumers through searches on websites and generative AI bots such as ChatGPT and Gemini. \"The price is steep as Semrush isn't a massive revenue engine on its own, so Adobe is likely paying for strategic value. The payoff could be high too if Adobe can quickly turn Semrush's data into monetizable AI products,\" said Emarketer analyst Grace Harmon.\n \n\"While we are positive on Adobe restarting its M&amp;A engine given the success that it has seen with this motion over the years... this deal likely does little to answer the questions revolving around the company's creative cloud business,\" ",
        "id": 4114919,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/19/2238242/adobe-bolsters-ai-marketing-tools-with-19-billion-semrush-buy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Adobe Bolsters AI Marketing Tools With $1.9 Billion Semrush Buy",
        "vote": 0
    }
]