[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:35.035890+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T18:00:26+00:00",
        "description": "Kanning's talk aims to challenge how we view and approach emergency room overuse, particularly in pediatric care. Through her research and experience as a pre-med student deeply involved in public health policy and emergency medicine, she has seen firsthand how non-emergent visits to the ER create an overwhelming burden on healthcare systems. Families often rush to the ER for issues like mild fevers, colds, or minor injuries—cases that could be handled by primary care or at home with the right knowledge.\n\nBut what if we inverted the way we think about these visits? Instead of seeing them as a drain on resources, we can view them as missed educational opportunities. The concept of inversion is all about flipping perspectives, and her vision is to show how shifting our approach from reactive to proactive healthcare can transform how patients and families engage with medical systems. Imagine if families had the tools and education to understand when to seek emergency care and when altern",
        "id": 4121568,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QcbLR3HDY8U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QcbLR3HDY8U/hqdefault.jpg",
        "title": "Does your child need the ER or urgent care? | Destiny Kanning | TEDxMSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:35.168099+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:56:40+00:00",
        "description": "Dr. Renée St. Jacques reveals the psychological foundations that make teams truly excel. Drawing on her experience as a licensed psychologist, researcher, executive coach, and former Microsoft leader, she shows how emotional intelligence and human-centered leadership can transform performance and culture. Her talk offers practical, science-based insights for building teams that are not only effective, but deeply human. Dr. Renee St Jacques blends human behavior expertise as a licensed psychologist, researcher, and certified executive coach with over 20 years in Corporate America, including a notable tenure at Microsoft. Focused on maximizing team and leadership impact, she delivers expert solutions that enhance emotional intelligence, leadership acumen, and organizational culture, fostering greater humanity and impact to transform leadership for a new generation. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn",
        "id": 4121569,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8i3IQxKecQM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8i3IQxKecQM/hqdefault.jpg",
        "title": "A psychologist’s secret to high-performing teams | Dr Renee St Jacques | TEDxFiesole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:35.346265+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:56:32+00:00",
        "description": "Fabio Pressi, CEO of A2A E-Mobility and President of Motus-E, argues that mobility is no longer just about movement, it’s about data, power, and the future of cities. With over 20 years in smart mobility and leadership roles across Infoblu, Telepass, and Atlantia, Fabio reveals how digital intelligence is reshaping transportation, infrastructure, and the way we live. Drawing on insights from his 2025 book Digital Mobility, he shows why data will drive the next great mobility revolution. Fabio Pressi, born in 1966, is CEO and President of A2A E-Mobility since 2021 and President of Motus-E since 2024. He teaches at LUISS Business School and published Digital Mobility in 2025. With 20+ years in smart mobility, he was CEO of Infoblu, CDO at Telepass, and spent 10+ years at Atlantia, leading digital product and big data projects. He holds a degree in Electronic Engineering from the Polytechnic University of Turin. This talk was given at a TEDx event using the TED conference format but inde",
        "id": 4121570,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mABmZQR2e10",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mABmZQR2e10/hqdefault.jpg",
        "title": "Digital Mobility | Fabio Pressi | TEDxFiesole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:35.505799+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:45:17+00:00",
        "description": "a 15-year-old teen , shares their journey in the talk titled \"Redefining Myself Through New Places.\" This talk explores the challenges and growth that came from changing schools, adapting to new environments, and blending into different cultures as a teenager. Each move brought uncertainty, but also the chance to learn, grow, and reshape their identity. Through these experiences,Rishima discovered the power of adaptability, resilience, and self-discovery. Rather than being defined by one place or moment, they learned that every new environment added something valuable to who they are today. give me another title A passionate traveler with a creative spirit, she thrives on exploring new places, ideas, and perspectives. Endlessly curious and eager to learn, she embraces every experience as an opportunity to grow—both personally and professionally. Her journey is one of discovery, creativity, and continual learning. This talk was given at a TEDx event using the TED conference format but ",
        "id": 4121571,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=YMTwRmyNlEk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YMTwRmyNlEk/hqdefault.jpg",
        "title": "Redefining Myself Through New Places | Rishima Kadri | TEDxSunshineWorldwideSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:35.681178+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:44:58+00:00",
        "description": "The talk explores how the fear of missing out shapes our decisions, especially as teenagers constantly torn between choices. Through personal stories and reflections, this talk shows how shifting our mindset from what we might miss to what we truly value can turn uncertainty into clarity — helping us embrace our unique paths without regret. Pranusha is a passionate learner with diverse interests in books, music, movies, and science, thriving on creativity and curiosity. With strong skills in creative design, critical thinking, and problem-solving, she brings fresh perspectives to every challenge. Enthusiastic and open-minded, she enjoys venturing into new horizons and embracing growth. Driven by a strong desire to succeed, she aims to make a meaningful and lasting impact through her ideas. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4121572,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lcs8Zfy0DXs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lcs8Zfy0DXs/hqdefault.jpg",
        "title": "FOMO to FOWI: Focusing on What’s Important | Pranusha Shetty | TEDxSunshineWorldwideSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:35.849208+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:44:27+00:00",
        "description": "Most people see clutter as a chore, but what if it actually holds opportunity and possibility? In this talk, Deirdre Greaney explores why releasing things can feel so difficult and why doing it can bring relief, growth, and healing. Through personal stories, cultural traditions, insights from neuroscience, and her Three Doors of Letting Go method, she shows how clearing space around us can create space within us. Deirdre Greaney is a holistic coach and wellness practitioner whose work brings together energy healing, coaching, essential oils and natural living to support emotional balance and everyday wellbeing. After beginning her career in law and insurance, she transitioned into the wellness field, earning qualifications in bio-energy therapy, reflexology and aromatherapy, as well as life and business coaching with neuroscience. She now helps people reconnect with themselves on energetic, emotional and practical levels.\n\nDeirdre leads group and individual sessions that combine oils,",
        "id": 4121573,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UKQDNHyddE8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UKQDNHyddE8/hqdefault.jpg",
        "title": "Why is it so hard to let go of clutter? | Deirdre Greaney | TEDxTraleeWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:36.016167+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:42:50+00:00",
        "description": "As the digital revolution reshapes every industry, healthcare stands at a pivotal crossroads. This talk explores how the convergence of artificial intelligence, machine learning, and predictive analytics is transforming not only how we diagnose and treat illness, but how we design the very systems and spaces in which healthcare delivery takes place.\n\nFrom algorithm-driven patient triage to smart hospital infrastructures that adapt in real time, the future of healthcare lies in our ability to harmonize human expertise with intelligent technologies. But this transformation is about more than machines—it’s about trust, ethics, equity, and access. How do we build digital tools that enhance, rather than replace, human compassion? How can we ensure these systems serve all populations fairly, not just the digitally privileged? And what role must clinicians, designers, and technologists play together in shaping this evolution?\n\nThis talk offers a visionary yet grounded look at the future-read",
        "id": 4121574,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XWzSGX5ILRI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XWzSGX5ILRI/hqdefault.jpg",
        "title": "Do algorithms design future ready medical systems? | Zisis Kozlakidis | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:36.151020+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:42:36+00:00",
        "description": "When we were unborn children, we exchanged cells with our mums. Hear the incredible story of these cells and what it might mean for you… Thomas studied Technical Chemistry at TU Graz and received his doctorate in Medical Sciences from Med Uni Graz (PhD equivalent, with distinction) in 2009. During his thesis, he worked on rare cell analysis in the context of non-invasive prenatal diagnostics, focusing on fetal cells circulating in the peripheral blood of pregnant women. In 2014, he was awarded a three-year Marie Curie Fellowship, allowing him to join the lab of Prof. Stahlberg in Gothenburg, Sweden, where he expanded his knowledge of single-cell RNA analyses. Back in Austria, he habilitated in Cell Biology, Histology, and Embryology (venia docendi) in 2018 and was appointed 2nd Deputy Chair of the Division of Cell Biology, Histology, and Embryology. In 2021, he started a research group and became the leading principal investigator of an international consortium running a 5.3 million U",
        "id": 4121575,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=rk6kgrrGOUU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rk6kgrrGOUU/hqdefault.jpg",
        "title": "Microchimerism - not all human cells in your body come from you | Thomas Kroneis | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:36.319354+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:42:18+00:00",
        "description": "In a world engineered by curated feeds, invisible algorithms, and conversations filtered through screens, how do we stay true to who we really are?\nAdole-Sense explores what happens when an entire generation grows up online - where every like, comment, and feed doesn’t just observe us… it quietly shapes us.\nAs a 15-year-old global student growing up inside the digital ecosystem, I’ve seen how platforms don’t simply connect young people. They profile us, predict us, and emotionally engineer us. The internet was built for discovery and 'good', but teens like us are growing up inside systems designed for manipulation.\nThe future is being coded right now, and it’s time we keep our voices real, human, and our own! Tamas is a 15-year-old international student based in France, originally from Hungary, with Russian and Central Asian roots, and was born in Georgia. Growing up in a diplomatic family—with a father working for the United Nations and a mother involved in journalism—he has lived on",
        "id": 4121576,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Maygx-Y7VcA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Maygx-Y7VcA/hqdefault.jpg",
        "title": "adole-sense | Tamas Landesz | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:36.500389+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:42:05+00:00",
        "description": "What comes to mind when you hear the word “scientist”? For many, it’s an image of someone distant, elite—even arrogant.\n \nIn this talk, I challenge that stereotype by sharing my personal journey into science, one that didn’t follow the traditional path. I show how science is not a closed-off world for a chosen few, but a way of thinking that belongs to all of us.\n \nThrough honest storytelling and reflection, I break down the myth of the “untouchable, unreachable scientist” and make the case for a more human, inclusive approach, where curiosity, humility, and collaboration matter more than credentials or ego.\n \nMy goal is to empower the audience to see science differently: not as a cold, exclusive system, but as a creative and collective effort we can all be part of.\n \nThe future starts today—let’s transform the scientific landscape into a space where people are welcomed in and have the opportunity to explore, contribute, and lead. Sahra is a molecular biologist with a background in ca",
        "id": 4121577,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Q1RxfZfza28",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Q1RxfZfza28/hqdefault.jpg",
        "title": "Who is a Scientist? Shaping Innovation from the Heart  | Sahra Tasdelen | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:36.664908+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:41:57+00:00",
        "description": "It took doctors a decade to find his diagnosis. It took AI ten seconds. This talk reveals how technology—which can feel cold and detached—is actually the key to reclaiming humanity in healthcare. We can use algorithms to dismantle bias and burnout, empowering patients and freeing doctors to truly see and heal. \n\nKey Takeaway:\nYour health, your data, your future. Roi's background is a patchwork of patient advocacy, tech innovation, and hard-won personal experience. He has lived the challenges of navigating chronic illness, often finding himself forced to become his own advocate. This experience led him to create patient-led communities, as he understands the power of shared experience and collective voice. On the tech side, he dove headfirst into the world of medical device startups and developed the Help+ app, driven by a desire to use technology to bridge gaps in healthcare. He is not a traditional “expert”; he is a patient who has become a problem-solver, a disruptor, and a relentle",
        "id": 4121578,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KiO_LLv6uRc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KiO_LLv6uRc/hqdefault.jpg",
        "title": "The Algorithm Will See You Now | Roi Shternin | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:36.973298+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:41:32+00:00",
        "description": "Not every innovation begins with billion-dollar ideas in high-tech labs. Sometimes it starts with something as ordinary as a roll of tape - or as profound as a moment in the ICU.\n\nIn this talk, medical students from Graz share two stories - one simple, one tragic- to show that innovation isn’t about the size of a problem, but the courage to act on it. That spirit led them to found MIOSIS, a space where students turn ideas into solutions that matter.\n\nBecause real innovation begins the moment someone decides, this can’t stay the way it is. MIOSIS (Medical Innovations of Students in Styria) is where bold ideas to shape the future of healthcare emerge - not from textbooks, but from collaboration, curiosity and courage.\nFounded at the Medical University of Graz, MIOSIS connects students from diverse fields to share knowledge, exchange perspectives and co-create solutions that address pressing issues in medicine and care.In open, supportive environments, members are encouraged to grow, cha",
        "id": 4121579,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Ha1ymVUSFu4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Ha1ymVUSFu4/hqdefault.jpg",
        "title": "How small ideas change everything | MIOSIS Medical Innovation of Students in Styria | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:37.173821+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:41:19+00:00",
        "description": "What happens to your brain when you consume the news - and why does it sometimes leave you feeling anxious, overwhelmed or powerless?\n \nBBC journalist, presenter, and podcast host Hannah Gelbart explores the neuroscience of news consumption. She explains how scientists have discovered that distressing headlines and graphic images trigger our brain’s fight-or-flight response, with events happening thousands of kilometres away sparking real fear in our minds and bodies.\n  \nBut research shows our brains are also drawn to bad news. We’re wired to seek out danger, novelty and answers. That’s why doomscrolling feels so addictive. Studies show we notice, remember and respond more strongly to negative news than to positive. It’s a survival mechanism with unintended consequences in the digital age.\n \nAnd what can journalists learn from this?\n \nHannah talks about her experience of developing a new format for young people who may avoid traditional news but still want to be informed. ‘What in the",
        "id": 4121580,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=idXpB_hfwnI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/idXpB_hfwnI/hqdefault.jpg",
        "title": "Addicted or Overwhelmed? Your brain on the news | Hannah Gelbart | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:37.377243+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:41:16+00:00",
        "description": "The talk discusses why our minds often misread tomorrow. We tend to imagine a single “future” and forget that there are many possible futures. We misunderstand probabilities, mistake randomness for patterns, and fall victim to false certainty or needless panic. In moments of crisis, our coping mechanisms make us postpone critical decisions that determine our future. Hype can blind us to the difference between true hope and wishful thinking.\nDrawing on insights from critical futurism, behavioral economics, statistics, psychology, and cognitive sciences, this talk exposes how biases obscure our vision of what may lie ahead. It offers practical strategies to spot mental traps, expand our thinking, and approach the future with clearer vision, greater confidence, and a sense of agency.\n\nKey takeaway:\nWe can’t predict the future—but by spotting mental traps, we can think and ACT about it more wisely, creatively, and courageously. Lukasz is a researcher in foresight and interdisciplinary stu",
        "id": 4121581,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nVcC-IA0NyQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nVcC-IA0NyQ/hqdefault.jpg",
        "title": "10 Pitfalls in Future Thinking - and How to Avoid Them | Lukasz Nazarko | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T18:28:37.513331+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:40:31+00:00",
        "description": "What if we treated sexual education not as a topic of controversy, but as a powerful tool for prevention and safety?\n\nThis talk explores how comprehensive sexual education is one of the most effective strategies we have to reduce violence, support sexual health, and foster equality.\n\nDrawing on recent international research and global standards, it unpacks how age-appropriate, rights-based education can shape the future - for example, by teaching consent, addressing harmful gender norms, and empowering young people to understand and protect themselves and others.\n\nSexual education is not just about information; it’s about prevention, boundaries, and safety. It equips individuals to navigate relationships with respect, awareness, and kindness.\n\nThe future is now, and it’s informed, inclusive, and safer for all.    Gudrun is a teacher, sexual educator, medical student, and PhD candidate at the University of Graz, researching sexual education in Austria and the German-speaking region. Ov",
        "id": 4121582,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BgN4iTtB6hI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BgN4iTtB6hI/hqdefault.jpg",
        "title": "Let's have that talk: Rethinking sexual education | Gudrun Kern | TEDxMedUniGraz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:12.398222+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:13:15+00:00",
        "description": "Oggi la stampa e i giornalisti sono minacciati e la libertà di opinione è sotto attacco in molte regioni del mondo. Nel suo appassionato talk Désirée Klain racconta quanto sia importante sostenere reporter e fotografi, se vogliamo difendere il loro operato contro la corruzione, la criminalità, le derive autoritarie. Solo una stampa libera offre un argine contro le distorsioni della verità e della democrazia.  Today, press and journalists are under threat, as well as freedom of expression, in many areas of the world. In her passionate talk, Désirée Klain underscores the urgent need to support reporters and photojournalists in defending their work against corruption, crime, and authoritarianism. A free press remains one of the strongest safeguards against the distortion of truth and the erosion of democracy. Desiree Klain: giornalista, regista e direttrice artistica vanta oltre 30 anni di esperienza in ambito culturale e sociale. Collabora con il Corriere del Mezzogiorno e dirige festiv",
        "id": 4121006,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8p9DX7GnEUw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8p9DX7GnEUw/hqdefault.jpg",
        "title": "Proteggiamo insieme la libertà di informazione | Désirée Klain | TEDxMantova",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:12.496859+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:13:08+00:00",
        "description": "The talk celebrates generations of Irish women who challenged patriarchy, survived violence, and pushed for social change—from early 20th-century rebels to modern feminist voices. Through stories of forgotten heroines and personal ancestry, it reveals how progress has always faced resistance. It calls for renewed revolutionary spirit to protect today’s freedoms. Dr. Mary McAuliffe is a historian, lecturer, and Director of Gender Studies at UCD. She specialises in Irish women's / gender history, traumas histories of gendered and sexual violence of Ireland's revolutionary period and histories of sexualities. She completed her BA (Hons), MA, and PhD at the School of History and Humanities, Trinity College, Dublin (TCD)\n\nShe is on the advisory committee on the representation of women's stories in the National Cultural Institutions. She is also on the advisory board of the Irish Association of Professional Historians (www.iaph.ie) and is a past President of the Women's History Association ",
        "id": 4121007,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FLRIKMiJ5Qc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FLRIKMiJ5Qc/hqdefault.jpg",
        "title": "Revolutionary Women | Mary McAuliffe | TEDxTraleeWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:12.594238+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:12:59+00:00",
        "description": "From bathroom hideouts to boardroom high fives, this TEDx Talk dives into the wild, awkward, and unexpectedly hilarious world of learning to network. Packed with bold honesty and laugh-out-loud moments, it shows how a former networking escape artist flipped fear on its head and proves that if she can do it, absolutely anyone can.  As a business leader and current CEO, Galway Chamber of Commerce,  Karen's experience is in driving strategic growth, business advocacy, and regional economic development. As CEO of Galway Chamber of Commerce, she champions innovation, enterprise, and collaboration across Galway's business ecosystem working with stakeholders to create a thriving, future-focused region.\n\nKaren's career spans leadership roles across the hospitality, business events, and sports tourism sectors, most recently as General Manager of the Shannon Region Conference and Sports Bureau. Her work has consistently focused on building partnerships that deliver real impact both economically",
        "id": 4121008,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ARbjV69WYfI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ARbjV69WYfI/hqdefault.jpg",
        "title": "From Bathrooms to Board Rooms | Karen Ronan | TEDxTraleeWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:12.691018+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:12:51+00:00",
        "description": "What if everything you need, work, school, coffee, groceries, was just a short walk or bike ride away? Jayanna explores the concept of the 15-minute city, a bold vision for urban planning that prioritises people over traffic. From reducing emissions and improving health to strengthening communities and local economies, this talk reveals how rethinking city design can transform daily life. It’s not about taking away choices, it’s about creating better ones. With a creative spirit and a passion for family, Jayanna brings to the stage a fresh vision for urban life. Her talk investigates the idea of the “15-minute city”—a place where everything you need, from school to shops to green space, is within a short walk or bike ride. Jayanna explains how this model is already transforming cities like Paris and Melbourne, creating healthier, more connected communities. Her purpose is to inspire a future where cities are built around people—not just cars. This talk was given at a TEDx event using ",
        "id": 4121009,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=On2HWB4MffE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/On2HWB4MffE/hqdefault.jpg",
        "title": "Designing Better Cities: The 15-Minute Revolution | Jayanna Barratt | TEDxSt Marys College Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:12.780310+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:12:37+00:00",
        "description": "How do you find inspiration? Children dress up as the characters they love to have fun, but as adults we lose that motivation. What if the people we admire can teach us something about ourselves? Change your mindset, change your life. Cosplayer Akadinosan reveals how finding your 'one thing', that spark that brings you happiness can help you find your passion. Aka is a cosplayer, composer, and academic from Ireland with a strong background in creative and performance-based work. Over the past five years, Aka has brought more than 100 characters to life both online and at in conventions across Europe as both a guest and performer. Their work explores the relationship between character, identity, and self-expression.\n\nAs a synth-pop musician, Aka is currently preparing to release a debut EP. Their creative practice blends visual performance and music to express ideas around anemoia and emotional retro aesthetics.\n\nAka holds a BSc in Multimedia, an MSc in Public Relations and Strategic C",
        "id": 4121010,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=aJ-Ur90t4-Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aJ-Ur90t4-Y/hqdefault.jpg",
        "title": "Why I cosplay my heroes | Aka Dee | TEDxTraleeWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:12.873886+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:12:30+00:00",
        "description": "People of all ages experience stress, anxiety, and depression daily, and most adults don’t know how to help children improve their mental health.\nIn this TEDx talk shared by a 12-year-old author, you will learn:\n1- How journaling can help children (and people of all ages) understand and validate their emotions.\n2- Her experience as a young child using journaling to cope with feelings of anger, sadness, confusion, and fear.\n3- How anyone can use journaling to activate their superpowers so they can change their life and the world. Eliana Fernández is a bilingual 12-year-old artist and creative entrepreneur. Eliana has spoken and performed on stages around the world about Your 12 Superpowers, including Mexico, the Bahamas, and to 700,000 people in India. She recently designed her own website: Your12Superpowers.com, and is the author of “Your 12 Superpowers: Discover Your True Self and Change Your Life.” Eliana loves her mom, her sisters, and all animals. She loves to write songs and poem",
        "id": 4121011,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QAErImdTjtU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QAErImdTjtU/hqdefault.jpg",
        "title": "Journaling from a Child's Perspective | Eliana Fernández | TEDxTraleeWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:12.962663+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:12:22+00:00",
        "description": "This talk takes you on a journey from the womb to old age, revealing how rhythms and sound shape our brains, bodies and relationships at every stage of life. prepare to rethink what music truly does for us! Music is the driving force in Louise Kelly’s life. A Consultant Music Therapist and co-founder of Resilient Rhythms, Louise has spent over 25 years harnessing music’s transformative power to connect, regulate, and heal across all ages and settings.\nAlongside her clinical practice, she lectures at university level on therapeutic music-making in education, equipping future teachers with creative, evidence-based tools for the classroom. A qualified ADHD and autism diagnostician, Louise also delivers neurodiversity training to businesses, schools, and organisations, helping them build inclusive cultures that celebrate difference.\nHer work extends across the UK and Ireland, where she leads staff training and workshops designed to strengthen resilience and wellbeing. With a foundation in",
        "id": 4121012,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TTKezQB0A3E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TTKezQB0A3E/hqdefault.jpg",
        "title": "Music isn’t a Luxury — it’s a Biological Necessity!  | Louise Kelly | TEDxTraleeWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:13.048888+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:11:57+00:00",
        "description": "İhmal, sevgisizlikten daha can yakıcıdır. 1992’de doğdu. Yazar, düzenlemesi ve arka kapak yazısı küçük İskender’e ait olan “Ağladı ve Gözyaşlarını \nÖptüm” kitabıyla çok satanlara girdi. Bilgi Üniversitesi’nde sinema okuyup kısa filmler çektikten sonra \nBabala Tv’de ‘Yeraltından Notlar’ isimli kitap programını yazıp sunmaya başladı. Bu programıyla birçok \nüniversiteden ödüller aldı ve programa Flu Tv’de devam etmeye başladı. Diğer kitapları ise: Ben, Hiçbir \nŞey, Duvar ve Sürgün. Artık sadece senaryo yazarlığı yapıyor. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4121013,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=aPww4vVxNKM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aPww4vVxNKM/hqdefault.jpg",
        "title": "Yazdığım Her Romanda, Senaryoda Ebeveynlerimi Suçladım | Aytuğ Akdoğan | TEDxSur",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:13.134780+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:11:42+00:00",
        "description": "Yalanımızı doğru seçersek, hayatı mutlu yaşama ihtimalimiz daha yüksek. Lisans eğitimini İstanbul Teknik Üniversitesi İnşaat Mühendisliği Bölümünde tamamlamış, Yüksek \nlisans ve doktora eğitimini “Yönetim Bilimleri” alanında yapmış, doçent ve profesör unvanlarını \n“Yönetim ve Strateji” alanında almıştır. \nBeşi akademik, ikisi çizgi roman olmak üzere dokuz kitabı, sahnelenmiş bir tiyatro oyunu, uluslararası \nakademik dergilerde yayımlanmış çok sayıda bilimsel makalesi vardır. Teknoloji girişimciliği alanında \nda faaliyet gösteren, aynı zamanda pek çok köklü işletmede uzun süreli kurumsal gelişim ve yeniden \ninşa projeleri gerçekleştirmiştir. \nHâlen Marmara Üniversitesi İşletme Fakültesinde öğretim üyesi olarak görev yapmakta ve çeşitli \nprogramlarda “Uygarlık Tarihi”, “Sosyal Girişimcilik”, “Bilim Felsefesi” ve “Stratejik Yönetim” dersleri \nvermektedir. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at ht",
        "id": 4121014,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CRdrshFCZyg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CRdrshFCZyg/hqdefault.jpg",
        "title": "İnsan Kendi Yalanını İnşa Edebilen Bir Varlık | Ata Özdemirci | TEDxSur",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:13.221243+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:08:29+00:00",
        "description": "Ingeniero Electrónico y Coach de Negocios. Fundó Lidera con IA, desde donde guía a dueños de PYMEs y emprendedores a adoptar IA de forma estratégica para liberar tiempo, ordenar procesos y enfocarse en decisiones de impacto. Cofundó Ziva+, startup pionera en Argentina en desarrollar un sistema de monitoreo cardíaco grupal en tiempo real que integra software, salud y deporte. Trabajó más 10 años en telecomunicaciones, liderando proyectos tecnológicos de gran escala y equipos de ingeniería. Coach en Empresarios con Impacto, acompaña a líderes de todo el país y potencia comunidades colaborativas. Profesor en la Facultad de Ingeniería de la UBA y en programas de formación emprendedora. Su propósito: hacer simple lo complejo y convertir la tecnología en una herramienta humana para crear futuro. Ingeniero Electrónico y Coach de Negocios. \nFundó Lidera con IA, desde donde guía a dueños de PYMEs y emprendedores a adoptar IA de forma estratégica para liberar tiempo, ordenar procesos y enfocars",
        "id": 4121015,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qSwqswiVd8I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qSwqswiVd8I/hqdefault.jpg",
        "title": "\"La ecuación que nos enseñaron esta rota\" | Maximiliano Ferrero | TEDxBarrioSanNicolasSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:13.307237+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:08:16+00:00",
        "description": "What if the biggest lie you tell yourself everyday is the one you whisper to yourself--I'm fine?  In this honest and powerful TEDx talk, Kathy Houston reveals how living by society's rules and expectations can silence your truth--until one life-changing moment forces you to wake up. Her journey from conformity to authenticity as a Late- in-life Lesbian challenges all of us to examine the stories we tell, the masks we wear, and the courage it takes to finally live in alignment with who we really are. Kathy Is the Run Your Life Coach. Her motto: Don't Let Life Run You.  She identifies as Lesbian and she/her.  She specialises in increasing your mental fitness to improve health and wellness, and relationships for mature women of power in and out of the LGBTQ+ community.\nShe knows first hand how hard it can be to live fully as yourself. When she began to embrace herself and accept herself for who she really was, a weight was lifted and joy filled her life.\n\nShe ended a marriage of 35 years",
        "id": 4121016,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2h4YKR8Gmsg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2h4YKR8Gmsg/hqdefault.jpg",
        "title": "What Lies Are You Telling Yourself? | Kathy Houston | TEDxTraleeWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:13.394928+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:08:03+00:00",
        "description": "Magali Bejar es ingeniera en sistemas y emprendedora. Tras graduarse de ingeniería en UTN, obtuvo becas internacionales en Georgetown, YLAI, Singularity University y London School of Economics, donde fue seleccionada como Women Emerging Leader entre 28.000 aplicantes. Fundó Tiene que haber algo más, una compañía de empleabilidad y educación que ayuda a profesionales hispanos a cerrar la brecha de oportunidades mediante el trabajo remoto. los programas, podcast y newsletter llegan a más de 60 países. Organiza EmprendING UBA, el curso de emprendimientos con un equipo de 50 docentes voluntarios. Con 10 años de experiencia en tecnología como product manager en Argentina y USA, trabajó remoto viajando por el mundo dando 5 vueltas al globo. Fue reconocida como Top 50 Remote Influencer, ganó el premio Women that Build de Globant y fue jurado en Innovation awards de Adecco. Fue speaker de charlas en Google, Georgetown University, Fuck up Nights y IAE. Magali Bejar es ingeniera en sistemas y e",
        "id": 4121017,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5-QsllXZHbU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5-QsllXZHbU/hqdefault.jpg",
        "title": "\"La reingeniería de tu carrera\" | Magali Bejar | TEDxBarrioSanNicolasSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:13.514389+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:07:48+00:00",
        "description": "Soy bioingeniera egresada del ITBA, siempre orientada a la ciencia de datos y al desarrollo de tecnologías de inteligencia artificial aplicadas a la salud. Me apasiona la manera en que las nuevas tecnologías tienen el potencial de mejorar la vida de muchos pacientes, acercando soluciones innovadoras a la práctica médica. A comienzos de 2025 fundé, junto a tres compañeras de la facultad, Kuvia, una startup que desarrolla métodos diagnósticos basados en inteligencia artificial para la detección de biomarcadores en cáncer. Nuestro objetivo es que herramientas de vanguardia, hoy costosas y poco accesibles, puedan llegar a más pacientes y profesionales de la salud, impulsando diagnósticos más rápidos, precisos y escalables. Soy bioingeniera egresada del ITBA, siempre orientada a la ciencia de datos y al desarrollo de tecnologías de inteligencia artificial aplicadas a la salud. Me apasiona la manera en que las nuevas tecnologías tienen el potencial de mejorar la vida de muchos pacientes, ac",
        "id": 4121018,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Uy7ctOs-KZI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Uy7ctOs-KZI/hqdefault.jpg",
        "title": "\"Tecnología con impacto real en salud\" | Ana Gorodisch | TEDxBarrioSanNicolasSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:13.625104+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:07:40+00:00",
        "description": "Tomás Chernoff trabaja con impresión 3D desde 2010. Fundó Che3D en 2014, empresa con más de 10 años de trayectoria en diseño, desarrollo y fabricación digital, trabajando con sectores como la industria aeroespacial e incorporando impresión 3D en acero y titanio. Es fundador y CTO de Grondplek, compañía que desarrolla soluciones constructivas mediante impresión 3D de cemento para vivienda y obras civiles, en alianza con Techint y COBOD. En 2020 lideró la producción y donación de 50.000 máscaras faciales a hospitales públicos, y la fabricación de otras 500.000 que se distribuyeron mediante las principales cadenas de retail. Es cofundador de Peek Studios, el primer estudio de streaming profesional desarrollado mediante fondeo VC en 2018. Además, capacitó a más de 2500 jóvenes en el desarrollo de emprendimientos con tecnología de impresión 3D. Tomás Chernoff trabaja con impresión 3D desde 2010. Fundó Che3D en 2014, empresa con más de 10 años de trayectoria en diseño, desarrollo y fabricac",
        "id": 4121019,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=G_z2fTI439Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/G_z2fTI439Q/hqdefault.jpg",
        "title": "\"Nuestro Futuro, Impreso en 3D\" | Tomás Chernoff | TEDxBarrioSanNicolasSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T17:25:13.721622+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T17:07:27+00:00",
        "description": "Soy ingeniera civil y emprendedora, apasionada por los desafíos que unen personas, ideas y tecnología, y que me eyectan de la zona de confort. Hace poco más de un año inicié mi camino emprendedor, fundando una consultora BIM para acercar el valor de la tecnología a la industria de la construcción. Ese recorrido me impulsó a ampliar mi formación hacia un enfoque más integral, incluyendo mi actual preparación como coach ontológico profesional. Lo que más disfruto es crear vínculos auténticos, en cualquier ámbito. Me fascinan los idiomas: hablo inglés e italiano, y un poco de alemán, estudiarlos me es altamente estimulante. Soy buzo deportivo, una experiencia que me enseñó autocuidado, trabajo en equipo y calma, porque a 30 metros de profundidad, subir no es opción. Soy ingeniera civil y emprendedora, apasionada por los desafíos que unen personas, ideas y tecnología, y que me eyectan de la zona de confort. \nHace poco más de un año inicié mi camino emprendedor, fundando una consultora BIM",
        "id": 4121020,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eQgYUMZHzMY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eQgYUMZHzMY/hqdefault.jpg",
        "title": "\"Building through connection\" | María de los Ángeles Sager | TEDxBarrioSanNicolasSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T16:24:46.657073+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T16:10:14+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker's personal views and understanding of personal growth, healing, and the brain, which some viewers may find stigmatizing. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nFrom politician to painter, Leah Johnson shows how quitting isn’t failure but a creative act of courage and transformation. Leah Johnson is a former elected official turned artist, author, and transformational guide who helps people reconnect with creativity and reclaim their joy. After 25 years in politics—including national campaigns and a city council seat—she burned out under the weight of perfectionism and pressure. Success on the outside felt hollow within.\n\nHer healing began not with policy, but with paintbrushes. Through spiritual and creative inquiry, Leah shed the roles she was told to play and found her vibrant, ",
        "id": 4120333,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fByZAzyJugk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fByZAzyJugk/hqdefault.jpg",
        "title": "The Courage to Quit: Small Releases, Big Healing | Leah Johnson | TEDxManitou Springs Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T16:24:46.764205+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T16:07:40+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker’s personal views and approach to diet, weight loss, and personal growth. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nWhat happens when the identity you’ve built your entire life no longer fits? In this TEDx talk, Kendra Brim shares her journey of losing 120 pounds, transitioning from a Division I basketball player to life beyond the court, and building a business rooted in purpose and authenticity.\n\nThrough her story, she explores the emotional weight we carry, expectations, achievements, and the pressure to perform, and how stepping out of bounds can actually lead to freedom, growth, and a redefined version of success.\n\nThis talk is for anyone navigating transition, questioning their identity, or seeking the courage to embrace the next version of themselves. Kendra Brim is a speaker, ",
        "id": 4120334,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eFs1nokXejc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eFs1nokXejc/hqdefault.jpg",
        "title": "Redefining success beyond the court | Kendra Brim, MBA | TEDxBuffalo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T16:24:46.873359+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T16:05:06+00:00",
        "description": "In this compelling TEDxAlBateen talk, H.E. Dr. Mohamed Al Kuwaiti, Head of Cybersecurity for the UAE Government, shares a powerful message about trust, awareness, and resilience in our increasingly digital world.\n\nThrough real-life stories — including that of a friend who lost everything to a cyberattack — Dr. Al Kuwaiti illustrates how the ripple effects of digital threats reach beyond technology, impacting families, businesses, and even nations. He reveals how the UAE is tackling over 250,000 cyberattacks daily, building not just technical defenses but a culture of vigilance, collaboration, and human-centered protection.\n\nBlending global insight with Emirati values, Dr. Al Kuwaiti urges us to treat cybersecurity not as a technical issue, but as a shared responsibility — a new form of peacekeeping that protects lives, livelihoods, and trust itself.\n\nKey ideas:\n\n- Cybersecurity as a human right, not a privilege\n- The rise of cybercrime, cyberterrorism, and cyberwarfare\n- Building digi",
        "id": 4120335,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=A76JhUCqEe4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/A76JhUCqEe4/hqdefault.jpg",
        "title": "Peace of Mind Is a Basic Human Right, Not a Privilege! | H.E. Dr. Mohammed Al Kuwaiti | TEDxAlBateen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-20T16:24:46.977261+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-20T16:02:44+00:00",
        "description": "NOTE FROM TED: Please do not look to this talk as a substitute for mental health advice. TED does not endorse the use of psychedelics or other regulated substances that can lead to serious health and safety concerns, especially when used outside of accredited research or therapeutic settings. This talk only represents the speaker's personal views and understanding of mindset, behavior, and the brain. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nAfter surviving a traumatic brain injury and years of addiction, neuroscientist Devin Effinger explores how psychedelics reveal the brain’s remarkable capacity for change. Blending personal story with cutting-edge research, he introduces the idea of voluntary evolution—the practice of using awareness and deliberate action to rewire the mind and get unstuck. Dr. Devin Effinger is a neuroscientist, s",
        "id": 4120336,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=08LgirADm4M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/08LgirADm4M/hqdefault.jpg",
        "title": "Getting Unstuck: Moving Towards Better Mental Health | Dr. Devin Effinger | TEDxBoulder",
        "vote": 0
    }
]