[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-06T15:30:11+00:00",
        "description": "Forza Motorsport and Gran Turismo 7 continue their post-launch support, improving by leaps and bounds over their launch versions. However, those seeking a new racing sim to sink dozens of hours into might want to check out Kunos Simulazioni's Assetto Corsa EVO.\n\nEntering Steam Early Access on January 16th, it offers 20 different vehicles and five real-world circuits from the get-go. Quick Race, Practice Sessions and the new Driving Academy are also available to familiarize fans with the racing. The developer has also made multiple improvements to the physics, handling, suspension, and track simulation, creating an even more realistic and immersive experience.\n\nEarly access is only really the beginning, though, and EVO has so much more on the way. Here's everything you should know about the title, what the future holds for its full release (including the series' first-ever open-world map), and much more.",
        "id": 1844039,
        "language": null,
        "link": "https://www.youtube.com/watch?v=XeyuWj7nxJg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XeyuWj7nxJg/hqdefault.jpg",
        "title": "Assetto Corsa EVO - 15 Things You Need To Know BEFORE YOU BUY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-06T13:30:16+00:00",
        "description": "The year 2024 has been a pretty eventful one for video games, with plenty of high-profile releases being packed throughout the year. We got to experience plenty of praise-worthy titles right from surprise hits like Helldivers 2 to heavy hitters like Black Myth Wukong among others. \n\nNow that 2025 has finally dawned upon us, it makes sense to shift our gazes over to the horizon and see what awaits us in the near future. Sony’s PS5 lineup of exclusives is looking particularly strong at this point, and we will be discussing that as we run down 20 of the most promising PS5 games that are going to be released in 2025 and beyond. \n\nNote that we will only be discussing confirmed titles and console exclusives, so any rumoured titles are beyond the scope of this feature.",
        "id": 1843528,
        "language": null,
        "link": "https://www.youtube.com/watch?v=VLRvQF_YPLE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VLRvQF_YPLE/hqdefault.jpg",
        "title": "20 Upcoming Big PS5 Exclusive Games of 2025 And Beyond You Definitely Need To Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-06T09:30:23+00:00",
        "description": "As more gacha games are released and miHoYo continues to be the authority on the matter, especially with its ongoing franchises, it's interesting to note the support for Wuthering Waves. Kuro Games' open-world action RPG has improved drastically following its mixed launch, and it's now available on PS5.\n\nEven more noteworthy is Version 2.0, which takes players to a brand new country, Rinascita. Continuing the story of the Rover, players encounter new characters, venture through gorgeous new environments, tackle new Echoes, and even learn to fly. It's a mountain of new content backed by the game's incredible combat and presentation values.\n\nHowever, there are also significant improvements to the overall writing and voice-acting. Suffice it to say that the story and characterization are leaps and bounds above the base game. While its gacha mechanics won't be (and shouldn't be) for everyone, Wuthering Waves has undoubtedly cemented itself as a solid contender to Genshin Impact.",
        "id": 1842029,
        "language": null,
        "link": "https://www.youtube.com/watch?v=YdNUGMhJU3g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YdNUGMhJU3g/hqdefault.jpg",
        "title": "Wuthering Waves PS5 Review - Is Update 2.0 A Game Changer?",
        "vote": 0
    }
]