[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T23:28:50.552535+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T23:19:00+00:00",
        "description": "\"The entire java.applet package has been removed from JDK 26, which will release in March 2026,\" notes Inside Java. \n\nBut long-time Slashdot reader AirHog links to this blog post reminding us that\n\"Applets Are Officially Gone, But Java In The Browser Is Better Than Ever.\"\n\n\nThis brings to an official end the era of applets, which began in 1996. However, for years it has been possible to build modern, interactive web pages in Java without needing applets or plugins. TeaVM provides fast, performant, and lightweight tooling to transpile Java to run natively in the browser... \n\n\nTeaVM, at its heart, transpiles Java code into JavaScript (or, these days, WASM). However, in order for Java code to be useful for web apps, much more is required, and TeaVM delivers. It includes a minifier, to shrink the generated code and obfuscate the intent, to complicate reverse-engineering. It has a tree-shaker to eliminate unused methods and classes, keeping your app download compact. It packages your code ",
        "id": 4314232,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/13/2316245/applets-are-officially-going-but-java-in-the-browser-is-better-than-ever",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Applets Are Officially Going, But Java In the Browser Is Better Than Ever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T23:28:50.642486+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T22:17:00+00:00",
        "description": "A Utah-based startup announced last week it used AI to locate a 250-degree Fahrenheit geothermal reservoir, reports CNN. It'll start producing electricity in three to five years, the company estimates &mdash; and at least one geologist believes AI could be an exciting \"gamechanger\" for the geothermal industry.\n\n\n\n[Startup Zanskar Geothermal &amp; Minerals] named it \"Big Blind,\" because this kind of site &mdash; which has no visual indication of its existence, no hot springs or geysers above ground, and no history of geothermal exploration &mdash; is known as a \"blind\" system. It's the first industry-discovered blind site in more than three decades, said Carl Hoiland, co-founder and CEO of Zanskar. \"The idea that geothermal is tapped out has been the narrative for decades,\" but that's far from the case, he told CNN. He believes there are many more hidden sites across the Western U.S. \n\nGeothermal energy is a potential gamechanger. It offers the tantalizing prospect of a huge source of ",
        "id": 4314233,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/13/2211227/startup-successfully-uses-ai-to-find-new-geothermal-energy-reservoirs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Startup Successfully Uses AI to Find New Geothermal Energy Reservoirs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T22:15:55.220955+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T21:17:00+00:00",
        "description": "Choosing your browser \"is one of the most important digital decisions you can make, shaping how you experience the web, protect your data, and express yourself online,\" says the Firefox blog. They've urged readers to \"take a stand for independence and control in your digital life.\" \n\nBut they also recently polled 8,000 adults in France, Germany, the UK and the U.S. on \"how they navigate choice and control both online and offline\" (attending in-person events in Chicago, Berlin, LA, and Munich, San Diego, Stuttgart):\n\nThe survey, conducted by research agency YouGov, showcases a tension between people's desire to have control over their data and digital privacy, and the reality of the internet today &mdash; a reality defined by Big Tech platforms that make it difficult for people to exercise meaningful choice online: \n &mdash; Only 16% feel in control of their privacy choices (highest in Germany at 21%) \n\n &mdash; 24% feel it's \"too late\" because Big Tech already has too much control or ",
        "id": 4313944,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/13/2114221/firefox-survey-finds-only-16-feel-in-control-of-their-privacy-choices-online",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Firefox Survey Finds Only 16% Feel In Control of Their Privacy Choices Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T18:50:50.357029+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T18:34:00+00:00",
        "description": "Electrek reports:\n\nEV and battery supply chain research specialists Benchmark Mineral Intelligence reports that 2.0 million electric vehicles were sold globally in November 2025, bringing global EV sales to 18.5 million units year-to-date. That's a 21% increase compared to the same period in 2024.\n\nEurope was the clear growth leader in November, while North America continued to lag following the expiration of US EV tax credits. China, meanwhile, remains the world's largest EV market by a wide margin. Europe's EV market jumped 36% year-over-year in November 2025, with BEV sales up 35% and plug-in hybrid (PHEV) sales rising 39%. That brings Europe's total EV sales to 3.8 million units for the year so far, up 33% compared to January-November 2024... In North America, EV sales in the US did tick up month-over-month in November, following a sharp October drop after federal tax credits expired on September 30, 2025. Brands including Kia (up 30%), Hyundai (up 20%), Honda (up 11%), and Subaru",
        "id": 4312929,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/13/0041234/the-worlds-electric-car-sales-have-spiked-21-so-far-in-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The World's Electric Car Sales Have Spiked 21% So Far in 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T17:45:43.678539+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T17:34:00+00:00",
        "description": "In 1975, 23-year-old electrical engineer Steve Sasson joined Kodak. And in a new interview with the BBC, he remembers that he'd found the whole photographic process \"really annoying.... I wanted to build a camera with no moving parts. Now that was just to annoy the mechanical engineers...\"\n\n\n\n\"You take your picture, you have to wait a long time, you have to fiddle with these chemicals. Well, you know, I was raised on Star Trek, and all the good ideas come from Star Trek. So I said what if we could just do it all electronically...?\" \n\n\nResearchers at Bell Labs in the US had, in 1969, created a type of integrated circuit called a charge-coupled device (CCD). An electric charge could be stored on a metal-oxide semiconductor (MOS), and could be passed from one MOS to another. Its creators believed one of its applications might one day be used as part of an imaging device &mdash; though they hadn't worked out how that might happen. The CCD, nevertheless, was quickly developed. By 1974, the",
        "id": 4312498,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/13/0652226/how-a-23-year-old-in-1975-built-the-worlds-first-handheld-digital-camera",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How a 23-Year-Old in 1975 Built the World's First Handheld Digital Camera",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T17:45:43.769383+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T16:34:00+00:00",
        "description": "New England's last coal-fired power plant \"has ceased operations three years ahead of its planned retirement date,\" reports the New Hampshire Bulletin. \n\n\"The closure of the New Hampshire facility paves the way for its owner to press ahead with an initiative to transform the site into a clean energy complex including solar panels and battery storage systems.\"\n\n\"The end of coal is real, and it is here,\" said Catherine Corkery, chapter director for Sierra Club New Hampshire. \"We're really excited about the next chapter....\" The closure in New Hampshire &mdash; so far undisputed by the federal government &mdash; demonstrates that prolonging operations at some facilities just doesn't make economic sense for their owners. \"Coal has been incredibly challenged in the New England market for over adecade,\" said Dan Dolan, president of the New England Power Generators Association. \n\nMerrimack Station, a 438-megawatt power plant, came online in the1960s and provided baseload power to the New Eng",
        "id": 4312499,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/13/0254253/more-of-americas-coal-fired-power-plants-cease-operations",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More of America's Coal-Fired Power Plants Cease Operations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T16:29:52.955589+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T15:34:00+00:00",
        "description": "Steven J. Vaughan-Nichols files this report from Tokyo:\n\n\n\n\nAt the invitation-only Linux\nKernel Maintainers Summit here, the top Linux maintainers decided, as Jonathan Corbet, Linux kernel developer, put it, \"The consensus among the assembled developers is that Rust\nin the kernel is no longer experimental &mdash; it is now a core part\nof the kernel and is here to stay. So the 'experimental' tag\nwill be coming off.\" As Linux kernel maintainer Steven Rosted told\nme, \"There was zero pushback.\" \n\n\nThis has been a long time coming. This shift caps five years of\nsometimes-fierce debate over whether the memory-safe language belonged alongside C at the heart of the world's most widely deployed open source operating system... It all began when Alex\nGaynor and Geoffrey\nThomas at the 2019 Linux Security Summit said that about\ntwo-thirds of Linux kernel vulnerabilities come from memory safety\nissues. Rust, in theory, could avoid these by using Rust's\ninherently safer application programming inter",
        "id": 4312091,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/13/0347245/rust-in-linuxs-kernel-is-no-longer-experimental",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rust in Linux's Kernel 'is No Longer Experimental'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T10:50:23.191554+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T10:00:00+00:00",
        "description": "Longtime Slashdot reader AmiMoJo shares a report from Clean Energy Wire: Renewable energy sources covered nearly 56 percent of Germany's gross electricity consumption in 2025, according to preliminary figures by energy industry group BDEW and research institute ZSW. Despite a 'historically weak' first quarter of the year for wind power production and a significant drop in hydropower output, the share of renewables grew by 0.7 percentage points compared to the previous year thanks to an increase in installed solar power capacity.\n \nSolar power output increased by 18.7 percent over the whole year, while the strong growth in installed capacity from previous years could be sustained, with more than 17 gigawatts (GW) added to the system. With March being the least windy month in Germany since records began in 1950, wind power output, on the other hand, faced a drop of 5.2 percent compared to 2024. However, stronger winds in the second and third quarter compensated for much of the early-yea",
        "id": 4310315,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/12/239237/germany-covers-nearly-56-percent-of-2025-electricity-use-with-renewables",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Germany Covers Nearly 56 Percent of 2025 Electricity Use With Renewables",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T07:28:53.510582+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T07:00:00+00:00",
        "description": "A former Chinese official who fled to the U.S. says Beijing has used advanced surveillance technology from U.S. companies to track, intimidate, and punish him and his family across borders. ABC News reports: Retired Chinese official Li Chuanliang was recuperating from cancer on a Korean resort island when he got an urgent call: Don't return to China, a friend warned. You're now a fugitive. Days later, a stranger snapped a photo of Li in a cafe. Terrified South Korea would send him back, Li fled, flew to the U.S. on a tourist visa and applied for asylum. But even there -- in New York, in California, deep in the Texas desert -- the Chinese government continued to hunt him down with the help of surveillance technology.\n \nLi's communications were monitored, his assets seized and his movements followed in police databases. More than 40 friends and relatives -- including his pregnant daughter -- were identified and detained, even by tracking down their cab drivers through facial recognition",
        "id": 4309599,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/12/2341230/chinese-whistleblower-living-in-us-is-being-hunted-by-beijing-with-us-tech",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Whistleblower Living In US Is Being Hunted By Beijing With US Tech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T04:08:13.121322+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Dozens of Ukrainian civilians filed a series of lawsuits in Texas this week, accusing some of the biggest US chip firms of negligently failing to track chips that evaded export curbs. Those chips were ultimately used to power Russian and Iranian weapon systems, causing wrongful deaths last year. Their complaints alleged that for years, Texas Instruments (TI), AMD, and Intel have ignored public reporting, government warnings, and shareholder pressure to do more to track final destinations of chips and shut down shady distribution channels diverting chips to sanctioned actors in Russia and Iran.\n \nPutting profits over human lives, tech firms continued using \"high-risk\" channels, Ukrainian civilians' legal team alleged in a press statement, without ever strengthening controls. All that intermediaries who placed bulk online orders had to do to satisfy chip firms was check a box confirming that the shipment wouldn't be sent to sanction",
        "id": 4308976,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/12/2254245/ukrainians-sue-us-chip-firms-for-powering-russian-drones-missiles",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ukrainians Sue US Chip Firms For Powering Russian Drones, Missiles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T02:59:30.135912+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T02:20:00+00:00",
        "description": "Chandler, Arizona unanimously rejected a proposed AI data center despite heavy lobbying from Big Tech interests and former Sen. Kyrsten Sinema. Politico reports: The Chandler City Council last night voted down a request by a New York developer to rezone land to build a data center and business complex. The local battle escalated in October after Sinema showed up at a planning commission meeting to offer public comment warning officials in her home state that federal authority may soon stomp on local regulations. \"Chandler right now has the opportunity to determine how and when these new, innovative AI data centers will be built,\" she told local officials. \"When federal preemption comes, we'll no longer have that privilege.\"\n \nExplaining her no vote, Chandler Vice Mayor Christine Ellis said that she had long framed her decision about the local benefits rather than the national push to build AI. She recalled a meeting with Sinema where she asked point-blank, \"what's in it for Chandler?\"",
        "id": 4308802,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/12/234225/arizona-city-rejects-data-center-after-lobbying-push",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Arizona City Rejects Data Center After Lobbying Push",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T01:55:23.181074+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T01:40:00+00:00",
        "description": "Framework Computer raised DDR5 memory prices for its Laptop DIY Editions by 50% due to industry-wide memory shortages. Phoronix reports: Framework Computer is keeping the prior prices for existing pre-orders and also is foregoing any price changes for their pre-built laptops or the Framework Desktop. Framework Computer also lets you order DIY laptops without any memory at all if so desired for re-using existing modules or should you score a deal elsewhere.\n \nDue to their memory pricing said to be more competitive below market rates, they also adjusted their return policy to prevent scalpers from purchasing DIY Edition laptops with memory while then returning just the laptops. The DDR5 must be returned now with DIY laptop order returns. Additional details can be found via the Framework Blog.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Framework+Raises+DDR5+Memory+Prices+By+50%25+For+DIY+Laptops%3A+https%3A%2F%2Fha",
        "id": 4308521,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/12/2258200/framework-raises-ddr5-memory-prices-by-50-for-diy-laptops",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Framework Raises DDR5 Memory Prices By 50% For DIY Laptops",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T01:55:23.377393+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T01:20:00+00:00",
        "description": "id Software employees voted to form a wall-to-wall union with the CWA, covering all roles at the Doom studio. \"The vote wasn't unanimous, though a majority did vote in favor of the union,\" notes Engadget. From the report: The union will work in conjunction with the Communications Workers of America (CWA), which is the same organization involved with parent company ZeniMax's recent unionization efforts. Microsoft, who owns ZeniMax, has already recognized this new effort, according to a statement by the CWA. It agreed to a labor neutrality agreement with the CWA and ZeniMax workers last year, paving the way for this sort of thing.\n \nFrom the onset, this union will look to protect remote work for id Software employees. \"Remote work isn't a perk. It's a necessity for our health, our families, and our access needs. RTO policies should not be handed down from executives with no consideration for accessibility or our well-being,\" said id Software Lead Services Programmer Chris Hays. He also ",
        "id": 4308523,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/12/2316202/doom-studio-id-software-forms-wall-to-wall-union",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Doom Studio id Software Forms 'Wall-To-Wall' Union",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T01:55:23.612186+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T01:00:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: The U.S. government will require artificial intelligence vendors to measure political \"bias\" to sell their chatbots to federal agencies, according to a Trump administration statement (PDF) released on Thursday. The requirement will apply to all large language models bought by federal agencies, with the exception of national security systems, according to the statement.\n \nPresident Donald Trump ordered federal agencies in July to avoid buying large language models that he labeled as \"woke.\" Thursday's statement gives more detail to that directive, saying that developers should not \"intentionally encode partisan or ideological judgments\" into a chatbot's outputs. Further reading: Trump Signs Executive Order For Single National AI Regulation Framework, Limiting Power of States<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+To+Mandate+AI+Vendors+Measure+Political+Bias",
        "id": 4308525,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/12/2148210/us-to-mandate-ai-vendors-measure-political-bias-for-federal-sales",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US To Mandate AI Vendors Measure Political Bias For Federal Sales",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T00:43:19.877408+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T00:20:00+00:00",
        "description": "The pro-Russian CyberVolk group resurfaced with a Telegram-based ransomware-as-a-service platform, but fatally undermined its own operation by hardcoding master encryption keys in plaintext. The Register reports: First, the bad news: the CyberVolk 2.x (aka VolkLocker) ransomware-as-a-service operation that launched in late summer. It's run entirely through Telegram, which makes it very easy for affiliates that aren't that tech savvy to lock files and demand a ransom payment. CyberVolk's soldiers can use the platform's built-in automation to generate payloads, coordinate ransomware attacks, and manage their illicit business operations, conducting everything through Telegram.\n \nBut here's the good news: the ransomware slingers got sloppy when it came time to debug their code and hardcoded the master keys -- this same key encrypts all files on a victim's system -- into the executable files. This could allow victims to recover encrypted data without paying the extortion fee, according to ",
        "id": 4308227,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/12/2140258/russian-hackers-debut-simple-ransomware-service-but-store-keys-in-plain-text",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russian Hackers Debut Simple Ransomware Service, But Store Keys In Plain Text",
        "vote": 0
    }
]