[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T17:09:11.613641+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T16:01:28+00:00",
        "description": "Control Resonant's new trailer at TGA 2025 was as cryptic as it was revealing, a balance that often eludes even the best efforts to capture it. We know that Dylan is going to be in the spotlight this time around, a search for his sister Jesse accented by a crisis that has the FBC desperate enough to try and use The Hiss to fight it. \n\nBut the trailer said a lot of things unsaid, and we got to thinking about the things we'd want you to know about the game, and perhaps give you some food for thought about what they could mean for the sequel. While we're going to be eagerly waiting for more information over the coming months, we can safely say that Resonant is aiming to be bigger, better, and more bizarre than its predecessor.",
        "id": 4312304,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=qGU9DTiH_So",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qGU9DTiH_So/hqdefault.jpg",
        "title": "Control Resonant - 5 New Details You May Not Know",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T13:41:44.357859+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T13:30:54+00:00",
        "description": "2025 has continued to demonstrate that there is an audience among gamers for solid, single-player experience that can be enjoyed in comfort, and at one's own pace. However, some of this year's best titles had their players pushing themselves to experience more of what they offered thanks to how well-crafted they've been on a variety of fronts. \n\nFrom massive worlds filled with secrets, incredible stories, combat systems that are challenging as well as rewarding, as well as memories that can come only from the best of games, join us as we look back at the year's finest solo titles, and bestow the crown of the year's best to its rightful owner.\n\nThumbnail credit: Steam user: Shiraishi",
        "id": 4311138,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=jQsqSUSJpBE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jQsqSUSJpBE/hqdefault.jpg",
        "title": "17 Best Single Player Games of 2025 You Absolutely Need To Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-13T10:18:29.428457+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-13T10:01:15+00:00",
        "description": "I can see some criticizing the playtime of Terminator 2D's story, which makes sense if you're only doing a singular playthrough on Easy Money (the lowest difficulty) and No Problemo (the Normal difficulty, which is still pretty easy for platforming veterans). Re-experiencing the core of the storyline and the unique future scenarios could serve as your primary motivator. However, if you're not keen on actually mastering the game to one day conquer Judgment Day difficulty, then  I can see value for money being an issue.\n\nNevertheless, as a run-and-gun sidescroller that captures the essence of the classic, Terminator 2D: No Fate comes recommended. Some aspects certainly could've been better or more faithful to the film, and yet, jumping back in to achieve that perfect run still feels extremely satisfying, quirks and all.",
        "id": 4310196,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=jwFpI5nNSCM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jwFpI5nNSCM/hqdefault.jpg",
        "title": "Terminator 2D: NO FATE Review - The Final Verdict",
        "vote": 0
    }
]