[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-28T21:00:45+00:00",
        "description": "As the inaugural game of a fresh new indie studio, Eternal Strands is something of a triumph. Its controls and movement are smooth as butter, and there’s not too many bugs or glitches to complain about. It’s a polished game through and through, yet something is missing.\n\nThe Breath of the Wild/Shadow of the Colossus premise is very exciting, but Eternal Strands feels somewhat average despite the potential. The backtracking between hub and open zones and limited inventory have a part to play in this.\n\nCheck out Eternal Strands if you want a decently fun action/adventure game with some narrative emphasis, but don’t expect it to rival any of the top games in the genre.",
        "id": 1994513,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ztAn4bCYvDk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ztAn4bCYvDk/hqdefault.jpg",
        "title": "Eternal Strands Review - A Perfect Shadow of the Colossus And Zelda Combination?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-28T21:00:05+00:00",
        "description": "Enchantment Under the Sea is the third DLC release for Atomic Heart. The story picks up right where the game previously left off, and kicks things off with a bang, culminating in an epic boss fight that has you re-learn the core mechanics of the game as you take on a gigantic murderous robot. The real story starts shortly afterwards, and throws you into what is ostensibly Atomic Heart’s own take on BioShock’s Rapture.\n\nThe DLC features more linear level design that Atomic Heart has had so far, focusing on having the player making continuous progress as they explore a vast underwater facility. While excellent in terms of gameplay, complete with fun new powers to play with, the DLC also highlights a core problem with Atomic Heart’s combat, with enemy readability being quite an issue. Despite this, however, Enchantment Under the Sea is some of the best we’ve seen from Atomic Heart so far.",
        "id": 1994514,
        "language": null,
        "link": "https://www.youtube.com/watch?v=7UpCqn6DGvI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7UpCqn6DGvI/hqdefault.jpg",
        "title": "Atomic Heart: Enchantment Under The Sea DLC Review - A Must Buy For Atomic Heart Fans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-28T16:00:37+00:00",
        "description": "With a fresh gameplay trailer coming at a time when Sony’s public image is in the doldrums following the fallout behind it’s live-service failures, Phantom Blade Zero – coming from studio S-GAME – looks to be shaping up as a much-needed homerun for the Japanese giant. \n\nMelding ancient folklore with flashy, brutal combat gives Phantom Blade Zero a distinctly Soulslike appearance. However, much like last year’s Black Myth: Wukong, Phantom Blade Zero is its own thing. There’s plenty of individuality operating under the hood, from the fancy footwork of its playable hero who we see in the recent ‘Year of the Snake’ trailer dancing across a battlefield in balletic performance against a band of synchronised enemies to the game’s incorporation of classic Kung-Fu cinema influences. Whether 2025 or 2026, Phantom Blade Zero is destined to be a hit.",
        "id": 1992597,
        "language": null,
        "link": "https://www.youtube.com/watch?v=bCT3kOstlOg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bCT3kOstlOg/hqdefault.jpg",
        "title": "This PS5 Console Exclusive Game is LOOKING BONKERS...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-28T14:00:15+00:00",
        "description": "Life is Strange will always be a huge part of Don’t Nod’s legacy, and even though the developer has left the franchise in its rearview mirror now, it isn’t quite done with that style of game, obviously. Interactive adventure dramas are, after all, Don’t Nod’s heart and soul, and so, Lost Records: Bloom and Rage is on the horizon, promising another such choice driven narrative adventure from the studio. \n\nSet across two different life periods and focusing on a cast of four core characters, Lost Records: Bloom and Rage is promising mystery, drama, and intrigue aplenty, which mean fans of the studio’s past works have plenty of reason to be optimistic. With the game’s release around the corner, here, we talk about all of that and more.",
        "id": 1990134,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Kt2lIVOz6zw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Kt2lIVOz6zw/hqdefault.jpg",
        "title": "Lost Records: Bloom And Rage - 15 Things You Need To Know Before You Buy",
        "vote": 0
    }
]