[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T23:26:46+00:00",
        "description": "Ubisoft is launching a new subsidiary focused on Assassin's Creed, Far Cry, and Rainbow Six, backed by a 1.16 billion-euro investment from Tencent. \"The as-yet-unnamed subsidiary will fold in the teams working on those three series, including Ubisoft studios in Montreal, Quebec, Sherbrooke, Saguenay, Barcelona and Sofia,\" reports Engadget. From the report: This new business will receive an investment of 1.16 billion-euro (roughly $1.25 billion) from its longstanding partner Tencent, granting the conglomerate a minority ownership stake. Following the transaction, Ubisoft will narrow focus to its other franchises, such as The Division and Tom Clancy's Ghost Recon. [...] There is some extra good news in the announcement. The description of the new subsidiary does specify that \"it will drive further increases in quality of narrative solo experiences.\" So while we can expect to also see multiplayer and free-to-play offerings from the Ubisoft umbrella, they aren't giving up on single-playe",
        "id": 2426007,
        "language": null,
        "link": "https://slashdot.org/story/25/03/27/239223/ubisoft-spins-out-subsidiary-with-a-billion-dollar-investment-from-tencent?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ubisoft Spins Out Subsidiary With a Billion-Dollar Investment From Tencent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T22:22:27+00:00",
        "description": "Google is rolling out new AI-powered features across Maps, Search, and Hotels to simplify travel planning, including a screenshot-detection tool in Maps that identifies and saves locations mentioned in image text. The Verge reports: Once the new screenshot list is enabled in Maps, the Gemini-powered feature will detect places that are mentioned in text within screenshots on the device, show users the locations on the map, and allow them to review and save locations to a sharable list. The screenshot list feature will start rolling out in English this week to iOS users in the US, with Android support \"coming soon.\"\n \nAI Overviews for Google Search are also being updated to expand travel planning tools, with itinerary-building features rolling out in English to mobile and desktop devices in the US this week that can create trip ideas for \"distinct regions or entire countries.\" Users can use terms like \"create a vacation itinerary for Greece that focuses on history\" to explore reviews a",
        "id": 2425562,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/27/2052222/google-maps-can-soon-scan-your-screenshots-to-plan-your-vacation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Maps Can Soon Scan Your Screenshots To Plan Your Vacation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T22:22:27+00:00",
        "description": "An anonymous reader quotes a report from the BBC: Fashion retailer H&amp;M is to use artificial intelligence (AI) to create digital \"twins\" of 30 models. It says it will use the AI doppelgangers in some social media posts and marketing in the place of humans, if given permission by models. \"We are curious to explore how to showcase our fashion in new creative ways -- and embrace the benefits of new technology -- while staying true to our commitment to personal style,\" said its chief creative officer Jorgen Andersson in a statement.\n \nThe initiative was first reported by industry publication Business of Fashion. H&amp;M told the outlet that models would retain rights over their digital replicas and their use by the company and other brands for purposes such as marketing. Its images are likely to be initially used in social media posts, with watermarks that make their AI use clear, it added. H&amp;M also said models would be compensated for use of their digital twins in a similar way t",
        "id": 2425561,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/27/2058218/hm-to-use-digital-clones-of-models-in-ads-and-social-media?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "H&amp;M To Use Digital Clones of Models In Ads and Social Media",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T21:17:02+00:00",
        "description": "Columbia University has suspended the student who created an AI tool designed to help job candidates cheat on technical coding interviews, according to disciplinary documents seen by Business Insider. Chungin \"Roy\" Lee received a yearlong suspension for \"publishing unauthorized documents\" from a disciplinary hearing about his product, Interview Coder, not for creating the tool itself. Lee had signed a form agreeing not to disclose his disciplinary record or post hearing materials online. \n\nInterview Coder, which sells for $60 monthly, is on track to generate $2 million in annual revenue, Lee said. The university initially placed him on probation after finding him responsible for \"facilitation of academic dishonesty.\" Lee had already submitted paperwork for a leave of absence before his suspension. He told BI he plans to move to San Francisco, which \"was my plan all along.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?st",
        "id": 2425189,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/27/1958240/columbia-university-suspends-student-behind-interview-cheating-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Columbia University Suspends Student Behind Interview Cheating AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T20:13:18+00:00",
        "description": "MojoKid writes: Similar to Nvidia's recent desktop graphics launches, there are four initial GeForce RTX 50 series laptop GPUs coming to market, starting this month. At the top of the stack is the GeForce RTX 5090 laptop GPU, which is equipped with 10,496 CUDA cores and is paired to 24GB of memory. Boost clocks top out around 2,160MHz and GPU power can range from 95-150 watts, depending on the particular laptop model. GeForce RTX 50 series GPUs for both laptops and desktops feature updated shader cores with support for neural shading, in addition to 4th gen ray tracing cores and 5th gen Tensor cores with support for DLSS 4. The GeForce RTX 50 series features a native PCIe gen 5 interface, in addition to support for DisplayPort 2.1b (up to UHBR20). These GPUs are also fed by the latest high speed GDDR7 memory, which offers efficiency benefits that are pertinent to laptop designs as well. Performance-wise, NVIDIA's mobile GeForce RTX 5090 is the new king of the hill in gaming laptops, ",
        "id": 2424646,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/27/1923257/nvidias-geforce-rtx-5090-laptop-graphics-benchmarks-revealed?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia's GeForce RTX 5090 Laptop Graphics Benchmarks Revealed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T20:13:18+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: Despite Oracle denying a breach of its Oracle Cloud federated SSO login servers and the theft of account data for 6 million people, BleepingComputer has confirmed with multiple companies that associated data samples shared by the threat actor are valid. Last week, a person named 'rose87168' claimed to have breached Oracle Cloud servers and began selling the alleged authentication data and encrypted passwords of 6 million users. The threat actor also said that stolen SSO and LDAP passwords could be decrypted using the info in the stolen files and offered to share some of the data with anyone who could help recover them.\n \nThe threat actor released multiple text files consisting of a database, LDAP data, and a list of 140,621 domains for companies and government agencies that were allegedly impacted by the breach. It should be noted that some of the company domains look like tests, and there are multiple domains per company. In",
        "id": 2424647,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/27/1918205/oracle-customers-confirm-data-stolen-in-alleged-cloud-breach-is-valid?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Oracle Customers Confirm Data Stolen In Alleged Cloud Breach Is Valid",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T19:07:37+00:00",
        "description": "Microsoft plans to roll out a new Windows scheduled task in May that launches automatically to help Microsoft Office apps load faster. From a report: The company says the \"Startup Boost\" task will launch in the background on logon, with the roll-out to start in mid-May and worldwide general availability to be reached by late May 2025. On systems where it's toggled on, users will see new Office Startup Boost and Office Startup Boost Logon tasks in the Windows Task Scheduler, which will ensure that Office apps can preload \"performance enhancements.\" \n\n\"We are introducing a new Startup Boost task from the Microsoft Office installer to optimize performance and load-time of experiences within Office applications,\" Microsoft says on the Microsoft 365 message center. \"After the system performs the task, the app remains in a paused state until the app launches and the sequence resumes, or the system removes the app from memory to reclaim resources. The system can perform this task for an app",
        "id": 2424146,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/27/1727252/new-windows-scheduled-task-will-launch-office-apps-faster?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Windows Scheduled Task Will Launch Office Apps Faster",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T17:57:30+00:00",
        "description": "An anonymous reader shares a report: You can now choose WhatsApp as your iPhone's default app for calls and text messages, as noted by WABetaInfo. After updating WhatsApp to version 25.8.74, you'll see the app appear as an option in your Messaging and Calling default app settings. \n\nApple first announced that it would let iPhone users in the European Union change their default phone and messaging apps, but it later said that everyone would be able to do the same in iOS 18.2.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iPhone+Users+Can+Now+Set+WhatsApp+as+Their+Default+Calling+and+Texting+App%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F03%2F27%2F171213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F03%2F27%2F171213%2Fiphone-users-can-now-se",
        "id": 2423485,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/27/171213/iphone-users-can-now-set-whatsapp-as-their-default-calling-and-texting-app?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "iPhone Users Can Now Set WhatsApp as Their Default Calling and Texting App",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T17:57:30+00:00",
        "description": "Microsoft CEO Satya Nadella has told employees that DeepSeek's R1 AI model has set \"the new bar\" for his company's AI ambitions, citing the startup's ability to reach the top of app store rankings. \"What's most impressive about DeepSeek is that it's a great reminder of what 200 people can do when they come together with one thought and one play,\" The Verge cited Nadella as saying. \n\n\"Most importantly, not just leaving it there as a research project or an open source project, but to turn it into a product that was number one in the App Store. That's the new bar to me,\" he added. Microsoft quickly deployed DeepSeek's R1 on its Azure platform in January. The AI model gained recognition for its optimization below Nvidia's CUDA layer, enabling greater efficiency.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Satya+Nadella+Says+DeepSeek+Is+the+New+Bar+For+Microsoft's+AI+Success%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25",
        "id": 2423484,
        "language": null,
        "link": "https://slashdot.org/story/25/03/27/1714214/satya-nadella-says-deepseek-is-the-new-bar-for-microsofts-ai-success?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Satya Nadella Says DeepSeek Is the New Bar For Microsoft's AI Success",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T16:46:45+00:00",
        "description": "The Metropolitan Police has confirmed its first permanent installation of live facial recognition (LFR) cameras is coming this summer and the location will be the South London suburb of Croydon. From a report: The two cameras will be installed in the city center in an effort to combat crime and will be attached to buildings and lamp posts on North End and London Road. According to the police they will only be turned on when officers are in the area and in a position to make an arrest if a criminal is spotted. The installation follows a two-year trial in the area where police vans fitted with the camera have been patrolling the streets matching passersby to its database of suspects or criminals, leading to hundreds of arrests. The Met claims the system can alert them in seconds if a wanted wrong'un is spotted, and if the person gets the all-clear, the image of their face will be deleted.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitt",
        "id": 2422850,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/27/1556222/uks-first-permanent-facial-recognition-cameras-installed?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK's First Permanent Facial Recognition Cameras Installed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T15:41:50+00:00",
        "description": "Paul Ginsparg, a physics professor at Cornell University, created arXiv nearly 35 years ago as a digital repository where researchers could share their findings before peer review. Today, the platform hosts more than 2.6 million papers, receives 20,000 new submissions monthly, and serves 5 million active users, Wired writes in a profile of the platform. \n\n\"Just when I thought I was out, they pull me back in!\" Ginsparg quotes from The Godfather, reflecting his inability to fully hand over the platform despite numerous attempts. If arXiv stopped functioning, scientists worldwide would face immediate disruption. \"Everybody in math and physics uses it,\" says Scott Aaronson, a computer scientist at the University of Texas at Austin. \"I scan it every night.\" \n\nArXiv revolutionized academic publishing, previously dominated by for-profit giants like Elsevier and Springer, by allowing instant and free access to research. Many significant discoveries, including the \"transformers\" paper that la",
        "id": 2422138,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/27/1456239/inside-arxiv---the-most-transformative-platform-in-all-of-science?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Inside arXiv - the Most Transformative Platform in All of Science",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T15:41:50+00:00",
        "description": "Nintendo has announced plans to introduce Virtual Game Cards for its Switch console in late April, allowing users to share digital games across multiple systems, the Japanese gaming company said during its Nintendo Direct event. The new feature will enable players to virtually load and eject digital games between Nintendo Switch consoles, mimicking the flexibility of physical game cartridges. \n\nUsers can play a single digital title on up to two systems, requiring only a one-time local connection between devices. The company has also confirmed that Virtual Game Cards will be compatible with both current and next-generation hardware. The system will also feature a family sharing option, allowing users to lend digital games to family members for two-week periods before automatically returning to the owner's account.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nintendo+Unveils+Digital+Game+Sharing%3A+https%3A%2F%2Fg",
        "id": 2422137,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/27/1525215/nintendo-unveils-digital-game-sharing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nintendo Unveils Digital Game Sharing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T14:36:46+00:00",
        "description": "China's ambitious AI infrastructure push has resulted in hundreds of idle data centers with local media reporting up to 80% of newly built computing resources remaining unused. The country announced over 500 data center projects during 2023-2024, with at least 150 completed facilities now struggling to secure customers in a rapidly changing market. \n\nThe rise of DeepSeek's open-source reasoning model R1, which matches ChatGPT o1's performance at a fraction of the cost, has fundamentally altered hardware demand. Computing needs now prioritize low-latency infrastructure for real-time reasoning rather than facilities optimized for large-scale training workloads. \n\nTechnical misalignment compounds the problem, as many centers were constructed by companies with little AI expertise, MIT Technology Review reports. The facilities, often built in remote regions to capitalize on cheaper electricity and land, now face obsolescence as AI companies require proximity to tech hubs to minimize trans",
        "id": 2421510,
        "language": null,
        "link": "https://slashdot.org/story/25/03/27/149238/china-built-hundreds-of-ai-data-centers-to-catch-the-ai-boom-now-many-stand-unused?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Built Hundreds of AI Data Centers To Catch the AI Boom. Now Many Stand Unused.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T13:32:31+00:00",
        "description": "An anonymous reader quotes a report from Tom's Hardware: Qualcomm has reportedly filed secret complaints against Arm with the European Commission, the U.S. Federal Trade Commission (FTC), and the Korea Fair Trade Commission. Qualcomm argues that Arm's open licensing approach helped build a robust hardware and software ecosystem. However, this ecosystem is under threat now as Arm moves to restrict that access to benefit its chip design business, namely compute subsystems (CSS) reference designs for client and datacenter processors and custom silicon based on CSS for large-scale clients.\n \nQualcomm has presented its case to the EC, U.S. FTC, and Korea FTC behind closed doors and through formal filings, so it does not comment on the matter now. Arm rejected the accusations, stating that it is committed to innovation, competition, and upholding contract terms. The company called Qualcomm's move an attempt to shift attention from a wider commercial dispute between the two companies and us",
        "id": 2420854,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/27/0051246/qualcomm-launches-global-antitrust-campaign-against-arm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Qualcomm Launches Global Antitrust Campaign Against Arm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T12:26:09+00:00",
        "description": "The U.S. Space Force has certified United Launch Alliance's Vulcan Centaur rocket for national security missions after successful test flights and resolution of a booster nozzle issue. This certification allows ULA to join SpaceX in conducting launches under the National Security Space Launch program, with Vulcan missions expected to begin this summer. SpaceNews reports: \"Thank you to all our customer partners who have worked hand-in-hand with us throughout this comprehensive certification process. We are grateful for the collaboration and excited to reach this critical milestone in Vulcan development,\" said Tory Bruno, president and chief executive of United Launch Alliance in a ULA statement about the vehicle's certification.\n \nBruno said at the roundtable that the next launch by ULA will be of its Atlas 5, carrying a set of Project Kuiper broadband satellites for Amazon. That launch is expected as soon as next month. He said then that would be followed by the first two Vulcan nati",
        "id": 2420112,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/27/0044248/space-force-certifies-vulcan-for-national-security-launches?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Space Force Certifies Vulcan For National Security Launches",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T08:01:13+00:00",
        "description": "Scientists in China successfully transplanted a genetically modified pig liver into a brain-dead patient, where it functioned for 10 days. The liver, modified to reduce immune rejection, produced key proteins and bile, showing compatibility and offering hope for future short-term xenotransplants. The Guardian reports: The surgery, at a Chinese hospital last year, is thought to mark the first time a pig liver has been transplanted into a human. It raises the prospect of pig livers serving as a \"bridging organ\" for patients on the waiting list for a transplant or to support liver function while their own organ regenerates. [...] The latest procedure was carried out in a 50-year-old man diagnosed with brain death after a severe head injury. The patient's own liver was intact and, in a surgery that took more than 10 hours, the organ taken from a genetically modified Bama miniature pig was plumbed into his blood supply as an additional liver.\n \nThe pig had six genetic modifications aimed ",
        "id": 2419009,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/27/0030207/surgeons-transplant-genetically-modified-pig-liver-into-chinese-patient?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Surgeons Transplant Genetically Modified Pig Liver Into Chinese Patient",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T03:41:07+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: It's only been a day since ChatGPT's new AI image generator went live, and social media feeds are already flooded with AI-generated memes in the style of Studio Ghibli, the cult-favorite Japanese animation studio behind blockbuster films such as \"My Neighbor Totoro\" and \"Spirited Away.\" In the last 24 hours, we've seen AI-generated images representing Studio Ghibli versions of Elon Musk, \"The Lord of the Rings\", and President Donald Trump. OpenAI CEO Sam Altman even seems to have made his new profile picture a Studio Ghibli-style image, presumably made with GPT-4o's native image generator. Users seem to be uploading existing images and pictures into ChatGPT and asking the chatbot to re-create it in new styles.\n \nOpenAI's latest update comes on the heels of Google's release of a similar AI image feature in its Gemini Flash model, which also sparked a viral moment earlier in March when people used it to remove watermarks from images.",
        "id": 2418148,
        "language": null,
        "link": "https://slashdot.org/story/25/03/27/0023207/openais-viral-studio-ghibli-moment-highlights-ai-copyright-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI's Viral Studio Ghibli Moment Highlights AI Copyright Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T02:36:04+00:00",
        "description": "JPMorgan Chase used a quantum computer from Honeywell's Quantinuum to generate and mathematically certify truly random numbers -- an advancement that could significantly enhance encryption, security, and financial applications. The breakthrough was validated with help from U.S. national laboratories and has been published in the journal Nature. From a report: Between May 2023 and May 2024, cryptographers at JPMorgan wrote an algorithm for a quantum computer to generate random numbers, which they ran on Quantinuum's machine. The US Department of Energy's supercomputers were then used to test whether the output was truly random. \"It's a breakthrough result,\" project lead and Head of Global Technology Applied Research at JPMorgan, Marco Pistoia told Bloomberg in an interview. \"The next step will be to understand where we can apply it.\"\n \nApplications could ultimately include more energy-efficient cryptocurrency, online gambling, and any other activity hinging on complete randomness, suc",
        "id": 2417904,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/26/2334255/jpmorgan-says-quantum-experiment-generated-truly-random-numbers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "JPMorgan Says Quantum Experiment Generated Truly Random Numbers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T02:36:04+00:00",
        "description": "sciencehabit quotes a report from Science.org: Whales sing, orcas squeal, and sea turtles croak. But sharks are more the strong, silent type. Now, researchers report the first evidence that sharks make sounds, too, described today in Royal Society Open Science. The animals may be making the sounds -- a series of clicking noises -- by snapping their flat rows of teeth, which are blunt for crushing prey. The sharks can hear mostly low-frequency noise, and the clicks they emit are higher pitched, which suggests they are not for communicating with other rigs. It's possible they are a defensive tactic. Marine mammals that eat rigs, such as leopard seals, can hear in the frequency range of the rig clicks, but the researchers question whether a few clicks would deter an attack. The sounds might be part of their response to being startled, the team says.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Scientists+Record+Firs",
        "id": 2417903,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/26/2339257/scientists-record-first-sounds-ever-known-to-be-made-by-sharks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Record First Sounds Ever Known To Be Made By Sharks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T01:30:53+00:00",
        "description": "According to the Financial Times, Fidelity Investments is in advanced stages of developing its own stablecoin. Binance reports: The Boston-based financial services giant plans for the token to serve as a form of digital cash, according to the report, which cites two people close to the matter. The token would form part of company's strategy to enter the tokenized government bonds market. Stablecoins are a cryptocurrency whose value is pegged to a real-world asset such as the U.S. dollar or gold. They provide a convenient way for crypto traders to preserve their fiat value without having to cash out of the market.\n \nThe news emerges just days after Fidelity filed paperwork to register a blockchain-based version of its U.S. dollar money market fund. The company seeks to register an \"OnChain\" share class of its Treasury Digital Fund (FYHXX), which holds cash and U.S. Treasury securities and is available only to Fidelity's hedge fund and institutional clients. A Fidelity stablecoin could",
        "id": 2417638,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/26/2321223/fidelity-prepares-to-unveil-its-own-stablecoin?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Fidelity Prepares To Unveil Its Own Stablecoin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T00:23:28+00:00",
        "description": "An anonymous reader quotes a report from ZDNet, written by Steven Vaughan-Nichols: Despite the minor delay, Linux 6.14 arrives packed with cutting-edge features and improvements to power upcoming Linux distributions, such as the forthcoming Ubuntu 25.04 and Fedora 42. The big news for desktop users is the improved NTSYNC driver, especially those who like to play Windows games or run Windows programs on Linux. This driver is designed to emulate Windows NT synchronization primitives. What that feature means for you and me is that it will significantly improve the performance of Windows programs running on Wine and Steam Play. [...] Gamers always want the best possible graphics performance, so they'll also be happy to see that Linux now supports recently launched AMD RDNA 4 graphics cards. This approach includes support for the AMD Radeon RX 9070 XT and RX 9070 graphics cards. Combine this support with the recently improved open-source RADV driver and AMD gamers should see the best spee",
        "id": 2417360,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/03/26/2110211/linux-kernel-614-is-a-big-leap-forward-in-performance-windows-compatibility?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linux Kernel 6.14 Is a Big Leap Forward In Performance, Windows Compatibility",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T00:23:28+00:00",
        "description": "Fortune reports that over 4 million Gen Zers are currently not in education, employment, or training (NEET), with experts blaming a broken educational system and \"worthless degrees\" for failing to deliver on promises of career readiness. From the report: While some Gen Zers may fall into this category because they are taking care of a family member, many have become frozen out of the increasingly tough job market where white-collar jobs are becoming seemingly out of reach. In the U.S., this translates to an estimated over 4.3 million young people not in school or work. Across the pond in the U.K., the situation is also only getting worse, with the number of NEET young people rising by over 100,000 in the last year alone.\n \nA British podcaster went so far as to call the situation a \"catastrophe\" -- and cast a broad-stroke blame on the education system. \"In many cases, young people have been sent off to universities for worthless degrees which have produced nothing for them at all,\" th",
        "id": 2417361,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/26/211250/over-4-million-gen-zers-are-jobless?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Over 4 Million Gen Zers Are Jobless",
        "vote": 0
    }
]