[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T17:00:43+00:00",
        "description": "Described by developer Pollard Studio as a cinematic interactive story, Karma: The Dark World is a fun new take on the horror genre that revolves more around exploration and puzzle solving than action and stealth. The game puts players in the shoes of Roam agent Daniel McGovern who, along with figuring out the mystery he’s tasked with solving, is also trying to rediscover himself. \n\nThe core gameplay in Karma: The Dark World largely revolves around exploring confined spaces for clues as you try and solve crimes. While that alone may not sound too exciting, the game likes to occasionally kick things up a notch by throwing you inside the mind of another person, and throwing all rules out of the window as you try and figure out what’s going wrong in a surreal hellscape made up of the person’s dreams, hopes, desires, fears, regrets, and despairs.",
        "id": 2423522,
        "language": null,
        "link": "https://www.youtube.com/watch?v=VwWMocDW2tQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VwWMocDW2tQ/hqdefault.jpg",
        "title": "Karma: The Dark World Review - A Shockingly Great Mind-Bending Horror Game",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T15:00:54+00:00",
        "description": "Rise of the Ronin, Ghost of Tsushima, and the recently released Assassin’s Creed Shadows share a lot of their DNA. Each touts a period Japanese open world setting and crafts a gameplay experience holding up combat, stealth, and traversal as core pillars. \n\nPrior to Shadows’ release, we pit the three games against each other in a feature discussing the lessons Shadows could take from the other two titles, and now we’re back to talk about which of the three comes out as the best one. Here, we are comparing Assassin’s Creed Shadows, Ghost of Tsushima, and Rise of the Ronin across multiple categories before crowning a winner.",
        "id": 2422188,
        "language": null,
        "link": "https://www.youtube.com/watch?v=_ZIzoA3CceQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_ZIzoA3CceQ/hqdefault.jpg",
        "title": "Assassin's Creed Shadows vs. Ghost of Tsushima vs. Rise of the Ronin - Which Game Comes Out On Top?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-27T09:30:31+00:00",
        "description": "Its safe to say that FromSoftware has found a lot of success with its Souls games, and Elden Ring’s commercial success has plunged the genre from a niche one to a household name in gaming. \n\nDifferent fans have differing opinions about the many games in this genre, but most would agree that 2015’s Bloodborne is one of the best games from the developer. But why do fans exactly hold a decade old game in such high regard? What is it that Bloodborne does that hasn’t been replicated since?\n\nWhy is it that fans continue to yearn for a remake, remaster or a sequel to this gem even after so long? With this video, we try to answer exactly that as we take a look back at Bloodborne 10 years since its release.",
        "id": 2420181,
        "language": null,
        "link": "https://www.youtube.com/watch?v=tcp-jMev5Zk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tcp-jMev5Zk/hqdefault.jpg",
        "title": "10 Years Later, There Is NOTHING Like Bloodborne Out There",
        "vote": 0
    }
]