[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T23:05:10.913455+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T22:25:00+00:00",
        "description": "JetBrains released its annual State of the Developer Ecosystem survey in late October, drawing more than twenty-four thousand responses from programmers worldwide. The survey declared that PHP and Ruby are in \"long term decline\" based on usage trends tracked over five years. Shortly after publication, JetBrains posted a separate statement asserting that \"PHP remains a stable, professional, and evolving ecosystem.\" The company offered no explanation for the apparent contradiction, The Register reports. \n\nThe survey's methodology involves weighting responses to account for bias toward JetBrains users and regional distribution factors. The company acknowledges some bias likely remains since its own customers are more inclined to respond. The survey also found that 85% of developers now use AI coding tools.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=JetBrains+Survey+Declares+PHP+Declining%2C+Then+Says+It+Isn't%3A+ht",
        "id": 3870334,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/21/2132259/jetbrains-survey-declares-php-declining-then-says-it-isnt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "JetBrains Survey Declares PHP Declining, Then Says It Isn't",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T21:50:52.999998+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T21:45:00+00:00",
        "description": "TikTok changed its policies earlier this year on sharing user data with governments as the company negotiated with the Trump Administration to continue operating in the United States. The company added language allowing data sharing with \"regulatory authorities, where relevant\" beyond law enforcement. Until April 25, 2025, TikTok's website stated the company would notify users before disclosing their data to law enforcement. The policy now says TikTok will inform users only where required by law and changed the timing from before disclosure to if disclosure occurs. The company also softened its language from stating it \"rejects data requests from law enforcement authorities\" to saying it \"may reject\" such requests. TikTok declined to answer repeated questions from Forbes about whether it has shared or is sharing private user information with the Department of Homeland Security or Immigration and Customs Enforcement. The timing difference prevents users from challenging subpoenas befor",
        "id": 3869755,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/21/2125252/tiktoks-new-policies-remove-promise-to-notify-users-before-government-data-disclosure",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "TikTok's New Policies Remove Promise To Notify Users Before Government Data Disclosure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T21:50:53.075281+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T21:05:00+00:00",
        "description": "Apple's effort to reinvent the iPad by adding a giant foldable screen has hit development hurdles, potentially delaying the planned launch. Bloomberg: The company has been working on the device -- projected to cost around $3,000 -- for several years and had most recently aimed for a 2028 release. But engineering challenges tied to weight, features and display technology have pushed its potential debut to 2029 or later, according to people familiar with the matter. \n\nApple is working with Samsung Display Co. to develop the roughly 18-inch panel for the device, said the people, who asked not to be identified because the work isn't public. The screen minimizes the crease seen on foldable displays, matching an approach that Apple is also using with its upcoming foldable iPhone. The iPad project is part of a broader push to bring more innovative devices to market. Apple just introduced its first new iPhone design in years -- the ultrathin $999 Air model -- and is working on everything from",
        "id": 3869756,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/21/2047227/apples-planned-foldable-ipad-with-18-inch-screen-hits-development-snags",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's Planned Foldable iPad With 18-inch Screen Hits Development Snags",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T20:36:15.717618+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T20:25:00+00:00",
        "description": "\"Plasma is a popular desktop (and mobile) environment for GNU/Linux and other UNIX-like operating systems,\" writes longtime Slashdot reader jrepin. \"Among other things, it also powers the desktop mode of the Steam Deck gaming handheld. The KDE community today announced the latest release: Plasma 6.5.\" From the announcement: This fresh new release is all about fine-tuning, fresh features, and a making everything smooth and sleek for everyone. The new version brings automatic light-to-dark theme switching based on the time of day. You can configure which global themes it switches between. You can also configure whether you want the wallpaper to switch between its light and dark versions based on the color scheme, the time of day, or be always light or dark.\n \nNext up is a \"Pinned clipboard items\" feature, which lets you save text you use regularly into the clipboard. Breeze-themed windows will now have the same level of roundness in all four corners, even the bottom one. Flatpak Permiss",
        "id": 3869154,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/21/1948244/kde-plasma-65-released",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "KDE Plasma 6.5 Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T20:36:15.799334+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T19:45:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Monday afternoon, Amazon confirmed that an outage affecting Amazon Web Services' cloud hosting, which had impacted millions across the Internet, had been resolved. Considered the worst outage since last year's CrowdStrike chaos, Amazon's outage caused \"global turmoil,\" Reuters reported. AWS is the world's largest cloud provider and, therefore, the \"backbone of much of the Internet,\" ZDNet noted. Ultimately, more than 28 AWS services were disrupted, causing perhaps billions in damages, one analyst estimated for CNN.\n \n[...] Amazon's problems originated at a US site that is its \"oldest and largest for web services\" and often \"the default region for many AWS services,\" Reuters noted. The same site has experienced two outages before in 2020 and 2021, but while the tech giant had confirmed that those prior issues had been \"fully mitigated,\" apparently the fixes did not ensure stability into 2025. ZDNet noted that Amazon's first sign",
        "id": 3869155,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/21/1942240/amazons-dns-problem-knocked-out-half-the-web-likely-costing-billions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's DNS Problem Knocked Out Half the Web, Likely Costing Billions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T18:41:38.308906+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T18:05:00+00:00",
        "description": "France and Spain are calling on the European Union to stick with plans to ban combustion engine cars in the bloc after 2035, at odds with German Chancellor Friedrich Merz ahead of a meeting of leaders in Brussels this week. From a report: The European Commission, the bloc's executive branch, is currently reviewing rules designed to accelerate the automotive sector's green transition. Merz has called on the bloc to give up its 2035 deadline to help Germany's troubled car industry. \n\nFrance and Spain \"hope that the upcoming review will preserve the 2035 cap and the environmental ambition of the CO2 emissions trajectory that underpins it,\" a paper presented to climate ministers in Luxembourg on Tuesday, and seen by Bloomberg says. \"This revision should in no way call into question the zero emissions exhaust target in 2035.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=France+and+Spain+Call+on+EU+To+Uphold+2035+Combus",
        "id": 3868370,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/21/1759230/france-and-spain-call-on-eu-to-uphold-2035-combustion-engine-ban",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "France and Spain Call on EU To Uphold 2035 Combustion Engine Ban",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T18:41:38.488961+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T17:25:00+00:00",
        "description": "OpenAI released ChatGPT Atlas on Tuesday, an AI-powered web browser that CEO Sam Altman described as \"smooth\" and \"quick\" during a livestream announcement. The browser is available globally on macOS while versions for Windows, iOS, and Android are expected soon. Atlas includes memory features that personalize the browsing experience and an agent mode that allows ChatGPT to perform tasks such as booking reservations and flights or editing documents. \n\nUsers can manage these stored memories through the browser's settings and can open incognito windows. The browser displays a split-screen view by default when users click links from search results. The view shows both the webpage and the ChatGPT transcript simultaneously. Atlas also offers webpage summarization and a feature called \"cursor chat\" that allows users to select text and have ChatGPT revise it inline.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Debu",
        "id": 3868371,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/21/1725235/openai-debuts-ai-powered-browser-with-memory-and-agent-features",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Debuts AI-Powered Browser With Memory and Agent Features",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T17:11:24.641184+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T16:45:00+00:00",
        "description": "Apple lashed out at the European Union's attempts to tame the power of Silicon Valley in the most far-reaching legal challenge of the bloc's Big Tech antitrust rules. From a report: The iPhone maker's lawyer Daniel Beard told the General Court in Luxembourg on Tuesday that the Digital Markets Act \"imposes hugely onerous and intrusive burdens\" at odds with Apple's rights in the EU marketplace. \n\nThe DMA came onto the EU's books in 2023 and is designed to clip the wings of the world's largest technology platforms with a slew of dos and don'ts. But over recent months, the law has also drawn the ire of US President Donald Trump and plagued EU-US trade talks. Apple -- seen as the biggest renegade against the EU's crackdown -- challenged the law on three fronts: EU obligations to make rival hardware work with its iPhone, the regulator's decision to drag the hugely profitable App Store under the rules, and a decision to probe whether iMessage should have faced the rules, which it later escap",
        "id": 3867418,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/21/1634248/apple-attacks-eu-crackdown-in-digital-laws-biggest-court-test",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Attacks EU Crackdown in Digital Law's Biggest Court Test",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T17:11:24.772085+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T16:02:00+00:00",
        "description": "London police finally understand why 80,000 phones disappeared from the city's streets last year. The answer involves budget cuts [non-paywalled source] that hollowed out British policing in the 2010s, the arrival of electric bikes that made theft easy, and a lucrative black market in China where stolen British phones retain full functionality. The Metropolitan Police discovered an industrial-scale operation in December when officers traced a woman's iPhone to a Heathrow warehouse on Christmas Eve. Boxes labeled as batteries and bound for Hong Kong contained almost 1,000 stolen iPhones. The police arrested two men in their thirties in September as suspected ringleaders of a group that sent up to 40,000 stolen phones to China. \n\nThe epidemic took root after Conservative-led austerity measures reduced police numbers and budgets. In 2017 the Metropolitan Police announced it would stop investigating low-level crimes to focus resources on serious violence and sexual offenses. Thieves on re",
        "id": 3867419,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/21/1557254/london-became-a-global-hub-for-phone-theft-now-we-know-why",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "London Became a Global Hub for Phone Theft. Now We Know Why.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T15:42:01.743430+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T15:24:00+00:00",
        "description": "President Trump's $100,000 H-1B visa fee will apply only to new visa applicants outside the country, the government confirmed in new guidance on Monday. From a report: That means that under the new policy, employers won't need to pay the fee for anyone already living in the U.S., such as international students. The new guidance: Under the new guidance published on Monday, U.S. Citizenship and Immigration Services said the $100,000 fee will apply only to new applicants living outside the country. Employers will need to pay the fee after their prospective employee's visa is approved, allowing them to move to the U.S. \n\nPreviously, the White House had said the fee would apply to all new visa applicants, except those who work for companies or industries that have secured a special waiver. In 2024, roughly 54% of the 141,000 new H-1B visas issued went to immigrants who were already in the U.S. on a different visa type, according to government statistics. If that trend holds, the new fee wo",
        "id": 3866603,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/21/1524225/us-narrows-who-pays-100000-h-1b-visa-fee",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Narrows Who Pays $100,000 H-1B Visa Fee",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T15:42:01.937585+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T14:40:00+00:00",
        "description": "Filipino workers in Manila are remotely operating robots that restock convenience store shelves across Tokyo. The partnership represents a new economic model where physical labor can be offshored through telepresence. Around 60 workers at Astro Robotics monitor the machines and intervene when problems occur about 4% of the time. They earn between $250 and $315 per month. Japan faces severe labor shortages but has resisted expanding immigration. Offshoring the work through robots solves this while dramatically reducing costs. \n\nFilipino workers are also training the AI systems designed to eliminate the need for human operators entirely. Tokyo-based Telexistence has collected extensive data from its workers and is providing it to a San Francisco startup building fully autonomous robots. The combination of automation and offshoring creates what one University of Michigan professor called a \"double whammy\" for workers in developed nations. It also exploits workers in developing countries ",
        "id": 3866604,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/21/1328234/japanese-convenience-stores-are-hiring-robots-run-by-workers-in-the-philippines",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japanese Convenience Stores Are Hiring Robots Run By Workers in the Philippines",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T14:20:11.107567+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T14:00:00+00:00",
        "description": "Amazon executives believe the company can avoid hiring more than 160,000 workers in the United States by 2027 through robotic automation. Internal documents viewed by The New York Times show the automation would save approximately 30 cents on each item the company picks, packs and delivers. The documents reveal that executives told Amazon's board last year they hoped automation would allow the company to flatten its U.S. workforce growth over the next decade. \n\nAmazon expects to sell twice as many products by 2033. That projection translates to more than 600,000 positions Amazon would not need to fill. Amazon opened its most advanced warehouse in Shreveport, Louisiana last year as a template for future facilities. The site uses a thousand robots and employed a quarter fewer workers than it would have without automation. The company plans to replicate this design in approximately 40 facilities by the end of 2027. A facility in Stone Mountain, Georgia currently employs roughly 4,000 wor",
        "id": 3865859,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/21/1316207/amazon-plans-to-avoid-hiring-600000-workers-through-automation-by-2033-leaked-documents-show",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Plans To Avoid Hiring 600,000 Workers Through Automation by 2033, Leaked Documents Show",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T14:20:11.323724+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: Lloyds Banking Group claims employees save 46 minutes daily using Microsoft 365 Copilot, based on a survey of 1,000 users among nearly 30,000 deployed licenses. According to Lloyds Banking Group (LBG), the rollout is \"helping teams summarize documents, prepare for meetings, and reduce administrative tasks.\" Almost 5,000 engineers are also using GitHub Copilot. Vic Weigler, chief technology officer at the finance corp, said in a statement: \"We converted 11,000 lines of code across 83 files in half the expected time.\"\n \nAn insider at the bank, a self-professed fan of the technology, listed some of the ways it was being used in their business area. These ranged from the mundane -- drafting and summarizing emails, transcribing meetings, and comparing documents to group standards -- to the eyebrow-raising, such as drafting legal clauses, undertaking due diligence, and creating complex Excel formulas. They told us the next step is creat",
        "id": 3865860,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/20/223252/lloyds-banking-group-claims-microsoft-copilot-saves-staff-46-minutes-a-day",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lloyds Banking Group Claims Microsoft Copilot Saves Staff 46 Minutes a Day",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T11:29:18.758044+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T10:00:00+00:00",
        "description": "Alibaba Cloud claims its new Aegaeon GPU pooling system cuts Nvidia GPU use by 82%, letting 213 H20 accelerators handle workloads that previously required 1,192. The advancements have been detailed in a paper (PDF) at the 2025 ACM Symposium on Operating Systems (SOSP) in Seoul. Tom's Hardware reports: Unlike training-time breakthroughs that chase model quality or speed, Aegaeon is an inference-time scheduler designed to maximize GPU utilization across many models with bursty or unpredictable demand. Instead of pinning one accelerator to one model, Aegaeon virtualizes GPU access at the token level, allowing it to schedule tiny slices of work across a shared pool. This means one H20 could serve several different models simultaneously, with system-wide \"goodput\" -- a measure of effective output -- rising by as much as nine times compared to older serverless systems.\n \nThe system was tested in production over several months, according to the paper, which lists authors from both Peking Uni",
        "id": 3864511,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/21/005243/alibaba-cloud-says-it-cut-nvidia-ai-gpu-use-by-82-with-new-pooling-system",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Alibaba Cloud Says It Cut Nvidia AI GPU Use By 82% With New Pooling System",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T07:23:10.448187+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T07:00:00+00:00",
        "description": "SpaceX surpassed the 10,000-satellite milestone for its Starlink constellation after two Falcon 9 launches on Oct. 19 added 56 more satellites to orbit. The company now operates about two-thirds of all active satellites worldwide and continues to break reuse records. Space.com reports: A Falcon 9 rocket carrying 28 Starlink internet satellites lifted off from California's Vandenberg Space Force Base today at 3:24 p.m. EDT (1924 GMT; 12:24 p.m. local California time). Those 28 included the 10,000th Starlink spacecraft ever to reach orbit, which a SpaceX employee noted on the company's launch webcast: \"From Tintin to 10,000! Go Starlink, go Falcon, go SpaceX!\"\n \nIt was also the 132nd Falcon 9 liftoff of the year, equaling the mark set by the rocket last year -- and there are still nearly 2.5 months to go in 2025. [...] This launch was the second of the day for SpaceX; less than two hours earlier, another Falcon 9 sent 28 more Starlink satellites up from Florida's Space Coast. That earli",
        "id": 3863181,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/21/000208/spacex-launches-10000th-starlink-satellite",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SpaceX Launches 10,000th Starlink Satellite",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T04:36:51.751828+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: The National Transportation Safety Board confirmed Sunday that it is investigating an airliner that was struck by an object in its windscreen, mid-flight, over Utah. \"NTSB gathering radar, weather, flight recorder data,\" the federal agency said on the social media site X. \"Windscreen being sent to NTSB laboratories for examination.\" The strike occurred Thursday, during a United Airlines flight from Denver to Los Angeles. Images shared on social media showed that one of the two large windows at the front of a 737 MAX aircraft was significantly cracked. Related images also reveal a pilot's arm that has been cut multiple times by what appear to be small shards of glass.\n \nThe captain of the flight reportedly described the object that hit the plane as \"space debris.\" This has not been confirmed, however. After the impact, the aircraft safely landed at Salt Lake City International Airport after being diverted. Images of the strike showed that",
        "id": 3862498,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/21/0015212/mystery-object-from-space-strikes-united-airlines-flight-over-utah",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mystery Object From 'Space' Strikes United Airlines Flight Over Utah",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T01:54:29.506058+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T01:25:00+00:00",
        "description": "Investigators recovered the OceanGate Titan sub's underwater camera nearly intact, discovering a SanDisk SD card that survived the 2023 implosion and still contained 12 images and 9 videos. TechSpot reports: Scott Manley, the science communication YouTuber, gamer, astrophysicist, and programmer, posted about the latest find: a hardened SubC-branded Rayfin Mk2 Benthic Camera containing the undamaged SD card. The titanium and synthetic sapphire crystal camera is rated to withstand depths of up to 6,000 meters (19,685 feet) -- the Titan imploded at around 3,300 meters (10,827 feet). The casing is intact, though the lens is shattered and the PCBs are slightly damaged.\n \nIncredibly the SD card inside the camera was undamaged. Tom's Hardware reports that it's almost certainly a SanDisk Extreme Pro 512GB, which costs around $62 on Amazon. The camera's SD card was found to be fully encrypted, divided into a small partition for operating system updates and a larger one for user data. Due to im",
        "id": 3861906,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/20/2155249/62-sandisk-memory-card-found-intact-at-titan-wreck-site",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "$62 SanDisk Memory Card Found Intact At Titan Wreck Site",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T01:54:29.578694+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T00:45:00+00:00",
        "description": "Foreign hackers breached the National Nuclear Security Administration's Kansas City National Security Campus (KCNSC) by exploiting unpatched Microsoft SharePoint vulnerabilities. The intrusion happened in August and is possibly linked to either Chinese state actors or Russian cybercriminals. CSO Online notes that \"roughly 80% of the non-nuclear parts in the nation's nuclear stockpile originate from KCNSC,\" making it \"one of the most sensitive facilities in the federal weapons complex.\" From the report: The breach targeted a plant that produces the vast majority of critical non-nuclear components for US nuclear weapons under the NNSA, a semi-autonomous agency within the Department of Energy (DOE) that oversees the design, production, and maintenance of the nation's nuclear weapons. Honeywell Federal Manufacturing &amp; Technologies (FM&amp;T) manages the Kansas City campus under contract to the NNSA. [...] The attackers exploited two recently disclosed Microsoft SharePoint vulnerabilit",
        "id": 3861907,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/20/2139236/foreign-hackers-breached-a-us-nuclear-weapons-plant-via-sharepoint-flaws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Foreign Hackers Breached a US Nuclear Weapons Plant Via SharePoint Flaws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-21T00:32:46.973890+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-21T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from MacRumors: With the fourth betas of iOS 26.1, iPadOS 26.1, and macOS 26.1, Apple has introduced a new setting that's designed to allow users to customize the look of Liquid Glass. The toggle lets users select from a clear look for Liquid Glass, or a tinted look. Clear is the current Liquid Glass design, which is more transparent and shows the background underneath buttons, bars, and menus, while tinted increases the opacity of Liquid Glass and adds more contrast.\n \nApple says that the new toggle was added because during the beta testing period over the summer, user feedback suggested that some people would prefer to have a more opaque option for Liquid Glass. The added setting provides additional customization in iOS 26.1, iPadOS 26.1, and macOS Tahoe 26.1. Increasing opacity and adding contrast applies to Liquid Glass throughout the operating system, including in apps and Lock Screen notifications.<p><div class=\"share_submission\" style=\"positi",
        "id": 3861489,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/20/2113254/ios-261-beta-4-lets-users-control-liquid-glass-transparency-with-new-toggle",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "iOS 26.1 Beta 4 Lets Users Control Liquid Glass Transparency With New Toggle",
        "vote": 0
    }
]