[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T16:48:02.973790+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T16:01:38+00:00",
        "description": "We're witnessing what's essentially a multiplayer shooter party right now, that too in this age of live service disdain – and it feels great. Then there's Black Ops 7 in the corner, counting the minutes before it can clock out until next year. For all of Activision's pantomiming about the marketing and how it's like dropping a Beyonce album, it's incredible to witness what should be a multi-billion dollar franchise, which will still go on to make billions, don't get me wrong – appear just...tired.\n\nARC Raiders and Battlefield 6 are stealing the show, drawing in those who wouldn't usually indulge in either brand of multiplayer shooter action. But that Call of Duty, one of the biggest IPs in the world, just let them while continuing to rot in its own little bubble is as surreal as it is unsurprising. After all those years of controversies, backlashes, resurgences and bafflements, who would have thought that this year's entry would be so utterly passé?",
        "id": 4011086,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=z4dxKoPFU08",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z4dxKoPFU08/hqdefault.jpg",
        "title": "ARC Raiders And Battlefield 6 Are Sucking The Oxygen Away From Black Ops 7",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T14:32:56.792078+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T13:30:43+00:00",
        "description": "It's hard to believe that a year has already flown by since the PS5 Pro came around to dominate the conversation about powerful gaming consoles. Sony's exciting list of improvements to its current-gen juggernaut might not have had the most enthusiastic reception from the gaming world, but PlayStation purists will surely swear by the improvements the Pro brings to their gaming experience. \n\nIt's quite a capable machine, but has it managed to gain enough traction among its potential players? We take a look at a console that's had a tricky year, but seems poised to leave its problems behind and usher in a new bunch of games that push it even further and perhaps uncover its limits ahead of the next PlayStation.",
        "id": 4009938,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=dxOc-YGpEeM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dxOc-YGpEeM/hqdefault.jpg",
        "title": "PS5 Pro One Year Later - Should You Buy One Now?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T10:08:13.201189+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T09:45:07+00:00",
        "description": "Rockstar has announced that GTA 6 release date has been shifted to November 19 of 2026. The company has apologized for the “additional time to what we realize has been a long wait,” and that they remain “incredibly excited for players to experience the sprawling state of Leonida and a return to modern-day Vice City.”\n\nHowever, things are getting out of hand with no guarantees that the game will not see another delay. On one hand, it's great that Rockstar is taking their time with it, but on the other, there may be a few reasons why the game is missing its original shipping date.\n\nRegardless, we ask the question: What is even going on with GTA 6?",
        "id": 4007971,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=vB0qu8gXwdE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vB0qu8gXwdE/hqdefault.jpg",
        "title": "GTA 6 Has Been DELAYED AGAIN - SERIOUSLY… What Is Going On?",
        "vote": 0
    }
]