[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T23:55:30.334707+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T23:40:00+00:00",
        "description": "Texas is suing Roblox, alleging the company misled parents about safety, ignored online-protection laws, and allowed an environment where predators could target children. Texas AG Ken Paxton said the online game platform is \"putting pixel pedophiles and profits over the safety of Texas children,\" alleging that it is \"flagrantly ignoring state and federal online safety laws while deceiving parents about the dangers of its platform.\" The Verge reports: The lawsuit's examples focus on instances of children who have been abused by predators they met via Roblox, and the activities of groups like 764 which have used online platforms to identify and blackmail victims into sexually explicit acts or self harm. According to the suit, Roblox's parental controls push only began after a number of lawsuits, and a report released last fall by the short seller Hindenburg that said its \"in-game research revealed an X-rated pedophile hellscape, exposing children to grooming, pornography, violent conten",
        "id": 4014399,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/07/232253/texas-sues-roblox-for-allegedly-failing-to-protect-children-on-its-platform",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Texas Sues Roblox For Allegedly Failing To Protect Children On Its Platform",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T23:55:30.477606+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T23:02:00+00:00",
        "description": "Gemini is (finally) rolling out on Android Auto, replacing Google Assistant while keeping \"Hey Google,\" adding Gemini Live (\"let's talk live\"), message auto-translation, and new privacy toggles. \"One feature lost between Assistant and Gemini, though, is the ability to use nicknames for contacts,\" notes 9to5Google. From the report: Over the past 24 hours, Google has quietly started the rollout of Gemini for Android Auto, seemingly starting with beta users. The change is server-side, with multiple users reporting that Gemini has gone live in the car. One user mentions that they noticed this on Android Auto 15.6, and we're seeing the same on our Pixel 10 Pro XL connected to different car displays, and also on a Galaxy Z Fold 7 running Android Auto 15.7.\n \nIt's unclear if this particular version is what delivers support, but that seems unlikely seeing as this very started rolling out last week. Android Auto 15.6 and 15.7 are currently only available in beta, so it's also unclear at this t",
        "id": 4014400,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/07/2256226/gemini-starts-rolling-out-on-android-auto",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gemini Starts Rolling Out On Android Auto",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T22:54:35.864243+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T22:25:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: Denmark's government on Friday announced an agreement to ban access to social media for anyone under 15, ratcheting up pressure on Big Tech platforms as concerns grow that kids are getting too swept up in a digitized world of harmful content and commercial interests. The move would give some parents -- after a specific assessment -- the right to let their children access social media from age 13.\n \nIt wasn't immediately clear how such a ban would be enforced: Many tech platforms already restrict pre-teens from signing up. Officials and experts say such restrictions don't always work. Such a measure would be among the most sweeping steps yet by a European Union government to limit use of social media among teens and younger children, which has drawn concerns in many parts of an increasingly online world. \"We've given the tech giants so many chances to stand up and to do something about what is happening on their platforms. ",
        "id": 4014124,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/07/2223206/denmarks-government-aims-to-ban-access-to-social-media-for-children-under-15",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark's Government Aims To Ban Access To Social Media For Children Under 15",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T21:53:55.552754+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T21:22:00+00:00",
        "description": "An anonymous reader shares a report: A group of states is seeking to extend a World Trade Organization agreement to refrain from placing customs duties on digital transmissions, a World Trade Organization document showed on Thursday. The proposal submitted by Barbados on behalf of a group of African, Caribbean and Pacific states proposed to extend the current moratorium -- a key pillar of internet development for decades -- beyond March 2026, when it was set to expire.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=States+Seek+Extension+of+Ecommerce+Tariff+Moratorium+at+WTO%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F07%2F1912220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F07%2F1912220%2Fstates-seek-extension-of-ecommerce-tariff-morator",
        "id": 4013694,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/07/1912220/states-seek-extension-of-ecommerce-tariff-moratorium-at-wto",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "States Seek Extension of Ecommerce Tariff Moratorium at WTO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T20:52:39.793741+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T20:44:00+00:00",
        "description": "An anonymous reader shares a report: Nintendo has always been a company willing to try just about anything. Cardboard cutout toys that mesh with games? Done. A console called the Wii with a remote-shaped controller? Massive success. Legendary game designer and Nintendo executive Shigeru Miyamoto offered more insight into how the company operates in a recent financial briefing. \"Nintendo has always worked with the idea that there are no limits to our efforts,\" he said. \"For example, when we tried our hand at movies with The Super Mario Bros. Movie, its success was compared to the box office revenues of other movies. However, even if the movie topped the rankings, we would think there was more room for growth.\" \n\nNintendo has been expanding its efforts in Hollywood after The Super Mario Bros. Movie became one of the best-selling films of 2023. The Legend of Zelda movie is now in production, and the Super Mario Galaxy movie is expected sometime in 2026. Miyamoto believes that some Ninten",
        "id": 4013249,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/07/1915245/nintendo-wont-shy-away-from-continuing-to-try-anything",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nintendo Won't Shy Away From Continuing To 'Try Anything'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T20:52:40.022258+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T20:00:00+00:00",
        "description": "NextGov: The IRS has notified states that offered the free, government tax filing service known as Direct File in 2025 that the program won't be available next filing season. In an email sent from the IRS to 25 states, the tax agency thanked them for collaborating and noted that \"no launch date has been set for the future.\" \n\n\"IRS Direct File will not be available in Filing Season 2026,\" says the Monday email, obtained by Nextgov/FCW and confirmed by multiple sources. It follows reports that the program was ending and Trump's former tax chief, Billy Long, remarking over the summer that the service was \"gone.\" \n\nThe program, which debuted in 2024, was a big shift from the decades-long IRS policy of not competing with the tax prep industry in offering its own free, online tax filing service for Americans. Many Republicans had opposed Direct File, and tax prep companies also lobbied against it.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://t",
        "id": 4013250,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/07/1934227/direct-file-wont-happen-in-2026-irs-tells-states",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Direct File Won't Happen in 2026, IRS Tells States",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T19:49:19.163735+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T19:25:00+00:00",
        "description": "Web-based video games are experiencing an unexpected revival as the broader $189 billion industry stagnates. Sales for browser-based titles like GeoGuessr and chess were expected to triple from 2021 to 2028, reaching $3.09 billion, according to Google and Kantar. Playgama hosted more than 15,000 new web games in the first half of 2025, exceeding the combined total from 2021 through 2023. \n\nWebsites provide fast and easy access without console boot-ups or app downloads. Game creators sidestep the 30% revenue cuts imposed by Steam and Apple. Poki has doubled its employee count to 70 since 2020 and now serves 100 million monthly active users. A top-ten developer on the platform earns about $1 million in yearly revenue, up from $50,000 in 2020. Consoles cost more than $450, and smartphone gamers are downloading fewer apps. Electronic Arts founder Trip Hawkins predicted web games will be \"one of the next waves.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop",
        "id": 4012720,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/07/194204/video-games-hottest-new-platform-is-an-old-one",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Video Games' Hottest New Platform is an Old One",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T19:49:19.530087+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T18:45:00+00:00",
        "description": "An anonymous reader shares a report: On the new MacOS 26 (Tahoe), Apple has mandated that all application icons fit into their prescribed squircle. No longer can icons have distinct shapes, nor even any fun frame-breaking accessories. Should an icon be so foolish as to try to have a bit of personality, it will find itself stuffed into a dingy gray icon jail. \n\n[...] While Apple had previously urged developers to use squircle icons on our apps, they've now taken things much further to ensure compliance. It's a shame. Apple updated their own app icons on Tahoe, for both the squircle shape as well as the new \"Liquid Glass\" interface. Mostly, these icons seem dumbed-down, with a loss of detail.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=macOS+Tahoe's+Terrible+Icons%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F11%2F07%2F1753228%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/tw",
        "id": 4012721,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/07/1753228/macos-tahoes-terrible-icons",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "macOS Tahoe's Terrible Icons",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T18:43:42.938176+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T18:05:00+00:00",
        "description": "Last year Brazil saw its biggest drop in emissions since 2009, new data show. The decline comes in the wake of a crackdown on deforestation. From a report: Since returning to power in 2022, President Luiz Inacio Lula da Silva has moved to stem illicit clearing of forest by miners, loggers, and farmers, stepping up enforcement that had been weakened under his predecessor, far-right president Jair Bolsonaro. Deforestation of the Brazilian Amazon is now at its lowest level in more than a decade. \n\nIn Brazil, forests are largely destroyed to create new cropland and pasture, and together, the loss of forest and raising of cattle are its biggest sources of emissions. Lula's crackdown on illegal deforesters has put those emissions in check. According to the Climate Observatory, a green group, Brazilian emissions fell by 16.7 percent last year. \"The new data shows the impact of the federal government retaking control over deforestation after a deliberate lack of control between 2019 and 2022,",
        "id": 4012168,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/07/1747253/as-brazil-cracks-down-on-forest-clearing-emissions-fall",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "As Brazil Cracks Down on Forest Clearing, Emissions Fall",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T17:36:11.689218+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T17:21:00+00:00",
        "description": "U.S. corporate profits have risen to record levels this year as companies eliminated nearly 1 million jobs. Chen Zhao of Alpine Macro calls the disconnect a \"jobless boom.\" Companies typically cut workers when profits decline. Amazon laid off 30,000 employees despite strong earnings. Zhao attributes the pattern to AI adoption boosting productivity across industries while reducing demand for workers. Labor demand has fallen to zero growth or mild contraction. \n\nThe Federal Reserve lowered interest rates in September and October after Jerome Powell noted concerns about layoff announcements from large employers. The Department of Labor suspended monthly employment reports when the government shutdown began October 1. ADP reported private employers added 42,000 workers in October. The unemployment rate stood at 4.3% in August. The rate has remained stable because the labor pool is contracting due to baby boomer retirements and reduced immigration under Trump administration policies. Art P",
        "id": 4011601,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/07/1725230/corporate-profits-surge-as-companies-cut-nearly-1-million-jobs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Corporate Profits Surge as Companies Cut Nearly 1 Million Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T17:36:11.842176+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T16:49:00+00:00",
        "description": "An anonymous reader shares a report: Amazon on Friday expanded the reach of its low-cost ecommerce service to 14 additional markets and will call it Amazon Bazaar, as part of a push to compete with Chinese rivals including Shein and PDD Holding's Temu. The expansion of the service comes at a time when U.S. President Donald Trump's sweeping import tariffs are denting consumer sentiment, especially of lower-income groups, who are on a constant hunt for cheaper deals.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Takes+Low-Cost+Ecommerce+Service+Global%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F07%2F1649221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F11%2F07%2F1649221%2Famazon-takes-low-cost-ecommerce-service-global%3Futm_source%3Dslas",
        "id": 4011602,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/07/1649221/amazon-takes-low-cost-ecommerce-service-global",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Takes Low-Cost Ecommerce Service Global",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T16:25:18.044804+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T16:02:00+00:00",
        "description": "Singaporean super-app company Grab has dumped 200 cloudy Mac Minis and replaced them with physical machines, a move it expects will save $2.4 million over three years. From a report: Grab is Southeast Asia's leading rideshare and food delivery outfit and therefore needs to build apps for iOS to connect with customers. In a Thursday post, the company explains it builds those apps using Continuous Integration and Continuous Delivery/Deployment (CI/CD) infrastructure that runs on Apple Mac computers. \n\nThe company started with a single on-prem Mac Pro -- its post shows 2013's cylindrical model based around an Intel Xeon processor -- but eventually reached over 200 Macs, running in the cloud at an unnamed US cloud provider. \"At the beginning, it was a no-brainer to rent when our demand for macOS hardware increased from 1 Mac Pro to 20 times that size,\" Grab's post explains. \"However, when that grew to over 200 machines, the total cost became significant.\"<p><div class=\"share_submission\" s",
        "id": 4010976,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/07/1432254/rideshare-giant-grab-moves-200-macs-out-of-the-cloud-expects-to-save-24-million",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rideshare Giant Grab Moves 200 Macs Out of the Cloud, Expects To Save $2.4 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T16:25:18.322006+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T15:21:00+00:00",
        "description": "An anonymous reader shares a report: The volume of activity on Polymarket, one of the most popular prediction markets, has been significantly inflated by so-called wash trading in which users rapidly buy and sell the same contracts, according to a new study by Columbia University researchers. The \"artificial trading,\" as the authors call it, varied over time but accounted for an average of 25% of all buying and selling on Polymarket over the past three years, the researchers concluded. \n\nThe paper, which has not undergone peer review, was posted Thursday on the open-access research platform SSRN. The authors do not suggest that Polymarket itself was responsible for the wash trading, but they point to elements of the exchange's crypto-based structure that make it possible.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Polymarket+Volume+Inflated+by+'Artificial'+Activity%2C+Study+Finds%3A+https%3A%2F%2Ftech.slashdot.o",
        "id": 4010977,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/07/1414219/polymarket-volume-inflated-by-artificial-activity-study-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Polymarket Volume Inflated by 'Artificial' Activity, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T15:15:42.354478+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T14:41:00+00:00",
        "description": "Rockstar Games has announced that Grand Theft Auto VI won't launch in May of next year as planned. Kotaku: The highly anticipated sequel is now set to arrive in November 2026. On Thursday, Rockstar announced on social media that the long-awaited next entry in its open-world blockbuster franchise would need a bit more time, delaying the game an additional six months from May to November 19, 2026. Rockstar said \"these extra months will allow us to finish the game with the level of polish you have come to expect and deserve.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Grand+Theft+Auto+6+Delayed+Again+Until+November+2026%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F11%2F07%2F147245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F11%2F07%2F",
        "id": 4010321,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/07/147245/grand-theft-auto-6-delayed-again-until-november-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Grand Theft Auto 6 Delayed Again Until November 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T14:10:41.901101+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T14:00:00+00:00",
        "description": "An anonymous reader shares a report: The Netherlands is prepared to suspend its powers over Chinese-owned chipmaker Nexperia in a move that would de-escalate a fight with Beijing that threatens to disrupt automotive production around the world. The Dutch government is ready to shelve the ministerial order that gave it the power to block or change key corporate decisions at Nexperia, if China allows exports of its critical chips again, according to people familiar with the matter. \n\nIf the shipment of supplies resumes and is verified in the coming days, the Dutch are willing to revoke its powers as soon as next week, said the people, who spoke on the condition of anonymity. Financial issues between Nexperia and its Chinese operations would also need to be resolved. [...] In a sign of easing tensions, the Dutch government said in a statement late Thursday that it expects Nexperia's Chinese unit to resume chip supplies in the coming days.<p><div class=\"share_submission\" style=\"position:r",
        "id": 4009812,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/07/1227231/dutch-ready-to-drop-nexperia-control-if-chip-supply-resumes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dutch Ready To Drop Nexperia Control If Chip Supply Resumes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T13:08:19.124900+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: The U.S. Congressional Budget Office (CBO) confirms it suffered a cybersecurity incident after a suspected foreign hacker breached its network, potentially exposing sensitive data. In a statement shared with BleepingComputer, CBO spokesperson Caitlin Emma confirmed the \"security incident\" and said the agency acted quickly to contain it. \"The Congressional Budget Office has identified the security incident, has taken immediate action to contain it, and has implemented additional monitoring and new security controls to further protect the agency's systems going forward,\" Emma told BleepingComputer.\n \n\"The incident is being investigated and work for the Congress continues. Like other government agencies and private sector entities, CBO occasionally faces threats to its network and continually monitors to address those threats.\" The Washington Post first reported the breach, stating that officials discovered the hack in recent day",
        "id": 4009317,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/07/0115221/us-congressional-budget-office-hit-by-suspected-foreign-cyberattack",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Congressional Budget Office Hit By Suspected Foreign Cyberattack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T10:46:12.221617+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T10:00:00+00:00",
        "description": "The Scandinavian furniture giant has unveiled 21 new ultra-affordable Matter-over-Thread smart home devices across three launch segments: lighting, sensors, and control. With prices starting at just a few dollars, Ikea is pushing hard to replace its old Zigbee lineup and become a serious player in the Matter ecosystem. Forbes reports: Back to the 21 new devices specifically and they are all native Matter ones though, so you don't actually need Ikea's hub to get involved, as Matter controllers from other brands will be able to sync them up to your existing smart home platform as well; provided that Matter controller also doubles up as a Thread border router. The good news is that many existing devices you may already have in your house - think Apple HomePod mini, Google Nest Hub Max, most of the recent Amazon Echo range, SmartThings hubs and even some Eero routers - all do.\n \nThis being Ikea, there are some quirky names involved... the new lineup starts with the Kajplats smart bulb ran",
        "id": 4008322,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/11/07/0112202/ikeas-big-smart-home-push-arrives-with-21-new-matter-devices",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ikea's Big Smart Home Push Arrives With 21 New Matter Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T07:50:13.917208+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T07:00:00+00:00",
        "description": "In a recent article published in the New York Times, author Casey Michael Henry argues that today's tech industry keeps borrowing dystopian sci-fi aesthetics and ideas -- often the parts that were meant as warnings -- and repackages them as exciting products without recognizing that they were originally cautionary tales to avoid. \"The tech industry is delivering on some of the futuristic notions of late-20th-century science fiction,\" writes Henry. \"Yet it seems, at times, bizarrely unaware that many of those notions were meant to be dystopian or satirical -- dismal visions of where our worst and dumbest habits could lead us.\" Here's an excerpt from the report: You worry that someone in today's tech world might watch \"Gattaca\" -- a film that features a eugenicist future in which people with ordinary DNA are relegated to menial jobs -- and see it as an inspirational launching point for a collaboration between 23andMe and a charter school. The material on Sora, for instance, can feel odd",
        "id": 4007459,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/07/0057237/why-does-so-much-new-technology-feel-inspired-by-dystopian-sci-fi-movies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Does So Much New Technology Feel Inspired by Dystopian Sci-Fi Movies?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T03:46:06.166391+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T03:30:00+00:00",
        "description": "Mark Zuckerberg opened an unlicensed school named after the family's pet chicken -- and it was the final straw for his neighbors, writes Slashdot reader joshuark, citing a report from Wired. The magazine obtained 1,665 pages of documents about the neighborhood dispute -- \"including 311 records, legal filings, construction plans, and emails.\" Here are excerpts from the report: The documents reveal that the school may have been operating as early as 2021 without a permit to operate in the city of Palo Alto. As many as 30 students might have enrolled, according to observations from neighbors. [...] Over time, neighbors became fed up with what they argued was the city's lack of action, particularly with respect to the school. Some believed that the delay was because of preferential treatment to the Zuckerbergs. \"We find it quite remarkable that you are working so hard to meet the needs of a single billionaire family while keeping the rest of the neighborhood in the dark,\" reads one email ",
        "id": 4006352,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/07/0044201/mark-zuckerberg-opened-an-illegal-school-at-his-palo-alto-compound-his-neighbor-revolted",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mark Zuckerberg Opened an Illegal School At His Palo Alto Compound. His Neighbor Revolted",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T01:40:21.443271+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T01:25:00+00:00",
        "description": "alternative_right shares a report from The Conversation: Countries around the world have been discussing the need to rein in climate change for three decades, yet global greenhouse gas emissions -- and global temperatures with them -- keep rising. When it seems like we're getting nowhere, it's useful to step back and examine the progress that has been made. Let's take a look at the United States, historically the world's largest greenhouse gas emitter. Over those three decades, the U.S. population soared by 28% and the economy, as measured by gross domestic product adjusted for inflation, more than doubled. Yet U.S. emissions from many of the activities that produce greenhouse gases -- transportation, industry, agriculture, heating and cooling of buildings -- have remained about the same over the past 30 years.\n \nTransportation is a bit up; industry a bit down. And electricity, once the nation's largest source of greenhouse gas emissions, has seen its emissions drop significantly. Ove",
        "id": 4005826,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/07/0029244/how-the-us-cut-climate-changing-emissions-while-its-economy-more-than-doubled",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How the US Cut Climate-Changing Emissions While Its Economy More Than Doubled",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T01:40:21.616467+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T00:45:00+00:00",
        "description": "According to the Wall Street Journal, Ford executives are considering scrapping the electric version of the F-150 pickup truck as losses, supply setbacks, slow sales, and the arrival of a cheaper midsize EV truck undermine the business case for its full-size electric pickup. Reuters reports: Last month, a union official told Reuters that Ford was pausing production at the Dearborn, Michigan, plant that makes its F-150 Lightning electric pickup due to a fire at a supplier's aluminum factory. \"We have good inventories of the F-150 Lightning and will bring Rouge Electric Vehicle Center back up at the right time, but don't have an exact date at this time,\" Ford said in a statement on Thursday.\n \nThe WSJ report added that General Motors executives have discussed discontinuing some electric trucks, citing people familiar with the matter. The Detroit three, which includes Ford, GM and Chrysler-parent Stellantis, have rolled back their ambitious plans for EVs in the United States, pivoting to",
        "id": 4005827,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/06/2358231/ford-considers-scrapping-f-150-ev-truck",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ford Considers Scrapping F-150 EV Truck",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T00:39:45.076373+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T00:23:00+00:00",
        "description": "BrianFagioli writes: Google has released Magika 1.0, a stable version of its AI-based file type detection tool, and rebuilt the entire engine in Rust for speed and memory safety. The system now recognizes more than 200 file types, up from about 100, and is better at distinguishing look-alike formats such as JSON vs JSONL, TSV vs CSV, C vs C++, and JavaScript vs TypeScript. The team used a 3TB training dataset and even relied on Gemini to generate synthetic samples for rare file types, allowing Magika to handle formats that don't have large, publicly available corpora. The tool supports Python and TypeScript integrations and offers a native Rust command-line client.\n \nUnder the hood, Magika uses ONNX Runtime for inference and Tokio for parallel processing, allowing it to scan around 1,000 files per second on a modern laptop core and scale further with more CPU cores. Google says this makes Magika suitable for security workflows, automated analysis pipelines, and general developer tooli",
        "id": 4005474,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/07/005225/magika-10-goes-stable-as-google-rebuilds-its-file-detection-tool-in-rust",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Magika 1.0 Goes Stable As Google Rebuilds Its File Detection Tool In Rust",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-07T00:39:45.210255+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-07T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from The Verge: What did Ilya see?\" Two years ago, it was the meme seen 'round the world (or at least 'round the tech industry). OpenAI CEO Sam Altman had been briefly ousted in November 2023 by members of the company's board of directors, including his longtime collaborator and fellow cofounder Ilya Sutskever. The board claimed Altman \"was not consistently candid in his communications with the board,\" undermining their confidence in him. He was out for less than a week before being reinstated after hundreds of employees threatened to resign. But observers wondered: What hadn't Altman been candid about? And what led Sutskever to turn against him?\n \nNow, new details have come to light in a legal deposition involving Sutskever, part of Musk's ongoing lawsuit against Altman and OpenAI. For nearly 10 hours on October 1st, bookended by repeated sniping between Musk's and Sutsever's attorneys, Sutskever answered questions about the turmoil around Altman's",
        "id": 4005475,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/06/2344248/why-sam-altman-was-booted-from-openai-according-to-new-testimony",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Sam Altman Was Booted From OpenAI, According To New Testimony",
        "vote": 0
    }
]