[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T23:01:33+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Apple executive Kim Vorrath, a company veteran known for fixing troubled products and bringing major projects to market, has a new job: whipping artificial intelligence and Siri into shape. Vorrath, a vice president in charge of program management, was moved to Apple's artificial intelligence and machine learning division this week, according to people with knowledge of the matter. She'll be a top deputy to AI chief John Giannandrea, said the people, who asked not to be identified because the change hasn't been announced publicly. The move helps bolster a team that's racing to make Apple a leader in AI -- an area where it's fallen behind technology peers. [...]\n \nVorrath, who has spent 36 years at Apple, is known for managing the development of tough software projects. She's also put procedures in place that can catch and fix bugs. Vorrath joins the new team from Apple's hardware engineering division, where she helped launch the Vis",
        "id": 1974956,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/01/24/2113240/apple-enlists-veteran-software-executive-to-help-fix-ai-and-siri?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Enlists Veteran Software Executive To Help Fix AI and Siri",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T23:01:33+00:00",
        "description": "Longtime Slashdot reader shanen writes: What matters to you when buying a new smartphone? How can we make the recurring topic relevant without more SCREAMS about \"dupe\"? I do have a bit of recent research I could share -- quite a bit of fresh data since my latest search started a couple of months ago. Or perhaps I could start with a summary of the useful bits from an ancient Ask Slashdot discussion about batteries?\n \nSeems funny to ask about relevant books, even though two come to mind already. One is The Anxious Generation by Jonathan Haidt, where he argues that smartphone use by preadolescents is destroying their personalities. The other is Antifragile by Nassim Nicholas Taleb, who doesn't actually say much about them, but I still think they should have been included in the the big table of examples at the end of the prologue. The \"system\" of smartphones is antifragile, even though the earliest models were quite fragile. The essence of this question is about which current smartphon",
        "id": 1974957,
        "language": null,
        "link": "https://ask.slashdot.org/story/25/01/24/2057209/ask-slashdot-what-matters-when-buying-a-new-smartphone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ask Slashdot: What Matters When Buying a New Smartphone?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T23:01:33+00:00",
        "description": "Netflix plans to expand its cloud gaming offerings to include couch co-op and party games, according to co-CEO Greg Peters. The company will also continue developing narrative games based on its IP, despite recent leadership changes and the closure of its AAA game studio. The Verge reports: In the blog post, Netflix notes that it's a \"limited\" beta test, so it seems like this won't be available to too many people to start. (Netflix used that same \"limited\" language with the initial launch in Canada and the UK.) Like with the original test, the only two games available to stream are Oxenfree from Netflix's own Night School Studio and another game titled Molehew's Mining Adventure.\n \nIf you have access to the service, you'll need to download Netflix's special controller app for your iPhone or Android device to play the game on your TV. (Netflix says the streamed games work on \"select devices,\" including Amazon Fire TV devices, Chromecast with Google TV, Roku devices and TVs, and more.)",
        "id": 1974958,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/01/24/2052235/netflixs-cloud-plans-include-co-op-and-party-games?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Netflix's Cloud Plans Include Co-Op and Party Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T21:19:52+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The game of chess has long been central to computer science and AI-related research, most notably in IBM's Deep Blue in the 1990s and, more recently, AlphaZero. But the game is about more than algorithms, according to Marc Barthelemy, a physicist at the Paris-Saclay University in France, with layers of depth arising from the psychological complexity conferred by player strategies. Now, Barthelmey has taken things one step further by publishing a new paper in the journal Physical Review E that treats chess as a complex system, producing a handy metric that can help predict the proverbial \"tipping points\" in chess matches. [...]\n \nFor his analysis, Barthelemy chose to represent chess as a decision tree in which each \"branch\" leads to a win, loss, or draw. Players face the challenge of finding the best move amid all this complexity, particularly midgame, in order to steer gameplay into favorable branches. That's where those crucial ",
        "id": 1974348,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/24/2046222/complexity-physics-finds-crucial-tipping-points-in-chess-games?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Complexity Physics Finds Crucial Tipping Points In Chess Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T18:55:59+00:00",
        "description": "Battery cars on Britain's roads are lasting as long as petrol and diesel cars, according to a study that has found a rapid improvement in electric vehicle reliability. From a report: An international team of researchers has estimated that an electric car will have a lifespan of 18.4 years, compared with 18.7 years for petrol cars and 16.8 years for diesels, according to a peer-reviewed study published on Friday in the journal Nature Energy. The findings were based on 300m records from compulsory annual MOT tests of roadworthiness. \n\nAutomotive engineers have long suspected electric cars will be more reliable than petrol or diesel cars, because they contain many fewer moving parts. Data has been limited, however, because the earliest mass-market electric cars are only just reaching the end of their lives. The researchers, from the University of Birmingham, the London School of Economics, the University of California San Diego, and the University of Bern, Switzerland, used MOT data to ",
        "id": 1973499,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/24/171242/electric-cars-in-uk-last-as-long-as-petrol-and-diesel-vehicles-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Electric Cars in UK Last as Long as Petrol and Diesel Vehicles, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T18:55:59+00:00",
        "description": "The FBI warned this week that North Korean IT workers are abusing their access to steal source code and extort U.S. companies that have been tricked into hiring them. From a report: The security service alerted public and private sector organizations in the United States and worldwide that North Korea's IT army will facilitate cyber-criminal activities and demand ransoms not to leak online exfiltrated sensitive data stolen from their employers' networks. \"North Korean IT workers have copied company code repositories, such as GitHub, to their own user profiles and personal cloud accounts. While not uncommon among software developers, this activity represents a large-scale risk of theft of company code,\" the FBI said. \n\n\"North Korean IT workers could attempt to harvest sensitive company credentials and session cookies to initiate work sessions from non-company devices and for further compromise opportunities.\" To mitigate these risks, the FBI advised companies to apply the principle of",
        "id": 1973497,
        "language": null,
        "link": "https://it.slashdot.org/story/25/01/24/1851209/fbi-north-korean-it-workers-steal-source-code-to-extort-employers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FBI: North Korean IT Workers Steal Source Code To Extort Employers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T18:55:59+00:00",
        "description": "Walgreens Boots Alliance has ended a $200 million digital display venture with startup Cooler Screens after widespread technical failures and poor revenue, removing thousands of smart screens from its store freezer doors [non-paywalled link]. The screens, which displayed product information and ads, frequently crashed, showed incorrect inventory, and occasionally caught fire, Bloomberg reports. \n\nCooler Screens CEO Arsen Avakian cut data feeds to over 100 Chicago-area stores in December 2023 during a contract dispute, prompting Walgreens to obtain a restraining order. Walgreens completed removal of 10,300 screens from 700 stores in August 2024, replacing them with traditional glass doors. The screens generated just $215 per door annually, less than half the contractual minimum, according to Walgreens. Nearly $50 million worth of custom-made screens now sit unused in a Texas warehouse.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter",
        "id": 1973498,
        "language": null,
        "link": "https://slashdot.org/story/25/01/24/1813201/walgreens-replaced-fridge-doors-with-smart-screens-its-now-a-200-million-fiasco?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Walgreens Replaced Fridge Doors With Smart Screens. It's Now a $200 Million Fiasco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T16:58:08+00:00",
        "description": "Meta plans to spend between $60 billion and $65 billion this year to build out AI infrastructure, CEO Mark Zuckerberg said on Friday, joining a wave of Big Tech firms unveiling hefty investments to capitalize on the technology. From a report: As part of the investment, Meta will build a more than 2-gigawatt data center that would be large enough to cover a significant part of Manhattan. The company -- one of the largest customers of Nvidia's coveted artificial intelligence chips -- plans to end the year with more than 1.3 million graphics processors. \n\n\"This will be a defining year for AI,\" Zuckerberg said in a Facebook post. \"This is a massive effort, and over the coming years it will drive our core products and business.\" Zuckerberg expects Meta's AI assistant -- available across its services, including Facebook and Instagram -- to serve more than 1 billion people in 2025, while its open-source Llama 4 would become the \"leading state-of-the-art model.\"<p><div class=\"share_submissio",
        "id": 1972507,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/24/1546242/meta-to-spend-up-to-65-billion-this-year-to-power-ai-goals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta To Spend Up To $65 Billion This Year To Power AI Goals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T16:58:08+00:00",
        "description": "Sony will cease production of recordable Blu-ray discs at its last factory in February, ending an 18-year manufacturing run amid declining demand for physical media. The Japanese electronics giant will also halt production of MiniDiscs and MiniDV cassettes. The company had already stopped making consumer recordable Blu-ray and optical disks in mid-2024, maintaining production only for business clients.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sony+To+End+Blu-ray+Media+Production+After+18+Years%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F01%2F24%2F1649223%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F01%2F24%2F1649223%2Fsony-to-end-blu-ray-media-production-after-18-years%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img ",
        "id": 1972506,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/24/1649223/sony-to-end-blu-ray-media-production-after-18-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sony To End Blu-ray Media Production After 18 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T15:35:26+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: When threat actors use backdoor malware to gain access to a network, they want to make sure all their hard work can't be leveraged by competing groups or detected by defenders. One countermeasure is to equip the backdoor with a passive agent that remains dormant until it receives what's known in the business as a \"magic packet.\" On Thursday, researchers revealed that a never-before-seen backdoor that quietly took hold of dozens of enterprise VPNs running Juniper Network's Junos OS has been doing just that. J-Magic, the tracking name for the backdoor, goes one step further to prevent unauthorized access. After receiving a magic packet hidden in the normal flow of TCP traffic, it relays a challenge to the device that sent it. The challenge comes in the form of a string of text that's encrypted using the public portion of an RSA key. The initiating party must then respond with the corresponding plaintext, proving it has access to th",
        "id": 1971635,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/24/0039249/backdoor-infecting-vpns-used-magic-packets-for-stealth-and-security?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Backdoor Infecting VPNs Used 'Magic Packets' For Stealth and Security",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T15:35:26+00:00",
        "description": "Google will take firmer action against British businesses that use fake reviews to boost their star ratings on the search giant's reviews platform. From a report: The UK's Competition and Markets Authority (CMA) announced on Friday that Google has agreed to improve its processes for detecting and removing fake reviews, and will take action against the businesses and reviewers that post them. \n\nThis includes deactivating the ability to add new reviews for businesses found to be using fake reviews, and deleting all existing reviews for at least six months if they repeatedly engage in suspicious review activity. Google will also place prominent \"warning alerts\" on the Google profiles of businesses using fake reviews to help consumers be more aware of potentially misleading feedback. Individuals who repeatedly post fake or misleading reviews on UK business pages will be banned and have their review history deleted, even if they're located in another country.<p><div class=\"share_submissio",
        "id": 1971633,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/24/1342258/google-agrees-to-crack-down-on-fake-reviews-for-uk-businesses?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Agrees To Crack Down on Fake Reviews for UK Businesses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T15:35:26+00:00",
        "description": "Leaders at CERN, Europe's particle-physics laboratory in Geneva, Switzerland, will introduce financial incentives for academic publishers to adopt open science policies as part of the organization's collective agreement with 11 particle-physics journals. From a report: The current scheme sees those journals publish work from the field openly and at no cost to authors, in exchange for bulk payments. Under the newly launched initiative, CERN will pay more to publishers that adopt polices such as use of public or open peer review and linking research to data sets, and less to those that do not. Some open-science specialists say the policy could be a game-changer in encouraging transparent science. Others caution that it could set a precedent for publishers to boost their fees in exchange for becoming more open. \"Particle physics is large, international, highly complex, highly dynamic. Openness is the only really effective way of practising science in the discipline,\" says Kamran Naim, h",
        "id": 1971632,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/24/1425230/pioneering-cern-scheme-will-pay-publishers-more-if-they-hit-open-science-targets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pioneering CERN Scheme Will Pay Publishers More If They Hit Open-Science Targets",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T15:35:26+00:00",
        "description": "Chinese venture capital and private equity firm HongShan, formerly part of Sequoia, said on Friday it has struck a deal to acquire a majority stake in Marshall in a deal valuing the audio equipment maker at $1.15 billion.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Private+Equity+Firm+HongShan+Acquires+Rock+Icon+Marshall+For+%241.15+Billion%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F01%2F24%2F1331225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F01%2F24%2F1331225%2Fprivate-equity-firm-hongshan-acquires-rock-icon-marshall-for-115-billion%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://entertainment.slashdot.org/story/25/01",
        "id": 1971634,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/01/24/1331225/private-equity-firm-hongshan-acquires-rock-icon-marshall-for-115-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Private Equity Firm HongShan Acquires Rock Icon Marshall For $1.15 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T12:27:24+00:00",
        "description": "The U.S. may have led China in the AI race for the past decade, according to Alexandr Wang, CEO of Scale AI, but on Christmas Day, everything changed. From a report: Wang, whose company provides training data to key AI players including OpenAI, Google and Meta , said Thursday at the World Economic Forum in Davos, Switzerland, that DeepSeek, the leading Chinese AI lab, released an \"earth-shattering model\" on Christmas Day, then followed it up with a powerful reasoning-focused AI model, DeepSeek-R1, which competes with OpenAI's recently released o1 model. \n\n\"What we've found is that DeepSeek ... is the top performing, or roughly on par with the best American models,\" Wang said. In an interview with CNBC, Wang described the artificial intelligence race between the U.S. and China as an \"AI war,\" adding that he believes China has significantly more Nvidia H100 GPUs -- AI chips that are widely used to build leading powerful AI models -- than people may think, especially considering U.S. ex",
        "id": 1970857,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/24/0049233/scale-ai-ceo-says-china-has-quickly-caught-the-us-with-deepseek?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scale AI CEO Says China Has Quickly Caught the US With DeepSeek",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T11:09:33+00:00",
        "description": "Longtime Slashdot readers smooth wombat and AmiMoJo shares a fusion energy breakthrough from China. Charming Science reports: China's \"artificial sun,\" officially known as the Experimental Advanced Superconducting Tokamak (EAST), has achieved a groundbreaking milestone in fusion energy research. According to the Chinese Academy of Sciences (CAS), EAST recently sustained high-confinement plasma operation for an unprecedented 1,066 seconds, shattering the previous world record of 403 seconds, also set by EAST in 2023. [...] The 1,000-second mark is considered a critical threshold in fusion research. Sustaining plasma for such extended durations is essential for demonstrating the feasibility of operating fusion reactors. This breakthrough, accomplished by the Institute of Plasma Physics under the CAS, signifies a major leap towards realizing the potential of fusion energy. [...] The success of EAST's recent experiment can be attributed to several key advancements. Researchers have made ",
        "id": 1970088,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/24/0026251/chinese-fusion-reactor-maintains-steady-state-for-almost-18-minutes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chinese Fusion Reactor Maintains Steady State For Almost 18 Minutes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T07:56:06+00:00",
        "description": "President Donald Trump signed an executive order on AI Thursday that will revoke past government policies his order says \"act as barriers to American AI innovation.\" From a report: To maintain global leadership in AI technology, \"we must develop AI systems that are free from ideological bias or engineered social agendas,\" Trump's order says. The new order doesn't name which existing policies are hindering AI development but sets out to track down and review \"all policies, directives, regulations, orders, and other actions taken\" as a result of former President Joe Biden's sweeping AI executive order of 2023, which Trump rescinded Monday. \n\nAny of those Biden-era actions must be suspended if they don't fit Trump's new directive that AI should \"promote human flourishing, economic competitiveness, and national security.\" Last year, the Biden administration issued a policy directive that said U.S. federal agencies must show their artificial intelligence tools aren't harming the public, o",
        "id": 1969635,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/24/0027228/trump-signs-executive-order-on-developing-ai-free-from-ideological-bias?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Signs Executive Order on Developing AI 'Free From Ideological Bias'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T05:38:14+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from MotorTrend: A coming ground-fault circuit-interrupter revision could make slow-charging your car nearly impossible. The National Fire Protection Agency (NFPA) publishes a new National Electric Code every three years, and we almost never notice or care. But the next one, NFPA 70 2026, has the Society of Automotive Engineers (SAE) electric-vehicle charging subcommittee, OEMs, and companies in the EV Supply Equipment (EVSE, or charger) biz mightily concerned. That's because it proposes to require the same exact ground-fault circuit-interrupter protection that makes you push that little button on your bathroom outlet every time the curling iron won't heat up. Only now, that reset button will often be down in an electric panel, maybe locked in a room where you can't reset it. If EV drivers can't reliably plug in and expect their cars to charge overnight at home or while at work, those cars will become far less practical. [...]\n \nThe na",
        "id": 1969182,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/24/0034243/dumb-new-electrical-code-could-doom-most-common-ev-charging?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dumb New Electrical Code Could Doom Most Common EV Charging",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T04:08:48+00:00",
        "description": "An anonymous reader quotes a report from The Verge: TerraPower, a nuclear energy startup founded by Bill Gates, struck a deal this week with one of the largest data center developers in the US to deploy advanced nuclear reactors. TerraPower and Sabey Data Centers (SDC) are working together on a plan to run existing and future facilities on nuclear energy from small reactors. A memorandum of understanding signed by the two companies establishes a \"strategic collaboration\" that'll initially look into the potential for new nuclear power plants in Texas and the Rocky Mountain region that would power SDC's data centers. [...]\n \nThere's still a long road ahead before that can become a reality. The technology TerraPower and similar nuclear energy startups are developing still have to make it through regulatory hurdles and prove that they can be commercially viable. Compared to older, larger nuclear power plants, the next generation of reactors are supposed to be smaller and easier to site. ",
        "id": 1968855,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/24/0015204/bill-gates-terrapower-signs-agreement-for-nuclear-to-power-data-centers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bill Gates' TerraPower Signs Agreement For Nuclear To Power Data Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T02:23:09+00:00",
        "description": "Epic Games is expanding its mobile app store to include nearly 20 third-party games on Android and EU iOS, launching a free games program, and temporarily covering Apple's Core Technology Fee for participating developers to counter platform restrictions. \"Our aim here isn't just to launch a bunch of different stores in different places, but to build a single, cross-platform store in which, within the era of multi-platform games, if you buy a game or digital items in one place, you have the ability to own them everywhere,\" Epic CEO Tim Sweeney told reporters during a press briefing. The Verge reports: Under the program, Epic will offer new free games in the store each month before eventually switching to a weekly schedule. However, the games aren't actually in the store yet -- Epic said on Thursday that it \"ran into a few bugs that we're working through now\" and \"we'll provide an update once the games are live and ready to play!\"\n \nTo sweeten the deal for developers that participate i",
        "id": 1968299,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/23/2350253/epic-games-to-cover-developer-ios-fees?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Epic Games To Cover Developer iOS Fees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T02:23:09+00:00",
        "description": "Intel is advocating for modular PC designs to improve repairability, reduce e-waste, and align with the right-to-repair movement. A trio of executives makes their case for such designs in a recent blog post. The Register reports: Intel's approach to the problem is to draft three proposals targeting different market segments, saying that a one-size-fits-all approach would not be able to address the nuanced demands of these varied segments. Those three segments comprise \"Premium Modular PC\" (actually a laptop design); \"Entry/Mainstream Modular PC\" (another laptop); and \"Desktop Modular PC.\"\n \nThe first envisages a three-board system, comprising a core motherboard plus universal left and right I/O boards, the latter engineered to be common across fan-less Thin &amp; Light designs with a 10W power envelope, and premium fanned designs for up to 20W or 30W. The Entry/Mainstream Modular PC is similar, with a core motherboard and left and right I/O boards, although in this segment, Intel say",
        "id": 1968302,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/23/2141232/intel-pitches-modular-pc-designs-to-make-repairs-less-painful?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Pitches Modular PC Designs To Make Repairs Less Painful",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T02:23:09+00:00",
        "description": "The Linux 6.14 kernel now maps out support for Microsoft's \"Copilot\" key \"so that user-space software can determine the behavior for handling that key's action on the Linux desktop,\" writes Phoronix's Michael Larabel. From the report: A change made to the atkbd keyboard driver on Linux now maps the F23 key to support the default copilot shortcut action. The patch authored by Lenovo engineer Mark Pearson explains [...]. Now it's up to the Linux desktop environments for determining what to do if the new Copilot key is pressed. The patch was part of the input updates now merged for the Linux 6.14 kernel.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Linux+6.14+Adds+Support+For+The+Microsoft+Copilot+Key+Found+On+New+Laptops%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F01%2F23%2F2333254%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpo",
        "id": 1968300,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/01/23/2333254/linux-614-adds-support-for-the-microsoft-copilot-key-found-on-new-laptops?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linux 6.14 Adds Support For The Microsoft Copilot Key Found On New Laptops",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T02:23:09+00:00",
        "description": "The World Economic Forum's Global Risks Report 2025 (PDF) highlights misinformation as the top global risk due to generative AI tools and state-sponsored campaigns undermining democratic systems, while cyberespionage ranks as a persistent threat with inadequate cyber resilience, especially among small organizations. From a report: The manipulation of information through gen AI and state-sponsored campaigns is disrupting democratic systems and undermining public trust in critical institutions. Efforts to combat this risk have a \"formidable opponent\" in gen AI-created false or misleading content that can be produced and distributed at scale, the report warned. Misinformation campaigns in the form of deepfakes, synthetic voice recordings or fabricated news stories are now a leading mechanism for foreign entities to influence \"voter intentions, sow doubt among the general public about what is happening in conflict zones, or tarnish the image of products or services from another country.\"",
        "id": 1968298,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/24/004211/misinformation-and-cyberespionage-top-wefs-global-risks-report-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Misinformation and Cyberespionage Top WEF's Global Risks Report 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T02:23:09+00:00",
        "description": "An anonymous reader quotes a report from SFGATE: The same morning that JetBlue Airways announced that it was the first airline partnering with Venmo to begin accepting payments for booking flights, an account on the popular payment platform was already raking in money. A Venmo user named Owen Miller paid the JetBlue Checkpoint Store for a drink on Wednesday morning, which is a typical transaction between a traveler and airline, except for the fact that JetBlue doesn't operate that account. \"At this time, JetBlue does not accept Venmo payment for inflight purchases such as food and beverages,\" a representative for the airline told SFGATE in an email. \"Unfortunately, we have seen accounts falsely representing themselves as JetBlue to deceive and defraud customers.\" To stay safe from scammers when booking JetBlue flights with Venmo, the airline recommends customers only use verified JetBlue channels, such as their official website or app, and follow their secure payment process using th",
        "id": 1968301,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/23/2259248/scammers-use-venmo-to-deceive-and-defraud-customers-on-flights?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scammers Use Venmo To 'Deceive and Defraud Customers' On Flights",
        "vote": 0
    }
]