[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T21:00:09+00:00",
        "description": "Id Software has never failed to impress with its DOOM outings, and the series’ modern entries in particular have recaptured the masses to great effect. \n\nNow, DOOM: The Dark Ages is on the horizon, and we couldn’t be more excited to get down to ripping and tearing demons once again. We recently had the chance to view a hands-off presentation of the shooter and sit in on a Q&A session with director Hugo Martin and executive producer Marty Stratton, and learned a host of exciting new details in the process. \n\nHere, we run through those details, talking about DOOM: The Dark Ages’ story and setting, its new and improved gameplay mechanics, new tools and weapons, its launch details, and much more.",
        "id": 1974395,
        "language": null,
        "link": "https://www.youtube.com/watch?v=AC4uVp_FB9Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AC4uVp_FB9Q/hqdefault.jpg",
        "title": "DOOM: The Dark Ages - 15 NEW Things YOU NEED TO KNOW Before You Pre-Order",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-24T10:15:04+00:00",
        "description": "Team Ninja, PlatinumGames, and Microsoft announced at the recent Xbox Developer Direct showcase that they’re finally bringing the Ninja Gaiden series back with the long overdue Ninja Gaiden 4. \n\nThat, of course, is massively exciting for series fans- though fans also have something else to be excited about. Also revealed and released during the showcase was Ninja Gaiden 2 Black, a remake/remaster that completely visually overhauls the classic 2008 action title for current gen platforms while porting it to Unreal Engine 5. \n\nIn addition to touting significant graphical enhancements, Ninja Gaiden 2 Black also features modes and playable characters from Ninja Gaiden Sigma 2, with Koei Tecmo dubbing it the definitive Ninja Gaiden 2 experience. Here, we discuss all of that and more.",
        "id": 1970144,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ifad0x7raL4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ifad0x7raL4/hqdefault.jpg",
        "title": "NINJA GAIDEN 2 Black Remake - 15 Things You NEED To Know Before You Buy",
        "vote": 0
    }
]