[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-17T17:00:57.525105+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-17T16:00:31+00:00",
        "description": "Death Stranding 2: On the Beach is Kojima Productions’ follow-up to the wildly successful - if ultimately divisive - 2019 game Death Stranding. Focusing again on the efforts of Sam Porter Bridges as he establishes connections across newfound continents beset by mysterious post apocalypse, Death Stranding 2 also sees the returning character Fragile alongside a host of new allies and antagonists. \n\nOfficial information from Kojima and his team pinpoint plenty to be excited about, including revamped combat, a faster paced story, fresh environments to traverse, overhauled progression, choice-based gameplay, plus a whole boatload more. \n\nThis feature aims to unpack fifteen things that we at GamingBolt are most excited about prior to getting our hands on Death Stranding 2: On the Beach.",
        "id": 2954414,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Dv5g87mvx_A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Dv5g87mvx_A/hqdefault.jpg",
        "title": "15 Things I CAN'T WAIT To Try Out In Death Stranding 2",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-17T14:48:42.523740+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-17T14:01:28+00:00",
        "description": "Ever since Subsurface Circular, Bithell Games has been on somewhat of a role as of late with its sci-fi titles (with a brief detour into the John Wick-verse). TRON: Catalyst is the latest, following in the footsteps of TRON: Legacy, but presenting an all-new story and isometric action-focused combat.\n\nThe plot revolves around Exo, a courier program that's affected by the Glitch, allowing them to loop back to previous points. Between the Core seeking them for questioning, the mysterious Automata and the rebellious Reset, Exo has their work cut out trying to survive and find answers. The dialogue and voice acting are relatively on point throughout, with some strong performances.\n\nHowever, the combat, objectives and overall constrained nature of looping don't exactly make for the most compelling glitch-hopping adventure. TRON: Catalyst doesn't completely fail in all those respects, but they're only good enough to recommend for fans of the universe.",
        "id": 2953177,
        "language": null,
        "link": "https://www.youtube.com/watch?v=qtmpxM5KNrI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qtmpxM5KNrI/hqdefault.jpg",
        "title": "TRON: Catalyst Review - Just Good Enough For Fans of the Universe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-17T14:48:42.686381+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-17T14:00:54+00:00",
        "description": "MindsEye’s disastrous launch highlights a recurring problem in modern gaming: high-profile launches that are not ready to be released to the public. While CD Projekt Red and Hello Games were able to bring Cyberpunk 2077 and No Man’s Sky up to scratch after disastrous launches, Build a Rocket Boy’s attempts at damage control already indicate a problematic strategy.\n\nMindsEye’s myriad issues can make its attempt at redemption an unrewarding struggle for its developers even as Build a Rocket Boy reels from attrition and a lack of accountability for the studio’s failure to meet the expectations of its players. MindsEye is likely to be lost to the annals of gaming history, and serve as an example of a great concept that missed the mark on its execution.",
        "id": 2953178,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cf-hPll2kpg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cf-hPll2kpg/hqdefault.jpg",
        "title": "Can MindsEye Be Saved From Its DISASTROUS LAUNCH?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-17T10:30:40.837703+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-17T10:00:51+00:00",
        "description": "Remedy Entertainment is known for its story-focused single-player narratives, oftentimes focusing on ordinary characters thrust into unorthodox settings and predicaments. With FBC: Firebreak, it's applying that approach in a co-op PvE environment as members of a new FBC unit venture into the Oldest House to battle the Hiss.\n\nOffering five different Jobs, players can select the Clearance Level and Threat Level to customize the length and danger of a mission. Corrupted Items introduce modifiers like reduced gravity, increased enemy health, and so on to spice things up, though the objectives can lack a bit of complexity between levels. Instead, FBC: Firebreak focuses more on throwing hordes of enemies while pushing your team to repair objects, transport materials, and synergize your Crisis Kits, sometimes at the cost of performance.\n\nThe frantic nature of combat can be enjoyable at the higher difficulties, though progression can initially feel sluggish (solo players will have the toughes",
        "id": 2951053,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Y4CIusckuPI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y4CIusckuPI/hqdefault.jpg",
        "title": "FBC: Firebreak Review -  Fun Time But Definitely Not Remedy's Greatest Game",
        "vote": 0
    }
]