[
    {
        "age": null,
        "album": "",
        "author": "Little Chinese Everywhere",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T01:25:32.360094+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T01:00:58+00:00",
        "description": "This week, we’re embarking on an unforgettable journey aboard Panda Express Chengdu. Starting in Chengdu and traveling through the stunning landscapes of Guizhou, the adventure begins with a visit to Chengdu’s famous panda sanctuary before we settle into an extraordinary rail experience.\nOn board, we’re treated to true luxury: a private, hotel-style cabin complete with its own bathroom and even a Japanese toilet. The food is exceptional, the service is warm and attentive, and the atmosphere is made even more special by the incredibly welcoming passengers and staff we meet along the way.\nThe train itself is a world of its own, featuring a stylish bar carriage, gaming rooms, a lively party car, and of course, a karaoke room. Our journey concludes in a beautiful Miao village in Guizhou province, offering a perfect blend of comfort, culture, and authentic local experiences.\nJoin us on this adventure through central China on a luxury train 🎬\n\n0:00 Intro\n1:17 Boarding the train\n3:26 Room To",
        "id": 4366428,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZG9wyEGE3Ro",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 1,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 938,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC1UNB6Gy11umcbEj_hqIwhw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZG9wyEGE3Ro/hqdefault.jpg",
        "title": "First Class on China's MOST Luxurious Train - Is It Worth It? 🚝🇨🇳",
        "vote": 0
    }
]