[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T15:53:27.002703+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T15:30:00+00:00",
        "description": "When the year began, Sony announced cancellations for multiple live-service projects, including those from Bluepoint Games and Bend Studio. Which is when everyone learned that Bluepoint, renowned for Demon's Souls remake, had wasted its last several years. On the WB Games side, servers for Suicide Squad: Kill the Justice League and MultiVersus had shut down with little attention and pity. Electronic Arts would also announce that it's shutting down servers for Anthem, which is the first reminder in a while that it still exists. Microsoft's Halo Infinite recently entered maintenance mode, a far cry from plans to become the initially promised “start of the next ten years of Halo.” \n\nOf course, even newer titles weren't safe. Remedy's FBC: Firebreak debuted disappointingly, resulting in heavy losses and the studio's CEO stepping down. Even on a smaller scale, games like Wildgate and Jump Space, despite launching with some positive buzz, have since fallen by the wayside in player counts. G",
        "id": 4369757,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=7HIpODV3LWU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7HIpODV3LWU/hqdefault.jpg",
        "title": "Remember When They Said Single Player Games Were Dead? Look At Them Now.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T10:43:19.852864+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T09:30:00+00:00",
        "description": "With 2025 finally in the books and offering another strong year of gaming, it's time to look to 2026, starting with January. Granted, it doesn't offer the heftiest triple-A, but there are some promising titles, from psychological horror and a brand-new Trails game to a free-to-play fighter and that one game everyone hated to see close The Game Awards. Without further ado, let's dive in, starting with...",
        "id": 4368299,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=d83xKf-chC4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/d83xKf-chC4/hqdefault.jpg",
        "title": "15 BIG Games Launching In January 2026",
        "vote": 0
    }
]