[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T22:36:10.745855+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T21:34:00+00:00",
        "description": "\"Yet another distro is making the move to the KDE Plasma desktop,\" writes Linux magazine. \n\n\"Parrot OS, a security-focused Linux distribution, is migrating from MATE to KDE Plasma, starting with version 7.0, now available in beta.\"\n\n\nBased on Debian 13, Parrot OS's goal is a shift toward \"modernization, focusing on clearing technical debt and future-proofing the system.\" One big under-the-hood change is that the/tmpdirectory is now automatically mounted astmpfs(in RAM), as opposed to the physical drive. By making this change, Parrot OS enjoys improved performance and reduces wear on SSDs. This shift also means that all data in/tmpis lost during a reboot. \n\nParrotOS senior systems engineer Dario Camonita explains the change in a blog post, calling it \"not only aesthetic, but also in terms of usability and greater consistency with our future goals...\" \n\n\n\"While MATE will continue to be supported by us as long as upstream development continues, We have noticed and observed the continuous",
        "id": 4371771,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/20/2059205/parrot-os-switches-to-kde-plasma-desktop",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Parrot OS Switches to KDE Plasma Desktop",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T21:33:30.936743+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T20:34:00+00:00",
        "description": "During a search for the Brown shoogin suspect, a law enforcement press conference included a request for \"Ring camera footage from residents and businesses near Brown University,\" according to local news reports. \n\nBut in the end it was Flock cameras according to an article in Gizmodo, after a Reddit poster described seeing \"odd\" behavior of someone who turned out to be the suspect:\n\n\n\n\nThe original Reddit poster, identified only as John in the affidavit, contacted police the next day and came in for an interview. He told them about his odd encounter with the suspect, noting that he was acting suspiciously by not having appropriate cold-weather clothes on when he saw him in a bathroom at Brown University. That was two hours before the shooting. After spotting him in the bathroom wearing a mask, John actually started following the suspect in what he called a \"game of cat and mouse....\" Police detectives showed John two images obtained through Flock, the company that's built extensive s",
        "id": 4371550,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/20/1940214/flock-executive-says-their-camera-helped-find-shooting-suspect-addresses-privacy-concerns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Flock Executive Says Their Camera Helped Find Shooting Suspect, Addresses Privacy Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T20:33:01.677789+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T19:34:00+00:00",
        "description": "An anonymous reader shared this report from the Washington Post. (Alternate URL here):\n\nThe American patrol satellite had the targets in its sights: two recently launched Chinese spacecraft flying through one of the most sensitive neighborhoods in space. Like any good tactical fighter, the American spacecraft, known as USA 270, approached from behind, so that the sun would be at its back, illuminating the quarry. \nBut then one of the Chinese satellites countered by slowing down. As USA 270 zipped by, the Chinese satellite dropped in behind its American pursuer, like Maverick's signature \"hit-the-brakes\" move in the movie \"Top Gun.\" The positions reversed, U.S. officials controlling their spacecraft from Earth were forced to plot their next move. The encounter some 22,000 miles above Earth in 2022 was never acknowledged publicly by the Pentagon or Beijing. Happening out of sight and little noticed except by space and defense specialists, this kind of orbital skirmishing has become so c",
        "id": 4371251,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/20/0418259/military-satellites-now-maneuver-watch-each-other-and-monitor-signals-and-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Military Satellites Now Maneuver, Watch Each Other, and Monitor Signals and Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T19:30:58.860345+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T18:34:00+00:00",
        "description": "A reporter at Mother Jones writes about a $169 alarm clock with special lighting and audio effects. But to use the features, \"you need to pay an additional $4.99 per month, in perpetuity.\" \n\n\"Welcome to the age of subscription captivity, where an increasing share of the things you pay for actually own you.\"\n\nWhat vexes me are the companies that sell physical products for a hefty, upfront fee and subsequently demand more money to keep using items already in your possession. This encompasses those glorified alarm clocks, but also: computer printers, wearable wellness devices, and some features on pricey new cars. \n\nSubscription-based business models are great for businesses because they amount to consistent revenue streams. They're often bad for consumers for the same reason: You have to pay companies, consistently. We're effectively being $5 per month-ed (or more) to death, and it's only going to get worse. Industry research suggests the average customer spent $219 per month on subscri",
        "id": 4370917,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/20/0754203/subscription-captivity-when-things-you-buy-own-you",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Subscription Captivity': When Things You Buy Own You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T18:28:38.155895+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T17:34:00+00:00",
        "description": "In 2023 Slashdot covered a battery-swapping startup that promised to give EVs a full charge in about the same time it takes to fill a tank of gas. \n\nThey just filed for bankruptcy, reports Inc:\n\n\nAmple was founded in 2014 with a goal of \"solving slow charging times and infrastructure incompatibility\" for commercial EV fleets such as those in logistics, ride-hailing, and delivery, the filing states. To-date, Ample has raised more than $330 million across five rounds of funding to finance research and development and deployment. Rather than tackling fast charging, its strategy involved developing \"fully autonomous modular battery swapping,\" capable of delivering a fully charged battery in just five minutes. The technology requires purpose-built \"Ample stations\" that look a little like carwashes. A car is guided into the bay and elevated on a platform. A robot then identifies the location of a car's battery module, removes it, and replaces it with a charged module, Canary Media reported.",
        "id": 4370619,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/20/0733202/ev-battery-swapping-startup-that-raised-330-million-files-for-bankruptcy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EV Battery-Swapping Startup That Raised $330 Million Files for Bankruptcy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T17:26:29.952522+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T16:34:00+00:00",
        "description": "An anonymous reader shared this report from 9to5Linux:\n\nAfter the controversial news shared earlier this week by Mozilla's new CEO that Firefox will evolve into \"a modern AI browser,\" the company now revealed it is working on an AI kill switch for the open-source web browser... \n\n\n\nWhat was not made clear [in Tuesday's comments by new Mozilla CEO Anthony Enzor-DeMeo] is that Firefox will also ship with an AI kill switch that will let users completely disable all the AI features that are included in Firefox. Mozilla shared this important update earlier Thursday to make it clear to everyone that Firefox will still be a trusted web browser.... \"...that's how seriously and absolutely we're taking this,\" said Firefox developer Jake Archibald on Mastodon. \n\n\nIn addition, Jake Archibald said that all the AI features that are or will be included in Firefox will also be opt-in. \"I think there are some grey areas in what 'opt-in' means to different people (e.g. is a new toolbar button opt-in?),",
        "id": 4370289,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/20/0643217/firefox-will-ship-with-an-ai-kill-switch-to-completely-disable-all-ai-features",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Firefox Will Ship With an 'AI Kill Switch' To Completely Disable All AI Features",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T16:24:11.591102+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T15:34:00+00:00",
        "description": "\"Super PAC aims to drown out AI critics in midterms,\" the Washington Post reported in August, noting its intial funding over $100 million from \"some of Silicon Valley's most powerful investors and executives\" including OpenAI president Greg Brockman, his wife, and VC firm Andreessen Horowitz. The group's goal was \"to quash a philosophical debate that has divided the tech industry on the risk of artificial intelligence overpowering humanity,\" according to the article &mdash; and to support \"pro-AI\" candidates in America's next election in November of 2026 and \"oppose candidates perceived as slowing down AI development.\" \n\n\nTheir first target? State assemblyman Alex Bores, now running to be a U.S. representative. While in the state legislature Bores sponsored a bill that would \"require large AI companies to publish safety data on their technology,\" notes the Washington Post. So the attack ad charges that Bores \"wants Albany bureaucrats regulating AI,\" excoriating him for sponsoring a bi",
        "id": 4369936,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/12/20/0259228/pro-ai-group-launches-first-of-many-attack-ads-for-us-election",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pro-AI Group Launches First of Many Attack Ads for US Election",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T10:11:05.571945+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T10:00:00+00:00",
        "description": "echo123 shares a report from PBS: The Trump administration is dismantling the National Center for Atmospheric Research in Colorado, moving to dissolve a research lab that a top White House official described as \"one of the largest sources of climate alarmism in the country.\" White House budget director Russ Vought criticized the lab in a social media post Tuesday night and said a comprehensive review of the lab is underway. \"Vital activities such as weather research will be moved to another entity or location, Vought said.\n \nThe research lab, which houses the largest federal research program on climate change, supports research to predict, prepare for and respond to severe weather and other natural disasters. The research lab is managed by a nonprofit consortium of more than 130 colleges and universities on behalf of the National Science Foundation. A senior White House official cited two instances of the lab's \"woke direction\" that wastes taxpayer funds on what the official called fr",
        "id": 4368154,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/19/2336215/trump-dismantling-national-center-for-atmospheric-research-in-colorado",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Dismantling National Center For Atmospheric Research In Colorado",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T08:04:26.388374+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T07:00:00+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Space.com: Astronomers have made a truly mind-boggling discovery using the James Webb Space Telescope (JWST): a runaway black hole 10 million times larger than the sun, rocketing through space at a staggering 2.2 million miles per hour (1,000 kilometers per second). That not only makes this the first confirmed runaway supermassive black hole, but this object is also one of the fastest-moving bodies ever detected, rocketing through its home, a pair of galaxies named the \"Cosmic Owl,\" at 3,000 times the speed of sound at sea level here on Earth. If that isn't astounding enough, the black hole is pushing forward a literal galaxy-sized \"bow-shock\" of matter in front of it, while simultaneously dragging a 200,000 light-year-long tail behind it, within which gas is accumulating and triggering star formation. \"It boggles the mind!\" discovery team leader Pieter van Dokkum of Yale University told Space.com. \"The forces that are needed to di",
        "id": 4367721,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/19/2330204/james-webb-space-telescope-confirms-1st-runaway-supermassive-black-hole",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "James Webb Space Telescope Confirms 1st 'Runaway' Supermassive Black Hole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T03:57:29.673287+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Search Engine Land: Google said today that it is suing SerpApi, accusing the company of bypassing security protections to scrape, harvest, and resell copyrighted content from Google Search results. The allegations: Google said SerpApi:\n \n-Circumvented Google's security measures and industry-standard crawling controls.\n-Ignored website directives that specify whether content can be accessed.\n-Used cloaking, rotating bot identities, and large bot networks to scrape content at scale.\n-Took licensed content from Search features, including images and real-time data, and resold it for profit.\n \nWhat Google is saying. \"Stealthy scrapers like SerpApi override [crawling] directives and give sites no choice at all,\" Google wrote, calling the alleged scraping \"brazen\" and \"unlawful.\" Google said SerpApi's activity \"increased dramatically over the past year.\" [...] If Google wins, reliable SERP data could become harder to get, more expensive, or both -- es",
        "id": 4366945,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/19/2317247/google-sues-serpapi-over-scraping-and-reselling-search-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Sues SerpApi Over Scraping and Reselling Search Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T01:56:23.099020+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T01:40:00+00:00",
        "description": "Airbus is preparing to tender a major contract to move mission-critical systems like ERP, manufacturing, and aircraft design data onto a digitally sovereign European cloud, citing national security concerns and fears around U.S. extraterritorial laws like the CLOUD Act. \"I need a sovereign cloud because part of the information is extremely sensitive from a national and European perspective,\" Catherine Jestin, Airbus's executive vice president of digital, told The Register. \"We want to ensure this information remains under European control.\" The Register reports: The driver is access to new software. Vendors like SAP are developing innovations exclusively in the cloud, pushing customers toward platforms like S/4HANA. The request for proposals launches in early January, with a decision expected before summer. The contract -- understood to be worth more than 50 million euros -- will be long term (up to ten years), with price predictability over the period. [...] Jestin is waiting for Eur",
        "id": 4366555,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/19/2252254/airbus-moving-critical-systems-away-from-aws-google-and-microsoft-citing-data-sovereignty-concerns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Airbus Moving Critical Systems Away From AWS, Google, and Microsoft Citing Data Sovereignty Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T01:56:23.475146+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T01:00:00+00:00",
        "description": "Elite computer science degrees are no longer a guaranteed on-ramp to tech jobs, as AI-driven coding tools slash demand for entry-level engineers and concentrate hiring around a small pool of already \"elite\" or AI-savvy developers. The Los Angeles Times reports: \"Stanford computer science graduates are struggling to find entry-level jobs\" with the most prominent tech brands, said Jan Liphardt, associate professor of bioengineering at Stanford University. \"I think that's crazy.\" While the rapidly advancing coding capabilities of generative AI have made experienced engineers more productive, they have also hobbled the job prospects of early-career software engineers. Stanford students describe a suddenly skewed job market, where just a small slice of graduates -- those considered \"cracked engineers\" who already have thick resumes building products and doing research -- are getting the few good jobs, leaving everyone else to fight for scraps.\n \n\"There's definitely a very dreary mood on ca",
        "id": 4366556,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/19/236259/stanford-computer-science-grads-find-their-degrees-no-longer-guarantee-jobs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Stanford Computer Science Grads Find Their Degrees No Longer Guarantee Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T00:54:21.188489+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T00:20:00+00:00",
        "description": "An independent review found that at least ten technical and process failures during a routine firewall upgrade at Australia's Optus prevented emergency calls from reaching Triple Zero for 14 hours, during which 455 calls failed and two callers died. The Register reports: On Thursday, Optus published an independent report (PDF) on the matter written by Dr Kerry Schott, an Australian executive who has held senior management roles at many of the country's most significant businesses. The report found that Optus planned 18 firewall upgrades and had executed 15 without incident. But on the 16th upgrade, Optus issued incorrect instructions to its outsourced provider Nokia. [...] Schott summarized the incident as follows: \"Three issues are clear during this incident. The first is the very poor management and performance within [Optus] Networks and their contractor, Nokia. Process was not followed, and incorrect procedures were selected. Checks were inadequate, controls avoided and alerts giv",
        "id": 4366301,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/19/2241221/ten-mistakes-marred-firewall-upgrade-at-australian-telco-contributing-to-two-deaths",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ten Mistakes Marred Firewall Upgrade At Australian Telco, Contributing To Two Deaths",
        "vote": 0
    }
]