[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T17:52:01.128980+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T17:00:07+00:00",
        "description": "This session recorded at Unreal Fest Stockholm showcases a real-time simulation system developed in Unreal Engine and designed to be externally controlled via a web-based interface. \n\nLearn how to integrate and manage native third-party libraries in Unreal Engine and implement thread-safe, high-performance messaging; explore strategies to dynamically access, modify, and monitor hundreds of UPROPERTY-based variables; see how to design modular state machines that manage Redis/HTTP data routing and session lifecycle; and gain insight into building heartbeat-driven awareness systems to connect Unreal Engine with web-based clients.\n\nThis session offers deep insight into structuring scalable, connected Unreal Engine projects that extend beyond the engine’s boundaries.\n\nLearn more about Unreal Engine here: unrealengine.com\n\n#Simulation, #UnrealEngine, #UE5, #UnrealFestStockholm",
        "id": 4370413,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2uOMnTLK44w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 1,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2uOMnTLK44w/hqdefault.jpg",
        "title": "Unreal Engine as the Heart of a Real-time, Web-controlled Simulator | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-20T15:45:54.898085+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-20T15:00:37+00:00",
        "description": "The amount of work you can accomplish as an individual with a fashion brand or digital fashion aspirations is immense—and more accessible than ever. As a digital fashion designer, whether established or aspiring, you don’t have to rely on large teams or expensive tools to tell the full story behind your designs. \n\nIn this beginner-friendly session recorded at Unreal Fest Stockholm, Zoe Anna Vanezis of Central Saint Martins college explores how Unreal Engine (and other free, easily available tools) can empower you to take your digitized garments and create rich, immersive narratives around them. \n\nAll the ideas that go into your design—story, context, emotion—can be fully visualized and brought to life. Find out how simple it is to bring your fashion looks into dynamic environments on MetaHumans animated with motion capture, and ultimately showcase your work in ways that once seemed out of reach. \n\nWhether you're a student, educator, or industry professional, you’ll come away with a cl",
        "id": 4369736,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GbwH5Q7VFWQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GbwH5Q7VFWQ/hqdefault.jpg",
        "title": "First Steps for Fashion Designers | Unreal Fest Stockholm 2025",
        "vote": 0
    }
]