[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T23:41:13+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: HP will acquire assets from Humane, the maker of a wearable Ai Pin introduced in late 2023, for $116 million. The deal will include the majority of Humane's employees in addition to its software platform and intellectual property, the company said Tuesday. It will not include Humane's Ai pin device business, which will be wound down, an HP spokesperson said. Humane's team, including founders Imran Chaudhri and Bethany Bongiorno, will form a new division at HP to help integrate artificial intelligence into the company's personal computers, printers and connected conference rooms, said Tuan Tran, who leads HP's AI initiatives. Chaudhri and Bongiorno were design and software engineers at Apple before founding the startup. [...]\n \nTran said he was particularly impressed with aspects of Humane's design, such as the ability to orchestrate AI models running both on-device and in the cloud. The deal is expected to close at the end of the mo",
        "id": 2143929,
        "language": null,
        "link": "https://slashdot.org/story/25/02/18/2245242/hp-to-acquire-parts-of-humane-shut-down-the-ai-pin?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "HP To Acquire Parts of Humane, Shut Down the AI Pin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T23:41:13+00:00",
        "description": "Christoph Hellwig continues to voice strong opposition to Rust in the Linux kernel, arguing that its introduction creates fragmentation, unclear language guidelines, and additional burdens on maintainers. He also says Linus Torvalds has privately stated he will override objections to Rust code, effectively making its adoption inevitable. Phoronix's Michael Larabel has the latest: The latest on Hellwig's perspective of Rust code within the Linux kernel is below. Some interesting insight from a dissenting view. The thread in full can be found on the Rust for Linux mailing list.\n \n[Here's an excerpt from the thread:] \"I don't think having a web page in any form is useful. If you want it to be valid it has to be in the kernel tree and widely agreed on. It also states factually incorrect information. E.g. 'Some subsystems may decide they do not want to have Rust code for the time being, typically for bandwidth reasons. This is fine and expected.' while Linus in private said that he absolu",
        "id": 2143930,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/02/18/227222/linus-torvalds-would-reportedly-merge-rust-kernel-code-over-maintainer-objections?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linus Torvalds Would Reportedly Merge Rust Kernel Code Over Maintainer Objections",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T22:36:15+00:00",
        "description": "An anonymous reader shares a report: U.S. personal injury law firm Morgan &amp; Morgan sent an urgent email this month to its more than 1,000 lawyers: Artificial intelligence can invent fake case law, and using made-up information in a court filing could get you fired. A federal judge in Wyoming had just threatened to sanction two lawyers at the firm who included fictitious case citations in a lawsuit against Walmart. One of the lawyers admitted in court filings last week that he used an AI program that \"hallucinated\" the cases and apologized for what he called an inadvertent mistake. \n\nAI's penchant for generating legal fiction in case filings has led courts around the country to question or discipline lawyers in at least seven cases over the last two years, and created a new high-tech headache for litigants and judges, Reuters found. The Walmart case stands out because it involves a well-known law firm and a big corporate defendant. But examples like it have cropped up in all kinds",
        "id": 2143556,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/18/2147200/ai-hallucinations-in-court-papers-spell-trouble-for-lawyers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI 'Hallucinations' in Court Papers Spell Trouble For Lawyers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T22:36:15+00:00",
        "description": "An anonymous reader quotes a report from Gizmodo: Protector, an app that lets you book armed goons the same way you'd call for an Uber, is having a viral moment. The app started doing the rounds on social media after consultant Nikita Bier posted about it on X. Protector lets the user book armed guards on demand. Right now it's only available in NYC and LA. According to its marketing, every guard is either \"active duty or retired law enforcement and military.\" Every booking comes with a motorcade and users get to select the number of Escalades that'll be joining them as well as the uniforms their hired goons will wear.\n \nProtector is currently \"#7 in Travel\" on Apple's App Store. It's not available for people who use Android devices. [...] The marketing for Protector, which lives on its X account, is surreal. A series of robust and barrel-chested men in ill-fitting black suits deliver their credentials to the camera while sitting in front of a black background. They're all operators.",
        "id": 2143555,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/18/2150212/uber-for-armed-guards-rushes-to-market?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Uber For Armed Guards' Rushes To Market",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T20:26:13+00:00",
        "description": "Public interest groups on Tuesday asked the full 6th U.S. Circuit Court of Appeals to reconsider a ruling that the Federal Communications Commission lacked legal authority to reinstate landmark net neutrality rules. From a report: The decision by a three-judge panel blocked the FCC under then President Joe Biden that had sought to reinstate the open internet rules implemented in 2015 but later repealed by the agency under President Donald Trump. The groups -- Free Press, Public Knowledge, Open Technology Institute and the Benton Institute for Broadband &amp; Society -- argue the appeals court decision conflicts with an earlier decision by another court. \n\nThe groups said the case centers on the FCC's decades-long effort to prevent broadband internet providers \"from abusing their gatekeeping power, in furtherance of the providers' economic or political interests, to constrain their users' access to third-party websites.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a c",
        "id": 2142764,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/18/205226/groups-ask-us-court-to-reconsider-ruling-blocking-net-neutrality-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Groups Ask US Court To Reconsider Ruling Blocking Net Neutrality Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T19:21:07+00:00",
        "description": "Lloyds Banking Group is assessing the skills of thousands of technology staffers in the UK to determine whether they can keep working at the bank once it upgrades its technology [alternative source]. Bloomberg: The British lender, which is carrying out a multiyear overhaul of its systems, put these workers on notice this month that they are at risk of losing their jobs and will be required to reapply for new positions across the bank, according to people familiar with the matter. In a company town hall last week, executives informed those staffers that they were in the process of assessing their technical skills based on a test they took last year to determine where, if anywhere, they can be placed within Lloyds, the people said, asking not to be named discussing non-public information.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lloyds+Is+Auditing+Thousands+of+IT+Staffers'+Technical+Skills%3A+https%3A%2F%2Fit.s",
        "id": 2142238,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/18/1722255/lloyds-is-auditing-thousands-of-it-staffers-technical-skills?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lloyds Is Auditing Thousands of IT Staffers' Technical Skills",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T18:16:08+00:00",
        "description": "A new report released by Cisco finds that 97% of CEOs surveyed are planning AI integration. Similarly, 92% of companies recently surveyed by McKinsey plan to invest more in generative AI over the next three years. Fortune: To that end, many companies are seeking tech-savvy finance talent, according to a new report by software company Datarails. The researchers analyzed 6,000 job listings within the CFO's office -- CFO, controller, financial planning and analysis (FP&amp;A), and accountant -- advertised on job search websites including LinkedIn, Glassdoor, Indeed, Job2Careers, and ZipRecruiter. \n\nOf the 1,000 job listings for CFOs in January 2025, 27% included AI in the job description. This compares to 8% mentions of AI in 1,000 CFO job listings at the same time last year. Take, for example, Peaks Healthcare Consulting which required a CFO candidate to \"continuously learn and integrate AI to improve financial processes and decision making,\" Datarails notes in the report. Regarding FP",
        "id": 2141695,
        "language": null,
        "link": "https://slashdot.org/story/25/02/18/1718255/27-of-job-listings-for-cfos-now-mention-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "27% of Job Listings For CFOs Now Mention AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T18:16:08+00:00",
        "description": "Chinese AI startup DeepSeek has updated its business registry information with key changes to personnel and operational scope, signaling a shift towards monetizing its cost-efficient-yet-powerful large language models. From a report: The Hangzhou-based firm's updated business scope includes \"internet information services,\" according to business registry service Tianyancha. The move is the first sign of DeepSeek's desire to monetise its popular technology, according to Zhang Yi, founder and chief analyst at consultancy iiMedia. \n\nWith eyes on developing a business model, DeepSeek intends to shift away from being purely focused on research and development, Zhang added. \"The move reflects that for a company like DeepSeek, which managed to accumulate technology and develop a product, monetisation is becoming a necessary next step,\" Zhang said. DeepSeek's previous business scope said it engages in engineering and AI software development, among others, hinting at a more research-driven app",
        "id": 2141696,
        "language": null,
        "link": "https://slashdot.org/story/25/02/18/1634218/deepseek-expands-business-scope-in-potential-shift-towards-monetization?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DeepSeek Expands Business Scope in Potential Shift Towards Monetization",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T17:11:02+00:00",
        "description": "An anonymous reader shares a report: Later this month, Intuitive Machines, the private company behind the first commercial lander that touched down on the moon, will launch a second lunar mission from NASA's Kennedy Space Center. The plan is to deploy a lander, a rover, and hopper to explore a site near the lunar south pole that could harbor water ice, and to put a communications satellite on lunar orbit. But the mission will also bring something that's never been installed on the moon or anywhere else in space before -- a fully functional 4G cellular network. \n\nPoint-to-point radio communications, which need a clear line of sight between transmitting and receiving antennas, have always been a backbone of both surface communications and the link back to Earth, starting with the Apollo program. Using point-to-point radio in space wasn't much of an issue in the past because there never have been that many points to connect. Usually, it was just a single spacecraft, a lander, or a rover",
        "id": 2141206,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/18/1616239/nokia-is-putting-the-first-cellular-network-on-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nokia is Putting the First Cellular Network On the Moon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T17:11:02+00:00",
        "description": "SCMP: Chinese scientists have developed a revolutionary repair technology that could make lithium-ion batteries last over six times longer. Announcing their discovery in the journal Nature on Wednesday, the researchers said this low-cost, eco-friendly technology could soon be ready to enter the market. \n\nThe batteries are key for many modern technologies, from smartphones to electric vehicles. However, as these batteries age, they often become less efficient -- a process that cold weather accelerates. The researchers said they could counter this problem with the \"injection\" of a special solution to rejuvenate \"sick\" batteries. At present, lithium-ion batteries rely on sophisticated materials used to generate lithium ions -- whose movement through electrolyte is key to their performance -- and then protect them to ensure a decent lifespan. \n\nTypically these lithium ions move from the positive terminal to the negative when the battery is charging, a process which is then reversed when ",
        "id": 2141207,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/18/166204/scientists-develop-injection-to-make-smartphone-and-ev-batteries-last-longer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Develop 'Injection' To Make Smartphone and EV Batteries Last Longer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T16:06:00+00:00",
        "description": "A new family of superconductors is exciting physicists. Compounds containing nickel have been shown to carry electricity without resistance at the relatively high temperature of 45 kelvin (-228C) -- and without being squeezed under pressure. Nature: Physicists at the Southern University of Science and Technology (Sustech) in Shenzhen, China, observed the major hallmarks of superconductivity in a thin film of crystals of nickel oxide, which they grew in the laboratory. They published their work in Nature on 17 February. \"There's a huge hope that we could eventually raise the critical temperature and make [such materials] more useful for applications,\" says Dafeng Li, a physicist at the City University of Hong Kong. \n\nNickelates now join two groups of ceramics -- copper-based cuprates and iron-based pnictides -- as 'unconventional superconductors' that operate at room pressure and temperatures as high as 150K (-123C). This new data point could help physicists to finally explain how hig",
        "id": 2140598,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/18/1535250/unconventional-nickel-superconductor-excites-physicists?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Unconventional' Nickel Superconductor Excites Physicists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T15:01:19+00:00",
        "description": "Acer will raise laptop prices in the United States by 10% next month due to Trump administration tariffs on Chinese imports, CEO Jason Chen said. \"We will have to adjust the end user price to reflect the tariff,\" Chen said. \"We think 10 percent probably will be the default price increase because of the import tax.\" \n\nThe Taiwan-based company, the fifth-largest computer seller in the U.S. market behind HP, Dell, Lenovo and Apple, could add hundreds of dollars to its high-end laptops that cost up to $3,700. Chen said Acer is exploring manufacturing options outside China, including possible U.S. production. The company has already moved desktop computer assembly out of China following earlier 25% tariffs during Trump's first term. The 10% tariff imposed this month affects nearly 80% of U.S. laptop imports from China.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Acer+To+Raise+US+Laptop+Prices+10%25+After+Tariffs%3A+h",
        "id": 2139996,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/18/1451205/acer-to-raise-us-laptop-prices-10-after-tariffs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Acer To Raise US Laptop Prices 10% After Tariffs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T15:01:19+00:00",
        "description": "India's Tata Consultancy Services allegedly manipulated U.S. visa programs by falsifying management credentials for foreign workers, according to lawsuits and federal data obtained by Bloomberg News. TCS, India's largest IT services firm, received upwards of 6,500 L-1A visas for managers from October 2019 through September 2023, more than the next seven largest recipients combined. In contrast, TCS categorized fewer than 600 of its 31,000 U.S.-based employees as executives and managers in a 2022 federal report. \n\nFormer TCS manager Anil Kini alleged in a lawsuit that in January 2017, a senior manager ordered him to alter organizational charts to hide discrepancies for employees without management responsibilities. The Equal Employment Opportunity Commission found \"credible documentary evidence\" that TCS \"frequently falsifies documents in support of L-1 visa applications,\" according to a 2019 letter. L-1A visas for managers, unlike H-1B visas, have no pay requirements or caps. \n\nTCS h",
        "id": 2139997,
        "language": null,
        "link": "https://slashdot.org/story/25/02/18/141245/former-staffers-say-indias-biggest-it-firm-was-gaming-the-us-visa-system?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Former Staffers Say India's Biggest IT Firm Was Gaming the US Visa System",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T12:50:54+00:00",
        "description": "PAjamian writes: Two years ago Red Hat announced an end to its public source code availability. This caused a great deal of outcry from the Enterprise Linux community at large. Since then many have waited for a statement from the Free Software Foundation concerning their stance on the matter. Now, nearly two years later the FSF has finally responded to questions regarding their stance on the issue with the following statement: Generally, we don't agree with what Red Hat is doing. Whether it constitutes a violation of the GPL would require legal analysis and the FSF does not give legal advice. However, as the stewards of the GNU GPL we can speak how it is intended to be applied and Red Hat's approach is certainly contrary to the spirit of the GPL. This is unfortunate, because we would expect such flagship organizations to drive the movement forward. When asked if the FSF would be willing to intervene on behalf of the community they had this to say:As of today, we are not aware of any ",
        "id": 2139082,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/02/18/0953205/free-software-foundation-speaks-up-against-red-hat-source-code-announcement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Free Software Foundation Speaks Up Against Red Hat Source Code Announcement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T10:40:49+00:00",
        "description": "Former PlayStation executive Shuhei Yoshida has attributed the current wave of video game industry layoffs and slowdown to companies overextending during the COVID-19 pandemic. \"I think it's an overreaction to the COVID situation. Companies invested too much, including ourselves. Then we had to face reality and make adjustments,\" Yoshida told VentureBeat in an interview. \n\nYoshida, who left Sony in January after 31 years at PlayStation, suggested the industry's growth would have been more stable without the pandemic-driven surge. \"If you take out the COVID years you'd have smoother growth over the years,\" he said. Yoshida's comments come amid widespread job cuts across the gaming sector, including at Sony, Microsoft, Epic Games, and other major publishers following a post-pandemic decline in gaming engagement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=PlayStation+Veteran+Blames+Gaming+Industry+Slump+on+Pandemi",
        "id": 2138278,
        "language": null,
        "link": "https://games.slashdot.org/story/25/02/18/0949207/playstation-veteran-blames-gaming-industry-slump-on-pandemic-overexpansion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "PlayStation Veteran Blames Gaming Industry Slump on Pandemic Overexpansion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T08:31:00+00:00",
        "description": "xAI has launched Grok 3, the latest iteration of its large language model, alongside new capabilities for its iOS and web applications. The model has been trained on approximately 200,000 GPUs in a Memphis data center, representing what CEO Elon Musk claims is a tenfold increase in computing power compared to its predecessor. \n\nThe new release introduces two specialized variants: Grok 3 Reasoning and Grok 3 mini Reasoning, designed to methodically analyze problems similar to OpenAI's o3-mini and DeepSeek's R1 models. According to xAI's benchmarks, Grok 3 outperforms GPT-4o on several technical evaluations, including AIME for mathematical reasoning and GPQA for PhD-level science problems. \n\nA notable addition is the DeepSearch feature, which combs through web content and X posts to generate research summaries. The platform will be available through X's Premium+ subscription and a new SuperGrok tier ($30/month or $300/year), with the latter offering enhanced reasoning capabilities and ",
        "id": 2137693,
        "language": null,
        "link": "https://slashdot.org/story/25/02/18/0711226/xai-releases-its-latest-flagship-model-grok-3?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "xAI Releases Its Latest Flagship Model, Grok 3",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T07:25:44+00:00",
        "description": "Mexico has threatened legal action against Google after the tech company refused to fully restore the name Gulf of Mexico on its mapping service, escalating a dispute sparked by U.S. President Donald Trump's move to rename the body of water. Google Maps currently displays the water body as Gulf of America within U.S. territory, Gulf of Mexico within Mexican borders, and Gulf of Mexico (Gulf of America) elsewhere, according to a letter from Google vice president Cris Turner to Mexican President Claudia Sheinbaum. \n\nMexico argues the policy violates its sovereignty since the U.S. controls only 46% of the gulf, while Mexico and Cuba control 49% and 5% respectively. The historic name Gulf of Mexico, dating to 1607, is recognized by the United Nations. The dispute has strained U.S.-Mexico relations, with the White House barring Associated Press reporters from events over the news agency's naming policy.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"",
        "id": 2137151,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/18/0252258/mexico-threatens-to-sue-google-over-gulf-renaming?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mexico Threatens To Sue Google Over Gulf Renaming",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T07:25:44+00:00",
        "description": "NAND flash prices are expected to slide due to oversupply, forcing memory chipmakers to cut production to match lower-than-expected orders from PC and smartphone manufacturers. From a report: The superabundance of stock is putting a financial strain on suppliers of NAND flash, according to TrendForce, which says growth rate forecasts are being revised down from 30 percent to 10-15 percent for 2025. \n\n\"NAND flash manufacturers have adopted more decisive production cuts, scaling back full-year output to curb bit supply growth. These measures are designed to swiftly alleviate market imbalances and lay the groundwork for a price recovery,\" TrendForce stated. \n\nShrish Pant, Gartner director analyst and technology product leader, expects NAND flash pricing to remain weak for the first half of 2025, though he projects higher bit shipments for SSDs in the second half due to continuing AI server demand. \n\n\"Vendors are currently working tirelessly to discipline supply, which will lead to price",
        "id": 2137150,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/18/0348230/nand-flash-prices-plunge-amid-supply-glut-factory-output-cut?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NAND Flash Prices Plunge Amid Supply Glut, Factory Output Cut",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T07:25:44+00:00",
        "description": "SanDisk aims to produce petabyte-scale SSDs through its new UltraQLC platform, though the company has not specified a release timeline. The technology, it said, combines SanDisk's BICS 8 QLC 3D NAND with a proprietary 64-channel controller featuring hardware accelerators that offload storage functions from firmware to reduce latency and improve reliability. \n\nThe initial UltraQLC drives will use 2Tb NAND chips to reach 128TB capacities, with future iterations targeting 256TB, 512TB, and eventually 1PB as higher-density NAND becomes available. The controller dynamically adjusts power based on workload and employs an advanced bus multiplexer to handle increased data loads from high-density QLC stacks, the company said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sandisk+Puts+Petabyte+SSDs+On+the+Roadmap%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F02%2F18%2F047217%2F%3Futm_source%3Dtwitter%26utm_medium%3D",
        "id": 2137149,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/18/047217/sandisk-puts-petabyte-ssds-on-the-roadmap?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sandisk Puts Petabyte SSDs On the Roadmap",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-18T07:25:44+00:00",
        "description": "Apps offering lifetime subscriptions may pose risks despite potential cost savings, according to cybersecurity experts and analysts. While some lifetime plans can pay off quickly - like dating app Bumble's $300 premium subscription that breaks even in five months - others require years of use to justify hefty upfront costs. Meditation app Waking Up charges $1,500 for lifetime access, requiring over 11 years of use to recoup the investment. \n\nSecurity researchers warn against lifetime subscriptions for services with high recurring costs like VPNs and cloud storage. Such providers may compromise user privacy or cut corners on infrastructure to offset losses, said Trevor Hilligoss, senior vice president at cybercrime research group SpyCloud Labs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=When+a+Lifetime+Subscription+Can+Save+You+Money+-+and+When+It's+Risky%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F02%2F18",
        "id": 2137152,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/18/0156241/when-a-lifetime-subscription-can-save-you-money---and-when-its-risky?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "When a Lifetime Subscription Can Save You Money - and When It's Risky",
        "vote": 0
    }
]