[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-28T20:18:27.121161+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-28T19:30:07+00:00",
        "description": "Coming from ex Rockstar veteran Leslie Benzies of Grand Theft Auto and Red Dead Redemption fame (among many others), MindsEye is obviously a game that has turned a few heads in the lead up to its release, but even now, with its launch right around the corner, we’re yet to be fully convinced about whether the game is going to be able to make a strong impression. \n\nNot only has it failed to actually show even glimpses of any of its supposed strengths, it has also not shown much that looks exceptional by any means. Even with some legitimately intriguing ideas, like its creation tools, MindsEye still has us a little skeptical.",
        "id": 2792930,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Hlg8arccjTI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Hlg8arccjTI/hqdefault.jpg",
        "title": "MindsEye STILL FEELS OFF, Even After the Latest Gameplay Reveal...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-28T15:56:01.130973+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-28T15:30:38+00:00",
        "description": "While the glory days of E3 are long over at this point, the coming month will be packed with publisher events that will put a spotlight on some of the biggest games of the near future. \n\nWe know that upcoming events like Summer Game Fest Showcase, Future Games Show Summer Showcase, Xbox Games Showcase, PC Gaming Show, and a rumored PlayStation State of Play are scheduled for next month, so it would prove to be a great opportunity to reveal what’s in store. With this feature, we will be discussing 30 such announcements that could be a part of these shows.",
        "id": 2790503,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ysyd1SQyMgM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ysyd1SQyMgM/hqdefault.jpg",
        "title": "30 MIND-BLOWING Game Announcements That Could Happen Next Month",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-28T14:50:25.162855+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-28T14:00:00+00:00",
        "description": "FromSoftware has always been known for its single-player titles, with many considering Elden Ring its magnum opus. And while it's dabbled in invasions and co-op for past titles, it's never really delivered an out-and-out multiplayer-focused title until Elden Ring Nightreign.\n\nThen again, it's never dabbled in the rogue-like format or incorporated battle royale-like elements in its games either. Coupled with the fact that Limveld is very reminiscent of Limgrave, right down to familiar locations, Nightreign feels like a mix of new, old, and \"hmm,\" especially for fans of the first game seeking another unforgettable odyssey in a fresh fantasy world.\n\nNevertheless, it blends these elements into a worthwhile combination of tense decision-making, intriguing build-crafting, and enjoyable team synergy. While there are some crashing issues and other elements that could use improving (or a significant overhaul), Elden Ring Nightreign offers a tense, challenging experience that will keep you comi",
        "id": 2789802,
        "language": null,
        "link": "https://www.youtube.com/watch?v=-HMwpEcbxB4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-HMwpEcbxB4/hqdefault.jpg",
        "title": "Elden Ring: Nightreign Review - The Final Verdict",
        "vote": 0
    }
]