[
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-28T20:12:30.725543+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-28T19:33:39+00:00",
        "description": "Linux Storage Server and NFS Advancements: Creating a High-Performance Standard for AI Workloads\n\nSponsored by Hammerspace\n\nThe increasing importance of AI in the enterprise has transformed the management, movement, and storage of unstructured data. Enterprises now require the high levels of storage performance and scale previously reserved for elite HPC and Hyperscale environments, as well as advanced data services to find, stage, and process the data needed for GenAI and inference workloads. \n\nThe problem is that AI workloads require high-performance access to datasets that are often distributed across existing on-prem and cloud-based storage silos, requiring performance levels traditional enterprise IT architectures are not designed for. \n\nBut within every enterprise data center there are Linux-based servers that already contain a series of high-performance enhancements that help accelerate existing IT environments to meet these challenges.\n\nWith an ongoing series of updates to the",
        "id": 2792847,
        "language": null,
        "link": "https://www.youtube.com/watch?v=focrkoXX-5U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/focrkoXX-5U/hqdefault.jpg",
        "title": "LF Live Webinar: Linux Storage Server and NFS Advancements",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-28T18:01:08.078686+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-28T17:07:21+00:00",
        "description": "The Linux Foundation recently unveiled its report, \"Pathways to Open Data,\" a comprehensive summary of insights gleaned from a challenge session at the World Open Innovation Conference. This report, discussed by Anna Hermansen, researcher and ecosystem manager at the Linux Foundation, delves into the unique complexities and profound benefits of open data, particularly as the demand for data escalates with the widespread adoption of AI technologies.",
        "id": 2791724,
        "language": null,
        "link": "https://www.youtube.com/watch?v=iR0Bm0V5BP0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iR0Bm0V5BP0/hqdefault.jpg",
        "title": "Pathways to Open Data: Navigating the AI Era with  Anna Hermansen",
        "vote": 0
    }
]