[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T20:10:45.858948+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T19:15:00+00:00",
        "description": "An anonymous reader shares a report: The European Union will deploy additional satellites in low Earth orbit to strengthen resilience against GPS interferences and will improve capabilities to detect it, EU Defence Commissioner Andrius Kubilius said on Monday. His remarks followed an incident on Sunday in which the GPS system aboard European Commission President Ursula von der Leyen's aircraft was jammed en route to Bulgaria. Bulgarian authorities suspect the jamming was due to due to interference by Russia, an EU spokesperson said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=EU+To+Boost+Satellite+Defences+Against+GPS+Jamming%2C+Defence+Commissioner+Says%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F01%2F1847244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org",
        "id": 3471261,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/01/1847244/eu-to-boost-satellite-defences-against-gps-jamming-defence-commissioner-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU To Boost Satellite Defences Against GPS Jamming, Defence Commissioner Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T18:57:07.126901+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T18:18:00+00:00",
        "description": "The century-old duty-free import exemption that transformed American online shopping has ended, The Atlantic argues, closing a loophole that allowed packages valued under $800 to enter the United States without tariffs. The de minimis threshold, raised from $200 in 2016, processed millions of daily shipments directly from overseas sellers to American consumers. \n\nChina lost access earlier this year; the exemption now terminates for all countries. Platforms including Shein, Temu, and marketplace sellers on Amazon, Etsy, and eBay built business models around direct shipping from manufacturing hubs in Asia and elsewhere. Import duties will apply to all international packages regardless of value, with tariffs reaching 50% for some countries. The policy shift affects everything from $30 specialty faucet parts shipped from Britain to handmade crafts from India, fundamentally altering the economics of cross-border e-commerce that emerged over the past decade.<p><div class=\"share_submission\" ",
        "id": 3470879,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/01/1818247/the-age-of-cheap-online-shopping-is-ending?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Age of Cheap Online Shopping is Ending",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T17:52:19.094382+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T17:15:00+00:00",
        "description": "An anonymous reader shares a report: Some Microsoft Azure customers have had a worrying few days after a problematic account migration caused forecast costs for the cloud service to skyrocket, triggering budget alerts. \n\nAn alarmed Register reader got in touch after receiving warnings from Azure's automated systems that they had significantly exceeded their budgets, and a glance at Microsoft's support forums indicates their issue was not isolated. \n\nThe problem was that costs had suddenly ramped up. One user, with a budget threshold of $85, received an automated alert indicating that their spend was forecast to reach $1,027. Another said: \"We're actively seeing the same issue, costs have blown up by a crazy amount. No official notice or announcement from Microsoft either, it's appalling.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Azure+Budget+Alerts+Go+Berserk+After+Microsoft+Account+Migration+Misfire%3A+https%",
        "id": 3470485,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/01/1621214/azure-budget-alerts-go-berserk-after-microsoft-account-migration-misfire?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Azure Budget Alerts Go Berserk After Microsoft Account Migration Misfire",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T16:47:24.520172+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T16:15:00+00:00",
        "description": "Americans are having a record low amount of sex -- even less than they did during the Covid-19 pandemic -- according to a new study led by researchers at the Institute for Family Studies. WSJ: This continues the downward shift in sexual activity that has been worrying sociologists and psychologists for decades. For the report, called \"The Sex Recession,\" researchers at the IFS analyzed the data on sex and intimacy in the latest General Social Survey produced by NORC at the University of Chicago, which was collected in 2024 and released in May. They found that just 37% of people age 18-64 reported having sex at least once a week, down from 55% in 1990. The decline is even more striking for young adults: Almost a quarter of people age 18-29, or 24%, said they had not had sex in the past year; this is twice as many as in 2010. \n\nMuch has been written in recent years about the trend of young people having less sex, attributed to everything from stunted social skills to a rise in internet ",
        "id": 3470093,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/01/1614253/americans-are-having-less-sex-than-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Americans Are Having Less Sex Than Ever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T15:37:38.334921+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T15:12:00+00:00",
        "description": "Waymo robotaxis are repeatedly selecting identical parking spots in front of specific Los Angeles and Arizona homes between rides, puzzling residents who document the same vehicles returning to precise locations daily. The company states its vehicles choose parking based on local regulations, existing vehicle distribution, and proximity to high-demand areas but cannot explain the algorithmic specificity. \n\nCarnegie Mellon autonomous vehicle expert Phil Koopman attributes the behavior to machine learning systems optimizing for specific spots without variation. Waymo said it had received neighbor complaints and has designated certain locations as no-parking zones for its fleet. The vehicles comply with three-hour parking limits, according to Los Angeles Department of Transportation regulations, governing commercial passenger vehicles under 22 feet.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='Why+Do+Waymos+Keep+Loi",
        "id": 3469585,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/01/1512223/why-do-waymos-keep-loitering-in-front-of-my-house?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Why Do Waymos Keep Loitering in Front of My House?'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T15:37:38.447349+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T14:03:00+00:00",
        "description": "A review of published meta-analyses examining protein supplementation found no evidence supporting intake beyond 1.6 grams per kilogram of body weight daily, according to an analysis by cardiologist Eric Topol. The review examined multiple randomized controlled trials encompassing thousands of participants. The most widely cited Morton study, which included 1,863 participants across 49 trials, showed no statistically significant benefit at higher protein levels, with a p-value of 0.079. \n\nRecent research from Washington University identified the essential amino acid leucine as activating mTOR in macrophages, promoting atherosclerosis progression. The mechanism was demonstrated in both mouse models and human studies measuring circulating monocyte changes following acute high-protein challenges increasing dietary protein from 22% to 50% of energy intake. Current USDA data indicates 55% of American men and 35% of women already exceed the 0.8 g/kg/day recommendation from the National Acad",
        "id": 3469586,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/01/143252/our-preoccupation-with-protein-intake?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Our Preoccupation With Protein Intake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T13:07:17.942965+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T11:34:00+00:00",
        "description": "PC Gamer reports:\n\nThe Diablo team is the next in line to unionize at Blizzard. Over 450 developers across multiple disciplines have voted to form a union under the Communications Workers of America (CWA), and they're now the fourth major Blizzard team to do so... A wave of unions have formed at Blizzard in the last year, including the World of Warcraft, Overwatch, and Story and Franchise Development teams. Elsewhere at Microsoft, Bethesda, ZeniMax Online Studios and ZeniMax QA testers have also unionized... \nThe CWA says over 3,500 Microsoft workers have now organized to fight for fair compensation, job security, and improved working conditions. \nCWA is America's largest communications and media labor union, and in a statement, local 9510 president Jason Justice called the successful vote \"part of a much larger story about turning the tide in an industry that has long overlooked its labor. Entertainment workers across film, television, music, and now video games are standing together",
        "id": 3468457,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/01/0413204/blizzards-diablo-devs-unionize-theres-now-3500-unionized-microsoft-workers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Blizzard's 'Diablo' Devs Unionize. There's Now 3,500 Unionized Microsoft Workers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T08:00:41.880228+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T07:34:00+00:00",
        "description": "\"Typically when something is available to \"buy,\" ownership of that good or access to that service is offered in exchange for money,\" writes Ars Technica. \n\"That's not really the case, though, when it comes to digital content.\"\n\nOften, streaming services like Amazon Prime Video offer customers the options to \"rent\" digital content for a few days or to \"buy\" it. Some might think that picking \"buy\" means that they can view the content indefinitely. But these purchases are really just long-term licenses to watch the content for as long as the streaming service has the right to distribute it &mdash; which could be for years, months, or days after the transaction. A lawsuit recently filed against Prime Video challenges this practice and accuses the streaming service of misleading customers by labeling long-term rentals as purchases. The conclusion of the case could have implications for how streaming services frame digital content... \n\n[The plaintiff's] complaint stands a better chance due ",
        "id": 3466861,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/01/051247/lawsuit-says-amazon-prime-video-misleads-when-you-buy-a-long-term-streaming-rental?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lawsuit Says Amazon Prime Video Misleads When You 'Buy' a Long-Term Streaming Rental",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T04:43:32.395886+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T03:34:00+00:00",
        "description": "\"I have no musical talent at all,\" says Oliver McCann. \"I can't sing, I can't play instruments, and I have no musical background at all!\" \n\nBut the Associated Press describes 37-year-old McCann as a British \"AI music creator\" &mdash; and last month McCann signed with an independent record label \"after one of his tracks racked up 3 million streams, in what's billed as the first time a music label has inked a contract with an AI music creator.\"\n\nMcCann is an example of how ChatGPT-style AI song generation tools like Suno and Udio have spawned a wave of synthetic music, a movement most notably highlighted by a fictitious group, Velvet Sundown, that went viral even though all its songs, lyrics and album art were created by AI. Experts say generative AI is set to transform the music world. However, there are scant details, so far, on how it's impacting the $29.6 billion global recorded music market, which includes about $20 billion from streaming. \nThe most reliable figures come from music",
        "id": 3466083,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/09/01/0136236/first-ai-music-creator-signed-by-record-label-more-ahead-or-just-a-copyright-quandry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "First 'AI Music Creator' Signed by Record Label. More Ahead, or Just a Copyright Quandry?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-01T01:28:32.483214+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-01T00:50:00+00:00",
        "description": "\"Nearly 400 students, many of them entrepreneurs, have so far made the journey to Forest City to study everything from coding to unconventional theories on statehood,\" reports Bloomberg. \n\n\"They're building crypto projects, fine-tuning their physiques and testing whether a shared ideology &mdash; rather than just shared territory &mdash; can bind a community.\"\n\n\nThey have descended on Forest City to attend Network School, the brainchild of former Coinbase Inc. executive and \"The Network State\" author Balaji Srinivasan. In this troubled megaproject once envisaged to house some 50 times its current population, they're conducting a real-life experiment of sorts with Srinivasan's vision of \"startup societies\" defined less by historical territory than shared beliefs in technology, cryptocurrency and light regulation... Mornings are spent in product sprints and coding sessions; afternoons in seminars exploring topics from the Meiji Restoration to Singapore's statecraft and the mechanics of ",
        "id": 3465452,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/01/0047230/400-tech-utopian-refuges-consider-new-crypto-friendly-state?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "400 'Tech Utopian' Refuges Consider New Crypto-Friendly State",
        "vote": 0
    }
]