[
    {
        "age": null,
        "album": "",
        "author": "Gamers Nexus",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T20:36:01.650383+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T18:30:47+00:00",
        "description": "Sponsor: Thermalright Frozen Prism 360 on Amazon - https://geni.us/FUqbQC\nAntec and Noctua are partnering to make the Antec Flux Pro with NF-A12 G2 and NF-A14 G2 fans, 6 total, for a high airflow PC case with brown accents. Antec's Flux Pro did well in our thermal testing previously, so we're looking forward to testing the new model of the case as soon as we have it to see if it can punch past even the original Antec chassis. Antec also showed off its new Antec 900 case, following up the 900 from decades ago now (ouch!) with a new design. The Antec 900 also had a variation with 2x Noctua 200mm fans installed in it in addition to Antec's plans for a 6-fan model (using its Flux Pro fans). Plenty more at Computex 2025 as we continue covering all the booths!\n\nThe best way to support our work is through our store: https://store.gamersnexus.net/\n\nLike our content? Please consider becoming our Patron to support us: http://www.patreon.com/gamersnexus\n\nTIMESTAMPS\n\n00:00 - Antec is Back with Ca",
        "id": 2719869,
        "language": null,
        "link": "https://www.youtube.com/watch?v=e6vkgEjmqmA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 428,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UChIs72whgZI9w6d6FhwGGHA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/e6vkgEjmqmA/hqdefault.jpg",
        "title": "Noctua Case x Antec Flux Pro, New Antec 900, & High Airflow Cases",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Gamers Nexus",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T12:20:49.541808+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T10:30:17+00:00",
        "description": "Sponsor: Hyte Y70 and Touch Infinite on their site https://geni.us/Ir9vKEK\nThis is a dual-GPU video card with 2x Intel Arc GPUs on one PCB. Intel has new Arc GPUs in the Battlemage family that are using existing BMG silicon, but with more memory and some other tuning for workstation, so-called \"AI,\" inference, and content creation workloads. The new models are the B50 and B60 GPUs, with the MAXSUN Arc Pro B60 Dual 48GB model being the one we're taking apart today. Technically, although it's \"48GB\" of memory, it is separated between the two discrete GPUs. Effectively, this is 'just' two GPUs on one PCB, similar to the old days.\n\nFor a limited time only, use code \"IDGAF\" (yes, in that tone) for 10% off on the GN store. We pay for all of our own travel for these events, so your purchases directly support our coverage while also getting you something cool in return! https://store.gamersnexus.net/\n\nLike our content? Please consider becoming our Patron to support us: http://www.patreon.com/",
        "id": 2715437,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Y8MWbPBP9i0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 428,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UChIs72whgZI9w6d6FhwGGHA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y8MWbPBP9i0/hqdefault.jpg",
        "title": "Intel Arc B60 DUAL-GPU 48GB Video Card Tear-Down | MAXSUN Arc Pro B60 Dual",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Gamers Nexus",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T03:55:08.448608+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T02:52:24+00:00",
        "description": "SUPPORT OUR INDEPENDENCE. Use code \"IDGAF\" at checkout for 10% off at the GN store. Grab a Paper Launch cotton T-shirt here: https://store.gamersnexus.net/products/paper-launch-cotton or a tri-blend variant here: https://store.gamersnexus.net/products/paper-launch-triblend (or grab a Modmat, Solder Mat, copper-plated mule mug of thermal conductivity, 3D PC part coaster pack, and more). This directly helps support our independent reviews and ability to call out companies for their manipulative tactics and anti-consumer behavior, both of which are prominently on display at NVIDIA.\n\nIn this video, we'll talk about NVIDIA's last several months of pressure to talk about DLSS more frequently in reviews, plus MFG 4X pressure from the company. NVIDIA has repeatedly made comments to GN that interviews, technical discussion, and access to engineers unrelated to MFG 4X and DLSS are made possible by talking about MFG 4X and DLSS. NVIDIA has explicitly stated that this type of content is made \"pos",
        "id": 2712931,
        "language": null,
        "link": "https://www.youtube.com/watch?v=AiekGcwaIho",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 428,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UChIs72whgZI9w6d6FhwGGHA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AiekGcwaIho/hqdefault.jpg",
        "title": "NVIDIA's Dirty Manipulation of Reviews",
        "vote": 0
    }
]