[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T20:28:51.327851+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T20:00:32+00:00",
        "description": "Developer Saber Interactive is no stranger to making slow-paced driving games that emphasize the difficulty of driving on dangerous terrain, with RoadCraft, the studio hit an entirely new level. Not only do we have similar gameplay elements to its predecessors like Snowrunner, there are also entirely new vehicles to play around with, like cranes, bulldozers, and road rollers. All of these, alongside new mechanics like laying down roads, automated supply lines and even laying down power cables add quite a bit of depth to what was already a deep driving game.\n\nWhile the gameplay tends to be quite fun on its own, RoadCraft also packages it all up with incredibly gorgeous visuals that really emphasize how devastating a natural disaster can be for those caught in its wake. While there might be some sadness in seeing the wreckage, it also ends up feeling quite rewarding when you’ve helped an area recover from its devastation, especially when you’re playing with friends.",
        "id": 2719792,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cDCeUXfguAw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cDCeUXfguAw/hqdefault.jpg",
        "title": "RoadCraft Review - Who Knew Construction Could Be This Addictive?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T20:28:51.517079+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T20:00:24+00:00",
        "description": "Palia is an online multiplayer-focused take on the ever-expanding genre of life sims. The game revolves around the player building out their homes, decorating it, and partaking in a simple life of hard manual labor as they farm, mine, chop wood, catch fish, and cook their way through the world, and maybe make a friend or two along the way. With the Elderwood expansion, Palia has now added content that feeds into its life sim aspects while also fleshing out its world and story a bit more.\n\nAs a game, Palia feels like the video game equivalent of a warm hug. There’s nothing to be worried about when playing, since it’s literally impossible for the player character to die, and interior (and exterior) decorating can be loads of fun. However, it is worth noting that Palia likes to waste a lot of your time as you wait for your ore to turn into usable metal bars, wait for a shop vendor to wake up and open up their shop, and, of course, lots of fetch quests.",
        "id": 2719793,
        "language": null,
        "link": "https://www.youtube.com/watch?v=GVlHBUsFEX8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GVlHBUsFEX8/hqdefault.jpg",
        "title": "Palia + Elderwood DLC Review - A Good Experience Marred By The Grind",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T16:07:58.937743+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T15:30:16+00:00",
        "description": "Even if all the hype for S.T.A.L.K.E.R. 2: Heart of Chornobyl has calmed since its launch last November, it's a great time to revisit the original trilogy, especially on current-gen consoles. GSC Game World's S.T.A.L.K.E.R.: Legends of the Zone Trilogy is finally getting an upgrade for Xbox Series X/S and PS5, adding a litany of features.\n\nThe most notable are four different graphical modes - Quality (native 4K/30 FPS), Performance (upscaled 4K/60 FPS), Balanced (upscaled 4K/40 FPS) and Ultra Performance (2K/120 FPS). All of them are solid in their own right, even if the preference is still for higher frame rates. However, what's even more impressive are the visual improvements. Global illumination, revamped models, and screen-space reflections all look sharp and enhance the Zone's atmosphere.\n\nWhile each title is an acquired taste for the average first-person shooter fan, S.T.A.L.K.E.R.: Legends of the Zone Trilogy - Enhanced remains recommended for those who want a tense, post-nucle",
        "id": 2717540,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QuBztK6HhxI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QuBztK6HhxI/hqdefault.jpg",
        "title": "S.T.A.L.K.E.R. Legends of the Zone Trilogy: Enhanced Edition Review - A Stellar Current-Gen Version",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T13:52:38.652097+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T13:30:38+00:00",
        "description": "With Grand Theft Auto 6 delayed, the opportunity is ripe for an urban crime game to fill the gap and help with the wait. MindsEye from Build a Rocket Boy isn't an open-world title and wraps some intriguing bits about greed with a robot rebellion. It's led by Lesley Benzies, who's worked on every GTA title since Grand Theft Auto 3, so expectations are doubtless high.\n\nHowever, MindsEye isn't really capitalizing on any of it, despite launching in less than a month for Xbox Series X/S, PS5, and PC at $59.99. There's been no extensive gameplay reveal or mission walkthrough. All we've seen are some teasers and a few narrative trailers. The lack of information on its integration with Everywhere, the developer's upcoming MMO/content platform, is also jarring.\n\nIs it simply a case of lackluster marketing? Is there something deeper going on with the title? Join us as we discuss the possibilities.",
        "id": 2716201,
        "language": null,
        "link": "https://www.youtube.com/watch?v=f84zkPL3mWI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/f84zkPL3mWI/hqdefault.jpg",
        "title": "Ex-Rockstar Dev's MindsEye - What The HELL IS GOING ON?",
        "vote": 0
    }
]