[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T23:01:43.227480+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T22:50:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: While using website data to build a Google Search topped with artificial intelligence-generated answers, an Alphabet executive acknowledged in an internal document that there was an alternative way to do things: They could ask web publishers for permission, or let them directly opt out of being included. But giving publishers a choice would make training AI models in search too complicated, the company concludes in the document, which was unearthed in the company's search antitrust trial.\n \nIt said Google had a \"hard red line\" and would require all publishers who wanted their content to show up in the search page to also be used to feed AI features. Instead of giving options, Google decided to \"silently update,\" with \"no public announcement\" about how they were using publishers' data, according to the document, written by Chetna Bindra, a product management executive at Google Search. \"Do what we say, say what we do, but carefully.\" ",
        "id": 2720679,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/19/2054230/google-decided-against-offering-publishers-options-in-ai-search?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Decided Against Offering Publishers Options In AI Search",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T23:01:43.383722+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T22:10:00+00:00",
        "description": "Google has launched the NotebookLM app for Android and iOS, offering a native mobile experience with offline support, audio overviews, and integration into the system share sheet for adding sources like PDFs and YouTube videos. 9to5Google reports: This native experience starts on a homepage of your notebooks with filters at the top for Recent, Shared, Title, and Downloaded. The app features a light and dark mode based on your device's system theme with no manual toggle. Each colorful card features the notebook name, emoji, number of sources, and date, as well as a play button for Audio Overviews. There's background playback and offline support for the podcast-style experience (the fullscreen player has a nice glow), while you can \"Join\" the AI hosts (in beta) to ask follow-up questions.\n \nYou get a \"Create new\" button at the bottom of the list to add PDFs, websites, YouTube videos, and text. Notably, the NotebookLM app will appear in the Android and iOS share sheet to quickly add sour",
        "id": 2720680,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/19/211254/google-launches-notebooklm-app-for-android-and-ios?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Launches NotebookLM App For Android and iOS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T21:58:05.715330+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T21:30:00+00:00",
        "description": "Regeneron Pharmaceuticals is acquiring most of 23andMe's assets for $256 million. The sale includes 23andMe's Personal Genome Service, Total Health and Research Services business lines. What's not included is 23andMe's telehealth unit, Lemonaid Health, which the company acquired for around $400 million in 2021. It'll be shut down, but all staffers will remain employed. CNBC reports: The deal is still subject to approval by the U.S. Bankruptcy Court for the Eastern District of Missouri. Pending approval, it's expected to close in the third quarter of this year, according to the release. In its bankruptcy proceedings, 23andMe required all bidders to comply with its privacy policies, and a court-appointed, independent \"Consumer Privacy Ombudsman\" will assess the deal, the companies said.\n \nSeveral lawmakers and officials, including the Federal Trade Commission, had expressed concerns about the safety of consumers' genetic data through 23andMe's sale process. The privacy ombudsman will pr",
        "id": 2720312,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/19/2039213/regeneron-pharmaceuticals-to-buy-23andme-and-its-data-for-256-million?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Regeneron Pharmaceuticals To Buy 23andMe and Its Data For $256 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T21:58:05.878186+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T20:50:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Microsoft on Monday became one of the first hyperscalers to provide managed access to Grok, the AI model developed by billionaire Elon Musk's AI startup, xAI. Available through Microsoft's Azure AI Foundry platform, Grok -- specifically Grok 3 and Grok 3 mini -- will \"have all the service-level agreements Azure customers expect from any Microsoft product,\" says Microsoft. They'll also be billed directly by Microsoft, as is the case with the other models hosted in Azure AI Foundry. [...] The Grok 3 and Grok 3 mini models in Azure AI Foundry are decidedly more locked down than the Grok models on X. They also come with additional data integration, customization, and governance capabilities not necessarily offered by xAI through its API.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=xAI's+Grok+3+Comes+To+Microsoft+Azure%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05",
        "id": 2720313,
        "language": null,
        "link": "https://slashdot.org/story/25/05/19/2033214/xais-grok-3-comes-to-microsoft-azure?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "xAI's Grok 3 Comes To Microsoft Azure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T20:51:45.187804+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T20:10:00+00:00",
        "description": "Chatbots are more persuasive in online debates than people -- especially when they are able to personalize their arguments using information about their opponent. From a report: The finding, published in Nature Human Behaviour on 19 May, highlights how large language models (LLMs) could be used to influence people's opinions, for example in political campaigns or targeted advertising. \n\n\"Obviously as soon as people see that you can persuade people more with LLMs, they're going to start using them,\" says study co-author Francesco Salvi, a computational scientist at the Swiss Federal Technology Institute of Lausanne (EPFL). \"I find it both fascinating and terrifying.\" Research has already shown that artificial intelligence (AI) chatbots can make people change their minds, even about conspiracy theories, but it hasn't been clear how persuasive they are in comparison to humans. GPT-4 was 64.4% more persuasive than humans in one-to-one debates, the study found.<p><div class=\"share_submissi",
        "id": 2719937,
        "language": null,
        "link": "https://slashdot.org/story/25/05/19/1910215/ai-is-more-persuasive-than-people-in-online-debates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI is More Persuasive Than People in Online Debates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T19:48:27.196938+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T19:30:00+00:00",
        "description": "An anonymous reader shares a report: European \"green\" funds holding more than $33 billion of investments in major oil and gas companies have been revealed by an investigation, despite fossil fuels being the root cause of the climate crisis. Some of these investment funds used branding such as Sustainable Global Stars and Europe Climate Pathway. \n\nOver $18 billion was invested in the five biggest polluters: TotalEnergies, Shell, ExxonMobil, Chevron and BP. These topped a 2023 Carbon Majors ranking for oil and gas production among shareholder-owned firms. Other investments by funds following EU sustainable finance disclosure regulations (SFDR) included those in US fracking company Devon Energy and Canadian tar sands company Suncor, the investigation by Voxeurop and the Guardian found. \n\nInvestors claim that holding a stake in a company allows them to influence the firm's pursuit of climate goals. However, no major oil and gas producer has plans consistent with international climate targ",
        "id": 2719465,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/19/195203/european-green-investments-hold-billions-in-fossil-fuel-majors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "European 'Green' Investments Hold Billions in Fossil Fuel Majors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T19:48:27.363945+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T18:53:00+00:00",
        "description": "Microsoft unveiled \"Edit on Windows,\" a new command-line text editor, at its Build conference today. The open-source tool allows developers to edit files directly in the command line without switching to another app, similar to vim but designed to be more user-friendly. \n\nAccessible by typing \"edit\" in a command prompt, the lightweight editor (less than 250KB) includes features like multiple file support via ctrl + P shortcuts, find and replace functionality, and regular expression support. \"What motivated us to build Edit was the need for a default CLI text editor in 64-bit versions of Windows,\" said Christopher Nguyen, product manager of Windows Terminal, noting that 32-bit Windows versions already ship with MS-DOS Edit. \n\nMicrosoft also wanted to avoid the notorious \"how do I exit vim?\" problem by creating a modeless editor, The Verge writes. The tool will be available to Windows Insiders in the coming months.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"sl",
        "id": 2719466,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/19/1853221/microsofts-edit-on-windows-is-a-new-command-line-text-editor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's Edit on Windows is a New Command-Line Text Editor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T18:45:04.102761+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T18:10:00+00:00",
        "description": "AI is eroding entry-level positions across multiple industries, threatening the traditional career ladder for young professionals, LinkedIn's chief economic opportunity officer warned Monday. College graduate unemployment has risen 30% since September 2022, compared to 18% for workers overall, according to LinkedIn data. The company's research shows Generation Z workers expressing greater pessimism about their futures than any other age group. \n\n\"Breaking first is the bottom rung of the career ladder,\" wrote Aneesh Raman in a New York Times column, citing examples across technology, law, and retail where AI is replacing tasks traditionally assigned to junior workers. A LinkedIn survey of 3,000 executives found 63% believe AI will eventually handle mundane entry-level tasks, with professionals holding advanced degrees likely facing greater disruption than those without. \n\nSome firms are adapting by redesigning roles. KPMG now assigns recent graduates tax work previously reserved for mo",
        "id": 2718969,
        "language": null,
        "link": "https://slashdot.org/story/25/05/19/187253/linkedin-executive-warns-ai-threatens-entry-level-jobs-as-graduate-unemployment-rises?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "LinkedIn Executive Warns AI Threatens Entry-Level Jobs as Graduate Unemployment Rises",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T17:38:18.442300+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T17:30:00+00:00",
        "description": "Microsoft has announced NLWeb, an open protocol designed to democratize AI-powered search capabilities for websites and apps. Developed by Microsoft technical fellow Ramanathan V. Guha, who previously created RSS and Schema.org, NLWeb allows site owners to implement ChatGPT-style natural language search with minimal code. The protocol enables websites to process complex queries like \"spicy and crunchy appetizers for Diwali\" or \"jackets warm enough for Quebec,\" requiring only an AI model, some code, and the site's own data. \n\nDuring his demonstration to news outlet The Verge, Guha showed how NLWeb remembers user preferences, such as dietary restrictions, for future interactions. \"It's a protocol, and the protocol is a way of asking a natural-language question, and the answer comes back in structured form,\" explained Guha, who argues the approach is significantly cheaper than traditional search methods that require extensive web crawling and indexing. Microsoft is partnering with publis",
        "id": 2718494,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/19/1729259/microsofts-plan-to-fix-the-web-letting-every-website-run-ai-search-for-cheap?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's Plan To Fix the Web: Letting Every Website Run AI Search for Cheap",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T17:38:18.600725+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T16:54:00+00:00",
        "description": "Windows Subsystem for Linux (WSL) is now open source, Microsoft said Monday. The tool, which allows developers to run Linux distributions directly in Windows, is available for download, modification, and contribution. \"We want Windows to be a great dev box,\" said Pavan Davuluri, corporate VP at Microsoft. \"Having great WSL performance and capabilities\" allows developers \"to live in the Windows-native experience and take advantage of all they need in Linux.\" \n\nFirst launched in 2016 with an emulated Linux kernel, WSL switched to using the actual Linux kernel in 2019 with WSL 2, improving compatibility. The system has since gained support for GPUs, graphical applications, and systemd. Microsoft significantly refactored core Windows components to make WSL a standalone system before open sourcing it.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Open+Sources+Windows+Subsystem+for+Linux%3A+https%3A%2F%2Fnews.s",
        "id": 2718495,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/19/1654225/microsoft-open-sources-windows-subsystem-for-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Open Sources Windows Subsystem for Linux",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T16:36:00.873102+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T16:01:00+00:00",
        "description": "An anonymous reader shares a report: Germany has dropped its long-held opposition to nuclear power, in the first concrete sign of rapprochement with France by Berlin's new government led by conservative Chancellor Friedrich Merz. \n\nBerlin has signalled to Paris it will no longer block French efforts to ensure nuclear power is treated on par with renewable energy in EU legislation, according to French and German officials. \n\nThe move resolves a major dispute between the two countries that has delayed decisions on EU energy policy, including during the crisis that followed Russia&#226;(TM)s full-scale invasion of Ukraine.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Germany+Drops+Opposition+To+Nuclear+Power%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F05%2F19%2F1456219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"htt",
        "id": 2717791,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/19/1456219/germany-drops-opposition-to-nuclear-power?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Germany Drops Opposition To Nuclear Power",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T16:36:01.039088+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T15:22:00+00:00",
        "description": "Miami-Dade County Public Schools, the nation's third-largest school district, is now deploying Google's Gemini chatbots to more than 105,000 high school students -- marking the largest U.S. school district AI deployment to date. This represents a dramatic reversal from just two years ago when the district blocked such tools over cheating and misinformation concerns. \n\nThe initiative follows President Trump's recent executive order promoting AI integration \"in all subject areas\" from kindergarten through 12th grade. District officials spent months testing various chatbots for accuracy, privacy, and safety before selecting Google's platform.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=How+Miami+Schools+Are+Leading+100%2C000+Students+Into+the+A.I.+Future%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F05%2F19%2F1451202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_l",
        "id": 2717792,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/19/1451202/how-miami-schools-are-leading-100000-students-into-the-ai-future?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Miami Schools Are Leading 100,000 Students Into the A.I. Future",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T15:32:27.409814+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T14:40:00+00:00",
        "description": "New submitter optical_phiber writes: In March 2025, the New South Wales (NSW) Department of Education discovered that Microsoft Teams had begun collecting students' voice and facial biometric data without their prior knowledge. This occurred after Microsoft enabled a Teams feature called 'voice and face enrollment' by default, which creates biometric profiles to enhance meeting experiences and transcriptions via its CoPilot AI tool. \n\nThe NSW department learned of the data collection a month after it began and promptly disabled the feature and deleted the data within 24 hours. However, the department did not disclose how many individuals were affected or whether they were notified. Despite Microsoft's policy of retaining data only while the user is enrolled and deleting it within 90 days of account deletion, privacy experts have raised serious concerns. Rys Farthing of Reset Tech Australia criticized the unnecessary collection of children's data, warning of the long-term risks and cal",
        "id": 2717108,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/19/1331229/new-south-wales-education-department-caught-unaware-after-microsoft-teams-began-collecting-students-biometric-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New South Wales Education Department Caught Unaware After Microsoft Teams Began Collecting Students' Biometric Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T14:26:53.491822+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T14:00:00+00:00",
        "description": "Abstract of a paper featured on NBER: This year marks the 40th anniversary of the NBER Macro Annual Conference, founded in 1986. This paper reviews the evolution of mainstream macroeconomics since then. It presents my views, informed by a survey of a number of researchers who have made important contributions to the field. I develop two main arguments. \n\nThe first is that, starting from strikingly different positions, there has been substantial convergence, in terms of methodology, architecture, and main mechanisms. Methodology: Explicit micro foundations, explicit treatment of distortions, with, at the same time, an increased willingness to deviate from rational expectations, neoclassical utility and profit maximization. Architecture: The wide acceptance of nominal rigidities as an essential distortion, although with mixed feelings. Mechanisms: The wide nature of the shocks to both the demand and the supply side. \n\nThe second is that this convergence has been, for the most part, good",
        "id": 2716511,
        "language": null,
        "link": "https://slashdot.org/story/25/05/19/130213/thoughts-about-the-evolution-of-mainstream-macroeconomics-over-the-last-40-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Thoughts About the Evolution of Mainstream Macroeconomics Over the Last 40 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T12:16:54.454803+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T11:16:00+00:00",
        "description": "\"The Danish government plans to evaluate the prospect of beginning a nuclear power programme,\" reports the Telegraph, noting that this week Denmark lifted a nuclear power ban imposed 40 years ago.\n\n\nUnlike its neighbours in Sweden and Germany, Denmark has never had a civil nuclear power programme. It has only ever had three small research reactors, the last of which closed in 2001. Most of the renewed interest in nuclear seen around the world stems from the expected growth in electricity demand from AI data centres, but Denmark is different. The Danes are concerned about possible blackouts similar to the one that struck Iberia recently. Like Spain and Portugal, Denmark is heavily dependent on weather-based renewable energy which is not very compatible with the way power grids operate... [\"The spinning turbines found in fossil-fuelled energy systems provide inertia and act as a shock absorber to stabilise the grid during sudden changes in supply or demand,\" explains a diagram in the ar",
        "id": 2715393,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/19/013209/danes-are-finally-going-nuclear-they-have-to-because-of-all-their-renewables?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Danes Are Finally Going Nuclear. They Have To, Because of All Their Renewables",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T07:36:52.966066+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T07:16:00+00:00",
        "description": "\"Despite many obstacles &mdash; and what you may read elsewhere &mdash; electric-vehicle sales continue to grow at a healthy pace in the U.S. market,\" Cox Automotive reported this week. \"Roughly 7.5% of total new-vehicle sales in the first quarter were electric vehicles, an increase from 7% a year earlier.\" \n\nAn anonymous reader shared this analysis from Autoweek:\n\"Despite a cloud of uncertainty around future EV interest and potential economic headwinds hanging over the automotive industry, consumer demand for electric vehicles has remained stable,\" according to the J.D. Power 2025 US Electric Vehicle Consideration Study released yesterday. Specifically, the study showed that 24% of vehicle shoppers in the U.S. say they are \"very likely\" to consider purchasing an EV and 35% say they are \"somewhat likely,\" both of which figures remain unchanged from a year ago... \n\n\nGlobally the numbers are even more pro-EV. Electric car sales exceeded 17 million globally in 2024, reaching a sales shar",
        "id": 2713833,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/19/0149259/ev-sales-keep-growing-in-the-us-represent-20-of-global-car-sales-and-half-in-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EV Sales Keep Growing In the US, Represent 20% of Global Car Sales and Half in China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T03:15:26.160949+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T03:06:00+00:00",
        "description": "TechCrunch reports:\n\nThe world's only net-positive fusion experiment has been steadily ramping up the amount of power it produces, TechCrunch has learned. \nIn recent attempts, the team at the U.S. Department of Energy's National Ignition Facility (NIF) increased the yield of the experiment, first to 5.2 megajoules and then again to 8.6 megajoules, according to a source with knowledge of the experiment. The new results are significant improvements over the historic experiment in 2022, which was the first controlled fusion reaction to generate more energy than the it consumed. The 2022 shot generated 3.15 megajoules, a small bump over the 2.05 megajoules that the lasers delivered to the BB-sized fuel pellet. \n\nNone of the shots to date have been effective enough to feed electrons back into the grid, let alone to offset the energy required to power the entire facility &mdash; the facility wasn't designed to do that. The first net-positive shot, for example, required 300 megajoules to pow",
        "id": 2712872,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/19/0044238/since-2022-nuclear-fusion-breakthrough-us-researchers-have-more-than-doubled-its-power-output?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Since 2022 Nuclear Fusion Breakthrough, US Researchers Have More Than Doubled Its Power Output",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-19T01:06:45.042224+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-19T00:06:00+00:00",
        "description": "OpenAI CEO and Sam Altman believe Artificial General Intelligence could arrive within the next few years. But the speculations of some technologists \"are getting ahead of reality,\" writes the New York Times, adding that many scientists \"say no one will reach AGI without a new idea &mdash; something beyond the powerful neural networks that merely find patterns in data. That new idea could arrive tomorrow. But even then, the industry would need years to develop it.\"\n\n\n\n\n\"The technology we're building today is not sufficient to get there,\" said Nick Frosst, a founder of the AI startup Cohere who previously worked as a researcher at Google and studied under the most revered AI researcher of the last 50 years. \"What we are building now are things that take in words and predict the next most likely word, or they take in pixels and predict the next most likely pixel. That's very different from what you and I do.\" In a recent survey of the Association for the Advancement of Artificial Intelli",
        "id": 2712479,
        "language": null,
        "link": "https://slashdot.org/story/25/05/19/003225/why-were-unlikely-to-get-artificial-general-intelligence-any-time-soon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why We're Unlikely to Get Artificial General Intelligence Any Time Soon",
        "vote": 0
    }
]