[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-14T16:00:43+00:00",
        "description": "Tomb Raider IV-VI Remastered includes the full suite of enhancements that I-III had. The classic and modern graphics toggle is just as awesome as ever, with even more detail on certain environments this time around. Some new features include boss health bars, additional photo mode settings, and restored content for Tomb Raider VI. \n\nWhile Tomb Raider 4 supplies more of that traditional action-platforming from previous entries, 5 and 6 are more unconventional. 5's story is told through a series of flashbacks and Lara is presumed dead, while 6 revolves around stealth and features more mature themes. This is a solid remaster that provides a ton of content at a very attractive price point.",
        "id": 2115370,
        "language": null,
        "link": "https://www.youtube.com/watch?v=_3fk-WP2URE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_3fk-WP2URE/hqdefault.jpg",
        "title": "Tomb Raider 4-6 Remastered Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-14T16:00:38+00:00",
        "description": "There was a period during the earlier days of Tomb Raider where it seemed the series could do no right. Case in point: Tomb Raider: Chronicles and Tomb Raider: The Angel of Darkness.\n\nBoth titles represented a floundering development team and are still considered the worst in the series. Nevertheless, those games - and Tomb Raider: The Last Revelation - the remastered treatment with Tomb Raider 4-6 Remastered. Aside from all the restored cut content, new flyby camera mode, and additional options, the visuals arguably offer the biggest change for longtime fans.\n\nWith the remastered compilation available for Xbox Series X/S, Xbox One, PS4, PS5, PC, and Nintendo Switch starting February 14th, how do these new versions stack up to the originals? Find out here.",
        "id": 2115371,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Y4lSvgls5vo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y4lSvgls5vo/hqdefault.jpg",
        "title": "Tomb Raider 4-6 Remastered vs Original Graphics Comparison - A Massive Visual Leap?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-14T09:30:29+00:00",
        "description": "The action RPG genre has come a long way in the last decade. We've seen isometric titles rise to prominence, 3D dungeon crawlers take the reins, and soon enough, massive open-world games that can qualify.\n\nIt's become rather crowded, and when you factor in the looters, the Souls-likes, and even the rogue-likes, there is a lot of variety with the combat systems, quests, customization, and whatnot. On the bright side, however, that also means more options for those who love a responsive combat system mixed with a compelling narrative and characters.\n\nNot every game can rise to the ranks of FromSoftware's titles or even compete with Final Fantasy 7 Remakes, but players are spoiled for choice in the current era of action RPGs. Here are the top 30 best options you should be playing right now.",
        "id": 2112509,
        "language": null,
        "link": "https://www.youtube.com/watch?v=bnCzNb64s70",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bnCzNb64s70/hqdefault.jpg",
        "title": "Top 30 Greatest Action RPGs You Should Be PLAYING RIGHT NOW [2025 Edition]",
        "vote": 0
    }
]