[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T23:05:24.020379+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T22:34:00+00:00",
        "description": "\"The world has changed,\" writes Stack Overflow's blog. \"Fast. Artificial intelligence is reshaping how we build, learn, and solve problems. Software development looks dramatically different than it did even a few years ago &mdash; and the pace of change is only accelerating.\" \n\nAnd they believe their brand \"at times\" lost \"fidelity and clarity. It's very much been always added to and not been thought of holistically. So, it's time for our brand to evolve too,\" they write, hoping to articulate a perspective \"forged in the fires of community, powered by collaboration, shaped by AI, and driven by people.\" \n\n\nThe developer news site DevClass notes the change happens \"as the number of posts to its site continues a dramatic decline thanks to AI-driven alternatives.\"\n\n\nAccording to a quick query on the official data explorer, the sum of questions and answers posted in April 2025 was down by over 64 percent from the same month in 2024, and plunged more than 90 percent from April 2020, when tr",
        "id": 2705953,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/16/2227231/stack-overflow-seeks-realignment-to-support-the-builders-of-the-future-in-an-ai-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Stack Overflow Seeks Realignment 'To Support the Builders of the Future in an AI World'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T22:00:27.669244+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T21:34:00+00:00",
        "description": "An anonymous reader shared this report from CRN:\nCPU-tracking firm Mercury Research reported on Thursday that Intel's x86 CPU market share grew 0.3 points sequentially to 75.6 percent against AMD's 24.4 percent in the first quarter. However, AMD managed to increase its market share by 3.6 points year over year. These figures only captured the server, laptop and desktop CPU segments. When including IoT and semicustom products, AMD grew its x86 market share sequentially by 1.5 points and year over year by 0.9 points to 27.1 percent against Intel's 72.9 percent... AMD managed to gain ground on Intel in the desktop and server segments sequentially and year over year. But it was in the laptop segment where Intel eked out a sequential share gain, even though rival AMD ended up finishing the first quarter with a higher share of shipments than what it had a year ago... \nWhile AMD mostly came out on top in the first quarter, [Mercury Research President Dean] McCarron said ARM's estimated CPU s",
        "id": 2705728,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/17/2032204/intel-struggles-to-reverse-amds-share-gains-in-x86-cpu-market?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Struggles To Reverse AMD's Share Gains In x86 CPU Market",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T20:55:36.577066+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T20:34:00+00:00",
        "description": "\"The altruistic OpenAI is gone, if it ever existed,\" argues a new article in the Atlantic, based on interviews with more than 90 current and former employees, including executives. It notes that shortly before Altman's ouster (and rehiring) he was \"seemingly trying to circumvent safety processes for expediency,\" with OpenAI co-founder/chief scientist Ilya telling three board members \"I don't think Sam is the guy who should have the finger on the button for AGI.\" (The board had already discovered Altman \"had not been forthcoming with them about a range of issues\" including a breach in the Deployment Safety Board's protocols.) \n\nAdapted from the upcoming book, Empire of AI, the article first revisits the summer of 2023, when Sutskever (\"the brain behind the large language models that helped build ChatGPT\") met with a group of new researchers:\n\nSutskever had long believed that artificial general intelligence, or AGI, was inevitable &mdash; now, as things accelerated in the generative-AI ",
        "id": 2705506,
        "language": null,
        "link": "https://slashdot.org/story/25/05/17/1925212/is-the-altruistic-openai-gone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is the Altruistic OpenAI Gone?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T19:50:25.492398+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T19:34:00+00:00",
        "description": "An anonymous reader shared this report from The Hill:\n\n\n\nA new study indicates the debilitating \"brain fog\" suffered by millions of long COVID patients is linked to changes in the brain, including inflammation and an impaired ability to rewire itself following COVID-19 infection. United Press International reported this week that the small-scale study, conducted by researchers at Corewell Health in Grand Rapids, Michigan, and Michigan State University, shows that altered levels of a pair of key brain chemicals could be the culprit. \n\nThe study marks the first time doctors have been able to provide scientific proof that validates the experiences of the approximately 12 million COVID \"long-haulers\" in the U.S. who have reported neurological symptoms. Researchers looked at biomarkers in study participants and found that those complaining of brain fog had higher levels of an anti-inflammatory protein that is crucial to regulating a person's immune system, UPI reported. They also showed lo",
        "id": 2705168,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/17/1657219/researchers-finally-link-long-covid-brain-fog-to-inflammation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Finally Link Long Covid 'Brain Fog' to Inflammation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T18:45:28.157481+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T18:34:00+00:00",
        "description": "\"Researchers are seeking a breakthrough in technologies to tackle PFAS contamination,\" reports the Washington Post &mdash; including experiments with ultraviolet light, plasma and sound waves:\n\n\"We're in a good spot,\" said Christopher Higgins, a professor of civil and environmental engineering at the Colorado School of Mines who researches PFAS. \"There's a lot of things being tested. ... Around the world, everyone is trying to work on this topic....\" PFAS destruction technologies are beginning to show potential. Some methods have been licensed by companies that are rolling out the systems in real-world settings. \"There's been a lot of research happening over the past few years looking at advanced destruction technologies, and there's been a lot of improvements and advancements, and we're now starting to see some of them actually at scale,\" said Anna Reade [a senior scientist and director of PFAS advocacy at the Natural Resources Defense Council]. \n\nAn approach known as supercritical w",
        "id": 2704874,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/17/0645218/the-most-promising-ways-to-destroy-forever-chemicals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Most Promising Ways to Destroy 'Forever Chemicals'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T18:45:28.341711+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T17:34:00+00:00",
        "description": "A Curl contributor replaced an ASCII letter with a Unicode alternative in a pull request, writes Curl lead developer/founder Daniel Stenberg. And not a single human reviewer on the team (or any of their CI jobs) noticed. \n\nThe change \"looked identical to the ASCII version, so it was not possible to visually spot this...\"\n\n\nThe impact of changing one or more letters in a URL can of course be devastating depending on conditions... [W]e have implemented checks to help us poor humans spot things like this. To detect malicious Unicode. We have added a CI job that scans all files and validates every UTF-8 sequence in the git repository. \n\nIn the curl git repository most files and most content are plain old ASCII so we can \"easily\" whitelist a small set of UTF-8 sequences and some specific files, the rest of the files are simply not allowed to use UTF-8 at all as they will then fail the CI job and turn up red. In order to drive this change home, we went through all the test files in the curl",
        "id": 2704875,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/17/0420236/curl-warns-github-about-malicious-unicode-security-issue?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Curl Warns GitHub About 'Malicious Unicode' Security Issue",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T17:39:47.923304+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T16:34:00+00:00",
        "description": "\"Shares of Ubisoft sank 18% on Thursday,\" reports CNBC, \"after the French video game firm reported full-year earnings that disappointed investors... The company's shares have lost almost 60% of their value in the past 12 months, as the firm faced financial struggles, development hurdles, and underperformance of some of its key titles.\" \n\nUbisoft said its latest Assassin's Creed game \"delivered the second-highest Day 1 sales revenue in franchise history and set a new record for Ubisoft's Day 1 performance on the PlayStation digital store,\" according to Reuters. And AFP notes that according to data from consultancy Circana, that game become the second-best-selling game of the year so far in the U.S. But...\n\n\n[A] string of disappointing releases undermined this year's performance, with a net loss of 159 million euros ($178 million) on revenues of 1.9 billion &mdash; down 17.5 percent year-on-year. Over the past 12 months, Ubisoft's would-be blockbuster \"Star Wars Outlaws\" fell short of s",
        "id": 2704593,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/17/0741237/despite-success-of-new-assassins-creed-game-ubisoft-stock-tumbles-18?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Despite Success of New 'Assassin's Creed' Game, Ubisoft Stock Tumbles 18%",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T16:34:47.094720+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T15:34:00+00:00",
        "description": "\"With the help of more than five dozen fossils, paleontologists have uncovered a tiny three-eyed predator nicknamed the 'sea moth',\" reports CNN, \"that swam in Earth's oceans 506 million years ago.\" \n\nTiny as in 15 to 61 mm in total body length. (That's 0.60 to 2.4 inches...) But check out the illustration in CNN's article...\n\n\n\nMosura fentoni, as the species is known, belongs to a group called radiodonts, an early offshoot of the arthropod evolutionary tree, according to a new study published Tuesday in the journal Royal Society Open Science. While radiodonts are now extinct, studying their fossilized remains can illuminate how modern arthropods such as insects, spiders and crabs evolved. One of the most diverse animal groups, arthropods are believed to account for more than 80% of living animal species, said lead study author Dr. Joe Moysiuk, curator of paleontology and geology at the Manitoba Museum in Winnipeg. \n\nWell-preserved specimens of the previously unknown Mosura fentoni al",
        "id": 2704227,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/17/0520213/paleontologists-identify-tiny-three-eyed-sea-moth-predator-in-fossils?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Paleontologists Identify Tiny Three-Eyed 'Sea Moth' Predator in Fossils",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T15:28:33.155294+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T14:34:00+00:00",
        "description": "Thursday was Rust's 10-year anniversary for its first stable release. \"To say I'm surprised by its trajectory would be a vast understatement,\" writes Rust's original creator Graydon Hoare. \"I can only thank, congratulate, and celebrate everyone involved... In my view, Rust is a story about a large community of stakeholders coming together to design, build, maintain, and expand shared technical infrastructure.\"\n\nIt's a story with many actors: \n- The population of developers the language serves who express their needs and constraints through discussion, debate, testing, and bug reports arising from their experience writing libraries and applications. \n- The language designers and implementers who work to satisfy those needs and constraints while wrestling with the unexpected consequences of each decision. \n- The authors, educators, speakers, translators, illustrators, and others who work to expand the set of people able to use the infrastructure and work on the infrastructure. \n- The in",
        "id": 2703867,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/16/2119222/rust-creator-graydon-hoare-thanks-its-many-stakeholders---and-mozilla---on-rusts-10th-anniversary?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Rust Creator Graydon Hoare Thanks Its Many Stakeholders - and Mozilla - on Rust's 10th Anniversary",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T11:07:17.616128+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T10:00:00+00:00",
        "description": "Australia's first orbital-class rocket launch was delayed after the nose cone of Gilmour Space's Eris rocket unexpectedly detached due to an electrical fault during final preparations. Although no damage occurred and no payload was onboard, the company is postponing the launch to investigate and replace the fairing before attempting another test flight. Ars Technica reports: Gilmour, the Australian startup that developed the Eris rocket, announced the setback in a post to the company's social media accounts Thursday. \"During final launch preparations last night, an electrical fault triggered the system that opens the rocket's nose cone (the payload fairing),\" Gilmour posted on LinkedIn. \"This happened before any fuel was loaded into the vehicle. Most importantly, no one was injured, and early checks show no damage to the rocket or the launch pad.\"\n \nGilmour was gearing up for a launch attempt from a privately owned spaceport in the Australian state of Queensland early Friday, local ti",
        "id": 2702480,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/17/0114259/the-top-fell-off-australias-first-orbital-class-rocket-delaying-its-launch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Top Fell Off Australia's First Orbital-Class Rocket, Delaying Its Launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T07:51:46.158713+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T07:00:00+00:00",
        "description": "NASA engineers have successfully revived Voyager 1's backup thrusters, unused since 2004 and once considered defunct. Space.com reports: This remarkable feat became necessary because the spacecraft's primary thrusters, which control its orientation, have been degrading due to residue buildup. If its thrusters fail completely, Voyager 1 could lose its ability to point its antenna toward Earth, therefore cutting off communication with Earth after nearly 50 years of operation. To make matters more urgent, the team faced a strict deadline while trying to remedy the thruster situation. After May 4, the Earth-based antenna that sends commands to Voyager 1 -- and its twin, Voyager 2 -- was scheduled to go offline for months of upgrades. This would have made timely intervention impossible.\n \nTo solve the problem, NASA's team had to reactivate Voyager 1's long-dormant backup roll thrusters and then attempt to restart the heaters that keep them operational. If the star tracker drifted too far f",
        "id": 2701701,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/17/0111201/nasa-resurrects-voyager-1-interstellar-spacecrafts-thrusters-after-20-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA Resurrects Voyager 1 Interstellar Spacecraft's Thrusters After 20 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T04:37:43.894119+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: U.S. health officials on Friday endorsed the first blood test that can help diagnose Alzheimer's and identify patients who may benefit from drugs that can modestly slow the memory-destroying disease. The test can aid doctors in determining whether a patient's memory problems are due to Alzheimer's or a number of other medical conditions that can cause cognitive difficulties. The Food and Drug Administration cleared it for patients 55 and older who are showing early signs of the disease.\n \nThe new test, from Fujirebio Diagnostics, Inc., identifies a sticky brain plaque, known as beta-amyloid, that is a key marker for Alzheimer's. Previously, the only FDA-approved methods for detecting amyloid were invasive tests of spinal fluid or expensive PET scans. The lower costs and convenience of a blood test could also help expand use of two new drugs, Leqembi and Kisunla, which have been shown to slightly slow the progression of Alz",
        "id": 2701127,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/16/2143244/fda-clears-first-blood-test-to-help-diagnose-alzheimers-disease?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FDA Clears First Blood Test To Help Diagnose Alzheimer's Disease",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T02:23:09.908579+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T01:35:00+00:00",
        "description": "Microsoft has released Command Palette, an enhanced version of its PowerToys Run launcher introduced five years ago. The utility, aimed at power users and developers, provides quick access to applications, files, calculations, and system commands through a Spotlight-like interface. \n\nCommand Palette integrates the previously separate Window Walker functionality for switching between open windows and supports launching command prompts, executing web searches, and navigating folder structures. Unlike its predecessor, the new launcher offers full customization via extensions, allowing users to implement additional commands beyond default capabilities. Available through the PowerToys application since early April, Command Palette can be triggered using Win+Alt+Space after installation<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft's+Command+Palette+is+a+Powerful+Launcher+For+Apps%2C+Search%3A+https%3A%2F%2Fit.",
        "id": 2700740,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/17/0135210/microsofts-command-palette-is-a-powerful-launcher-for-apps-search?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's Command Palette is a Powerful Launcher For Apps, Search",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T01:18:07.759509+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T00:50:00+00:00",
        "description": "Walmart is preparing for a future where AI agents shop on behalf of consumers by adapting its systems to serve both humans and autonomous bots. As major players like Visa and PayPal also invest in agentic commerce, Walmart is positioning itself as a leader by developing its own AI agents and supporting broader industry integration. PYMNTS reports: Instead of scrolling through ads or comparing product reviews, future consumers may rely on digital assistants, like OpenAI's Operator, to manage their shopping lists, from replenishing household essentials to selecting the best TV based on personal preferences, according to the report (paywalled). \"It will be different,\" Walmart U.S. Chief Technology Officer Hari Vasudev said, per the report. \"Advertising will have to evolve.\" The emergence of AI-generated summaries in search results has already altered the way consumers gather product information, the report said. However, autonomous shopping agents represent a bigger transformation. These",
        "id": 2700537,
        "language": null,
        "link": "https://slashdot.org/story/25/05/16/2138230/walmart-prepares-for-a-future-where-ai-shops-for-consumers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Walmart Prepares for a Future Where AI Shops for Consumers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T01:18:07.916699+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T00:10:00+00:00",
        "description": "In an exclusive interview with the BBC, AWS CEO Matt Garman said the UK must expand nuclear energy to meet the soaring electricity demands of AI-driven data centers. From the report: Amazon Web Services (AWS), which is part of the retail giant Amazon, plans to spend 8 billion pounds on new data centers in the UK over the next four years. Matt Garman, chief executive of AWS, told the BBC nuclear is a \"great solution\" to data centres' energy needs as \"an excellent source of zero carbon, 24/7 power.\" AWS is the single largest corporate buyer of renewable energy in the world and has funded more than 40 renewable solar and wind farm projects in the UK.\n \nThe UK's 500 data centres currently consume 2.5% of all electricity in the UK, while Ireland's 80 hoover up 21% of the country's total power, with those numbers projected to hit 6% and 30% respectively by 2030. The body that runs the UK's power grid estimates that by 2050 data centers alone will use nearly as much energy as all industrial ",
        "id": 2700538,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/16/2133225/uk-needs-more-nuclear-to-power-ai-says-amazon-boss?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Needs More Nuclear To Power AI, Says Amazon Boss",
        "vote": 0
    }
]