[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T20:42:14.466456+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T20:00:36+00:00",
        "description": "Developed by the studio known for its series of games adapting Sherlock Holmes, The Sinking City was originally released all the way back in 2019. At the time, the game was praised for its interesting take on horror, but many publications, us included, criticized its overall lack of polish and clunky combat. Six years later, The Sinking City is back, this time around with a fresh coat of paint.\n\nThe move to Unreal Engine 5 definitely shows when it comes to the visuals. However, The Sinking City Remastered still has a few spots where not enough attention was paid, like the terrible rendition of facial hair. In terms of gameplay, its investigative aspects remain as fun as they were back then, but even with improved controls, combat still feels like a chore that the game would have been better off without.",
        "id": 2705386,
        "language": null,
        "link": "https://www.youtube.com/watch?v=qHtnu-plB6w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qHtnu-plB6w/hqdefault.jpg",
        "title": "Sinking City Remastered Review - Is It A Worthy Upgrade?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T16:22:18.044040+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T15:30:00+00:00",
        "description": "Hondo Ohnaka steals the spotlight, and the short but exciting showcase with the Rokana Raider ship was a memorable highlight in Star Wars Outlaws: A Pirate’s Fortune. Hopefully, the developers can continue to build on these changes and deliver more gameplay refinements in the future. \n\nThat said, it’s hard to ignore the reality that Star Wars Outlaws has underperformed where it mattered most: sales figures. If only these improvements had been part of the initial launch, the story of this game might have played out very differently. \n\nIt was pretty clear that Star Wars Outlaws was rushed out and the results were in front of of us back then. And with that, A Pirate’s Fortune may very well be the final outing for Kay Vess and her companion, Nix.",
        "id": 2704098,
        "language": null,
        "link": "https://www.youtube.com/watch?v=-dkqRixLLEM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-dkqRixLLEM/hqdefault.jpg",
        "title": "Star Wars Outlaws: A Pirate’s Fortune DLC Review - A Fantastic Turnaround",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-17T14:06:39.982907+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-17T13:30:13+00:00",
        "description": "Brushes With Death can take anywhere between seven to ten hours. While that means significant back and forth between locations even while fast-traveling, and completing seemingly menial tasks, it also translates into plenty of interesting conversations and well-voiced characters. \n\nIt's definitely worth picking up alongside Kingdom Come: Deliverance 2, especially if you're diving into the open-world action RPG for the first time. However, you might want to wait for the developers to issue some fixes, since the latest patch introduced a few texture glitches. Though I didn't find it particularly rampant during my time with the DLC, it was noticeable enough during some scenes.",
        "id": 2703369,
        "language": null,
        "link": "https://www.youtube.com/watch?v=AJTNRL2cgB0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AJTNRL2cgB0/hqdefault.jpg",
        "title": "Kingdom Come Deliverance 2: Brushes With Death DLC Review - The Final Verdict",
        "vote": 0
    }
]