[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T22:55:22.590931+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T22:19:00+00:00",
        "description": "An anonymous reader shared this report from Kotaku:\n\nOne of the most striking things about Bungie's Marathon is its presentation. The sci-fi extraction shooter combines bleak settings with bright colors in a way that makes it feel a bit like a sneaker promo meets Ghost in the Shell, or as designer Jeremy Skoog put it, \"Y2K Cyberpunk mixed with Acid Graphic Design Posters.\" But it now looks like at least a few of the visual design elements that appeared in the recent alpha test were lifted from eight-year old work by an outside artist. \n\n\"The Marathon alpha released recently and its environments are covered with assets lifted from poster designs I made in 2017,\" Bluesky user antire.al&#226; posted on Thursday. She shared two images showing elements of her work and where they appeared in Marathon's gameplay, including a rotated version of her own logo. A poster full of small repeating icon patterns also seems to be all but recreated in Marathon's press kit ARG and website... \n\n\nBungie h",
        "id": 2711936,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/18/2216254/bungie-blames-stolen-marathon-art-on-former-developer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bungie Blames Stolen 'Marathon' Art On Former Developer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T21:50:21.666940+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T21:02:00+00:00",
        "description": "The BBC visits \"the strange, stubborn world of obsolete Windows machines.\"\n\nEven if you're a diehard Apple user, you're probably interacting with Windows systems on a regular basis. When you're pulling cash out, for example, chances are you're using a computer that's downright geriatric by technology standards. (Microsoft declined to comment for this article.) \"Many ATMs still operate on legacy Windows systems, including Windows XP and even Windows NT,\" which launched in 1993, says Elvis Montiero, an ATM field technician based in Newark, New Jersey in the US. \"The challenge with upgrading these machines lies in the high costs associated with hardware compatibility, regulatory compliance and the need to rewrite proprietary ATM software,\" he says. Microsoft ended official support for Windows XP in 2014, but Montiero says many ATMs still rely on these primordial systems thanks to their reliability, stability and integration with banking infrastructure. \n\nAnd a job listing for an IT syste",
        "id": 2711605,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/18/2059226/the-people-stuck-using-ancient-windows-computers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'The People Stuck Using Ancient Windows Computers'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T20:45:22.059179+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T19:59:00+00:00",
        "description": "While Amazon won FAA approval to fly beyond an operators' visual line of sight, \"the program remains a work in progress,\" reports Bloomberg:\n\n\nA pair of Amazon.com Inc. package delivery drones were flying through a light rain in mid-December when, within minutes of one another, they both committed robot suicide... [S]ome 217 feet (66 meters) in the air [at a drone testing facility], the aircraft cut power to its six propellers, fell to the ground and was destroyed. Four minutes later and 183 feet over the taxiway, a second Prime Air drone did the same thing. \n\nNot long after the incidents, Amazon paused its experimental drone flights to tweak the aircraft software but said the crashes weren't the \"primary reason\" for halting the program. Now, five months after the twin crashes, a more detailed explanation of what happened is starting to emerge. Faulty readings from lidar sensors made the drones think they had landed, prompting the software to shut down the propellers, according to Nat",
        "id": 2711290,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/18/1957205/why-two-amazon-drones-crashed-at-a-test-facility-in-a-december?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why Two Amazon Drones Crashed at a Test Facility in a December",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T19:41:44.959128+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T18:45:00+00:00",
        "description": "IBM laid off \"a couple hundred\" HR workers and replaced them with AI agents. \"It's becoming a huge thing,\" says Mike Peditto, a Chicago-area consultant with 15 years of experience advising companies on hiring practices. He tells Slate \"I do think we're heading to where this will be pretty commonplace.\"\n\n\nAlthough A.I. job interviews have been happening since at least 2023, the trend has received a surge of attention in recent weeks thanks to several viral TikTok videos in which users share videos of their A.I. bots glitching. Although some of the videos were fakes posted by a creator whose bio warns that his content is \"all satire,\" some are authentic &mdash; like that of Kendiana Colin, a 20-year-old student at Ohio State University who had to interact with an A.I. bot after she applied for a summer job at a stretching studio outside Columbus. In a clip she posted online earlier this month, Colin can be seen conducting a video interview with a smiling white brunette named Alex, who c",
        "id": 2710893,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/18/1842225/when-a-company-does-job-interviews-with-a-malfunctioning-ai---and-then-rejects-you?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "When a Company Does Job Interviews with a Malfunctioning AI - and Then  Rejects You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T18:35:28.599863+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T17:34:00+00:00",
        "description": "The Prossimo project (funded by the nonprofit Internet Security Research Group) seeks to \"move the Internet's security-sensitive software infrastructure to memory safe code.\" Two years ago the Prossimo project made an announcement: they'd begun work on rav1d, a safer high performance AV1 decoder written in Rust, according to a new update:\n\n\nWe partnered with Immunant to do the engineering work. By September of 2024 rav1d was basically complete and we learned a lot during the process. Today rav1d works well &mdash; it passes all the same tests as the dav1d decoder it is based on, which is written in C. It's possible to build and run Chromium with it. \nThere's just one problem &mdash; it's not quite as fast as the C version... \n\nOur Rust-based rav1d decoder is currently about 5% slower than the C-based dav1d decoder (the exact amount differs a bit depending on the benchmark, input, and platform). This is enough of a difference to be a problem for potential adopters, and, frankly, it jus",
        "id": 2710514,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/18/0257255/rust-is-so-good-you-can-get-paid-20k-to-make-it-as-fast-as-c?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Rust is So Good You Can Get Paid $20K to Make It as Fast as C'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T17:30:23.850518+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T16:34:00+00:00",
        "description": "The only nuclear power plant still operating in Taiwan was shut down on Saturday, reports Japan's public media organization NHK:\n\nPeople in Taiwan have grown increasingly concerned about nuclear safety in recent years, especially after the 2011 nuclear disaster in Fukushima, northeastern Japan... Taiwan's energy authorities plan to focus more on thermoelectricity fueled by liquefied natural gas. They aim to source 20 percent of all electricity from renewables such as wind and solar power next year. \nAFP notes that nuclear power once provided more than half of Taiwan's energy, with three plants operating six reactors across an island that's 394 km (245 mi) long and 144 km (89 mi) wide. \n\nSo the new move to close Taiwan's last reactor is \"fuelling concerns over the self-ruled island's reliance on imported energy and vulnerability to a Chinese blockade,\" &mdash; though Taiwan's president insists the missing nucelar energy can be replace by new units in LNG and coal-fired plants:\n\n\n\nThe i",
        "id": 2710209,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/18/1549202/taiwan-shuts-down-its-last-nuclear-reactor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Taiwan Shuts Down Its Last Nuclear Reactor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T16:25:23.634192+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T15:34:00+00:00",
        "description": "During this year's annual Pwn2Own contest, two researchers from Palo Alto Networks demonstrated an out-of-bounds write vulnerability in Mozilla Firefox, reports Cyber Security News, \"earning $50,000 and 5 Master of Pwn points.\" And the next day another participant used an integer overflow to exploit Mozilla Firefox (renderer only). \n\n\nBut Mozilla's security blog reminds users that a sandbox escape would be required to break out from a tab to gain wider system access \"due to Firefox's robust security architecture\" &mdash; and that \"neither participating group was able to escape our sandbox...\"\n\nWe have verbal confirmation that this is attributed to the recent architectural improvements to our Firefox sandbox which have neutered a wide range of such attacks. This continues to build confidence in Firefox's strong security posture. \n\nEven though neither attack could escape their sandbox, \"Out of abundance of caution, we just released new Firefox versions... all within the same day of the ",
        "id": 2709825,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/18/0558219/firefox-announces-same-day-update-after-two-minor-pwn2own-exploits?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Firefox Announces Same-Day Update After Two Minor Pwn2Own Exploits",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T15:20:21.825550+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T14:34:00+00:00",
        "description": "It's a nonprofit that's provide hosting for the Linux Foundation, the Apache Software Foundation, Drupal, Firefox, and 160 other projects &mdash; delivering nearly 430 terabytes of information every month. (It's currently hosting Debian, Fedora, and Gentoo Linux.) But hosting only provides about 20% of its income, with the rest coming from individual and corporate donors (including Google and IBM). \"Over the past several years, we have been operating at a deficit due to a decline in corporate donations,\" the Open Source Lab's director announced in late April. \n\nIt's part of the CS/electrical engineering department at Oregon State University, and while the department \"has generously filled this gap, recent changes in university funding makes our current funding model no longer sustainable. Unless we secure $250,000 in committed funds, the OSL will shut down later this year.\" \n\nBut \"Thankfully, the call for support worked, paving the way for the OSU Open Source Lab to look ahead, into w",
        "id": 2709442,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/18/044230/osus-open-source-lab-eyes-infrastructure-upgrades-and-sustainability-after-recent-funding-success?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OSU's Open Source Lab Eyes Infrastructure Upgrades and Sustainability After Recent Funding Success",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T12:05:25.313019+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T11:34:00+00:00",
        "description": "A new YouTube tool will let advertisers use Google's Gemini AI model to target ads to viewers when they're most engaged, reports CNBC:\n\nPeak Points has the potential to enable more impressions and a higher click-through rate on YouTube, a primary metric that determines how creators earn money on the video platform... Peak Points is currently in a pilot program and will be rolling out over the rest of the year.\n \n\nThe product \"aims to benefit advertisers by using a tactic that aims to grab users' attention right when they're most invested in the content,\" reports TechCrunch:\n\nThis approach appears to be similar to a strategy called emotion-based targeting, where advertisers place ads that align with the emotions evoked by the video. It's believed that when viewers experience heightened emotional states, it leads to better recall of the ads. However, viewers may find these interruptions frustrating, especially when they're deeply engaged in the emotional arc of a video and want the ad t",
        "id": 2708448,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/17/1954232/youtube-announces-gemini-ai-feature-to-target-ads-when-viewers-are-most-engaged?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "YouTube Announces Gemini AI Feature to Target Ads When Viewers are Most Engaged",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T07:45:22.048737+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T07:34:00+00:00",
        "description": "Last August a Microsoft security update broke dual-booting Windows 11 and Linux systems, remembers the blog Neowin. Distros like Debian, Ubuntu, Linux Mint, Zorin OS, and Puppy Linux were all affected, and \"a couple of days later, Microsoft provided a slightly lengthy workaround that involved tweaking around with policies and the Registry in order to fix the problem.\" \n\nThe update \"was meant to address a GRUB bootloader vulnerability that allowed malicious actors to bypass Secure Boot's safety mechanisms,\" notes the It's FOSS blog. \"Luckily, there's now a proper fix for this, as Microsoft has quietly released a new patch on May 13, 2025, addressing the issue nine months after it was first reported... Meanwhile, many dual-boot users were left with borked setups, having to use workarounds or disable Secure Boot altogether.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=9+Months+Later%2C+Microsoft+Finally+Fixes+Linux+",
        "id": 2707373,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/05/18/0452232/9-months-later-microsoft-finally-fixes-linux-dual-booting-bug?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "9 Months Later, Microsoft Finally Fixes Linux Dual-Booting Bug",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T04:31:45.650231+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T03:34:00+00:00",
        "description": "Amazon's AWS Labs has created LLRT an experimental, lightweight JavaScript runtime designed to address the growing demand for fast and efficient serverless applications. \n\nSlashdot reader BitterEpic wants to know what you think of it:\n\nTraditional JavaScript runtimes like Node.js rely on garbage collection, which can introduce unpredictable pauses and slow down performance, especially during cold starts in serverless environments like AWS Lambda. LLRT's manual memory management, courtesy of Rust, eliminates this issue, leading to smoother, more predictable performance. LLRT also has a runtime under 2MB, a huge reduction compared to the 100MB+ typically required by Node.js. This lightweight design means lower memory usage, better scalability, and reduced operational costs. Without the overhead of garbage collection, LLRT has faster cold start times and can initialize in milliseconds&mdash;perfect for latency-sensitive applications where every millisecond counts. For JavaScript develope",
        "id": 2706839,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/18/019247/ask-slashdot-would-you-consider-a-low-latency-javascript-runtime-for-your-workflow?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ask Slashdot: Would You Consider a Low-Latency JavaScript Runtime For Your Workflow?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T02:20:22.660821+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T01:34:00+00:00",
        "description": "An anonymous reader shared this report from Ars Technica:\n\nNextcloud, a host-your-own cloud platform that wants to help you \"regain control over your data,\" has had to tell its Android-using customers for months now that they cannot upload files from their phone to their own servers. Months of emails and explanations to Google's Play Store representatives have yielded no changes, Nextcloud . \n\n\nThat blog post &mdash; and media coverage of it &mdash; seem to have moved the needle. In an update to the post, Nextcloud wrote that as of May 15, Google has offered to restore full file access permissions. \"We are preparing a test release first (expected tonight) and a final update with all functionality restored. If no issues occur, the update will hopefully be out early next week,\" the Nextcloud team wrote.... \n\n[Nextcloud] told The Register that it had more than 800,000 Android users. The company's blog post goes further than pinpointing technical and support hurdles. \"It is a clear exampl",
        "id": 2706516,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/17/2312252/google-restores-nextcloud-users-file-access-on-android?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Restores Nextcloud Users' File Access on Android",
        "vote": 0
    }
]