[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T20:32:30.613047+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T20:00:04+00:00",
        "description": "Nintendo loves to pair its console releases with gimmicky tech demo style games or experiences, and this time, it is releasing the Switch 2 alongside Nintendo Switch 2 Welcome Tour, a tech demo of sorts that serves as a guided tour of the upcoming next-gen console, its hardware, its feature, its innards, and more. \n\nFeaturing several minigames, mini tech demos, factoids and information drops, and more, Nintendo Switch 2 Welcome Tour will attempt to deliver details about the console to players in a variety of different ways. Here, we talk about that, the game’s pricing, why it even is priced, and more.",
        "id": 2711181,
        "language": null,
        "link": "https://www.youtube.com/watch?v=80w4kZFRB40",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/80w4kZFRB40/hqdefault.jpg",
        "title": "Nintendo Switch 2 Welcome Tour - 15 Things YOU NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T16:12:25.233906+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T15:30:10+00:00",
        "description": "As you would expect from a game coming from the mind of Hideo Kojima, Death Stranding’s world is brimming with oodles of lore and backstory, all of which is delightfully convoluted and dense- as is the Kojima way. \n\nAnd amidst all of that narrative content, nothing is more strongly associated with Death Stranding as the BBs, the ones in pods who serve as bridges to the world of the dead and serve as equipment to detect the presence of nearby ghostly entities known as Beached Things, or BTs. \n\nBBs will obviously continue to play an important role in the upcoming Death Stranding 2, so ahead of the sequel’s release, here, we’re going to offer a refresher on everything you should know about them.",
        "id": 2709702,
        "language": null,
        "link": "https://www.youtube.com/watch?v=NkAKClV7q78",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NkAKClV7q78/hqdefault.jpg",
        "title": "The Mystery of BBs Explained - Before You Play Death Stranding 2",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T14:02:37.438345+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T13:30:41+00:00",
        "description": "Among the various multiplayer-only offerings this year, Elden Ring Nightreign by FromSoftware is perhaps the most enticing. It takes the combat, art direction, enemies, and more from Elden Ring and places them within a co-op-focused battle rogue-like scenario where players must be strong enough to take on the Nightlords.\n\nThe real question is whether it would be for those who enjoyed the base game. After all, Nightreign is online-only, and despite giving players options to go into Limveld solo, it's geared towards co-op play. You also can't design your own character and must work around their default skills and Ultimates. Any weapons or gear discovered in a run are gone when it ends (barring the Relics gained at the end).\n\nIt's a significant change of pace as well. Elden Ring Nightreign launches on May 30th for PS5, Xbox One, Xbox Series X/S, PS4, and PC, so let's outline the biggest differences between both titles.",
        "id": 2708960,
        "language": null,
        "link": "https://www.youtube.com/watch?v=lI3jstgLJtw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lI3jstgLJtw/hqdefault.jpg",
        "title": "Elden Ring Nightreign vs Elden Ring - 15 BIGGEST DIFFERENCES You Need To Know",
        "vote": 0
    }
]