[
    {
        "age": null,
        "album": "",
        "author": "China Insights-SOHTV",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T03:12:04.591103+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T03:04:05+00:00",
        "description": "Since taking power in 1949, the Chinese Communist Party has systematically suppressed religious belief and promoted atheism as a state ideology. Temples were destroyed, churches shut down, and sacred icons smashed. Millions of believers have faced persecution. Through education, propaganda, censorship, and violence, the CCP has tried to sever 1.4 billion people from their faith and replace spiritual values with loyalty to the Party. Traditional morality and belief in the soul are being erased, pushing China toward a cold, godless society.",
        "id": 2706621,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QjHkjuSm12w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 68,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCwjvvgGX6oby5mZ3gbDe8Ug",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QjHkjuSm12w/hqdefault.jpg",
        "title": "NO BELIEF CHINESE#shorts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "China Insights-SOHTV",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-18T03:12:04.782418+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-18T02:17:19+00:00",
        "description": "Below is a YouTube description tailored for the video, based on the provided context and the long title \"ILLEGAL SURROGACY EXPOSED: THE SHOCKING TRUTH BEHIND GUARANTEED BOYS AND UNDERGROUND BABY TRADE IN CHINA\". It’s concise, engaging, and includes key details to draw viewers in while summarizing the content and encouraging interaction.\n\nILLEGAL SURROGACY EXPOSED: THE SHOCKING TRUTH BEHIND GUARANTEED BOYS AND UNDERGROUND BABY TRADE IN CHINA\n\nDive into the chilling world of China’s illegal surrogacy industry, where human lives are commodified, and \"guaranteed boys\" fetch millions. This exposé uncovers hidden operating rooms, secret labs, and exploited women coerced into dangerous procedures for as little as $1,400. From Changsha’s high-security dens to a 16-year-old surrogate mother, we reveal how profit-driven networks evade justice, exploiting legal loopholes and vulnerable lives.\n\nWhistleblower Shangguan risks his life to bring these horrors to light, facing death threats and offers",
        "id": 2706622,
        "language": null,
        "link": "https://www.youtube.com/watch?v=aBWAwymIKKA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 68,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCwjvvgGX6oby5mZ3gbDe8Ug",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aBWAwymIKKA/hqdefault.jpg",
        "title": "ILLEGAL SURROGACY EXPOSED: THE SHOCKING TRUTH BEHIND GUARANTEED BOYS AND UNDERGROUND BABY TRADE",
        "vote": 0
    }
]