[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-24T21:01:05.906950+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-24T20:00:21+00:00",
        "description": "La Quimera is a uniquely styled sci-fi FPS. The Latin America setting is something we haven’t seen much of, and the mixing of high-rises and jungle landscapes provides a unique playground to fight in. This new FPS comes courtesy of Reburn studios; a new team from Metro series developers 4A Games. \n\nThere’s already been a day-long closed beta, so footage is out there for a couple of the missions. The graphics are AAA standard here, and the framerate seems stable. Players can pre-order La Quimera on Steam for only $29.99. There’s no word yet if it’ll come out on other consoles.",
        "id": 4273,
        "language": null,
        "link": "https://www.youtube.com/watch?v=_RoW8F4BXAk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_RoW8F4BXAk/hqdefault.jpg",
        "title": "Metro Dev's La Quimera - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-24T21:01:06.051396+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-24T20:00:12+00:00",
        "description": "Forza Horizon 5 has been widely touted as one of the greatest racing games of all time since its release for Xbox and PC back in 2021, and now that it is coming over almost as is (plus, with all of its solid post launch content included) to the PS5 as part of Microsoft’s rapidly expanding multiplatform publishing plans, it is no surprise that it impresses on its newest platform as well. \n\nPlayground Games’ open world racer remains an unmitigated modern classic, touting an excellently crafted map, gorgeous visuals, best in class driving mechanics, and a plethora of content that is as fun as it is varied. Forza Horizon 5 instantly becomes one of the best racers in PlayStation history.",
        "id": 4274,
        "language": null,
        "link": "https://www.youtube.com/watch?v=HZ19dSs4MGw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HZ19dSs4MGw/hqdefault.jpg",
        "title": "Forza Horizon 5 PS5 Review - Still Game of the Year Material",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-24T21:01:06.199468+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-24T14:00:03+00:00",
        "description": "Upon first entering the world of Clair Obscur: Expedition 33, it's easy to pick up the mechanics. Action Points, skills, stats - it's pretty straightforward. Of course, things quickly become more complicated, whether you're tackling the tougher side content or figuring out the best builds.\n\nIt's especially challenging once enemies unleash more complex patterns and status effects while your party's skills become increasingly more involved. Thankfully, Sandfall Interactive offers numerous tools for pushing back, from various ways to regain Action Points to broken builds that can topple some of the biggest threats with relative ease.\n\nFor those who want to know when is the best time to dodge, how to best take advantage of stat points upon levelling, and much more, check out 15 tips and tricks ahead of the game's launch on April 24th for Xbox Series X/S, PS5, and PC.",
        "id": 4275,
        "language": null,
        "link": "https://www.youtube.com/watch?v=28ztjWKJXV0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/28ztjWKJXV0/hqdefault.jpg",
        "title": "Clair Obscur: Expedition 33 - 15 Things I Wish I Knew Before Playing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-24T21:01:06.351577+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-24T09:30:03+00:00",
        "description": "Among the many role-playing franchises in gaming, The Elder Scrolls commands a strong following. It's easy to forget, especially with how long Bethesda takes between releases (don't ask how long ago The Elder Scrolls 6 was announced). However, The Elder Scrolls 4: Oblivion Remastered - hotly rumored and now finally released - showcases why.\n\nAmid the visual overhaul, with every asset remade from the ground up in Unreal Engine 5 and various quality-of-life improvements (including for combat and levelling) is a timeless adventure. The exploration across Cyrodiil - it all holds up as well today as it did 19 years ago.\n\nSome aspects show their age, between the simplistic combat and dungeon design. Nevertheless, Virtuos and Bethesda have retained the essence of Oblivion and offered an incredible gateway for fans and newcomers to experience the classic.",
        "id": 4276,
        "language": null,
        "link": "https://www.youtube.com/watch?v=23-0veeWN1s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/23-0veeWN1s/hqdefault.jpg",
        "title": "The Elder Scrolls 4: Oblivion Remastered Review - It's 2006 All Over Again",
        "vote": 0
    }
]