[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-16T19:04:58.378577+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-16T18:31:11+00:00",
        "description": "Forever Skies is a new survival game with its own unique twist on the genre. Rather than focusing on the player laying down the foundations of their home base on a plot of land, the game instead has you use your home base - an airship - as your main method of exploration. Throw on top the fact that you can design and customize your airship to your heart’s content means that fans of building in survival games will have plenty to play with.\n\nSadly, because of the title's emphasis on the airship itself, its other survival mechanics end up feeling quite superfluous. None of the typical survival mechanics you expect from a game like this, like hunger and thirst, ever pose any threat. The combat also doesn’t add much to the gameplay, no thanks to its dull encounters.",
        "id": 2573416,
        "language": null,
        "link": "https://www.youtube.com/watch?v=wZBsfIHR-ZA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wZBsfIHR-ZA/hqdefault.jpg",
        "title": "Forever Skies Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-16T19:04:58.495917+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-16T18:30:14+00:00",
        "description": "If you’re keen on physics-based games or 2D platformers in general, Bionic Bay is sure to delight. Developed by a small indie team comprised of Psychoflow, Bionic Bay takes 2D platforming and adds procedural physics puzzles to the mix.\n\nThis game isn’t strictly a precision platformer, nor is it focused just on puzzles, it’s a nice combination of the two. Your abilities include freezing time, swapping your position with objects, and even rotating the screen. Adventuring through this atmospheric biomechanical world is mostly linear in nature. Though, there is some creativity and openness involved with the physics puzzles.\n\nIf the 10-hour adventure isn’t enough, there’s online leaderboards and a speed run mode to try your hand at. If you like platformers, you’ll find something to enjoy with Bionic when it releases on April 17th on PC and PS5.",
        "id": 2573417,
        "language": null,
        "link": "https://www.youtube.com/watch?v=9tskngOUQRE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9tskngOUQRE/hqdefault.jpg",
        "title": "Bionic Bay Review - One of the Most Unique Games of 2025 So Far",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-16T14:46:21.526791+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-16T14:01:29+00:00",
        "description": "With the rumor mill loudly insisting that a remake of The Elder Scrolls 4: Oblivion is set to be revealed and released imminently, there’s plenty of excitement to go around within the series’ fanbase. \n\nElder Scrolls’ last mainline release, Skyrim, was close to a decade and a half ago, and at present, it doesn’t look like the next one is going to release for at least another handful of years- which is why this supposedly upcoming remake of Oblivion feels so well timed. \n\nThat is, on top of the fact that a modernized and enhanced remake would also be a great way to re-experience what remains one of Bethesda’s best to this day.",
        "id": 2570857,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oQGtEj2W97M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oQGtEj2W97M/hqdefault.jpg",
        "title": "The Elder Scrolls 4 Oblivion Remake/Remaster IS VERY MUCH Real - Here's Why I Am Super Excited",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-16T11:17:46.233996+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-16T10:00:31+00:00",
        "description": "Thanks to NordCurrent for sponsoring this video.\n\nCheck out Chains of Freedom here: https://store.steampowered.com/app/2994010/Chains_of_Freedom/?utm_source=GamingBolt&utm_medium=ico&utm_campaign=CoF_Launch\n\nStrategy games can be hit or miss, depending on the audience. Take strategy titles - they need to weave intricate systems that are approachable for newcomers but still deep enough to satisfy hardcore players. Make things too easy to get into, and you risk alienating the latter. Too much complexity, and it's a game that newcomers may think twice about really spending time to learn the ins and outs.\n\nTurn-based tactical strategy games are no different, though they often leave more room for experimentation and deviation from the norm. Some take inspiration from the XCOM series, widely considered the gold standard, while carving out their own identity like Mutant Year Zero. For all their complexity, the core gameplay loop of jumping into battle, leveraging cover and outwitting your en",
        "id": 2569199,
        "language": null,
        "link": "https://www.youtube.com/watch?v=FTXdrhh8OXc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FTXdrhh8OXc/hqdefault.jpg",
        "title": "CHAINS OF FREEDOM – A Grim Eastern European Tactical Game With An XCOM-Like Twist",
        "vote": 0
    }
]