[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T23:36:53.741306+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T23:20:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: London cops on Tuesday arrested two teenagers on suspicion of computer misuse and blackmail following a ransomware attack on a chain of London preschools. London's Metropolitan Police said the two men, both aged 17, were taken into custody during an operation at residential properties in Bishop's Stortford, Hertfordshire. The arrests followed a September 25 referral from the UK's Action Fraud reporting center detailing a ransomware attack on the preschools. While the Met police didn't name the schools, the timing of the referral coincides with a digital break-in at Kido International, a preschool and daycare organization that operates in the UK, US, and India.\n \nIn a very aggressive -- and disgusting -- attempt to extort a ransom payment from Kido, the criminals published profiles of 10 children, including photos, names, and home addresses, along with their parents' contact details and in some cases places of work, threatening to ",
        "id": 3769526,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/08/2020255/teens-arrested-in-london-preschool-ransomware-attack",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Teens Arrested In London Preschool Ransomware Attack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T23:36:53.905182+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T22:40:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: IDC says global PC shipments jumped 9.4 percent in Q3 2025, reaching nearly 76 million units. Asia and Japan led the growth thanks to school projects and corporate refreshes tied to Windows 10's end of support. North America was the weak link, with tariffs and economic unease keeping buyers on the sidelines even as aging fleets strain under Windows 11 pressure. \nLenovo kept its top spot with 25.5 percent market share, followed by HP at 19.8 and Dell at 13.3. Apple and ASUS both posted double-digit growth. IDC's takeaway is clear: the PC market is not surging on flashy new features, it is being pulled forward by deadlines, old batteries, and the reality that five-year-old laptops do not cut it anymore.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=PC+Sales+Explode+In+Q3+As+Windows+11+Deadlines+Force+Millions+To+Upgrade%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2",
        "id": 3769527,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/08/2014226/pc-sales-explode-in-q3-as-windows-11-deadlines-force-millions-to-upgrade",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PC Sales Explode In Q3 As Windows 11 Deadlines Force Millions To Upgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T23:36:54.228913+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T22:00:00+00:00",
        "description": "Amazon Pharmacy will begin offering prescription pickup kiosks at its One Medical clinics starting in Los Angeles this December, allowing patients to collect common medications like antibiotics and inhalers without waiting for delivery. Reuters reports: The kiosks will be the first in-person pick-up service offered by Amazon Pharmacy, which has been providing prescription services primarily by delivery, said Hannah McClellan Richards, a vice president at Amazon Pharmacy. One Medical offers a membership structure that allows patients to access primary and urgent care at a subscription fee of $199 annually. Patients without a membership are still able to book an appointment and would be able to use the kiosk, the company said.\n \nRichards said in an interview that the company plans to expand the kiosk model outside of California in 2026 and is in talks with external health systems to introduce the machines through partnerships. Amazon does not plan to offer medicines that must be refrige",
        "id": 3769528,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/08/2011229/amazon-installing-automated-medication-kiosks-at-clinics",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Installing Automated Medication Kiosks At Clinics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T21:45:17.137092+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T21:20:00+00:00",
        "description": "An anonymous reader quotes a report from the Financial Times: OpenAI and Anthropic are considering using investor funds to settle potential claims from multibillion-dollar lawsuits, as insurers balk at providing comprehensive coverage for the risks associated with artificial intelligence. The two US-based AI start-ups have traditional business insurance coverage in place, but insurance professionals said AI model providers will struggle to secure protection for the full scale of damages they may need to pay out in the future. OpenAI, which has tapped the world's second-largest insurance broker Aon for help, has secured cover of up to $300 million for emerging AI risks, according to people familiar with the company's policy. Another person familiar with the policy disputed that figure, saying it was much lower. But all agreed the amount fell far short of the coverage to insure against potential losses from a series of multibillion-dollar legal claims.\n \n[...] Two people with knowledge ",
        "id": 3768920,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/08/207203/insurers-balk-at-paying-out-huge-settlements-for-claims-against-ai-firms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Insurers Balk At Paying Out Huge Settlements For Claims Against AI Firms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T21:45:17.254851+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T20:44:00+00:00",
        "description": "Salesforce says it's refusing to pay an extortion demand made by a crime syndicate that claims to have stolen roughly 1 billion records from dozens of Salesforce customers. From a report: The threat group making the demands began their campaign in May, when they made voice calls to organizations storing data on the Salesforce platform, Google-owned Mandiant said in June. The English-speaking callers would provide a pretense that necessitated the target connect an attacker-controlled app to their Salesforce portal. Amazingly -- but not surprisingly -- many of the people who received the calls complied. \n\n[...] Earlier this month, the group created a website that named Toyota, FedEx, and 37 other Salesforce customers whose data was stolen in the campaign. In all, the number of records recovered, Scattered LAPSUS$ Hunters claimed, was \"989.45m/~1B+.\" The site called on Salesforce to begin negotiations for a ransom amount \"or all your customers [sic] data will be leaked.\" The site went on",
        "id": 3768921,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/08/208202/salesforce-says-it-wont-pay-extortion-demand-in-1-billion-records-breach",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Salesforce Says It Won't Pay Extortion Demand in 1 Billion Records Breach",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T20:14:05.978087+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T20:04:00+00:00",
        "description": "The UK's national security is under severe threat from the climate crisis and the looming collapse of vital natural ecosystems, with food shortages and economic disaster potentially just years away, a powerful report by the UK's intelligence chiefs is due to warn. The Guardian: However, the report, which was supposed to launch on Thursday at a landmark event in London, has been delayed, and concerns have been expressed to the Guardian that it may have been blocked by number 10. The destabilising impact of the climate and nature crises on national security is one of the biggest risks facing Britain, the joint intelligence committee report is understood to say. \n\nAlready, food import supply chains are coming under pressure, with the price of some commodities increasing. This could be exacerbated in the near future, the defence experts have warned, with the UK over-dependent on imports. Other industries will also be affected by ecosystem collapse in places such as the Amazon and by the w",
        "id": 3768151,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/08/1928248/national-security-threatened-by-climate-crisis-uk-intelligence-chiefs-due-to-warn",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "National Security Threatened By Climate Crisis, UK Intelligence Chiefs Due To Warn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T20:14:06.086446+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T19:25:00+00:00",
        "description": "Susumu Kitagawa, Richard Robson, and Omar M. Yaghi were awarded the Nobel Prize in Chemistry on Wednesday for the development of molecular building blocks with spaces large enough that gases and other chemicals can flow through them. The New York Times: The cavities on the inside are \"almost like rooms in a hotel, so that guest molecules can enter and also exit again from the same material,\" Heiner Linke, chair of the Nobel Committee for Chemistry, said during the announcement of the award. The laureates' discoveries, he added, pave the way for the creation of materials that can separate toxic chemicals from wastewater or harvest water molecules in a desert. \n\nThe laureates' work started with experiments by Dr. Robson in the 1980s and gradually developed over a period of about 15 years. \"It takes time for science to be recognized, and it takes multiple workers in the field with different approaches,\" said Dorothy Phillips, president of the American Chemical Society. The three laureate",
        "id": 3768152,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/08/1852221/nobel-prize-in-chemistry-awarded-to-architects-of-metal-organic-frameworks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nobel Prize in Chemistry Awarded To Architects of Metal-Organic Frameworks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T20:14:06.247624+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T18:45:00+00:00",
        "description": "An anonymous reader shares a report: In another loss for early smart home adopters, Logitech has announced that it will brick all Pop switches on October 15. \n\nIn August of 2016, Logitech launched Pop switches, which provide quick access to a range of smart home actions, including third-party gadgets. For example, people could set their Pop buttons to launch Philips Hue or Insteon lighting presets, play a playlist from their Sonos speaker, or control Lutron smart blinds. Each button could store three actions, worked by identifying smart home devices on a shared Wi-Fi network, and was controllable via a dedicated Android or iOS app. The Pop Home Switch Starter Pack launched at $100, and individual Pop Add-on Home Switches debuted at $40 each. \n\nA company spokesperson told Ars Technica that Logitech informed customers on September 29 that their Pop switches would soon become e-waste.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com",
        "id": 3768153,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/08/1831202/logitech-will-brick-its-100-pop-smart-home-buttons-on-october-15",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Logitech Will Brick Its $100 Pop Smart Home Buttons on October 15",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T18:42:36.875125+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T18:05:00+00:00",
        "description": "An anonymous reader shares a report: Universities in the UK reassured arms companies they would monitor students' chat groups and social media accounts after firms raised concerns about campus protests, according to internal emails. One university said it would conduct \"active monitoring of social media\" for any evidence of plans to demonstrate against Rolls-Royce at a careers fair. \n\nA second appeared to agree to a request from Raytheon UK, the British wing of a major US defence contractor, to \"monitor university chat groups\" before a campus visit. Another university responded to a defence company's \"security questionnaire\" seeking information about social media posts suggestive of imminent protests over the firm's alleged role in fuelling war, including in Gaza. The universities' apparent compliance with the sensitivities of arms companies before careers fairs has emerged in emails obtained by the Guardian and Liberty Investigates after freedom of information (FoI) requests.<p><div ",
        "id": 3767341,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/08/1759244/uk-universities-offered-to-monitor-students-social-media-for-arms-firms-emails-show",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Universities Offered To Monitor Students' Social Media For Arms Firms, Emails Show",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T18:42:36.960553+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T17:24:00+00:00",
        "description": "Synology has released an update to its Disk Station Manager software that removes verified drive requirements from its 2025 model-year Plus, Value and J-series DiskStation network-attached storage devices. The change allows users to install non-validated third-party drives and create storage pools without restrictions. \n\nThe company had expanded its verified drive policy to the entire Plus line a few months earlier. Synology-branded drives carried substantial price premiums over commodity hardware. The HAT5310 enterprise SATA drive costs $299 for 8TB compared to $220 for an identically sized Seagate Exos disk. Users who installed non-verified drives in affected models faced reduced functionality and persistent warning messages in the DSM interface. \n\nSynology said today it is collaborating with third-party drive manufacturers to accelerate testing and verification of additional storage drives. Pool and cache creation on M.2 disks still requires drives from the hardware compatibility l",
        "id": 3767342,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/08/1723232/synology-reverses-course-on-some-drive-restrictions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Synology Reverses Course on Some Drive Restrictions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T17:15:09.697354+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T16:45:00+00:00",
        "description": "American companies have begun cutting middle management positions at rates not seen in years. Google eliminated 35% of managers overseeing teams of fewer than three in August. Fiverr announced in September it would shed managers to focus on AI. Amazon trimmed its management ranks throughout the year and cut positions at its cloud-computing division in July. Meta's Mark Zuckerberg has complained about managers managing managers since 2023. \n\nPhrases relating to reducing management layers appeared 98 times on earnings calls of companies in the S&amp;P global index this year, twice the frequency of all of 2022. The cuts stem partly from an uncertain economic environment and President Donald Trump's tariff regime, Economist writes. The pandemic created the conditions for the current retrenchment. Companies furloughed staff during Covid-19 and then hired rapidly to meet demand for e-commerce and digital services. They promoted employees to management positions to retain talent even when th",
        "id": 3766290,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/08/1645227/bonfire-of-the-middle-managers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bonfire of the Middle Managers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T17:15:09.791865+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T16:01:00+00:00",
        "description": "A Pew Research Center survey, released today, found that TV remains the dominant screen for American children aged twelve and younger. 90% of parents reported that their child watches TV. Tablets are used by 68% of children in this age group. 61% use smartphones. \n\nThe survey of U.S. parents also documented emerging technology patterns. About one in ten parents said their child between five and twelve years old uses AI chatbots such as ChatGPT or Gemini. Roughly four in ten parents reported that their child uses voice assistants like Siri or Alexa. YouTube appeared in 85% of households. Half of parents said their child uses gaming devices. About four in ten reported desktop or laptop use. The survey found that 62% of parents said their child under two watches television. 42% of parents said they could be doing better at managing screen time for their children.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Survey+Sh",
        "id": 3766291,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/08/1540225/survey-shows-extent-of-digital-device-use-among-americas-youngest",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Survey Shows Extent of Digital Device Use Among America's Youngest",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T15:41:50.869773+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T15:25:00+00:00",
        "description": "South Korea's government may have permanently lost 858TB of information after a fire at a data center in Daejeon. From a report: As reported by DCD, a battery fire at the National Information Resources Service (NIRS) data center, located in the city of Daejeon, on September 26, has caused havoc for government services in Korea. Work to restore the data center is ongoing, but officials fear data stored on the government's G-Drive may be gone for good. G-Drive, which stands for Government Drive and is not a Google product, was used by government staff to keep documents and other files. Each worker was allocated 30GB of space. \n\nAccording to a report from The Chosun, the drive was one of 96 systems completely destroyed in the fire, and there is no backup. \"The G-Drive couldn't have a backup system due to its large capacity,\" an unnamed official told The Chosun. \"The remaining 95 systems have backup data in online or offline forms.\" While some departmers do not rely on G-Drive, those that",
        "id": 3765226,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/08/155239/858tb-of-government-data-may-be-lost-for-good-after-south-korea-data-center-fire",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "858TB of Government Data May Be Lost For Good After South Korea Data Center Fire",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T15:41:51.117993+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T14:48:00+00:00",
        "description": "Nvidia CEO Jensen Huang said Wednesday that he's surprised Advanced Micro Devices offered 10% of itself to OpenAI as part of a multibillion-dollar partnership announced earlier this week. From a report: \"t's imaginative, it's unique and surprising, considering they were so excited about their next generation product,\" Huang said in an interview with \"CNBC's Squawk Box.\" \n\n\"I'm surprised that they would give away 10% of the company before they even built it. And so anyhow, it's clever, I guess.\" OpenAI and AMD reached a deal on Monday, with OpenAI committing to purchase 6 gigawatts worth of AMD chips over multiple years, including its forthcoming MI450 series. As part of the agreement, OpenAI will receive warrants for up to 160 million AMD shares, with vesting milestones based on deployment volume and AMD's share price.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nvidia's+Huang+Says+He's+Surprised+AMD+Offered+10%2",
        "id": 3765227,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/08/1449201/nvidias-huang-says-hes-surprised-amd-offered-10-of-the-company-in-clever-openai-deal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia's Huang Says He's Surprised AMD Offered 10% of the Company in 'Clever' OpenAI Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T14:04:21.014477+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T14:00:00+00:00",
        "description": "TiVo, the digital video recording pioneer, has moved on from its legacy DVR technology, focusing instead on its branded operating system software promoting third-party content searches, recommendation, including free ad-supported streaming options and more for smart televisions. From a report: \"As of Oct. 1, 2025, TiVo has stopped selling Edge DVR hardware products,\" the company said in an AI-based message. The recording said that the company and its associates no longer manufacture DVR hardware, \"and our remaining inventory is now depleted.\" TiVo said it remains \"committed to providing support for our DVR customers and will continue to provide support for the foreseeable future.\" TiVo in 1999 created the first set-top device enabling users to record and skip ads within television programming.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=TiVo+Exiting+Legacy+DVR+Business%3A+https%3A%2F%2Fentertainment.slashdot.org%",
        "id": 3764395,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/08/0621226/tivo-exiting-legacy-dvr-business",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "TiVo Exiting Legacy DVR Business",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T14:04:21.164172+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T13:00:00+00:00",
        "description": "AmiMoJo shares a report from the BBC: Renewable energy overtook coal as the world's leading source of electricity in the first half of this year -- a historic first, according to new data from the global energy think tank Ember. Electricity demand is growing around the world but the growth in solar and wind was so strong it met 100% of the extra electricity demand, even helping drive a slight decline in coal and gas use. However, Ember says the headlines mask a mixed global picture.\n \nDeveloping countries, especially China, led the clean energy charge but richer nations including the US and EU relied more than before on planet-warming fossil fuels for electricity generation. This divide is likely to get more pronounced, according to a separate report from the International Energy Agency (IEA). It predicts renewables will grow much less strongly than forecast in the US as a result of the policies of President Donald Trump's administration. Coal, a major contributor to global warming, w",
        "id": 3764396,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/08/0339254/renewables-overtake-coal-as-worlds-biggest-source-of-electricity",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Renewables Overtake Coal As World's Biggest Source of Electricity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T10:39:22.330909+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T10:00:00+00:00",
        "description": "XXongo writes: A New York times article suggests that merging the diagnosis of Asperger's syndrome into the Autism diagnosis in 2013, thus creating the \"autism spectrum disorder,\" was not helpful (paywalled; alternative source). That broadening of the diagnosis, along with the increasing awareness of the disorder, is largely responsible for the steep rise in autism cases that Health Secretary Robert F. Kennedy Jr. has called \"an epidemic\" and has attributed to theories of causality that mainstream scientists reject, like vaccines and, more recently, Tylenol. But the same diagnosis now applies to both people who are non-verbal, frequently engage in self-destructive behavior such as pounding their heads against the floor, and may require full-time care, but also to people who are merely somewhat socially awkward, possibly engage in repetitive behaviors, and have a narrow range of interests. \"Everything changed when we included Asperger's [in the diagnosis of autism],\" said Dr. Eric Fomb",
        "id": 3762933,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/08/0331218/should-the-autism-spectrum-be-split-apart",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Should the Autism Spectrum Be Split Apart?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T07:09:04.750412+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T07:00:00+00:00",
        "description": "NBC is developing a game show based on the New York Times' Wordle puzzle, with Today anchor Savannah Guthrie set to host and Jimmy Fallon executive producing through his company, Electric Hot Dog. The Times is also a production partner. From the Hollywood Reporter: Wordle, which the Times acquired in 2022 and logs billions of plays from the paper's games site annually, gives players six tries to guess a five-letter word, revealing only if letters are in the right place (via a green background) or part of the word but in the wrong place (with a gold background). Should it go forward, the Wordle show would join another Fallon-produced game show, Password, on NBC's unscripted roster. The Tonight Show emcee also executive produces and hosts the network's On Brand, a competition series that revolves around advertising and marketing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wordle+Game+Show+In+the+Works+At+NBC%3A+ht",
        "id": 3761996,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/08/038230/wordle-game-show-in-the-works-at-nbc",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wordle Game Show In the Works At NBC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T04:02:05.910504+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: Over the course of a nearly four-decade career, Cory Doctorow has written 15 novels, four graphic novels, dozens of short stories, six nonfiction books, approximately 60,000 blog posts and thousands of essays. And yet for all the millions of words he's published, these days the award-winning science fiction author and veteran internet activist is best known for just a single one: Enshittification. The term, which Doctorow, 54, popularized in essays in 2022 and 2023, refers to the way that online platforms become worse to use over time, as the corporations that own them try to make more money. Though the coinage is cheeky, in Doctorow's telling the phenomenon it describes is a specific, nearly scientific process that progresses according to discrete stages, like a disease.\n \nSince then, the meaning has expanded to encompass a general vibe -- a feeling far greater than frustration at Facebook, which long ago ceased being a goo",
        "id": 3761352,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/08/0014252/can-cory-doctorows-enshittification-transform-the-tech-industry-debate",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Can Cory Doctorow's 'Enshittification' Transform the Tech Industry Debate?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T02:28:25.366804+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T01:30:00+00:00",
        "description": "Android Authority notes the start of a new trend we're seeing in some new smartphones: devices shipping without USB cables. It follows the earlier industry shift away from bundled charging bricks, which Apple started back in 2020 with the launch of the iPhone 12. While manufacturers cite environmental benefits, \"the main driver behind these decisions for companies like Apple and Sony is, of course, profit,\" writes Android Authority's Taylor Kerns. From the report: Now, it looks like we may be in for a similar shift with bundled USB cables. As shared on the Linus Tech Tips subreddit, user Brick_Fish's recently purchased Sony Xperia 10 VII came without a charger or a charging cable. In a photo included with the post, you can see iconography on the back of the phone's box that spells out these omissions. Sony's not really a major player in the smartphone space these days, but this seems like the type of trend we should expect to see gain traction over the next couple of years. [...]\n \nAp",
        "id": 3761067,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/08/0034209/your-next-phone-might-come-without-a-usb-cable",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Your Next Phone Might Come Without a USB Cable",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T02:28:25.470501+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T00:50:00+00:00",
        "description": "A now-fixed security flaw in India's income tax e-filing portal exposed millions of taxpayers' personal and financial data due to a basic IDOR vulnerability that let users view others' records by swapping PAN numbers. \"The exposed data included full names, home addresses, email addresses, dates of birth, phone numbers, and bank account details of people who pay taxes on their income in India,\" reports TechCrunch. \"The data also exposed citizens' Aadhaar number, a unique government-issued identifier used as proof of identity and for accessing government services.\" From the report: The researchers found that when they signed into the portal using their Permanent Account Number (PAN), an official document issued by the Indian income tax department, they could view anyone else's sensitive financial data by swapping out their PAN for another PAN in the network request as the web page loads. This could be done using publicly available tools like Postman or Burp Suite (or using the web brows",
        "id": 3761068,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/07/2136212/security-bug-in-indias-income-tax-portal-exposed-taxpayers-sensitive-data",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Security Bug In India's Income Tax Portal Exposed Taxpayers' Sensitive Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T00:49:32.789653+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T00:10:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: Micro Center and iFixit have announced a partnership that combines the DIY repair giant's guides, parts, and toolkits with Micro Center's nationwide chain of computer and electronics stores. Customers browsing iFixit online can now find local Micro Center locations through a built-in locator and even stop in for a free consultation with a certified technician. Inside stores, shoppers will see iFixit toolkits and parts on shelves, while Micro Center's in-house technicians begin using iFixit's gear for professional repairs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Micro+Center+Partners+With+iFixit%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F10%2F07%2F2118214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashd",
        "id": 3760653,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/07/2118214/micro-center-partners-with-ifixit",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Micro Center Partners With iFixit",
        "vote": 0
    }
]