[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T16:57:04.421604+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T15:30:31+00:00",
        "description": "Ghost of Yotei has managed to take the gaming community by storm with a very solid take on Ezo Island, and an adventure that pushes its protagonist beyond her revenge-fuelled tale of wrath. But can its open world beat one of the genre's most iconic presences to date? \n\nRed Dead Redemption 2 looms large as an open world to end all others, and although it's a last-gen title, it continues to dominate any discourse about how an open world game must be made.\n\nAnd while Horizon Forbidden West is another brilliant addition to the genre, how it measures up against these two heavy weights sets the stage for an interesting comparison between each game's effort to present an experience that's as unforgettable as it is immersive. We dive right into this contest, and try to pick a clear winner from among this trio of titles.",
        "id": 3766157,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=dIavUi42ehE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dIavUi42ehE/hqdefault.jpg",
        "title": "Ghost of Yotei vs Red Dead Redemption 2 vs Horizon Forbidden West: Which Game Did Open World Better?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T15:22:54.395488+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T13:30:45+00:00",
        "description": "The next Little Nightmares game is here and man it's a good one! Little Nightmares III brings the franchise's excellent visuals, art style, sound design, and a roster of increasingly terrifying enemies to the table in an experience that is sure to have you captivated even as you play it with clenched jaws and tense muscles.\n\nIts enemies are definitely the stuff of nightmares, and dealing with them using a limited set of tools is going to be as thrilling as it is challenging. But for those of you who like to test themselves, this is a game that's going to join your favorite titles over the years with style and substance. Give it a shot, and let the nightmare take you to places that keep you coming back for more.",
        "id": 3765152,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=gs4ccs7J9xs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gs4ccs7J9xs/hqdefault.jpg",
        "title": "Little Nightmares 3 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-08T10:11:50.302018+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-08T09:30:15+00:00",
        "description": "Video games have always been about immersion, but the ones that truly stick with us are those that make a powerful first impression and leave us speechless by the time the credits roll. \n\nMuch like a great rollercoaster, these narratives often use the starting hours to set the stage for what’s to follow, and send you through shocking revelations and engaging set-pieces just as the ride comes to an end. \n\nFrom the twisted psychological depths of Silent Hill 2 to the gut-wrenching finale of Telltale’s The Walking Dead, this video will run down 15 of the best games that have some of the most mind-blowing first and final hours that will keep you glued to the edge of your seat at all times.",
        "id": 3762891,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=GlSohVLE3Sk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GlSohVLE3Sk/hqdefault.jpg",
        "title": "These 15 Games Have The MOST MIND-BLOWING First And Final Hours",
        "vote": 0
    }
]