[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T16:34:03.823231+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T16:00:42+00:00",
        "description": "The Xbox Series X and S marked a new chapter for Microsoft's iconic console brand, and the beginning of a fresh new rivalry with Sony that would push the boundaries of modern gaming. And while those boundaries have indeed been pushed, the Xbox finds itself left behind in a world where the PS5 and its Pro versions dominates the race for great games. \n\nWith the loss of several heavy-hitting exclusives and some problems with Game Pass, it's been a difficult few years for Microsoft. And while it hasn't given up on the Xbox brand, buying a new Series X or S might be giving you some justified doubts. Join us as we take a look at whether these consoles are worth your money today, and why.",
        "id": 4137922,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=QEKPCE44zAM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QEKPCE44zAM/hqdefault.jpg",
        "title": "5 Years Later, Xbox Series X | S Might Not Be Worth It Anymore..",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T15:32:08.094823+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T13:30:14+00:00",
        "description": "Metroid Prime 4: Beyond drops Samus Aran onto the unchartered world of Viewros during a planetwide conflict orchestrated by her archrival Sylux. Quickly, she’s isolated, marking a return to solitary exploration and investigation. Her mission is to find escape, but throughout she’ll encounter displaced Federation Troopers, who after rescue, will accompany Samus, share their powerups, and offer hints, tips, and strategies. \n\nNew psychic-powered manoeuvres, fluid, noticeably faster combat, and a hub-and-spoke overworld design ensure Metroid Prime 4 won’t be a paint by numbers video game. We’ll unpack 15 things you need to know before you buy, traversal tools, visual overhauls, and cross-hardware performance differences included, whilst also highlighting an area of concern: those aforesaid Fed Troopers themselves. Does their presence help or hinter Beyond’s mysterious aesthetic?",
        "id": 4137204,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=7F2Fw8Fhw8A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 1,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7F2Fw8Fhw8A/hqdefault.jpg",
        "title": "Metroid Prime 4: Beyond - 15 Things You Need To Know BEFORE YOU BUY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T11:23:19.892980+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T10:00:45+00:00",
        "description": "Escape From Tarkov is an intimidating game to talk about, since it essentially popularised the extraction shooter genre almost 7 years ago. After spending quite a bit of time in various stages of alpha and beta testing, however, it is finally out, and the world at large has a chance to look at what can be considered the father of the PvPvE extraction shooter genre. \n\nThe gameplay that forms the foundations of Escape From Tarkov feels incredibly solid, and the game doesn’t really pull any punches when it comes to its simulationist and realistic approach to various aspects, from gunplay to even survival mechanics. \n\nThis, coupled with the high-stakes gameplay loop where you are constantly risking everything you brought with you, tends to make for a thrilling gameplay experience. Even PvP can be fun when you run into a few players. However, the game also has some frustrating parts; cheaters and hackers often ruin games, and even the onboarding experience through the tutorial is downright",
        "id": 4136167,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=NPY_tWZiCSo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NPY_tWZiCSo/hqdefault.jpg",
        "title": "Escape From Tarkov Review - The Final Verdict",
        "vote": 0
    }
]