[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T23:15:31.903432+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T22:34:00+00:00",
        "description": "Meta \"is testing a new product that would give Facebook users a personalized daily briefing powered by the company's generative AI technology\" reports the Washington Post. They cite records they've reviwed showing that Meta \"would analyze Facebook content and external sources to push custom updates to its users.\"\n\n\nThe company plans to test the product with a small group of Facebook users in select cities such as New York and San Francisco, according to a person familiar with the project who spoke on the condition of anonymity to discuss private company matters... \n\nMeta's foray into pushing updates for consumers follows years of controversy over its relationship with publishers. The tech company has waffled between prominently featuring content from mainstream news sources on Facebook to pulling news links altogether as regulators pushed the tech giant to pay publishers for content on its platforms. More recently, publishers have sued Meta, alleging it infringed on their copyrighted ",
        "id": 4140083,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/22/065202/meta-plans-new-ai-powered-morning-brief-drawn-from-facebook-and-external-sources",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Plans New AI-Powered 'Morning Brief' Drawn From Facebook and 'External Sources'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T21:12:59.211901+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T20:36:00+00:00",
        "description": "An anonymous reader shared this report from CNN:\n\nThe universe's expansion might not be accelerating but slowing down, a new study suggests. If confirmed, the finding would upend decades of established astronomical assumptions and rewrite our understanding of dark energy, the elusive force that counters the inward pull of gravity in our universe... \n\nLast year, a consortium of hundreds of researchers using data from the Dark Energy Spectroscopic Instrument (DESI) in Arizona, developed the largest ever 3D map of the universe. The observations hinted at the fact that dark energy may be weakening over time, indicating that the universe's rate of expansion could eventually slow. Now, a study published November 6 in the journal Monthly Notices of the Royal Astronomical Society provides further evidence that dark energy might not be pushing on the universe with the same strength it used to. The DESI project's findings last year represented \"a major, major paradigm change ... and our result,",
        "id": 4139494,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/22/2034253/are-astronomers-wrong-about-dark-energy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are Astronomers Wrong About Dark Energy?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T20:08:54.053727+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T19:34:00+00:00",
        "description": "An anonymous reader shared this report from Sky News:\n\nA new wind record has been set for Britain, with enough electricity generated from turbines to power 22 million homes, the system operator has said. \n\nThe mark of 22,711 megawatts (MW) was set at 7.30pm on 11 November... enough to keep around three-quarters of British homes powered, the National Energy System Operator (Neso) said. The country had experienced windy conditions, particularly in the north of England and Scotland... \n\nNeso has predicted that Britain could hit another milestone in the months ahead by running the electricity grid for a period entirely with zero carbon power, renewables and nuclear... Neso said wind power is now the largest source of electricity generation for the UK, and the government wants to generate almost all of the UK's electricity from low-carbon sources by 2030. \n\n \"Wind accounted for 55.7 per cent of Britain's electricity mix at the time...\" reports The Times:\n\nGas provided only 12.5 per cent of",
        "id": 4139230,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/22/1057202/britain-sets-new-record-generating-enough-wind-power-for-22-million-homes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Britain Sets New Record, Generating Enough Wind Power for 22 Million Homes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T19:08:18.555007+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T18:34:00+00:00",
        "description": "For nearly three years OpenAI has touted ChatGPT as a \"revolutionary\" (and work-transforming) productivity tool, reports the Washington Post. \n\n\nBut after analyzing 47,000 ChatGPT conversations, the Post found that users \"are overwhelmingly turning to the chatbot for advice and companionship, not productivity tasks.\"\n\n\n\nThe Post analyzed a collection of thousands of publicly shared ChatGPT conversations from June 2024 to August 2025. While ChatGPT conversations are private by default, the conversations analyzed were made public by users who created shareable links to their chats that were later preserved in the Internet Archive and downloaded by The Post. It is possible that some people didn't know their conversations would become publicly preserved online. This unique data gives us a glimpse into an otherwise black box... \n\nOverall, about 10 percent of the chats appeared to show people talking about their emotions, role-playing, or seeking social interactions with the chatbot. Some u",
        "id": 4138859,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/22/0632225/analyzing-47000-chatgpt-conversations-shows-echo-chambers-sensitive-data---and-unpredictable-medical-advice",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Analyzing 47,000 ChatGPT Conversations Shows Echo Chambers, Sensitive Data - and Unpredictable Medical Advice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T18:06:21.903370+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T17:34:00+00:00",
        "description": "In October Zorin OS claimed it had 100,000 downloads in a little over two days in the days following Microsoft's end of support for Windows 10. \n\nAnd one month later, Zorin OS developers now claim that 780,000 people downloaded it from a Windows computer in the space of a month, according to the tech news site XDA Developers.\n\n\n\nIn a post on the Zorin blog, the developers of the operating system Zorin OS 18 announced that they've managed to accrue one million downloads of the operating system in a single month [since its launch on October 14]. While this is plenty impressive by itself, the developers go on to reveal that, out of that million, 78% of the downloads came from a Windows machine. That means that at least 780,000 people on Windows gave Zorin OS 18 a download... \n\n[I]t's easy to see why: the developers put a heavy emphasis on making their system the perfect home for ex-Windows users.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http:",
        "id": 4138548,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/11/22/0746223/780000-windows-users-downloaded-linux-distro-zorin-os-in-the-last-5-weeks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "780,000 Windows Users Downloaded Linux Distro Zorin OS in the Last 5 Weeks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T17:05:18.414465+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T16:34:00+00:00",
        "description": "ScienceDaily reports:\n\nElectrons can freeze into strange geometric crystals and then melt back into liquid-like motion under the right quantum conditions. Researchers identified how to tune these transitions and even discovered a bizarre \"pinball\" state where some electrons stay locked in place while others dart around freely. Their simulations help explain how these phases form and how they might be harnessed for advanced quantum technologies... \n\n\n\nWhen electrons settle into these rigid arrangements, the material undergoes a shift in its state of matter and stops conducting electricity. Instead of acting like a metal, it behaves as an insulator. This unusual behavior provides scientists with valuable insight into how electrons interact and has opened the door to advances in quantum computing, high-performance superconductors used in energy and medical imaging, innovative lighting systems, and extremely precise atomic clocks... [Florida State University assistant professor Cyprian Le",
        "id": 4138146,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/22/077217/physicists-reveal-a-new-quantum-state-where-electrons-run-wild",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Physicists Reveal a New Quantum State Where Electrons Run Wild",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T16:04:20.253515+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T15:34:00+00:00",
        "description": "The Washington Post reports:\n\n\n\nScientists in Switzerland have created a robot the size of a grain of sand that is controlled by magnets and can deliver drugs to a precise location in the human body, a breakthrough aimed at reducing the severe side effects that stop many medicines from advancing in clinical trials... \"I think surgeons are going to look at this,\" [said Bradley J. Nelson, an author of the paper in Science describing the discovery and a professor of robotics and intelligent systems at ETH Zurich]. I'm sure they're going to have a lot of ideas on how to use\" the microrobot. The capsule, which is steered by magnets, might also be useful in treating aneurysms, very aggressive brain cancers, and abnormal connections between arteries and veins known as arteriovenous malformations, Nelson said. The capsules have been tested successfully in pigs, which have similar vasculature to humans, and in silicone models of the blood vessels in humans and animals... Nelson said drug-ferry",
        "id": 4137677,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/22/0411225/tiny-micro-robots-in-your-bloodstream-could-deliver-drugs-with-greater-precision",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tiny 'Micro-Robots' in your Bloodstream Could Deliver Drugs with Greater Precision",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T14:04:10.338985+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T13:00:00+00:00",
        "description": "A California judge has shut down a decade-long surveillance program in which Sacramento's utility provider shared granular smart-meter data on 650,000 residents with police to hunt for cannabis grows. The EFF reports: The Sacramento County Superior Court ruled that the surveillance program run by the Sacramento Municipal Utility District (SMUD) and police violated a state privacy statute, which bars the disclosure of residents' electrical usage data with narrow exceptions. For more than a decade, SMUD coordinated with the Sacramento Police Department and other law enforcement agencies to sift through the granular smart meter data of residents without suspicion to find evidence of cannabis growing. EFF and its co-counsel represent three petitioners in the case: the Asian American Liberation Network, Khurshid Khoja, and Alfonso Nguyen. They argued that the program created a host of privacy harms -- including criminalizing innocent people, creating menacing encounters with law enforcemen",
        "id": 4137038,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/22/0115215/court-ends-dragnet-electricity-surveillance-program-in-sacramento",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Court Ends Dragnet Electricity Surveillance Program in Sacramento",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T10:50:09.960225+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T10:00:00+00:00",
        "description": "Longtime Slashdot reader fahrbot-bot shares a report from 404 Media: The Ukrainian Army is knocking a once-hyped Russian superweapon out of the sky by jamming it with a song and tricking it into thinking it's in Lima, Peru. The Kremlin once called its Kh-47M2 Kinzhal ballistic missiles \"invincible.\" Joe Biden said the missile was \"almost impossible to stop.\" Now Ukrainian electronic warfare experts say they can counter the Kinzhal with some music and a re-direction order. [...] Kinzhals and other guided munitions navigate by communicating with Russian satellites that are part of the GLONASS system, a GPS-style navigation network. Night Watch uses a jamming system called Lima EW to generate a disruption field that prevents anything in the area from communicating with a satellite. Many traditional jamming systems work by blasting receivers on munitions and aircraft with radio noise. Lima does that, but also sends along a digital signal and spoofs navigation signals. It \"hacks\" the recei",
        "id": 4136045,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/22/014203/ukraine-is-jamming-russias-superweapon-with-a-song",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ukraine Is Jamming Russia's 'Superweapon' With a Song",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T07:43:02.269294+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T07:00:00+00:00",
        "description": "A magician who implanted an RFID chip in his hand lost access to it after forgetting the password, leaving him effectively locked out of the tech embedded in his own body. The Register reports: \"It turns out,\" said [said magician Zi Teng Wang], \"that pressing someone else's phone to my hand repeatedly, trying to figure out where their phone's RFID reader is, really doesn't come off super mysterious and magical and amazing.\" Then there are the people who don't even have their phone's RFID reader enabled. Using his own phone would, in Zi's words, lack a certain \"oomph.\"\n \nOh well, how about making the chip spit out a Bitcoin address? \"That literally never came up either.\" In the end, Zi rewrote the chip to link to a meme, \"and if you ever meet me in person you can scan my chip and see the meme.\" It was all suitably amusing until the Imgur link Zi was using went down. Not everything on the World Wide Web is forever, and there is no guarantee that a given link will work indefinitely. Inde",
        "id": 4135360,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/22/0120232/magician-forgets-password-to-his-own-hand-after-rfid-chip-implant",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Magician Forgets Password To His Own Hand After RFID Chip Implant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T04:38:26.675518+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Scientific American: Amid a deepening ecological crisis and acute water shortage, Tehran can no longer remain the capital of Iran, the country's president has said. The situation in Tehran is the result of \"a perfect storm of climate change and corruption,\" says Michael Rubin, a political analyst at the American Enterprise Institute. \"We no longer have a choice,\" said Iranian president Masoud Pezeshkian during a speech on Thursday. Instead Iranian officials are considering moving the capital to the country's southern coast. But experts say the proposal does not change the reality for the nearly 10 million people who live in Tehran and are now suffering the consequences of a decades-long decline in water supply. Iran's capital has moved many times over the centuries, notes the report. \"But this marks the first time the Iranian government has moved the capital because of an ecological catastrophe.\" Yet, Rubin says, \"it would be a mistake to look ",
        "id": 4134767,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/22/0052243/irans-capital-is-moving-the-reason-is-an-ecological-catastrophe",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Iran's Capital Is Moving. The Reason Is an Ecological Catastrophe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T02:32:26.994276+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T02:02:00+00:00",
        "description": "The International Association of Cryptologic Research (IACR) was forced to cancel its leadership election after a trustee lost their portion of the Helios voting system's decryption key, making it impossible to reveal or verify the final results. Ars Technica reports: The IACR said Friday that the votes were submitted and tallied using Helios, an open source voting system that uses peer-reviewed cryptography to cast and count votes in a verifiable, confidential, and privacy-preserving way. Helios encrypts each vote in a way that assures each ballot is secret. Other cryptography used by Helios allows each voter to confirm their ballot was counted fairly. \"Unfortunately, one of the three trustees has irretrievably lost their private key, an honest but unfortunate human mistake, and therefore cannot compute their decryption share,\" the IACR said. \"As a result, Helios is unable to complete the decryption process, and it is technically impossible for us to obtain or verify the final outcom",
        "id": 4134344,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/22/0041203/cryptographers-cancel-election-results-after-losing-decryption-key",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cryptographers Cancel Election Results After Losing Decryption Key",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T01:31:48.763901+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T01:25:00+00:00",
        "description": "Google has begun testing sponsored ads inside its Gemini-powered AI Mode, placing labeled \"sponsored\" links at the bottom of AI-generated responses. Engadget reports: [A] Google spokesperson says the result shown is akin to similar tests it's been running this year. \"People seeing ads in AI Mode in the wild is simply part of Google's ongoing tests, which we've been running for several months,\" the spokesperson said. The push to start offering ads in AI Mode was announced in May. The company also told 9to5Google that there are no current plans to fully update AI Mode to incorporate ads. For now, the software seems to be prioritizing organic links over sponsored links, but we all know how insidious ads can be once the floodgates open...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Starts+Testing+Ads+In+AI+Mode%3A+https%3A%2F%2Fsearch.slashdot.org%2Fstory%2F25%2F11%2F21%2F2244251%2F%3Futm_source%3Dtwitter%26ut",
        "id": 4134128,
        "language": "en-us",
        "link": "https://search.slashdot.org/story/25/11/21/2244251/google-starts-testing-ads-in-ai-mode",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Starts Testing Ads In AI Mode",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T01:31:48.950760+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T00:45:00+00:00",
        "description": "The SEC has officially dismissed its high-profile case against SolarWinds and its CISO that was tied to a Russia-linked cyberattack involving the software company. Reuters reports: The landmark case, which SEC brought in late 2023, rattled the cybersecurity community and later faced scrutiny from a judge who dismissed many of the charges. The SEC had said SolarWinds and its chief information security officer had violated U.S. securities laws by concealing vulnerabilities in connection with the high-profile 2020 Sunburst cyber attack. The SEC, SolarWinds and CISO Timothy Brown filed a motion on Thursday to dismiss the case with prejudice, according to a joint stipulation posted on the agency's website. A SolarWinds spokesperson said the firm is \"clearly delighted\" with the dismissal.\n \n\"We hope this resolution eases the concerns many CISOs have voiced about this case and the potential chilling effect it threatened to impose on their work,\" the spokesperson said.<p><div class=\"share_sub",
        "id": 4134129,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/21/2238230/sec-dismisses-case-against-solarwinds-top-security-officer",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SEC Dismisses Case Against SolarWinds, Top Security Officer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-22T00:30:17.263339+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-22T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Malaysia's palm oil giants, long-blamed for razing rainforests, fueling toxic haze and driving orangutans to the brink of extinction, are recasting themselves as unlikely champions in a different, potentially greener race: the quest to lure the world's AI data centers to the Southeast Asian country (source paywalled; alternative source). Palm oil companies are earmarking some of the vast tracts of land they own for industrial parks studded with data centers and solar panels, the latter meant to feed the insatiable energy appetites of the former. The logic is simple: data centers are power and land hogs. By 2035, they could demand at least five gigawatts of electricity in Malaysia -- almost 20% of the country's current generation capacity and roughly enough to power a major city like Miami. Malaysia also needs space to house server farms, and palm oil giants control more land than any other private entity in the country.\n \nThe country",
        "id": 4133827,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/21/2230226/malaysias-palm-oil-estates-are-turning-into-data-centers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Malaysia's Palm Oil Estates Are Turning Into Data Centers",
        "vote": 0
    }
]