[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T23:51:43.587740+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T23:30:00+00:00",
        "description": "Anthropic has launched a specialized version of its Claude AI tools for the financial services sector, designed to assist professionals with investment decisions, market analysis, and research. The Financial Analysis Solution \"includes Claude 4 models, Claude Code and Claude for Enterprise with expanded usage limits, implementation support and other features,\" reports CNBC. From the report: As part of its new Financial Analysis Solution, Claude will get real-time access to financial information through data providers like Box, PitchBook, Databricks, S&amp;P Global and Snowflake. Anthropic said many of these integrations are available on Tuesday, with more to come. Anthropic's Financial Analysis Solution and Claude for Enterprise are available on AWS Marketplace. The company said Google Cloud Marketplace availability is coming soon. \"What this is is a tailored version of Claude for Enterprise,\" Kate Jensen, Anthropic's head of revenue said at an event in New York City on Tuesday. \"It's",
        "id": 3175002,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/15/2211203/anthropic-rolls-out-claude-ai-for-financial-services?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Rolls Out Claude AI For Financial Services",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T23:51:43.785271+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T22:50:00+00:00",
        "description": "Reddit has begun verifying users' ages in the UK to restrict access to \"certain mature content\" for minors, complying with the UK's Online Safety Act. The BBC reports: Reddit, known for its online communities and discussions, said that while it does not want to know who its audience is: \"It would be helpful for our safety efforts to be able to confirm whether you are a child or an adult.\" Ofcom, the UK regulator, said: \"We expect other companies to follow suit, or face enforcement if they fail to act.\" Reddit said that from 14 July, an outside firm called Persona will perform age verification for the social media platform either through an uploaded selfie or \"a photo of your government ID,\" such as a passport. It said Reddit will not have access to the photo and will only retain a user's verification status and date of birth so people do not have to re-enter it each time they try to access restricted content. Reddit added that Persona \"promises not to retain the picture for longer tha",
        "id": 3175003,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/15/1922235/reddit-starts-verifying-ages-of-users-in-the-uk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reddit Starts Verifying Ages of Users In the UK",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T22:46:44.365852+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T22:10:00+00:00",
        "description": "Plasma Bigscreen, KDE's TV-focused interface, is being revived after years of inactivity thanks to contributor Devin, who overhauled the UI, redesigned the Settings app, improved app launching, and updated key modules. While still in progress -- with features like HDMI-CEC remote support and a virtual keyboard pending -- the project aims to rejoin KDE's official Plasma release schedule, potentially in version 6.5. Neowin reports: If you have not heard of it, Plasma Bigscreen is a Plasma shell for televisions, with original support for the now-defunct Mycroft AI assistant. It used to provide a simple launcher for apps and custom \"Mycroft Skills\" before development stalled, causing most distributions to drop it. The project was left behind during the big transition to Plasma 6 last year because no one had ported it in time for the megarelease. After a friend of his started poking at the code, Devin stepped in to tackle the much-needed work. [...]\n \nFor anyone who wants to test this out,",
        "id": 3174658,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/15/1956221/kdes-android-tv-alternative-plasma-bigscreen-rises-from-the-dead?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "KDE's Android TV Alternative, Plasma Bigscreen, Rises From the Dead",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T21:40:44.901506+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T21:30:00+00:00",
        "description": "An anonymous reader quotes a report from Phoronix: Merged yesterday to the latest development code for the LibreOffice open-source office suite is now recognizing Bitcoin \"BTC\" as a supported currency for use within the Calc spreadsheet program and elsewhere within this cross-platform free software office suite. Stemming from a recent bug report requesting Bitcoin as an official currency option within LibreOffice Calc, the necessary additions are now in place so it's a built-in preset like USD and EUR. Thus easier managing of Bitcoin transactions and the like from within LibreOffice Calc.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=LibreOffice+Lands+Built-In+Support+For+Bitcoin+As+Currency%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F07%2F15%2F1932202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.c",
        "id": 3174244,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/07/15/1932202/libreoffice-lands-built-in-support-for-bitcoin-as-currency?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LibreOffice Lands Built-In Support For Bitcoin As Currency",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T21:40:45.038826+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T20:50:00+00:00",
        "description": "U.S. prosecutors and the Commodity Futures Trading Commission (CFTC) have officially closed their investigations into Polymarket, the decentralized, blockchain-powered prediction market platform where users bet with real cryptocurrency on the outcomes of future events. \"The DOJ was investigating Polymarket last year, reportedly for allowing U.S. users to place bets on the site despite Polymarket being required to block U.S. traders,\" reports CoinDesk.\n \nThe FBI raided Polymarket CEO Shayne Coplan's Manhattan apartment last November, seizing his phone and electronic devices. A source close to the matter told The New York Post it was politically motivated due to Polymarket's successful prediction of Trump's election win. It's \"grand political theater at its worst,\" the source said. \"They could have asked his lawyer for any of these things. Instead, they staged a so-called raid so they can leak it to the media and use it for obvious political reasons.\"<p><div class=\"share_submission\" sty",
        "id": 3174245,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/07/15/206217/us-prosecutors-close-probe-into-polymarket-betting-website?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Prosecutors Close Probe Into Polymarket Betting Website",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T20:36:27.252045+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T20:10:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: Blender 4.5 has arrived and it's a long-term support release. That means users get two full years of updates and bug fixes, making it a smart choice for anyone looking for stability in serious projects. Whether you're a solo artist or part of a studio pipeline, this version is built to last. Here's a list of key features and changes in this release:\n \n- Vulkan backend replaces OpenGL (faster, smoother UI)\n- Adaptive subdivision up to 14x faster with multithreading\n- New Geometry Nodes: Camera Info, Instance Bounds\n- GPU-accelerated compositor nodes with standardized inputs\n- New Boolean solver: Manifold (cleaner, faster mesh operations)\n- UV maps visible in Object Mode + improved selection behavior\n- Grease Pencil render pass and Geometry Nodes integration\n- Improved file import support: PLY, OBJ, STL, CSV, VDB\n- Deprecations: Collada, Big Endian, legacy .blend, Intel Mac support\n- Cycles OptiX now requires NVIDIA driver v535+\n- New shader ",
        "id": 3173831,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/15/1912208/blender-45-lts-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Blender 4.5 LTS Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T20:36:27.449255+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T19:30:00+00:00",
        "description": "An anonymous reader quotes a report from TorrentFreak: Internet service providers BT, Virgin Media, Sky, TalkTalk, EE, and Plusnet account for the majority of the UK's residential internet market and as a result, blocking injunctions previously obtained at the High Court often list these companies as respondents. These so-called \"no fault' injunctions stopped being adversarial a long time ago; ISPs indicate in advance they won't contest a blocking order against various pirate sites, and typically that's good enough for the Court to issue an order with which they subsequently comply. For more than 15 years, this has led to blocking being carried out as close to users as possible, with ISPs' individual blocking measures doing the heavy lifting. A new wave of blocking targeting around 200 pirate site domains came into force yesterday but with the unexpected involvement of a significant new player.\n \nIn the latest wave of blocking that seems to have come into force yesterday, close to 200",
        "id": 3173832,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/07/15/194255/cloudflare-starts-blocking-pirate-sites-for-uk-users?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cloudflare Starts Blocking Pirate Sites For UK Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T19:30:27.252257+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T18:50:00+00:00",
        "description": "Many trains in the U.S. are vulnerable to a hack that can remotely lock a train's brakes, according to the U.S. Cybersecurity and Infrastructure Security Agency (CISA) and the researcher who discovered the vulnerability. From a report:The railroad industry has known about the vulnerability for more than a decade but only recently began to fix it. Independent researcher Neil Smith first discovered the vulnerability, which can be exploited over radio frequencies, in 2012. \n\n\"All of the knowledge to generate the exploit already exists on the internet. AI could even build it for you,\" Smith told 404 Media. \"The physical aspect really only means that you could not exploit this over the internet from another country, you would need to be some physical distance from the train [so] that your signal is still received.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Hackers+Can+Remotely+Trigger+the+Brakes+on+American+Trains+a",
        "id": 3173333,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/07/15/1814234/hackers-can-remotely-trigger-the-brakes-on-american-trains-and-the-problem-has-been-ignored-for-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hackers Can Remotely Trigger the Brakes on American Trains and the Problem Has Been Ignored for Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:50.406064+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T18:10:00+00:00",
        "description": "Perplexity CEO Aravind Srinivas warned young entrepreneurs that tech giants will \"copy anything that's good\" during a talk at Y Combinator's AI Startup School, telling founders they must \"live with that fear.\" Srinivas said that companies raising tens of billions need to justify capital expenditures and search for new revenue streams. \n\nPerplexity pioneered web-crawling chatbots when it launched its answer engine in December 2022, but Google's Bard added internet-crawling three months later, followed by ChatGPT in May 2023 and Anthropic's Claude in March 2025. The competition has extended to browsers, with Perplexity launching its Comet browser on July 9 and Reuters reporting that OpenAI is developing a web browser to challenge Google Chrome. Perplexity's communications head Jesse Dwyer said larger companies will \"drown your voice.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Perplexity+CEO+Says+Tech+Giants+'Copy",
        "id": 3172750,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/15/183201/perplexity-ceo-says-tech-giants-copy-anything-thats-good?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Perplexity CEO Says Tech Giants 'Copy Anything That's Good'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:50.587631+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T17:34:00+00:00",
        "description": "NIST: There's a new record holder for the most accurate clock in the world. Researchers at the National Institute of Standards and Technology (NIST) have improved their atomic clock based on a trapped aluminum ion. Part of the latest wave of optical atomic clocks, it can perform timekeeping with 19 decimal places of accuracy. \n\nOptical clocks are typically evaluated on two levels -- accuracy (how close a clock comes to measuring the ideal \"true\" time, also known as systematic uncertainty) and stability (how efficiently a clock can measure time, related to statistical uncertainty). This new record in accuracy comes out of 20 years of continuous improvement of the aluminum ion clock. Beyond its world-best accuracy, 41% greater than the previous record, this new clock is also 2.6 times more stable than any other ion clock. Reaching these levels has meant carefully improving every aspect of the clock, from the laser to the trap and the vacuum chamber. \n\nThe team published its results in P",
        "id": 3172751,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/15/1735204/nist-ion-clock-sets-new-record-for-most-accurate-clock-in-the-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NIST Ion Clock Sets New Record for Most Accurate Clock in the World",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:50.765728+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T16:45:00+00:00",
        "description": "A survey of 500 IT asset managers in organizations that use Oracle Java has found that 73% have been audited in the last three years. From a report: At the same time, nearly eight out of 10 Oracle Java users said they had migrated, or planned to shift, to open source Java to try to avoid the risk and high costs of the dominant vendor's development and runtime environments. \n\nOracle introduced a paid subscription for Java in September 2018, and in January 2023, it decided to switch its pricing model to per employee rather than per user, creating a steep price hike for many users. In July 2023, Gartner recorded users experiencing price increases of between two and five times when they switched to the new licensing model. \n\nTwo years later, the survey conducted by market research firm Dimensional Research showed only 14% of Oracle Java users intended to stick with the vendor's subscription model.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http:/",
        "id": 3172752,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/07/15/1641209/nearly-3-out-of-4-oracle-java-users-say-theyve-been-audited-in-the-past-3-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nearly 3 Out of 4 Oracle Java Users Say They've Been Audited in the Past 3 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:50.891242+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T16:12:00+00:00",
        "description": "Nearly half of young Americans feel unprepared for future jobs as AI reshapes the workforce faster than career guidance can adapt, according to a new study from the Schultz Family Foundation and HarrisX. The survey of thousands of workers aged 16-24, along with parents, counselors and employers, revealed differences between generations about job availability and requirements. While 71% of employers say sufficient opportunities exist, only 43% of young people agree. \n\nParents rely on outdated personal experiences when advising children, with 79% drawing from their own career paths despite 66% believing their children should pursue different directions. Employers require at least one year of experience for 77% of entry-level positions while offering internships for just 38% of roles.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Young+Americans+Face+Job+Market+Disconnect+as+Parents+Offer+Outdated+Career+Advice%3A+htt",
        "id": 3172753,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/15/1612213/young-americans-face-job-market-disconnect-as-parents-offer-outdated-career-advice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Young Americans Face Job Market Disconnect as Parents Offer Outdated Career Advice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:51.071497+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T15:20:00+00:00",
        "description": "An anonymous reader shares a report: Hugging Face, a company with a multi-billion dollar valuation and one of the most commonly used platforms for sharing AI tools and resources, is hosting over 5,000 AI image generation models that are designed to recreate the likeness of real people. These models were all previously hosted on Civitai, an AI model sharing platform 404 Media reporting has shown was used for creating nonconsensual pornography, until Civitai banned them due to pressure from payment processors. \n\nUsers downloaded the models from Civitai and reuploaded them to Hugging Face as part of a concerted community effort to archive the models after Civitai announced in May it will ban them. In that announcement, Civitai said it will give the people who originally uploaded them \"a short period of time\" before they were removed. Civitai users began organizing an archiving effort on Discord earlier in May after Civitai indicated it had to make content policy changes due to pressure f",
        "id": 3172754,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/07/15/1457229/hugging-face-is-hosting-5000-nonconsensual-ai-models-of-real-people?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hugging Face Is Hosting 5,000 Nonconsensual AI Models of Real People",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:51.253045+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T14:44:00+00:00",
        "description": "Candy Crush-maker King is cutting approximately 200 employees, with many positions filled by AI tools the departing workers helped develop, according to multiple sources who spoke anonymously to industry publication MobileGamer.biz. The layoffs heavily target level designers, user research staff, and UX and narrative writers across King's London, Barcelona, Stockholm, and Berlin studios. \n\nThe London-based Farm Heroes Saga team faces cuts of roughly 50 people, including key leadership positions. \"Most of level design has been wiped, which is crazy since they've spent months building tools to craft levels quicker,\" one staffer said. \"Now those AI tools are basically replacing the teams.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Candy+Crush-Maker+King+Lays+Off+200+Staff%2C+Replacing+Many+With+AI+Tools+They+Built%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F07%2F15%2F1444226%2F%3Futm_source%3Dtwitter%26utm_medium",
        "id": 3172755,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/15/1444226/candy-crush-maker-king-lays-off-200-staff-replacing-many-with-ai-tools-they-built?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Candy Crush-Maker King Lays Off 200 Staff, Replacing Many With AI Tools They Built",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:51.430427+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T14:00:00+00:00",
        "description": "Microsoft employs engineers in China to help maintain Defense Department computer systems, with U.S. citizens serving as \"digital escorts\" to oversee the foreign workers, according to a ProPublica investigation. The escorts often lack advanced technical expertise to police engineers with far more sophisticated skills, and some are former military personnel paid barely above minimum wage. \n\n\"We're trusting that what they're doing isn't malicious, but we really can't tell,\" one current escort told the publication. The arrangement, critical to Microsoft winning federal cloud computing contracts a decade ago, handles sensitive but unclassified government data including materials that directly support military operations. Former CIA and NSA executive Harry Coker called the system a natural opportunity for spies, saying \"If I were an operative, I would look at that as an avenue for extremely valuable access.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" hr",
        "id": 3172756,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/15/1345208/microsoft-uses-chinese-engineers-to-maintain-defense-department-systems-under-minimal-us-oversight?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Uses Chinese Engineers To Maintain Defense Department Systems Under Minimal US Oversight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:51.606894+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: CoreWeave is expanding a data center that is projected to double the electricity needs of a city near Dallas, another example of the strains that artificial intelligence workloads are placing on the US power supply. Local officials have grappled with how to handle the increased stress on the electricity grid from the project, according to a late 2024 presentation and emails seen by Bloomberg. The site is being developed by Core Scientific and will be used by OpenAI in Denton, Texas. Last week, CoreWeave announced it would acquire Core Scientific for about $9 billion, in part, to gain direct control of its data centers aimed at supplying AI work.\n \nDenton, about 50 miles northwest of Dallas, has almost doubled its population in the last 25 years to about 166,000 residents. To meet the spike in AI-related power demand, the city is passing on any extra costs to the data center operator and constructing additional grid infrastructure, An",
        "id": 3172757,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/14/2337208/coreweave-data-center-to-double-citys-power-needs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CoreWeave Data Center To Double City's Power Needs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:51.784663+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T10:00:00+00:00",
        "description": "A team of Japanese researchers has set a new world record for internet speed, transmitting data at 125,000 gigabytes per second over 1,120 miles using a new type of 19-core optical fiber. \"That's about 4 million times the average internet speed in the U.S. and would allow you to download the entire Internet Archive in less than four minutes,\" notes Live Science. It's also \"more than twice the previous world record of 50,250 Gbps, previously set by a different team of scientists in 2024.\" From the report: To achieve this new speed -- which has not been independently verified -- the team developed a new form of optical fiber to send information at groundbreaking speeds over roughly the distance between New York and Florida. Details about this achievement were presented April 3 at the 48th Optical Fiber Communication Conference in San Francisco, according to a statement from Japan's National Institute of Information and Communications Technology.\n \nThe new type of optical fiber is equiva",
        "id": 3172758,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/14/2330258/japan-sets-new-internet-speed-record-surpassing-average-us-broadband-speeds-by-4-million-times?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan Sets New Internet Speed Record, Surpassing Average US Broadband Speeds By 4 Million Times",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:51.961246+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T07:00:00+00:00",
        "description": "The LIGO-Virgo-KAGRA Collaboration has detected the most massive black hole merger to date, forming a final black hole around 225 times the Sun's mass. Caltech reports: Before now, the most massive black hole merger -- produced by an event that took place in 2021 called GW190521 -- had a total mass of 140 times that of the Sun. In the more recent GW231123 event, the 225-solar-mass black hole was created by the coalescence of black holes each approximately 100 and 140 times the mass of the Sun. In addition to their high masses, the black holes are also rapidly spinning.\n \n\"The black holes appear to be spinning very rapidly -- near the limit allowed by Einstein's theory of general relativity,\" explains Charlie Hoy of the University of Portsmouth and a member of the LVK. \"That makes the signal difficult to model and interpret. It's an excellent case study for pushing forward the development of our theoretical tools.\" Researchers are continuing to refine their analysis and improve the mod",
        "id": 3172759,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/14/2319237/ligo-detects-most-massive-black-hole-merger-to-date?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LIGO Detects Most Massive Black Hole Merger to Date",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:52.188290+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from MIT Technology Review: California's statewide power grid operator is poised to become the first in North America to deploy artificial intelligence to manage outages, MIT Technology Review has learned. \"We wanted to modernize our grid operations. This fits in perfectly with that,\" says Gopakumar Gopinathan, a senior advisor on power system technologies at the California Independent System Operator -- known as the CAISO and pronounced KAI-so. \"AI is already transforming different industries. But we haven't seen many examples of it being used in our industry.\"\n \nAt the DTECH Midwest utility industry summit in Minneapolis on July 15, CAISO is set to announce a deal to run a pilot program using new AI software called Genie, from the energy-services giant OATI. The software uses generative AI to analyze and carry out real-time analyses for grid operators and comes with the potential to autonomously make decisions about key functions on the grid, a sw",
        "id": 3172760,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/14/238238/california-set-to-become-first-us-state-to-manage-power-outages-with-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California Set To Become First US State To Manage Power Outages With AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:52.376726+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T02:10:00+00:00",
        "description": "Saudi Arabia has asked consultants to reassess the feasibility of The Line, its ambitious 170km linear city project and centerpiece of the Neom initiative, as rising costs and falling oil prices force the kingdom to scale back its megaprojects. Middle East Eye reports: In April, The Financial Times reported that the CEO of Neom had launched a \"comprehensive review\" of the kingdom's megaproject. Neom, along with luxury Red Sea hotels and a ski resort, is the flagship project of Crown Prince Mohammed bin Salman's Vision 2030 plan to transform the kingdom's economy and reduce its dependence on oil revenue. Bloomberg reported in 2024 that Saudi Arabia was cutting back plans for The Line. Instead of 1.5 million people living there by 2030, Saudi officials were said to anticipate fewer than 300,000 residents. Meanwhile, only 2.4km of the city is expected to be completed by 2030.\n \nIn April, Goldman Sachs painted a bleak picture for Saudi Arabia's projects in a note to clients, projecting \"p",
        "id": 3172761,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/14/233200/saudi-arabia-asks-consultants-to-reassess-feasibility-of-the-line-megaproject?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Saudi Arabia Asks Consultants To Reassess Feasibility of 'The Line' Megaproject",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:52.562976+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T01:30:00+00:00",
        "description": "Microsoft is testing a new adaptive energy saver mode in Windows 11 that automatically turns energy saver on or off based on system workload instead of battery percentage, aiming to extend laptop battery life without dimming screen brightness. The feature is currently available to Windows Insider testers and expected to roll out later this year. The Verge reports: The energy saver mode in Windows 11 typically dims a display brightness by 30 percent, disables transparency effects, and stop apps running in the background. Non-critical Windows update downloads are also paused, and certain apps like OneDrive, OneNote, and Phone Link may not sync fully while energy saver is enabled. This new adaptive energy saver mode, which will only be available on devices with a battery, will automatically enable or disable without affecting screen brightness. That will make it less noticeable on devices like laptops, tablets, and handhelds.\n \n\"Adaptive energy saver is an opt-in feature that automatical",
        "id": 3172762,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/14/2313239/microsoft-has-a-new-trick-to-improve-laptop-battery-life-on-windows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Has a New Trick To Improve Laptop Battery Life On Windows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T18:23:52.741544+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T00:50:00+00:00",
        "description": "The U.S. Department of Defense has awarded contracts worth up to $200 million each to OpenAI, Google, Anthropic, and xAI to scale adoption of advanced AI. \"The contracts will enable the DoD to develop agentic AI workflows and use them to address critical national security challenges,\" reports Reuters, citing the department's Chief Digital and Artificial Intelligence Office. From the report: Separately on Monday, xAI announced a suite of its products called \"Grok for Government\", making its advanced AI models -- including its latest flagship Grok 4 -- available to federal, local, state and national security customers. The Pentagon announced last month that OpenAI was awarded a $200 million contract, saying the ChatGPT maker would \"develop prototype frontier AI capabilities to address critical national security challenges in both warfighting and enterprise domains.\"\n \nThe contracts announced on Monday deepen the ties between companies leading the AI race and U.S. government operations, ",
        "id": 3172763,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/07/14/2253232/us-defense-department-awards-contracts-to-google-xai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Defense Department Awards Contracts To Google, xAI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T00:41:12.144106+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from Investing.com: Meta's newly formed superintelligence lab is discussing potential changes to the company's artificial intelligence strategy that could represent a major shift for the social media giant. A small group of top members of the lab, including 28-year-old Alexandr Wang, Meta's new chief A.I. officer, talked last week about abandoning the company's most powerful open source A.I. model, called Behemoth, in favor of developing a closed model, according to a report in the New York Times, citing people familiar with the matter.\n \nMeta has traditionally open sourced its A.I. models, making the computer code public for other developers to build upon, and any shift toward a closed A.I. model would mark a significant philosophical change for Meta. Meta had completed training its Behemoth model by feeding in data to improve it, but delayed its release due to poor internal performance. After the company announced the formation of the superintelli",
        "id": 3165928,
        "language": "en-us",
        "link": "https://meta.slashdot.org/story/25/07/14/2048202/metas-superintelligence-lab-considers-shift-to-closed-ai-model?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta's Superintelligence Lab Considers Shift To Closed AI Model",
        "vote": 0
    }
]