[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T15:10:46.197671+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T15:00:48+00:00",
        "description": "Back in 2006, Neverwinter Nights 2 evolved around the political machinations of believable villains and an engaging world. The only thing it was let down by at the time were technical issues and bugs.\n\nFast forward 19 years later, Neverwinter Nights 2's Enhanced Edition proves it's a game that is very much worth your time. Along with bug fixes, there are some visual touch-ups along with support for modern control schemes and controllers. This version also includes high-resolution textures with incredibly smooth frame rates thereby resulting into an engaging gameplay experience.",
        "id": 3170795,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=RjrXEHCg43c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RjrXEHCg43c/hqdefault.jpg",
        "title": "Neverwinter Nights 2 Enhanced Edition Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T14:03:57.379246+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T13:30:37+00:00",
        "description": "The Xbox Series S was a bold move by Microsoft, offering next-gen gaming at an affordable price point, and especially when paired with Game Pass - it's a no-brainer for anyone wanting to try out AAA games without breaking the bank. \n\nWhile the console has already started showing signs of aging under the pressure of today’s demanding titles, it remains a go-to option for budget-conscious gamers. But how does it compare to a gaming PC built on a similar specs? What kind of costs will be involved?\n\nIn this video, we break down the cost and components of a comparable PC build and see how all of that pans out",
        "id": 3170225,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Zh5q_JV6uQs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Zh5q_JV6uQs/hqdefault.jpg",
        "title": "How Much Would It Cost To Build A PC As Powerful As The Xbox Series S (2025 Edition)?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-15T10:50:10.957285+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-15T10:01:22+00:00",
        "description": "Whether you're a fan of fast-paced first-person shooters or tactical squad-based action, Void Interactive's Ready or Not is a challenging affair. Navigating its intricate levels and tackling threats while ensuring the survival of civilians can be overwhelming, especially when a few stray rounds are enough to kill you.\n\nFortunately, there are several options available to make things easier. Equipping different types of ammo and swapping between them based on the target, employing tactical devices like Door Wedges to prevent suspects from suddenly flanking you, and even peeking doors instead of barging through can significantly up your squad's survival rate.\n\nThat's before delving into mechanics like squad perks, canting, highlighting nearby dropped weapons, employing non-lethal munitions and tools, and much more. With Ready or Not available for Xbox Series X/S and PS5, here are 15 tips and tricks for laying down the law and living to tell the tale.",
        "id": 3168670,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=nZyZcud3Xm4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nZyZcud3Xm4/hqdefault.jpg",
        "title": "Ready or Not PS5 And Xbox - 15 Things It Doesn't Tell You",
        "vote": 0
    }
]