[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-05T20:30:07+00:00",
        "description": "Suikoden 1 And 2 are two very good (even great, in the case of the sequel) games that are classics of their genre, and have been remastered and brought to modern audiences with very little of the originals’ fine gameplay altered or updated. \n\nIf you haven’t ever played Suikoden, this collection is the best way to experience those classic adventures for the first time. And if you are already a fan of the series, you will be pleased at how well these games hold up all these years later – and just how deft a hand Konami had when bringing them over to modern audiences.",
        "id": 2254809,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oeUTIFlnQ70",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oeUTIFlnQ70/hqdefault.jpg",
        "title": "Suikoden 1 And 2 HD Remaster Review - A MUST Play For Fans of The Series",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-05T13:30:41+00:00",
        "description": "Monster Hunter Wilds has taken the world by storm, and if you don't believe us, its sales tell the whole story - over eight million units in three days. It doesn't just clear Monster Hunter World's record in the same period, but is now the fastest-selling game in recent years. But why, especially given PC performance issues, multiplayer complaints, and whatnot?\n\nThere are many potential reasons. The combat is the series' best yet, and the roster of monsters provides excellent variety. Even if the endgame doesn't offer many challenges, there's still a significant amount of stuff to do (and some Tempered threats pack a real punch). Presentation-wise, the attention to detail is immaculate, whether it's the idle animations or the endemic life in locales.\n\nHowever, perhaps most important is how it caters to veterans and newcomers in numerous ways, including the sheer fun of hunting. It's only just getting started but Monster Hunter Wilds could very well become this generation's most succe",
        "id": 2250821,
        "language": null,
        "link": "https://www.youtube.com/watch?v=xItWULul2jg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xItWULul2jg/hqdefault.jpg",
        "title": "Why Are MILLIONS of Gamers In Love With Monster Hunter Wilds?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-05T09:30:05+00:00",
        "description": "Clearly, Assassin’s Creed Shadows is going to be a big game, even as it tries to consciously pull back from the ridiculously bloated scope of 2020’s Assassin’s Creed Valhalla. \n\nAs large scale as the upcoming open world action RPG is, there has obviously been no shortage of things to talk about as we wait for its launch- but as is ever the case with gargantuan games such as this one, we never quite run of things to talk about regardless, especially with new information being released at a pretty steady pace. \n\nMore of that has predictably emerged in recent days, so as we count the days down until its release, here, we’re going to cover more significant gameplay details that you should know about Assassin’s Creed Shadows.",
        "id": 2249483,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DR9AqfDa38Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DR9AqfDa38Y/hqdefault.jpg",
        "title": "Assassin's Creed Shadows - 10 NEW Details You NEED TO KNOW Before You Purchase",
        "vote": 0
    }
]