[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T23:24:39.794746+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T22:34:00+00:00",
        "description": "\"Firefox is dead to me,\" wrote Steven J. Vaughan-Nichols last month for The Register, complaining about everything from layoffs at Mozilla to Firefox's discontinuation of Pocket and Fakespot, its small market share, and some user complaints that the browser might be becoming slower. But a new rebuttal (also published by The Register) argues instead that Mozilla just has \"a management layer that doesn't appear to understand what works for its product nor which parts of it matter most to users...\" \n\n\"Steven's core point is correct. Firefox is in a bit of a mess &mdash; but, seriously, not such a bad mess. You're still better off with it &mdash; or one of its forks, because this is FOSS &mdash; than pretty much any of the alternatives.\"\nLike many things, unfortunately, much of computing is run on feelings, tradition, and group loyalties, when it should use facts, evidence, and hard numbers. Don't bother saying Firefox is getting slower. It's not. It's faster than it has been in years. Ph",
        "id": 3151401,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/12/0534248/firefox-is-fine-the-people-running-it-are-not?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Firefox is Fine. The People Running It are Not'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T22:19:39.118789+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T21:34:00+00:00",
        "description": "Slashdot reader BrianFagioli shared this report from Nerds.xyz:\n\n\nNVIDIA just put out a new security notice, and if you're running one of its powerful GPUs, you might want to pay attention. Researchers from the University of Toronto have shown that Rowhammer attacks, which are already known to affect regular DRAM, can now target GDDR6 memory on NVIDIA's high-end GPUs when ECC [error correction code] is not enabled. \n\nThey pulled this off using an A6000 card, and it worked because system-level ECC was turned off. Once it was switched on, the attack no longer worked. That tells you everything you need to know. ECC matters. \n\nRowhammer has been around for years. It's one of those weird memory bugs where repeatedly accessing one row in RAM can cause bits to flip in another row. Until now, this was mostly a CPU memory problem. But this research shows it can also be a GPU problem, and that should make data center admins and workstation users pause for a second. \n\nNVIDIA is not sounding an a",
        "id": 3151185,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/12/199238/nvidia-warns-its-high-end-gpus-may-be-vulnerable-to-rowhammer-attacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NVIDIA Warns Its High-End GPUs May Be Vulnerable to Rowhammer Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T21:14:41.265640+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T20:34:00+00:00",
        "description": "Robinhood's stock hit is up more than 160% for 2025, reports CNBC, and the trading platform's own stock hit an all-time high on Friday. But \"Despite its stellar year, the online broker is facing several headwinds...\"\n\nFlorida Attorney General James Uthmeier opened a formal investigation into Robinhood Crypto on Thursday, alleging the platform misled users by claiming to offer the lowest-cost crypto trading. \"Robinhood has long claimed to be the best bargain, but we believe those representations were deceptive,\" Uthmeier said in a statement. The probe centers on Robinhood's use of payment for order flow &mdash; a common practice where market makers pay to execute trades &mdash; which the AG said can result in worse pricing for customers. \n\nRobinhood is also facing opposition to a new 25% cut of staking rewards for U.S. users, set to begin October 1. In Europe, the platform will take a smaller 15% cut. Staking allows crypto holders to earn yield by locking up their tokens to help secure",
        "id": 3150910,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/12/1559255/robinhood-up-160-in-2025-but-may-face-obstacles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Robinhood Up 160% in 2025, But May Face Obstacles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T20:09:47.859270+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T19:34:00+00:00",
        "description": "It killed tens of millions of people in 14th century Europe,\" CNN reports, though \"today, it's easily treated with antibiotics.\" \n\nAnd yet \"A resident of northern Arizona has died from pneumonic plague, health officials said Friday.\"\n\nPlague is rare to humans, with on average about seven cases reported annually in the U.S., most of them in the western states, according to federal health officials. The death in Coconino County, which includes Flagstaff, was the first recorded death from pneumonic plague since 2007, local officials said... The bubonic plague is the most common form of the bacterial infection, which spreads naturally among rodents like prairie dogs and rats. There are two other forms: septicemic plague that spreads through the whole body, and pneumonic plague that infects the lungs. Pneumonic plague is the most deadly and easiest to spread.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Northern+Arizo",
        "id": 3150659,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/12/1834224/northern-arizona-resident-dies-from-plague?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Northern Arizona Resident Dies From Plague",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T19:05:11.135419+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T18:34:00+00:00",
        "description": "\"Microsoft's Outlook email service malfunctioned for over 21 hours Wednesday and Thursday,\" reports CNBC, \"prompting some people to post on social media about the inability to reach their virtual mailboxes.\"\nThe issue began at 6:20 p.m. Eastern time on Wednesday, according to a dashboard the software company maintains. It affected Outlook.com as well as Outlook mobile apps and desktop programs. At 12:21 ET on Thursday, the Microsoft 365 Status account posted that it was rolling out a fix. \nAlthough earlier on Thursday Microsoft posted on X that \"We identified an issue with the initial fix, and we've corrected it...\" \n\nMore details from the Associated Press:\n\nDisruptions appeared to peak just before noon ET on Thursday, when more than 2,700 users worldwide reported issues with Outlook, formerly also Hotmail, to outage tracker Downdetector. Some said they encountered problems like loading their inboxes or signing in. By later in the afternoon, reports had fallen to just over a couple hu",
        "id": 3150374,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/12/1730242/microsoft-outlook-malfunctioned-for-over-21-hours-wednesday-and-thursday?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Outlook Malfunctioned For Over 21 Hours  Wednesday and Thursday",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T17:59:58.077947+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T17:34:00+00:00",
        "description": "China \"accounts for more than half of global coal use,\" reports Asia Times, \"even as it builds the world's largest solar-panel and EV industries.\"\nMuch of the world's solar gear is made on fossil power. The International Energy Agency finds that \"coal generates over 60% of the electricity used for global solar PV manufacturing,\" far above coal's ~36% share of typical grids. That is because over 80% of PV factories sit in Chinese provinces like Xinjiang and Jiangsu, where coal dominates the grid. \n\nChina has poured over $50 billion into solar factories since 2011, roughly ten times Europe's investment, cutting panel costs by about 80% and fueling a worldwide solar boom. But those panels were produced on coal. In one analysis, they repay their manufacturing CO2 in only months, meaning the emissions were dumped up-front in China's coal plants. Any major disruption to China's coal power or factories (from grid shocks to trade barriers) could thus send ripples through the global PV market.",
        "id": 3150005,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/12/044242/much-of-the-worlds-solar-gear-is-made-using-fossil-power-in-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Much of the World's Solar Gear is Made Using Fossil Power in China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T16:53:31.677114+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T16:34:00+00:00",
        "description": "Bitcoin \"vaulted to a fresh all-time high Friday, breaking above $118,000,\" reports Yahoo Finance:\n\nYear to date, the token is up roughly 21%, buoyed in part by crypto-friendly policies from the Trump administration, including the establishment of a strategic bitcoin reserve and a broader digital asset stockpile... \"At the heart of this rally lies sustained structural inflows from institutional players,\" wrote Dilin Wu, research strategist at Pepperstone. \"Corporates are also ramping up participation,\" he added. The analyst noted companies like Strategy and GameStop have continued to add bitcoin to their balance sheets. Trump Media &amp; Technology Group this week also filed for approval to launch a \"Crypto Blue Chip ETF\", which would include about 70% of its holdings in bitcoin. \nThe timing of bitcoin's breakout also comes days before Congress kicks off its highly anticipated \"Crypto Week\" on July 14. Lawmakers will debate a series of bills that could define the industry's regulatory",
        "id": 3149665,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/12/1550205/bitcoin-hits-an-all-time-high-of-118000-up-21-for-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bitcoin Hits an All-Time High of $118,000, Up 21% for 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T15:48:02.077051+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T15:34:00+00:00",
        "description": "The advocacy group Free Press on Friday blasted America's Federal Communications Commission chief \"for an order that rips net neutrality rules off the books, without any time for public comment, following an unfavorable court ruling,\" reports the nonprofit progressive news site Common Dreams:\n\nA panel from the U.S. Court of Appeals for the 6th Circuit ruled in January that broadband is an \"information service\" instead of a \"telecommunications service\" under federal law, and the FCC did not have the authority to prohibit internet service providers (ISPs) from creating online \"fast lanes\" and blocking or throttling web content... FCC Chair Brendan Carr said in a Friday statement that as part of his \"Delete, Delete, Delete\" initiative, \"we're continuing to clean house at the FCC, working to identify and eliminate rules that no longer serve a purpose, have been on our books for decades, and have no place in the current Code of Federal Regulations....\" \n\nResponding in a lengthy statement, ",
        "id": 3149339,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/12/0559241/fcc-chair-accused-of-political-theater-to-please-net-neutralitys-foes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FCC Chair Accused of 'Political Theater' to Please Net Neutrality's Foes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T14:42:59.909370+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T14:34:00+00:00",
        "description": "Slashdot reader hcs_$reboot shared this report from NPR:\nA pair of switches that control the fuel supply to the engines were set to \"cutoff\" moments before the crash of Air India Flight 171, according to a preliminary report from India's Air Accident Investigation Bureau released early Saturday in India... Indian investigators determined the jet was properly configured and lifted off normally. But three seconds after takeoff, the engines' fuel switches were cut off. It's not clear why. \n\nAccording to the report, data from the flight recorders show that the two fuel control switches were switched from the \"run\" position to \"cutoff\" shortly after takeoff. In the cockpit voice recording, one of the pilots can be heard asking the other \"why did he cutoff,\" the report says, while \"the other pilot responded that he did not do so.\" Moments later, the report says, the fuel switches were returned to the \"run\" position. But by then, the plane had begun to lose thrust and altitude. Both the engi",
        "id": 3148981,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/07/12/0326234/before-air-india-boeing-787-crash-fuel-switches-were-cut-off-preliminary-report-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Before Air India Boeing 787 Crash, Fuel Switches Were Cut Off, Preliminary Report Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T13:38:37.721992+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Contrary to popular belief, using cutting-edge artificial intelligence tools slowed down experienced software developers when they were working in codebases familiar to them, rather than supercharging their work, a new study found. AI research nonprofit METR conducted the in-depth study on a group of seasoned developers earlier this year while they used Cursor, a popular AI coding assistant, to help them complete tasks in open-source projects they were familiar with. Before the study, the open-source developers believed using AI would speed them up, estimating it would decrease task completion time by 24%. Even after completing the tasks with AI, the developers believed that they had decreased task times by 20%. But the study found that using AI did the opposite: it increased task completion time by 19%. The study's lead authors, Joel Becker and Nate Rush, said they were shocked by the results: prior to the study, Rush had written down",
        "id": 3148636,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/07/12/016247/ai-slows-down-some-experienced-software-developers-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Slows Down Some Experienced Software Developers, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T10:22:51.091653+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T10:00:00+00:00",
        "description": "Major space industry players -- including SpaceX, Boeing, and Blue Origin -- are urging Congress to maintain funding for the TraCSS space traffic coordination program, warning that eliminating it would endanger satellite safety and potentially drive companies abroad. Under the proposed FY 2026 budget, the Office of Space Commerce's funding would be cut from $65 million to just $10 million. \"That $55M cut is accomplished by eliminating the Traffic Coordination System for Space (TraCSS) program,\" reports The Register. From the report: \"One of OSC's most important functions is to provide space traffic coordination support to US satellite operators, similar to the Federal Aviation Administration's role in air traffic control,\" stated letters from space companies including SpaceX, Boeing, Blue Origin, and others. The letters argue that safe space operations \"in an increasingly congested space domain\" are critical for modern services like broadband satellite internet and weather forecasting",
        "id": 3147735,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/12/0052223/please-dont-cut-funds-for-space-traffic-control-industry-begs-congress?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Please Don't Cut Funds For Space Traffic Control, Industry Begs Congress",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T07:07:53.125570+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T07:00:00+00:00",
        "description": "In June 2025, solar power became the leading source of electricity in the EU for the first time, surpassing nuclear and wind, while coal hit a record low. CBC reports: Solar generated 22.1 percent of the EU's electricity last month, up from 18.9 percent a year earlier, as record sunshine and continued solar installations pushed output to 45.4 terawatt hours. Nuclear followed closely at 21.8 percent and wind contributed 15.8 percent of the mix. At least 13 EU countries, including Germany, Spain and the Netherlands, recorded highest-ever monthly solar generation, [data from energy think tank Ember showed on Thursday.]\n \nCoal's share of the EU electricity mix fell to a record low of 6.1 percent in June, compared to 8.8 percent last year, with 28 percent less electricity generated than a year earlier. Germany and Poland, which together generated nearly 80 percent of the 27-country bloc's coal-fired electricity in June, also saw record monthly lows. Coal accounted for 12.4 per cent of Germ",
        "id": 3146921,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/12/0045216/solar-was-the-leading-source-of-electricity-in-the-eu-last-month?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Solar Was the Leading Source of Electricity In the EU Last Month",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T03:52:50.895943+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: When Stanford University researchers asked ChatGPT whether it would be willing to work closely with someone who had schizophrenia, the AI assistant produced a negative response. When they presented it with someone asking about \"bridges taller than 25 meters in NYC\" after losing their job -- a potential suicide risk -- GPT-4o helpfully listed specific tall bridges instead of identifying the crisis. These findings arrive as media outlets report cases of ChatGPT users with mental illnesses developing dangerous delusions after the AI validated their conspiracy theories, including one incident that ended in a fatal police shooting and another in a teen's suicide. The research, presented at the ACM Conference on Fairness, Accountability, and Transparency in June, suggests that popular AI models systematically exhibit discriminatory patterns toward people with mental health conditions and respond in ways that violate typical therapeutic ",
        "id": 3146338,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/11/2314204/ai-therapy-bots-fuel-delusions-and-give-dangerous-advice-stanford-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Therapy Bots Fuel Delusions and Give Dangerous Advice, Stanford Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T02:48:11.156001+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T02:02:00+00:00",
        "description": "Stanford researchers have developed a blood-based AI tool that calculates the biological age of individual organs to reveal early signs of aging-related disease. The Mercury News reports: The tool, unveiled in Nature Medicine Wednesday, was developed by a research team spearheaded by Tony Wyss-Coray. Wyss-Coray, a Stanford Medicine professor who has spent almost 15 years fixated on the study of aging, said that the tool could \"change our approach to health care.\" Scouring a single draw of blood for thousands of proteins, the tool works by first comparing the levels of these proteins with their average levels at a given age. An artificial intelligence algorithm then uses these gaps to derive a \"biological age\" for each organ.\n \nTo test the accuracy of these \"biological ages,\" the researchers processed data for 45,000 people from the UK Biobank, a database that has kept detailed health information from over half a million British citizens for the last 17 years. When they analyzed the da",
        "id": 3146150,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/11/236230/researchers-develop-new-tool-to-measure-biological-age?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Develop New Tool To Measure Biological Age",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T01:42:53.801669+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T01:25:00+00:00",
        "description": "joshuark writes: A Russian basketball player, Daniil Kasatkin, was arrested on June 21 in France at the request of the United States as he allegedly is part of a network of hackers. Daniil Kasatkin, aged 26, is accused by the United States of negotiating the payment of ransoms to this hacker network, which he denies. He has been studied in the United States, and is the subject of a U.S. arrest warrant for \"conspiracy to commit computer fraud\" and \"computer fraud conspiracy.\"\n \nHis lawyer alleges that Kasatkin is not guilty of these crimes and that they are instead linked to a second-hand computer that he purchased. \"He bought a second-hand computer. He did absolutely nothing. He's stunned,\" his lawyer, Freric Belot, told the media. \"He's useless with computers and can't even install an application. He didn't touch anything on the computer: it was either hacked, or the hacker sold it to him to act under the cover of another person.\" The report notes that Kasatkin briefly played NCAA ba",
        "id": 3145977,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/07/11/2254200/russian-basketball-player-arrested-for-alleged-role-in-ransomware-attacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russian Basketball Player Arrested For Alleged Role In Ransomware Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T01:42:54.008358+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T00:45:00+00:00",
        "description": "iFixit has harsh words for Nintendo's $85 Switch 2 Pro controller, calling it a \"piss-poor excuse for a controller\" due to its difficult repairability, use of outdated drift-prone joysticks, and poor internal accessibility. The Verge reports: Opening the controller requires you to first forcefully remove a faceplate held in place by adhesive tape before a single screw is visible. But you'll need to extract several other parts and components, including the controller's mainboard, before its battery is even accessible. As previously revealed, the Pro 2 is still using older potentiometer-based joysticks that are prone to developing drift over time. They do feature a modular design that will potentially make them easier to swap with third-party Hall effect or TMR replacements, but reassembling the controller after that DIY upgrade will require you to replace all the adhesive tape you destroyed during disassembly. You can watch the full teardown on YouTube.<p><div class=\"share_submission\" ",
        "id": 3145978,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/07/11/1936226/ifixit-the-switch-2-pro-is-a-piss-poor-excuse-for-a-controller?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "iFixit: the Switch 2 Pro is a 'Piss-Poor Excuse For a Controller'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-12T00:37:48.802943+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-12T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: JPMorgan Chase has told financial-technology companies that it will start charging fees amounting to hundreds of millions of dollars for access to their customers' bank account information -- a move that threatens to upend the industry's business models. The largest US bank has sent pricing sheets to data aggregators -- which connect banks and fintechs -- outlining the new charges, according to people familiar with the matter. The fees vary depending on how companies use the information, with higher levies tied to payments-focused companies, the people said, asking not to be identified discussing private information.\n \nA representative for JPMorgan said the bank has invested significant resources to create a secure system that protects consumer data. \"We've had productive conversations and are working with the entire ecosystem to ensure we're all making the necessary investments in the infrastructure that keeps our customers safe,\" t",
        "id": 3145701,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/11/1945201/jpmorgan-tells-fintechs-they-have-to-pay-up-for-customer-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "JPMorgan Tells Fintechs They Have To Pay Up For Customer Data",
        "vote": 0
    }
]