[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-05T15:48:30.375545+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-05T15:30:18+00:00",
        "description": "2024 was a year of major releases, but absolutely no one can deny the impact of Black Myth: Wukong. Developed by Game Science, it launched in August for PS5 and PC to massive success, achieving over 20 million sales within its first month. It's fairly well received critically, and on Steam, it currently holds an Overwhelmingly Positive rating based on nearly 850,000 user reviews at this time. Of course, it shouldn't be surprising that it also had one of the biggest launches in Steam's history.\n\nWith that in mind, the Xbox Series X/S version, delayed for the sake of more polish, has always been a mystery. Thankfully, it's finally launching on August 20th for the platform, allowing Xbox players to finally experience the mythical journey first-hand. Here's everything you should know about Black Myth: Wukong, including its post-launch improvements, before playing.",
        "id": 3257718,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=F2Xn9BBvTb8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/F2Xn9BBvTb8/hqdefault.jpg",
        "title": "Black Myth: Wukong On Xbox Series X | S - 15 Things You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-05T14:45:15.104061+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-05T13:30:05+00:00",
        "description": "Open-world games have become a staple of modern gaming, but not all of them make the most of their sprawling environments. The best games in this genre go beyond map markers and fetch quests; rather they turn exploration into the heart of the experience. \n\nWhen designed with care and purpose, open worlds can offer unforgettable moments - rewarding curiosity and immersion over linear progression. In this video, we’re spotlighting ten PS5 games that embody this design philosophy where venturing off the beaten path often leads to more excitement, depth, and discovery than following the main storyline ever could.",
        "id": 3257086,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=3MUmyS6IL6M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3MUmyS6IL6M/hqdefault.jpg",
        "title": "10 PS5 Games Where Going Off-Path Is More Fun Than The Main Quest",
        "vote": 0
    }
]