[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T16:06:04.252965+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T15:30:13+00:00",
        "description": "The Boss has known many names in her long and extensive military career. Her role in Metal Gear Solid: Snake Eater barely scratches the surface of who she used to be, and the reason that her soldiers will follow her with absolute loyalty no matter where she leads them. \n\nWe take a look at her early days and her meteoric rise to fame and prominence as an elite soldier capable of executing even the most complex battle plans with precision and ruthless efficiency. \n\nWe've been careful not to spoil events in the game, however, as some of you who are playing it for the first time deserve to experience the epic conclusion to her incredible story. \n\nIf you're eagerly waiting to dive into Metal Gear Solid Delta: Snake Eater, this one is probably going to make that wait feel a lot longer than it actually is.",
        "id": 3236407,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=FEa3tCeoIDk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FEa3tCeoIDk/hqdefault.jpg",
        "title": "The Origins of THE BOSS - Before You Play Metal Gear Solid 3: Delta Snake Eater",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T13:57:30.571309+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T13:30:15+00:00",
        "description": "It's time for another comeback story with Star Wars Outlaws finally becoming everything Massive Entertainment hoped it would be when it released to a less than stellar response last year. The studio has been busy bringing it up to scratch since then, listening to a fanbase that could get quite vocal considering how the game's inspiration continues to hold down dedicated loyalists even today.\n\nOutlaws is now an ambitious open world game based on the original movies that is thrilling, fun, immersive, and just plain entertaining in ways that make it a great title to sink a chunk of your life into in 2025. It joins the ranks of STAlKER 2, Cyberpunk 2077, No Man's Sky and several other titles that have managed to bounce back from buggy launches and problematic gameplay systems and for that, we are delighted.",
        "id": 3235685,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=GnNVJbMcXZA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GnNVJbMcXZA/hqdefault.jpg",
        "title": "Star Wars Outlaws Is NOT The Game You Knew At Launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T06:21:45.988272+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T05:45:02+00:00",
        "description": "Marvel's Wolverine has remained in a weird sort of limbo ever since that iconic reveal back at the September 2021 PlayStation showcase. The IP has seen its fair share of troubles since then, but Insomniac continues to reassure its fans that the game is very much in development. \n\nHowever, with little to no information about its gameplay, or even a potential release window, fans are left speculating about whether the studio's cleverly placed references could mean anything or it is was just Insomniac employing the art of misdirection in order to keep the best parts of its new project under wraps. We dive into the fog, and try to bring some clarity on whether Logan is going to arrive on our PlayStations sometime in the near future.",
        "id": 3233851,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=h5Mn7Kp9_jg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/h5Mn7Kp9_jg/hqdefault.jpg",
        "title": "Marvel's Wolverine PS5 - Where The HELL Is It?",
        "vote": 0
    }
]