[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T21:16:45.663538+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T20:34:00+00:00",
        "description": "The Washington Post reports:\nIn early July, a wasp nest with a radiation level 10 times what is allowed by federal regulations was found inside the grounds of a sprawling Cold War-era nuclear site in South Carolina that today partly serves as a storage area for radioactive liquid waste. Federal officials said Friday that at least three more contaminated wasp nests were found within the 310-square-mile Savannah River Site, which encompasses an area more than four times the size of the District of Columbia... \n\n[F]ederal authorities said that the discoveries were not cause for alarm and experts noted that the discovery of radioactivity in wildlife near nuclear facilities did not necessarily indicate the likelihood of a major leak... In a statement sent to reporters, Edwin Deshong, manager of the Savannah River Site's Office of Environmental Management, said the wasp nests had \"very low levels of radioactive contamination\" and did not pose health risks to the site's workers, nearby resid",
        "id": 3237997,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/02/1848200/four-radioactive-wasp-nests-found-near-us-nuclear-storage-site?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Four Radioactive Wasp Nests Found Near US Nuclear Storage Site",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T20:11:02.711859+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T19:34:00+00:00",
        "description": "After an 8.8 earthquake off the coast of Russia, \"weather authorities leapt into action,\" reports SFGate, by modeling the threat of a tsunami \"and releasing warnings and advisories to prepare their communities...\" \n\nBut some residents of Hawaii, Japan and North America's West Coast turned to AI tools for updates that \"appear to have badly bungled the critical task at hand.\" Google's \"AI Overview,\" for example, reportedly gave \"inaccurate information about authorities' safety warnings in Hawaii and elsewhere,\" according to reports on social media.\n\n\n\nThankfully, the tsunami danger quickly subsided on Tuesday night and Wednesday morning without major damage. Still, the issues speak to the growing role of AI tools in people's information diets... and to the tools' potentially dangerous fallibility... A critic of Google &mdash; who prompted the search tool to show an AI overview by adding \"+ai\" to their search &mdash; called the text that showed up \"dangerously wrong.\"\n \n\nResponding to si",
        "id": 3237712,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/02/1645254/ai-tools-gave-false-information-about-tsunami-advisories?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Tools Gave False Information About Tsunami Advisories",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T19:07:14.693845+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T18:34:00+00:00",
        "description": "There's now an \"influx\" of startups fightging wildfires, reports the Washington Post. \n\n\"More than 100 new wildfire-related technologies have launched in the U.S. and around the world since 2023, according to Lori Moore-Merrell, who served as U.S. fire administrator during the Biden administration... Unmanned lookout poles that use AI to sense smoke have been erected in the West. Swarms of military-grade drones are increasingly used for wildfire detection and management. AI technology also tracks lightning strikes, which can ignite wildfires...\"\n\nAs America contends with what is already a punishing year of wildfires across massive swaths of the country, new, extremely precise satellite images beamed from space from the initiative FireSat. In March, a satellite outfitted with infrared sensors was launched more than 370 miles into space with the sole task of detecting and monitoring fires. With the ability to loop millions of miles around the planet each day, it found active fires and b",
        "id": 3237408,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/02/0059225/satellites-drones-and-ai-the-new-high-tech-quest-to-fight-wildfires?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Satellites, Drones, and AI:  the New 'High-Tech Quest to Fight Wildfires'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T18:01:57.369901+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T17:34:00+00:00",
        "description": "\"The July 2025 results of the Steam Survey were posted a few minutes ago,\" Phoronix reported last night, \"and show a healthy 0.32% increase to put the Linux gaming marketshare at 2.89%.\"\nThat's a recent high in percentage terms and while Steam saw around 3% in the early days of Steam on Linux a decade ago, in absolute terms this is likely the largest surveyed figure ever for the Linux gaming population. \nLinux was at 2.89% for July while macOS was at 1.88% and Windows at 95.23%.\n \nThere does seem to be a jagged line that's trending upward... \n\nNovember: 2.03%\nDecember: 2.29%\nJanuary: 2.06%\nFebruary: 1.45%\nMarch: 2.33%\nApril: 2.27%\nMay: 2.69%\nJune: 2.57%\nJuly: 2.89%<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+Steam+on+Linux+Market+Share+Stats+'Likely+the+Largest+Surveyed+Figure+Ever'%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F08%2F02%2F0551235%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=",
        "id": 3237088,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/08/02/0551235/new-steam-on-linux-market-share-stats-likely-the-largest-surveyed-figure-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Steam on Linux Market Share Stats 'Likely the Largest Surveyed Figure Ever'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T16:57:08.059792+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T16:34:00+00:00",
        "description": "After it began \"peering into the distant universe\" in 2022, NASA's James Webb Space Telescope \"has discovered a rash of 'little red dots',\" reports Science magazine. There's \"hundreds of them, shining within the first billion years of the 13.8-billion-year-old universe, so small and red that they defied conventional explanation.\" \n\n\"Only in the past few months has a picture begun to emerge. The little red dots, astronomers say, may be an entirely new type of object: a colossal ball of bright, hot gas, larger than the Solar System, powered not by nuclear fusion, but by a black hole...\"\n\nThe objects, which some astronomers are calling \"black hole stars,\" could be a missing link in the evolution of galaxies and help explain the rapid growth of supermassive black holes that lie at their hearts. \"The big breakthrough of the past 6 months is actually the realization that we can throw out all these other models we've been playing with before,\" says astronomer Anna de Graaff of the Max Planck",
        "id": 3236752,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/02/0516214/early-universes-little-red-dots-may-be-black-hole-stars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Early Universe's 'Little Red Dots' May Be Black Hole Stars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T15:50:51.761899+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T15:34:00+00:00",
        "description": "In Shanghai at the World Artificial Intelligence Conference (which ran until Tuesday), the Chinese government \"announced an international organization for AI regulation and a 13-point action plan aimed at fostering global cooperation to ensure the technology's beneficial and responsible development,\" reports the Washington Post. \nThe theme of the conference was \"Global Solidarity in the AI Era,\" the article notes, and \"the expo is one part of Beijing's bid to establish itself as a responsible AI leader for the international community.\" \n\nCNN points out that China's announcement comes \"just days after the United States unveiled its own plan to promote U.S. dominance.\"\nChinese Premier Li Qiang unveiled China's vision for future AI oversight at the World AI Conference, an annual gathering in Shanghai of tech titans from more than 40 countries... While Li did not directly refer to the U.S. in his speech, he alluded to the ongoing trade tensions between the two superpowers, which include A",
        "id": 3236372,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/02/030232/facing-us-chip-restrictions-china-pitches-global-cooperation-on-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Facing US Chip Restrictions, China Pitches Global Cooperation on AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T14:39:41.621601+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T14:34:00+00:00",
        "description": "The vehicle \"once led the Space Shuttle down the runway at Edwards Air Force Base,\" The Drive reported in 2022, noting it was won in an auction for $21,061 (beating 18 other bidders). \"I just figured the NASA brand combined with Airsteam hip seemed like a can't lose combination,\" the buyer says now, in a listing for the vehicle on the on the automotive sales site Hemmings.com asking $199,000.. \n\nThey're touting it as a priceless marketing/publicity prop &mdash; \"a once in a lifetime opportunity\" to own what was once an \"onsite command center complete with communications and atmospheric monitoring... Imagine pulling into Burning Man driving this...\" The seller points out it's the only custom-built \"Airstream\" trailer ever sold by NASA. (The others were crushed, except for one donated to the Kennedy museum.) But for this one \"Apparently there was some miscommunication when the vehicle was decommissioned. It should have been offered to museums but the sales team did not know what it was.",
        "id": 3236022,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/02/0426200/for-sale-a-1990-airstream-trailernasa-command-vehicle-for-space-shuttle-landings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "For Sale: a 1990 Airstream Trailer/NASA Command Vehicle for Space Shuttle Landings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T13:34:34.580232+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Silicon Valley's AI talent war just reached a compensation milestone that makes even the most legendary scientific achievements of the past look financially modest. When Meta recently offered AI researcher Matt Deitke $250 million over four years (an average of $62.5 million per year)&mdash;with potentially $100 million in the first year alone -- it shattered every historical precedent for scientific and technical compensation we can find on record. [Meta CEO Mark Zuckerberg reportedly also offered an unnamed AI engineer $1 billion in compensation to be paid out over several years.] That includes salaries during the development of major scientific milestones of the 20th century. [...]\n \nTo put these salaries in a historical perspective: J. Robert Oppenheimer, who led the Manhattan Project that ended World War II, earned approximately $10,000 per year in 1943. Adjusted for inflation using the US Government's CPI Inflation Calculato",
        "id": 3235631,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/01/237243/top-ai-salaries-dwarf-those-of-the-manhattan-project-and-the-space-race?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Top AI Salaries Dwarf Those of the Manhattan Project and the Space Race",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T10:24:11.289711+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T10:00:00+00:00",
        "description": "A Rutgers-led study using advanced computational modeling reveals that expanding solar power by just 15% could reduce U.S. carbon emissions by over 8.5 million metric tons annually, with the greatest benefits concentrated in specific regions like California, Texas, and the Southwest. The study has been published in Science Advances. From the report: The study quantified both immediate and delayed emissions reductions resulting from added solar generation. For example, the researchers found that in California, a 15% increase in solar power at noon was associated with a reduction of 147.18 metric tons of CO2 in the region in the first hour and 16.08 metric tons eight hours later.\n \nThe researchers said their methods provide a more nuanced understanding of system-level impacts from solar expansion than previous studies, pinpointing where the benefits of increased solar energy adoption could best be realized. In some areas, such as California, Florida, the mid-Atlantic, the Midwest, Texas",
        "id": 3234762,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/01/2313250/researchers-map-where-solar-energy-delivers-the-biggest-climate-payoff?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Map Where Solar Energy Delivers the Biggest Climate Payoff",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T07:09:37.110319+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T07:00:00+00:00",
        "description": "A new paper from Bangor University outlines the \"bizarre phenomenon\" known as the transparency paradox: that transparency is needed to foster public trust in science, but being transparent about science, medicine and government can also reduce trust. The paper argues that while openness in science is intended to build trust, it can backfire when revealing uncomfortable truths. Philosopher Byron Hyde and author of the study suggests that public trust could be improved not by sugarcoating reality, but by educating people to expect imperfection and understand how science actually works. Phys.org reports: The study revealed that, while transparency about good news increases trust, transparency about bad news, such as conflicts of interest or failed experiments, decreases it. Therefore, one possible solution to the paradox, and a way to increase public trust, is to lie (which Hyde points out is unethical and ultimately unsustainable), by for example making sure bad news is hidden and that ",
        "id": 3234036,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/01/2254211/lying-increases-trust-in-science-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lying Increases Trust In Science, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T03:54:09.015020+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: Anthropic revoked OpenAI's API access to its models on Tuesday, multiple sources familiar with the matter tell WIRED. OpenAI was informed that its access was cut off due to violating the terms of service. \"Claude Code has become the go-to choice for coders everywhere, and so it was no surprise to learn OpenAI's own technical staff were also using our coding tools ahead of the launch of GPT-5,\" Anthropic spokesperson Christopher Nulty said in a statement to WIRED. \"Unfortunately, this is a direct violation of our terms of service.\" According to Anthropic's commercial terms of service, customers are barred from using the service to \"build a competing product or service, including to train competing AI models\" or \"reverse engineer or duplicate\" the services. This change in OpenAI's access to Claude comes as the ChatGPT-maker is reportedly preparing to release a new AI model, GPT-5, which is rumored to be better at coding.\n \nOpenAI was plugg",
        "id": 3233440,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/01/2237220/anthropic-revokes-openais-access-to-claude-over-terms-of-service-violation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Revokes OpenAI's Access To Claude Over Terms of Service Violation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T02:49:06.927681+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T02:02:00+00:00",
        "description": "Longtime Slashdot reader AmiMoJo shares a report from Electrek: Peak Energy shipped out its first sodium-ion battery energy storage system, and the New York-based company says it's achieved a first in three ways: the US's first grid-scale sodium-ion battery storage system; the largest sodium-ion phosphate pyrophosphate (NFPP) battery system in the world; and the first megawatt-hour scale battery to run entirely on passive cooling -- no fans, pumps, or vents. That's significant because removing moving parts and ditching active cooling systems eliminates fire risk.\n \nAccording to the Electric Power Research Institute, 89% of battery fires in the US trace back to thermal management issues. Peak's design doesn't have those issues because it doesn't have those systems. Instead, the 3.5 MWh system uses a patent-pending passive cooling architecture that's simpler, more reliable, and cheaper to run and maintain. The company says its technology slashes auxiliary power needs by up to 90%, saves",
        "id": 3233252,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/01/2120225/peak-energy-ships-americas-first-grid-scale-sodium-ion-battery?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Peak Energy Ships America's First Grid-Scale Sodium-Ion Battery",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T01:44:06.292821+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T01:25:00+00:00",
        "description": "Aurora Innovation has expanded its autonomous trucking operations with nighttime driverless runs between Dallas and Houston and a new Phoenix terminal. \"Efficiency, uptime, and reliability are important for our customers, and Aurora is showing we can deliver,\" said Chris Urmson, co-founder and CEO of Aurora, in a press release. \"Just three months after launch, we're running driverless operations day and night and we've expanded our terminal network to Phoenix. Our rapid progress is beginning to unlock the full value of self-driving trucks for our customers, which has the potential to transform the trillion-dollar trucking industry.\" FreightWaves reports: The expansion allows for continuous utilization, shortening delivery times and serving as part of its path to autonomous trucking profitability. Aurora notes that the unlocking of nighttime autonomous operations can also improve road safety. It cited a 2021 Federal Motor Carrier Safety Administration report on large truck and bus cras",
        "id": 3233055,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/01/2242247/auroras-self-driving-trucks-are-now-driving-at-night?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Aurora's Self-Driving Trucks Are Now Driving At Night",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T01:44:06.473970+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T00:45:00+00:00",
        "description": "Longtime Slashdot reader Mr_Blank shares a report from Autoblog: Once a new OTA update becomes available, owners of GM vehicles have 45 days to install the update. After this date, the company will not cover any damages or issues that are caused by ignoring the update. \"Damage resulting from failure to install over-the-air software updates is not covered,\" states the warranty booklet for 2025 and 2026 models.\n \nThis same rule applies to all GM's brands in the USA: Chevrolet, Buick, Cadillac, and GMC. However, if the software update itself causes any component damage, that will be covered by the warranty. Owners coming from older GM vehicles will have to adapt as the company continues to implement its Global B electronic architecture on newer models, which relies heavily on OTA updates. Similar policies appear in the owner's manual for Tesla. Software-defined vehicles are here to stay, even if some of them have far more tech glitches than they should -- just ask Volvo.<p><div class=\"sh",
        "id": 3233056,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/01/2116210/skipping-over-the-air-car-updates-could-be-costly?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Skipping Over-The-Air Car Updates Could Be Costly",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T00:39:07.551470+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: An airline leaving all of its passengers' travel records vulnerable to hackers would make an attractive target for espionage. Less obvious, but perhaps even more useful for those spies, would be access to a premium travel service that spans 10 different airlines, left its own detailed flight information accessible to data thieves, and seems to be favored by international diplomats. That's what one team of cybersecurity researchers found in the form of Airportr, a UK-based luggage service that partners with airlines to let its largely UK- and Europe-based users pay to have their bags picked up, checked, and delivered to their destination. Researchers at the firm CyberX9 found that simple bugs in Airportr's website allowed them to access virtually all of those users' personal information, including travel plans, or even gain administrator privileges that would have allowed a hacker to redirect or steal luggage in transit. Among even the sm",
        "id": 3232861,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/01/219227/a-luggage-services-web-bugs-exposed-the-travel-plans-of-every-user?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Luggage Service's Web Bugs Exposed the Travel Plans of Every User",
        "vote": 0
    }
]