[
    {
        "age": null,
        "album": "",
        "author": "Ku Bogu",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-02T16:48:14.292306+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-02T16:40:02+00:00",
        "description": "Serdecznie zapraszamy na comiesięczne Zawierzenie Niepokalanemu Sercu Maryi, Królowej Polski, które odbędzie się w najbliższą pierwszą sobotę miesiąca, 2 sierpnia 2025 r. 🗓️ w Kaplicy Cudownego Obrazu na Jasnej Górze! 🙏✨\n\n🌺 Sierpień - miesiąc Matki Bożej, czas pielgrzymek i wakacyjnej odnowy! ☀️\nSierpień to szczególny czas w liturgicznym kalendarzu - miesiąc poświęcony  Najświętszej Maryi Pannie! 👑 To właśnie teraz tysiące pielgrzymów wyrusza pieszo na Jasną Górę, niosąc w sercach swoje modlitwy. Drogi prowadzące do Częstochowy tętnią życiem wiary - to piękny znak naszej Maryjnej pobożności i zaufania do Matki Bożej. 🚶‍♂️🚶‍♀️\n\nW wakacyjnym czasie, gdy mamy więcej chwil na refleksję i modlitwę, zapraszamy do szczególnego zawierzenia się Niepokalanemu Sercu Maryi. To idealny moment, by w ciszy wakacyjnych dni odnaleźć głębszą więź z Bogiem przez macierzyńskie ręce Najświętszej Panny. 💖\n\nSierpień obfituje w wielkie święta maryjne - Wniebowzięcie Najświętszej Maryi Panny (15 sierpnia) i N",
        "id": 3236713,
        "language": "pl",
        "link": "https://www.youtube.com/watch?v=s8QTTBk6wR8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 178,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s8QTTBk6wR8/hqdefault.jpg",
        "title": "📢Zawierzenie Niepokalanemu Sercu Maryi Królowej Korony Polski ✨⛪ część 2",
        "vote": 0
    }
]