[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T23:59:27.329002+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T23:20:00+00:00",
        "description": "Longtime Slashdot reader Gadi Evron writes: Bruce Schneier and Barath Raghavan say agentic AI is already broken at the core. In their IEEE Security &amp; Privacy essay, they argue that AI agents run on untrusted data, use unverified tools, and make decisions in hostile environments. Every part of the OODA loop (observe, orient, decide, act) is open to attack. Prompt injection, data poisoning, and tool misuse corrupt the system from the inside. The model's strength, treating all input as equal, also makes it exploitable. They call this the AI security trilemma: fast, smart, or secure. Pick two. Integrity isn't a feature you bolt on later. It has to be built in from the start. \"Computer security has evolved over the decades,\" the authors wrote. \"We addressed availability despite failures through replication and decentralization. We addressed confidentiality despite breaches using authenticated encryption. Now we need to address integrity despite corruption.\"\n \n\"Trustworthy AI agents req",
        "id": 3814848,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/14/2054250/are-ai-agents-compromised-by-design",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are AI Agents Compromised By Design?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T23:59:27.462857+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T22:40:00+00:00",
        "description": "Walmart announced a new partnership with OpenAI that will let customers shop using ChatGPT. \"For many years now, eCommerce shopping experiences have consisted of a search bar and a long list of item responses. That is about to change,\" Walmart CEO Doug McMillon said in a statement. NBC News reports: It was unclear Tuesday what the terms of the Walmart-AI partnership would be. The announcement also did not say when shoppers can expect to see ChatGPT integrated with their Walmart online shopping experiences, only that it's coming \"soon.\" The OpenAI announcement is part of a broader push by Walmart, the biggest private employer in the U.S., to incorporate AI into its daily operations.\n \n\"We're excited to partner with Walmart to make everyday purchases a little simpler. It's just one way AI will help people every day under our work together,\" Sam Altman, the co-founder and CEO of OpenAI, said in a statement. The partnership could also serve OpenAI by introducing ChatGPT to a massive set o",
        "id": 3814849,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/14/2048246/walmart-chatgpt-team-up-for-shopping",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Walmart, ChatGPT Team Up For Shopping",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T22:24:00.607852+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Today is the official end-of-support date for Microsoft's Windows 10. That doesn't mean these PCs will suddenly stop working, but if you don't take action, it does mean your PC has received its last regular security patches and that Microsoft is washing its hands of technical support. This end-of-support date comes about a decade after the initial release of Windows 10, which is typical for most Windows versions. But it comes just four years after Windows 10 was replaced by Windows 11, a version with stricter system requirements that left many older-but-still-functional PCs with no officially supported upgrade path. As a result, Windows 10 still runs on roughly 40 percent of the world's Windows PCs (or around a third of US-based PCs), according to StatCounter data.\n \nBut this end-of-support date also isn't set in stone. Home users with Windows 10 PCs can enroll in Microsoft's Extended Security Updates (ESU) program, which extends ",
        "id": 3814205,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/14/2043238/windows-10-support-ends-today",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows 10 Support 'Ends' Today",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T22:24:00.733552+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T21:21:00+00:00",
        "description": "Salesforce says it's saving about $100 million a year by using AI tools in the software company's customer service operations. From a report: The company is working to sell AI features that can handle work such as customer service or early-stage sales. To illustrate the value of the Agentforce product to business clients, Salesforce has been vocal about its own use of the technology. \n\nChief Executive Officer Marc Benioff announced the statistic on Salesforce's savings during a speech Tuesday at the annual Dreamforce conference in San Francisco. The company said more than 12,000 customers are using Agentforce. For example, Reddit was able to cut customer support resolution time by 84%, Salesforce said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Salesforce+Says+AI+Customer+Service+Saves+%24100+Million+Annually%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F14%2F1925230%2F%3Futm_source%3Dtwitter%26utm_medium%3D",
        "id": 3814206,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/14/1925230/salesforce-says-ai-customer-service-saves-100-million-annually",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Salesforce Says AI Customer Service Saves $100 Million Annually",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T20:46:32.583808+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T20:41:00+00:00",
        "description": "DirecTV wants to use AI to put you, your family, and your pets inside a custom TV screensaver. From a report: If that's not uncanny enough, you'll find items you can shop for within that AI environment, whether it's a piece of clothing similar to the one your AI likeness is wearing or a piece of furniture that pops up alongside it. \n\nThe satellite TV giant is partnering with the AI company Glance to roll out this experience to DirecTV Gemini devices starting next year. \"We are making television a lean-in experience versus lean back,\" Rajat Wanchoo, the group vice president of commercial partnerships at Glance, tells The Verge. \"We want to give users a chance to use the advancements that have happened in generative AI to create a ChatGPT moment for themselves, but on TV.\" Glance is owned by InMobi, the same company that injected ecommerce bloatware into Motorola's budget phones.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/hom",
        "id": 3813621,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/14/1323222/directv-will-soon-bring-ai-ads-to-your-screensaver",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DirecTV Will Soon Bring AI Ads To Your Screensaver",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T20:46:32.663398+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T20:01:00+00:00",
        "description": "An anonymous reader shares a report: An attorney in a New York Supreme Court commercial case got caught using AI in his filings, and then got caught using AI again in the brief where he had to explain why he used AI, according to court documents filed earlier this month. \n\nNew York Supreme Court Judge Joel Cohen wrote in a decision granting the plaintiff's attorneys' request for sanctions that the defendant's counsel, Michael Fourte's law offices, not only submitted AI-hallucinated citations and quotations in the summary judgment brief that led to the filing of the plaintiff's motion for sanctions, but also included \"multiple new AI-hallucinated citations and quotations\" in the process of opposing the motion. \n\n\"In other words,\" the judge wrote, \"counsel relied upon unvetted AI -- in his telling, via inadequately supervised colleagues -- to defend his use of unvetted AI.\" \n\nThe case itself centers on a dispute between family members and a defaulted loan. The details of the case involv",
        "id": 3813622,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/14/1542245/lawyer-caught-using-ai-while-explaining-to-court-why-he-used-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lawyer Caught Using AI While Explaining to Court Why He Used AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T20:46:32.782982+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T19:22:00+00:00",
        "description": "Indonesia's film industry has started using generative AI tools to produce films at a fraction of Hollywood budgets. The country's filmmakers are deploying ChatGPT for scriptwriting, Midjourney for image generation, and Runway for video storyboarding. VFX artist Amilio Garcia Leonard told Rest of World that AI has reduced his draft editing time by 70%. \n\nThe Indonesian Film Producer Association supports the technology. Indonesian films typically cost 10 billion rupiah ($602,500), less than 1% of major Hollywood productions. The sector employed about 40,000 people in 2020 and generated over $400 million in box office sales in 2023. Jobs for storyboarders, VFX artists, and voice actors are disappearing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Indonesia's+Film+Industry+Embraces+AI+To+Make+Hollywood-style+Movies+For+Cheap%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F10%2F14%2F1536226%2F%3Futm_source",
        "id": 3813623,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/14/1536226/indonesias-film-industry-embraces-ai-to-make-hollywood-style-movies-for-cheap",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Indonesia's Film Industry Embraces AI To Make Hollywood-style Movies For Cheap",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T19:09:09.786027+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T18:41:00+00:00",
        "description": "The United Nations Food and Agriculture Organization projects record production of global cereal crops in the 2025-26 farming season. The forecast covers wheat, corn and rice, and comes as the global stocks-to-use ratio stands around 30.6% -- the world is producing nearly a third more of these foundational crops than it currently uses. \n\nThe U.S. Department of Agriculture reported in August that American farmers would harvest a record corn crop at record yield per acre. The FAO Food Price Index has risen slightly this year but remains nearly 20% below its peak during the early months of the war in Ukraine. Average calories available per person worldwide have climbed from roughly 2,100 to 2,200 kilocalories daily in the early nineteen-sixties to just under 3,000 kilocalories daily by 2022. Cereal yields have roughly tripled since 1961. Yet the World Bank estimates around 2.6 billion people cannot afford a healthy diet, and current famines in Gaza and Sudan stem from political failures ",
        "id": 3812858,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/14/1525220/the-world-is-producing-more-food-crops-than-ever-before",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The World is Producing More Food Crops Than Ever Before",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T19:09:09.872447+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T18:01:00+00:00",
        "description": "Generative AI models trained on internet data lack exposure to vast domains of human knowledge that remain undigitized or underrepresented online. English dominates Common Crawl with 44% of content. Hindi accounts for 0.2% of the data despite being spoken by 7.5% of the global population. Tamil represents 0.04% despite 86 million speakers worldwide. Approximately 97% of the world's languages are classified as \"low-resource\" in computing. \n\nA 2020 study found 88% of languages face such severe neglect in AI technologies that bringing them up to speed would require herculean efforts. Research on medicinal plants in North America, northwest Amazonia and New Guinea found more than 75% of 12,495 distinct uses of plant species were unique to just one local language. Large language models amplify dominant patterns through what researchers call \"mode amplification.\" The phenomenon narrows the scope of accessible knowledge as AI-generated content increasingly fills the internet and becomes trai",
        "id": 3812859,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/14/155258/generative-ai-systems-miss-vast-bodies-of-human-knowledge-study-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Generative AI Systems Miss Vast Bodies of Human Knowledge, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T17:30:22.740425+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T17:20:00+00:00",
        "description": "California has enacted new legislation that aims to limit companies from charging consumers \"exorbitant\" fees to cancel fixed-term contracts. From a report: Assembly Bill 483 was signed into law by California Gov. Gavin Newsom on Friday, placing transparency requirements and fee limits on early terminations for installment contracts -- plans that allow consumers to make recurring payments for goods and services over a specified duration. \n\nThis includes services that lure consumers into signing annual contracts by allowing them to pay in installments that appear similar to rolling monthly subscriptions, but with hefty cancellation fees for not locking in for the full year. The bill bans companies from hiding early termination fee disclosures within fine print or obscured hyperlinks, and limits the total fee amount to a maximum of 30 percent of the total contract cost. The goal is to make it easier for Californians to take these fees into account when comparing between services, and le",
        "id": 3812137,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/14/176237/california-cracks-down-on-predatory-early-cancellation-fees",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California Cracks Down on 'Predatory' Early Cancellation Fees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T17:30:22.913347+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T16:41:00+00:00",
        "description": "Researchers at UC San Diego and the University of Maryland have found that roughly half of geostationary satellite signals transmit sensitive data without encryption. The team spent three years using an $800 satellite receiver on a university rooftop in San Diego to intercept communications from satellites visible from their location. They collected phone calls and text messages from more than 2,700 T-Mobile users in just nine hours of recording. \n\nThe researchers also obtained data from airline passengers using in-flight Wi-Fi, communications from electric utilities and offshore oil and gas platforms, and US and Mexican military communications that revealed personnel locations and equipment details. The exposed data resulted from telecommunications companies using satellites to relay signals from remote cell towers to their core networks. \n\nThe researchers examined only about 15% of global satellite transponder communications and presented their findings at an Association for Computi",
        "id": 3812138,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/14/1043236/satellites-are-leaking-the-worlds-secrets-calls-texts-military-and-corporate-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Satellites Are Leaking the World's Secrets: Calls, Texts, Military and Corporate Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T16:18:28.911761+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T16:00:00+00:00",
        "description": "An anonymous reader shares a report: China's expansion of its rare earth export controls appeared to mark another escalation in the US-China trade war last week. But the announcements were also significant in another way: unusually, the documents could not be opened using American word processing software. \n\nFor the first time, China's Ministry of Commerce issued a slew of documents that could be directly accessed only through WPS Office -- China's answer to Microsoft Office -- as Beijing continues its tech self-reliance drive. Developed by the Beijing-based software company Kingsoft, WPS Office uses a different coding structure to Microsoft Office, meaning WPS text files cannot be opened directly in Word without conversion. Previously, the ministry primarily released text documents in Microsoft Word format.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Beijing+Issues+Documents+Without+Word+Format+Amid+US+Tensions%",
        "id": 3811443,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/14/0920224/beijing-issues-documents-without-word-format-amid-us-tensions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Beijing Issues Documents Without Word Format Amid US Tensions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T16:18:29.162610+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T15:21:00+00:00",
        "description": "An anonymous reader shares a report: After acquiring GitHub in 2018, Microsoft mostly let the developer platform run autonomously. But in recent months, that's changed. With GitHub CEO Thomas Dohmke leaving the company this August, and GitHub being folded more deeply into Microsoft's organizational structure, GitHub lost that independence. Now, according to internal GitHub documents The New Stack has seen, the next step of this deeper integration into the Microsoft structure is moving all of GitHub's infrastructure to Azure, even at the cost of delaying work on new features. \n\n[...] While GitHub had previously started work on migrating parts of its service to Azure, our understanding is that these migrations have been halting and sometimes failed. There are some projects, like its data residency initiative (internally referred to as Project Proxima) that will allow GitHub's enterprise users to store all of their code in Europe, that already solely use Azure's local cloud regions.<p><d",
        "id": 3811444,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/14/0833202/github-will-prioritize-migrating-to-azure-over-feature-development",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GitHub Will Prioritize Migrating To Azure Over Feature Development",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T15:02:43.710982+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T14:41:00+00:00",
        "description": "Engineer Denis Stetskov, writing in a blog: The Apple Calculator leaked 32GB of RAM. Not used. Not allocated. Leaked. A basic calculator app is hemorrhaging more memory than most computers had a decade ago. Twenty years ago, this would have triggered emergency patches and post-mortems. Today, it's just another bug report in the queue. We've normalized software catastrophes to the point where a Calculator leaking 32GB of RAM barely makes the news. This isn't about AI. The quality crisis started years before ChatGPT existed. AI just weaponized existing incompetence. \n\n[...] Here's what engineering leaders don't want to acknowledge: software has physical constraints, and we're hitting all of them simultaneously. Modern software is built on towers of abstractions, each one making development \"easier\" while adding overhead: Today's real chain: React &gt; Electron &gt; Chromium &gt; Docker &gt; Kubernetes &gt; VM &gt; managed DB &gt; API gateways. Each layer adds \"only 20-30%.\" Compound a h",
        "id": 3810784,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/14/0826220/the-great-software-quality-collapse",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Great Software Quality Collapse",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T15:02:43.797562+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T14:00:00+00:00",
        "description": "Preteens who use increasing amounts of social media perform poorer in reading, vocabulary and memory tests in early adolescence compared to those who use little or no social media. A study published in JAMA examined data from over 6,000 children ages 9 to 10 through early adolescence. Researchers classified the children into three groups: 58% used little or no social media over several years, 37% started with low-level use but spent about an hour daily on social media by age 13, and 6% spent three or more hours daily by that age. \n\nEven low users who spent about one hour per day performed 1 to 2 points lower on reading and memory tasks compared to non-users. High users performed 4 to 5 points lower than non-social media users. Jason Nagata, a pediatrician at the University of California, San Francisco and study author, said the findings were notable because even modest social media use correlated with lower cognitive scores.<p><div class=\"share_submission\" style=\"position:relative;\">\n",
        "id": 3810785,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/14/0643226/digital-platforms-correlate-with-cognitive-decline-in-young-users",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Digital Platforms Correlate With Cognitive Decline in Young Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T13:51:12.172953+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T13:00:00+00:00",
        "description": "Apple has rebranded its streaming service Apple TV+ to simply Apple TV, further blurring the already confusing line between the Apple TV device, the Apple TV app, and the Apple TV service. As John Gruber notes, users can now \"watch Apple TV in Apple TV on Apple TV.\" From Daring Fireball: In some ways, I get it. Like, if you're telling someone how much you enjoy Slow Horses and they ask how to watch it, it's more natural and conversational to just say \"It's on Apple TV.\" That's what most people say. That's what I say -- and as part of my job, I completely understand the difference between Apple TV the device, Apple TV the (free) app, and Apple TV+ the (paid) streaming service.\n \nBut right there in Apple's own \"About Apple TV\" description, you see just how overused \"Apple TV\" now is. You can watch Apple TV in Apple TV on Apple TV -- the paid service in the free app on the set-top box. But you can watch any streaming service you want on the box, in that service's own app. But many of tho",
        "id": 3810110,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/14/0138239/apple-renames-apple-tv-to-apple-tv",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Renames 'Apple TV+' To 'Apple TV'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T11:25:39.336280+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T10:00:00+00:00",
        "description": "schwit1 shares a report from Hackread: On October 3, 2025, Hackread.com published an in-depth report in which hackers claimed to have stolen 989 million records from 39 major companies worldwide by exploiting a Salesforce vulnerability. The group demanded that Salesforce and the affected firms enter negotiations before October 10, 2025, warning that if their demands were ignored, they would release the entire dataset. The hackers, identifying themselves as \"Scattered Lapsus$ Hunters,\" a collective said to combine elements of Scattered Spider, Lapsus$, and ShinyHunters, have now published data allegedly belonging to 6 of the 39 targeted companies.\n \nThe companies named in the leak are as follows: Fujifilm, GAP, INC., Vietnam Airlines, Engie Resources, Quantas Airways Limited, and Albertsons Companies, Inc. In all 6 leaks, the record contains personal details of customers, business, including email addresses, full names, addresses, passport numbers, phone numbers. The hackers said on Te",
        "id": 3809015,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/14/0113254/shinyhunters-leak-alleged-data-from-qantas-vietnam-airlines-and-other-major-firms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ShinyHunters Leak Alleged Data From Qantas, Vietnam Airlines and Other Major Firms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T07:23:27.220082+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T07:00:00+00:00",
        "description": "NASA's Jet Propulsion Laboratory is laying off around 550 employees, or roughly 11% of its workforce, as part of an effort to \"restructure and establish an appropriate size to ensure future success.\" According to JPL Director Dave Gallagher, the job cuts \"are not related to the current government shutdown.\" CNBC reports: JPL is a research and development lab funded by NASA -- the federal space agency -- and managed by the California Institute of Technology. \"While not easy, I believe that taking these actions now will help the Lab transform at the scale and pace necessary to help achieve humanity's boldest ambitions in space,\" Gallagher wrote in a separate mekor to JPL employees and contractors. Gallagher, in the public announcement, noted that the reorganization of JPL began in July, and \"over the past few months, we have communicated openly with employees about the challenges and hard choices ahead.\"\n \n\"This week's action, while not easy, is essential to securing JPL's future by cre",
        "id": 3807766,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/14/0133211/nasa-unit-jpl-to-lay-off-about-550-workers-citing-restructure",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Unit JPL To Lay Off About 550 Workers, Citing Restructure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T04:36:10.664597+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: Security researchers have resurrected a 12-year-old data-stealing attack on web browsers to pilfer sensitive info from Android devices. The attack, dubbed Pixnapping, has yet to be mitigated. Conceptually, it's the equivalent of a malicious Android app being able to screenshot other apps or websites. It allows a malicious Android application to access and leak information displayed in other Android apps or on websites. It can, for example, steal data displayed in apps like Google Maps, Signal, and Venmo, as well as from websites like Gmail (mail.google.com). It can even steal 2FA codes from Google Authenticator.\n \n\"First, the malicious app opens the target app (e.g., Google Authenticator), submitting its pixels for rendering,\" explained [Alan Wang, a PhD candidate at UC Berkeley]. \"Second, the malicious app picks the coordinates of a target pixel whose color it wants to steal. Suppose for example it wants to steal a pixel that is ",
        "id": 3807046,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/14/019242/android-pixnapping-attack-can-capture-app-data-like-2fa-codes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Android 'Pixnapping' Attack Can Capture App Data Like 2FA Codes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T01:38:35.906028+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T01:25:00+00:00",
        "description": "SpaceX's Starship megarocket successfully completed its 11th test flight, achieving major milestones like engine relight, satellite deployment, and a controlled splashdown in the Indian Ocean. From a report: This mission marks the second clean test run for Version 2, following a successful showing during its last test mission in August. Earlier this year, however, Starship Version 2 suffered three in-flight failures and an explosive accident during ground testing. Today's test mission is expected to be the last for the current iteration of Starship prototypes. The company has said it will debut a scaled up Version 3 for the next flight. You can watch a recording of the launch on YouTube.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SpaceX+Starship+Hits+Key+Milestones+Before+Stunning+Splashdown%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F10%2F14%2F0123227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><",
        "id": 3806441,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/14/0123227/spacex-starship-hits-key-milestones-before-stunning-splashdown",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SpaceX Starship Hits Key Milestones Before Stunning Splashdown",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T01:38:36.103774+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T00:45:00+00:00",
        "description": "The FCC has forced major U.S. online retailers to remove millions of listings for prohibited Chinese-made electronics, including products from Huawei, ZTE, Hikvision, and Dahua, citing national security risks. Reuters reports: FCC Chair Brendan Carr said in an interview [on Friday] that the items removed are either on a U.S. list of barred equipment or were not authorized by the agency, including items like home security cameras and smart watches from companies including Huawei, Hangzhou Hikvision, ZTE, and Dahua Technology Company. Carr said companies are putting new processes in place to prevent future prohibited items as a result of FCC oversight. \"We're going to keep our efforts up,\" Carr said. The FCC issued a new national security notice reminding companies of prohibited items including video surveillance equipment. Carr said the items could allow China to \"surveil Americans, disrupt communications networks and otherwise threaten U.S. national security.\"<p><div class=\"share_subm",
        "id": 3806442,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/13/2236211/major-us-online-retailers-remove-listings-for-millions-of-prohibited-chinese-electronics",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Major US Online Retailers Remove Listings For Millions of Prohibited Chinese Electronics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T00:13:10.591037+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T00:02:00+00:00",
        "description": "Palmer Luckey's defense tech firm Anduril has unveiled EagleEye, an AI-powered mixed-reality combat helmet built in partnership with Meta. The system integrates AR displays, spatial audio, and drone control to create what Luckey calls \"a new teammate\" for soldiers. \"The idea of an AI partner embedded in your display has been imagined for decades. EagleEye is the first time it's real,\" said Luckey. The Verge reports: Anduril, which also manufactures border control tech, lethal drones, and military aircraft, has been developing EagleEye since its inception, and already provides software for the Army's existing MR goggles, based on Microsoft's HoloLens hardware. Its partnership with Meta was announced this May, and the company told TechCrunch at the time that the collaboration was to develop EagleEye. It's a reunion of sorts for Luckey and Mark Zuckerberg, after Meta purchased Luckey's then-start-up Oculus in 2014 and fired the founder three years later.<p><div class=\"share_submission\" s",
        "id": 3806039,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/13/2230223/palmer-luckeys-anduril-launches-eagleeye-military-helmet",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Palmer Luckey's Anduril Launches EagleEye Military Helmet",
        "vote": 0
    }
]