[
    {
        "age": null,
        "album": "",
        "author": "John Gruber",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T19:09:53.679958+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T18:45:39+00:00",
        "description": "<p>Adam Engst, at TidBITS:</p>\n\n<blockquote>\n  <p>Apple’s new Liquid Glass interface design brings transparency and\nblur effects to all Apple operating systems, but many users find\nit distracting or difficult to read. Here’s how to control its\neffects and make your interface more usable. Although the relevant\nAccessibility settings are quite similar across macOS, iOS,\nwatchOS, and tvOS, I separate them because they offer different\nlevels of utility in each.</p>\n</blockquote>\n\n<p>Comprehensive, illustrated overview of the various Accessibility settings (and, on MacOS 26 Tahoe, hidden command-line <code>defaults</code> settings) that let you adjust the transparency and contrast of Liquid Glass across the various Apple OS 26 interfaces. A useful guide for today — and, I bet, a useful look back at the first versions of Liquid Glass for the future.</p>\n\n<div>\n<a  title=\"Permanent link to ‘‘How to Turn Liquid Glass Into a Solid Interface’’\"  href=\"https://daringfireball.net/linked/2025/10/1",
        "id": 3812862,
        "language": "",
        "link": "https://tidbits.com/2025/10/09/how-to-turn-liquid-glass-into-a-solid-interface",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "‘How to Turn Liquid Glass Into a Solid Interface’",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "John Gruber",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T17:31:08.843644+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T16:39:36+00:00",
        "description": "<p>Jason Snell, at Six Colors:</p>\n\n<blockquote>\n  <p>The entire point of a streaming-only product is that once you’re\noff traditional TV, you can go beyond the single stream and\nprovide interactive options. The whole point of streaming TV,\nespecially sports, should be that you can leave the flat video\nstream behind and build something cool using software.</p>\n\n<p>That is, by the way, what F1 TV Pro is: A sophisticated bit of\nsoftware that merges track data with multiple cameras to let\nviewers choose how they want to watch races. It’s absolutely\nthe product that Apple should aspire to build, or co-opt, in\nthis deal.</p>\n\n<p>I understand that Formula 1 owner Liberty Media is reluctant to\nlose a profit center, but if Apple’s paying them an extra $50\nmillion, isn’t that the proper trade-off? Also, working with Apple\nin the U.S. could be part of a longer-term tech partnership\nbetween F1 and Apple that could extend worldwide.</p>\n</blockquote>\n\n<p>I don’t really care about Apple obtaining ",
        "id": 3812141,
        "language": "",
        "link": "https://sixcolors.com/post/2025/10/looking-for-the-red-flags-in-apples-formula-1-tv-deal",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "‘Looking for the Red Flags in Apple’s Formula 1 TV Deal’",
        "vote": 0
    }
]