[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T16:04:52.056123+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T15:45:07+00:00",
        "description": "Horror games have a unique way of crawling under your skin - not just through jump scares but through appropriate atmosphere, interesting storytelling, or even the creeping dread of the unknown. \n\nOver the years, the genre has evolved from relatively simple survival experiences to deeply psychological journeys that use tricks like mechanical horror or the inherent fear of the unknown to create experiences that linger in our memories long after the credits roll. \n\nWith this video, we’re counting down 20 of the best horror games of all time, each offering a distinctive brand of terror that lingers long after the screen fades to black.",
        "id": 3811376,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=dUAGnWVqC44",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dUAGnWVqC44/hqdefault.jpg",
        "title": "20 Brutal, Unforgiving Horror Games That Will BREAK YOUR NERVES",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-14T13:38:20.166963+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-14T13:30:00+00:00",
        "description": "Ninja Gaiden 3 was easily the weakest addition to the franchise, a very worthy version in Razor's Edge notwithstanding. It was the first chink in the franchise's otherwise solid armor, bringing a lot of negative feedback to ambitious attempts to switch things up in a tried and tested formula.\n\nThe result was a game that was poorly received critically while its lackluster story and combat alienated its fans. But Team Ninja did turn things around with Razor's Edge but was it enough to redeem the game? \n\nWe dive into what clicked and what didn't, and what the lessons Team Ninja learned back in the day could mean for Ninja Gaiden 4. Join us on this trip down memory lane ahead of a new chapter for the beloved franchise.",
        "id": 3810072,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=a19Nd3EhOZM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/a19Nd3EhOZM/hqdefault.jpg",
        "title": "Why The Hell Did Ninja Gaiden 3 BOMBED?",
        "vote": 0
    }
]