[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-25T17:44:13.693095+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-25T17:30:12+00:00",
        "description": "Marvel's Wolverine launches in Fall 2026 for PS5, and it's more than likely to meet that release window. Obviously, Sony needs a lot more to fill its release window than just two high-profile exclusives (much as I'm looking forward to Saros). However, for the first time in a while, I forgot that we haven't heard about what teams like Bend Studio, Guerrilla Games, and Firesprite. \n\nI forgot about Sony's failed live-service push and how there are still titles like Bungie's Marathon or Haven's Fairgame$, assuming it hasn't been canned, due in the near future. Heck, I almost forgot about the previous half hour of the State of Play, which had some standout announcements but otherwise felt like your average showcase.",
        "id": 3663847,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Ywbd5seWPfs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Ywbd5seWPfs/hqdefault.jpg",
        "title": "Marvel's Wolverine is RAD, BRUTAL, And Exactly What The PS5 Needed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-25T16:42:43.276460+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-25T15:30:01+00:00",
        "description": "After a fair bit of anticipation and excitement, Ghost of Yotei is finally reaching distance on the PS5. Sucker Punch’s current-gen debut takes what worked in the original, and expands that net of ideas in a way that feels fitting for a sequel. \n\nThere are plenty of merits that we have outlined in the review, but with this video, we want to focus on how the graphics technology has evolved with this release. \n\nWe will be covering how Sucker Punch has adapted its engine to take full advantage of the PS5 and the resultant key improvements in the visual presentation alongside a detailed breakdown of individual aspects like character models, lighting, and much more.",
        "id": 3663408,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=0d3Tv5METkg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0d3Tv5METkg/hqdefault.jpg",
        "title": "Ghost of Yotei PS5 - A Masterclass In High-End Graphics Rendering?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-25T13:33:59.802151+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-25T13:01:09+00:00",
        "description": "While Ghost of Tsushima impressed with its mix of open-world stealth and stance-focused combat, Ghost of Yōtei is both a refinement and an expansion of everything that it offered. I could see complaints about the combat being more iterative than evolutionary, but this is still an extremely impressive title worth diving into, whether you're a fan of open-world games or not. \n\nAtsu's journey doesn't rewrite the rulebook on meting out vengeance so much as establish her own journey of personal growth – and the cultural brilliance and natural beauty of Ezo – and I, for one, am excited to unravel more of its mysteries and dangers.",
        "id": 3662031,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=XgyUbQh72bI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XgyUbQh72bI/hqdefault.jpg",
        "title": "Ghost of Yotei Review - Sucker Punch Has Delivered An Absolute Winner",
        "vote": 0
    }
]