[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-24T10:30:07+00:00",
        "description": "<p>Last Updated on February 24, 2025 It&#8217;s that time of year when it&#8217;s time for WorldCon members to lodge their nominations for the Hugos. Our magazine has an absolute pile of original stories eligible for the awards. If you&#8217;ve read our issues and loved them, you could find a worse small publication to throw in a nomination for. I won&#8217;t be at WorldCon Seattle this year, but I am reasonably sure Beth and a few of the team will be. Hopefully our team can say g&#8217;day at some point! Best Novel (Noting here that our nomination was a smidge over 40k words to fit into the novella category.) In the Shadow of their Dying by Anna Smith Spark and Michael R. Fletcher Best Novelette Reed Lions—A Story from the Principalities by R.R. Virdi (Grimdark Magazine Issue #38) Dead Reckoning II by Christian Cameron (Grimdark Magazine Issue #39) Best Short Story The Last War Dog by Michael R. Fletcher (Grimdark Magazine Issue #37) Zero Sum by Laurell Hightower (Grimdark Magazine ",
        "id": 2181313,
        "language": "en-AU",
        "link": "https://www.grimdarkmagazine.com/hugo-awards-eligibility",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 137,
        "source_url": "https://www.grimdarkmagazine.com/feed",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hugo awards eligibility",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-24T04:15:03+00:00",
        "description": "<p>Well, I never thought another author would actually come close to the cozy dark fairytale-esque storytelling of T. Kingfisher for me, but Molly O’Neill proved me wrong in Greenteeth. Brimming with Celtic/British legends and folklore, loveable monsters, strong found family vibes, and lots of humour and heart, this is a deeply immersive and atmospheric fairytale-esque quest adventure with sharp teeth but a soft heart. Now, I don’t know what I was expecting from Greenteeth, but it really surprised me in all the best ways. I mean, just listen to this wicked premise: a lake monster, a witch, a hobgoblin, and their trusty four-footer embark on an heroic magical quest throughout the mystical lands of Britain, Wales, Scotland, and faerie realms to defeat an ancient evil that threatens not just their home, but the very soul of Britain. It might sound like a lot, but somehow O’Neill pulls off her uniquely wild and charming vision for Greenteeth with effortless grace. From the very first pag",
        "id": 2181314,
        "language": "en-AU",
        "link": "https://www.grimdarkmagazine.com/review-greenteeth-by-molly-oneill",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 137,
        "source_url": "https://www.grimdarkmagazine.com/feed",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "REVIEW: Greenteeth by Molly O’Neill",
        "vote": 0
    }
]