[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-24T19:00:37+00:00",
        "description": "Following just one short year from the much-maligned Assassin’s Creed Unity ultimately was the undoing for Assassin’s Creed Syndicate. Whether series fatigue or a loss of faith from fans, Syndicate wore a reputation was one of the worst Assassin’s Creed games up to that point; an entry so bad it kickstarted the desire to reboot the series. \n\nLooking back to assess the game on its own, there’s evidence that Syndicate exists as an overlooked entry in the stealth action series. An exceptional Victorian London setting, excellent dual protagonists, and some of the series’ best stealth mechanics make Assassin’s Creed Syndicate a blast to play despite its featherlight melee combat.",
        "id": 2187018,
        "language": null,
        "link": "https://www.youtube.com/watch?v=obcYwwAT9t0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/obcYwwAT9t0/hqdefault.jpg",
        "title": "Looking Back, Assassin's Creed Syndicate Wasn't A Bad Game...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-24T15:00:50+00:00",
        "description": "Monster Hunter Wilds is arriving about four years after Monster Hunter Rise, but expectations are arguably much higher since it's truly following up on Monster Hunter World. The latter launched in 2018 and remains the best-selling title in the series yet. For many, it is the reason they got into Monster Hunter, so expectations are high.\n\nWhile it doesn't quite match it in several areas (not the least of which includes end-game content or challenges), Monster Hunter Wilds is still one of the most enjoyable in the series to date. Its combat, already polished to a T, feels better than ever, while twists to build-crafting inspire more creativity. The line-up of monsters is strong and offers up some fun battles.\n\nThen there are the numerous quality of life changes and improvements to go with new features like dynamic weather. Even if it may initially whelm long-time fans expecting the next big leap after World, Monster Hunter Wilds remains an engrossing good time.",
        "id": 2184622,
        "language": null,
        "link": "https://www.youtube.com/watch?v=_GqlkgPz4fo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_GqlkgPz4fo/hqdefault.jpg",
        "title": "Monster Hunter Wilds Review - A Great Game For Fans But With Some Noticeable Flaws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-24T10:00:39+00:00",
        "description": "Another year, another round of sports games from EA and 2K. Wrestling fans have been eating good over the last couple years with the WWE 2K series continuing on an upward trajectory. \n\nLast year’s installment iterated on the overhaul from 2021 and has been generally accepted for its quality. This year, the 2K team is adding an ambitious new hub filled to the brim with activities and fun gimmicks. \n\nBut the new Island mode isn’t the only interesting addition. Here are 15 notable things that players should know about WWE 2K25.",
        "id": 2182334,
        "language": null,
        "link": "https://www.youtube.com/watch?v=dpbx9vm1zCo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dpbx9vm1zCo/hqdefault.jpg",
        "title": "WWE 2K25 - 15 Things YOU NEED TO KNOW Before You Buy",
        "vote": 0
    }
]