[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T18:30:48+00:00",
        "description": "Nexon's The First Berserker: Khazan launches on March 27th for Xbox Series X/S, PS5, and PC, but advanced access goes live on March 24th for Deluxe Edition owners. Though several elements will look familiar to fans of titles like Nioh, Dark Souls and Sekiro: Shadows Die Twice, it does have some quirks of its own.\n\nThere's much to uncover, whether it's Phantom Form and its relatively underpowered nature at the start (and how to leverage that), the different weapon choices, or potent skills. We'll even outline the best time to start crafting, why you shouldn't underestimate throwable items, and - perhaps most importantly - the best ways to clear out those harmful status effects without requiring one of each Cleansing Potion.\n\nYou can even learn about some of the best gear perks to prioritize. Without further ado, check out 15 tips and tricks for The First Berserker: Khazan to help you get ahead.",
        "id": 2397702,
        "language": null,
        "link": "https://www.youtube.com/watch?v=pv9FDHbz_OY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pv9FDHbz_OY/hqdefault.jpg",
        "title": "15 Things I Wish I Knew Before Playing The First Berserker Khazan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T15:01:08+00:00",
        "description": "Souls-likes may be one of the most popular contemporary genres, with several developers attempting to put their own spin on the action RPG formula. Enter The First Berserker: Khazan, out on March 27th and an attempt by Neople and Nexon to tell the story of the former legendary general with ample twists.\n\nThe dark nature of Khazan's torment and exile leading to his revenge should make for a compelling story, especially with talent like Ben Starr voicing the character. Unfortunately, The First Berserker doesn't deliver on that front nor offer much character development, opting for a more traditional fantasy adventure.\n\nThe mission-based structure won't set your world on fire despite the overall solid level design. Combat is notable, especially with the different weapon options and abilities. Khazan encounters some memorable bosses and enemies, so those who appreciate an ample challenge will find plenty to like.",
        "id": 2395292,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oxrtUOISx9Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oxrtUOISx9Q/hqdefault.jpg",
        "title": "The First Berserker Khazan Review - Left Wanting For More",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T09:30:09+00:00",
        "description": "The Last of Us’ debut on PC did not necessarily go the way Naughty Dog or Sony would have wanted, with a shockingly disastrous launch for The Last of Us Part 1 on the platform, though excitement is nonetheless high for The Last of Us Part 2 Remastered to make its way over to PC. \n\nIt helps, of course, that the game itself is an unabashed masterpiece of stealth, horror, and storytelling, while the upcoming Season 2 premiere for the acclaimed HBO adaptation is also adding to the hype. Ahead of the game’s imminent PC release, Naughty Dog, along with Iron Galaxy Studios and Nixxes Software – both of whom are providing development support for the upcoming port – recently released new details on what players can expect from the game’s newest release. \n\nDetails have as such emerged on The Last of Us Part 2 Remastered’s PC-specific features, the tech it will boast under the hood, the new content it will bring to the table, and more. Here, we’re going to go over all of that and more.",
        "id": 2392797,
        "language": null,
        "link": "https://www.youtube.com/watch?v=OiVIh_e6Vb4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OiVIh_e6Vb4/hqdefault.jpg",
        "title": "The Last of Us Part 2 Remastered PC - 10 Things You ABSOLUTELY NEED TO KNOW Before You Buy",
        "vote": 0
    }
]