[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T23:05:38+00:00",
        "description": "Biogazownie, czyli instalacje, w których odbywa się proces fermentacji substancji organicznych, prowadzący do powstania biogazu, powinny znaleźć się niemal w każdej polskiej gminie. Zapewniają czystą, ekologiczną i dostępną niezależnie od warunków pogodowych energię dla lokalnej społeczności, zmniejszają ilość składowanych odpadów, produkują nawozy organiczne, ograniczają emisje gazów cieplarnianych do atmosfery,  przyczyniają się do tworzenia nowych miejsc pracy, a także stanowią dodatkowe źródło przychodów dla gminy. A to tylko część korzyści, jakie biogazownie przynoszą gminom i ich mieszkańcom. Niezbędna jest jednak informacja, dialog i edukacja oraz współpraca inwestorów, samorządu i wszystkich zainteresowanych stron, aby rozwiewać obawy i mity związane z budową i eksploatacją biogazowni w Polsce bo korzyści dla lokalnej społeczności mogą być znaczne.",
        "id": 2398807,
        "language": "pl-PL",
        "link": "https://regiony.rp.pl/z-regionow/art41952941-dlaczego-warto-miec-biogazownie-w-gminie",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 272,
        "source_url": "https://regiony.rp.pl/rss/1441-regiony",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dlaczego warto mieć biogazownię w gminie",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T10:48:02+00:00",
        "description": "- Gdybyśmy chcieli być przyłączeni do jakiejś większej gminy, czy to Supraśla, czy Białegostoku, to pewnie nie podjęlibyśmy działań podziałowych. Mieszkańcy absolutnie nie chcą być przyłączeni do większego miasta – zapewnia Katarzyna Todorczuk, wójt gminy Grabówka na Podlasiu. Todorczuk przez 20 lat walczyła o utworzenie gminy. 16 marca wygrała przedterminowe wybory, pierwsze w nowo utworzonej jednostce samorządu. Uzyskała 53,5 proc. głosów. W sobotę złożyła ślubowanie, a od poniedziałku rozpoczyna swoje urzędowanie.",
        "id": 2393062,
        "language": "pl-PL",
        "link": "https://regiony.rp.pl/okiem-samorzadowca/art41997321-wojt-grabowki-rozwod-nie-byl-przyjemny-dla-suprasla-ale-trzeba-sie-dogadac",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 272,
        "source_url": "https://regiony.rp.pl/rss/1441-regiony",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wójt Grabówki: Rozwód nie był przyjemny dla Supraśla, ale trzeba się dogadać",
        "vote": 0
    }
]