[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T23:16:03+00:00",
        "description": "An anonymous reader shares a Bloomberg column: Worries over China's \"3D\" problem -- that deflation, debt and demographics are structurally hampering growth -- are melting away. Instead, investors are talking about how the world's second-largest economy can take on the US and challenge its technological dominance. There is the prevailing sense that China's \"engineer dividend\" is finally paying off. Between 2000 and 2020, the number of engineers has ballooned from 5.2 million to 17.7 million, according to the State Council. That reservoir can help the nation move up the production possibility frontier, the thinking goes. \n\nIn a way, DeepSeek shouldn't have come as a surprise. Size matters. A bigger talent pool alone gives China a better chance to disrupt. In 2022, 47% of the world's top 20th percentile AI researchers finished their undergraduate studies in China, well above the 18% share from the US, according to data from the Paulson Institute's in-house think tank, MacroPolo. Last ye",
        "id": 2398956,
        "language": null,
        "link": "https://slashdot.org/story/25/03/24/2027250/chinas-engineer-dividend-is-paying-off-big-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'China's Engineer Dividend Is Paying Off Big Time'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T23:16:03+00:00",
        "description": "Microsoft is expanding its Security Copilot platform with six new AI agents designed to autonomously assist cybersecurity teams by handling tasks like phishing alerts, data loss incidents, and vulnerability monitoring. There are also five third-party AI agents created by its partners, including OneTrust and Tanium. The Verge reports: Microsoft's six security agents will be available in preview next month, and are designed to do things like triage and process phishing and data loss alerts, prioritize critical incidents, and monitor for vulnerabilities. \"The six Microsoft Security Copilot agents enable teams to autonomously handle high-volume security and IT tasks while seamlessly integrating with Microsoft Security solutions,\" says Vasu Jakkal, corporate vice president of Microsoft Security.\n \nMicrosoft is also working with OneTrust, Aviatrix, BlueVoyant, Tanium, and Fletch to enable some third-party security agents. These extensions will make it easier to analyze data breaches with O",
        "id": 2398955,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/24/2035256/microsoft-announces-security-ai-agents-to-help-overwhelmed-humans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Announces Security AI Agents To Help Overwhelmed Humans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T22:10:19+00:00",
        "description": "FaunaDB, a serverless database combining relational and document features, will shut down by the end of May due to unsustainable capital demands. The company plans to open source its core technology, including its FQL query language, in hopes of continuing its legacy within the developer community. The Register reports: The startup pocketed $27 million in VC funding in 2020 and boasted that 25,000 developers worldwide were using its serverless database. However, last week, FaunaDB announced that it would sunset its database services. FaunaDB said it plans to release an open-source version of its core database technology. The system stores data in JSON documents but retains relational features like consistency, support for joins and foreign keys, and full schema enforcement. Fauna's query language, FQL, will also be made available to the open-source community. \"Driving broad based adoption of a new operational database that runs as a service globally is very capital intensive. In the ",
        "id": 2398627,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/24/2027215/faunadb-shuts-down-but-hints-at-open-source-future?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FaunaDB Shuts Down But Hints At Open Source Future",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T21:05:26+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: 23andMe filed for Chapter 11 bankruptcy Sunday, leaving the fate of millions of people's genetic information up in the air as the company deals with the legal and financial fallout of not properly protecting that genetic information in the first place. The filing shows how dangerous it is to provide your DNA directly to a large, for-profit commercial genetic database; 23andMe is now looking for a buyer to pull it out of bankruptcy. 23andMe said in court documents viewed by 404 Media that since hackers obtained personal data about seven million of its customers in October 2023, including, in some cases \"health-related information based upon the user's genetics,\" it has faced \"over 50 class action and state court lawsuits,\" and that \"approximately 35,000 claimants have initiated, filed, or threatened to commence arbitration claims against the company.\" It is seeking bankruptcy protection in part to simplify the fallout of these legal ",
        "id": 2398203,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/24/2022232/dna-of-15-million-people-for-sale-in-23andme-bankruptcy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DNA of 15 Million People For Sale In 23andMe Bankruptcy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T21:05:26+00:00",
        "description": "CERN faces a pivotal decision about its future as the Large Hadron Collider approaches the end of its usefulness by the early 2040s. Management proposes building the Future Circular Collider (FCC), a machine with a 90-kilometer circumference that would smash particles at eight times the energy of the LHC. This hugely consequential plan faces significant challenges. Much of the required technology doesn't exist yet, including superconducting magnets strong enough to bend high-energy particle beams. \n\nThe project also lacks the clear rationale that the LHC had in finding the Higgs boson. The proposal has divided physicists. Critics worry about the decades-long timeline, potential cost overruns, and the risk of sacrificing other valuable CERN activities. Germany, which provides 20% of the lab's budget, has already indicated it won't increase contributions. A council-appointed group is now gathering input from the physics community before making recommendations in December. \n\nNature's ed",
        "id": 2398204,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/24/206247/what-cern-does-next-matters-for-science-and-for-international-cooperation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'What CERN Does Next Matters For Science and For International Cooperation'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T20:01:13+00:00",
        "description": "Valve's early anti-piracy efforts, which eventually led to the Steam platform, were sparked by co-founder Monica Harrington's nephew using her money to buy a CD burner for copying games, she revealed at last week's Game Developers Conference. Harrington said her nephew's \"lovely thank you note\" about sharing games with friends represented a \"generational shift\" in piracy attitudes that could \"put our entire business model at risk.\" \n\nHalf-Life subsequently launched with CD key verification in 1998. When players complained about authentication failures, co-founder Mike Harrington discovered \"none of them had actually bought the game,\" confirming the system worked. Although easily bypassed, this early protection influenced Steam's more robust DRM implemented with Half-Life 2 in 2004, which became the industry standard for PC game distribution.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=How+a+Nephew's+CD+Burner+In",
        "id": 2397664,
        "language": null,
        "link": "https://slashdot.org/story/25/03/24/1939209/how-a-nephews-cd-burner-inspired-early-valve-to-embrace-drm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How a Nephew's CD Burner Inspired Early Valve To Embrace DRM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T20:01:13+00:00",
        "description": "Scientists are developing biomarkers to objectively measure pain, addressing a fundamental medical challenge that has contributed to the opioid crisis and led to consistent underestimation of pain in women and minorities. \n\nFour research teams funded by the Department of Health and Human Services are developing technologies to quantify pain like other vital signs. Their approaches include a blood test for endometriosis pain, a device measuring nerve response through pupil dilation, microneedle patches sampling interstitial fluid, and a wearable sensor detecting pain markers in sweat. \n\n\"When patients are told that the pain is all in their head, the implication is that it's imagined, but the irony is that's sort of right,\" said Adam Kepecs, a neuroscience professor at Washington University. \"The pain only exists in your brain. It's neural activity, which is why it's invisible and uniquely personal. But it's still real.\" These innovations could transform treatment for the nearly 25% of",
        "id": 2397665,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/24/194257/researchers-search-for-more-precise-ways-to-measure-pain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Search For More Precise Ways To Measure Pain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T18:35:23+00:00",
        "description": "Google has confirmed that a technical issue has permanently deleted location history data for numerous users of its Maps application, with no recovery possible for most affected customers. The problem emerged after Google transitioned its Timeline feature from cloud to on-device storage in 2024 to enhance privacy protections. Users began reporting missing historical location data on support forums and social media platforms in recent weeks. \"This is the result of a technical issue and not user error or an intentional change,\" said a Google spokesperson. Only users who manually enabled encrypted cloud backups before the incident can recover their data, according to Google. The company began shifting location storage policies in 2023, initially stopping collection of sensitive location data including visits to abortion clinics and domestic violence shelters.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Says+",
        "id": 2397009,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/24/1749248/google-says-it-might-have-deleted-your-maps-timeline-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Says It Might Have Deleted Your Maps Timeline Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T18:35:23+00:00",
        "description": "The Pentagon has canceled its troubled Defense Civilian Human Resources Management System after years of delays and budget overruns, Defense Secretary Pete Hegseth said. The project, launched in 2018 with a one-year timeline and $36 million budget, ultimately ran eight years and exceeded costs by $280 million, reaching 780% over budget. \"We're not doing that anymore,\" Hegseth said in a video announcing the cancellation. Officials have 60 days to develop a new plan to modernize DoD's civilian HR systems. The cuts are part of a broader $580 million spending reduction that includes $360 million in diversity, climate change and COVID-19 grant programs, plus $30 million in consulting contracts with Gartner and McKinsey.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Pentagon+Axes+HR+System+After+780%25+Budget+Overrun%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F03%2F24%2F1822226%2F%3Futm_source%3Dtwitter%26utm_medi",
        "id": 2397008,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/24/1822226/pentagon-axes-hr-system-after-780-budget-overrun?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pentagon Axes HR System After 780% Budget Overrun",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T17:30:58+00:00",
        "description": "schwit1 writes: A compact, deep-sea, cable-cutting device, capable of severing the world's most fortified underwater communication or power lines, has been unveiled by China -- and it could shake up global maritime power dynamics.\n\n The revelation marks the first time any country has officially disclosed that it has such an asset, capable of disrupting critical undersea networks. The tool, which is able to cut lines at depths of up to 4,000 metres (13,123 feet) -- twice the maximum operational range of existing subsea communication infrastructure -- has been designed specifically for integration with China's advanced crewed and uncrewed submersibles like the Fendouzhe, or Striver, and the Haidou series.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Unveils+a+Powerful+Deep-sea+Cable+Cutter+That+Could+Reset+the+World+Order%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F24%2F1645202%2F%3Futm_source%3Dtw",
        "id": 2396515,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/24/1645202/china-unveils-a-powerful-deep-sea-cable-cutter-that-could-reset-the-world-order?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Unveils a Powerful Deep-sea Cable Cutter That Could Reset the World Order",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T16:26:35+00:00",
        "description": "Countries must develop their own artificial intelligence infrastructure or risk significant economic losses as the technology transforms global economies, Mistral CEO Arthur Mensch said last week. \n\n\"It will have an impact on GDP of every country in the double digits in the coming years,\" Mensch told the A16z podcast, warning that nations without domestic AI systems would see capital flow elsewhere. The French startup executive compared AI to electricity adoption a century ago. \"If you weren't building electricity factories, you were preparing yourself to buy it from your neighbors, which creates dependencies,\" he said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Will+Impact+GDP+of+Every+Country+By+Double+Digits%2C+Says+Mistral+CEO%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F24%2F1527230%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a cla",
        "id": 2395837,
        "language": null,
        "link": "https://slashdot.org/story/25/03/24/1527230/ai-will-impact-gdp-of-every-country-by-double-digits-says-mistral-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Will Impact GDP of Every Country By Double Digits, Says Mistral CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T16:26:35+00:00",
        "description": "China's Cyberspace Administration and Ministry of Public Security have outlawed the use of facial recognition without consent. From a report: The two orgs last Friday published new rules on facial recognition and an explainer that spell out how orgs that want to use facial recognition must first conduct a \"personal information protection impact assessment\" that considers whether using the tech is necessary, impacts on individuals' privacy, and risks of data leakage. Organizations that decide to use facial recognition must data encrypt biometric data, and audit the information security techniques and practices they use to protect facial scans. Chinese that go through that process and decide they want to use facial recognition can only do so after securing individuals' consent. The rules also ban the use of facial recognition equipment in public places such as hotel rooms, public bathrooms, public dressing rooms, and public toilets. The measures don't apply to researchers or to what ma",
        "id": 2395836,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/24/1616232/china-bans-compulsory-facial-recognition-and-its-use-in-private-spaces-like-hotel-rooms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Bans Compulsory Facial Recognition and Its Use in Private Spaces Like Hotel Rooms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T15:20:18+00:00",
        "description": "prisoninmate shares a report: Highlights of Linux 6.14 include Btrfs RAID1 read balancing support, a new ntsync subsystem for Win NT synchronization primitives to boost game emulation with Wine, uncached buffered I/O support, and a new accelerator driver for the AMD XDNA Ryzen AI NPUs (Neural Processing Units). \n\nAlso new is DRM panic support for the AMDGPU driver, reflink and reverse-mapping support for the XFS real-time device, Intel Clearwater Forest server support, support for SELinux extended permissions, FUSE support for io_uring, a new fsnotify file pre-access event type, and a new cgroup controller for device memory.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Linux+Kernel+6.14+Officially+Released%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F03%2F24%2F1448217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http",
        "id": 2395256,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/03/24/1448217/linux-kernel-614-officially-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linux Kernel 6.14 Officially Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T14:15:52+00:00",
        "description": "DNA-testing company 23andMe has filed for Chapter 11 bankruptcy protection [non-paywalled source] in Missouri and announced CEO Anne Wojcicki's immediate resignation, weeks after rejecting her proposal to buy back the business she co-founded. The bankruptcy filing represents \"the best path forward to maximize the value of the business,\" said Mark Jensen, board member and special committee chair.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=DNA-Testing+Firm+23andMe+Files+for+Bankruptcy%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F24%2F0517231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F24%2F0517231%2Fdna-testing-firm-23andme-files-for-bankruptcy%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_i",
        "id": 2394691,
        "language": null,
        "link": "https://slashdot.org/story/25/03/24/0517231/dna-testing-firm-23andme-files-for-bankruptcy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DNA-Testing Firm 23andMe Files for Bankruptcy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T12:05:20+00:00",
        "description": "It's \"live-recording the World Wide Web,\" according to NPR, with a digital library that includes \"hundreds of billions of copies of government websites, news articles and data.\" \n\nThey described the 29-year-old nonprofit Internet Archive as \"more relevant than ever.\"\n\n\n\nEvery day, about 100 terabytes of material are uploaded to the Internet Archive, or about a billion URLs, with the assistance of automated crawlers. Most of that ends up in the Wayback Machine, while the rest is digitized analog media &mdash; books, television, radio, academic papers &mdash; scanned and stored on servers. As one of the few large-scale archivists to back up the web, the Internet Archive finds itself in a particularly unique position right now... Thousands of [U.S. government] datasets were wiped &mdash; mostly at agencies focused on science and the environment &mdash; in the days following Trump's return to the White House... \nThe Internet Archive is among the few efforts that exist to catch the stuff ",
        "id": 2393701,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/23/1742225/why-the-internet-archive-is-more-relevant-than-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why the Internet Archive is More Relevant Than Ever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T07:44:48+00:00",
        "description": "RockDoctor (Slashdot reader #15,477) writes:\n\nA recent paper on ArXiv reports a novel idea about the central regions of \"our\" galaxy.\n\n\n Remember the hoopla a few years ago about radio-astronomical observations producing an \"image\" of our central black hole &mdash; or rather, an image of the accretion disc around the black hole &mdash; long designated by astronomers as \"Sagittarius A*\" (or SGR-A*)? If you remember the image published then, one thing should be striking &mdash; it's not very symmetrical. If you think about viewing a spinning object, then you'd expect to see something with a \"mirror\" symmetry plane where we would see the rotation axis (if someone had marked it). If anything, that published image has three bright spots on a fainter ring. And the spots are not even approximately the same brightness.\n\n This paper suggests that the image we see is the result of the light (radio waves) from SGR-A* being \"lensed\" by another black hole, near (but not quite on) the line of sigh",
        "id": 2392259,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/23/2227207/another-large-black-hole-in-our-galaxy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Another Large Black Hole In 'Our' Galaxy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T04:30:10+00:00",
        "description": "Long-time Slashdot reader invisik reminds us that the \"fish doorbell\" is still going strong, according to the Associated Press.\n\n\"Now in its fifth year, the site has attracted millions of viewers from around the world with its quirky mix of slow TV and ecological activism.\"\n\nThe central Dutch city of Utrecht installed a \"fish doorbell\" on a river lock that lets viewers of an online livestream alert authorities to fish being held up as they make their springtime migration to shallow spawning grounds. The idea is simple: An underwater camera at Utrecht's Weerdsluis lock sends live footage to a website. When somebody watching the site sees a fish, they can click a button that sends a screenshot to organizers. When they see enough fish, they alert a water worker who opens the lock to let the fish swim through.\n \n\"Much of the time, the screen is just a murky green with occasional bubbles, but sometimes a fish swims past. As the water warms up, more fish show up...\"<p><div class=\"share_sub",
        "id": 2391578,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/23/1958239/fish-doorbell-enters-fifth-year-with-millions-of-fans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Fish Doorbell' Enters Fifth Year with Millions of Fans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-24T02:20:36+00:00",
        "description": "NPR reports on research \"into whether our defenses built up from past flu seasons can offer any protection against H5N1 bird flu.\"\n\nSo far, the findings offer some reassurance. Antibodies and other players in the immune system may buffer the worst consequences of bird flu, at least to some degree. \"There's certainly preexisting immunity,\" says Florian Krammer, a virologist at Mount Sinai's Icahn School of Medicine who is involved in some of the new studies. \"That's very likely not going to protect us as a population from a new pandemic, but it might give us some protection against severe disease.\" This protection is based on shared traits between bird flu and types of seasonal flu that have circulated among us. Certain segments of the population, namely older people, may be particularly well-primed because of flu infections during early childhood. \n\nOf course, there are caveats. \"While this is a bit of a silver lining, it doesn't mean we should all feel safe,\" says Seema Lakdawala, a",
        "id": 2391225,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/23/2215232/if-bird-flu-jumped-to-humans-could-past-flu-infections-offer-some-protection?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "If Bird Flu Jumped to Humans, Could Past Flu Infections Offer Some Protection?",
        "vote": 0
    }
]