[
    {
        "age": null,
        "album": "",
        "author": "FRONTLINE PBS | Official",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T00:28:46.357124+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T00:00:23+00:00",
        "description": "Did Texas execute an innocent man? This 2010 documentary investigates the controversial death penalty case of Cameron Todd Willingham — and the scientific validity of the arson evidence used to convict him of the deaths of his three children. \n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate\n\nThe execution of Cameron Todd Willingham in Texas in 2004 became the center of a national debate about the death penalty and the science behind arson investigations.\n\nDrawing on unique access to those closest to the Willingham case, “Death by Fire” meticulously examines the evidence used to convict Willingham, and explores the implications of the execution of a possibly innocent man.\n\nThrough interviews with Willingham’s friends and family, the documentary tells the story of a troubled young man with a history of domestic violence who quickly became the prime suspect in his children’s deaths. The discovery by fire investigators",
        "id": 4104880,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=LzJS7VRQ30k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 109,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LzJS7VRQ30k/hqdefault.jpg",
        "title": "How an Execution in Texas Sparked a National Debate | Death by Fire (full documentary) | FRONTLINE",
        "vote": 0
    }
]