[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:40.089455+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T18:00:01+00:00",
        "description": "#shorts #tedx #ted #business #personalgrowth #career #jobs #selfimprovement #hiring #interviews #tips",
        "id": 4111782,
        "language": "en",
        "link": "https://www.youtube.com/shorts/-OiCXpYQIWI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-OiCXpYQIWI/hqdefault.jpg",
        "title": "How to introduce yourself—and get hired #shorts #tedx",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:40.350278+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:58:11+00:00",
        "description": "Did you know one of literature's greatest successes originated as one of literature's biggest failures? Lawrence Connolly, the creator of a celebrated adaptation of Frankenstein in Pittsburgh, PA, explores the remarkable resilience of Mary Shelley in the face of adversity. In his talk, he delves into how Shelley’s groundbreaking novel initially floundered upon its release, largely due to her defiance of literary conventions, personal struggles within her family, and other challenges. Through her story, Connolly highlights the powerful lessons of perseverance and the courage to push through failure in pursuit of greatness. Lawrence C. Connolly’s books include the Veins Cycle novels and his collections include Visions, This Way to Egress, and Voices, which feature his stories from Amazing Stories, Cemetery Dance, The Magazine of Fantasy & Science Fiction, Twilight Zone, Year’s Best Horror, and other top magazines and anthologies of fantasy, horror, and science fiction.\n\nVoices was nomin",
        "id": 4111783,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UGoIuEFCyQg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UGoIuEFCyQg/hqdefault.jpg",
        "title": "Frankenstein’s legacy: Mary Shelley's resilience | Lawrence Connolly | TEDxSewickley Academy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:40.538647+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:54:41+00:00",
        "description": "The personal toll climate change takes on our minds, bodies, and emotions is often overlooked in the search for climate solutions. This powerful talk from a trauma therapist explores how air pollution, wildfire smoke, drought, and rising temperatures trigger anxiety, exhaustion, and climate grief that many mistake for personal failure rather than a natural response to environmental loss. Through compassionate, grounded solutions for regulating our bodies, we're reminded that there are many ways to care for ourselves in response to a world in crisis.  Born in Malaysia and forged through childhood trauma, Cindy Chia rose to international acclaim as a healer of hearts and minds. Founder of Aspire Psychological and featured by Forbes Council and Utah Business, she transforms pain into purpose, breaking cultural silence around mental health. Amid a changing climate, she helps patients face the grief of a warming world, showing that even in loss, resilience and hope can take root. This talk",
        "id": 4111784,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vt2CHR-CId4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vt2CHR-CId4/hqdefault.jpg",
        "title": "Giving validation and language to climate grief | Cindy Chia | TEDxSaltLakeCity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:40.715387+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:39:30+00:00",
        "description": "What is our modern Ithaca, the destination that gives meaning to our journey in a rapidly changing world? Tilemachos explores how uncertainty, disruption, and complexity invite us to redefine purpose itself. Drawing from his global career and personal path, he argues that today’s Ithaca is not a place, but a mindset: a commitment to values, responsibility, and inner direction. This talk invites audiences to rethink success, embrace transformation, and chart a more human, intentional path forward. Born in Thiva near Athens, Tilemachos studied International Relations, HR, and Strategic Management. After a global marketing career at Canon, culminating as CEE Marketing Director in Vienna, he founded Admine, a multi-awarded ad agency. In 2025, with IDNTT (CH), he launched Europe’s first ESG Comms Agency across ITA–GR–CH, now active in 10 countries. He’s a proud father of two daughters, Sonia (14) and Corina (12), and still loves basketball. This talk was given at a TEDx event using the TED",
        "id": 4111785,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=diGQhtIJnDg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/diGQhtIJnDg/hqdefault.jpg",
        "title": "In search of the new Ithaca | Tilemachos Mavrakis | TEDxFiesole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:40.885711+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:39:12+00:00",
        "description": "Coach Jim Stroker shares how the formula E+R=O—Event + Response = Outcome can transform adversity into strength. Drawing from a lifetime of turning personal tragedy into triumph, he reveals how “Amor Fati,” the love of one’s fate, becomes a powerful path to resilience. His message inspires leaders, students, military communities, and people from all walks of life to reclaim their response and reshape their destiny. Coach Jim Stroker is an acclaimed inspirational speaker, transformational life coach and leadership trainer. Stroker is a New Jersey Coaches Hall Of Fame inductee and recipient of the Ridgewood High School Distinguished Alumni Award, with decades of real-world experience turning tragedy into triumph. He continues to inspire Fortune 500 companies, students, Military personnel, Native American communities, and incarnated individuals, offering messages of hope and transformation. This talk was given at a TEDx event using the TED conference format but independently organized by",
        "id": 4111786,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Kzx7aBTRpok",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Kzx7aBTRpok/hqdefault.jpg",
        "title": "Amor Fati: E+R=O | James Stroker | TEDxFiesole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:41.084013+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:38:16+00:00",
        "description": "Neuroscientist and inventor Dr. Steffie Tomson uncovers how what we wear shapes how we think. Challenging assumptions about women’s professional attire, she reveals how sensory distractions in clothing can quietly drain focus and cognitive performance. Her talk invites us to rethink our closets, and redesign environments where style and mental clarity work together. Neuroscientist and inventor Dr. Steffie Tomson takes a bold, neuroscience-driven look at how everyday wardrobe choices pull our cognitive resources in unexpected directions. Dr. Tomson challenges conventional norms about women’s professional attire and reveals how sensory distractions can be a hidden drain on success. Follow our disruptive conversation about reclaiming control over our closets—and our minds—for a future where style and focus move in the same direction. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4111788,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DZSOgtA4oO4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DZSOgtA4oO4/hqdefault.jpg",
        "title": "How your clothes could be distracting you at work | Dr Steffie Tomson | TEDxFiesole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:41.289588+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:38:03+00:00",
        "description": "Giovanni Gambardella explores how true leadership begins by energizing the whole self—mind, body, and heart. Drawing on 15 years of experiential training with over 75,000 participants, he shows how mindful presence, authentic communication, and collaborative dynamics can transform teams from the inside out. His talk reveals a practical path toward sustainable success rooted not in pressure, but in awareness, connection, and human-centered leadership. Born in Naples and graduated in Business Administration from Bocconi University in Milan, Giovanni Gambardella began his professional journey at Hewlett Packard. After three years in the corporate world, he chose to dedicate himself to personal growth and development, becoming a Master Trainer in Neuro-Linguistic Programming.\nDriven by the desire to bring greater awareness, well-being, and authenticity into organizations, he founded Teamworking, a company specializing in experiential training. Its mission is clear: to help individuals and",
        "id": 4111789,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OSz_4_XHRMA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OSz_4_XHRMA/hqdefault.jpg",
        "title": "Energizing leadership: Success through mind, body, and heart | Giovanni Gambardella | TEDxFiesole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:41.507948+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:37:50+00:00",
        "description": "Agata Pawlik explores the art and impact of bringing people together, across cultures, sectors, and agendas. Drawing on two decades of global experience, including leading the UN’s Connect Conference Centre at COP28, she reveals how intentional spaces can turn dialogue into action and collective energy into change. Agata Pawlik is a passionate International Conference Director who brings over 20 years experience gathered in different multicultural environments. She started her career with Informa in Germany and UAE and last major venture was leading for United Nations the 'Connect Conference Centre' at the Climate Conference COP28 in Dubai. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4111790,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZHkKvWoo6qI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZHkKvWoo6qI/hqdefault.jpg",
        "title": "Convening power | Agata Pawlik | TEDxFiesole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:41.820698+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:37:30+00:00",
        "description": "One of the most powerful forces in the search for climate solutions is one we already have: women’s leadership. From Nepal’s rebounding forests to U.S. clean-energy progress, women are driving climate action that protects families, restores ecosystems, and strengthens economies. This talk reveals why elevating a different kind of AI—one that's rooted in care, courage, and next-generation thinking—may be the key to solving this crisis.   Caroline Gleich is a professional ski mountaineer, endurance athlete, and environmental activist. A passionate advocate for public lands, climate action, and democracy, she’s summited Everest, skied first descents across the world, and testified before Congress to protect wild places. A former U.S. Senate candidate, Caroline now works to inspire civic engagement, environmental stewardship, and bold leadership. She believes in the power of storytelling, adventure, and community to create a more just and equitable future. This talk was given at a TEDx ev",
        "id": 4111791,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PyqRdYZwGuo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PyqRdYZwGuo/hqdefault.jpg",
        "title": "Why the climate crisis needs women in charge | Caroline Gleich | TEDxSaltLakeCity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:42.160638+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:37:17+00:00",
        "description": "An unseen effect of climate change is just beneath our feet in the form of freshwater reserves, but they are currently in danger. This talk highlights the importance of groundwater and how emerging tools—from satellites to groundwater “MRIs”—can turn complex data into collective action. When we make the unseen visible, we empower communities to protect the water that sustains our future.   Lauren Mason Carris is an AI strategist and tech-for-good leader based in Salt Lake City. She partners with executives and fast-moving teams to turn bold ideas into real-world impact. Lauren believes the most valuable solutions come from aligning innovation with intention, empathy, and human-centred design. With a passion for emerging talent and purpose-driven tech, she champions the idea that the tools to solve humanity’s greatest challenges already exist—often, right in our own backyard. This talk was given at a TEDx event using the TED conference format but independently organized by a local comm",
        "id": 4111792,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=dZ--Lx12jXk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dZ--Lx12jXk/hqdefault.jpg",
        "title": "A call for technology to guard groundwater | Lauren Mason Carris | TEDxSaltLakeCity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:42.487623+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:36:41+00:00",
        "description": "In this TEDx Talk titled “Epilepsy Isn’t Just Medical: Shifting the Lens to Whole-Person Advocacy,” Schwanna challenges the narrow, symptom-focused way society understands epilepsy. While most people see the condition through the lens of seizures alone, she reveals a deeper truth: the hardest part of epilepsy isn’t always the seizure itself—it’s everything that happens in between.\nDrawing from her personal awakening and lived experience, Schwanna offers an intimate look at the unseen struggles, emotional weight, and daily complexities that shape life with epilepsy. She sheds light on the hidden caregivers—the families, partners, friends, and supporters who carry silent responsibilities—and invites audiences to expand their empathy far beyond what is medically visible.\nThrough honest storytelling and powerful insight, she urges a shift from treating epilepsy as a purely neurological condition to recognizing it as a whole-person journey that touches identity, independence, relationships",
        "id": 4111793,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=M5QMS9z_YsA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/M5QMS9z_YsA/hqdefault.jpg",
        "title": "Why we should change the way we talk about epilepsy | Schwanna Jenkins | TEDxMallard Creek",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:42.829237+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:35:48+00:00",
        "description": "Jemma Martin shares her powerful lived experience of surviving Hyperemesis Gravidarum (HG) - a debilitating pregnancy condition characterised by severe nausea and/or vomitting which can hugely impact on maternal mental health. This condition is misunderstood, minimised and misdiagnosed. As a midiwfe and black woman, her journey exposes how racial bias and gaps in maternal healthcare silence women's suffering even in medical systems designed to protect them. Jemma calls for urgent awareness, compassionate diagnosis, and systemic change, reminding us that listeninng to women's voices is not only an act of care, but necessary to save lives. Jemma is the founder of The HG Midwife and Bumps & Bubbles CIC, a proud mum of three, and an award-winning midwife with more than 12 years of experience. Her mission was shaped 21 years ago, when she experienced Hyperemesis Gravidarum (HG)—a condition that turned what should have been a joyful pregnancy into one of the most frightening times of her li",
        "id": 4111794,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8V6GZ06SO7k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8V6GZ06SO7k/hqdefault.jpg",
        "title": "A call for better hyperemesis gravidarum care | Jemma Martin | TEDxNHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:43.175858+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:34:08+00:00",
        "description": "Masarrat A. Shah’s talk unfolds like a reflective journey, using the metaphor of a mountain to explore the boundaries we place on ourselves. He challenges the traditional idea of limits, suggesting they are not fixed walls but subtle invitations urging us to grow beyond our comfort. Throughout his narrative, he highlights how fear, doubt, and inherited beliefs quietly shape these boundaries—until we choose to question them.\n\nHis climb to the summit of Mount Toubkal, the highest peak in North Africa, becomes the emotional centre of the talk. The harsh cold, the long ascent, and the thin air reveal a deeper terrain: the inner landscape where resilience is tested and self-belief is rebuilt. For him, the mountain was never just a physical challenge; it was a place where he confronted his own hesitations and rediscovered his capacity to rise.\n\nMasarrat emphasises that courage is rarely dramatic. It appears in small, deliberate steps taken despite the presence of fear. He frames personal gr",
        "id": 4111795,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pVzYufpnGbE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pVzYufpnGbE/hqdefault.jpg",
        "title": "Redefining Limits — The Courage to Rise Beyond | Masarrat A Shah | TEDxMisrod",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:43.414584+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:33:47+00:00",
        "description": "Content Creator Samuel Christ discusses how to build impactful innovation by leveraging social media in the age of the \"Attention Economy.\" He shares his personal journey, emphasizing that success does not require money, but the courage to \"Start Today\" and the discipline to \"Believe in Yourself.\" By finding your purpose and utilizing platforms to gain attention, you unlock opportunities far beyond conventional thinking, transforming what seems impossible into a reality. Content creator with over 7 million followers across YouTube, Instagram, and TikTok, reaching 150+ million monthly views. #1 Trending YouTuber and TikTok’s Most Favorite Education Creator (H1 2022), with 7+ years of experience producing content on business, investment, motivation, and self-development. Host of The Samuel Christ Show podcast on YouTube. Co-founder of Seefluencer, Indonesia’s leading live online learning platform for creators, with an acceptance rate under 3% and a mission to help 1,000 individuals reac",
        "id": 4111796,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=YUFhlPspSIY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YUFhlPspSIY/hqdefault.jpg",
        "title": "Building Impactful Innovation in the Age of Technology | Samuel Christ | TEDxUPH",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:25:43.686551+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:33:25+00:00",
        "description": "Across the world, people still lose their lives because care cannot reach them in time. Dr. Castro's talk reveals how satellites, edge computing, and AI work together like a human nervous system—creating real-time lifelines that bring doctors closer, even from hundreds of miles away. It’s a new way to imagine healthcare: connected, immediate, and built for everyone. Dr. Harvey Castro, MD, MBA, is an emergency physician, AI futurist, and Chief AI Officer at Phantom Space Corporation. Nicknamed “Dr. GPT,” he bridges frontline medicine with cutting‑edge technology to re‑imagine human health and exploration. A four‑time TEDx speaker, Harvey authored 27 books—including the bestselling ChatGPT and Healthcare and advises the Singapore Ministry of Health and the Texas Medical Association on responsible AI policy. At Phantom Space, he leads development of AI‑driven orbital data centers, merging medicine and aerospace to extend human capability beyond Earth. His insights have been featured on F",
        "id": 4111797,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Y-dnIPhFkLA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y-dnIPhFkLA/hqdefault.jpg",
        "title": "How AI, Satellites and Edge Tech Keep your Doctor Close | Harvey Castro | TEDxSouthlake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:55.868113+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:24:08+00:00",
        "description": "Cha Cha Cohen, junior at Beaver Country Day School, shares her journey of confronting a deep fear of water and slowly embracing the art of fly-fishing. Through humorous and heartfelt storytelling, she reveals how small, consistent exposures to fear—paired with mindset shifts like reframing anxiety as excitement—can lead to unexpected passions and personal growth. Cha Cha Cohen is a junior at Beaver Country Day School and is from Brookline, Massachusetts. In her free time, she enjoys playing tennis, skiing, spending time with friends and family, and obviously fly fishing. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4111154,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CFV77qlqEgQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CFV77qlqEgQ/hqdefault.jpg",
        "title": "Hooked on fear: Wading through what scares us | Cha Cha Cohen | TEDxBeaverCountryDaySchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:56.211666+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:21:53+00:00",
        "description": "They are powerful, intelligent, and deeply social, yet orcas are torn from their families and confined to concrete tanks for human entertainment. Ella’s talk is a fierce call to action, exposing the cruelty behind captivity and the theft of freedom from one of the ocean’s most majestic creatures. She reminds us that awe should never come at the cost of suffering, and that the future of orcas depends on the choices we make today. Speak for them. Fight for them. Because they deserve the ocean, not applause. Ella’s deep love for the ocean, sea life, and leadership has inspired her to speak up for one of the most intelligent yet misunderstood animals on the planet, the orca. Through her TEDx talk, Ella explores how human activity has placed orcas at risk, despite their remarkable intelligence and complex social structures. Her speech challenges us to reflect on our treatment of the natural world and to become advocates for marine protection. Ella’s message is clear: when we truly understa",
        "id": 4111155,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XtHYK9LVIfI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XtHYK9LVIfI/hqdefault.jpg",
        "title": "Orcas: Smarter Than We Know, More at Risk Than We Realise | Ella Looker | TEDxSt Marys College Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:56.507596+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:21:45+00:00",
        "description": "Strength is not the absence of pain, it’s the decision to keep showing up despite it.\nSarah Emily Bahari transforms her experience with chronic illness into a message of resilience and hope. Healing isn’t always about a cure, but about courage, compassion, and continuity. Sarah Emily Bahari is a Medical Biotechnology undergraduate at IMU University and a student leader passionate about advocacy and community building. Inspired by her own journey with autoimmune disease, she pursued Medical Biotechnology with a drive to explore innovations in treatment and future cures. She actively represents her programme at IMU events such as Medical Biotechnology Day, Karnival Kimia, and the Science Discovery Challenge, introducing the field to future students. Beyond academics, Sarah serves as President of the Peer Support Club, Mental Health Week, and IMU’s Undergraduate Orientation 2025. A strong debater and speaker, she was Champion of the Medical Intervarsity Debate Championship, a delegate fo",
        "id": 4111156,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1JpL-GHUFAw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1JpL-GHUFAw/hqdefault.jpg",
        "title": "Healing Beyond the Cure | Sarah Emily Bahari Binti Mohd Emil Azril Bahari | TEDxIMU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:56.850466+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:20:21+00:00",
        "description": "This speech explores an underrated but very necessary aspect of a child's growth and development; play/playing and how it is a very important tool in preparing children for the future and in raising a wholesome child Founder of Kidpreneur place and Shoe my feet Initiative. She is passionate about raising innovative and socially conscious children through creativity, play and entrepreneurship. As the founder of Kidpreneur place, she equips young people with tools to build confidence, express ideas, and create impact. She also leads the Shoe my feet initiative with a vision to distribute 5000 shoes annually to children in need This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4111157,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MC4O_nFhS0E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MC4O_nFhS0E/hqdefault.jpg",
        "title": "Play; The key to preparing kids for the future | Philomena Nwajagu | TEDxEnugu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:57.241136+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:20:13+00:00",
        "description": "Bullying isn’t just “kids being kids\", it’s a cycle that can destroy confidence and silence voices. Tyneele knows this firsthand. In her TEDx talk, she reveals how she overcame years of abuse and isolation, rebuilt her life, and reignited her passion for music. Her story is a call to action: every word matters. Choose kindness. Be the reason someone’s flame burns brighter. Tyneele is passionate about friendship, learning, and making positive change. In her TEDx talk, she shares a deeply personal story about the challenges she faced before moving to her current school. Through miscommunication, isolation, and self-doubt, Tyneele found strength she didn’t know she had. Her speech is a moving account of resilience, growth, and the importance of kindness. She hopes her story will show others that no matter where you come from, you can rise above and find a place where you belong. This talk was given at a TEDx event using the TED conference format but independently organized by a local com",
        "id": 4111158,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=P5rtuRn_gTQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/P5rtuRn_gTQ/hqdefault.jpg",
        "title": "From Broken to Bold: My Journey Beyond Bullying | Tyneele Roberts | TEDxSt Marys College Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:57.436278+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:20:04+00:00",
        "description": "Using the Igbos of Southeast Nigeria as an example, this speech pinpoints the importance of peaceful co-existence between especially itinerant tribes and people and their \"hosts\"/communities where they go to interact or settle. It uses the capability of water to break territories against all odds and yet carries with it heavy dose of goodness to those territories to draw this powerful analogy and drive the message home Barrister Richard Agu is a lawyer and retired public servant with a career that spans broadcasting, education, law and public administration. He began in broadcasting with radio Nigeria, radio Benin and NTA. Later teaching in secondary schools before establishing and administering the Enugu state environmental protection agency.\n\nHe has also served in the federal civil service across key institutions including the National Boundary commission and the Standards Organization of Nigeria. After retiring, he returned to law practice with a focus on conflict resolution while ",
        "id": 4111159,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vwnqrYuiHKI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vwnqrYuiHKI/hqdefault.jpg",
        "title": "Water-like resilience; a model for peaceful coexistence in Africa | Richard Agu | TEDxEnugu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:57.704419+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:19:56+00:00",
        "description": "Young artist Khurt Gabrielle Montales shares how imperfection fuels creativity rather than hinders it. In Driven by Imperfection: What Pushes Us to Create, he explores why flaws, unfinished ideas, and mistakes often become the spark that drives us to keep making art. A reminder that creativity grows where perfection ends.\n\n#TEDxYouth\n\n Khurt Gabrielle M. Montales, known as Gab, is a 17-year-old student of STI Legazpi, an aspiring graphic designer. Born in Sorsogon and raised in Brgy. Banuyo, Pilar, Sorsogon, Khurt was taught that everything in life carries its own unique colors. This perspective led him to open doors in digital crafting, where he seeks to bring ordinary ideas to life in extraordinary ways. Both an academic achiever and a student leader, Khurt once served on the student council of his previous school, but chose to step down to focus on self-discovery and growth. Restlessly curious, he continues to explore countless creative paths, often shifting between rhythms, never ",
        "id": 4111160,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=83gnZ31yPkw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/83gnZ31yPkw/hqdefault.jpg",
        "title": "Driven by Imperfection: What Pushes Us to Create? | Khurt Gabrielle Montales | TEDxRizalStreetYouth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:58.039603+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:19:48+00:00",
        "description": "Cosplayer and performer Travis Brioso shares how embracing different roles can help us understand ourselves, adapt to change, and navigate a world where everyone is always “acting” in one way or another. Acting Your Parts in a Perpetual Play is a reminder that every role we take on shapes the story we choose to tell.\n\n#TEDxYouth\n\n Travis Brioso is a dynamic creative from Sorsogon City with a passion for the performing arts and the craft of cosplay. Currently taking up a Bachelor in Performing Arts at Bicol University, he is developing a well-rounded skill set that covers both the on-stage and backstage aspects of theater, from acting and directing to scriptwriting. With three years of experience as a cosplayer, Travis has a keen eye for character and a deep appreciation of the full creative process. Dedicated to storytelling, he envisions a future where he can contribute to the world of theater from every angle. This talk was given at a TEDx event using the TED conference format but i",
        "id": 4111161,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SztczxoH4Ww",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SztczxoH4Ww/hqdefault.jpg",
        "title": "Acting Your Parts in a Perpetual Play | Travis Brioso | TEDxRizalStreetYouth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:58.394783+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:19:37+00:00",
        "description": "This talk boldly explores the idea of the current reward systems on social media where virality is worshipped above wisdom and right reasoning. It insists that we will build better societies if we flip the narrative Chinedu Emmanuel Ani widewly known as Nedu Wazobia is one of Nigeria's most celebrated on-air personality, comedian and actor. With his unique ability to blend humor, satire and social commentary, he has built a career that resonates with millions across radio, television and digital platforms.\n\nBeyond entertainment, Nedu is also a content creator and influencer who uses his platform tp spotlight social issues, spark conversations and connect with audiences in relatable, impactful ways. His work reflects a deep understanding of culture, humor and the power of media in shaping society This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4111162,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=G33XsfN7oes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/G33XsfN7oes/hqdefault.jpg",
        "title": "Africa's social media reward culture needs a change | Chinedu Ani (Nedu Wazobia) | TEDxEnugu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:58.628272+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:19:29+00:00",
        "description": "This speech details the plethora of opportunities that the beautiful round leather game presents beyond what happens on the pitch which many people are unaware of Amobi Ezeaku is the CEO of Rangers football club of Enugu, one of Africa's most historic football institutions. A trained sports lawyer, FIFA pro bono counsel and football administrator, he combines deep legal expertise with a passion for developing sustainable sports ecosystems.\n\nHe is a graduate of the UEFA Academy and holds a FIFA masters in management, law and humanities of sports This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4111163,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TtROL0v1KoA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TtROL0v1KoA/hqdefault.jpg",
        "title": "The power of football to change lives and communities beyond the pitch | Amobi Ezeaku | TEDxEnugu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:58.866739+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:19:21+00:00",
        "description": "This speech explores the idea of negative stereotypes, how they are not all that bad because from a different perspective one can take them on as a challenge and flip them to one's own advantage Rachel Okonkwo popular known as Nkoli nwa Nsukka, is an award-winning Nigerian actress, dancer and philanthropist whose artistry has left an enduring mark in Nollywood and beyond.\nBeyond her work in film, she is deeply passionate about service and giving back. Through her annual Children's Easter carnival, she has impacted thousands of family in Enugu and beyond This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4111164,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=stYQvxpdq7w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/stYQvxpdq7w/hqdefault.jpg",
        "title": "How to flip negative stereotypes to your advantage | Rachel Okonkwo | TEDxEnugu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:59.076579+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:19:18+00:00",
        "description": "In just five seconds, we can judge, dismiss, uplift, or destroy. For Maya, those fleeting moments reveal the hidden weight of words and actions, and their role in shaping lives. Through real stories of bullying, mental health struggles, and the silent battles young people face, Maya challenges us to rethink how we treat one another. Her message is simple yet urgent: five seconds can save a life. Make yours count. Maya brings heart to everything she does, whether she's dancing, singing, cooking or standing up for what's right. Passionate about youth mental health, faireness and resepctful connection, Maya isn't afraid  to challenge how we treat one another and ask the questions that matter. In her TEDx talk, she shines a light on the impact of even the smallest moments, reminding us that our word and actions, in just five seconds, can shape someone's world. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more a",
        "id": 4111165,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=yDF9nur4hyY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yDF9nur4hyY/hqdefault.jpg",
        "title": "Five Seconds of Kindness: The Power to Change a Life | Maya Haman | TEDxSt Marys College Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:59.278774+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:18:18+00:00",
        "description": "What if there were something you could do right now that would flood your body with feel-good hormones, that would reduce stress, and instantly connect you with other people? Something that requires no equipment, costs nothing, and is probably something you have been doing since you were a child. This is a talk about the benefits of singing -- with other people.  Julia Flynn Siler is a New York Times best-selling author and journalist. Her most recent book, The White Devil's Daughters: The Women Who Fought Slavery in San Francisco's Chinatown, was a New York Times Editors’ Choice and a nonfiction finalist for the California Book Award. Her other books are The House of Mondavi: The Rise and Fall of an American Wine Dynasty, a finalist for a James Beard Award and a Gerald Loeb Award for distinguished reporting, and Lost Kingdom: Hawaii’s Last Queen, the Sugar Kings, and America’s First Imperial Adventure. She is a regular contributor to National Geographic and The Wall Street Journal, i",
        "id": 4111166,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QEnf6FIeE_4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QEnf6FIeE_4/hqdefault.jpg",
        "title": "Singing Together | Julia Flynn Siler | TEDxCapeMay",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:24:59.634343+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:17:12+00:00",
        "description": "What if the secret to a better workplace isn’t more rules — but more freedom? In this bold and practical talk, Tim Schneider shares how trust and autonomy unlock purpose, dignity, and human potential at work. A call to leaders and teams to rethink how we lead, collaborate, and grow. Tim Schneider is President & CEO of Bank Five Nine, a $2.3B, 14-branch bank based in Oconomowoc, WI. With nearly 40 years in banking, he’s held roles from ag and commercial lending to COO. Before joining Bank Five Nine, he was founder and CEO of Investors Community Bank, where his dairy farm roots helped it become a top ag lender. A UW River Falls grad ('88), Tim lives in Delafield with his wife, Heather, and has two grown children. He’s committed to Bank Five Nine’s mission to “Make Lives Better,” focusing on company culture and community involvement. Tim has served on numerous boards, including the Waukesha County Center for Growth, Glacial Community YMCA, and Wisconsin Bankers Association. He’s also act",
        "id": 4111167,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NtePAtl7cAs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NtePAtl7cAs/hqdefault.jpg",
        "title": "The simple way to step up your leadership | Tim Schneider | TEDxOconomowoc",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:25:00.009252+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:17:04+00:00",
        "description": "What happens when your voice, your most basic form of expression, suddenly disappears? For Grace, losing the ability to speak wasn’t caused by an accident or illness, but by something far more invisible: stress born from bullying and racism. In this deeply personal talk, Grace shares her journey from silence and shame to resilience and self-acceptance. Her story is a reminder that words matter, but so does the courage to speak up, before you can’t speak at all. Grace is passionate about equality, mental health, and making the most of youth. Her TEDx talk is a powerful and personal reflection on her journey through speech challenges and anxiety. Driven by a desire to help others feel seen and understood, Grace opens up about what it’s like to struggle with something most people take for granted—speaking. With honesty and courage, she shows how confronting personal fears can become a path to growth, confidence, and connection. This talk was given at a TEDx event using the TED conference",
        "id": 4111168,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5vG-zvFiyEs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5vG-zvFiyEs/hqdefault.jpg",
        "title": "Finding My Voice: From Silence to Strength | Grace Boga | TEDxSt Marys College Youth",
        "vote": 0
    }
]