[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T23:04:56.065815+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T22:45:00+00:00",
        "description": "pbahra writes: Saudi Arabia is betting that the future of Hollywood won't be built in physical stages but in datacenters. In a push to anchor itself in next-generation film production, Riyadh-based Humain has led Luma AI's latest Series C round, backing the shift towards cloud-based, AI-generated video rather than traditional studio infrastructure.. Humain's announcement says the new investment will accelerate Luma's development of world models capable of learning from video, audio and language to generate photorealistic scenes, environments and characters on demand. Supporters argue this could upend film-making by pushing much of Hollywood's production pipeline into high-performance datacenters rather than physical sets.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Saudi+Makes+Big+Bet+On+AI+Films+As+Hollywood+Moves+From+Studios+To+Datacenters%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F11%2F19%2F22",
        "id": 4114157,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/19/2216207/saudi-makes-big-bet-on-ai-films-as-hollywood-moves-from-studios-to-datacenters",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Saudi Makes Big Bet On AI Films As Hollywood Moves From Studios To Datacenters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T23:04:56.197049+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T22:24:00+00:00",
        "description": "Nvidia blew past earnings expectations with soaring revenue and profit, easing fears of an AI bubble and reinforcing its position as the engine of the global AI boom. From a report: Nvidia's sales grew 62% year-over-year to $57 billion in the October quarter, ahead of the $54.9 billion Wall Street had projected, signaling that demand for AI chips remains strong even as more questions emerge about whether returns from the technology will keep up with the pace of AI infrastructure investments. It posted profits of $31.9 billion, up 65% from the year-ago quarter and also slightly above expectations.\n \n\"Blackwell sales are off the charts, and cloud GPUs are sold out,\" Nvidia CEO Jensen Huang said in a statement, a message that echoes his earlier arguments that fears of an AI bubble are overblown. The company also posted stronger-than-expected sales guidance of around $65 billion for the fourth quarter, another indicator that the AI spending spree isn't slowing anytime soon.<p><div class=\"",
        "id": 4114158,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/19/2223211/nvidia-beats-earnings-expectations-even-as-bubble-concerns-mount",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Beats Earnings Expectations, Even As Bubble Concerns Mount",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T23:04:56.297327+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T22:07:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: The Dutch government suspended its powers over chipmaker Nexperia, restoring control to its Chinese owner (paywalled; alternative source) and defusing a standoff with Beijing that had begun to hamper automotive production around the world. The order that gave the Netherlands powers to block or revise decisions at Nexperia was dropped as \"a show of goodwill,\" Economic Affairs Minister Vincent Karremans said Wednesday in a post on social media site X.\n \nBloomberg had reported earlier this month that the Netherlands was prepared to take the step if chip deliveries from the company's site in China could be confirmed.\nThe move marks a significant de-escalation of a dispute that underscored the global nature of supply chains and highlighted Beijing's growing leverage. Even though Nexperia's chips aren't advanced and the company only operates one facility in China, the spat disrupted automakers from Honda Motor Co. to Volkswagen AG.\n \nThe r",
        "id": 4114159,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/19/225253/dutch-hand-back-control-of-chinese-owned-chipmaker-nexperia",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dutch Hand Back Control of Chinese-Owned Chipmaker Nexperia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T22:04:27.241517+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T21:22:00+00:00",
        "description": "An anonymous reader shares a report: This summer, Oslo's public-transport authority drove a Chinese electric bus deep into a decommissioned mine inside a nearby mountain to answer a question: Could it be hacked? Isolated by rock from digital interference, cybersecurity experts came back with a qualified yes: The bus could in theory be remotely disabled using the control system for the battery. \n\nThe revelation, presented at a recent public-transport conference, has spurred officials in Denmark and the U.K. to start their own investigations into Chinese vehicles. It has also fed into broader security concerns across Europe about the growing prevalence of Chinese-made equipment in the region's energy and telecommunications infrastructure. \n\nThe worry is the same for autos, solar panels and other connected devices: that mechanisms used for wirelessly delivering system updates could also be exploited by a hostile government or third-party hacker to compromise critical networks. [...] The ",
        "id": 4113707,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/19/186230/can-chinese-made-buses-be-hacked-norway-drove-one-down-a-mine-to-find-out",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Can Chinese-Made Buses Be Hacked? Norway Drove One Down a Mine To Find Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T21:01:46.479817+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T20:42:00+00:00",
        "description": "A new treatment for tuberculosis could boost cure rates and shorten the time needed to treat the disease by months, trial results suggest. The Guardian: Globally, an estimated 10.7 million people fell ill with TB last year and 1.23 million died from it. In its annual report on tuberculosis, launched last week, the World Health Organization said it remained a \"major global public-health problem\" and the leading infectious cause of death. [...] Sorfequiline, a new antibiotic, showed stronger action against the deadly bacteria than existing treatments, with a comparable safety profile, researchers from the TB Alliance told the Union Conference on Lung Health in Copenhagen on Wednesday. \n\nThe trial involved 309 people across 22 sites in South Africa, the Philippines, Georgia, Tanzania and Uganda, with different dose regimens. All participants had \"drug-sensitive\" tuberculosis, meaning a standard cocktail of drugs can safely treat them but researchers believe TB infections that are resista",
        "id": 4113152,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/19/1820223/new-antibiotic-could-be-a-breakthrough-in-treatment-for-killer-tb-trial-suggests",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Antibiotic Could Be a Breakthrough in Treatment for Killer TB, Trial Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T21:01:46.601600+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T20:01:00+00:00",
        "description": "Action is needed now to reduce ultra-processed food (UPF) in diets worldwide because of their threat to health, say international experts in a global review of research. From a report: They say the way we eat is changing - with a move away from fresh, whole foods to cheap, highly-processed meals - which is increasing our risk of a range of chronic diseases, including obesity and depression. Writing in The Lancet, the researchers say governments need \"to step up\" and introduce warnings and higher taxes on UPF products, to help fund access to more nutritious foods. \n\n[...] This review of evidence on the impact of UPFs on health, carried out by 43 global experts and based on 104 long-term studies, suggests these foods are linked to a greater risk of 12 health conditions. These include type 2 diabetes, cardiovascular disease, kidney disease, depression and dying prematurely from any cause.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter",
        "id": 4113153,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/19/1813215/ultra-processed-food-is-global-health-threat-researchers-warn",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ultra-Processed Food is Global Health Threat, Researchers Warn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T20:01:13.740111+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T19:25:00+00:00",
        "description": "The EU's cookie consent policies have been an annoying and unavoidable part of browsing the web in Europe since their introduction in 2018. But the cookie nightmare is about to crumble thanks to some big proposed changes announced by the European Commission today. From a report: Instead of having to click accept or reject on a cookie pop-up for every website you visit in Europe, the EU is preparing to enforce rules that will allow users to set their preferences for cookies at the browser level. \"People can set their privacy preferences centrally -- for example via the browser -- and websites must respect them,\" says the EU. \"This will drastically simplify users' online experience.\" \n\nThis key change is part of a new Digital Package of proposals to simplify the EU's digital rules, and will initially see cookie prompts change to be a simplified yes or no single-click prompt ahead of the \"technological solutions\" eventually coming to browsers. Websites will be required to respect cookie ",
        "id": 4112709,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/19/189236/europes-cookie-nightmare-is-crumbling",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Europe's Cookie Nightmare is Crumbling",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:58:32.794383+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T18:40:00+00:00",
        "description": "Linus Torvalds is \"fairly positive\" about vibe coding as a way for people to get computers to do things they otherwise could not. The Linux kernel maintainer made the comments during an interview at the Linux Foundation Open Source Summit in Seoul earlier this month. But he cautioned that vibe coding would be a \"horrible, horrible idea from a maintenance standpoint\" for production code. \n\nTorvalds told Dirk Hohndel, head of open source at Verizon, that computers have become more complicated than when he learned to code by typing in programs from computer magazines. He said vibe coding offers a path into computing for newcomers. The kernel maintainer is not using AI-assisted coding himself. He said his role has shifted from rejecting new ideas to sometimes pushing for them against opposition from longstanding maintainers who \"kind of get stuck in a rut.\" \n\nRust is \"actually becoming a real part of the kernel instead of being this experimental thing,\" he said. Torvalds said AI crawlers ",
        "id": 4112189,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/19/1832208/linus-torvalds-says-vibe-coding-is-fine-for-getting-started-horrible-idea-for-maintenance",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linus Torvalds Says Vibe Coding is Fine For Getting Started, 'Horrible Idea' For Maintenance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T18:58:32.884933+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T18:03:00+00:00",
        "description": "Britain said on Wednesday it would ban the resale of tickets to concerts, sport and other live events for profit, disrupting ticket touts and the platforms that benefit from their activities. From a report: Culture Secretary Lisa Nandy said touts were ripping off fans by using bots to snap up batches of tickets for coveted shows and reselling them at sky-high prices. \"Our new proposals will shut down the touts' racket and make world-class music, comedy, theatre and sport affordable for everyone,\" she said, after the government had promised action.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK+To+Ban+the+Resale+of+Tickets+For+Profit+To+Protect+Fans%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F19%2F1745251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot",
        "id": 4112190,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/19/1745251/uk-to-ban-the-resale-of-tickets-for-profit-to-protect-fans",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK To Ban the Resale of Tickets For Profit To Protect Fans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T17:54:08.122357+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T17:20:00+00:00",
        "description": "Chinese economist Gao Shanwen told a Washington panel in December that China's real GDP growth might be around 2% rather than the official figure near 5%. By January, Gao was no longer chief economist at SDIC Securities and went silent for almost a year.\nAs FT points out in a long piece, China does not publish quarterly GDP breakdowns showing consumption, investment and net exports. Every other major economy produces these figures. \n\nThe IMF in 2024 gave China a C grade for national accounts. The rating puts China on par with India and below Vietnam. Fixed asset investment data showed negative growth in 2025 for only the second time in decades. Property investment has fallen consistently since 2022. But official GDP investment data shows no signs of declining. \n\nThe National Bureau of Statistics stopped publishing sectoral breakdowns of fixed asset investment in 2018. It discontinued a price series in 2021 and a land sales series in 2023. Beijing has restricted researcher access rathe",
        "id": 4111526,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/19/1635239/the-growing-problem-with-chinas-unreliable-numbers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Growing Problem With China's Unreliable Numbers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T16:53:39.767061+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T16:44:00+00:00",
        "description": "Boston Dynamics' Spot robot is now deployed by more than 60 bomb squads and SWAT teams across the US and Canada. The 75-pound four-legged machine starts at around $100,000 and has been used in armed standoffs, hostage rescues and hazardous materials incidents since its commercial debut five years ago. The Massachusetts State Police operates two Spot units purchased in 2020 and 2022. Each cost about $250,000 including add-ons funded through state grants. Last year one of the robots helped corner a suspect who had taken his mother hostage at knifepoint in Hyannis. Houston operates three units and Las Vegas has one. \n\nICE recently spent around $78,000 on a similar robot from Canadian manufacturer Icor Technology that can also deploy smoke bombs. Civil liberties groups have raised concerns about normalizing militarized policing. The NYPD suspended its limited Spot program in 2021 after public backlash over cost and surveillance concerns before later reinstating it and purchasing two units",
        "id": 4110959,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/19/1622209/more-than-60-us-and-canadian-police-units-now-use-boston-dynamics-robot-dog",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Than 60 US and Canadian Police Units Now Use Boston Dynamics' Robot Dog",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T16:53:39.947501+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T16:05:00+00:00",
        "description": "An anonymous reader shares a report: Federal health officials have linked two massive US measles outbreaks, confirming that the country is about two months away from losing its measles elimination status, according to a report by The New York Times. The Times obtained a recording of a call during which officials from the Centers for Disease Control and Prevention confirmed to state health departments that the ongoing measles outbreak at the border of Arizona and Utah is a continuation of the explosive outbreak in West Texas that began in mid- to late-January. That is, the two massive outbreaks are being caused by the same subtype of measles virus. \n\nThis is a significant link that hasn't previously been reported despite persistent questions from journalists and concerns from health experts, particularly in light of Canada losing its elimination status last week. The loss of an elimination status means that measles will once again be considered endemic to the US, an embarrassing public",
        "id": 4110960,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/19/1540212/cdc-data-confirms-us-is-2-months-away-from-losing-measles-elimination-status",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CDC Data Confirms US is 2 Months Away From Losing Measles Elimination Status",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T15:50:50.507609+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T15:25:00+00:00",
        "description": "Tsinghua University collected 4,986 AI and machine learning patents between 2005 and the end of 2024. The Beijing institution has received more than 900 patents last year alone. The total exceeds the combined patent count from MIT, Stanford, Princeton and Harvard during the same period. China now accounts for more than half of all active patent families globally in AI and machine learning fields, according to data analytics service LexisNexis. \n\nThe university also has more AI research papers among the 100 most cited than any other school at last count. The US still holds the most influential AI patents and the top performing models. Harvard and MIT consistently rank ahead of Tsinghua in patent influence. American institutions produced 40 notable AI models in 2024 compared to 15 from Chinese organizations, according to Stanford's AI Index Report. China's share of the world's elite AI researchers -- the top 2% -- rose from 10% in 2019 to 26% in 2022. The US share fell from 35% to 28% d",
        "id": 4110329,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/19/153210/chinese-university-collected-more-ai-patents-than-mit-stanford-princeton-and-harvard-combined",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese University Collected More AI Patents Than MIT, Stanford, Princeton and Harvard Combined",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T15:50:50.707772+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T14:47:00+00:00",
        "description": "Cloudflare suffered its worst network outage in six years on Tuesday, beginning at 11:20 UTC. The disruption prevented the content delivery network from routing traffic for roughly three hours. The failure, writes Cloudflare in a blog post, originated from a database permissions change deployed at 11:05 UTC. The modification altered how a database query returned information about bot detection features. The query began returning duplicate entries. A configuration file used to identify automated traffic doubled in size and spread across the network's machines. Cloudflare's traffic routing software reads this file to distinguish bots from legitimate users. The software had a built-in limit of 200 bot detection features. The enlarged file contained more than 200 entries. The software crashed when it encountered the unexpected file size. \n\nUsers attempting to access websites behind Cloudflare's network received error messages. The outage affected multiple services. Turnstile security chec",
        "id": 4110330,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/19/1447256/cloudflare-explains-its-worst-outage-since-2019",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cloudflare Explains Its Worst Outage Since 2019",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T14:50:15.374052+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T13:49:00+00:00",
        "description": "An anonymous reader shares a report: California-based TP-Link says it may take a sales hit of more than $1 billion because of erroneous reports that the networking company's technology has been \"infiltrated\" by Beijing. In a lawsuit, TP-Link claims its competitor, Netgear, orchestrated a smear by planting false claims with journalists and internet influencers with the goal of scaring off customers. \n\nClosely held TP-Link, which makes wireless routers, alleges in a complaint filed Monday that Netgear's campaign \"threatens injury to well over a billion dollars in sales\" and violates a 2024 settlement of a patent fight. That accord, in which TP-Link agreed to pay Netgear $135 million, includes a provision that the public company promises not to disparage its rival, according to the suit in Delaware federal court. \n\nThe suit comes as TP-Link faces growing scrutiny in Washington over national-security issues. US lawmakers from both parties have expressed concern that TP-Link's wireless equ",
        "id": 4109729,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/19/1350201/netgear-accused-by-rival-of-china-smear-to-fan-security-fear",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Netgear Accused by Rival of China Smear To Fan Security Fear",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T07:45:18.043689+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T07:00:00+00:00",
        "description": "A Chinese man who cryogenically preserved his wife after her death has sparked a heated online debate after it emerged he began dating a new partner in 2020. Some argue it's natural for him to move on, while others say he's being selfish or disrespectful to both his late wife and his current partner. The BBC reports: As a sign of his devotion, Gui Junmin decided to freeze his wife Zhan Wenlian's body after she died from lung cancer in 2017, aged 49, making her China's first cryogenically preserved person. But after a November interview revealed he had been dating a different partner since 2020, Chinese social media has been torn on Mr Junmin's predicament. Whilst some asked why the 57-year-old didn't just \"let go\" another commenter remarked he appeared to be \"most devoted to himself.\"\n \nAfter Zhan Wenlian was given months to live by doctors, Gui Junmin decided to use cryonics - which is scientifically unproven - to preserve her body once she died. Following her death, he signed a 30-y",
        "id": 4106875,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/19/0257258/man-who-cryogenically-froze-late-wife-sparks-debate-by-dating-new-partner",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Man Who Cryogenically Froze Late Wife Sparks Debate By Dating New Partner",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T03:42:44.002259+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from CNBC: The Trump administration will provide Constellation Energy with a $1 billion loan to restart the Crane Clean Energy Center nuclear plant in Pennsylvania, Department of Energy officials said Tuesday. Previously known as Three Mile Island Unit 1, the plant is expected to start generating power again in 2027. Constellation unveiled plans to rename and restart the reactor in Sept. 2024 through a power purchase agreement with Microsoft to support the tech company's data center demand in the region.\n \nThree Mile Island Unit 1 ceased operations in 2019, one of a dozen reactors that closed in recent years as nuclear struggled to compete against cheap natural gas. It sits on the same site as Three Mile Island Unit 2, the reactor that partially melted down in 1979 in the worst nuclear accident in U.S. history. The loan would cover the majority to the project's estimated cost of $1.6 billion. The first advance to Constellation is expected in the fir",
        "id": 4105838,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/19/0026252/us-backs-three-mile-island-nuclear-restart-with-1-billion-loan-to-constellation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Backs Three Mile Island Nuclear Restart With $1 Billion Loan To Constellation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T02:42:15.875844+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T02:20:00+00:00",
        "description": "MI5 has warned U.K. lawmakers that Chinese intelligence operatives are using LinkedIn and recruitment fronts to target them for information gathering and long-term cultivation. PBS reports: Writing to lawmakers, House of Commons Speaker Lindsay Hoyle said a new MI5 \"espionage alert\" warned that Chinese nationals were \"using LinkedIn profiles to conduct outreach at scale\" on behalf of the Chinese Ministry of State Security. \"Their aim is to collect information and lay the groundwork for long-term relationships, using professional networking sites, recruitment agents and consultants acting on their behalf,\" he said. MI5 issued the alert because the activity was \"targeted and widespread,\" he added.\n \nThe MI5 alert cited LinkedIn profiles of two women, Amanda Qiu and Shirly Shen, and said other similar recruiters' profiles were acting as fronts for espionage. Home Office Minister Dan Jarvis said that apart from parliamentary staff, others including economists, think tank consultants and g",
        "id": 4105602,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/19/0018216/chinese-spies-are-trying-to-reach-uk-lawmakers-via-linkedin-mi5-warns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Spies Are Trying To Reach UK Lawmakers Via LinkedIn, MI5 Warns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T02:42:15.959993+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T01:40:00+00:00",
        "description": "Mexico has finally lifted its long-running Tor ban for the main government portal, allowing privacy-focused users, journalists, and activists to access gob.mx again after more than a decade of blocking. That said, the open data portal and the former Tor-compatible whistleblower system remain inaccessible. CyberInsider reports: The development follows a long period of digital censorship that spanned two full six-year presidential terms, those of Enrique Pena Nieto and Andres Manuel Lopez Obrador, and continued into the early months of Claudia Sheinbaum Pardo's current administration. Research conducted by Jacobo Najera and Miguel Trujillo, published in October 2023, documented that 21 federal government agencies were blocking traffic from the Tor network, effectively excluding privacy-conscious users from vital public resources and services.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Mexico+Partially+Lifts+Longst",
        "id": 4105603,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/19/000255/mexico-partially-lifts-longstanding-website-ban-on-tor-network",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mexico Partially Lifts Longstanding Website Ban On Tor Network",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T01:41:46.370269+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T01:00:00+00:00",
        "description": "A NordPass analysis found that Gen Z is actually worse at password security than older generations, with \"12345\" topping their list while \"123456\" dominates among everyone else. The Register reports: And while there were a few more \"skibidis\" among the Zoomer dataset compared to those who came before them, the trends were largely similar. Variants on the \"123456\" were among the most common for all age groups, with that exact string proving to be the most common among all users -- the sixth time in seven years it holds the undesirable crown.\n \nSome of the more adventurous would stretch to \"1234567,\" while budding cryptologists shored up their accounts by adding an 8 or even a 9 to the mix. However, according to Security.org's password security checker, a computer could crack any of these instantly. Most attackers would not even need to expend the resources required to reveal the password, given how commonly used they are. They could just spray a list of known passwords at an authentica",
        "id": 4105327,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/18/2341220/gen-z-officially-worse-at-passwords-than-80-year-olds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gen Z Officially Worse At Passwords Than 80-Year-Olds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T00:41:17.948406+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T00:20:00+00:00",
        "description": "An anonymous reader quotes a report from ZDNet: At KubeCon North America 2025 in Atlanta, the Cloud Native Computing Foundation (CNCF)'s leaders predicted an enormous surge in cloud-native computing, driven by the explosive growth of AI inference workloads. How much growth? They're predicting hundreds of billions of dollars in spending over the next 18 months. [...] Where cloud-native computing and AI inference come together is when AI is no longer a separate track from cloud-native computing. Instead, AI workloads, particularly inference tasks, are fueling a new era where intelligent applications require scalable and reliable infrastructure. That era is unfolding because, said [CNCF Executive Director Jonathan Bryce], \"AI is moving from a few 'Training supercomputers' to widespread 'Enterprise Inference.' This is fundamentally a cloud-native problem. You, the platform engineers, are the ones who will build the open-source platforms that unlock enterprise AI.\"\n \n\"Cloud native and AI-n",
        "id": 4105003,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/18/2242231/cloud-native-computing-is-poised-to-explode",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cloud-Native Computing Is Poised To Explode",
        "vote": 0
    }
]