[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T21:19:54.451660+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T19:00:11+00:00",
        "description": "Fashion design is evolving rapidly with the rise of 3D tools, and Adobe Substance 3D is revolutionizing the way materials are created and visualized. \n\nThis session recorded at Unreal Fest Orlando 2025 explores how Substance 3D Sampler and Designer enable the creation of high-quality, procedural materials that accurately replicate real-world fabrics. You’ll also learn how to texture garments in Substance 3D Painter and seamlessly export them to Unreal Engine for achieving an unprecedented level of realism in their interactive visualization, configurators, and immersive digital experiences.\n\nBy harnessing Substance 3D materials, designers can enhance fabric realism, streamline iteration cycles, and optimize apparel workflows for digital applications. The integration with Unreal Engine takes this further, allowing for virtual try-ons, dynamic digital showrooms, and high-quality marketing content with unparalleled accuracy.\n\nAdditionally, the session explores how Twinmotion, powered by U",
        "id": 4113266,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9WyT1xoWMOs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9WyT1xoWMOs/hqdefault.jpg",
        "title": "Future-Proofing Fashion: Unlocking the Power of Substance 3D and UE | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-19T15:28:47.885356+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-19T15:02:02+00:00",
        "description": "Typically, UI developers break backend data and visual design into separate systems. \n\nThis makes the process of building the user interface (UI) less destructive and more efficient, as designers can change the visual presentation without breaking the code behind the UI, and programmers can focus on data and systems without needing a completed frontend.\n\nUnreal Motion Graphics provides a medium for this workflow: the Viewmodel plugin. Viewmodels are a great way to empower designers and reduce the workload on engineers. In this talk, a Fortnite developer demonstrates how you can leverage them to build dynamic UI. \n\nYou will hear tips and tricks, best practices, and see examples of how to handle tricky edge cases. Swing by and learn how to reuse or repurpose Viewmodel data without the need for code changes. See how you can organize your data setup in a way that is readable when collaborating with other team members. And find out how to structure your UI in a way that is both maintainabl",
        "id": 4109995,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xOTZ-DVNc9U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xOTZ-DVNc9U/hqdefault.jpg",
        "title": "Powering Dynamic UI with Viewmodels | Unreal Fest Orlando 2025",
        "vote": 0
    }
]