[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T16:15:24.435894+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T15:30:05+00:00",
        "description": "Forever Skies is the upcoming aeronautical survival adventure from developer Far From Home, and the team – with experience having worked on esteemed series’ Dying Light and Medium – have crafted an engaging, intriguing, and surprisingly cerebral experience. \n\nScavenging resources, maintaining hunger, thirst, and energy the mainstays of any survival game are present and correct here, but the game’s unique selling point is its airship. \n\nThis mode of transport isn’t just a means for getting from A to B, but a laboratory, workplace, and home, and it’s down to you to forage supplies and modules to customize to your whim. \n\nThere’s a mystery to unravel here too, but the game’s airship management looks to be the most enticing draw.",
        "id": 2548425,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DU0M5QoHrXc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DU0M5QoHrXc/hqdefault.jpg",
        "title": "Forever Skies - 15 Cool Things YOU MAY NOT KNOW",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T09:39:47.138500+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T09:30:25+00:00",
        "description": "Before DOOM: The Dark Ages’ hotly anticipated launch on 13th May 2025 we thought it was time to discuss two of the long-running FPS series’ most iconic demonic enemies – the Mancubus and the Cacodemon. \n\nFirst appearing way back in the game’s 1990s forbearers, both the Mancubus and Cacodemon feature heavily as common cannon fodder throughout each entry since. However, their designs have been tweaked over the years, the Cacodemon more so than the Mancubus. \n\nThis videos discusses those design changes, plus highlights their significance, their origins and lore, their maneuvering capabilities, combat ability, and best ways to take them down. DOOM as a series harbors numerous intriguing creatures, but these two – the Mancubus and Cacodemon – are amongst its most interesting.",
        "id": 2546571,
        "language": null,
        "link": "https://www.youtube.com/watch?v=MJGur2mS7xA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MJGur2mS7xA/hqdefault.jpg",
        "title": "What Are The Mancubus And Cacodemon? - DOOM Demon Lore - Before You Play DOOM: The Dark Ages",
        "vote": 0
    }
]