[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T23:25:02.082351+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T23:25:01+00:00",
        "description": "Remember how last weekend Meta claimed its \"Maverick\" AI model (in the newly-released Llama-4 series) beat GPT-4o and Gemini Flash 2 \"on all benchmarks... This thing is a beast.\" \nAnd then how within a day several AI researchers pointed out that even Meta's own announcement admitted the Maverick tested on LM Arena was an \"experimental chat version,\" as TechCrunch pointed out. (\"As we've written about before, for various reasons, LM Arena has never been the most reliable measure of an AI model's performance. But AI companies generally haven't customized or otherwise fine-tuned their models to score better on LM Arena &mdash; or haven't admitted to doing so, at least.\") \n\nFriday TechCrunch on what happened when LMArena tested the unmodified release version of Maverick (Llama-4-Maverick-17B-128E-Instruct). \n\nIt ranked 32nd. \n\"For the record, older models like Claude 3.5 Sonnet, released last June, and Gemini-1.5-Pro-002, released last September, rank higher,\" notes the tech site Neowin.<",
        "id": 2550319,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/13/2226203/after-meta-cheating-allegations-unmodified-llama-4-maverick-model-tested---ranks-32?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After Meta Cheating Allegations, 'Unmodified' Llama 4 Maverick Model Tested - Ranks #32",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T21:15:33.961583+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T21:15:33+00:00",
        "description": "\"More than three million children around the world are thought to have died in 2022 as a result of infections that are resistant to antibiotics,\" reports the BBC, citing a study by two leading experts in child health that used data from sources including the World Health Organization and the World Bank:\n\nExperts say this new study highlights a more than tenfold increase in AMR-related infections in children in just three years. The number could have been made worse by the impact of the Covid pandemic... \n\nThe report's lead authors, Doctor Yanhong Jessika Hu of Murdoch Children's Research Institute in Australia and Professor Herb Harwell of the Clinton Health Access Initiative, point to a significant growth in the use of antibiotics that are meant to only be held back for the most serious infections. Between 2019 and 2021 the use of \"watch antibiotics\", drugs with a high risk of resistance, increased by 160% in South East Asia and 126% in Africa. Over the same period, \"reserve antibiot",
        "id": 2549827,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/13/210217/three-million-child-deaths-linked-to-drug-resistance-study-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Three Million Child Deaths Linked To Drug Resistance, Study Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T20:10:40.534084+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T20:10:40+00:00",
        "description": "\"It is somewhat remarkable that work on AmigaOS 3.X continues in 2025,\" notes Tom's Hardware, \"given that Commodore International released AmigaOS 3.0 in 1992...\" \n\nAmigaOS 3.1 came in 1993. And now...\n\nWork continues on AmigaOS 3.2 with the stewards of this classic Motorola 680x0 friendly operating system, Hyperion Entertainment, releasing version 3.2.3 a few days ago. \n\nIn a news bulletin on the official site, Hyperion highlighted that the third update for AmigaOS 3.2 includes two years of (more than 50) fixes and enhancements... Hyperion began its quest to modernize and improve this classic version of AmigaOS for Motorola 680x0 platforms in 2018 when it released version 3.1.4. The AmigaOS 3.2 lineage began in 2021... \n\nThis release is provided as a free update to owners of AmigaOS 3.2. If you don't already have this OS, you can get it now at official resellers like RetroPassion UK... Nowadays, Arm-based accelerators seem to be the path forward for modern Amiga, as opposed to retro ",
        "id": 2549423,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/13/1813251/33-year-old-amigaos-for-commodore-computers-gets-an-unexpected-update?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "33-year-old AmigaOS for Commodore Computers Gets an Unexpected Update",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T19:06:16.607257+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T19:06:16+00:00",
        "description": "\"Can you help me take down the Texas lottery?\" \nThat's what a London banker-turned-bookmaker asked \"acquaintances\" in 2023, reports the Wall Street Journal. The plan was to buy \"nearly every possible number in a coming drawing\" &mdash; purchasing $1 tickets for 25.8 million possible combinations, since \"The jackpot was heading to $95 million. If nobody else also picked the winning numbers, the profit would be nearly $60 million.\"\n\nMarantelli flew to the U.S. with a few trusted lieutenants. They set up shop in a defunct dentist's office, a warehouse and two other spots in Texas. The crew worked out a way to get official ticket-printing terminals. Trucks hauled in dozens of them and reams of paper... [Then Texas announced no winner in an earlier lottery, rolling its jackpot into another drawing three days later.] The machines &mdash; manned by a disparate bunch of associates and some of their children &mdash; screeched away nearly around the clock, spitting out 100 or more tickets every",
        "id": 2549143,
        "language": null,
        "link": "https://idle.slashdot.org/story/25/04/13/1716210/how-a-secretive-gambler-called-the-joker-beat-the-texas-lottery?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How a Secretive Gambler Called 'The Joker' Beat the Texas Lottery",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T18:02:29.715694+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T18:02:29+00:00",
        "description": "Somewhere in Montana sits the only coal-fired power plant in America that hasn't installed modern pollution controls to limit particulate matter, according to the Environmental Protecction Agency. Mining.com notes that it has the highest emission rate of fine particulate matter out of any U.S. coal-burning power plant.\nWhen inhaled, the finest particles are able to penetrate deep into the lungs and even potentially the bloodstream, exacerbating heart and lung disease, causing asthma attacks and even sometimes leading to premature death. \nYet America's dirtiest coal-fired power plant &mdash; and dozens of others &mdash; \"are being exempted from stringent air pollution mandates,\" reports Bloomberg, \"as part of US. President Donald Trump's bid to revitalize the industry:\n\nTalen Energy Corp.'s Colstrip in Montana is among 47 plants receiving two-year waivers from rules to control mercury and other pollutants as part of a White House effort to ease regulation on coal-fired sites, according",
        "id": 2548851,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/13/1540241/americas-dirtiest-coal-power-plants-given-exemptions-from-pollution-rules-to-help-power-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's Dirtiest Coal Power Plants Given Exemptions from Pollution Rules to Help Power AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T16:55:45.378715+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T16:55:45+00:00",
        "description": "Linux Mint Debian Edition 7 \"will come with full support for OEM installations,\" according to their monthly newsletter, so Linux Mint \"can be pre-installed on computers which are sold throughout the World. It's a very important feature and it's one of the very few remaining things which wasn't supported by Linux Mint Debian Edition.\" \n\nSlashdot reader BrianFagioli speculates that \"this could be a sign of something much bigger.\"\nOEM installs are typically reserved for operating systems meant to ship on hardware. It's how companies preload Linux on laptops without setting a username, password, or timezone... Mint has supported this for years &mdash; but only in its Ubuntu-based version. So why is this feature suddenly coming to Linux Mint Debian Edition, which the team has repeatedly described as a contingency? In other words, if the Debian variant is merely a plan B, why make it ready for OEMs? \n\nTheir blog post goes on to speculate about possible explanations (like the hypothetical po",
        "id": 2548531,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/04/12/0518218/linux-mint-debian-edition-7-gets-oem-support?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Linux Mint Debian Edition 7' Gets OEM Support",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T15:50:38.302419+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T15:50:38+00:00",
        "description": "When Microsoft announced it would stop developing MS-DOS after 1995, college student Jim Hall \"packaged my own extended DOS utilities, as did others,\" according to the web site for the resulting \"FreeDOS\" project. \n\nJim Hall is also Slashdot reader #2,985, and more than 30 years later he's \"keeping the dream of the command prompt alive,\" writes Ars Technica. In a new article they note that last week the FreeDOS team released version 1.4, the first new stable update since 2022:\n\n\nThe release has \"a focus on stability\" and includes an updated installer, new versions of common tools like fdisk, and format and the edlin text editor. The release also includes updated HTML Help files... As with older versions, the FreeDOS installer is available in multiple formats based on the kind of system you're installing it on. For any \"modern\" PC (where \"modern\" covers anything that's shipped since the turn of the millennium), ISO and USB installers are available for creating bootable CDs, DVDs, or US",
        "id": 2548195,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/13/0215254/freedos-celebrates-more-than-30-years-of-command-prompts-with-new-release?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FreeDOS Celebrates More Than 30 Years of Command Prompts With New Release",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T12:36:37.261894+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T12:36:36+00:00",
        "description": "\"AMD processors were instrumental in achieving a new world record,\" reports Tom's Hardware, \"during a recent Ansys Fluent computational fluid dynamics simulation run on the Frontier supercomputer at the Oak Ridge National Laboratory.\" \n\nThe article points out that Frontier was the fastest supercomputer in the world until it was beaten by Lawrence Livermore Lab's El Capitan &mdash; with both computers powered by AMD GPUs:\nAccording to a press release by Ansys, it ran a 2.2-billion-cell axial turbine simulation for Baker Hughes, an energy technology company, testing its next-generation gas turbines aimed at increasing efficiency. The simulation previously took 38.5 hours to complete on 3,700 CPU cores. By using 1,024 AMD Instinct MI250X accelerators paired with AMD EPYC CPUs in Frontier, the simulation time was slashed to 1.5 hours. This is more than 25 times faster, allowing the company to see the impact of the changes it makes on designs much more quickly... \n\n\nGiven those numbers, th",
        "id": 2547032,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/13/0130250/new-supercomputing-record-set---using-amds-instinct-gpus?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Supercomputing Record Set - Using AMD's Instinct GPUs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T08:39:21.423006+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T08:39:21+00:00",
        "description": "\"Researchers say that a person's intelligence plays a bigger role in their computer proficiency than previously believed,\" writes SciTechDaily, \"so much so that practice alone may not be enough to ensure ease of use.\" \n\nA new study has found that general cognitive abilities, such as perception, reasoning, and memory, are more important than previously believed in determining a person's ability to perform everyday tasks on a computer... \"It is clear that differences between individuals cannot be eliminated simply by means of training,\" says Antti Oulasvirta [a professor at Finland's Aalto University who conducted extensive human-computer interaction research with his team and the University of Helsinki Department of Psychology]. \"In the future, user interfaces need to be streamlined for simpler use. This age-old goal has been forgotten at some point, and awkwardly designed interfaces have become a driver for the digital divide. \n\n\n\"We cannot promote a deeper and more equal use of compu",
        "id": 2546385,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/13/0238237/do-cognitive-abilities-predict-performance-in-everyday-computer-tasks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Do Cognitive Abilities Predict Performance in Everyday Computer Tasks?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T04:19:15.453626+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T04:19:15+00:00",
        "description": "Celebrating Git's 20th anniversary, GitHub hosted a Q&amp;A with Linus Torvalds, writes Its FOSS News. \n\nAmong the other revelations: He says his college-age daughter sent a texting saying he's better known at her CS lab for Git than for Linux, \"because they actually use Git for everything there.\" Which he describes as \"ridiculous\" because he maintained it for just four months before handing it off to Junio Hamano who's been heading up development for more than 19 years now. \"When it did what I needed,\" Torvalds says, \"I lost interest.\"\n\n\n Linus then goes on to share how Git was never a big thing for him, but a means to an end that prevented the Linux kernel from descending into chaos over the absence of a version control system. You see, before Git, Linux used BitKeeper for version control, but its proprietary licensing didn't sit too well with other Linux contributors, and Linus Torvalds had to look for alternatives. As it turned out, existing tools like CVS and Subversion were too ",
        "id": 2545640,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/04/13/0110228/torvalds-celebrates-gits-20th-anniversay-is-it-more-famous-than-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Torvalds Celebrates Git's 20th Anniversay.  Is It More Famous Than Linux?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T03:13:57.280534+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T03:13:56+00:00",
        "description": "\"A modern free society has an obligation to offer electronic tax filing that respects user freedom,\" says a Free Software Foundation blog post, \"and the United States is not excluded from this responsibility.\" \n\n\"Governments, and/or the companies that they partner with, are responsible for providing free as in freedom software for necessary operations, and tax filing is no exception.\"\n\nFor many years now, a large portion of [U.S.] taxpayers have filed their taxes electronically through proprietary programs like TurboTax. Millions of taxpayers are led to believe that they have no other option than to use nonfree software or Service as a Software Substitute (SaaSS), giving up their freedom as well as their most private financial information to a third-party company, in order to file their taxes... \n\nWhile the options for taxpayers have improved slightly with the IRS's implementation of the IRS Direct File program [in 25 states], this program unfortunately does require users to hand over",
        "id": 2545494,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/12/0432222/fsf-urges-us-government-to-adopt-free-as-in-freedom-tax-filing-software?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FSF Urges US Government to Adopt Free-as-in-Freedom Tax Filing Software",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-13T02:09:18.063047+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-13T02:09:17+00:00",
        "description": "Here's an update from the Wall Street Journal about a \"widespread series of alarming cyberattacks on U.S. infrastructure.\" \n\nChina was behind it, \"Chinese officials acknowledged in a secret December meeting... according to people familiar with the matter...\"\n\nThe Chinese delegation linked years of intrusions into computer networks at U.S. ports, water utilities, airports and other targets, to increasing U.S. policy support for Taiwan, the people, who declined to be named, said... U.S. officials went public last year with unusually dire warnings about the uncovered Volt Typhoon effort. They publicly attributed it to Beijing trying to get a foothold in U.S. computer networks so its army could quickly detonate damaging cyberattacks during a future conflict. [American officials at the meeting perceived the remarks as \"intended to scare the U.S. from involving itself if a conflict erupts in the Taiwan Strait.\"] \n\nThe Chinese official's remarks at the December meeting were indirect and some",
        "id": 2545363,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/13/006221/wsj-says-china-acknowledged-its-role-in-us-infrastructure-hacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WSJ Says China 'Acknowledged Its Role in U.S. Infrastructure Hacks'",
        "vote": 0
    }
]