[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-05T18:04:08.832274+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-05T17:30:03+00:00",
        "description": "Pokemon Legends: Z-A is an evolution of its predecessor. Whilst Pokemon Legends: Arceus made strides towards open-zone world design and more streamlined Pokemon battling, Legends: Z-A is primed to shake up the series more than any earlier entry. Leading Z-A’s innovations is a switch to real-time combat, a potentially controversial change but one that has been well received by anyone who’s played the 20-minute demo. \n\nThe new system is fast, fluid, and intuitive; its inclusion might just prove a masterstroke by developer Game Freak who’ve shown a willingness to iterate heavily on the Pokemon formula for this entry. Elsewhere, the return of Mega Evolution is a sure-fire win. Gameplay will certainly be distinct, but this video will also explore the possibility that Pokemon-Trainer bonds could become the strongest they’ve ever been.",
        "id": 3741031,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=C5ZtbCk97CE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/C5ZtbCk97CE/hqdefault.jpg",
        "title": "Why Pokémon Legends: Z-A May Be the Biggest Game of the Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-05T15:42:25.108490+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-05T15:30:01+00:00",
        "description": "In case you missed it, Silent Hill f is a pretty significant success, with over one million global shipments and digital downloads. It probably doesn't seem like a big deal at first, but Konami also confirmed that it achieved this within a day, and that it's moving units at a faster rate than Silent Hill 2 remake (which took less than a week but still).\n\nWhen you consider that the publisher's other big release of the year, Metal Gear Solid Delta: Snake Eater, sold over one million units in its first day, the true significance of Silent Hill f's success becomes clearer. After all, Delta: Snake Eater was handled mostly by Konami (with assistance from Virtuos) and not only had the benefit of years of rumors and hype, but also being based on one of the greatest games of all time.",
        "id": 3740310,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=-yX1cD9hfw4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-yX1cD9hfw4/hqdefault.jpg",
        "title": "Why Are Millions of GAMERS ADDICTED To Silent Hill f?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-05T09:32:42.739958+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-05T09:30:22+00:00",
        "description": "Jurassic World Evolution 3 seems poised to be the ideal sequel. It’s got brand-new core mechanics that vary and deepen gameplay along with fresh new locations, attractions, and species. And a whole new suite of creative tools to craft the dino park you’ve always dreamed of.\n\nWhether or not it’ll execute on these ambitious additions is yet to be determined, but previews are positive. Jurassic World Evolution 3 continues where the previous game’s story left off, situating it in an interesting space within the timeline. As the October 21st launch approaches, it’s vital to know these key 15 details before spending your money.",
        "id": 3738675,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=fhtVhnik75c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fhtVhnik75c/hqdefault.jpg",
        "title": "Jurassic World Evolution 3 - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]