[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-22T16:27:56.502555+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-22T15:30:08+00:00",
        "description": "Konami has finally released Metal Gear Solid Delta: Snake Eater after so many years of hype and anticipation, and new audiences can finally experience one of the finest games of the PS2 generation in a new light. \n\nBuilt using Unreal Engine 5, the remake makes great use of modern technologies like Lumen and Nanite that all come together to create something that’s breathtaking to look at. \n\nWith this video, we will be taking a look at this remake and compare it with the original release to understand the differences between the two and also take a brief look at the loading times and performance side of things.",
        "id": 3393792,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=I05MXhiKtOI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/I05MXhiKtOI/hqdefault.jpg",
        "title": "Metal Gear Solid Delta: Snake Eater Remake vs Original FINAL Graphics Comparison - An Insane Leap",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-22T08:12:04.831017+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-22T07:15:03+00:00",
        "description": "The end result is an excellent throwback to the golden era of video games, the kind you could lose yourself in over a weekend, and it stands as a worthy revival of the saga. It is a must play experience for both fans and newcomers alike. All the fun callbacks and references have been faithfully preserved, including quirky touches like the classic trick to make Snake vomit. \n\nThere is also FOX Hunt, which is scheduled to arrive later this year, and if it delivers on its promise it will add even more value to an already strong package. This new team at Konami should feel proud of what they have accomplished, and if the game performs well, any future remake has the potential to be far more ambitious and creative. For now, Delta is a strong beginning, a statement of intent, and a heartfelt return to a franchise that has been absent for too long. With the stellar remakes of Silent Hill 2 and Metal Gear Solid 3: Snake Eater, Konami has proven they’re truly back, and I can’t wait to see what",
        "id": 3390127,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=A0Gp1JEsVXw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/A0Gp1JEsVXw/hqdefault.jpg",
        "title": "Metal Gear Solid Delta: Snake Eater Review - The Final Verdict",
        "vote": 0
    }
]