[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-04T16:23:40.676161+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-04T15:30:04+00:00",
        "description": "Now that the dust has settled and all the accolades have been earned, it's time to dive deep into the story of Kojima Productions' Death Stranding 2: On the Beach. Or, more specifically, to answer what everyone wonders with every Hideo Kojima game: How does it end? \n\nFortunately, even with its fair share of bizarre occurrences and events, the plot is a lot more straightforward and moves much quicker than the original Death Stranding. That doesn't mean it's any less bombastic or packed with revelations. If you've yet to play the sequel, be warned: There are spoilers ahead for just about every major twist and the ending itself.",
        "id": 3086404,
        "language": null,
        "link": "https://www.youtube.com/watch?v=1eBzVoNp5qI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1eBzVoNp5qI/hqdefault.jpg",
        "title": "Death Stranding 2 Ending Explained And How It Sets Up Death Stranding 3",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-04T14:12:19.131274+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-04T13:30:43+00:00",
        "description": "Teyon is coming back with a bang, bringing a shorter yet more focused version of its take on the Robocop franchise with Robocop: Rogue City Unfinished Business, a standalone expansion that pits Alex Murphy against a deadly new group of adversaries led by a new character who seems to harbor quite the grudge against the OCP.\n\nIt’s the perfect stage to bring new weapons, enemies, cool abilities, and interesting twists to the table while further fleshing out the narrative established in the base game. It’s going to be quite the ride when this new expansion brings back the iconic character for a new adventure that is sure to test his limits as both a cop and cyborg while letting players play out a power fantasy that doesn’t seem to get stale with time.",
        "id": 3085420,
        "language": null,
        "link": "https://www.youtube.com/watch?v=hC2X08GaWIM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hC2X08GaWIM/hqdefault.jpg",
        "title": "RoboCop: Rogue City - Unfinished Business DLC: 15 Things You NEED TO KNOW Before You Purchase",
        "vote": 0
    }
]