[
    {
        "age": null,
        "album": "",
        "author": "Universal Pictures",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-04T17:07:13.404277+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-04T17:01:03+00:00",
        "description": "What’s more terrifying than facing a dinosaur? Facing one while trying to protect your kids. In Jurassic World: Rebirth, Manuel García-Rulfo joins the franchise as a father caught in the ultimate survival scenario—and in this episode of Seen on the Screen, he joins Jacqueline Coley to talk about leading the franchise’s most emotional chapter yet.\n\nManuel opens up about bonding with his on-screen family, young breakout stars Audrina Miranda, Luna Blaise, and David Iacono - plus how filming in the jungles of Thailand added a raw intensity to every scene. He shares what it took to perform heart-racing stunts on land and sea (including learning to scuba dive), and how Gareth Edwards’ vision brought the franchise back to its scariest roots.\n\nJacqueline and Manuel revisit into his journey from Guadalajara to Hollywood – his breakout role in The Magnificent Seven, why his role on The Lincoln Lawyer still delights fans around the world, and how Dolores the Aquilops became one of the most memo",
        "id": 3086803,
        "language": null,
        "link": "https://www.youtube.com/watch?v=em_k6jGdw-0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 598,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCq0OueAsdxH6b8nyAspwViw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/em_k6jGdw-0/hqdefault.jpg",
        "title": "Sailing Into Danger with Manuel García-Rulfo | Seen on the Screen with Jacqueline Coley",
        "vote": 0
    }
]