[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T20:28:05.413511+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T20:00:00+00:00",
        "description": "GitHub has disabled Rockchip's Media Process Platform repository after an FFmpeg developer filed a DMCA takedown notice, nearly two years after the open-source project first publicly accused the Chinese chipmaker of license violations. The notice, filed December 18, claims Rockchip copied thousands of lines of code from FFmpeg's libavcodec library -- including decoders for H.265, AV1, and VP9 formats -- stripped the original copyright notices, falsely claimed authorship and redistributed the code under Apache's permissive license rather than the original LGPL. \n\nFFmpeg first called out Rockchip in February 2024 for \"blatantly copy and pasting FFmpeg code\" into its driver, but the chipmaker's last response suggested no intention to resolve the matter. The DMCA notice requests either removal of the infringing files or restoration of proper attribution and an LGPL-compatible license.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/",
        "id": 4412183,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/26/193244/ffmpeg-developer-files-dmca-against-rockchip-after-two-year-wait-for-license-fix",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FFmpeg Developer Files DMCA Against Rockchip After Two-Year Wait for License Fix",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T19:19:34.131730+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T18:40:00+00:00",
        "description": "Two years after generative AI was supposed to render India's $250 billion IT services industry obsolete, the sector is finding that enterprises still need someone to handle the unglamorous plumbing work that large-scale AI deployment demands. Less than 15% of organizations are meaningfully deploying the new technology, according to investment bank UBS, and Indian IT firms are positioning themselves to capture the preparatory work -- data cleanup, cloud migration, system integration -- that channel checks suggest could take two to three years before enterprise-wide AI becomes feasible. \n\nThe financials have held up better than the doomsday predictions suggested. Infosys now calls AI-led volume opportunities a bigger tailwind than the deflation threat, a reversal from 2024, and orderbooks held steady in the third quarter even as pricing pressure filtered through renewals. Infosys expects its orderbook to grow more than 50% this quarter, anchored by an NHS deal worth $1.6 billion over 15",
        "id": 4411854,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/26/1756219/indian-it-was-supposed-to-die-from-ai-instead-its-billing-for-the-cleanup",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Indian IT Was Supposed To Die From AI. Instead It's Billing for the Cleanup.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T18:18:16.548749+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T17:37:00+00:00",
        "description": "While stock investors have pushed AI-related shares to repeated highs this year, debt markets are telling a more cautious story as newer AI infrastructure companies find themselves paying significantly elevated interest rates to borrow money. Applied Digital, a data center builder, sold $2.35 billion of debt in November at a 9.25% coupon -- roughly 3.75% above similarly rated companies, or about 70% more in interest costs. The pattern has repeated across several deals. \n\nWulf Compute, a subsidiary of Bitcoin-miner-turned-data-center-operator Terawulf, raised $3.2 billion in mid-October at 7.75%, well above the 5.5% average yield for similarly rated issuers. Cipher Compute sold $1.7 billion in early November at just over 7%. CoreWeave, which rents data centers and installs computing systems for companies like OpenAI and Meta, raised $1.75 billion in July at 9%. The company's bonds have since fallen to around 90 cents on the dollar, pushing the effective yield above 12% -- nearly double",
        "id": 4411504,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/26/1737240/as-ai-companies-borrow-billions-debt-investors-grow-wary",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "As AI Companies Borrow Billions, Debt Investors Grow Wary",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T17:12:27.213735+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T16:24:00+00:00",
        "description": "While America's largest corporations are riding a wave of surging profits and AI-fueled stock market enthusiasm to record highs, small businesses across the country are cutting staff and scaling back operations as years of high inflation, cautious consumers and tariff confusion take their toll. \n\nPrivate firms with fewer than 50 workers have steadily shed jobs over the past six months, according to payroll processor ADP, cutting 120,000 positions in November alone. Midsize and large firms continued adding jobs during the same period. The divergence mirrors what's happening among American consumers. \n\nThe Federal Reserve's latest beige book noted that overall consumer spending declined further even as higher-end retail spending remained resilient. Workers at small businesses tend to earn less than those at large companies, and stock market gains from large public company shares flow mostly to wealthier Americans. Small businesses -- those with up to 500 workers -- employ nearly half th",
        "id": 4411068,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/26/1623248/the-economic-divide-between-big-and-small-companies-is-growing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Economic Divide Between Big and Small Companies Is Growing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T16:01:12.384484+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T15:08:00+00:00",
        "description": "Western carmakers retreating from electric vehicles amid softening government mandates could find themselves in a precarious position as Chinese rivals continue gaining ground in the EV market they're choosing to de-prioritize. The EU on December 16th dropped its earlier plan to ban petrol car sales outright from 2035, instead requiring carmakers to cut emissions from new vehicles by 90% from 2021 levels. The day before, Ford announced a $19.5 billion asset writedown as it rethinks its EV strategy and ends sales of the all-electric F-150 pickup. \n\nIn the U.S., the Trump administration has rolled back incentives and other measures that supported EVs. But Chinese brands controlled 10.7% of the all-electric car market in western Europe in the first ten months of 2025, up a percentage point from a year earlier, despite EU tariffs on Chinese EVs imposed in October 2024. Sales of Chinese hybrids, which aren't subject to those tariffs, have surged. EVs will eventually become the cheaper opti",
        "id": 4410626,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/26/158231/retreating-from-evs-could-be-hazardous-for-western-carmakers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Retreating From EVs Could Be Hazardous For Western Carmakers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T14:54:44.319279+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T14:05:00+00:00",
        "description": "The global smartphone and PC markets face potential contractions of up to 5.2% and 8.9% respectively in 2026, according to downside risk scenarios from IDC that trace the problem to memory chip manufacturers shifting production capacity away from consumer electronics toward AI data centers. Samsung Electronics, SK Hynix and Micron Technology have pivoted their limited cleanroom space toward high-bandwidth memory for AI servers, restricting supply of the conventional DRAM and NAND used in phones and laptops. \n\nIDC expects 2026 DRAM supply growth to hit 16% year-on-year, below historical norms. The smartphone industry's decade-long trend of bringing flagship features to affordable devices is reversing. Memory represents 15-20% of the bill of materials for mid-range phones, and thin-margin vendors like Xiaomi, Realme and Transsion will bear the brunt. Apple and Samsung have long-term supply agreements securing components up to 24 months ahead. PC vendors including Lenovo, Dell, HP, Acer ",
        "id": 4410230,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/26/144228/ais-hunger-for-memory-chips-could-shrink-smartphone-and-pc-sales-in-2026-idc-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI's Hunger For Memory Chips Could Shrink Smartphone and PC Sales in 2026, IDC Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T12:41:37.847841+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T12:31:00+00:00",
        "description": "An anonymous reader shares a report: China on Friday launched three venture capital funds to invest in \"hard technology\" areas, state broadcaster CCTV reported. The capital contribution plans for the funds have been finalised, each with more than 50 billion yuan ($7.14 billion), according to the report. The funds will primarily invest in early-stage startups and the targets should be valued at less than 500 million yuan, an official said on Friday, adding that no single investment would amount to more than 50 million yuan.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Launches+%2421+Billion+Venture+Capital+Funds+To+Invest+in+'Hard+Technology'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F12%2F26%2F0641227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory",
        "id": 4409528,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/26/0641227/china-launches-21-billion-venture-capital-funds-to-invest-in-hard-technology",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Launches $21 Billion Venture Capital Funds To Invest in 'Hard Technology'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T10:30:10.814390+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T10:01:00+00:00",
        "description": "The relentless climb in memory prices driven by the AI boom's insatiable demand for datacenter hardware has renewed an old debate about whether modern software has grown inexcusably fat, a column by the Register argues. The piece points to Windows Task Manager as a case study: the current executable occupies 6MB on disk and demands nearly 70MB of RAM just to display system information, compared to the original's 85KB footprint. \n\n\"Its successor is not orders of magnitude more functional,\" the column notes. The author draws a parallel to the 1970s fuel crisis, when energy shortages spurred efficiency gains, and argues that today's memory crunch could force similar discipline. \"Developers should consider precisely how much of a framework they really need and devote effort to efficiency,\" the column adds. \"Managers must ensure they also have the space to do so.\" \n\nThe article acknowledges that \"reversing decades of application growth will not happen overnight\" but calls for toolchains to",
        "id": 4408872,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/26/0628235/memory-is-running-out-and-so-are-excuses-for-software-bloat",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Memory is Running Out, and So Are Excuses For Software Bloat'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T07:23:33.664959+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T07:00:00+00:00",
        "description": "Michael Truell, the 25-year-old CEO and cofounder of Cursor, is drawing a sharp distinction between careful AI-assisted development and the more hands-off approach commonly known as \"vibe coding.\" Speaking at a conference, Truell described vibe coding as a method where users \"close your eyes and you don't look at the code at all and you just ask the AI to go build the thing for you.\" He compared it to constructing a house by putting up four walls and a roof without understanding the underlying wiring or floorboards. The approach might work for quickly mocking up a game or website, but more advanced projects face real risks. \n\n\"If you close your eyes and you don't look at the code and you have AIs build things with shaky foundations as you add another floor, and another floor, and another floor, and another floor, things start to kind of crumble,\" Truell said. Truell and three fellow MIT graduates created Cursor in 2022. The tool embeds AI directly into the integrated development envir",
        "id": 4408201,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/26/0623233/cursor-ceo-warns-vibe-coding-builds-shaky-foundations-that-eventually-crumble",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cursor CEO Warns Vibe Coding Builds 'Shaky Foundations' That Eventually Crumble",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T05:20:10.040914+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T04:30:00+00:00",
        "description": "Apple's Developer Academy in Detroit has spent roughly $30 million over four years training hundreds of people to build iPhone apps, but not everyone lands coding jobs right away, according to a WIRED story published this week. \n\nThe program launched in 2021 as part of Apple's $200 million response to the Black Lives Matter protests and costs an estimated $20,000 per student -- nearly twice what state and local governments budget for community colleges. About 600 students have completed the 10-month course at Michigan State University. Academy officials say 71% of graduates from the past two years found full-time jobs across various industries. \n\nThe program provides iPhones, MacBooks and stipends ranging from $800 to $1,500 per month, though one former student said many participants relied on food stamps. Apple contributed $11.6 million to the academy. Michigan taxpayers and the university's regular students covered about $8.6 million -- nearly 30% of total funding. Two graduates sai",
        "id": 4407836,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/26/041227/apples-app-course-runs-20000-a-student-is-it-really-worth-it",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's App Course Runs $20,000 a Student. Is It Really Worth It?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T02:05:22.721739+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T01:55:00+00:00",
        "description": "Google appears to be testing a feature that would let users change their @gmail.com address for the first time, according to an official support document. The support page exists only in Hindi, suggesting an India-first rollout, and Google notes that users will \"gradually begin to see this option.\" \n\nThe feature would let users switch to a new @gmail address while retaining full access to their old one, effectively giving a single account two working email addresses. Emails sent to either address would arrive in the same inbox, and existing data in Drive and Photos would remain unaffected. Users who switch cannot register another new address for 12 months. Google has not officially announced the feature.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Gmail+Users+May+Soon+Be+Able+To+Change+Their+Email+Address+and+Keep+the+Old+One%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F12%2F26%2F0155213%2F%3Futm_source%3Dtwit",
        "id": 4407282,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/26/0155213/gmail-users-may-soon-be-able-to-change-their-email-address-and-keep-the-old-one",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gmail Users May Soon Be Able To Change Their Email Address and Keep the Old One",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T01:04:18.186443+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T00:39:00+00:00",
        "description": "Apple has agreed to a settlement with Brazil's antitrust regulator that will require the company to allow third-party app stores on iPhones and permit developers to direct users to external payment options, marking another country where Apple's tightly controlled App Store model is being pried open by government action. \n\nBrazil's Administrative Council of Economic Defense approved the settlement this week, resolving an investigation that began in 2022 into whether Apple's restrictions on app distribution and payments limited competition. Under the new rules, developers can offer third-party payment methods within their apps alongside Apple's own system. The fee structure varies: purchases through Apple's system remain subject to a 10% or 25% commission plus a 5% transaction fee. Apps that include a clickable link to external payment will face a 15% fee, while static text directing users elsewhere incurs no charge. Third-party app stores will pay a 5% Core Technology Commission.<p><di",
        "id": 4406986,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/26/0039248/apple-settles-brazilian-antitrust-case-must-allow-third-party-app-stores-and-external-payment-links",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Settles Brazilian Antitrust Case, Must Allow Third-Party App Stores and External Payment Links",
        "vote": 0
    }
]