[
    {
        "age": null,
        "album": "",
        "author": "The Spiffing Brit",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-26T19:05:58.804968+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-26T17:57:28+00:00",
        "description": "Welcome to the greatest game of all time! Or at least it is if you look at the amount of hours I have added to my steam account in the last few weeks. I am of course talking about Europa Universalis V! So what is EU5, rather simply this game is a 4X grand strategy game set between 5 centuries of human history starting in the late medieval leading into things like the renaissance and era of exploration filled with colonisation and discovery. Paradox on steam describe the game as so: Use war, trade or diplomacy to satisfy your grandest ambitions and dominate five centuries of history in the newest version of Europa Universalis, Paradox Interactive's flagship historical grand strategy game.\n\nI think its a pretty darn accurate representation of the game as trade war and diplomacy make up the foundational pillars of this strategy game. However today I am not intending to play the game in a way that was intended. \n\nYou Can Purchase the game here: https://paradoxinteractive.i38e.net/6y4ovq\n(",
        "id": 4411768,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=j7YaUqF0hM0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 764,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCRHXUZ0BxbkU2MYZgsuFgkQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/j7YaUqF0hM0/hqdefault.jpg",
        "title": "Can The Spiffing Brit Beat EU5 As A Tiny Island - Europa Universalis 5 Is A Perfectly Balanced Game",
        "vote": 0
    }
]