[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-06T18:02:54.559967+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-06T17:00:42+00:00",
        "description": "Remakes and remasters continue to release, regardless of trends, but it's not often that we come across revivals of long-dormant franchises, especially in brand-new sequels. It's even less common that they're side-scrolling action platformers, like the Shinobi franchise.\n\nAnd yet, as he lives and breathes, Joe Musashi has returned to save the world, once more in Shinobi: Art of Vengeance. Launching on August 29th for every platform (except the Switch 2), the story sees Musashi and his allies battling ENE Corp, led by the enigmatic Ruse. After conquering the rest of the world's armies, they set their sights on Oboro Village, which spurs Musashi into action.\n\nOver a dozen stages with multiple boss fights, various ninjutsu and ninpo, and new mechanics like Shinobi Execution dot the gameplay. However, the core platforming and combat remain as endearingly comfortable (and challenging) as expected. Here are 15 things you need to know about Shinobi: Art of Vengeance and why it's worth pickin",
        "id": 3267970,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=RItOwnYrZPg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RItOwnYrZPg/hqdefault.jpg",
        "title": "Shinobi Is Coming Back After 14 YEARS - Here's Everything You Need To Know About Art of Vengeance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-06T13:42:54.134228+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-06T13:30:48+00:00",
        "description": "Konami Entertainment has been quite emphatic about retaining what made Metal Gear Solid 3 special while also bringing creative new flourishes to the table in Metal Gear Solid Delta: Snake Eater, the highly anticipated remake of the original game. It can be tricky to balance what made the original game such a cult classic with features that appeal to a modern audience but Konami has largely seemed up to the task in its valiant effort. \n\nFrom entirely different points of view while exploring levels to new ways to access your equipment, the studio has drawn on the best titles from its franchise to blend a visual overhaul with modern features that can be quite a \"thrill\" for both newcomers and veterans alike. \n\nNaked Snake's iconic origin story could feel like a whole new game when the remake releases this August for current-gen platforms.",
        "id": 3265538,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=pOFuPTtHPhM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pOFuPTtHPhM/hqdefault.jpg",
        "title": "Metal Gear Solid: Delta Snake Eater vs. Original - 15 BIGGEST Changes You Need To Know",
        "vote": 0
    }
]