[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T22:54:20+00:00",
        "description": "Long-time Slashdot reader sandbagger brings news that in June \"a rare screening of the original 1977 Star Wars movie &mdash; complete with Han shooting first &mdash; will be shown at a theater in London...\" \n\n Petapixel reports:\n\n\nSubsequent alterations made to the film are well-documented: Han Solo being shot at by the bounty hunter Greedo first, rather than the original in which anti-hero Han killed Greedo without being shot at. Then there is the addition of a CGI Jabba the Hutt who was only mentioned by name in the 1977 release. Fans have also complained about the color grading painted on re-releases. \n\n\nBut for those attending the British Film Institute (BFI)'s Film on Film festival in London, they are in for a treat. Star Wars will play not once but twice on the opening night on June 12... BFI says the print is \"unfaded\" and \"ready to transport us to a long time ago, and a galaxy far, far away, back to the moment in 1977 when George Lucas's vision cast a spell on cinema audiences",
        "id": 2544798,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/12/2134212/original-1977-star-wars-cut-will-be-shown-at-a-theater-for-first-time-in-decades?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Original 1977 'Star Wars' Cut Will Be Shown at a Theater for First Time in Decades",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T21:51:36+00:00",
        "description": "America's Justice Department \"has shut down its unit that investigates cryptocurrency fraud,\" reports USA Today. \n\nA Monday night memo from U.S. Deputy Attorney General Todd Blanche said the shut down was \"effective immediately.\"\n\nBlanche directed the closure of the National Cryptocurrency Enforcement Team and ordered prosecutors to pivot to investigating transnational criminal organizations and terrorist groups that use crypto to engage in illicit transactions... In his four-page memo, Blanche said the new order was meant to bring the Justice Department in line with Trump's own Executive Order 14178, which decreed that clarity and certainty regarding enforcement policy \"are essential to supporting a vibrant and inclusive digital economy and innovation in digital assets.\" Blanche, one of several Trump criminal defense lawyers at the top ranks of DOJ, said the president \"has also made clear that '[w]e are going to end the regulatory weaponization against digital assets'...\" \n\nConsisten",
        "id": 2544594,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/12/1722247/americas-justice-department-shuts-down-its-cryptocurrency-fraud-unit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's Justice Department Shuts Down Its Cryptocurrency Fraud Unit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T21:51:36+00:00",
        "description": "Slashdot reader king*jojo shared this article from The Register:\n\nA 23-year-old side-channel attack for spying on people's web browsing histories will get shut down in the forthcoming Chrome 136, released last Thursday to the Chrome beta channel. At least that's the hope. \n\nThe privacy attack, referred to as browser history sniffing, involves reading the color values of web links on a page to see if the linked pages have been visited previously... Web publishers and third parties capable of running scripts, have used this technique to present links on a web page to a visitor and then check how the visitor's browser set the color for those links on the rendered web page... The attack was mitigated about 15 years ago, though not effectively. Other ways to check link color information beyond the getComputedStyle method were developed... Chrome 136, due to see stable channel release on April 23, 2025, \"is the first major browser to render these attacks obsolete,\" explained Kyra Seevers, G",
        "id": 2544593,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/12/2054251/chrome-to-patch-decades-old-browser-history-sniffing-flaw-that-let-sites-peek-at-your-history?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chrome To Patch Decades-Old 'Browser History Sniffing' Flaw That Let Sites Peek At Your History",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T20:45:30+00:00",
        "description": "Black holes \"often exhibit long periods of dormancy,\" writes Popular Science, adding that astronomers had never witnessed a black hole \"wake up\" in real time. \"Until now...\" \n\nIn February of 2024 X-ray bursts were spotted coming out of a black hole named Ansky by Lorena Hern&aacute;ndez-Garc&iacute;a at Chile's Valparaiso University, according to the article. And what astronomers have now seen \"challenges prevailing theories about black hole lifecycles.\"\n\n Hern&aacute;ndez-Garc&iacute;a and collaborators then determined the black hole was displaying a phenomenon known as a quasiperiodic eruption, or QPE [a short-lived flaring event...] While a black hole inevitably destroys everything it captures, objects behave differently during their impending demise. A star, for example, generally stretches apart into a bright, hot, fast-spinning disc known as an accretion disc. Most astronomers have theorized that black holes generate QPEs when a comparatively small object like a star or even a s",
        "id": 2544297,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/12/1928248/for-the-first-time-astronomers-watch-a-black-hole-wake-up-in-real-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "For the First Time Astronomers Watch a Black Hole 'Wake Up' in Real-Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T19:07:11+00:00",
        "description": "People \"are likely to continue working full-time\t even if they receive no-strings-attached universal basic income payments,\" reports CNN, citing results from a recent experiment in Germany (discussed on Slashdot in 2020):\n\nMein Grundeinkommen (My Basic Income), the Berlin-based non-profit that ran the German study, followed 122 people for three years. From June 2021 to May 2024, this group received an unconditional sum of &euro;1,200 ($1,365) per month. The study focused on people aged between 21 and 40 who lived alone and already earned between 1,100 euros (around $1,250) and 2,600 euros ($2,950) a month. They were free to use the extra money from the study on anything they wanted. Over the course of three years, the only condition was that they had to fill out a questionnaire every six months that asked about different areas of their lives, including their financial situation, work patterns, mental well-being and social engagement. \n\n\nOne concern voiced by critics is that receiving",
        "id": 2543900,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/12/0351222/germanys-universal-basic-income-experiment-proves-it-doesnt-encourage-unmployment?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Germany's 'Universal Basic Income' Experiment Proves It Doesn't Encourage Unmployment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T18:02:01+00:00",
        "description": "The Washington Post reports:\n\nThe United States urgently needs more energy to fuel an artificial intelligence race with China that the country can't afford to lose, industry leaders told lawmakers at a House hearing on Wednesday. \"We need energy in all forms,\" said Eric Schmidt, former CEO of Google, who now leads the Special Competitive Studies Project, a think tank focused on technology and security. \"Renewable, nonrenewable, whatever. It needs to be there, and it needs to be there quickly.\" It was a nearly unanimous sentiment at the four-hour-plus hearing of the House Energy and Commerce Committee, which revealed bipartisan support for ramping up U.S. energy production to meet skyrocketing demand for energy-thirsty AI data centers. \n\nThe hearing showed how the country's AI policy priorities have changed under President Donald Trump. President Joe Biden's wide-ranging 2023 executive order on AI had sought to balance the technology's potential rewards with the risks it poses to work",
        "id": 2543581,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/12/0633243/ai-industry-tells-us-congress-we-need-energy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Industry Tells US Congress:  'We Need Energy'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T16:56:12+00:00",
        "description": "Skype is shutting down after two decades on May 5th, notes the Washington Post. \nBut the bigger problem for retired attorney Karen Griffin is that Microsoft won't refund the money they paid into a Skype account for cheap international phone calls:\n\n\"They're no longer offering this service that I prepaid for, and now they're not giving me my money back,\" Griffin said. \"There's a lot of people out there who are going to lose money....\" \n\nTo its credit, Microsoft gave Skype users a couple months' warning about the shutdown coming May 5. People can transfer Skype contacts and chat history to the company's Microsoft Teams chat-and-calling app or to other companies' services. (While Microsoft sells Teams to organizations, there's a free version for personal use.) But Microsoft didn't explain well what will happen to money that people like Griffin have parked in Skype accounts, in some cases for years.... Unless you bought Skype credits very recently, Microsoft said it won't refund money in",
        "id": 2543266,
        "language": null,
        "link": "https://slashdot.org/story/25/04/12/027252/microsoft-is-killing-skype---and-refusing-refunds-for-prepaid-international-calls?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft is Killing Skype - and Refusing Refunds for Prepaid International Calls",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T15:51:13+00:00",
        "description": "Smartphones, computer monitors, semiconductors, and various other electronics will be exempt from U.S. President Trump's tariffs, reports CNN, \"according to a US Customs and Border Protection notice posted late Friday.\" \n\nAnd several other products also received an exemption which \"applies to products entering the United States or removed from warehouses as early as April 5, according to the notice.\"\n\n\nRoughly 90% of Apple's iPhone production and assembly is based in China, according to Wedbush Securities' estimates. Counterpoint Research, a firm that monitors global smartphone shipments, estimated Apple has up to six weeks of inventory in the United States. Once that supply runs out, prices would have been expected to go up... \n\nSemiconductors and microchips are among the products heavily outsourced to factories in Asia due to lower costs. Those electronic parts are now exempt, according to the Friday notice. That could help Asian chipmakers, such as Taiwan Semiconductor Manufacturi",
        "id": 2542882,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/12/1539244/trump-tariffs-add-exemptions-friday-night-for-smartphones-and-other-electronics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Tariffs Add Exemptions Friday Night for Smartphones and Other Electronics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T14:46:41+00:00",
        "description": "A former Facebook employee/whistleblower alleges Meta's AI model Lllama was used to help DeepSeek. \n\nThe whistleblower &mdash; former Facebook director of global policy Sarah Wynn-Williams &mdash; testified before U.S. Senators on Wednesday. CBS News found this earlier response from Meta:\n\nIn a statement last year on Llama, Meta spokesperson Andy Stone wrote, \"The alleged role of a single and outdated version of an American open-source model is irrelevant when we know China is already investing over 1T to surpass the US technologically, and Chinese tech companies are releasing their own open AI models as fast, or faster, than US ones.\" \n\nWynn-Williams encouraged senators to continue investigating Meta's role in the development of artificial intelligence in China, as they continue their probe into the social media company founded by Zuckerberg. \"The greatest trick Mark Zuckerberg ever pulled was wrapping the American flag around himself and calling himself a patriot and saying he didn",
        "id": 2542558,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/12/067219/facebook-whistleblower-alleges-metas-ai-model-llama-was-used-to-help-deepseek?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Facebook Whistleblower Alleges Meta's AI Model Llama Was Used to Help DeepSeek",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T12:34:39+00:00",
        "description": "Abstract of a paper on NBER: There is much disagreement about the extent to which financial incentives motivate study participants. We elicit preferences for being paid for completing a survey, including a one-in-twenty chance of winning a $100 electronic gift card, a guaranteed electronic gift card with the same expected value, and an option to refuse payment. More than twice as many participants chose the lottery as chose the guaranteed payment. Given that most people are risk averse, this pattern suggests that factors beyond risk preferences -- such as hassle costs -- influenced their decision-making. Almost 20 percent of participants actively refused payment, demonstrating low monetary motivation. We find both systematic and unobserved heterogeneity in the characteristics of who turned down payment. The propensity to refuse payment is more than four times as large among individuals 50 and older compared to younger individuals, suggesting a tradeoff between financially motivating ",
        "id": 2541902,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/12/125242/leaving-money-on-the-table?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Leaving Money on the Table",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T08:11:45+00:00",
        "description": "Facebook Marketplace has emerged as the dominant feature within the social media platform, amassing 1.2 billion monthly active buyers by 2023 and overtaking eBay as a peer-to-peer selling platform. According to recent data, approximately 16 percent of Facebook's monthly active users now access the site exclusively to participate in Marketplace. \n\nThe feature's growth accelerated following the pandemic's supply chain disruptions and subsequent inflation, which increased demand for used goods. Facebook reports that Marketplace is attracting younger demographics who have otherwise abandoned the platform's social features. \n\nThis shift represents a fundamental transformation of Facebook's core function from \"digital connector\" to \"digital bazaar,\" with the platform increasingly hosting transactions rather than social connections.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Facebook+Is+Just+Craigslist+Now%3A+https%3A",
        "id": 2540826,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/12/0720212/facebook-is-just-craigslist-now?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Facebook Is Just Craigslist Now",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T04:54:18+00:00",
        "description": "Adobe has deleted all its posts on Twitter-alternative Bluesky after a disastrous April 8 debut that drew over 1,600 angry comments from digital creators. The software giant's innocuous first post asking \"What's fueling your creativity right now?\" triggered immediate criticism targeting Adobe's controversial subscription model, continual price increases, and AI implementation. \n\n\"Y'all keep raising your prices for a product that keeps getting worse,\" wrote one user, while another referenced Adobe's \"subscription model\" with \"I assume you'll be charging us monthly to read your posts.\" Recent price hikes have been substantial, with one commenter reporting a 53.88% increase from CDN$14.68 to CDN$22.59 monthly.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Adobe+Retreats+from+Bluesky+After+Massive+User+Backlash%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F12%2F026211%2F%3Futm_source%3Dtwitter%26utm_medium%3D",
        "id": 2540244,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/12/026211/adobe-retreats-from-bluesky-after-massive-user-backlash?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Adobe Retreats from Bluesky After Massive User Backlash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T02:44:48+00:00",
        "description": "An anonymous reader shares a report: The number of European travellers visiting the US has fallen sharply as political and economic tension and fears of a hostile border under President Donald Trump threaten the world's most lucrative air routes. \n\nVisitors from western Europe who stayed at least one night in the US fell by 17 per cent in March from a year ago, according to the International Trade Administration. Travel from some countries -- including Ireland, Norway and Germany -- fell by more than 20 per cent, an FT analysis of ITA data showed. \n\nThe trend poses a threat to the US tourism industry, which accounts for 2.5 per cent of the country's GDP. Some airlines and hotel groups have warned of waning demand for transatlantic travel and a \"bad buzz\" about visiting the US. The total number of overseas visitors travelling to the US dropped by 12 per cent year-on-year in March, the steepest decline since March 2021 when the travel sector was reeling from pandemic restrictions, acco",
        "id": 2539949,
        "language": null,
        "link": "https://slashdot.org/story/25/04/12/0145241/european-tourism-to-us-plunges?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "European Tourism To US Plunges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T01:39:41+00:00",
        "description": "A group of ex-OpenAI employees on Friday filed a proposed amicus brief in support of Elon Musk in his lawsuit against OpenAI, opposing OpenAI's planned conversion from a nonprofit to a for-profit corporation. From a report: The brief, filed by Harvard law professor and Creative Commons founder Lawrence Lessig, names 12 former OpenAI employees: Steven Adler, Rosemary Campbell, Neil Chowdhury, Jacob Hilton, Daniel Kokotajlo, Gretchen Krueger, Todor Markov, Richard Ngo, Girish Sastry, William Saunders, Carrol Wainwright, and Jeffrey Wu. It makes the case that, if OpenAI's non-profit ceded control of the organization's business operations, it would \"fundamentally violate its mission.\" \n\nSeveral of the ex-staffers have spoken out against OpenAI's practices publicly before. Krueger has called on the company to improve its accountability and transparency, while Kokotajlo and Saunders previously warned that OpenAI is in a \"reckless\" race for AI dominance. Wainwright has said that OpenAI \"sho",
        "id": 2539741,
        "language": null,
        "link": "https://slashdot.org/story/25/04/12/010247/ex-openai-staffers-file-amicus-brief-opposing-the-companys-for-profit-transition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ex-OpenAI Staffers File Amicus Brief Opposing the Company's For-Profit Transition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T00:35:22+00:00",
        "description": "The International Civil Aviation Organization plans to eliminate boarding passes and check-ins within three years through a new \"digital travel credential\" system. Passengers will store passport data on their phones and use facial recognition to move through airports, while airlines will automatically detect arrivals via biometric scanning. \n\nThe system will dynamically update \"journey passes\" for flight changes and delays, potentially streamlining connections. \"The last upgrade of great scale was the adoption of e-ticketing in the early 2000s,\" said Valerie Viale from travel technology company Amadeus, who noted passenger data will be deleted within 15 seconds at each checkpoint to address privacy concerns.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Air+Travel+Set+for+Biggest+Overhaul+in+50+Years+With+UN-Backed+Digital+Credentials%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F11%2F2158204%2F%3Futm_sou",
        "id": 2539530,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/11/2158204/air-travel-set-for-biggest-overhaul-in-50-years-with-un-backed-digital-credentials?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Air Travel Set for Biggest Overhaul in 50 Years With UN-Backed Digital Credentials",
        "vote": 0
    }
]