[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T15:30:30+00:00",
        "description": "It has been far too long since we got a new Uncharted, with Naughty Dog’s beloved action adventure series last having seen a new entry nearly a decade ago, in 2017, with The Lost Legacy. Few other Uncharted-esque titles have graced PlayStation in the time since then, but thankfully for those who have a longing for that style of thrilling, bombastic, globe-trotting, treasure hunting experience, there’s something to focus your attention on. \n\nMachineGames and Xbox’s Indiana Jones and the Great Circle launches soon for PS5, and though there are many obvious ways it differs from the Uncharted experience, it also strikes a lot of the same cords. Fans of Naughty Dog’s dormant franchise owe it to themselves to check it out.",
        "id": 2542901,
        "language": null,
        "link": "https://www.youtube.com/watch?v=jNClkgpA_hg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jNClkgpA_hg/hqdefault.jpg",
        "title": "No New Uncharted? Indiana Jones And The Great Circle Might Scratch That Itch On PS5",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-12T09:30:16+00:00",
        "description": "There are plenty of games out there that take their sweet time to get going and show you just what they’re really made of before cementing themselves as unabashed masterpieces. \n\nBut while there’s no hard and fast rule that demands that, it is undeniable that there’s something special about games that show their hand right away, putting all (or most) of their biggest strengths on full display right off the bat, whether that’s through storytelling that instantly grabs attention or with gameplay mechanics and systems that waste no time in getting their hooks into you. \n\nHere, we’re going to discuss a few titles that do just that and make an incredibly strong first impression.",
        "id": 2541376,
        "language": null,
        "link": "https://www.youtube.com/watch?v=css5VGwWblU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/css5VGwWblU/hqdefault.jpg",
        "title": "15 Games You Will Be OBSESSED WITH WITHIN THE FIRST HOUR",
        "vote": 0
    }
]