[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T16:10:37.453696+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T15:30:18+00:00",
        "description": "Konami’s upcoming remake of a classic title in its Metal Gear Solid franchise carries the hopes of both the Japanese giant and fans of Big Boss’ adventures alike. It would be an absolute treat to see the origin story of one of modern gaming’s most iconic villains brought to life with a dash of current-gen goodness, after all.\n\nHowever, with only two months to go till Metal Gear Solid Delta: Snake Eater is in our hands, and a troubling lack of deep dive footage from Konami, fans are left wondering if the studio has something to hide. Fortunately, the solution to this quandary is a simple one, and we hope Konami sees that in time.",
        "id": 3035454,
        "language": null,
        "link": "https://www.youtube.com/watch?v=_jM-Giafk-k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_jM-Giafk-k/hqdefault.jpg",
        "title": "Metal Gear Solid Delta: Snake Eater: Where The Hell Is The Gameplay?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T14:00:37.420217+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T13:30:48+00:00",
        "description": "The recent spotlight was serviceable, but it offered some interesting new revelations for the next game in the Resident Evil franchise: Resident Evil Requiem, launching on February 27th, 2026, for Xbox Series X/S, PS5, and PC.\n\nFirst, there was the reveal that the story takes place about 30 years after the destruction of Raccoon City, placing it in the year 2028. Alongside confirming that the team experimented with online and open-world mechanics for the sequel, the developer also revealed that the team wanted Leon S. Kennedy as the protagonist. Unfortunately, he doesn't seem like a good fit for horror, and Requiem wants to dial up the fear factor.\n\nEnter Grace Ashcroft, an FBI agent described as an ordinary individual who's introverted and easily frightened. However, she can still wield a firearm and analyze the situation to find a way out. Why did the developer return to Raccoon City, and how is Resident Evil Requiem a \"eulogy\"? Find out everything here.",
        "id": 3034202,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ksMU77SpzBA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ksMU77SpzBA/hqdefault.jpg",
        "title": "Resident Evil 9 Requiem - 10 NEW Things You May NOT Know",
        "vote": 0
    }
]