[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T23:16:51.967865+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T23:00:00+00:00",
        "description": "Federal Reserve Chair Jerome Powell told the U.S. Senate that while AI hasn't yet dramatically impacted the economy or labor market, its transformative effects are inevitable -- though the timeline remains uncertain. The Register reports: Speaking to the US Senate Banking Committee on Wednesday to give his semiannual monetary policy report, Powell told elected officials that AI's effect on the economy to date is \"probably not great\" yet, but it has \"enormous capabilities to make really significant changes in the economy and labor force.\" Powell declined to predict how quickly that change could happen, only noting that the final few leaps to get from a shiny new technology to practical implementation can be a slow one.\n \n\"What's happened before with technology is that it seems to take a long time to be implemented,\" Powell said. \"That last phase has tended to take longer than people expect.\" AI is likely to follow that trend, Powell asserted, but he has no idea what sort of timeline th",
        "id": 3038552,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/27/2044239/fed-chair-powell-says-ai-is-coming-for-your-job?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fed Chair Powell Says AI Is Coming For Your Job",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T23:16:52.179610+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T22:20:00+00:00",
        "description": "An anonymous reader quotes a report from UploadVR: Software developer Stijn Spanhove used the newest SDK features of Snap OS to build a prototype of [a real-world ad blocker for Snap Spectacles]. If you're unfamiliar, Snap Spectacles are a bulky AR glasses development kit available to rent for $99/month. They run Snap OS, the company's made-for-AR operating system, and developers build apps called Lenses for them using Lens Studio or WebXR.\n \nSpanhove built the real-world ad blocker using the new Depth Module API of Snap OS, integrated with the vision capability of Google's Gemini AI via the cloud. The Depth Module API caches depth frames, meaning that coordinate results from cloud vision models can be mapped to positions in 3D space. This enables detecting and labeling real-world objects, for example. Or, in the case of Spanhove's project, projecting a red rectangle onto real-world ads.\n \nHowever, while the software approach used for Spanhove's real-world ad blocker is sound, two fun",
        "id": 3038553,
        "language": null,
        "link": "https://slashdot.org/story/25/06/27/2038221/a-developer-built-a-real-world-ad-blocker-for-snap-spectacles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Developer Built a Real-World Ad Blocker For Snap Spectacles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T22:11:52.929176+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T21:40:00+00:00",
        "description": "Facebook is prompting users to opt into a feature that uploads photos from their camera roll -- even those not shared on the platform -- to Meta's servers for AI-driven suggestions like collages and stylized edits. While Meta claims the content is private and not used for ads, opting in allows the company to analyze facial features and retain personal data under its broad AI terms, raising privacy concerns. TechCrunch reports: The feature is being suggested to Facebook users when they're creating a new Story on the social networking app. Here, a screen pops up and asks if the user will opt into \"cloud processing\" to allow creative suggestions. As the pop-up message explains, by clicking \"Allow,\" you'll let Facebook generate new ideas from your camera roll, like collages, recaps, AI restylings, or photo themes. To work, Facebook says it will upload media from your camera roll to its cloud (meaning its servers) on an \"ongoing basis,\" based on information like time, location, or themes.\n",
        "id": 3038280,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/27/1954211/facebook-is-asking-to-use-meta-ai-on-photos-in-your-camera-roll-you-havent-yet-shared?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Facebook Is Asking To Use Meta AI On Photos In Your Camera Roll You Haven't Yet Shared",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T21:06:59.290493+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T21:00:00+00:00",
        "description": "In a year when average air temperatures consistently breached the 1.5C warming threshold, global CO&#226;-equivalent emissions from energy rose by 1%, marking yet another record, the fourth in as many years. From a report: Wind and solar energy alone expanded by an impressive 16% in 2024, nine times faster than total energy demand. Yet this growth did not fully counterbalance rising demand elsewhere, with total fossil fuel use growing by just over 1%, highlighting a transition defined as much by disorder as by progress. \n\nCrude oil demand in OECD countries remained flat, following a slight decline in the previous year. In contrast, non-OECD countries, where much of the world's energy demand growth is concentrated and fossil fuels continue to play a dominant role, saw oil demand rise by 1%. Notably, Chinese crude oil demand fell in 2024 by 1.2%, indicating that 2023 may have reached a peak. Elsewhere, global natural gas demand rebounded, rising by 2.5% as gas markets rebalanced after t",
        "id": 3037876,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/27/1956207/renewables-soar-but-fossil-fuels-continue-to-rise-as-global-electricity-demand-hits-record-levels?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Renewables Soar, But Fossil Fuels Continue To Rise as Global Electricity Demand Hits Record Levels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T21:06:59.502298+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T20:20:00+00:00",
        "description": "Germany's data protection commissioner has urged Apple and Google to remove Chinese AI startup DeepSeek from their app stores due to concerns about data protection. Reuters reports: Commissioner Meike Kamp said in a statement on Friday that she had made the request because DeepSeek illegally transfers users' personal data to China. The two U.S. tech giants must now review the request promptly and decide whether to block the app in Germany, she added, though her office has not set a precise timeframe. According to its own privacy policy, DeepSeek stores numerous pieces of personal data, such as requests to its AI program or uploaded files, on computers in China.\n \n\"DeepSeek has not been able to provide my agency with convincing evidence that German users' data is protected in China to a level equivalent to that in the European Union,\" [Commissioner Meike Kamp] said. \"Chinese authorities have far-reaching access rights to personal data within the sphere of influence of Chinese companies",
        "id": 3037877,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/27/1949207/deepseek-faces-ban-from-apple-google-app-stores-in-germany?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DeepSeek Faces Ban From Apple, Google App Stores In Germany",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T20:01:56.890580+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T19:40:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Canada is proceeding with its digital services tax on technology companies such as Meta despite a Group of Seven agreement that resulted in removing the Section 899 \"revenge tax\" proposal from U.S. President Donald Trump's tax bill. The first payment for Canada's digital tax is still due Monday, the country's Finance Department confirmed, and covers revenue retroactively to 2022. The tax is three percent of the digital services revenue a firm makes from Canadian users above $20 million in a calendar year.\n \nKeeping the digital tax will not affect the G7 agreement, which focuses on global minimum taxes, the Finance Department said. The Section 899 provision would have targeted companies and investors from countries that the U.S. determines are unfairly taxing American companies. [...] Finance Minister Francois-Philippe Champagne suggested to reporters last week that the digital tax may be negotiated as part of broader, ongoing U.S.-Ca",
        "id": 3037428,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/27/1935258/canadas-digital-services-tax-to-stay-in-place-despite-g7-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Canada's Digital Services Tax To Stay In Place Despite G7 Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T18:57:06.411422+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T18:01:00+00:00",
        "description": "Android 16 will include a new security feature that warns users when their phones connect to fake cell towers designed for surveillance. The \"network notification\" setting alerts users when devices connect to unencrypted networks or when networks request phone identifiers, helping protect against \"stingray\" devices that mimic legitimate cell towers to collect data and force phones onto insecure communication protocols.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Android+16+Will+Tell+You+When+Fake+Cell+Towers+Try+To+Track+Your+Phone%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F27%2F1737221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F27%2F1737221%2Fandroid-16-will-tell-you-when-fake-cell-towers-try-to-track-your-phone%3Futm_so",
        "id": 3036981,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/27/1737221/android-16-will-tell-you-when-fake-cell-towers-try-to-track-your-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Android 16 Will Tell You When Fake Cell Towers Try To Track Your Phone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T17:52:01.135766+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T17:20:00+00:00",
        "description": "The Supreme Court ruled Friday that the FCC's Universal Service Fund can continue operating, rejecting claims that the program's funding mechanism violates the Constitution. In a 6-3 decision written by Justice Elena Kagan, the court found that Congress did not exceed its authority when it enacted the 1996 law establishing the fund and that the FCC could delegate administration to a private corporation. The Universal Service Fund subsidizes telecommunications services for low-income consumers, rural health care providers, schools and libraries through fees generally passed on to customers that raise billions of dollars annually. \n\nThe program is administered by the Universal Service Administrative Company, a nonprofit the FCC designated to run the fund. Conservative advocacy group Consumers' Research challenged the structure, arguing that \"a private company is taxing Americans in amounts that total billions of dollars every year, under penalty of law, without true governmental account",
        "id": 3036445,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/27/1718259/supreme-court-rejects-challenge-to-fcc-broadband-subsidy-program?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Supreme Court Rejects Challenge To FCC Broadband Subsidy Program",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T16:47:00.649616+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T16:40:00+00:00",
        "description": "Brazil's supreme court has ruled that social media platforms can be held legally responsible for their users' posts. From a report: Companies such as Facebook, TikTok and X will have to act immediately to remove material such as hate speech, incitement to violence or \"anti-democratic acts,\" even without a prior judicial takedown order, as a result of the decision in Latin America's largest nation late on Thursday.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Brazil+Supreme+Court+Rules+Digital+Platforms+Are+Liable+For+Users'+Posts%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F27%2F0624226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F27%2F0624226%2Fbrazil-supreme-court-rules-digital-platforms-are-liable-for-users-posts%3Futm_sour",
        "id": 3035906,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/27/0624226/brazil-supreme-court-rules-digital-platforms-are-liable-for-users-posts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Brazil Supreme Court Rules Digital Platforms Are Liable For Users' Posts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T16:47:00.855485+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T16:01:00+00:00",
        "description": "theodp writes: FWD.us, the immigration and criminal justice-focused nonprofit of Meta CEO Mark Zuckerberg -- the world's third richest person, according to Forbes with an estimated $250B net worth -- has released a new research report warning that announced immigration policies will hurt American families, who can't afford it with their meager savings. \n\nThe report begins: \"Inflation remains a top concern for the majority of Americans. But new immigration policies announced by President Trump, and already underway, such as revoking immigrant work permits, deporting millions of people, and limiting legal immigration, would directly undermine the goal to level out, or even lower, the costs of everyday and essential goods and services. In fact, all Americans, particularly working-class families, are about to unnecessarily see prices for goods and services like food and housing increase substantially again, above and beyond other economic policies like global tariffs that could also raise",
        "id": 3035907,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/27/1322241/zuckerbergs-advocacy-group-warns-us-families-they-cant-afford-immigration-policy-changes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Zuckerberg's Advocacy Group Warns US Families They Can't Afford Immigration Policy Changes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T15:41:58.968474+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T15:20:00+00:00",
        "description": "A new study challenges previous research about which sleep stages help people achieve breakthrough moments in problem-solving. Researchers found that N2 sleep, a deeper stage of non-REM sleep, significantly increased participants' likelihood of experiencing sudden insights during a perceptual task. The preregistered study involved 90 participants who performed a visual pattern recognition task before and after a 20-minute daytime nap while researchers monitored their brain activity with EEG. \n\nParticipants who reached N2 sleep showed an 85.7% rate of achieving insights about a hidden strategy in the task, compared to 63.6% for those who only reached N1 sleep (the first stage of non-rapid eye movement sleep) and 55.5% for participants who remained awake. The findings contradict earlier work by Lacaux and colleagues, which suggested that lighter N1 sleep promoted insight while deeper sleep hindered it. \n\nNews coverage: Stuck on a problem? Take a nap!<p><div class=\"share_submission\" styl",
        "id": 3035348,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/27/0724231/deeper-sleep-stages-boost-problem-solving-insights-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Deeper Sleep Stages Boost Problem-Solving Insights, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T15:41:59.174927+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T14:40:00+00:00",
        "description": "Eight nations have surpassed 50% IPv6 deployment since June 2024, bringing the total number of countries in the majority IPv6 club to 21, according to the Internet Society. Brazil, Guatemala, Hungary, Japan, Mexico, Puerto Rico, Sri Lanka, and Tuvalu all crossed the threshold over the past year. \n\nTuvalu's adoption coincided with the arrival of Elon Musk's Starlink satellite broadband service, which operates as IPv6-only. The Internet Society's Pulse platform found no IPv6 deployment in the Pacific nation in June 2024, but Starlink now holds 88% market share there and 59% of Tuvalu's internet connections use IPv6. \n\nFrance moved from third place to tie with India for the global lead at 73% IPv6 deployment. Japan rebounded from 49% to 55%, returning to the 50% club after dropping below the mark in mid-2024. Puerto Rico climbed from 49% to 53%. Thailand appears positioned to join next at 49% deployment, followed by Estonia at 46% and the United Kingdom at 45%.<p><div class=\"share_submis",
        "id": 3035349,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/27/0637210/starlink-helps-eight-more-nations-pass-50-ipv6-adoption?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Starlink Helps Eight More Nations Pass 50% IPv6 Adoption",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T14:37:03.832587+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T14:00:00+00:00",
        "description": "36% of all Chinese undergraduate entrants -- about 1.6 million people -- selected engineering degrees in 2022 (the latest year for which data are available), up from 32% in 2010, according to data from China's Ministry of Education. In Britain and America, which have far fewer students to start with, the proportion hovers around 5%. \n\nThe surge comes as China's government directs universities to focus on strategic industries and technological bottlenecks. Over 600 Chinese universities now offer undergraduate programs in artificial intelligence, a field the Communist Party vows to dominate by 2030. In 2023, officials started telling universities to overhaul their degree programs, and the education ministry announced an \"emergency mechanism\" to create degrees more quickly to meet \"national priorities.\" Over half of China's young people now complete some form of higher education through 3,000-odd institutions. Youth unemployment reached 14.9% in May, driving students toward technical fie",
        "id": 3034737,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/27/1340213/36-of-chinese-undergraduates-choose-engineering-compared-to-5-in-us-and-uk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "36% of Chinese Undergraduates Choose Engineering, Compared To 5% in US and UK",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T13:31:51.913731+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from SecurityWeek: Hundreds of printer models from Brother and other vendors are impacted by potentially serious vulnerabilities discovered by researchers at Rapid7. The cybersecurity firm revealed on Wednesday that its researchers identified eight vulnerabilities affecting multifunction printers made by Brother. The security holes have been found to impact 689 printer, scanner and label maker models from Brother, and some or all of the flaws also affect 46 Fujifilm Business Innovation, five Ricoh, six Konica Minolta, and two Toshiba printers. Overall, millions of enterprise and home printers are believed to be exposed to hacker attacks due to these vulnerabilities.\n \nThe most serious of the flaws, tracked as CVE-2024-51978 and with a severity rating of 'critical', can allow a remote and unauthenticated attacker to bypass authentication by obtaining the device's default administrator password. CVE-2024-51978 can be chained with an information disclo",
        "id": 3034103,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/26/2351234/brother-printer-bug-in-689-models-exposes-millions-to-hacking?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Brother Printer Bug In 689 Models Exposes Millions To Hacking",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T10:16:55.722397+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T10:00:00+00:00",
        "description": "alternative_right shares a report from Phys.Org: A new study from the University of Bath's School of Management has found that individuals with a higher IQ make more realistic predictions, which supports better decision-making and can lead to improved life outcomes. The research, published in the Journal of Personality and Social Psychology, shows that people with a low IQ (the lowest 2.5% of the population) make forecasting errors that are more than twice as inaccurate as those made by people with a high IQ (the top 2.5% of the population).\n \nThe research used data from a nationally representative sample of people over 50 in England (English Longitudinal Study of Aging ELSA), assessing their ability to predict their own life expectancy. Individuals were asked to predict their probability of living to certain ages, and these estimates were compared with the probabilities taken from Office for National Statistics life tables (a demographic tool used to analyze death rates and calculate",
        "id": 3032694,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/26/2339259/new-iq-research-shows-why-smarter-people-make-better-decisions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New IQ Research Shows Why Smarter People Make Better Decisions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T08:06:52.537918+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T07:00:00+00:00",
        "description": "The UK government has rejected the 25 billion ($34.39 billion) pound Morocco-UK Power Project, citing a preference for domestic renewable initiatives that offer greater economic and strategic benefits. The project aimed to supply solar and wind energy from the Sahara to power up to seven million UK homes. Reuters reports: \"The government has concluded that it is not in the UK national interest at this time to continue further consideration of support for the Morocco-UK Power Project,\" energy department minister Michael Shanks said in a written statement to parliament. He also said the project did not clearly align strategically with the government's mission to build homegrown power in the UK.\n \nXlinks' Morocco-UK power project would have tapped Moroccan renewable energy via what would have been the world's longest subsea power cable. The plan involved building 3,800 kilometers (2,361 miles) of high-voltage direct current subsea cables from Morocco to southwest England. The company had",
        "id": 3031993,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/26/2336210/britain-shuns-34-billion-morocco-uk-subsea-power-project?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Britain Shuns $34 Billion Morocco-UK Subsea Power Project",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T04:49:49.395701+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T04:30:00+00:00",
        "description": "The six largest UK accounting firms do not formally monitor how automated tools and AI impact the quality of their audits, the regulator has found, even as the technology becomes embedded across the sector. From a report: The Financial Reporting Council on Thursday published its first AI guide alongside a review of the way firms were using automated tools and technology, which found \"no formal monitoring performed by the firms to quantify the audit quality impact of using\" them. \n\nThe watchdog found that audit teams in the Big Four firms -- Deloitte, EY, KPMG and PwC -- as well as BDO and Forvis Mazars were increasingly using this technology to perform risk assessments and obtain evidence. But it said that the firms primarily monitored the tools to understand how many teams were using them for audits, \"typically for licensing purposes,\" rather than to assess their impact on audit quality.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twit",
        "id": 3031161,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/27/0426230/big-accounting-firms-fail-to-track-ai-impact-on-audit-quality-says-regulator?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Big Accounting Firms Fail To Track AI Impact on Audit Quality, Says Regulator",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T03:44:49.748095+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Neuroscience News Science Magazine: Surgeons have performed the first fully robotic heart transplant in the U.S., using advanced robotic tools to avoid opening the chest. [...] Using a surgical robot, lead surgeon Dr. Kenneth Liao and his team made small, precise incisions, eliminating the need to open the chest and break the breast bone. Liao removed the diseased heart, and the new heart was implanted through preperitoneal space, avoiding chest incision.\n \n\"Opening the chest and spreading the breastbone can affect wound healing and delay rehabilitation and prolong the patient's recovery, especially in heart transplant patients who take immunosuppressants,\" said Liao, professor and chief of cardiothoracic transplantation and circulatory support at Baylor College of Medicine and chief of cardiothoracic transplantation and mechanical circulatory support at Baylor St. Luke's Medical Center. \"With the robotic approach, we preserve the integrity of ",
        "id": 3030856,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/26/2110248/doctors-perform-first-robotic-heart-transplant-in-us-without-opening-a-chest?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Doctors Perform First Robotic Heart Transplant In US Without Opening a Chest",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-27T00:29:51.630137+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-27T00:20:00+00:00",
        "description": "Apple's Swift programming language is expanding official support to Android through a new \"Android Working Group\" which will improve compatibility, integration, and tooling. \"As it stands today, Android apps are generally coded in Kotlin, but Apple is looking to provide its Swift coding language as an alternative,\" notes 9to5Google. \"Apple first launched its coding language back in 2014 with its own platforms in mind, but currently also supports Windows and Linux officially.\" From the report: A few of the key pillars the Working Group will look to accomplish include:\n \n- Improve and maintain Android support for the official Swift distribution, eliminating the need for out-of-tree or downstream patches\n- Recommend enhancements to core Swift packages such as Foundation and Dispatch to work better with Android idioms\n- Work with the Platform Steering Group to officially define platform support levels generally, and then work towards achieving official support of a particular level for An",
        "id": 3030201,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/26/2133212/apples-swift-coding-language-is-working-on-android-support?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's Swift Coding Language Is Working On Android Support",
        "vote": 0
    }
]