[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T21:00:30.539888+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T20:00:22+00:00",
        "description": "La Quimera is an interesting game. Developed by Reburn - the studio formerly known as 4A Games Ukraine - the title takes on a unique setting to tell a short, tight story that would take players around 5 hours to finish. Using the dystopian sci-fi Latin American city of Nuevo Caracas as its setting, La Quimera puts players into the thick of it, with a complex plot that puts them in the crosshairs of competing PMCs, shadowy government agencies, and even mystical shamans. \n\nWhile the game has some interesting ideas, especially when it comes to its story and settings, generally speaking, it is too rife with issues that largely stem from a lack of polish. Animations are poorly done and often jittery, and even the audio in cutscenes will just start playing over more important dialog that might be giving you important plot beats. The only thing that doesn’t make La Quimera a complete waste of time is that you can be done with it in 5 hours.",
        "id": 2536284,
        "language": null,
        "link": "https://www.youtube.com/watch?v=iNdcI9JKxOY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iNdcI9JKxOY/hqdefault.jpg",
        "title": "La Quimera Review - Needed More Time In The Oven",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T21:00:30.662525+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T20:00:12+00:00",
        "description": "Days Gone Remastered represents the maturity of a game that once had a shaky release, then with time got better with post launch patches and updates, improved further with a great PC port, and now shines even brighter on the PS5. \n\nIn its current state, it has now firmly established itself as one of the best titles in PlayStation’s library. It's a shame that Sony doesn’t seem interested in doing much with the IP going forward. Will that change someday with a potential Days Gone 2? Only time will tell.",
        "id": 2536285,
        "language": null,
        "link": "https://www.youtube.com/watch?v=L55leIPSJjE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/L55leIPSJjE/hqdefault.jpg",
        "title": "Days Gone Remastered PS5 Review - The Definitive Version",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T14:20:42.821226+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T14:00:02+00:00",
        "description": "Metal Gear Solid: Peace Walker released in 2010 for the PSP. It soon found its way onto the PS3 and Xbox 360 with a revamped HD edition in 2011 and is now available for modern hardware through the Master Collection. Despite its origin as a handheld title, Peace Walker is without a shadow of doubt, a true Metal Gear game.\n\nIt’s also just a ton of fun. There’s loads of secrets to find, including a Monster Hunter island and Assassin’s Creed leap of faith to name just a few. The story is told through stylized comic strip vignettes from the art of none other than Yoji Shinkawa and Ashley Wood. This is no side story either, as it fills in the crucial gaps within Snake’s character arc.\n\nWith a bevy of engaging content ranging from single player missions to co-op and PvP matches, Metal Solid: Peace Walker is pure masterclass.",
        "id": 2534138,
        "language": null,
        "link": "https://www.youtube.com/watch?v=aVIQ_99u_80",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aVIQ_99u_80/hqdefault.jpg",
        "title": "Why Peace Walker Was Secretly One of the Best Metal Gear Solid Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T09:55:36.031079+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T09:30:07+00:00",
        "description": "The Elder Scrolls 4: Oblivion arrived in 2006, departing from its predecessor, Morrowind, by launching simultaneously for Xbox 360 and PC. It was an introduction to the world of Tamriel for many players, the first open-world fantasy RPG for others, a primer on what made a \"Bethesda game,\" and above all, one of the best games ever made.\n\nAfter rumors flared up about a potential remaster/remake, it didn't seem possible that Bethesda would revisit the classic. Between Starfield and The Elder Scrolls 6, it had a lot to handle. Of course, subsequent rumors cited Virtuos as the developer and Unreal Engine 5 as the engine fueling the remaster.\n\nNow, The Elder Scrolls 4: Oblivion Remastered is finally here, officially announced and launched on the same day for Xbox Series X/S, PS5, and PC. It's been an incredible experience revisiting Cyrodiil and, above all, a reminder of what makes Oblivion such a classic to this day.",
        "id": 2532848,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DKMOX43m8W8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DKMOX43m8W8/hqdefault.jpg",
        "title": "I STILL CAN'T BELIEVE The Elder Scrolls 4: Oblivion Remastered Is Here",
        "vote": 0
    }
]