[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T23:53:17.644062+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T23:53:17+00:00",
        "description": "\"Future moon astronauts may find water more accessible than previously thought,\" writes Space.com, citing a new NASA-led experiment:\n\nBecause the moon lacks a magnetic field like Earth's, the barren lunar surface is constantly bombarded by energetic particles from the sun... Li Hsia Yeo, a planetary scientist at NASA's Goddard Space Flight Center in Maryland, led a lab experiment observing the effects of simulated solar wind on two samples of loose regolith brought to Earth by the Apollo 17 mission... To mimic conditions on the moon, the researchers built a custom apparatus that included a vacuum chamber, where the samples were placed, and a tiny particle accelerator, which the scientists used to bombard the samples with hydrogen ions for several days. \n\n\"The exciting thing here is that with only lunar soil and a basic ingredient from the sun &mdash; which is always spitting out hydrogen &mdash; there's a possibility of creating water,\" Yeo said in a statement. \"That's incredible to t",
        "id": 2536914,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/26/2217249/can-solar-wind-make-water-on-the-moon-a-nasa-experiment-shows-maybe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Can Solar Wind Make Water on the Moon? A NASA Experiment Shows Maybe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T23:53:17.747580+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T23:53:17+00:00",
        "description": "Slashdot reader itwbennett writes: Personal health information on 4.7 million Blue Shield California subscribers was unintentionally shared between Google Analytics and Google Ads between April 2021 and January 2025 due to a misconfiguration error. Security consultant and SANS Institute instructor Brandon Evans points to two lessons to take from this debacle:\n\nRead the documentation of any third party service you sign up for, to understand the security and privacy controls;Know what data is being collected from your organization, and what you don't want shared.\n\n\"If there is a concern by the organization that Google Ads would use this information, they should really consider whether or not they should be using a platform like Google Analytics in the first place,\" Evans says in the article. \"Because from a technical perspective, there is nothing stopping Google from sharing the information across its platform... \n\n\"Google definitely gives you a great bunch of controls, but technically ",
        "id": 2536915,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/26/2042230/read-the-manual-misconfigured-google-analytics-led-to-a-data-breach-affecting-47m?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Read the Manual': Misconfigured Google Analytics Led to a Data Breach Affecting 4.7M",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T21:30:34.741818+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T21:30:34+00:00",
        "description": "\"Google-owned YouTube's revenue last year was estimated to be $54.2 billion,\" reports the Los Angeles Times, \"which would make it the second-largest media company behind Walt Disney Co., according to a recent report from research firm MoffettNathanson, which called YouTube 'the new king of all media.'\"\n\nYouTube, run by Chief Executive Neal Mohan since 2023, accounted for 12% of U.S. TV viewing in March, more than other rival streaming platforms including Netflix and Tubi, according to Nielsen... More people are watching YouTube on TV sets rather than on smartphones and computer screens, consuming more than 1 billion hours on average of YouTube content on TV daily, the company said on its website. \n\nWhen YouTube first started its founders envisioned it as a dating site, according to the article, \"where people would upload videos and score them. When that didn't work, the founders decided to open up the platform for all sorts of videos.\" And since this was 20 years ago, \"Users drove tra",
        "id": 2536440,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/26/1935238/youtube-is-huge---and-a-few-creators-are-getting-rich?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "YouTube is Huge - and a Few Creators Are Getting Rich",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T20:25:39.155538+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T20:25:38+00:00",
        "description": "ZDNet's reviewer says \"I tested this affordable E Ink phone for two weeks, and it rewired my brain (for the better).\"\n\nIt's Mudita's new Kompakt smartphone with a two-color E Ink display &mdash; which ZDNet calls \"an affordable choice\" for those \"considering investing in a so-called 'dumbphone'...\"\n\n\nCompared to modern smartphones, the Mudita Kompakt is a bit chunky at half an inch thick and five inches long. It's still rather light, though, weighing just 164 grams and covered in soft touch material, so it feels good in the hand. The bezels around the 4.3-inch display are rather large, with three touch-sensitive buttons for back, home, and quick settings, so navigating to key elements is intuitive, whether you're coming from Android or iOS. \nThe phone features a fingerprint sensor to lock and unlock, and it's housed on the power button in the middle of the right side. I'm a huge fan of consolidating these two purposes to the same button, and it works flawlessly.... You can charge via ",
        "id": 2536111,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/04/26/078214/can-a-new-dumbphone-with-an-e-ink-display-help-rewire-your-brain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Can a New 'Dumbphone' With an E Ink Display Help Rewire Your Brain?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T19:20:11.544942+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T19:20:11+00:00",
        "description": "\"Only the United States, China and Germany have larger economies than California,\" reports CNN. \n\nIn fact, they add that California \"outpaced all three countries with growth of 6% last year,\" according to the California governor's office (which cites new data from the International Monetary Fund and the U.S. Bureau of Economic Analysis):\n\n\nIn 2024, California's growth rate of 6% outpaced the top three economies: U.S. (5.3%), China (2.6%) and Germany (2.9%)... \n\n\nWith an increasing state population and recent record-high tourism spending, California is the nation's top state for new business starts, access to venture capital funding, and manufacturing, high-tech, and agriculture. The state drives national economic growth and also sends over $83 billion more to the federal government than it receives in federal funding. California is the leading agricultural producer in the country and is also the center for manufacturing output in the United States, with over 36,000 manufacturing firms",
        "id": 2535712,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/26/0625244/california-becomes-the-worlds-fourth-largest-economy-overtaking-japan?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "California Becomes the World's Fourth-Largest Economy, Overtaking Japan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T18:15:11.283024+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T18:15:11+00:00",
        "description": "An anonymous reader shared this report from the Washington Post:\n\n\nThe acting U.S. attorney for the District of Columbia sent a letter to the nonprofit that runs Wikipedia, accusing the tax-exempt organization of \"allowing foreign actors to manipulate information and spread propaganda to the American public.\" \n\n\nIn the letter dated April 24, Ed Martin said he sought to determine whether the Wikimedia Foundation's behavior is in violation of its Section 501(c)(3) status. Martin asked the foundation to provide detailed information about its editorial process, its trust and safety measures, and how it protects its information from foreign actors. \"Wikipedia is permitting information manipulation on its platform, including the rewriting of key, historical events and biographical information of current and previous American leaders, as well as other matters implicating the national security and the interests of the United States,\" Martin wrote. \"Masking propaganda that influences public op",
        "id": 2535475,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/26/0520221/us-attorney-for-dc-accuses-wikipedia-of-propaganda-threatens-nonprofit-status?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Attorney for D.C. Accuses Wikipedia of 'Propaganda', Threatens Nonprofit Status",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T17:11:41.848722+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T17:11:41+00:00",
        "description": "A New York Times technology columnist has a question. \n\"Is there any threshold at which an A.I. would start to deserve, if not human-level rights, at least the same moral consideration we give to animals?\"\n\n\n[W]hen I heard that researchers at Anthropic, the AI company that made the Claude chatbot, were starting to study \"model welfare\" &mdash; the idea that AI models might soon become conscious and deserve some kind of moral status &mdash; the humanist in me thought: Who cares about the chatbots? Aren't we supposed to be worried about AI mistreating us, not us mistreating it...? \n\nBut I was intrigued... There is a small body of academic research on A.I. model welfare, and a modest but growing number of experts in fields like philosophy and neuroscience are taking the prospect of A.I. consciousness more seriously, as A.I. systems grow more intelligent.... Tech companies are starting to talk about it more, too. Google recently posted a job listing for a \"post-AGI\" research scientist who",
        "id": 2535087,
        "language": null,
        "link": "https://slashdot.org/story/25/04/26/0742205/nyt-asks-should-we-start-taking-the-welfare-of-ai-seriously?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NYT Asks: Should We Start Taking the Welfare of AI Seriously?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T16:05:05.722801+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T16:05:05+00:00",
        "description": "It's a pickup truck \"that can change into whatever you need it to be &mdash; even an SUV,\" according to the manufacturer's web site. \n\nSelling in America for just $20,000 (after federal incentives), the new electric truck is \"affordable, deeply customizable, and very analog,\" says TechCrunch. \"It has manual windows and it doesn't come with a main infotainment screen. Heck, it isn't even painted...\"\n\nSlate Auto is instead playing up the idea of wrapping its vehicles, something executives said they will sell in kits. Buyers can either have Slate do that work for them, or put the wraps on themselves. This not only adds to the idea of a buyer being able to personalize their vehicle, but it also cuts out a huge cost center for the company. It means Slate won't need a paint shop at its factory, allowing it to spend less to get to market, while also avoiding one of the most heavily regulated parts of vehicle manufacturing. \n\nSlate is telling customers that they can name the car whatever they",
        "id": 2534679,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/26/0425259/cheap-transforming-electric-truck-announced-by-jeff-bezos-backed-startup?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cheap 'Transforming' Electric Truck Announced by Jeff Bezos-Backed Startup",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T15:00:01.911370+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T15:00:01+00:00",
        "description": "\"A group of researchers says it has identified a hidden reason we use Google for nearly all web searches,\" reports the Washington Post. \"We've never given other options a real shot.\"\n\nTheir research experiment suggests that Google is overwhelmingly popular partly because we believe it's the best, whether that's true or not. It's like a preference for your favorite soda. And their research suggested that our mass devotion to googling can be altered with habit-changing techniques, including by bribing people to try search alternatives to see what they are like... \n\n[A] group of academics &mdash; from Stanford University, the University of Pennsylvania and MIT &mdash; designed a novel experiment to try to figure out what might shake up Google's popularity. They recruited nearly 2,500 participants and remotely monitored their web searches on computers for months. The core of the experiment was paying some participants &mdash; most received $10 &mdash; to use Bing rather than Google for tw",
        "id": 2534336,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/26/065228/what-happens-when-you-pay-people-not-to-use-google-search?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What Happens When You Pay People Not to Use Google Search?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T13:55:36.970069+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T13:55:36+00:00",
        "description": "An anonymous reader quotes a report from IEEE Spectrum: The XPrize Foundation today announced the winners of its four-year, $100 million XPrize competition in carbon removal. The contest is one of dozens hosted by the foundation in its 20-year effort to encourage technological development. Contestants in the carbon removal XPrize had to demonstrate ways to pull carbon dioxide from the atmosphere or oceans and sequester it sustainably.\n \nMati Carbon, a Houston-based startup developing a sequestration technique called enhanced rock weathering, won the grand prize of $50 million. The company spreads crushed basalt on small farms in India and Africa. The silica-rich volcanic rock improves the quality of the soil for the crops but also helps remove carbon dioxide from the air. It does this by reacting with dissolved CO2 in the soil's water, turning it into bicarbonate ions and preventing it from returning to the atmosphere.\n \nMore than a dozen organizations globally are developing enhanced",
        "id": 2533929,
        "language": null,
        "link": "https://slashdot.org/story/25/04/25/2228254/xprize-in-carbon-removal-goes-to-enhanced-rock-weathering?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "XPrize In Carbon Removal Goes To Enhanced Rock Weathering",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T10:39:08.397091+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T10:39:08+00:00",
        "description": "Initial claims that life-associated gases were detected on exoplanet K2-18b are being challenged, with independent reanalysis by Jake Taylor suggesting the data is too noisy to support such conclusions and that stronger, model-independent evidence is needed. NPR reports: Rather than seeing a bump or a wiggle that indicated a signal, \"the data is consistent with a flat line,\" says Taylor, adding that more observations from the telescope are needed to know what can be reliably said about this planet's atmosphere. \"If we want to claim biosignatures, we need to be extremely sure.\"\n \nWhat this new work shows is that \"the strength of the evidence depends on the nitty gritty details of how we interpret the data, and that doesn't pass the bar for me for a convincing detection,\" says Laura Kreidberg, an expert on the atmospheres of distant planets at the Max Planck Institute for Astronomy in Germany who didn't work on the original research team or this new analysis.\n \nShe explains that astrono",
        "id": 2532967,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/25/229213/new-analysis-casts-doubt-on-biosignatures-found-on-planet-k2-18b?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Analysis Casts Doubt On 'Biosignatures' Found On Planet K2-18b",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T07:24:07.447133+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T07:24:07+00:00",
        "description": "Longtime Slashdot reader AmiMoJo shares a report from the BBC: China will let scientists from six countries, including the U.S., examine the rocks it collected from the Moon -- a scientific collaboration that comes as the two countries remain locked in a bitter trade war. Two NASA-funded U.S. institutions have been granted access to the lunar samples collected by the Chang'e-5 mission in 2020, the China National Space Administration (CNSA) said on Thursday. CNSA chief Shan Zhongde said that the samples were \"a shared treasure for all humanity,\" local media reported.\n \nChinese researchers have not been able to access NASA's Moon samples because of restrictions imposed by U.S. lawmakers on the space agency's collaboration with China. Under the 2011 law, Nasa is banned from collaboration with China or any Chinese-owned companies unless it is specifically authorized by Congress. But John Logsdon, the former director of the Space Policy Institute at George Washington University, told BBC N",
        "id": 2532151,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/25/224229/china-shares-rare-moon-rocks-with-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Shares Rare Moon Rocks With US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T06:19:39.049241+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T06:19:38+00:00",
        "description": "TV producer Alex Berger criticized Apple TV+ as \"the worst marketer in the universe\" for failing to promote his French-language show La Maison, despite its success in Europe. Berger said he initially partnered with Apple out of hope, but ultimately felt they undermined their own content by not supporting it properly. 9to5Mac reports: Rafa Sales Ross at Variety recently interviewed TV producer Alex Berger, who made La Maison for Apple TV+. That partnership is apparently not one he intends to repeat: \"Marketing makes a show,\" he emphasized. \"Apple, for example, is probably the worst marketer in the universe -- the best for iPhones, the worst for television. They don't do marketing, and it was an issue for us with 'La Maison.' We did a great show that had an amazing success in France and other places in Europe, but they never promoted it. It drove me crazy.\"\n \nAsked why, while believing Apple TV+ to lack in marketing efforts, did he decide to take \"La Maison\" to the streamer, Berger said",
        "id": 2531116,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/25/2155205/apple-tv-is-worst-marketer-in-the-universe-says-producer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple TV+ Is 'Worst Marketer In the Universe,' Says Producer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T06:19:39.385425+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T06:19:38+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Comcast executives apparently realized something that customers have known and complained about for years: The Internet provider's prices aren't transparent enough and rise too frequently. This might not have mattered much to cable executives as long as the total number of subscribers met their targets. But after reporting a net loss of 183,000 residential broadband customers in Q1 2025, Comcast President Mike Cavanagh said the company isn't \"winning in the marketplace\" during an earnings call today. The Q1 2025 customer loss was over three times larger than the net loss in Q1 2024.\n \nWhile customers often have few viable options for broadband and the availability of alternatives varies widely by location, Comcast faces competition from fiber and fixed wireless ISPs. \"In this intensely competitive environment, we are not winning in the marketplace in a way that is commensurate with the strength of the network and connectivity prod",
        "id": 2531119,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/25/2129256/comcast-president-bemoans-broadband-customer-losses-we-are-not-winning?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Comcast President Bemoans Broadband Customer Losses: 'We Are Not Winning'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T06:19:39.274202+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T06:19:38+00:00",
        "description": "Some developers are \"crying foul\" after Microsoft's C/C++ extension for Visual Studio Code stopped working with VS Code derivatives like VS Codium and Cursor, reports The Register. The move has prompted Cursor to transition to open-source alternatives, while some developers are calling for a regulatory investigation into Microsoft's alleged anti-competitive behavior. From the report: In early April, programmers using VS Codium, an open-source fork of Microsoft's MIT-licensed VS Code, and Cursor, a commercial AI code assistant built from the VS Code codebase, noticed that the C/C++ extension stopped working. The extension adds C/C++ language support, such as Intellisense code completion and debugging, to VS Code. The removal of these capabilities from competing tools breaks developer workflows, hobbles the editor, and arguably hinders competition. The breaking change appears to have occurred with the release of v1.24.5 on April 3, 2025.\n \nFollowing the April update, attempts to install",
        "id": 2531118,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/04/25/2139216/devs-sound-alarm-after-microsoft-subtracts-cc-extension-from-vs-code-forks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Devs Sound Alarm After Microsoft Subtracts C/C++ Extension From VS Code Forks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T06:19:38.937200+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T06:19:38+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Multiple studies and investigations have found that about half of American households watch TV and movies with subtitles on, but only a relatively small portion of those include someone with a hearing disability. That's because of the trouble many people have understanding dialogue in modern viewing situations, and Netflix has now introduced a subtitles option to help.\n \nThe closed captioning we've all been using for years includes not only the words the people on-screen are saying, but additional information needed by the hard of hearing, including character names, music cues (\"dramatic music intensifies\") and sound effects (\"loud explosion\"). For those who just wanted to make sure they didn't miss a word here and there, the frequent descriptions of sound effects and music could be distracting. This new format omits those extras, just including the spoken words and nothing else -- even in the same language as the spoken dialogue.",
        "id": 2531115,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/25/2159253/netflix-introduces-a-new-kind-of-subtitles-for-the-non-hearing-impaired?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Netflix Introduces a New Kind of Subtitles For the Non-Hearing Impaired",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T06:19:39.161425+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-26T06:19:38+00:00",
        "description": "YKK, the world's largest zipper maker, has unveiled a prototype self-propelled zipper that uses a motorized worm gear to zip itself closed at the push of a button. It currently relies on a wired remote and external power, and can zip spans up to 16 feet in under a minute. The Verge reports: Although some recent zipper innovations, such as Under Armour's one-handed MagZip upgrade, are designed to improve accessibility and make zippers easier to use for those with limited mobility, YKK envisions more industrial use cases for its prototype. As demonstrated in a video recently shared on the company's YouTube channel, the self-propelled zipper is seen connecting a pair of 16-foot-tall membranes in about 40 seconds. Zipping them together manually would require the use of a ladder or other machinery.\n \nIn another video, the prototype is used to quickly connect a pair of 13-foot-wide temporary shelters standing over eight feet tall, taking about 50 seconds to progress from one side to the oth",
        "id": 2531117,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/25/2148256/worlds-biggest-zipper-maker-is-developing-a-self-propelled-zipper?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "World's Biggest Zipper Maker Is Developing a Self-Propelled Zipper",
        "vote": 0
    }
]