[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-01T18:27:53.402028+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-01T17:30:09+00:00",
        "description": "can't write off Digimon Story: Time Stranger completely. The production values are definitely there in places, but the storytelling, exploration, and characters range from outright dull to mildly compelling, depending on the location. Rather than caring about the future of humanity and Digimon, I was more keen on discovering new Digivolutions and pummeling enemies into the dirt for their scan data. Side quests were little more than a means to acquire more AP to invest in further bolstering my squad of digital assassins.\n\nBut even if I want to focus entirely on combat and Digimon-rearing, everything else just feels like an unnecessary weight, impeding my interest with its dull objectives. If you can power through all that, Digimon Story: Time Stranger might be enjoyable, especially for longtime fans of the series, but those seeking a more well-rounded role-playing game should be warned.",
        "id": 3712012,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=EqmTlM7-_hw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EqmTlM7-_hw/hqdefault.jpg",
        "title": "Digimon Story: Time Stranger Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-01T16:54:06.951738+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-01T15:30:33+00:00",
        "description": "Ezo is a large, magnificent region to explore in Ghost of Yotei, teeming with wonder and danger alike. As a bounty hunter seeking to hunt her family's killers, Atsu has her hands full trying to survive. \n\nExploration can provide numerous advantages, whether it's onsen to increase one's max health or vendors for upgrading armor and certain weapons, but what should you keep in mind while pursuing the path of vengeance? Here are 14 useful tips and tricks.",
        "id": 3711075,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=jVAQdDBnhzM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jVAQdDBnhzM/hqdefault.jpg",
        "title": "14 Things Ghost of Yotei Doesn't Tell You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-01T15:11:39.172682+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-01T13:45:14+00:00",
        "description": "If you think that rolling the credits on Silent Hill f's story is all you need to do to understand its story, we're here to tell you you're wrong. You're going to have to dive right back in and see how you can save Hinako from becoming the worst version of herself, possibly putting her on the road to self-actualization while having a lot of additional fun in the bargain.\n\nKonami's winding paths to different endings are a fine way for you to get more Silent Hill out of the experience, while fleshing out important characters, their motivations, and backstories in order to let you find an ending that works for you. \n\nHinako certainly wasn't meant to become an unhinged killer, and as the ones guiding her through her adventure, it falls to you to make sure that it doesn't happen.",
        "id": 3709274,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=zgXPr7OXUxw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zgXPr7OXUxw/hqdefault.jpg",
        "title": "You’ve Been Playing Silent Hill f WRONG",
        "vote": 0
    }
]