[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T20:13:22.807896+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T19:30:01+00:00",
        "description": "Game of Thrones Kingsroad is the first major adaptation of HBO’s TV show in a while that tries to go for a more action oriented approach. The title features an original story revolving around a new House, House Tyre, while also involving some of the characters we last saw in the TV show in its epic story about trying to deal with the White Walkers.\n\nUnfortunately, the game is a bit heavy-handed in its monetization schemes, presenting the player with too many progression system, each of which feeling like it could be yet another avenue for players to fork out some cash. This paired with incredibly dull gameplay that essentially devolves into button mashing against a repetitive line-up of enemies means that there is little here to find enjoyable, unless you’re a die-hard fan of the Game of Thrones franchise.",
        "id": 2801903,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Dp5R4B7x_Fg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Dp5R4B7x_Fg/hqdefault.jpg",
        "title": "After Almost A Week With Game of Thrones: Kingsroad, Here's What I Think [Review]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T15:50:04.871833+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T15:30:03+00:00",
        "description": "After a lengthy early access period, developer Questline and publisher Awaken Realms' open world action RPG Tainted Grail: The Fall of Avalon launched for PC and consoles earlier in May, and as many may have told you by now, it's quite an impressive and well put together experience, flaws and all- of which it does have a few, admittedly. \n\nBarring some undeniable rough edges here and there, however (like questionable technical deficiencies), The Fall of Avalon does succeed in delivering a game inspired by beloved genre greats like The Elder Scrolls 4: Oblivion and Skyrim, which also makes its own stamp in certain key ways.",
        "id": 2799706,
        "language": null,
        "link": "https://www.youtube.com/watch?v=6jTcrd5I2lM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6jTcrd5I2lM/hqdefault.jpg",
        "title": "SERIOUSLY, Tainted Grail: The Fall of Avalon Might Have One of 2025’s Best Open Worlds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T14:44:59.146660+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T14:00:55+00:00",
        "description": "After reportedly cancelling a new Titanfall title, Electronic Arts has seemingly shelved Black Panther, a new single-player game developed by Cliffhanger Games. The latter was established by Kevin Stephens, better known as the head of Monolith, who worked on Middle-earth: Shadow of Mordor and Shadow of War.\n\nHowever, even the development studio has been shut down, with EA saying it needs to “sharpen” its focus and invest \"creative energy behind the most significant growth opportunities.” An unspecified number of employees have also been laid off, but hey, at least the publisher's deal with Marvel for games using its IPs remains intact. So there's that.\n\nWhat happened? Why is Electronic Arts suddenly on a spree of cancelling projects and laying off employees? What does this mean for future single-player titles like Motive's Iron Man, the next Mass Effect and the third Star Wars: Jedi title? Find out more here.",
        "id": 2799144,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Z_jnP87acrA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z_jnP87acrA/hqdefault.jpg",
        "title": "What The HELL HAPPENED With EA's Black Panther Game?",
        "vote": 0
    }
]