[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T00:02:46.530827+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T23:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: An accused movie pirate who stole more than 1,000 Blu-ray discs and DVDs while working for a DVD manufacturing company struck a plea deal (PDF) this week to lower his sentence after the FBI claimed the man's piracy cost movie studios millions. Steven Hale no longer works for the DVD company. He was arrested in March, accused of \"bypassing encryption that prevents unauthorized copying\" and ripping pre-release copies of movies he could only access because his former employer was used by major movie studios. As alleged by the feds, his game was beating studios to releases to achieve the greatest possible financial gains from online leaks.\n \nAmong the popular movies that Hale is believed to have leaked between 2021 and 2022 was Spider-Man: No Way Home, which the FBI alleged was copied \"tens of millions of times\" at an estimated loss of \"tens of millions of dollars\" for just one studio on one movie. Other movies Hale ripped included an",
        "id": 2803461,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/29/216216/man-who-stole-1000-dvds-from-employer-strikes-plea-deal-over-movie-leaks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Man Who Stole 1,000 DVDs From Employer Strikes Plea Deal Over Movie Leaks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-30T00:02:46.690173+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T23:00:00+00:00",
        "description": "Google's Gemini AI can now analyze and summarize video files stored in Google Drive, letting users ask questions about content like meeting takeaways or product updates without watching the footage. The Verge reports: The Gemini in Drive feature provides a familiar chatbot interface that can provide quick summaries describing the footage or pull specific information. For example, users can ask Gemini to list action items mentioned in recorded meetings or highlight the biggest updates and new products in an announcement video, saving time spent on manually combing through and taking notes.\n \nThe feature requires captions to be enabled for videos, and can be accessed using either Google Drive's overlay previewer or a new browser tab window. It's available in English for Google Workspace and Google One AI Premium users, and anyone who has previously purchased Gemini Business or Enterprise add-ons, though it may take a few weeks to fully roll out. You can learn more about the update in Go",
        "id": 2803462,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/29/211200/gemini-can-now-watch-google-drive-videos-for-you?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gemini Can Now Watch Google Drive Videos For You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T22:55:30.873001+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T22:20:00+00:00",
        "description": "A Texas jury ruled that Intel may hold a license to patents owned by VLSI Technology through its agreement with Finjan Inc., both controlled by Fortress Investment Group -- potentially nullifying over $3 billion in previous patent infringement verdicts against Intel. Reuters reports: VLSI has sued Intel in multiple U.S. courts for allegedly infringing several patents covering semiconductor technology. A jury in Waco, Texas awarded VLSI $2.18 billion in their first trial in 2021, which a U.S. appeals court has since overturned and sent back for new proceedings.\n \nAn Austin, Texas jury determined that VLSI was entitled to nearly $949 million from Intel in a separate patent infringement trial in 2022. Intel has argued in that case that the verdicts should be thrown out based on a 2012 agreement that gave it a license to patents owned by Finjan and other companies \"under common control\" with it. U.S. District Judge Alan Albright held the latest jury trial in Austin to determine whether Fi",
        "id": 2803094,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/29/2058225/intel-wins-jury-trial-over-patent-licenses-in-3-billino-vlsi-fight?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Wins Jury Trial Over Patent Licenses In $3 Billino VLSI Fight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T22:55:31.028785+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T22:00:00+00:00",
        "description": "The SEC on Thursday voluntarily dismissed its lawsuit against Binance, the world's largest cryptocurrency exchange. It brings an end to one of the last remaining crypto enforcement actions brought by the agency. Reuters reports: The SEC had accused the defendants in 2023 of artificially inflating trading volumes, diverting customer funds, failing to restrict U.S. customers from Binance's platform, and misleading investors about its market surveillance controls. It also accused Binance of unlawfully facilitating trading of several tokens that prior SEC leadership deemed unregistered securities. Developing...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SEC+Voluntarily+Dismisses+Lawsuit+Against+Binance%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F05%2F29%2F2155215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.fa",
        "id": 2803095,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/29/2155215/sec-voluntarily-dismisses-lawsuit-against-binance?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SEC Voluntarily Dismisses Lawsuit Against Binance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T21:51:40.030867+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T21:40:00+00:00",
        "description": "An anonymous reader quotes a report from SC Media: Thousands of ASUS routers have been compromised with malware-free backdoors in an ongoing campaign to potentially build a future botnet, GreyNoise reported Wednesday. The threat actors abuse security vulnerabilities and legitimate router features to establish persistent access without the use of malware, and these backdoors survive both reboots and firmware updates, making them difficult to remove.\n \nThe attacks, which researchers suspect are conducted by highly sophisticated threat actors, were first detected by GreyNoise's AI-powered Sift tool in mid-March and disclosed Thursday after coordination with government officials and industry partners. Sekoia.io also reported the compromise of thousands of ASUS routers in their investigation of a broader campaign, dubbed ViciousTrap, in which edge devices from other brands were also compromised to create a honeypot network. Sekoia.io found that the ASUS routers were not used to create hone",
        "id": 2802716,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/29/2052229/asus-router-backdoors-affect-9000-devices-persists-after-firmware-updates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "ASUS Router Backdoors Affect 9,000 Devices, Persists After Firmware Updates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T21:51:40.187628+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T21:02:00+00:00",
        "description": "An anonymous reader shares a report: China's Ministry of Commerce is meeting with some of the country's biggest automakers to discuss whether the industry is using a loophole to mask weakening sales. Reuters adds: It comes after Great Wall Motor's Chairman Wei Jianjun said in an interview with Sina Finance last week that a phenomenon called \"secondhand cars with zero mileage\" had emerged in the Chinese market as a result of the industry's years-long price war. \n\nThe phenomenon, he said, involved cars that had been registered and had licence plates -- marking them as sold -- but had never been driven being sold in the secondhand market. Wei said that at least 3,000 to 4,000 vendors on Chinese used car platforms were selling such cars. The source said the tactic was seen as a potential method within the industry for automakers and dealers to support new car sales as they try to meet aggressive sales targets.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\"",
        "id": 2802717,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/29/2028234/china-summons-top-carmakers-over-zero-mileage-used-vehicles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Summons Top Carmakers Over 'Zero-Mileage' Used Vehicles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T20:46:33.476990+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T20:21:00+00:00",
        "description": "India faces a paradoxical climate challenge that requires embracing air conditioning despite the environmental costs, according to analysis of the country's warming patterns and pollution crisis. While the past decade marked India's warmest on record, the nation has warmed at only 0.09C per decade compared to 0.30C globally, with horrific air pollution serving as an unintended cooling agent by intercepting solar radiation and making clouds more reflective. \n\nThe cooling effect creates a dangerous trade-off: cleaner air would accelerate temperature rises just as the country desperately needs relief from intensifying heat waves. Only one in ten Indian households owns air conditioning, compared to two-thirds in China and four-fifths in Malaysia, despite air-conditioner sales doubling between 2020 and 2024. During heat waves, cooling systems already account for one-fifth of power demand, mostly supplied by coal plants that worsen the pollution problem India must eventually solve.<p><div c",
        "id": 2802236,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/29/2011206/india-needs-to-turn-the-air-con-on?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "India Needs To Turn the Air-Con On",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T20:46:33.634730+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T19:40:00+00:00",
        "description": "DevNull127 writes: Stack Overflow will test paying experts to answer questions. That's one of many radical experiments they're now trying to stave off an AI-induced death spiral. Questions and answers to the site have plummeted more than 90% since April of 2020. So here's what Stack Overflow will try next. 1. They're bringing back Chat, according to their CEO (to foster \"even more connections between our community members\" in \"an increasingly AI-driven world\"). 2. They're building a \"new Stack Overflow\" meant to feel like a personalized portal. \"It might collect videos, blogs, Q&amp;A, war stories, jokes, educational materials, jobs... and fold them together into one personalized destination.\" 3. They're proposing areas more open to discussion, described as \"more flexible Stack Exchanges... where users can explore ideas or share opinions.\" 4. They're also licensing Stack Overflow content to AI companies for training their models. 5. Again, they will test paying experts to answer quest",
        "id": 2802237,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/29/1921248/stack-overflows-radical-new-plan-to-fight-ai-induced-death-spiral?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Stack Overflow's Radical New Plan To Fight AI-Induced Death Spiral",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T19:41:44.833160+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T19:01:00+00:00",
        "description": "Anthropic co-founder and CEO Dario Amodei is warning that AI could eliminate half of all entry-level white-collar jobs within the next five years -- and overall unemployment potentially spiking between 10 and 20% during that period. \n\nThe prediction comes as new data from venture capital firm SignalFire shows Big Tech companies have already reduced their hiring of new graduates by approximately 50% compared to pre-pandemic levels, with AI adoption cited as a contributing factor. Amodei told Axios that AI companies and government officials are \"sugarcoating\" the risks of mass job displacement in technology, finance, law, and consulting sectors.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+CEO+Warns+AI+Could+Eliminate+Half+of+All+Entry-Level+White-Collar+Jobs+Within+Five+Years%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F05%2F29%2F1835258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img sr",
        "id": 2801780,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/29/1835258/anthropic-ceo-warns-ai-could-eliminate-half-of-all-entry-level-white-collar-jobs-within-five-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anthropic CEO Warns AI Could Eliminate Half of All Entry-Level White-Collar Jobs Within Five Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T18:34:42.750717+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T18:25:00+00:00",
        "description": "The entertainment industry has achieved an unprecedented milestone: more film and television content exists today than at any point in human history. The technical infrastructure to deliver this content directly to consumers' homes works flawlessly. The problem? Actually finding something to watch has become a user experience nightmare that would make early-2000s software developers cringe. \n\nMultiple streaming platforms are suffering from fundamental interface design failures that actively prevent users from discovering content. Cameron Nudleman, an Austin-based user, told Salon that scrolling through streaming service landing pages feels \"like a Herculean task,\" while his Amazon Fire Stick setup -- designed to consolidate multiple services -- delivers consistent crashes across Paramount+ and Max, with Peacock terminating randomly \"for no discernible reason.\" \n\nThe technical problems extend beyond stability issues to basic functionality failures. Max automatically enables closed capt",
        "id": 2801214,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/29/1825254/theres-more-film-and-television-for-you-to-watch-than-ever-before---good-luck-finding-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "There's More Film and Television For You To Watch Than Ever Before - Good Luck Finding It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T18:34:42.915684+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T17:38:00+00:00",
        "description": "International interest in American higher education has plummeted to levels not seen since the COVID-19 pandemic, according to new data tracking prospective student behavior online. Studyportals, which operates a global directory of degree programs, reports that clicks on American university courses have reached their lowest point since the early pandemic period. \n\nWeekly page views of US university courses halved between January 5th and the end of April. First-quarter traffic to American undergraduate and master's degree programs fell more than 20% compared to the same period last year, while interest in PhD programs dropped by one-third. India, which supplies nearly a third of America's international students, showed the steepest decline at 40%. The data suggests British universities would be the primary beneficiaries of students looking elsewhere. \n\nThe sharp drop in interest follows the Trump administration's escalating restrictions on international students, including stripping H",
        "id": 2801215,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/29/1738234/demand-for-american-degrees-has-already-hit-covid-era-lows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Demand For American Degrees Has Already Hit Covid-Era Lows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T18:34:43.098679+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T16:50:00+00:00",
        "description": "New submitter salyavin writes: The final issue of Linux Format has been released. After 25 years the magazine is going out with a bang. Interviewing the old staff members, and looking back at old Linux distros [...] The last 10-15 years have been absolutely brutal to computer hobbyist magazines -- (or magazines and media at large, in general).<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Linux+Format+Ceases+Publication%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F05%2F29%2F1650210%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F05%2F29%2F1650210%2Flinux-format-ceases-publication%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://linux.slashdot.or",
        "id": 2801216,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/05/29/1650210/linux-format-ceases-publication?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linux Format Ceases Publication",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T16:43:29.612346+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T16:04:00+00:00",
        "description": "California's battery power capacity rose from 500 megawatts in 2018 to nearly 16,000 megawatts in 2025. Nearly a quarter of America's battery capacity is now in California alone, according to Bloomberg. \n\nAt their daily peak around 8pm, batteries can provide as much as 30% of the state's electricity. The batteries charge in the afternoon when solar power is cheap and release energy in the evenings when Californians get home and crank up their air conditioners. In the middle of the day, when the sun is strongest, as much as three-quarters of the state's electricity can come from solar. \n\nCalifornia relied on regulation to achieve this scale. In 2013, the California Public Utilities Commission ordered the state's three big investor-owned utilities to procure 1,325 megawatts of energy storage by 2020 to help meet renewable targets and stabilize the grid. That goal was easily met. Mark Jacobson, an engineering professor at Stanford University, told Economist that most days this year conta",
        "id": 2800367,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/29/164217/california-has-got-really-good-at-building-giant-batteries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "California Has Got Really Good at Building Giant Batteries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T15:38:00.930164+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T15:28:00+00:00",
        "description": "Apple's upcoming macOS 26 operating system may abandon support for several older Mac models, according to AppleInsider. The casualties will include 2018 MacBook Pro models, the 2020 Intel MacBook Air, the 2017 iMac Pro, and the 2018 Mac mini -- all currently the oldest machines compatible with macOS Sequoia, the report said, citing a source familiar with the matter. The 2019 MacBook Pro models and 2020 5K iMac models will retain compatibility with the new system, codenamed \"Cheer,\" said AppleInsider.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=macOS+26+May+Not+Support+2018+MacBook+Pros%2C+2019+iMacs%2C+or+the+iMac+Pro%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F05%2F29%2F1528238%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F05%2F29%2",
        "id": 2799649,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/29/1528238/macos-26-may-not-support-2018-macbook-pros-2019-imacs-or-the-imac-pro?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "macOS 26 May Not Support 2018 MacBook Pros, 2019 iMacs, or the iMac Pro",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T15:38:01.044235+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T14:50:00+00:00",
        "description": "An anonymous reader shares a report: HP is close to ending production of North-America-bound products in China, after US tariffs kicked a hole in its quarterly profits. \"A quarter ago, we shared that our goal was to have less than ten percent of the products in North America being shipped from China by September,\" HP president and CEO Enrique Lores told investors on the company's Q2 2025 earnings call. \"We have accelerated that and we share that now almost no products will be coming from China sold in the US by June. It's a very significant acceleration of the plan that we have.\" \n\n\"We accelerated the shift of factories out from China into Southeast Asia, into Mexico to a certain extent in the US to mitigate the impact of the change,\" he added. Lores also revealed that HP has removed the US as a distribution hub for products sold in Canada or to Latin America. Doing so means HP doesn't have to pay tariffs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\"",
        "id": 2799650,
        "language": null,
        "link": "https://slashdot.org/story/25/05/29/1450252/hp-hastens-china-exit-as-tariffs-kick-a-hole-in-its-profits?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "HP Hastens China Exit as Tariffs Kick a Hole in its Profits",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T14:33:41.377696+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T14:11:00+00:00",
        "description": "Arizona State University researchers are pushing back [PDF] against the widespread practice of describing AI language models' intermediate text generation as \"reasoning\" or \"thinking,\" arguing this anthropomorphization creates dangerous misconceptions about how these systems actually work. The research team, led by Subbarao Kambhampati, examined recent \"reasoning\" models like DeepSeek's R1, which generate lengthy intermediate token sequences before providing final answers to complex problems. Though these models show improved performance and their intermediate outputs often resemble human scratch work, the researchers found little evidence that these tokens represent genuine reasoning processes. \n\nCrucially, the analysis also revealed that models trained on incorrect or semantically meaningless intermediate traces can still maintain or even improve performance compared to those trained on correct reasoning steps. The researchers tested this by training models on deliberately corrupted",
        "id": 2799006,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/29/1411236/researchers-warn-against-treating-ai-outputs-as-human-like-reasoning?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Warn Against Treating AI Outputs as Human-Like Reasoning",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T13:28:06.336101+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Researchers at SignalFire, a data-driven VC firm that tracks job movements of over 600 million employees and 80 million companies on LinkedIn, believe they may be seeing first signs of AI's impact on hiring. When analyzing hiring trends, SignalFire noticed that tech companies recruited fewer recent college graduates in 2024 than they did in 2023. Meanwhile, tech companies, especially the top 15 Big Tech businesses, ramped up their hiring of experienced professionals. Specifically, SignalFire found that Big Tech companies reduced the hiring of new graduates by 25% in 2024 compared to 2023. Meanwhile, graduate recruitment at startups decreased by 11% compared to the prior year. Although SignalFire wouldn't reveal exactly how many fewer grads were hired according to their data, a spokesperson told us it was thousands.\n \nWhile adoption of new AI tools might not fully explain the dip in recent grad hiring, Asher Bantock, SignalFire's hea",
        "id": 2798450,
        "language": null,
        "link": "https://slashdot.org/story/25/05/28/2239206/ai-may-already-be-shrinking-entry-level-jobs-in-tech-new-research-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI May Already Be Shrinking Entry-Level Jobs In Tech, New Research Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T11:03:19.573005+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T10:00:00+00:00",
        "description": "The world is facing a new form of climate denial -- not the dismissal of climate science, but a concerted attack on the idea that the economy can be reorganised to fight the crisis, the president of global climate talks has warned. The Guardian reports: Andre Correa do Lago, the veteran Brazilian diplomat who will direct this year's UN summit, Cop30, believes his biggest job will be to counter the attempt from some vested interests to prevent climate policies aimed at shifting the global economy to a low-carbon footing. \n\n\"There is a new kind of opposition to climate action. We are facing a discredit of climate policies. I don't think we are facing climate denial,\" he said, referring to the increasingly desperate attempts to pretend there is no consensus on climate science that have plagued climate action for the past 30 years. \"It's not a scientific denial, it's an economic denial.\" This economic denial could be just as dangerous and cause as much delay as repeated attempts to deny c",
        "id": 2797269,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/28/2048209/world-faces-new-danger-of-economic-denial-in-climate-fight-cop30-head-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "World Faces New Danger of 'Economic Denial' in Climate Fight, Cop30 Head Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T07:25:45.261118+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T07:00:00+00:00",
        "description": "Astronomers have discovered a mysterious cosmic object, ASKAP J1832-0911, that emits both radio waves and X-rays in precise 44-minute cycles, making it unlike anything observed before. Space.com reports: This is the first time an object like this, a so-called \"long-period transient\" or \"LPT,\" has been seen in high-energy X-ray light as well as low-energy radio wave light. The team behind this discovery hopes the finding could help reveal what these flashing objects actually are and how they launch their mystery signals. However, not only is there no explanation for how the signals from LPTs are generated yet, but astronomers also don't know why these signals \"switch on\" and \"switch off\" at long, regular and unusual intervals. \"This object is unlike anything we have seen before,\" team leader and Curtin University researcher Zieng (Andy) Wang said in a statement. [...]\n \nThe team believes the true nature of ASKAP J1832-0911 is a dead star, they just don't quite know what form that star ",
        "id": 2796017,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/29/0238200/astronomers-discover-mystery-cosmic-body-bursting-with-x-rays?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Astronomers Discover Mystery Cosmic Body Bursting With X-Rays",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T04:36:30.377006+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: LexisNexis Risk Solutions, a data broker that collects and uses consumers' personal data to help its paying corporate customers detect possible risk and fraud, has disclosed a data breach affecting more than 364,000 people. The company said in a filing with Maine's attorney general that the breach, dating back to December 25, 2024, allowed a hacker to obtain consumers' sensitive personal data from a third-party platform used by the company for software development.\n \nJennifer Richman, a spokesperson for LexisNexis, told TechCrunch that an unknown hacker accessed the company's GitHub account. The stolen data varies, but includes names, dates of birth, phone numbers, postal and email addresses, Social Security numbers, and driver license numbers. It's not immediately clear what circumstances led to the breach. Richman said LexisNexis received a report on April 1, 2025 \"from an unknown third party claiming to have accessed certain info",
        "id": 2795451,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/29/0232235/data-broker-giant-lexisnexis-says-breach-exposed-personal-information-of-over-364000-people?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Data Broker Giant LexisNexis Says Breach Exposed Personal Information of Over 364,000 People",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T01:21:42.208254+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T01:00:00+00:00",
        "description": "Microsoft is previewing a new Windows Update orchestration platform that lets third-party apps schedule and manage updates alongside system updates, \"aiming to centralize update scheduling across Windows 11 devices,\" reports The Register. From the report: On Tuesday, Redmond announced it's allowing a select group of developers and product teams to hook into the Windows 11 update framework. The system doesn't push updates itself but allows apps to register their own update logic via WinRT APIs and PowerShell, enabling centralized scheduling, logging, and policy enforcement. \"Updates across the Windows ecosystem can feel like a fragmented experience,\" wrote Angie Chen, a product manager at the Borg, in a blog post. \"To solve this, we're building a vision for a unified, intelligent update orchestration platform capable of supporting any update (apps, drivers, etc.) to be orchestrated alongside Windows updates.\"\n \nAs with other Windows updates, the end user or admin will be able to benefi",
        "id": 2794683,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/28/2232237/microsoft-is-opening-windows-update-to-third-party-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Is Opening Windows Update To Third-Party Apps",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-29T01:21:42.365020+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-29T00:20:00+00:00",
        "description": "Electronic Arts has canceled its in-development Black Panther game and shut down Cliffhanger Games, marking its third round of layoffs this year. IGN reports: In an email sent to staff from EA Entertainment president Laura Miele, Miele said that these changes, alongside other recent cancellations and layoffs, are being done to \"sharpen our focus and put our creative energy behind the most significant growth opportunities.\" In addition to closing Cliffhanger and canceling Black Panther, EA is also laying off some individuals on both its mobile and central teams. [...] As with past rounds of layoffs, EA is endeavoring to place affected individuals in other roles across the company. [...]\n \nTo that end, Miele's email continues, the company is focusing on a small handful of franchises going forward: Battlefield, The Sims, Skate, and Apex Legends. Miele also reassures EA will continue to invest in its Iron Man game at Motive and the third Star Wars: Jedi game, as well as it maintain its mo",
        "id": 2794684,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/28/2226236/ea-cancels-black-panther-game-closes-cliffhanger-games?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EA Cancels Black Panther Game, Closes Cliffhanger Games",
        "vote": 0
    }
]