[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T22:38:42.409357+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T22:30:00+00:00",
        "description": "After the Tea dating-advice app leaked information on its users, the BBC found two online maps \"purporting to represent the locations of women who had signed up for Tea... showing 33,000 pins spread across the United States.\" The maps were hosted on Google Maps. (Notified by the BBC, Google deleted the maps, saying they violated their harassment policies.) \n\n\"Since the breach, more than 10 women have filed class actions against the company which owns Tea,\" the article points out, noting that leaked content is also spreading around social media:\n\nSince the breach, the BBC has found websites, apps and even a \"game\" featuring the leaked data... The \"game\" puts the selfies submitted by women head-to-head, instructing users to click on the one they prefer, with leaderboards of the \"top 50\" and \"bottom 50\"... [And one researcher calculates more than 12,000 posts on 4Chan referenced the Tea app over the three weeks after the leak.] \n\nIt is unsurprising that the leak was exploited. The app ha",
        "id": 3408824,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/24/2227258/after-tea-leak-33000-womens-addresses-were-purportedly-mapped-on-google-maps?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "After Tea Leak, 33,000 Women's Addresses Were Purportedly Mapped on Google Maps",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T21:32:34.781111+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T20:34:00+00:00",
        "description": "\"The truly universal properties of languages are not independent of our physiology and cognition,\" argues the co-author of a new study. Instead he says their research \"strengthens the idea that intonation units are a universal feature of language.\" \n\nPhys.org explains:\n\nHave you ever noticed that a natural conversation flows like a dance &mdash; pauses, emphases, and turns arriving just in time? A new study has discovered that this isn't just intuition; there is a biological rhythm embedded in our speech... \n\nAccording to the study, led by Dr. Maya Inbar, alongside Professors Eitan Grossman and Ayelet N. Landau, human speech across the world pulses to the beat of what are called intonation units, short prosodic phrases that occur at a consistent rate of one every 1.6 seconds. The research analyzed over 650 recordings in 48 languages spanning every continent and 27 language families. Using a novel algorithm, the team was able to automatically identify intonation units in spontaneous sp",
        "id": 3408546,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/24/1920233/a-universal-rhythm-guides-how-we-speak-global-analysis-reveals-16-second-units?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Universal Rhythm Guides How We Speak: Global Analysis Reveals 1.6-second Units",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T20:25:53.080762+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T19:34:00+00:00",
        "description": "\"The ultimate test of climate projections is to compare them with what has played out...\" says earth sciences professor Torbj&ouml;rn T&ouml;rnqvist, lead author on a new study published in the open-access journal Earth's Future (published by the American Geophysical Union). \n\nBut after \"decades of observations,\" he says his researchers \"were quite amazed how good those early projections were, especially when you think about how crude the models were back then, compared to what is available now.\"\n\n\n\"For anyone who questions the role of humans in changing our climate, here is some of the best proof that we have understood for decades what is really happening, and that we can make credible projections....\" \n\nA new era of monitoring global sea-level change took off when satellites were launched in the early 1990s to measure the height of the ocean surface. This showed that the rate of global sea-level rise since that time has averaged about one eighth of an inch per year. Only more recen",
        "id": 3408150,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/24/1745208/30-years-of-satellite-data-confirm-predictions-from-early-models-of-sea-level-rise?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "30 Years of Satellite Data Confirm Predictions from Early Models of Sea Level Rise",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T19:19:24.116970+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T18:34:00+00:00",
        "description": "\"Delta Air Lines Flight 1334 was flying from Atlanta to Fort Lauderdale last month when smoke and flames started pouring out of a backpack,\" reports CNN. \"The pilots declared an emergency and diverted to Fort Meyers where the 191 people onboard safely evacuated.\" \n\n\nThe culprit was a passenger's personal lithium-ion battery pack, which had been tucked away in the carry-on bag. At the FAA's William J. Hughes Technical Center for Advanced Aerospace in Atlantic City, New Jersey, fire safety engineers research and demonstrate just how bad it can be. \"Lithium batteries can go into what's called thermal runaway,\" Fire Safety Branch Manager Robert Ochs, explained. \"All of a sudden, it'll start to short circuit ... It will get warmer and warmer and warmer until the structure of the battery itself fails. At that point, it can eject molten electrolyte and flames and smoke and toxic gas....\" \n\n These thermal runaways are difficult to fight. The FAA recommends flight attendants first use a halon ",
        "id": 3407741,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/24/1653202/flames-smoke-toxic-gas-the-danger-of-battery-fires-on-planes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Flames, Smoke, Toxic Gas: The Danger of Battery Fires on Planes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T18:14:29.454464+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T17:34:00+00:00",
        "description": "The mysterious X-37B space-plane &mdash; the U.S. military's orbital test vehicle &mdash; \"serves partly as a platform for cutting-edge experiments,\" writes Space.com \n\nAnd \"one of these experiments is a potential alternative to GPS that makes use of quantum science as a tool for navigation: a quantum inertial sensor.\"\n\nThis technology could revolutionize how spacecraft, airplanes, ships and submarines navigate in environments where GPS is unavailable or compromised. In space, especially beyond Earth's orbit, GPS signals become unreliable or simply vanish. The same applies underwater, where submarines cannot access GPS at all. And even on Earth, GPS signals can be jammed (blocked), spoofed (making a GPS receiver think it is in a different location) or disabled &mdash; for instance, during a conflict... Traditional inertial navigation systems, which use accelerometers and gyroscopes to measure a vehicle's acceleration and rotation, do provide independent navigation, as they can estimat",
        "id": 3407391,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/24/025222/americas-secretive-x-37b-space-plane-will-test-a-quantum-alternative-to-gps-for-the-us-space-force?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America's Secretive X-37B Space Plane Will Test a Quantum Alternative to GPS for the US Space Force",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T17:09:24.344733+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T16:34:00+00:00",
        "description": "The BBC reports a growing trend in music: \"for established (but not superstar) artists to be targeted by fake albums or songs that suddenly appear on their pages on Spotify and other streaming services.\"\n\n\nEven dead musicians have had AI-generated \"new\" material added to their catalogues... According to music industry analysts Luminate, about 99,000 songs are uploaded to streaming services every day, usually via dozens of distribution services, which ask the uploader to submit the artist's details. If that information is incorrect, and a song wrongly gets listed under an existing artist's name, it's down to them or their label to complain and get it removed. \n Spotify took three weeks to remove fakes of folk singer/songwriter Emily Portman, according to the article, \"and she still hasn't regained control of her Spotify artist profile... Considering how the streaming era has already made a big dent in many artists' incomes, Emily Portman says this affair has felt like a \"very low blow\"",
        "id": 3406992,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/08/24/0413234/music-services-caught-streaming-ai-generated-albums-impersonating-real-singers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Music Services Caught Streaming AI-Generated Albums Impersonating Real Singers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T16:04:26.201768+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T15:34:00+00:00",
        "description": "Archer Aviation is \"the official air taxi partner\" of the 2028 Olympic Games in Los Angeles, Electrek reported in May. In June it entered \"a key development phase ahead of full-fledged flight certification and commercial operations\" by completing a piloted flight in its flagship Midnight aircraft, \"demonstrating a conventional takeoff and landing instead of vertical (it can do both).\"\n\n\nDuring that flight, which took place in the skies above Salinas, California, the eVTOL achieved a top speed of 125 mph and a maximum altitude of 1,500 feet above ground level. Most recently, Archer has taken its Midnight eVTOL above Salinas again, achieving its longest flight to date. Per Archer, the recent successful flight in California lasted 31 minutes, and the piloted Midnight eVTOL traveled 55 miles &mdash; the company's longest recorded flight yet with a pilot onboard... [Again with speeds exceeding 125 mph] \n\nUnited Airlines CFO Mike Leskinen, who led the airline's early investment in Archer Av",
        "id": 3406668,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/24/0124257/a-future-air-taxi-archers-electric-evtol-flies-55-miles-in-31-minutes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Future Air Taxi? Archer's Electric eVTOL Flies 55 Miles in 31 Minutes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T14:59:32.491550+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T14:04:00+00:00",
        "description": "\"Good news, everyone! The new version of Mozilla's browser now makes even more extensive use of AI,\" writes the Register, \"providing summaries of linked content and offering developers the ability to add LLM support to extensions.\"\n\nFirefox 142 brings some visible shininess, but due to the combination of regional restrictions and Mozilla's progressive rollout system, not everybody can see all the features just yet... Not geofenced but subject to phased rollout are link previews, for various native-English-speaking regions. Hover over, long-press, or right-click a link and pick Preview Link, and a summary should appear. Mozilla's summary says: \"Previews can optionally include AI-generated key points, which are processed on your device to protect your privacy.\" \n\n\n\n\"Link Previews is gradually rolling out to ensure performance and quality,\" Firefox says in their release notes, \"and is now available in en-US, en-CA, en-GB, en-AU for users with more than 3 GB of available RAM.\" (The notes ",
        "id": 3406327,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/24/0547251/firefox-142s-link-previews-have-a-new-option-ai-generated-summaries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Firefox 142's Link Previews Have a New Option: AI-Generated Summaries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T11:44:19.267026+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T11:34:00+00:00",
        "description": "The Hill reports:\nRussian state-sponsored hackers have targeted thousands of networking devices associated with U.S. critical infrastructure sectors over the past year, the FBI warned Wednesday. The cyber actors are associated with the Russian Federal Security Service's (FSB) Center 16 and have taken aim at a vulnerability in certain Cisco devices, according to an agency public service announcement. \n\nIn some cases, hackers have been able to modify configuration files to enable unauthorized access, which they have used to conduct reconnaissance on networks. This has \"revealed their interest in protocols and applications commonly associated with industrial control systems,\" the FBI said. \n\nCisco's threat intelligence research arm, Talos, explained in a separate advisory that a subcluster of this group, which it has named \"Static Tundra,\" is targeting a seven-year-old vulnerability in the company's Smart Install feature. The firm has offered a patch for the vulnerability, but it remains",
        "id": 3405305,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/24/0638238/fbi-warns-russian-hackers-targeted-thousands-of-critical-us-infrastructure-it-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FBI Warns Russian Hackers Targeted 'Thousands' of Critical US Infrastructure IT Systems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T08:29:26.502193+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T07:34:00+00:00",
        "description": "The Atlantic reports some YouTube users noticed their uploaded videos have since \"been subtly augmented, their appearance changing without their creators doing anything...\" \n\n\"For creators who want to differentiate themselves from the new synthetic content, YouTube seems interested in making the job harder.\"\n\nWhen I asked Google, YouTube's parent company, about what's happening to these videos, the spokesperson Allison Toh wrote, \"We're running an experiment on select YouTube Shorts that uses image enhancement technology to sharpen content. These enhancements are not done with generative AI.\" But this is a tricky statement: \"Generative AI\" has no strict technical definition, and \"image enhancement technology\" could be anything. I asked for more detail about which technologies are being employed, and to what end. Toh said YouTube is \"using traditional machine learning to unblur, denoise, and improve clarity in videos,\" she told me. (It's unknown whether the modified videos are being sh",
        "id": 3404514,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/23/0836256/youtubes-sneaky-ai-experiment-is-social-media-embracing-ai-generated-content?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube's Sneaky AI 'Experiment': Is Social Media Embracing AI-Generated Content?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T04:10:21.319070+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T03:34:00+00:00",
        "description": "\"Google has confirmed that its Battery Health Assistance feature can't be turned off on the Pixel 10 phones,\" reports Android Authority:\n\nGoogle introduced a Battery Health Assistance feature on the Pixel 9a earlier this year. This feature gradually drops your phone's charging speed and battery voltage in the name of battery health. This tool is mandatory on the Pixel 9a but optional on other Pixel phones. However, there's bad news for the Pixel 10 series. Google confirmed to Android Authority that Battery Health Assistance is mandatory on the Pixel 10 series and can't be disabled. That means your phone's charging speed and effective battery life will drop over time... \n\n\nAll smartphone batteries degrade over time, resulting in shorter and shorter endurance. Google says the Pixel 8a and newer Pixel phones can withstand 1,000 charging cycles before their batteries drop down to 80% effective capacity. However, this Battery Health Assistance feature essentially reduces the phone's batter",
        "id": 3403775,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/24/038259/will-googles-battery-health-assistant-throttle-your-pixel-10s-battery?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Will Google's 'Battery Health Assistant' Throttle Your Pixel 10's Battery?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T01:59:24.852690+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T01:34:00+00:00",
        "description": "\"Solar and wind accounted for almost 91% of new U.S. electrical generating capacity added in the first five months of 2025...\" reports Electrek, citing new data from America's Federal Energy Regulatory Commission. \n\n\"Solar has now been the largest source of new generating capacity added each month for 21 consecutive months, starting September 2023.\"\n\nThe 11,518 MW of solar added during the first five months of 2025 was 75.3% of the total new capacity placed into service... Between January and May, new wind provided 2,379 MW of capacity additions, accounting for 15.6% of all new capacity added during the first five months of 2025. For the first five months of 2025, solar and wind comprised 90.9% of new capacity while natural gas (1,381 MW) provided just 9.0%; the remaining 0.1% came from oil (14 MW). Solar + wind are 22.9% of U.S. utility-scale generating capacity. \n\nThe installed capacities of solar (11.1%) and wind (11.8%) are now each more than a tenth of the U.S. total. Taken toget",
        "id": 3403482,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/24/0022205/solar-energy-was-americas-largest-source-of-new-energy-for-21-straight-months?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Solar Energy Was America's Largest Source of New Energy for 21 Straight Months",
        "vote": 0
    }
]