[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T16:54:40.207745+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T16:00:09+00:00",
        "description": "In this session, John Sampson of Meta Reality Labs presents the Interaction SDK (ISDK) by Meta, a free plugin for Unreal Engine that focuses on providing developers with ready-made VR interactions and tools.\n\nThis overview of the high-level elements of the ISDK focuses on its features, uses and goals, and where it might help empower developers to quickly find the iteration of their project that works the best. The session also demonstrates how quickly the ISDK can help set up a VR interaction from scratch in the Unreal Editor, and details how Meta Reality Labs aims to leverage the best parts of Unreal Engine, staying in formation with UE design philosophies.\n\nGiven that this project in active development, Meta is also interested in community feedback to help drive priorities for current and future ISDK features. An overarching goal is to encourage more VR development in the Unreal Engine ecosystem regardless of headset platform, utilizing UE's unique set of features for high-quality g",
        "id": 3406924,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6MX9JMPinqI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6MX9JMPinqI/hqdefault.jpg",
        "title": "Empowering UE VR Developers with Meta's Interaction SDK | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-24T14:44:43.019769+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-24T14:00:27+00:00",
        "description": "Discover how exceptional production value was achieved for the world’s largest car company by integrating emerging technologies with an established Unreal Engine pipeline. \n\nRotor Studios recently implemented an innovative hybrid post-production process to deliver a substantial amount of high-quality CG content for two global car launches, operating under both tight budgets and deadlines. Rotor augmented UE’s powerful Procedural Content Generation Framework (PCG) with Gaussian Splats for additional rapid, photorealistic 3D environment creation. Generative AI was also used to create important additional content for both video and still imagery.   \n\nJoin Scott Bradley of Rotor Studios for a detailed look at how this new workflow helps tackle specific issues like limited locations, time constraints, and shifting client briefs to maximize production dollars and deliver high-quality results. The session features real-world examples and practical techniques successfully applied to in-market",
        "id": 3406247,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=D3HFPDhLAow",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/D3HFPDhLAow/hqdefault.jpg",
        "title": "Elevating Automotive Content: Integrating UE with Gaussian Splats and AI | Unreal Fest Orlando 2025",
        "vote": 0
    }
]