[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T22:33:46.325423+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T21:31:00+00:00",
        "description": "Australia warned it's in danger of missing its 2035 climate targets without deeper pollution cuts, which in turn threatens the nation's ambitions to reach net zero by mid-century. From a report: Emissions are set to fall 48% by 2035 from 2005 levels based on current projections [non-paywalled source], the government said in a report on Thursday. That's short of an official pledge to cut greenhouse gases between 62% and 70%. The forecast doesn't take into account new action planned under the nation's Net Zero Plan. Still, the targets remain achievable and officials plan to take additional measures to meet them, Minister for Climate Change and Energy Chris Bowen said in a speech to parliament.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Australia+Risks+2035+Climate+Goal+Without+Bigger+Emissions+Cuts%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F28%2F1654207%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"",
        "id": 4191047,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/28/1654207/australia-risks-2035-climate-goal-without-bigger-emissions-cuts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australia Risks 2035 Climate Goal Without Bigger Emissions Cuts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T20:05:23.017346+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T20:02:00+00:00",
        "description": "Singapore has claimed the top spot in the 2025 Global Talent Competitiveness Index for the first time, displacing Switzerland from a position the European nation had held since the ranking's inception in 2013. The index, produced by business school INSEAD and the Portulans Institute, measured 135 economies across 77 indicators spanning soft skills, AI talent concentration, and formal education systems. The city-state ranked first globally in formal education and what the report calls \"Generalist Adaptive Skills,\" a category covering soft skills, digital literacy, and innovation-oriented thinking. \n\nA key factor in Singapore's rise was a seven-place jump in talent retention, moving from 38th to 31st. The United States fell from third place in 2023 to ninth this year, its weakest showing in 12 years, due to declines in openness and lifelong learning metrics. High-income European countries continue to dominate the top ten, holding seven positions.<p><div class=\"share_submission\" style=\"p",
        "id": 4190160,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/28/1646244/singapore-takes-top-spot-in-global-talent-index",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Singapore Takes Top Spot in Global Talent Index",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T20:05:23.142019+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T19:00:00+00:00",
        "description": "European leaders have spent years warning that the continent risked falling behind the U.S., China and Russia in the global contest for economic, technological and military dominance, and officials now believe they have reached that point. \n\nThe mood darkened over the summer when Europe found itself on the sidelines as Washington and Beijing negotiated a reset of global trade rules, and turned bleak this month when the White House presented a Ukraine cease-fire plan without consulting European capitals. In July, the EU accepted a trade deal allowing the U.S. to impose 15% tariffs without retaliation. \n\nPresident Trump ignored European calls to pressure Moscow before meeting Vladimir Putin in Alaska in August, telling reporters \"this is not to do with Europe, Europe's not telling me what to do.\" Germany has eased its debt brake to pour $580 billion into a decade-long rearmament program, and the EU has set a 2030 rearmament goal -- defense spending across the region is set to exceed $56",
        "id": 4190161,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/28/1712223/europe-fears-it-cant-catch-up-in-great-power-competition",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Europe Fears It Can't Catch Up in Great Power Competition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T18:51:31.158848+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T18:01:00+00:00",
        "description": "Apple's Podcasts app on both iOS and Mac has been exhibiting strange behavior for months, spontaneously launching and presenting users with obscure religion, spirituality and education podcasts they never subscribed to -- and at least one of these podcasts contains a link attempting a cross-site scripting attack, 404 Media reports. Joseph Cox, a journalist at the outlet, documented the issue after repeatedly finding his Mac had launched the Podcasts app on its own, presenting bizarre podcasts with titles containing garbled code, external URLs to Spotify and Google Play, and in one case, what appears to be XSS attack code embedded directly in the podcast title itself. \n\nPatrick Wardle, a macOS security expert and creator of Objective-See, confirmed he could replicate similar behavior: simply visiting a website can trigger the Podcasts app to open and load an attacker-chosen podcast without any user prompt or approval. Wardle said this creates \"a very effective delivery mechanism\" if a ",
        "id": 4189718,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/28/1531245/someone-is-trying-to-hack-people-through-apple-podcasts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Someone Is Trying To 'Hack' People Through Apple Podcasts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T17:44:18.827307+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T17:01:00+00:00",
        "description": "Australia's streaming quotas have become law. Legislation requiring the likes of Netflix, Disney+ and HBO Max to spend a portion of their local earnings on original Australian content has been passed in parliament, and now comes into effect. From a report: The quotas were announced earlier this month. This will see global streamers with more than one million Australian subscribers made to spend 10% of their total Australian expenditure -- or 7.5% of their revenues -- on local originals, whether they are dramas, children's shows, docs, or arts and educational programs. \n\nFailing to comply with the rules will see streamers fined up to ten times their annual revenues in Australia. This is more than what broadcasters are liable for if they breach their quota rules laws. Streamers will be given three years to get their production operations in line. \n\nStreamers have long opposed government-set quotas and content levies, arguing they already meaningfully invest in the production sectors of ",
        "id": 4189156,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/28/1522252/australias-streaming-quotas-become-law",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australia's Streaming Quotas Become Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T16:37:23.702362+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T16:01:00+00:00",
        "description": "China installed 295,000 industrial robots last year -- nearly nine times as many as the United States and more than the rest of the world combined -- as the country races to automate its manufacturing base amid rising labor costs at home and tariff threats from abroad. \n\nThe nation's stock of operational robots surpassed 2 million in 2024, according to the International Federation of Robotics. Of 131 factories globally recognized by the World Economic Forum for boosting productivity through cutting-edge technologies like AI, 45 are in mainland China compared to three in the US. \n\nAt Midea's washing machine factory in Jingzhou, an AI \"factory brain\" manages 14 virtual agents that coordinate robots and machines on the floor. The home-appliance giant reports that its revenue per employee grew nearly 40% between 2015 and 2024, and processes that once took 15 minutes now take 30 seconds. Down jacket maker Bosideng has cut sample production time from 100 days to 27 days using AI design tool",
        "id": 4188587,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/28/1435209/robots-and-ai-are-already-remaking-the-chinese-economy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Robots and AI Are Already Remaking the Chinese Economy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T15:30:22.610417+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T15:00:00+00:00",
        "description": "Researchers at the Pacific Institute documented 420 water-related conflicts globally in 2024, a record that far surpasses the 355 incidents logged in 2023 and continues a trend that has seen such violence more than quadruple over the past five years. The Oakland-based water think tank's database tracks disputes where water triggered violence, where water systems were targeted, and where infrastructure became collateral damage in broader conflicts. \n\nThe Middle East reported the most incidents at 138, including 66 tied to the Israeli-Palestinian conflict. The Israeli military destroyed more than 30 wells in Rafah and Khan Yunis, and there were numerous reports of settlers destroying pipelines and tanks in the West Bank. The Russia-Ukraine war accounted for 51 incidents, including strikes that disrupted water service in Ukrainian cities.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Violent+Conflict+Over+Water+Hit+a+",
        "id": 4188051,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/28/1356212/violent-conflict-over-water-hit-a-record-last-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Violent Conflict Over Water Hit a Record Last Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T14:16:27.448687+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T14:00:00+00:00",
        "description": "An analysis of submissions to next year's International Conference on Learning Representations has found that roughly one in five peer reviews were fully generated by AI, a discovery that came after researchers including Carnegie Mellon's Graham Neubig grew suspicious of feedback on their manuscripts that seemed unusually verbose and requested non-standard statistical analyses. \n\nNeubig posted on X offering a reward for anyone who could scan the conference's submissions for AI-generated text, and Max Spero, CEO of detection tool developer Pangram Labs, responded the next day. Pangram screened all 19,490 studies and 75,800 peer reviews submitted to ICLR 2026, finding that 21% of reviews were fully AI-generated and more than half showed signs of AI use. The conference had permitted AI tools for polishing text but prohibited falsified content. Each reviewer was assigned five papers to review in two weeks on average -- a load that senior programme chair Bharath Hariharan described as \"muc",
        "id": 4187417,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/28/139247/major-ai-conference-flooded-with-peer-reviews-written-fully-by-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Major AI Conference Flooded With Peer Reviews Written Fully By AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T13:05:40.407404+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T12:30:00+00:00",
        "description": "ChatGPT can browse the web, write code and analyze images, but ask it what time it is and you might get the correct answer, a confident wrong answer, or a polite refusal -- sometimes all three within minutes of each other. \n\nThe problem stems from how large language models work. These systems predict answers based on training data and don't receive constant real-time updates about things like time unless they specifically search the internet. AI robotics expert Yervant Kulbashian told The Verge that a language model \"is only referencing things that have entered this space,\" comparing it to a castaway on an island stocked with books but no watch. \n\nOpenAI can give ChatGPT access to system clocks, and does so through features like Search. But there are tradeoffs: every clock check consumes space in the model's context window, the finite portion of information it can hold at any given moment. Pasquale Minervini, a natural language processing researcher at the University of Edinburgh, sai",
        "id": 4186940,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/28/0135214/why-cant-chatgpt-tell-time",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Can't ChatGPT Tell Time?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T10:59:51.358683+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T10:01:00+00:00",
        "description": "Amazon Web Services has rolled out a DNS resilience feature that allows customers to make domain name system changes within 60 minutes of a service disruption in its US East region, a direct response to the long history of outages at the cloud giant's most troubled infrastructure. \n\nAWS said customers in regulated industries like banking, fintech and SaaS had asked for additional capabilities to meet business continuity and compliance requirements, specifically the ability to provision standby resources or redirect traffic during unexpected regional disruptions. The 60-minute recovery time objective still leaves a substantial window for outages to cascade, and the timing of the announcement -- less than six weeks after an October 20th DynamoDB incident and a subsequent VM problem drew criticism -- underscores how persistent US East's reliability issues have been.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AWS+In",
        "id": 4185974,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/28/0118256/aws-introduces-dns-failover-feature-for-its-notoriously-unreliable-us-east-region",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AWS Introduces DNS Failover Feature for Its Notoriously Unreliable US East Region",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T07:52:34.958084+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T07:31:00+00:00",
        "description": "Breaking free from Microsoft is harder than it looks. Airbus began migrating its 100,000-plus workforce from Office to Google Workspace more than seven years ago and it still hasn't completed the switch. The Register: As we exclusively revealed in March 2018, the aerospace giant told 130,000 employees it was ditching Microsoft's productivity tools for Google's cloud-based alternatives. Then-CEO Tom Enders predicted migration would finish in 18 months, a timeline that, in hindsight, was \"extremely ambitious,\" according to Catherine Jestin, Airbus's executive vice president of digital. \n\nToday, more than two-thirds of Airbus's 150,000 employees have fully transitioned, but significant pockets continue to use Microsoft in parallel. Finance, for example, still relies on Excel because Google Sheets can't handle the necessary file sizes, as some spreadsheets involve 20 million cells. \"Some of the limitations was just the number of cells that you could have in one single file. We'll definite",
        "id": 4184893,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/28/019235/seven-years-later-airbus-is-still-trying-to-kick-its-microsoft-habit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Seven Years Later, Airbus is Still Trying To Kick Its Microsoft Habit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T05:42:15.359655+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T05:01:00+00:00",
        "description": "Canada's Prime Minister Mark Carney has signed an agreement with Alberta's premier that will roll back certain climate rules to spur investment in energy production, while encouraging construction of a new oil pipeline to the West Coast. From a report: Under the agreement, which was signed on Thursday, the federal government will scrap a planned emissions cap on the oil and gas sector and drop rules on clean electricity in exchange for a commitment by Canada's top oil-producing province to strengthen industrial carbon pricing and support a carbon capture-and-storage project. \n\nThe deal, which was hailed by the country's oil industry but panned by environmentalists, signaled a shift in Canada's energy policy in favour of fossil fuel development and is already creating tensions within Carney's minority government. Steven Guilbeault, who served as environment minister under Carney's predecessor Justin Trudeau, said he was quitting the cabinet over concerns that Canada's climate plan was ",
        "id": 4184305,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/28/0042205/canada-rolls-back-climate-rules-to-boost-investments",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Canada Rolls Back Climate Rules To Boost Investments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T03:36:36.258448+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T02:30:00+00:00",
        "description": "The U.S. Patent and Trademark Office has issued new guidelines outlining when inventions created with the help of AI can be patented. From a report: USPTO Director John Squires said on Wednesday in a notice set to be published Friday, that the office considers generative AI systems to be \"analogous to laboratory equipment, computer software, research databases, or any other tool that assists in the inventive process.\" \n\n\"They may provide services and generate ideas, but they remain tools used by the human inventor who conceived the claimed invention,\" the office said. \"When one natural person is involved in creating an invention with the assistance of AI, the inquiry is whether that person conceived the invention under the traditional conception standard.\" \n\nThe office reiterated its guidance from last year that AI itself cannot be considered an inventor under U.S. patent law. However, it rejected the approach taken by the PTO during former President Joe Biden's administration for dec",
        "id": 4183804,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/28/0037205/us-patent-office-issues-new-guidelines-for-ai-assisted-inventions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Patent Office Issues New Guidelines For AI-Assisted Inventions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T01:32:15.485712+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T01:10:00+00:00",
        "description": "The CEO of Epic Games, Tim Sweeney, has argued that platforms like Steam should not label games that are made using AI. From a report: Responding to a post on Twitter from a user who suggested that storefronts drop this tag, the industry exec said that it \"makes no sense\" to flag such content. Sweeney added that soon AI will be a part of the way all games are made. \"The AI tag is relevant to art exhibits for authorship disclosure, and to digital content licensing marketplaces where buyers need to understand the rights situation,\" Sweeney said. \"It makes no sense for game stores, where AI will be involved in nearly all future production.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Epic's+Sweeney+Says+Platforms+Should+Stop+Tagging+Games+Made+With+AI%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F11%2F28%2F0033246%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_lar",
        "id": 4183426,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/28/0033246/epics-sweeney-says-platforms-should-stop-tagging-games-made-with-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Epic's Sweeney Says Platforms Should Stop Tagging Games Made With AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T01:32:15.726264+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T00:28:00+00:00",
        "description": "Platforms including Meta and TikTok will be held liable for financial fraud for the first time under new rules agreed by EU lawmakers in the early hours of Thursday. From a report: The Parliament and Council agreed on the package of rules after eight hours of negotiations to strengthen safeguards against payment fraud. The deal adds another layer of EU regulatory risk for U.S. tech giants, which have lobbied the White House to confront Brussels' anti-monopoly and content moderation rules. \n\n[...] Social media has become rife with financial scams, and MEPs pushed hard to hold both Big Tech and banks liable during legislative negotiations. EU governments, meanwhile, believed banks should be held responsible if their safeguards aren't strong enough. As a compromise, lawmakers agreed that banks should reimburse victims if a scammer, impersonating the bank, swindles them out of their money, or if payments are processed without consent.<p><div class=\"share_submission\" style=\"position:relati",
        "id": 4183427,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/28/0028207/social-media-giants-liable-for-financial-scams-under-new-eu-law",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Social Media Giants Liable For Financial Scams Under New EU Law",
        "vote": 0
    }
]