[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T19:18:52.331121+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T19:00:14+00:00",
        "description": "Are you new to creating in Fortnite? Are you a developer curious about UEFN but unsure about where to start? This session recorded at Unreal Fest Stockholm is all about first steps, including all the learning and community resources to help you develop your first UEFN island.\n\nIn this video, we go in-game to explore templates and examples for learning UEFN, designing certain game modes, and making your own branded experiences. We also go over all the learning materials available to help you get started. \n\nFrom documentation and videos, to exploring the snippets, forums, to the Developer Assistant, there's a wealth of information available to get you started. The talk also touches on the overall island publishing process and resources for more experienced users.\n\nSo what are you waiting for? Watch for everything you need to gear up and jump off the Battle Bus of developing in Fortnite!\n\nLearn more about UEFN here: unrealengine.com/uses/uefn-unreal-editor-for-fortnite\n\n#GameDevelopment,",
        "id": 4189869,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5VeSz98jfoQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5VeSz98jfoQ/hqdefault.jpg",
        "title": "Jump off the Bus and Get Developing in Fortnite! | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T18:06:07.396602+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T17:00:13+00:00",
        "description": "The FBX file format is still pervasively used, but today it’s not the only option, with glTF and USD getting more traction throughout the industry. As a result, support for these formats in Unreal Engine has been substantially improved over recent versions.\n\nThat means now is a good time to give a snapshot of where Unreal Engine currently is in terms of features, maturity for imported file formats, and the new core import framework, Interchange.\n\nFirst, this talk recorded at Unreal Fest Stockholm provides a quick review of the main 3D model formats that are supported within the engine (FBX, glTF, USD) before giving an update on Interchange. \n\nThen, we go in depth on the status, progress, and plans for each of the major formats, and cover the import of rich materials—especially through the MaterialX standard.\n\nLearn more about Unreal Engine here: unrealengine.com\n\n#FBX, #gITF, #USD, #Interchange, #MaterialX, #UnrealEngine, #UE5, #UnrealFestStockholm",
        "id": 4189284,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8CyEgBRdB3Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8CyEgBRdB3Q/hqdefault.jpg",
        "title": "The State of Model Importing Processes in Unreal Engine | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-28T15:53:52.308746+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-28T15:01:26+00:00",
        "description": "Watch Platige Image give an inside look at the advanced techniques used to craft The Witcher 4 Cinematic Reveal Trailer, a project that was rendered entirely in Unreal Engine and created in close collaboration with CD PROJEKT RED and Epic Games. \n\nThis session recorded at Unreal Fest Stockholm explores the development of a custom anamorphic lens system designed to improve Unreal Engine’s native depth-of-field and lens distortion features.\n\nLearn how the team implemented enhanced bokeh rendering, lens distortion, and other effects to replicate the aesthetic of anamorphic cinematography. By combining traditional film optics with interactive technology, Platige Image and CD PROJEKT RED pushed the boundaries of real-time rendering to achieve cinematic fidelity without compromising performance.\n\nWhether you’re a cinematics artist, technical director, or real-time rendering enthusiast, you’ll gain insights into the creative motivations, technical challenges, and engineering solutions that m",
        "id": 4188186,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=e5suKk-Ofyw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/e5suKk-Ofyw/hqdefault.jpg",
        "title": "The Art of Anamorphic Lenses in The Witcher 4 Cinematic Reveal Trailer | Unreal Fest Stockholm 2025",
        "vote": 0
    }
]