[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-28T22:39:22+00:00",
        "description": "<p>Founder Nirav Patel, writing this week on Framework’s company blog:</p>\n\n<blockquote>\n  <p>We went live this morning at the Framework (2nd Gen) Event with\nour biggest set of announcements yet: <a href=\"https://frame.work/desktop\">Framework Desktop</a>,\n<a href=\"https://frame.work/laptop12\">Framework Laptop 12</a>, and the new Ryzen AI 300 Series\n<a href=\"https://frame.work/laptop13\">Framework Laptop 13</a>. You can watch a recording of the\nlivestream on our <a href=\"https://www.youtube.com/@FrameworkComputer\">YouTube channel</a>.</p>\n</blockquote>\n\n<p>Sean Hollister has <a href=\"https://www.theverge.com/24190757/modular-laptops-repairable-upgradable-diy\">a good roundup of the announcements</a> at The Verge. Back in 2021 when Framework debuted with their first laptop, <a href=\"https://daringfireball.net/linked/2021/04/12/the-framework-laptop\">I expressed pithy skepticism</a> regarding their modular approach. I’m still skeptical, but it’s hard not to root for them and cheer for thei",
        "id": 2221167,
        "language": null,
        "link": "https://frame.work/blog/highlights-from-the-framework-2nd-gen-event",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Framework Introduces New Laptops and First Desktop",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-28T18:19:53+00:00",
        "description": "<p>Ben Domenech interviewed President Trump yesterday in the Oval Office, after Trump’s meeting with UK Prime Minister Keir Starmer. The Spectator has published the entire transcript, and I read it so you don’t have to, to get the part about Apple and the UK’s encryption backdoor demand:</p>\n\n<blockquote>\n  <p>BD: But the problem is he runs, your vice president obviously\neloquently pointed this out in Munich, he runs a nation now\nthat is removing the security helmets on Apple phones so that\nthey can —</p>\n\n<p>DJT: We told them you can’t do this.</p>\n\n<p>BD: Yeah, Tulsi, I saw —</p>\n\n<p>DJT: We actually told him… that’s incredible. That’s something,\nyou know, that you hear about with China.</p>\n</blockquote>\n\n<p>It feels very odd to strongly agree with Trump on something, but he’s not wrong about everything.</p>\n\n<p>(Most of the interview is just bananas stuff, ping-ponging all over the place. I swear Trump even goes back to Hannibal Lecter, and his mistaken belief that political asyl",
        "id": 2219358,
        "language": null,
        "link": "https://thespectator.com/topic/spectator-interview-president-donald-trump-full-transcript",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Claims to Have Spoken With Starmer Regarding Apple Encryption Backdoor Demand",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-28T16:53:08+00:00",
        "description": "<p>Hamilton Nolan, in a 2021 piece for The Columbia Journalism Review, under the headline “Bezos Has Been Hands-Off. What if That Changes?”:</p>\n\n<blockquote>\n  <p>Bezos has given the paper the resources to be bigger and better,\nand, by most accounts, pretty much stayed out of the newsroom’s\nhair, besides appearing one day to present a bicycle to former\neditor Marty Baron. The Amazon boss has never been an overtly\npolitical man, except to the extent that he supports whatever\nhelps him stay rich and take over the world with his robotic form\nof ultra-capitalism. But he is not inclined to spend his time on\nthe phone haranguing Post editors about coverage decisions. When\nyou are worth close to $200 billion, your time is too valuable\nfor that.</p>\n\n<p>There is no guarantee, however, that that will always be\ntrue. [...]</p>\n\n<p>Discussing this question with nuance is not easy. The paper will\nalways say that Bezos does not interfere. Bezos himself will\nalways say that he does not interfere.",
        "id": 2218766,
        "language": null,
        "link": "https://www.cjr.org/public_editor/washington-post-public-editor-bezos-has-been-hands-off-what-if-that-changes.php",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What If, Indeed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-28T16:41:33+00:00",
        "description": "<p>Jeff Bezos, in a memo he shared publicly on X:</p>\n\n<blockquote>\n  <p>I shared this note with the Washington Post team this morning:</p>\n\n<p>I’m writing to let you know about a change coming to our\nopinion pages.</p>\n\n<p>We are going to be writing every day in support and defense of two\npillars: personal liberties and free markets. We’ll cover other\ntopics too of course, but viewpoints opposing those pillars will\nbe left to be published by others. [...]</p>\n\n<p>I offered David Shipley, whom I greatly admire, the opportunity to\nlead this new chapter. I suggested to him that if the answer\nwasn’t “hell yes,” then it had to be “no.” After careful\nconsideration, David decided to step away. This is a significant\nshift, it won’t be easy, and it will require 100% commitment — I\nrespect his decision. We’ll be searching for a new Opinion Editor\nto own this new direction.</p>\n</blockquote>\n\n<p>He owns the paper, and the opinion pages are the traditional place for a newspaper’s owner to asser",
        "id": 2218275,
        "language": null,
        "link": "https://x.com/JeffBezos/status/1894757287052362088",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Jeff Bezos Takes Control of the Washington Post’s Opinion Pages; Asserts Exclusive Focus ‘In Support and Defense of Two Pillars: Personal Liberties and Free Markets’",
        "vote": 0
    }
]