[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T23:19:32+00:00",
        "description": "Apple CEO Tim Took took to X today to tease a special Apple product launch happening next week on Wednesday, February 19. 9to5Mac reports: Few specific details were shared, but Cook did include a brief video featuring the Apple logo in silver plus the following words: \"Get ready to meet the newest member of the family. Wednesday, February 19. #AppleLaunch\" [...] The most likely product is the brand new iPhone SE 4, which rumors suggest will pack a variety of powerful upgrades. [...] There are several other hardware possibilities for the February 19 launch. We're currently expecting at least three other products to debut in the near future: the M4 MacBook Air, an M3 iPad Air, and a new 11th generation base model iPad.\n \nReading into the teaser, the silver color does subtly give off Mac vibes, so perhaps the M4 MacBook Air is coming. The circle design in the video has some wondering if AirTag 2 could be the focus of the launch. Bloomberg's Mark Gurman, however, doesn't believe that's t",
        "id": 2109778,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/13/2214200/apple-teases-special-product-launch-coming-next-week?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Teases Special Product Launch Coming Next Week",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T23:19:32+00:00",
        "description": "An anonymous reader quotes a report from KrebsOnSecurity: In mid-March 2024, KrebsOnSecurity revealed that the founder of the personal data removal service Onerep also founded dozens of people-search companies. Shortly after that investigation was published, Mozilla said it would stop bundling Onerep with the Firefox browser and wind down its partnership with the company. But nearly a year later, Mozilla is still promoting it to Firefox users. [Using OneRep is problematic because its founder, Dimitri Shelest, also created and maintained ownership (PDF) in multiple people-search and data broker services, including Nuwber, which contradicts OneRep's stated mission of protecting personal online security. Additionally, OneRep appears to have ties with Radaris, a people-search service known for ignoring or failing to honor opt-out requests, raising concerns about the true intentions and effectiveness of OneRep's data removal service.]\n \nIn October 2024, Mozilla published a statement sayin",
        "id": 2109779,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/13/227253/nearly-a-year-later-mozilla-is-still-promoting-onerep?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nearly a Year Later, Mozilla Is Still Promoting OneRep",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T23:19:32+00:00",
        "description": "The U.S. released Russian cybercriminal Alexander Vinnik, who pleaded guilty to conspiracy to commit money laundering through his cryptocurrency exchange BTC-e, as part of a prisoner swap that freed American schoolteacher Marc Fogel from Russian custody. The Guardian reports: Vinnik, who arrived in Moscow on a flight from Turkey on Tuesday after having been released from custody in California, is accused of owning and operating one of the largest cryptocurrency exchanges in the world, BTC-e, which prosecutors allege facilitated the transfer of billions of dollars in transactions for criminals worldwide. In May 2024, Vinnik pleaded guilty to conspiracy to launder billions of dollars through BTC-e. He was first arrested in Greece in 2017 at the request of the United States after he was charged by a US jury in a 21-count indictment.\n \nThe charges against him included money laundering, conspiracy to commit money laundering, operating an unlicensed money service business and engaging in u",
        "id": 2109777,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/13/2220251/us-releases-russian-cybercriminal-as-part-of-prisoner-swap?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Releases Russian Cybercriminal As Part of Prisoner Swap",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T22:14:42+00:00",
        "description": "Trust in AI is significantly higher in China than in the United States, according to new data from the Edelman Trust Barometer. Axios: Edelman's latest research found that 72% of people in China trust AI, compared with just 32% in the United States. Not only is trust higher in China, it's higher in much of the developing world than it is in the United States, according to Edelman's research. \n\nTrust in AI was highest in India, at 77%, followed by Nigeria at 76%, Thailand at 73% and then China. Only six of the surveyed countries ranked lower than the U.S. in their trust in the new technology: Canada (30%), Germany (29%), the Netherlands (29%), United Kingdom (28%), Australia (25%) and Ireland (24%). Globally, 52% of men said they trusted AI vs. 46% of women, with younger people significantly more trusting of the technology than older folks. In the U.S., AI was trusted more by Democrats (38%) than Republicans (34%) or independents (23%). Higher-income respondents were also more trustin",
        "id": 2109374,
        "language": null,
        "link": "https://slashdot.org/story/25/02/13/2118210/trust-in-ai-is-much-higher-in-china-than-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trust in AI is Much Higher in China Than in the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T21:09:26+00:00",
        "description": "Jeff Bezos' space company Blue Origin is cutting about 10% of its workforce, a significant pullback aimed at slashing costs and refocusing resources after years of development work. From a report: The rocket and engine maker laid out the personnel shakeup during an all-hands employee meeting with Chief Executive Officer Dave Limp Thursday morning, confirming a workforce reduction first reported by Bloomberg. In a memo sent to employees, Limp said the company's growth led to \"more bureaucracy and less focus\" than needed after a hiring spree over the past few years. \n\nAfter years of expansion bankrolled by Bezos, who started Amazon and is the world's third-richest person, Blue Origin is looking to trim manager ranks as it works to clear some $10 billion worth of launch contracts. With a staff of more than 10,000, the layoffs stand to impact over 1,000 roles.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bezos-Backed",
        "id": 2108998,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/13/203243/bezos-backed-blue-origin-to-cut-10-of-its-workforce?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bezos-Backed Blue Origin To Cut 10% of Its Workforce",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T21:09:26+00:00",
        "description": "Nintendo is facing an uphill battle in its U.S. patent fight against Palworld creator Pocketpair, with the United States Patent and Trademark Office rejecting 22 out of 23 patent claims, according to gaming news site GamesFray. \n\nWhile Nintendo has successfully obtained one patent covering character capture mechanics, the company is seeking additional protections related to gameplay features like \"smooth switching of riding objects.\" An attorney representing Nintendo has requested a meeting with patent examiners to discuss the rejected claims. The patent dispute, which began in Japan where Nintendo is seeking $66,000 in damages, could have broader implications for the gaming industry if successful<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nintendo+Patent+Push+Against+Hit+Game+Palworld+Hits+Roadblock+in+US%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F02%2F13%2F2023245%2F%3Futm_source%3Dtwitter%26utm_mediu",
        "id": 2108997,
        "language": null,
        "link": "https://games.slashdot.org/story/25/02/13/2023245/nintendo-patent-push-against-hit-game-palworld-hits-roadblock-in-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nintendo Patent Push Against Hit Game Palworld Hits Roadblock in US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T20:05:55+00:00",
        "description": "An anonymous reader shares a report: JPMorgan Chase CEO Jamie Dimon scorned calls from some employees to soften the bank's five-day return-to-office policy in an animated town hall meeting on Wednesday, according to a recording reviewed by Reuters. Employees at the largest U.S. bank have complained on internal message boards and chats about losing hybrid working arrangements, and one group launched an online petition urging Dimon to reconsider. \n\nWhen asked about the in-person work policy during the staff meeting, he said: \"Don't waste time on it. I don't care how many people sign that fucking petition,\" he said. Instead, Dimon demanded more efficiency and stressed that employees have a choice whether to work at JPMorgan. The CEO told them not to be mad at him, and said that it was a free country.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=JPMorgan+CEO+Dimon+Slams+Return-To-Office+Pushback%3A+https%3A%2F%2Fslas",
        "id": 2108470,
        "language": null,
        "link": "https://slashdot.org/story/25/02/13/197228/jpmorgan-ceo-dimon-slams-return-to-office-pushback?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "JPMorgan CEO Dimon Slams Return-To-Office Pushback",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T20:05:55+00:00",
        "description": "LibreOffice, the open-source office suite that began as StarOffice in 1985, has marked its 40th anniversary with new features that it says could transform how users interact with the software. At the FOSDEM 2025 conference, developers unveiled LibreOffice 25.2, which introduces browser-based functionality and real-time collaboration capabilities through a technology called conflict-free replicated data types. \n\nA key development is ZetaOffice, a version built for the WebAssembly runtime that enables the full office suite to run inside web browsers across operating systems and CPU architectures. The project, which entered public beta last November, allows websites to embed LibreOffice applications with complete user interfaces for editing documents, spreadsheets and presentations. \n\nWhile the browser-based version currently requires about a gigabyte of code and additional memory to run, developers at Allotropia are working to modularize the codebase for faster loading times. The softw",
        "id": 2108471,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/13/1813228/libreoffice-marks-40th-year-with-browser-based-overhaul?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "LibreOffice Marks 40th Year With Browser-Based Overhaul",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T19:01:38+00:00",
        "description": "Baidu will make its AI chatbot Ernie Bot free from April 1, the Chinese search giant said on Thursday, as it faces mounting competition in China's AI market. The company will offer desktop and mobile users free access to Ernie Bot and an advanced search function powered by its latest Ernie 4.0 model, which Baidu claims matches OpenAI's GPT-4 capabilities. \n\nThe move comes as Baidu struggles to gain widespread adoption for its AI services, lagging behind domestic rivals ByteDance's Doubao chatbot and startup DeepSeek, according to data from AI tracker Aicpb.com. Baidu previously charged 59.9 yuan ($8.18) monthly for premium AI-powered search features.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Baidu+Scraps+Fees+For+AI+Chatbot+in+Battle+for+China+Tech+Supremacy%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F13%2F1147245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_i",
        "id": 2107877,
        "language": null,
        "link": "https://slashdot.org/story/25/02/13/1147245/baidu-scraps-fees-for-ai-chatbot-in-battle-for-china-tech-supremacy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Baidu Scraps Fees For AI Chatbot in Battle for China Tech Supremacy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T17:55:49+00:00",
        "description": "The biggest utility in Virginia, home to the global hotspot Data Center Alley, saw demand from data centers in development almost double in the last half of 2024. From a report: Total data center power capacity under contract with Dominion Energy in Virginia, which includes projects from preliminary to advanced stages of development, increased to 40.2 gigawatts in December from 21.4 gigwatts in July, the company said on its earnings call Wednesday. \n\nDemand for power is surging with the development of data centers and artificial intelligence, along with manufacturing and the increasing electrification of the economy. Northern Virginia, which has the biggest concentration of the facilities in the world, has earned the nickname of Data Center Alley.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Data+Center+Power+Demand+Almost+Doubled+in+Virginia%2C+Utility+Says%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F0",
        "id": 2107311,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/13/1356235/data-center-power-demand-almost-doubled-in-virginia-utility-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Data Center Power Demand Almost Doubled in Virginia, Utility Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T17:55:49+00:00",
        "description": "The world's peatlands are \"dangerously underprotected\" despite the colossal amount of climate-heating carbon dioxide already being emitted due to their destruction, a study has warned. From a report: Peatlands occupy just 3% of all land, but contain more carbon than all of the world's forests. However, farmers and miners are draining the peatlands, releasing so much CO2 that if they were a country, they would be the fourth biggest polluter in the world after China, the US and India. \n\nThe first global assessment found that only 17% of the peatlands were within protected areas. This contrasted starkly with other valuable ecosystems such as tropical forests, where 38% were protected, and mangroves (42%). Protection was even lower than the 17% average in the three nations with the most peatlands: Canada, Russia and Indonesia. The US and Brazil completed the top five nations, which contained almost three-quarters of all peatlands, and had higher proportions in protected areas. But the re",
        "id": 2107310,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/13/141239/worlds-largely-unprotected-peatlands-are-ticking-carbon-bomb-warns-study?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "World's Largely Unprotected Peatlands Are Ticking 'Carbon Bomb,' Warns Study",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T16:51:25+00:00",
        "description": "The German antitrust authority has charged Apple with abusing its market power through its app tracking tool and giving itself preferential treatment in a move that could result in daily fines for the iPhone maker if it fails to change its business practices. From a report: The move follows a three-year investigation by the Federal Cartel Office into Apple's App Tracking Transparency feature, which allows users to block advertisers from tracking them across different applications. \n\nThe U.S. tech giant has said the feature allows users to control their privacy but has drawn criticism from Meta Platforms, app developers and startups whose business models rely on advertising tracking. \"The ATTF (app tracking tool) makes it far more difficult for competing app publishers to access the user data relevant for advertising,\" Andreas Mundt, cartel office president, said in a statement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/ho",
        "id": 2106654,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/13/1352250/german-regulator-charges-apple-with-abuse-of-power-over-app-tracking-tool?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "German Regulator Charges Apple With Abuse of Power Over App Tracking Tool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T15:45:49+00:00",
        "description": "Several countries are seeing a decline in PhD enrollments as high living costs, stagnant stipends and limited job prospects deter students from pursuing doctoral degrees. Australia recorded an 8% drop in domestic PhD enrollments from 2018 to 2023 despite population growth of 7%, while Japan's numbers fell to 15,014 in 2023 from 18,232 in 2003, data from education authorities showed. \n\nPhD stipends have failed to keep pace with rising costs. In Australia, doctoral students receive about A$32,000 ($20,000) annually, below minimum wage, while Brazil only increased its graduate grants last year after a decade-long freeze. \n\nThe trend reflects broader concerns about academic careers becoming increasingly precarious, said Claudia Sarrico, a project lead at the Organisation for Economic Co-operation and Development in Paris. Some countries are taking steps to address the issue. Japan's education ministry plans to provide additional funding for doctoral students, while Brazil's 40% increase ",
        "id": 2105663,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/13/1415255/are-phds-losing-their-lustre-why-fewer-students-are-enrolling-in-doctoral-degrees?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Are PhDs Losing Their Lustre? Why Fewer Students Are Enrolling in Doctoral Degrees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T15:45:49+00:00",
        "description": "Convicted Theranos founder, Elizabeth Holmes, had her first interview since being reported to prison in 2023, telling People magazine that she is still working on \"research and inventions\" in the healthcare space. Here's an excerpt from the article: Scheduled for release on April 3, 2032, Holmes says she hopes to travel with her family and to fight for reform of criminal justice system. She recently drafted an American Freedom Act bill -- a seven-page handwritten document -- to bolster the presumption of innocence and change criminal procedure. \"This will be my life's work,\" says Holmes, adding that she is speaking out now as part of her mission to advocate on behalf of incarcerated persons and those ripped away from their children.\n \nAnd, despite her global reputation as a biotech con artist who put lives at risk, she says she's continuing to write patents for new inventions and plans to resume her career in healthcare technology after her release. \"There is not a day I have not con",
        "id": 2105666,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/13/022230/elizabeth-holmes-breaks-her-silence-in-first-interview-from-prison?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Elizabeth Holmes Breaks Her Silence In First Interview From Prison",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T15:45:49+00:00",
        "description": "Longtime Slashdot reader BrendaEM writes: Command-line aside, Cinnamon is the most effective keeper of the Linux desktop flame -- by not abandoning desktop and laptop computers. Yes, there are other desktop GUIs, such as MATE, and the lightweight Xfce, which are valuable options when low overhead is important, such as in LinuxCNC. However, among the general public lies a great expanse of office workers who need a full-featured Linux desktop.\n \nThe programmers who work on GNOME and its family of supporting applications enrich many other desktops do their more than their share. These faithful developers deserve better user-interface leadership. GNOME has tried to steer itself into tablet waters, which is admirable, but GNOME 3.x diminished the desktop experience for both laptop and desktop users. For instance, the moment you design what should be a graphical user interface with words such as \"Activities,\" you ask people to change horses midstream. That is not to say that the command li",
        "id": 2105667,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/13/0150244/is-it-time-for-a-change-in-gnome-leadership?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is It Time For a Change In GNOME Leadership?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T15:45:49+00:00",
        "description": "Elon Musk said Thursday his AI startup xAI will release Grok 3, a new chatbot he claims surpasses existing AI models, within two weeks. Speaking at Dubai's World Governments Summit, Musk cited internal testing showing superior reasoning capabilities compared to current AI systems. \n\nThe announcement comes days after a Musk-led investor group offered $97.4 billion to acquire OpenAI's nonprofit assets. Musk, who co-founded OpenAI before starting rival xAI, is suing to block the AI company's planned transition to a for-profit structure, arguing it contradicts its original mission. \"I think the evidence is there in that OpenAI has gotten this far while having at least a sort of dual profit, non-profit role. What they're trying to do now is to completely delete the non-profit, and that seems really going too far,\" he added.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Musk+Says+New+AI+Chatbot+Outperforms+Rivals%2C+Nea",
        "id": 2105664,
        "language": null,
        "link": "https://slashdot.org/story/25/02/13/1154209/musk-says-new-ai-chatbot-outperforms-rivals-nears-launch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Musk Says New AI Chatbot Outperforms Rivals, Nears Launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T15:45:49+00:00",
        "description": "Members of key congressional oversight committees wrote to the United States' new top intelligence official Thursday to warn that a British order demanding government access to Apple users' encrypted data imperils Americans. From a report: Ron Wyden, a Democrat on the Senate Intelligence Committee, and Andy Biggs, a Republican on the House Judiciary committee, wrote to just-sworn-in National Intelligence Director Tulsi Gabbard and asked her to demand the United Kingdom retract its order. \n\nIf the top U.S. ally does not back off, they said, Gabbard should consider limiting the deep intelligence sharing and cooperation on cybersecurity between the countries. The Post first reported the existence of the confidential British order last week. It directs Apple to create a back door into its Advanced Data Protection offering, which allows users to fully encrypt data from iPhones and Mac computers when putting it in Apple's iCloud storage. Apple cannot retrieve such content even when served ",
        "id": 2105665,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/13/1349244/uk-demand-for-a-back-door-to-apple-data-threatens-americans-lawmakers-say?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Demand For a Back Door To Apple Data Threatens Americans, Lawmakers Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T12:10:54+00:00",
        "description": "An anonymous reader shares a report: Australia's Department of the Treasury has found that Microsoft's Copilot can easily deliver return on investment, but staff exposed to the AI assistant came away from the experience less confident it will help them at work. \n\nThe Department conducted a 14-week trial of Microsoft 365 Copilot during 2024 and asked for volunteers to participate. 218 put up their hands and then submitted to surveys about their experiences using Microsoft's AI helpers. Those surveys are the basis of an evaluation report published on Tuesday. The report reveals that after the trial participants rated Copilot less useful than they hoped it would be, as it was applicable to fewer workloads than they hoped would be the case. \n\nWorkers' views on Copilot's ability to improve their work also fell. Usage of Copilot was lower than expected, with most participants using it two or three times a week, or less. reported using Copilot 2-3 times per week or less. Treasury thinks it ",
        "id": 2104177,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/13/0147255/after-copilot-trial-government-staff-rated-microsofts-ai-less-useful-than-expected?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After Copilot Trial, Government Staff Rated Microsoft's AI Less Useful Than Expected",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T12:10:54+00:00",
        "description": "Astronomers have discovered a perfect ring of light in a galaxy 590 million light-years away. \"The phenomenon is known as an Einstein ring, and it was discovered circumscribing the galaxy NGC 6505 in data collected by the European Space Agency's Euclid space telescope,\" reports SpaceAlert. From the report: [...] In the case of the newly discovered Einstein ring, the light that encircles the near galaxy is from a more distant galaxy, sitting some 4.42 billion light-years away, whose light has been warped by the curvature of space-time around NGC 6505. It's a very lucky arrangement of objects: they are aligned in such a way that the distant galaxy's light is stretched into a perfect ring, with brighter blobs representing replicated images of the galaxy at four points around the ring.\n \nAnd the closeness of NGC 6505 makes it even more astonishing. Only five other lenses have been discovered so close; simulations suggest this new lens only had a 0.05 percent chance of existing, never min",
        "id": 2104178,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/13/0139244/astronomers-amazed-by-perfect-einstein-ring-gleaming-in-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Astronomers Amazed By Perfect 'Einstein Ring' Gleaming In Space",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T12:10:54+00:00",
        "description": "New submitter jms00 writes: A years-long legal battle has quietly escalated into what could become the defining moment for the future of GPLv3, with implications that could reshape software freedom as we know it. \n\nAt issue is whether licensors have the power to impose 'further restrictions' on open-source software, potentially undermining the explicit rights granted to users and developers under AGPLv3, GPLv3, and LGPLv3. \n\nThe outcome of this case, now before the U.S. Court of Appeals for the Ninth Circuit, could set a dangerous precedent, limiting the ability to remove proprietary restrictions from copyleft-licensed software. \n\nWith little public attention on the case, the Software Freedom Conservancy (SFC) has stepped up as a key voice in defense of user rights, filing a critical amicus brief to challenge the lower court's ruling and protect the principles of software freedom.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com",
        "id": 2104176,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/13/0153239/the-future-of-gplv3-hangs-in-the-balance?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Future of GPLv3 Hangs In the Balance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T12:10:54+00:00",
        "description": "An anonymous reader quotes a report from Jalopnik: Experimental submarine the Titan sank in June 2023 while exploring the wreck of the Titanic. The controversial craft imploded while deep beneath the surface of the ocean killing five people onboard, and now a recording of the Titan's final moments has been shared by the National Oceanic and Atmospheric Administration. [...] In the clip, which is available to hear [here], the static sound of the ocean is shattered by a great rumble, which sounds almost like a wave crashing against the beach.\n \nIt's this noise that is thought to be the total failure of the Titan, as LBC adds: \"It is believed that the noise is the 'acoustic signature' of the sub imploding on 18th June 2023. It was recorded by the National Oceanic and Atmospheric Administration device about 900 miles from where the sub was last seen on radar, south of Newfoundland, Canada, US Coast Guard officials announced. The five crew members who died onboard the sub were British exp",
        "id": 2104179,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/12/2346252/titan-sub-implosion-audio-released-for-the-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Titan Sub Implosion Audio Released For the First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T02:31:00+00:00",
        "description": "Apple has released an official Apple TV app for Android phones and tablets that's now available in the Google Play Store. You can download it here. 9to5Google reports: The newest Apple app on Android has a bottom bar with Apple TV+, MLS (Major League Soccer), Downloads for offline viewing, and Search. [...] The video player takes after Apple TV on other platforms, with a portrait mode available. There are convenient shortcuts to activate picture-in-picture, which works inside the app (while browsing) and system-wide, and mute to bring up the system volume bar. Playback is smooth and more stable than other streaming services.\n \nAt launch, the Apple TV app lacks Casting support and there do not appear to be new episode notifications. If you're already signed into Apple Music, you have to log in again to Apple TV. Another notable aspect is support for Google Play Billing instead of requiring out-of-app sign-up on another device. This applies to both the Google TV app (and Apple Music) t",
        "id": 2102492,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/12/2317258/apple-tv-finally-comes-to-android-phones-tablets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple TV Finally Comes To Android Phones, Tablets",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T02:31:00+00:00",
        "description": "Longtime Slashdot reader JoeRobe writes: Scientists associated with the Kilometer Cube Neutrino Telescope, or KM3NeT, have reported detection of an ultra-high energy neutrino deep in the Mediterranean sea. The neutrino reportedly had an energy of 120 million billion electron volts (1.2x10^17 eV, or 120 PeV). This is similar to the energy of ping-pong ball traveling ~5 m/s, but all that energy was packed into a single subatomic particle. According to the New York Times, \"Here, squeezed into one of the tiniest flecks of matter in our universe, that energy amounted to tens of thousands of times more than what can be achieved by the world's premier particle accelerator, the Large Hadron Collider at CERN.\"\n \nAccording to the authors of the Nature paper, the direction of the neutrino \"is compatible with the extension of the galactic interstellar medium,\" but they did not find any catalogued source that would produce such a high energy neutrino, within the Milky Way or from about 40 other g",
        "id": 2102490,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/12/2327213/first-ultra-high-energy-neutrino-detected?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "First Ultra-High-Energy Neutrino Detected",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T02:31:00+00:00",
        "description": "An anonymous reader quotes a report from People: Scarlett Johansson is urging U.S. legislators to place limits on artificial intelligence as an unauthorized, A.I.-generated video of her and other Jewish celebrities opposing Kanye West goes viral. The video, which has been circulating on social media, opens with an A.I. version of Johansson, 40, wearing a white T-shirt featuring a hand and its middle finger extended. In the center of the hand is a Star of David. The name \"Kanye\" is written underneath the hand.\n \nThe video contains A.I.-generated versions of over a dozen other Jewish celebrities, including Drake, Jerry Seinfeld, Steven Spielberg, Mark Zuckerberg, Jack Black, Mila Kunis and Lenny Kravitz. It ends with an A.I. Adam Sandler flipping his finger at the camera as the Jewish folk song \"Hava Nagila\" plays. The video ends with \"Enough is Enough\" and \"Join the Fight Against Antisemitism.\" In a statement to PEOPLE, Johansson denounced what she called \"the misuse of A.I., no matte",
        "id": 2102493,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/12/2154203/scarlett-johansson-calls-for-deepfake-ban-after-ai-video-goes-viral?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scarlett Johansson Calls For Deepfake Ban After AI Video Goes Viral",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-13T02:31:00+00:00",
        "description": "Longtime Slashdot reader theodp writes: Monday brought chilling news reports of the all-count trial convictions of three individuals for a conspiracy to rob and drug people outside of LGBTQ+ nightclubs in Manhattan's Hell's Kitchen neighborhood, which led to the deaths of two of their victims. The defendants were found guilty on all 24 counts, which included murder, robbery, burglary, and conspiracy. \"As proven at trial,\" explained the Manhattan District Attorney's Office in a press release, \"the defendants lurked outside of nightclubs to exploit intoxicated individuals. They would give them drugs, laced with fentanyl, to incapacitate their victims so they could take the victims' phones and drain their online financial accounts [including unauthorized charges and transfers using Cash App, Apple Cash, Apple Pay].\" District Attorney Alvin L. Bragg, Jr. added, \"My Office will continue to take every measure possible to protect New Yorkers from this type of criminal conduct. That includes",
        "id": 2102491,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/12/2339225/woeful-security-on-financial-phone-apps-is-getting-people-murdered?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Woeful Security On Financial Phone Apps Is Getting People Murdered",
        "vote": 0
    }
]