[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T23:33:44.418628+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T23:01:07+00:00",
        "description": "It can be tricky to bring new functionality to a game that's already been in its players’ hands for nearly a year. But that's exactly what GSC Game World has set out to do with a new version of STALKER 2 making its way to the PlayStation 5 and the PS5 Pro. And it seems that the studio has gone all out in its effort to make the best use of the console's unique feature set.\n\nBut can the PS5 version of STALKER 2 set itself apart? We certainly think so, thanks to the manner in which GSC has outlined the changes it brings to the table. This version of the game could be the one to beat thanks to small but significant changes to how you experience your time in The Zone.",
        "id": 3909992,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=ppc54_RrGLw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/ppc54_RrGLw/hqdefault.jpg",
        "title": "STALKER 2: Heart of Chornobyl PS5 Might Just Be The DEFINITIVE EDITION Of The Game",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T21:18:52.996925+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T19:30:21+00:00",
        "description": "The Outer Worlds 2 was a delight to engage with on so many levels. Its many mechanics worked well with Arcadia's vast expanse of land and people to engage with while building on several intriguing RPG mechanics in meaningful ways. It's a game that's so entertaining you might find yourself pouring many hours into exploring its world before you realize that you need a bit of rest.\n\nAnd yet, there were a couple of complaints that we think you might want to know about if you're thinking of seeing what the fuss is all about for yourself. We thought it best to tell you what's good, and what isn't, about the latest success to add to the year's growing list of brilliant titles.",
        "id": 3909197,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=s1BTJymr5AM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s1BTJymr5AM/hqdefault.jpg",
        "title": "The Outer Worlds 2 - 8 Things We Loved,  2 Things We Didn't",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T02:38:05.890863+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T02:00:30+00:00",
        "description": "Double Dragon Revive is about what I expected, even after diluting my expectations so far. A beat 'em up with a recognizable name and very little else going for it. \n\nCoupled with the fact that a single playthrough takes a handful of hours with very little reason to return, Double Dragon Revive feels like it lacks any real impact. Replaying with other characters and alongside friends are two major appeals in the journey, but I simply have no desire, given how boring the stages can be. Some of the enemies stand out – katana-wielding swordmaster that I have to jump attack to break through, my beloved – but for the most part, they're mostly uninteresting and downright boring to fight.\n\nIf you're starved for new games in the genre, there are far better options available.",
        "id": 3904545,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=JPZ39qzsJ3U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JPZ39qzsJ3U/hqdefault.jpg",
        "title": "Double Dragon Revive Review - The Final Verdict",
        "vote": 0
    }
]