[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T21:57:49.907313+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T21:52:00+00:00",
        "description": "North Dakota experienced an almost 40% increase in electricity demand \"thanks in part to an explosion of data centers,\" reports the Washington Post. Yet the state saw a 1% drop in its per kilowatt-hour rates. \n\n\n\"A new study from researchers at Lawrence Berkeley National Laboratory and the consulting group Brattle suggests that, counterintuitively, more electricity demand can actually lower prices...\"\n\n\nBetween 2019 and 2024, the researchers calculated, states with spikes in electricity demand saw lower prices overall. Instead, they found that the biggest factors behind rising rates were the cost of poles, wires and other electrical equipment &mdash; as well as the cost of safeguarding that infrastructure against future disasters... [T]he largest costs are fixed costs &mdash; that is, maintaining the massive system of poles and wires that keeps electricity flowing. That system is getting old and is under increasing pressures from wildfires, hurricanes and other extreme weather. More p",
        "id": 3909647,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/26/2147249/some-us-electricity-prices-are-rising----but-its-not-just-data-centers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some US Electricity Prices are Rising -- But It's Not Just Data Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T20:43:14.963245+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T20:34:00+00:00",
        "description": "\"Snippets of proprietary or copyleft reciprocal code can enter AI-generated outputs, contaminating codebases with material that developers can't realistically audit or license properly.\" \n\n\nThat's the warning from Sean O'Brien, who founded the Yale Privacy Lab at Yale Law School. ZDNet reports:\n\n\n\nOpen software has always counted on its code being regularly replenished. As part of the process of using it, users modify it to improve it. They add features and help to guarantee usability across generations of technology. At the same time, users improve security and patch holes that might put everyone at risk. But O'Brien says, \"When generative AI systems ingest thousands of FOSS projects and regurgitate fragments without any provenance, the cycle of reciprocity collapses. The generated snippet appears originless, stripped of its license, author, and context.\" This means the developer downstream can't meaningfully comply with reciprocal licensing terms because the output cuts the human li",
        "id": 3908879,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/26/208204/does-generative-ai-threaten-the-open-source-ecosystem",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Does Generative AI Threaten the Open Source Ecosystem?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T20:43:15.139643+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T19:34:00+00:00",
        "description": "Can YouTube capture the hours people spending watching \"traditional\" TV? YouTube's CEO recently said its viewership on TV sets has \"surpassed mobile and is now the primary device for YouTube viewing in the U.S.,\" writes The Hollywood Reporter. And YouTube is shelling out big money to stay on top:\n\n\n\nIt's come a long way since the 19-second \"me at the zoo\" video was uploaded in April 2005. Now, per a KPMG report released Sept. 23, YouTube is second only to Comcast in terms of annual content spend, inclusive of payments to creators and media companies, paying out as much as Netflix and Paramount combined, $32 billion... The only question is what genres it will take over next, and how quickly it will do so. From talk shows to scripted dramas to, yes, live sports, there are signs that the platform's ambitions will collide with the traditional TV business sooner rather than later... \n\nYouTube has slowly, then all at once, become the de facto home for what had been late night, not only for ",
        "id": 3908880,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/26/1657219/can-youtube-replace-traditional-tv",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Can YouTube Replace 'Traditional' TV?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T20:43:15.253615+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T18:34:00+00:00",
        "description": "Long-time Slashdot reader schwit1 shares this article from Interesting Engineering:\n\n\nBill Gates-backed TerraPower's innovative Natrium reactor project in Wyoming has cleared a critical federal regulatory hurdle. The US Nuclear Regulatory Commission (NRC) has successfully completed its final Environmental Impact Statement (EIS) for the project, known as Kemmerer Unit 1, and found no adverse impacts that would block its construction. \nThe commission officially recommended that a construction permit be issued to TerraPower subsidiary USO for the facility in Lincoln County. \n\nThis announcement marks a significant milestone, making the Natrium project the first-ever advanced commercial nuclear power plant in the country to successfully complete this rigorous environmental review process... The first-of-a-kind design utilizes an 840 MW (thermal) pool-type reactor connected to a molten salt-based energy storage system. This storage technology is the plant's most unique feature. It is design",
        "id": 3908881,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/26/1814233/bill-gates-backed-345-mwe-advanced-nuclear-reactor-secures-crucial-us-approval",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bill Gates-Backed 345 MWe Advanced Nuclear Reactor Secures Crucial US Approval",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T20:43:15.409401+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T17:34:00+00:00",
        "description": "Has AI just become an easy excuse for firms looking to downsize, asks CNBC:\n\n\n\n\nFabian Stephany, assistant professor of AI and work at the Oxford Internet Institute, said there might be more to job cuts than meets the eye. Previously there may have been some stigma attached to using AI, but now companies are \"scapegoating\" the technology to take the fall for challenging business moves such as layoffs. \"I'm really skeptical whether the layoffs that we see currently are really due to true efficiency gains. It's rather really a projection into AI in the sense of 'We can use AI to make good excuses,'\" Stephany said in an interview with CNBC. Companies can essentially position themselves at the frontier of AI technology to appear innovative and competitive, and simultaneously conceal the real reasons for layoffs, according to Stephany... Some companies that flourished during the pandemic \"significantly overhired\" and the recent layoffs might just be a \"market clearance....\" \n\nOne founder, ",
        "id": 3908882,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/26/1535221/is-ai-responsible-for-job-cuts---or-just-a-good-excuse",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is AI Responsible for Job Cuts - Or Just a Good Excuse?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T17:32:28.280903+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T16:34:00+00:00",
        "description": "\"Around tables cluttered with dice, maps and character sheets, players are doing far more than playing,\" writes Phys.org. It's what sociologists call serious leisure &mdash;\n\"a hobby that demands skill, commitment and personal fulfillment,\" according to an associate professor/program director for Florida International University's Rehabilitation and Recreational Therapy Program:\n\n\n\n\nTo understand what makes D&amp;D more than just a pastime, [associate professor Emily Messina] studies how games like this promote identity-building and connection... Beyond personal expression, Messina says the social and emotional benefits of D&amp;D reflect the very traits that make serious leisure valuable: the sense of identity, the relationships built through shared experiences and the continued connection with the same group of people over time... The game can also provide structure and purpose for people managing mental illness who might not be able to hold a full-time job because of their symptoms",
        "id": 3908409,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/26/034248/dungeons-dragons-brings-purpose-and-fulfillment---and-maybe-structure-and-connection-for-retirees",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dungeons &amp; Dragons Brings Purpose and Fulfillment - and Maybe Structure and Connection for Retirees?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T16:21:07.219881+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T15:34:00+00:00",
        "description": "Data centers were typically \"hulking, chilly buildings lined with stacks of computing gear and bundles of wiring,\" writes the Washington Post. But \"AI experts say that the hubs for computers that power AI are different from the data centers that deliver your Netflix movies and Uber rides. They use a different mix of computer chips, cost a lot more and need a lot more energy. \n\n\"The question is whether it's necessary and illuminating to rebrand AI-specialized data centers, or if calling them 'AI factories' is just marketing hogwash.\"\n\n\nThe AI computer chip company Nvidia seems to have originated the use of \"AI factories.\" CEO Jensen Huang has said that the term is apt because similar to industrial factories, AI factories take in raw materials to produce a product... The term is spreading. Sam Altman, CEO of ChatGPT parent company OpenAI, recently said that he wants a \"factory\" to regularly produce more building blocks for AI. Crusoe, a start-up that's erecting a mammoth \"Stargate\" data",
        "id": 3907959,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/25/0612233/is-the-term-ai-factories-necessary-and-illuminating---or-marketing-hogwash",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is the Term 'AI Factories' Necessary and Illuminating - or Marketing Hogwash?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T15:06:36.022581+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T14:34:00+00:00",
        "description": "Reason.com explores the fortunes of Aurora Innovation, the first company to put heavy-duty commercial self-driving trucks on public roads (and hopes to expand routes to El Paso, Texas, and Phoenix by the end of the year):\n\nAn obscure federal rule is slowing the self-driving revolution. When trucks break down, operators are required to place reflective warning cones and road flares around the truck to warn other motorists. The regulations areexacting: Within 10 minutes of stopping, three warning signals must be set in specific locations around the truck. Auroraaskedthe federal Department of Transportation (DOT) to allow warning beacons to be fixed to the truck itself &mdash; and activated when a truck becomes disabled. The warning beacons would face both forward and backward, would be more visible&#226;than cones (particularly at night), and wouldn't burn out like road flares. Drivers of nonautonomous vehicles could also benefit from that rule change, as they would no longer have to wa",
        "id": 3907542,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/26/0419205/how-americas-transportation-department-blocked-a-self-driving-truck-company",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How America's Transportation Department Blocked a Self-Driving Truck Company",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T12:42:28.954721+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T11:34:00+00:00",
        "description": "\"Japan's new HTV-X cargo spacecraft launched on its first-ever mission to the International Space Station on Saturday,\" reports Space.com:\n\n\nThe robotic HTV-X lifted off atop an H3 rocket from Japan's Tanegashima Space Center at 8 p.m. EDT (0000 GMT and 9 a.m local Japan time on October 26). It is expected to arrive at the station for its capture and berthing on Wednesday (Oct. 29) at about 11:50 a.m. EDT (1550 GMT)... \n\nThe HTV-X's potential uses also extend beyond the ISS, according to JAXA. The agency envisions it aiding \"post-ISS human space activities in low Earth orbit\" as well as possibly flying cargo to Gateway, the space station NASA may build in lunar orbit as part of its Artemis program. \n\nHTV-X's debut increases the stable of ISS cargo craft by one-third. The currently operational freighters are Russia's Progress vehicle and Cygnus and Dragon, spacecraft built by the American companies Northrop Grumman and SpaceX, respectively. Only Dragon is reusable; the others (includin",
        "id": 3906714,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/26/0450217/japan-launches-a-new-cargo-spacecraft-to-iss-for-the-first-time",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan Launches a New Cargo Spacecraft to ISS for the First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T07:58:44.476726+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T07:34:00+00:00",
        "description": "25 years ago today on Slashdot... \n\nHemos linked to a site called Joystick101 describing the\ncrowd camping out to buy the limited number of just-released PlayStation 2 consoles (and games). \"500,000 lucky members of the American gaming public are sneaking a few minutes of playing Madden 2001, Tekken, or Ridge Racer V before school or work...\" wrote Joystick101. That same day CmdrTaco posted reports PS2s were selling for over $1,000 on eBay. And then Timothy updated that post to note someone saw one selling for $5,000. \n\n\n\nBut there was a third PS2 link posted on October 26, 2000... Hemos wrote a post titled \"The PS2 &mdash; A Betamax In the Making?\" &mdash; linking to an article by\nMark Pesce (co-inventor of VRML and, in 1993, an Apple consulting engineer). \"Microsoft promises Xbox will deliver ten times the performance of the PS2,\" Pesce wrote, noting Microsoft had partnered with Intel and \"upstart video-chip developer Nvidia\":\n\n\n\n\nThe strangest thing about this battle of giants is t",
        "id": 3905457,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/25/2228255/25-years-ago-today-a-playstation-shopping-frenzy---but-would-microsofts-xbox-make-it-obsolete",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "25 Years Ago Today:  A PlayStation Shopping Frenzy - But Would Microsoft's Xbox Make It Obsolete?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T04:24:55.100959+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T03:49:00+00:00",
        "description": "Critics question why basic flaws like buffer overflows, command injections, and SQL injections are \"being exploited remain prevalent in mission-critical codebases maintained by companies whose core business is cybersecurity,\" writes CSO Online. Benjamin Harris, CEO of cybersecurity/penetration testing firm watchTowr tells them that \"these are vulnerability classes from the 1990s, and security controls to prevent or identify them have existed for a long time. There is really no excuse.\"\n\n\n\nEnterprises have long relied on firewalls, routers, VPN servers, and email gateways to protect their networks from attacks. Increasingly, however, these network edge devices are becoming security liabilities themselves... Google's Threat Intelligence Group tracked 75 exploited zero-day vulnerabilities in 2024. Nearly one in three targeted network and security appliances, a strikingly high rate given the range of IT systems attackers could choose to exploit. That trend has continued this year, with si",
        "id": 3904862,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/26/0345238/are-network-security-devices-endangering-orgs-with-1990s-era-flaws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are Network Security Devices Endangering Orgs With 1990s-Era Flaws?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T02:05:44.099261+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T01:44:00+00:00",
        "description": "Thursday Ubuntu-maker Canonical \"officially launched Canonical Academy, a new certification platform designed to help professionals validate their Linux and Ubuntu skills through practical, hands-on assessments,\" writes the blog It's FOSS:\n\n\nFocusing on real-world scenarios, Canonical Academy aims to foster practical skills rather than theoretical knowledge. The end goal? Getting professionals ready for the actual challenges they will face on the job. The learning platform is already live with its first course offering, the System Administrator track (with three certification exams), which is tailored for anyone looking to validate their Linux and Ubuntu expertise. \n\nThe exams use cloud-based testing environments that simulate real workplace scenarios. Each assessment is modular, meaning you can progress through individual exams and earn badges for each one. Complete all the exams in this track to earn the full Sysadmin qualification... Canonical is also looking for community members ",
        "id": 3904500,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/26/0141222/finally-you-can-now-be-a-certified-ubuntu-sys-adminlinux-user",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Finally, You Can Now be a 'Certified' Ubuntu Sys-Admin/Linux User",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-26T00:56:29.380785+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-26T00:38:00+00:00",
        "description": "\"Exxon Mobil sued California on Friday,\" reports Reuters, \"challenging two state laws that require large companies to publicly disclose their greenhouse gas emissions and climate-related financial risks.\"\n\n\nIn a complaint filed in the U.S. District Court for the Eastern District of California, Exxon argued that Senate Bills 253 and 261 violate its First Amendment rights by compelling Exxon to \"serve as a mouthpiece for ideas with which it disagrees,\" and asked the court to block the state of California from enforcing the laws. Exxon said the laws force it to adopt California's preferred frameworks for climate reporting, which it views as misleading and counterproductive... \n\n\nThe California laws were supported by several big companies including Apple, Ikea and Microsoft, but opposed by several major groups such as the American Farm Bureau Federation and the U.S. Chamber of Commerce, which called them \"onerous.\" SB 253 requires public and private companies that are active in the state ",
        "id": 3904268,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/26/0034252/exxon-sues-california-over-climate-disclosure-laws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Exxon Sues California Over Climate Disclosure Laws",
        "vote": 0
    }
]