[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T23:26:34+00:00",
        "description": "Fedora has proposed a major change for its upcoming version 43 release that aims to achieve 99% package reproducibility, addressing growing concerns about supply-chain security. According to the change proposal announced March 31, Fedora has already reached 90% reproducibility through infrastructure changes including \"clamping\" file modification times and implementing a Rust-based \"add-determinism\" tool that standardizes metadata. The remaining 10% will require individual package maintainer involvement, treating reproducibility failures as bugs. \n\nThe effort will use a public instance of rebuilderd to independently verify that binary packages can be reproduced from source code. Unlike Debian's bit-by-bit reproducibility definition, Fedora allows differences in package signatures and some metadata while requiring identical payloads. The initiative follows similar efforts by Debian and openSUSE, and comes amid heightened focus on supply-chain security after the recent XZ backdoor incid",
        "id": 2539273,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/04/11/2143211/fedora-targets-99-package-reproducibility-by-october?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Fedora Targets 99% Package Reproducibility by October",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T22:21:09+00:00",
        "description": "Germany will get a new \"super-high-tech ministry\" responsible for research, technology, and aerospace, according to the coalition agreement published by the incoming government this week. From a report: The announcement is one of several nods to science in the 144-page agreement, unveiled on 9 April following weeks of negotiations between the center-right Christian Democrats (CDU) and its sister party, the Christian Social Union in Bavaria (CSU) -- who together won the most seats in February's federal elections -- and the center-left Social Democrats. The agreement is expected to be formally approved by the three parties by early May, paving the way for CDU leader Friedrich Merz to be elected chancellor. \n\n[...] The new agreement lists a number of scientific priorities for the new government, including support for artificial intelligence, quantum technologies, biotechnology, microchip development and production, and fusion energy. \"Our goal is that the world's first fusion reactor sh",
        "id": 2538948,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/11/2121251/germany-to-create-super-high-tech-ministry-for-research-technology-and-aerospace?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Germany To Create 'Super-High-Tech Ministry' For Research, Technology and Aerospace",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T21:16:11+00:00",
        "description": "The ubiquitous but often overlooked Wi-Fi router lies at the heart of one of Washington's biggest national security dilemmas -- and a rift between two brothers on opposite sides of the Pacific. From a report: US investigators are probing the China ties of TP-Link, the new American incarnation of a consumer Wi-Fi behemoth, following its rapid growth and a spate of cyber attacks by Chinese state-sponsored actors targeting many router brands. The inquiry is testing whether TP-Link's corporate makeover represents enough of a divorce from China to spare it from a ban in a crucial market. \n\nWhile TP-Link's recent restructuring split the company into separate US- and China-headquartered businesses, a Bloomberg News investigation found that the resulting American venture still has substantial operations in mainland China. If US officials conclude TP-Link's China connections pose an \"unacceptable risk,\" they could use a powerful new authority to ban the company from the US. Such an outcome co",
        "id": 2538617,
        "language": null,
        "link": "https://slashdot.org/story/25/04/11/2050255/wi-fi-giant-tp-links-us-future-hinges-on-its-claimed-split-from-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wi-Fi Giant TP-Link's US Future Hinges on Its Claimed Split From China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T20:11:18+00:00",
        "description": "An anonymous reader shares a report: China's Anker, one of Amazon's largest sellers offering products from power banks to phone cases, has raised prices on a fifth of its products on the U.S. platform since Thursday, in a sign that tariffs on Chinese goods are being passed on to U.S. shoppers. \n\nSome 127 Anker products have seen an average increase of 18% since Thursday last week, with the majority of those occurring after Monday, April 7, when U.S. President Donald Trump added an extra 50% import duty on Chinese goods, according to data from e-commerce services provider SmartScout. U.S. import tariffs on Chinese products now stand at 145%. Beijing on Friday raised its tariff on U.S. goods to 125%, as a trade war between the world's top two economies intensifies.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Chinese+Electronics+Firm+Anker+Starts+Raising+Prices+on+Amazon%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2",
        "id": 2538218,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/11/1546213/chinese-electronics-firm-anker-starts-raising-prices-on-amazon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chinese Electronics Firm Anker Starts Raising Prices on Amazon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T20:11:18+00:00",
        "description": "France is to tighten its ban on the use of mobile phones in middle schools, making pupils at the ages of 11 to 15 shut away their devices in a locker or pouch at the start of the day and access them again only as they are leaving. A report adds: The education minister told the senate she wanted children to be fully separated from their phones throughout the school day in all French middle schools from September. Elisabeth Borne said: \"At a time when the use of screens is being widely questioned because of its many harmful effects, this measure is essential for our children's wellbeing and success at school.\" \n\nIn 2018, France banned children from using mobile phones in all middle schools -- known as colleges. Phones must remain switched off in schoolbags and cannot be used anywhere in the school grounds, including at break-time. Schools have reported a positive effect, with more social interaction, more physical exercise, less bullying and better concentration. But some did report a ",
        "id": 2538217,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/04/11/1653218/france-to-tighten-mobile-phone-ban-in-middle-schools?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "France To Tighten Mobile Phone Ban in Middle Schools",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T20:11:18+00:00",
        "description": "Director James Cameron argues that blockbuster filmmaking can only survive if the industry finds ways to \"cut the cost of [VFX] in half,\" with AI potentially offering solutions that don't eliminate jobs. \n\n\"If we want to continue to see the kinds of movies that I've always loved and that I like to make -- 'Dune,' 'Dune: Part Two,' or one of my films or big effects-heavy, CG-heavy films -- we've got to figure out how to cut the cost of that in half,\" Cameron said. \n\nRather than staff reductions, Cameron envisions AI accelerating VFX workflows: \"That's about doubling their speed to completion on a given shot, so your cadence is faster and your throughput cycle is faster, and artists get to move on and do other cool things.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=James+Cameron%3A+AI+Could+Help+Cut+VFX+Costs+in+Half%2C+Saving+Blockbuster+Cinema%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F04%2F11%",
        "id": 2538219,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/11/154250/james-cameron-ai-could-help-cut-vfx-costs-in-half-saving-blockbuster-cinema?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "James Cameron: AI Could Help Cut VFX Costs in Half, Saving Blockbuster Cinema",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T20:11:18+00:00",
        "description": "Almost 200 pesticides have been found by a study examining dust in homes around Europe, as scientists say regulators need to take \"toxic cocktails\" of chemicals into account when banning or restricting the use of pesticides. From a report: Scientists say their research supports the idea that regulators should assess the risks posed by pesticides when they react with other chemicals, as well as individually. They say this should apply to substances already in use, as well as those yet to be approved. \n\nIn preliminary findings from the largest study of its kind, scientists examining household dust from homes in 10 European countries in 2021 detected 197 pesticides in total. More than 40% of the pesticides found in the dust have been linked to highly toxic effects, including cancer and disruption of the hormonal system in humans. \n\nThe number of pesticides in each home ranged between 25 and 121, and levels of pesticides tended to be higher in the homes of farmers. Prof Paul Scheepers, o",
        "id": 2538220,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/11/147243/study-finds-almost-200-pesticides-in-european-homes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Study Finds Almost 200 Pesticides in European Homes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T20:11:18+00:00",
        "description": "Ubisoft has triggered fresh debate over digital ownership by claiming in court that customers who purchased The Crew never truly owned the game. The legal battle began when California plaintiffs sued after Ubisoft deactivated servers for the 2014 racing title, rendering it unplayable beyond a restricted demo version. \n\nUnlike most delisted games where previously purchased copies remain accessible, Ubisoft completely removed The Crew from customers' libraries. The plaintiffs, who bought physical copies years ago, contend that Ubisoft misled consumers and point to competitors who provided offline modes for end-of-life titles. \n\nUbisoft counters that packaging clearly stated purchases only granted temporary licenses. The case has expanded to include claims about in-game currency qualifying as gift certificates under California law and activation codes promised to work until 2099.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/hom",
        "id": 2538216,
        "language": null,
        "link": "https://games.slashdot.org/story/25/04/11/189218/ubisoft-argues-players-dont-own-their-games-in-wake-of-the-crew-lawsuit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ubisoft Argues Players Don't Own Their Games in Wake of The Crew Lawsuit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T12:35:22+00:00",
        "description": "Defense Secretary Pete Hegseth has ordered the termination of multiple IT and consulting contracts with firms including Accenture, Deloitte, and Booz Allen Hamilton, describing them as \"wasteful spending.\" \n\nA Department of Defense memo indicates the cuts target the Defense Health Agency's consulting services contract and the Air Force's agreement with Accenture to \"re-sell third-party Enterprise Cloud IT Services,\" services the government can \"already fulfill directly with existing procurement resources.\" \n\nThe terminations also include 11 other contracts supporting \"non-essential\" activities like DEI programs, climate initiatives, and COVID-19 response efforts. The cuts represent $5.1 billion in spending and will yield nearly $4 billion in savings, according to Hegseth. The funds will be redirected toward \"critical priorities to Revive the Warrior Ethos, Rebuild the Military, and Reestablish Deterrence,\" with Hegseth noting the money would better serve \"healthcare for our warfighte",
        "id": 2534602,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/11/0712244/pentagon-axes-51-billion-in-it-and-consulting-contracts-with-accenture-deloitte?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pentagon Axes $5.1 Billion in IT and Consulting Contracts With Accenture, Deloitte",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T09:20:15+00:00",
        "description": "China responded to President Trump's tariffs on Friday, raising its own tariffs on American goods to 125%, from 84%. The New York Times: The announcement by China's State Council came after Trump administration officials clarified on Thursday that China was now facing a minimum tariff rate of 145% on all exports to United States. China said its new tariffs will take effect on Saturday. China said it plans to ignore any further increases announced by Washington from here. Bloomberg: In a statement following China's retaliatory move, the Commerce Ministry said Washington's repeated use of excessively high tariffs has become little more than a numbers game -- economically meaningless and revealing its use of tariffs as a tool for bullying and coercion. \"It's become a joke,\" the ministry said. CNN: The trade war between the world's two economic superpowers has tanked international markets and fueled fears of a global recession. \n\n\"There are no winners in a trade war, and going against th",
        "id": 2533326,
        "language": null,
        "link": "https://slashdot.org/story/25/04/11/0840215/china-raises-tariffs-on-us-imports-to-125?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Raises Tariffs on US Imports To 125%",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T07:10:37+00:00",
        "description": "The Food and Drug Administration says it would begin phasing out animal testing requirements for antibody therapies and other drugs and move toward AI-based models and other tools it deems \"human-relevant.\" Axios: The FDA said it would launch a pilot program over the next year allowing select developers of monoclonal antibodies to use a primarily non-animal-based testing strategy. Commissioner Marty Makary in a statement said the shift would improve drug safety, lower research and development costs and address ethical concerns about animal experimentation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FDA+Plans+To+Phase+Out+Animal+Testing+Requirements%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F04%2F11%2F0624212%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.",
        "id": 2532722,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/11/0624212/fda-plans-to-phase-out-animal-testing-requirements?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FDA Plans To Phase Out Animal Testing Requirements",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T06:05:36+00:00",
        "description": "Some of the best AI models today still struggle to resolve software bugs that wouldn't trip up experienced devs. TechCrunch: A new study from Microsoft Research, Microsoft's R&amp;D division, reveals that models, including Anthropic's Claude 3.7 Sonnet and OpenAI's o3-mini, fail to debug many issues in a software development benchmark called SWE-bench Lite. The results are a sobering reminder that, despite bold pronouncements from companies like OpenAI, AI is still no match for human experts in domains such as coding. \n\nThe study's co-authors tested nine different models as the backbone for a \"single prompt-based agent\" that had access to a number of debugging tools, including a Python debugger. They tasked this agent with solving a curated set of 300 software debugging tasks from SWE-bench Lite. \n\nAccording to the co-authors, even when equipped with stronger and more recent models, their agent rarely completed more than half of the debugging tasks successfully. Claude 3.7 Sonnet had",
        "id": 2532481,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/04/11/0519242/ai-models-still-struggle-to-debug-software-microsoft-study-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Models Still Struggle To Debug Software, Microsoft Study Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T03:53:49+00:00",
        "description": "Military chiefs at Nato have been warned of global internet blackouts following a string of suspected Russian attacks on subsea cables. From a report: Telecoms companies including Vodafone, O2 owner Telefonica and Orange have written to UK, EU and Nato officials warning that a rise in sabotage incidents was putting critical services at risk. In an open letter, they wrote: \"The repercussions of damage to subsea cables extend far beyond Europe, potentially affecting global internet and power infrastructure, international communications, financial transactions and critical services worldwide.\" \n\nIt comes after a spike in incidents relating to fibre optic cables on seabeds that carry huge volumes of data, voice and internet traffic between countries. More than 500 cables carry around 95pc of all international data, while their remote location makes them difficult and costly to monitor. At least 11 subsea cables have been damaged in the Baltic Sea since October 2023 and similar outages ha",
        "id": 2531953,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/11/0245251/russian-cable-attacks-threaten-to-cut-off-worlds-internet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Russian Cable Attacks 'Threaten To Cut Off World's Internet'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T02:48:06+00:00",
        "description": "Microsoft is starting to gradually roll out a preview of Recall, its feature that captures screenshots of what you do on a Copilot Plus PC to find again later, to Windows Insiders. From a report: This new rollout could indicate that Microsoft is finally getting close to launching Recall more widely. Microsoft originally intended to launch Recall alongside Copilot Plus PCs last June, but the feature was delayed following concerns raised by security experts. The company then planned to launch it in October, but that got pushed as well so that the company could deliver \"a secure and trusted experience.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+is+About+To+Launch+Recall+For+Real+This+Time%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F04%2F11%2F0143227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.face",
        "id": 2531768,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/11/0143227/microsoft-is-about-to-launch-recall-for-real-this-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft is About To Launch Recall For Real This Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T00:38:34+00:00",
        "description": "Albert Saniger, the founder and former CEO of Nate, an AI shopping app that promised a \"universal\" checkout experience, was charged with defrauding investors on Wednesday, according to a press release from the U.S. Department of Justice. From a report: Founded in 2018, Nate raised over $50 million from investors like Coatue and Forerunner Ventures, most recently raising a $38 million Series A in 2021 led by Renegade Partners. Nate said its app's users could buy from any e-commerce site with a single click, thanks to AI. In reality, however, Nate relied heavily on hundreds of human contractors in a call center in the Philippines to manually complete those purchases, the DOJ's Southern District of New York alleges. \n\nSaniger raised millions in venture funding by claiming that Nate was able to transact online \"without human intervention,\" except for edge cases where the AI failed to complete a transaction. But despite Nate acquiring some AI technology and hiring data scientists, its app",
        "id": 2531339,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/11/0018218/fintech-founder-charged-with-fraud-after-ai-shopping-app-found-to-be-powered-by-humans-in-the-philippines?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Fintech Founder Charged With Fraud After 'AI' Shopping App Found To Be Powered By Humans in the Philippines",
        "vote": 0
    }
]