[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T15:30:34+00:00",
        "description": "There are so many games to be hyped about in the first half of 2025, especially for triple-A blockbusters. However, there's something special about Clair Obscur: Expedition, an upcoming role playing game.\n\nLaunching on April 24th for Xbox Series X/S, PS5, and PC, it features some truly gorgeous art direction and fidelity. Best of all, it only costs $49.99, a miracle in today's retail space, where releases are approaching $80.\n\nWhat am I looking forward to doing, between becoming a parry master, exploring every level for secrets, bonding with party members, and creating some broken builds? Surprisingly, quite a bit. Find out more here.",
        "id": 2536207,
        "language": null,
        "link": "https://www.youtube.com/watch?v=yri1OMGvJ38",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yri1OMGvJ38/hqdefault.jpg",
        "title": "What I’m Most HYPED About In Clair Obscur: Expedition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-11T09:30:15+00:00",
        "description": "Respawn Entertainment is responsible for some of the best games of this generation, namely the Star Wars Jedi series. However, many of us really got to know it thanks to Titanfall. Released in 2014 for Xbox platforms and PC, it felt like a breath of fresh air in the competitive shooter space.\n\nAnd just when a sequel seemed unlikely, Respawn delivered Titanfall 2 in 2016, an even better multiplayer experience with an excellent single-player campaign that put so many other titles to shame. Sadly, almost a decade has passed and there's no word on a sequel. Random rumors emerge every few years, providing hope, only to be disproven and fade away.\n\nWhat the heck is going on with the Titanfall franchise? Why won't Electronic Arts greenlight Titanfall 3? Join us as we dive into the matter and wonder if there's any space for a sequel in today's market.",
        "id": 2533733,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QcQBAIt3cj0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QcQBAIt3cj0/hqdefault.jpg",
        "title": "Where The HELL IS TITANFALL 3?",
        "vote": 0
    }
]