[
    {
        "age": null,
        "album": "",
        "author": "/u/GamingNomad",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T23:22:06.872305+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T23:01:05+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I read slightly more literature when I was younger. With so many responsibilities lately I just didn&#39;t feel it was worth looking back into, I eventually did it and made it a habit to read before bed. </p> <p>I just want to say that reading in bed before sleep is probably one of the best habits I&#39;ve picked up in years. I&#39;ve always had trouble sleeping and it has affected me in a lot of (bad) ways. It didn&#39;t just help me sleep, it honestly just felt very relaxing, almost meditative in a blissful way.</p> <p>After reading The Hobbit, I decided to read LotR. I have to commend this guy for the amount of detail he put. Do a lot of authors do that? I felt the way he described the geography was sort of a two-edged sword; it took some effort and time but if I got through it and understood it the world felt more alive, but if not it just felt like a jumble and a lot of things were difficult to decipher.</p> <p>I did end up learning a lot of new ",
        "id": 3619563,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nli5u3/i_finally_finished_lord_of_the_rings",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "I finally finished Lord of the Rings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/RecordWell",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T22:10:24.287736+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T21:59:41+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I can start by saying that I really enjoyed this book and Tolstoy really nailed it when it comes to conveying all the emotions each character expresses, making them all feel real (The ice skating scene where Levin acted awkward around Kitty was so relatable lol). I also love how he portrayed the aristocratic society of Russia, the fancy balls, the social dynamics and the way he presented the scandals and gossip happening within.</p> <p>The story itself was truly a journey. Tolstoy built the characters up with deep psychological understanding, precisely capturing their desires, problems, and their emotional connections towards one another. Like Anna, for example, started off as a respected woman in the society but as her story progressed, and the consequences of her actions (like the affair she had with Vronsky) came into fruition, she spiraled into a world of jealousy and delusion which deteriorated her mentally and ultimately led to her suicide (at a",
        "id": 3619214,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nlgr2u/anna_karenina_i_have_mixed_feelings_after_reading",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anna Karenina - I have mixed feelings after reading this novel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/zsreport",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T22:10:23.891442+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T21:22:02+00:00",
        "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/books/comments/1nlfvcl/book_ban_spirals_as_district_bans_hundreds_of/\"> <img src=\"https://external-preview.redd.it/wZFqj3cPhAVMjSNLQ3LJwbM1YGj4Pusl0TNUtZcMamo.jpeg?width=320&amp;crop=smart&amp;auto=webp&amp;s=039cfdca2291791ce52dbae56cf658b83957edd1\" alt=\"Book ban spirals as district bans hundreds of titles\" title=\"Book ban spirals as district bans hundreds of titles\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/zsreport\"> /u/zsreport </a> <br/> <span><a href=\"https://www.chron.com/news/article/lamar-consolidated-isd-bans-hundreds-books-21057442.php\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1nlfvcl/book_ban_spirals_as_district_bans_hundreds_of/\">[comments]</a></span> </td></tr></table>",
        "id": 3619212,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nlfvcl/book_ban_spirals_as_district_bans_hundreds_of",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://external-preview.redd.it/wZFqj3cPhAVMjSNLQ3LJwbM1YGj4Pusl0TNUtZcMamo.jpeg?width=320&crop=smart&auto=webp&s=039cfdca2291791ce52dbae56cf658b83957edd1",
        "title": "Book ban spirals as district bans hundreds of titles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/No_Instance18",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T22:10:24.119865+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T21:01:12+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Sorry if this is dumb, but for reference, I&#39;m reading John Ciardi&#39;s Translation of the Divine Comedy. I&#39;m on Canto XXXII of Inferno: Circle Nine. And while I find it funny at times, I feel very detached from it all. I do not believe in any of this so that may contribute to my attitude but I have grown up in the US South so I have some cultural/religious reference. </p> <p>But I see people online raving about how it makes them feel and I just feel like I&#39;m missing something. I do have depression but I don&#39;t seem to have this problem with other books, usually. People are being mauled and burned and having horrible things happen to them and I just don&#39;t feel anything about it. </p> <p>TL;DR: What is your experience with Dante&#39;s Divine Comedy? Is it normal to be very detached from it or do I need a better translation or something else? </p> <p>Thanks!</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit",
        "id": 3619213,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nlfd05/the_divine_comedy_is_it_normal_to_feel_detached",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Divine Comedy - Is it normal to feel detached from everything being said or am I missing something?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/kuhteen",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T17:10:28.689658+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T16:43:27+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>The title sounds a bit clunky so let me explain. I recently discovered I like books set in a fantastical setting with a romantic subplot. I just finished a whole series and then finished another book like that and loved both so, so much.</p> <p>I was given a bunch of recommendations based on my prompt which I’m going through since it’s the only type of book I want to read right now. However, I don’t want myself to be “burnt out” of this kind of novel from reading it so much. I’m reading a book from the same author but different series, and I’m wondering if I’m not seemingly enjoying it because it was her first (?) series, if I don’t like the premise in general, or if I’m reading too much of what I already enjoy, and it doesn’t feel “special” anymore.</p> <p>So when you read and know what you like, do you actively just seek out that kind of book, or do you try to vary it to not get bored? Obviously, I’m not saying you should read books that don’t inter",
        "id": 3617035,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nl8nwe/when_you_find_what_you_like_in_a_book_do_you_try",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "When you find what you like in a book, do you try to only read that thing or keep your horizons broadened?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Hamiltonfan25",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T17:10:29.070750+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T16:21:50+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>“Love you Forever” by Robert Munsch has certainly left its mark on popular culture. It’s certainly heartwarming and inspiring how he took personal heartache, and turned it into a beautiful staple of many family households.</p> <p>I myself have fond memories of curling up next to my dad while he read me the book growing up. I lost him suddenly about a year ago, so that memory remains a precious one.</p> <p>There is another side to the story though…when my sister and I became teenagers, and started developing our sense of humor together, one of the first books to get our angsty teenage bashings was this book. Particularly, a somewhat infamous scene where the mother drives across town with a ladder to break into her grown son’s house to sing him that lullaby.</p> <p>It’s funny because in both lights, the book brought true joy and fond memories. In light of the imminent passing of the author (he’s been approved for medically assisted suicide due to dement",
        "id": 3617036,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nl83fi/is_love_you_forever_charming_or_creepy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is \"Love You Forever\" Charming or Creepy?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/airbear13",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T17:10:28.088461+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T16:02:58+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>B&amp;N in my city has a nice prominent section full of all these types of books on display so you can get all your anti-authoritarian lit in one place. Some good ones I’d recommend:</p> <p>they thought they were free (Mayer)</p> <p>This is a great book. A journalist travels to post Nazi Germans to interview 10 normal dudes in a small town from different walks of life, seeking to understand how/why Germans fell to Hitler. It’s very unsettling and candid and demonstrates how there are no easy or satisfying conclusions. It does a good job showing you just how easy it is to become a bystander or even complicit when you’re just a normal person just with life.</p> <p>the origins of totalitarianism (Arendt)</p> <p>This is more of an academic study on the process of an authoritarian takeover. Literally nothing we are seeing now is new.</p> <p>diary of a man in despair (Reck)</p> <p>This is a very personal recounting of a Prussian aristocrat who lived (and di",
        "id": 3617034,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nl7l4f/anti_authoritarian_books",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anti authoritarian books",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Zehreelakomdareturns",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T14:42:22.606221+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T14:15:37+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Just finished Kasia Urbaniak’s <em>Unbound: A Woman’s Guide to Power</em> (2020) which is a transformative and provocative masterclass in reclaiming one&#39;s voice and agency. Her unique background as a former dominatrix and Taoist nun brings to the table a truly fresh perspective on power, which she defines not as dominance over others, but as the skillful ability to influence conversations and situations by mastering the flow of attention. </p> <p>What makes this book so compelling is its balance: it doesn&#39;t push aggression or manipulation, but instead teaches you how to hold power calmly, directly and authentically. Urbaniak shows how to move through the “freeze” response, ask clearly for what you want, and treat rejection as information rather than humiliation. I love how actionable the techniques are for transforming passive frustration into active pursuit and channeling emotions like rage into fuel for growth, which are applicable in every ",
        "id": 3615731,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nl4rgl/review_for_unbound_a_womans_guide_to_power_by",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Review for Unbound: A Woman’s Guide to Power by Kasia Urbaniak, a former dominatrix and Taoist nun.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/DesmondTapenade",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T13:28:56.499484+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T12:29:29+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>What are yours? Here&#39;s my list:</p> <p>- Atonement (Ian McEwan). This was an assigned book when I was in college and while our professor tried to throttle us by specifying which chapters to read for each week, I binged it in a single night and when I rolled up to class the next day with red eyes, my teacher pulled me aside and went, &quot;You read the whole thing, didn&#39;t you.&quot; Yeah, I did. And it gutted me.</p> <p>- Prozac Nation (Elizabeth Wurtzel). I have my own history of mental health issues and grew up in a family full of people who were crazier than shithouse rats. I recently recommended this book to a friend and told her listen, you are going to have to build in breaks for yourself when you read this because it&#39;s too real, man. It&#39;s a rough ride and that&#39;s why I love it--it&#39;s authentic and raw.</p> <p>- All The Light We Cannot See (Anthony Doerr). I mean, any WW2-set novel is going to fuck me up, but this one really",
        "id": 3615054,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nl28al/books_that_emotionally_destroyed_you",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Books that emotionally destroyed you?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/PM_BRAIN_WORMS",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T12:17:37.591097+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T11:55:44+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Most of what people say about this book concerns their reaction to the science fiction element. I too found it quite affecting, but the greater reason why the novel reached was the mundane half. Specifically, the fact that Ruth is godawful.</p> <p>Dishonest, cruel, unreasonable, prone to self-serving misrememberings of the past - I think it’s safe to suggest that everyone’s known someone like her. The presence a character like Ruth serves to harm a story for many readers who strongly desire likeable characters, and do not desire to read about infuriating ones. Me, I eagerly want to read about dirtbags who remind me of unpleasant sorts I’ve had to deal with in my real life. I feel validated, a little less lonely knowing that the author, too, is bothered by the kinds of everyday dickishness that get under my skin.</p> <p>And I don’t think this is a minor part of the book. I think the book gains a huge amount of power by counterposing a vast, horrific so",
        "id": 3614490,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nl1iky/my_particular_response_to_never_let_me_go_spoilers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "My particular response to Never Let Me Go (Spoilers)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/AutoModerator",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T10:53:24.180374+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T10:00:32+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to our weekly recommendation thread! A few years ago now the mod team decided to condense the many &quot;suggest some books&quot; threads into one big mega-thread, in order to consolidate the subreddit and diversify the front page a little. Since then, we have removed suggestion threads and directed their posters to this thread instead. This tradition continues, so let&#39;s jump right in!</p> <p><strong>The Rules</strong></p> <ul> <li><p>Every comment in reply to this self-post must be a request for suggestions.</p></li> <li><p>All suggestions made in this thread must be direct replies to other people&#39;s requests. Do not post suggestions in reply to this self-post.</p></li> <li><p>All unrelated comments will be deleted in the interest of cleanliness.</p></li> </ul> <hr/> <p><strong>How to get the best recommendations</strong></p> <p>The most successful recommendation requests include a description of the kind of book being sought. This mig",
        "id": 3613428,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nkzfld/weekly_recommendation_thread_september_19_2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Weekly Recommendation Thread: September 19, 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/cloudwalker_11",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T23:22:07.372683+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T09:29:32+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>The first part like everyone else has said was BRILLIANT. When the story shifts abroad to Digby I was like wait what? It felt a little disjointed until later on when Digby meets Rune etc.</p> <p>As an Indian, it felt unlikely that a cook would make samosas and chicken kurma in Madras in the early 20th century. Samosas are primarily a north Indian snack, not a south Indian one especially in that era. Philipose had great potential when he was younger, I got annoyed at his behaviour after marriage, especially <span class=\"md-spoiler-text\">post Ninan&#39;s death</span> but then he redeemed himself by becoming more dedicated to his work and being a very loving father to Mariamma.</p> <p>I liked Elsie a lot initially but then I started disliking her. I wonder how Rune didn&#39;t consider that as a young kid who visited St.Bridget&#39;s often, she was <span class=\"md-spoiler-text\">at risk of contracting leprosy especially because kids&#39; immune systems are",
        "id": 3619564,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nkyxiy/my_review_of_the_covenant_of_water",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "My review of The Covenant of Water",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Book_Lover_fiction",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T10:53:23.949242+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T07:48:39+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I am a big fan of literature (mainly classic type) from past few years. I like to read everyday but my parents don&#39;t let me read fiction books , they say to read only academic books. I don&#39;t read literature whole day I also focus on academics but they don&#39;t even let me read 1-2 hours. I cant even buy books my parents won&#39;t let me so I always read in my mobile kindle app. Sometimes I get so bored by the mobile screen you know the real paper read is something else but no problem I can deal with that for some time. So I read in my mobile phone but my parents won&#39;t let me do that also. Yesterday I was reading the brother Karmazov and my parents caught me and I said I am not reading any book it&#39;s just some article but when they snatched my phone (she snatched my phone my mother always do that my father sometimes restrict me but he don&#39;t care about my reading fiction) she saw that I was 200 pages in that book so she scolded me th",
        "id": 3613427,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nkxdy8/my_parents_restricts_me_for_reading_books",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "My parents restricts me for reading books :(",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/FoxUpstairs9555",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T06:30:58.768560+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T06:16:07+00:00",
        "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/books/comments/1nkvxkt/sally_rooney_unable_to_collect_award_over/\"> <img src=\"https://external-preview.redd.it/GUIm1rUidtVby_pIpB5TijRcEp93N8eD3o0cSRHjI-M.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=6a040686eb17788b186f64a7b11856d2dbbcdd78\" alt=\"Sally Rooney unable to collect award over Palestine Action arrest threat\" title=\"Sally Rooney unable to collect award over Palestine Action arrest threat\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/FoxUpstairs9555\"> /u/FoxUpstairs9555 </a> <br/> <span><a href=\"https://www.theguardian.com/books/2025/sep/18/sally-rooney-unable-to-collect-award-over-palestine-action-arrest-threat\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1nkvxkt/sally_rooney_unable_to_collect_award_over/\">[comments]</a></span> </td></tr></table>",
        "id": 3612816,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nkvxkt/sally_rooney_unable_to_collect_award_over",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://external-preview.redd.it/GUIm1rUidtVby_pIpB5TijRcEp93N8eD3o0cSRHjI-M.jpeg?width=640&crop=smart&auto=webp&s=6a040686eb17788b186f64a7b11856d2dbbcdd78",
        "title": "Sally Rooney unable to collect award over Palestine Action arrest threat",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Mattson",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T06:30:59.636542+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T05:36:08+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>This is a novel issue I have. Youtube started serving me episodes of Brandon Sanderson&#39;s podcast. I watched a couple and a couple became alot. I really enjoy it and it has been great for escaping the horrible stuff going on in the world.</p> <p>I ended up buying Mistborn and started reading it. But when I read it its not in my voice but I&#39;m hearing Sanderson narrate it in my head. My mind is even recreating his cadence and tone. Its really off putting and I think I may have a budding parasocial relationship developing with Sanderson.</p> <p>I&#39;m not an avid reader but I read lots of fantasy books and I always meant to read him but never got around to it. Now I am and I feel like I got in the wrong way; not through his work but through his opinions. How do I work through this because it feels really weird—like I&#39;m not alone in my mind.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Mattson\"> /u/Mat",
        "id": 3612817,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1nkv8y6/how_do_you_get_the_authors_voice_out_of_your_head",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How do you get the author's voice out of your head when reading a book?",
        "vote": 0
    }
]