[
    {
        "age": null,
        "album": "",
        "author": "The Hated One",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-19T23:34:05.555918+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-19T22:11:23+00:00",
        "description": "Sad what happened to Charlie, even sadder what's happening after... support my work: https://www.patreon.com/thehatedone \n\nThe assassination of Charlie Kirk has now officially became the “shock doctrine” event. It’s a shocking event that is used to justify new authoritarian tendencies while seeking vengeance and justice. This time it is not just the political elites seeking to consolidate their power and abuse the constitution. It is the regular people rallying round the flag to avenge Charlie’s murder. Literally. \n\nThey created this website called “Charlie’s Murderers”. The website invites you to look up the names of people supposedly supporting political violence. And it just keeps scrolling forever, giving you names of people you’ve never heard of. Because these aren’t public personalities but rather private individuals expressing themselves on social media about their feelings on Charlie’s death and legacy. \n\nSome of these people listed here hold genuinely disgusting views, celebr",
        "id": 3619661,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=dwXSb_gzlV8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 344,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCjr2bPAyPV7t35MvcgT3W8Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dwXSb_gzlV8/hqdefault.jpg",
        "title": "The Charlie Kirk Shock Doctrine - The Doxxing Wars Are Here",
        "vote": 0
    }
]