[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T23:26:39.243009+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T23:26:38+00:00",
        "description": "DoorDash has sent a proposal to buy the British meal delivery company Deliveroo for $3.6 billion. \"The current offer marks the first formal approach since the last report in the summer,\" notes Reuters. From the report: The deal is expected to face no regulatory hurdles, as it provides DoorDash access to 10 new markets where it currently has no presence, creating a highly complementary footprint - other competitors might encounter more antitrust issues, the source said. Last year, Reuters reported DoorDash had shown interest in a takeover of Deliveroo, but a source said talks ended after disagreements on valuation.\n \nA deal between the two firms would help DoorDash solidify its footprint in Europe, after the U.S. meal delivery group's 2021 purchase of Finland-based rival Wolt Enterprises in an all-stock deal valued at about $8 billion.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=DoorDash+Makes+%243.6+Billion+Offer",
        "id": 2530853,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/25/2125224/doordash-makes-36-billion-offer-for-deliveroo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DoorDash Makes $3.6 Billion Offer For Deliveroo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T23:26:39.346005+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T23:26:38+00:00",
        "description": "Google announced it will end software updates and remote control support for the first- and second-generation Nest Learning Thermostats (plus the 2014 European model) starting October 25th. \"You will no longer be able to control them remotely from your phone or with\nGoogle Assistant, but can still adjust the temperature and modify schedules directly on the thermostat,\" the company wrote in a Friday blog post. The Verge reports: In other significant news, Google is flatly stating that it has no plans to release additional Nest thermostats in Europe. \"Heating systems in Europe are unique and have a variety of hardware and software requirements that make it challenging to build for the diverse set of homes,\" the company said. \"The Nest Learning Thermostat (3rd gen, 2015) and Nest Thermostat E (2018) will continue to be sold in Europe while current supplies last.\" [...]\n \nIn a clear attempt to ease customer anger, Google is offering a $130 discount on the fourth-gen Nest Learning Thermost",
        "id": 2530854,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/25/2052237/google-is-killing-software-support-for-early-nest-thermostats?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Is Killing Software Support For Early Nest Thermostats",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T22:19:40.976591+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T22:19:40+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Government censorship has found its way to Bluesky, but there's currently a loophole thanks to how the social network is structured. Earlier this month, Bluesky restricted access to 72 accounts in Turkey at the request of Turkish governmental authorities, according to a recent report by the Freedom of Expression Association. As a result, people in Turkey can no longer see these accounts, and their reach is limited. The report indicates that 59 Bluesky accounts were blocked on the grounds of protecting \"national security and public order.\" Bluesky also made another 13 accounts and at least one post invisible from Turkey.\n \nGiven that many Turkish users migrated from X to Bluesky in the hopes of fleeing government censorship, Bluesky's bowing to the Turkish government's demands has raised questions among the community as to whether the social network is as open and decentralized as it claims to be. (Or whether it's \"just like Twitter\"",
        "id": 2530389,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/25/2049213/government-censorship-comes-to-bluesky?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Government Censorship Comes To Bluesky",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T22:19:41.082047+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T22:19:40+00:00",
        "description": "Families earning $300,000 annually -- placing them among America's highest earners -- are increasingly finding themselves unable to afford elite college tuition without taking on substantial debt. Bloomberg's analysis of financial aid data from 50 selective colleges reveals households earning between $100,000 and $300,000 occupy a precarious middle ground: too affluent for meaningful aid but insufficiently wealthy to absorb annual costs approaching $100,000. \n\nThe squeeze begins around $150,000 income, where families typically contribute 20% ($30,000) annually toward tuition. At $270,000 income, expected contributions reach $61,000 per year. Most institutions eliminate financial aid entirely at approximately $400,000 income. Harvard, MIT, and the University of Pennsylvania recently expanded free tuition thresholds to $200,000, acknowledging this middle-class pressure. The changes take effect for 2025-26.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" h",
        "id": 2530390,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/25/1931247/top-colleges-are-too-costly-even-for-parents-making-300000?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Top Colleges Are Too Costly Even for Parents Making $300,000",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T21:14:17.509172+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T21:14:17+00:00",
        "description": "Microsoft has finally released Windows Recall to the general public, nearly a year after first announcing the controversial feature. Available exclusively on Copilot+ PCs, Recall continuously captures screenshots of user activity, storing them in a searchable database with extracted text. The feature's original launch was derailed by significant security concerns, as critics noted anyone with access to a Recall database could potentially view nearly everything done on the device. \n\nMicrosoft's revamped version addresses these issues with improved security protections, better content filtering for sensitive information, and crucially, making Recall opt-in rather than opt-out. The rollout includes two additional Copilot+ features: an improved Search function with natural language understanding, and \"Click to Do,\" which enables text copying from images and quick summarization of on-screen content.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http:",
        "id": 2530083,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/25/1830232/microsoft-launches-windows-recall-after-year-long-delay?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Launches Windows Recall After Year-Long Delay",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T20:11:43.996289+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T20:11:43+00:00",
        "description": "An anonymous reader shares a Nature story: The United States is known for the deep polarization between its two major political parties -- the right-wing Republicans and left-wing Democrats. Now an analysis of hundreds of thousands of policy documents reveals striking differences in partisan policymakers' use of the scientific literature, with Democratic-led congressional committees and left-wing think tanks more likely to cite research papers than their right-wing counterparts. The analysis also shows that Democrats and left-leaning think tanks are more likely to cite high-impact research, and that the two political sides rarely cite the same studies or even the same topics. \n\n\"There are striking differences in amount, content and character of the science cited by partisan policymakers,\" says Alexander Furnas, a political scientist at Northwestern University in Evanston, Illinois, and a co-author of the analysis, published in Science on 24 April. The researchers used the government-p",
        "id": 2529544,
        "language": null,
        "link": "https://politics.slashdot.org/story/25/04/25/1854224/how-democrats-and-republicans-cite-science?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Democrats and Republicans Cite Science",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T20:11:43.892660+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T20:11:43+00:00",
        "description": "Intel is grappling with an unexpected market shift as customers eschew its new AI-focused processors for cheaper previous-generation chips. The company revealed during its recent earnings call that demand for older Raptor Lake processors has surged while its newer, more expensive Lunar Lake and Meteor Lake AI PC chips struggle to gain traction. \n\nThis surprising trend, first reported by Tom's Hardware, has created a production capacity shortage for Intel's 'Intel 7' process node that will \"persist for the foreseeable future,\" despite the fact that current-generation chips utilize TSMC's newer nodes. \"Customers are demanding system price points that consumers really want,\" explained Intel executive Michelle Johnston Holthaus, noting that economic concerns and tariffs have affected inventory decisions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel's+AI+PC+Chips+Aren't+Selling+Well%3A+https%3A%2F%2Fslashdot.org%",
        "id": 2529543,
        "language": null,
        "link": "https://slashdot.org/story/25/04/25/1844209/intels-ai-pc-chips-arent-selling-well?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel's AI PC Chips Aren't Selling Well",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T19:03:50.652008+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T19:03:50+00:00",
        "description": "An anonymous reader shares a report: At Microsoft's annual executive huddle last month, the company's chief financial officer, Amy Hood, put up a slide that charted the number of users for its Copilot consumer AI tool over the past year. It was essentially a flat line, showing around 20 million weekly users. On the same slide was another line showing ChatGPT's growth over the same period, arching ever upward toward 400 million weekly users. \n\nOpenAI's iconic chatbot was soaring, while Microsoft's best hope for a mass-adoption AI tool was idling. It was a sobering chart for Microsoft's consumer AI team and the man who's been leading it for the past year, Mustafa Suleyman. Microsoft brought Suleyman aboard in March of 2024, along with much of the talent at his struggling AI startup Inflection, in return for a $650 million licensing fee that made Inflection's investors whole, and then some. \n\n[...] Yet from the very start, people inside the company told me they were skeptical. Many outsi",
        "id": 2529136,
        "language": null,
        "link": "https://slashdot.org/story/25/04/25/186205/microsofts-big-ai-hire-cant-match-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's Big AI Hire Can't Match OpenAI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T19:03:50.556770+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T19:03:50+00:00",
        "description": "The head of the Swiss National Bank said on Friday that cryptocurrencies failed to meet the institution's currency reserve standards, rebuffing calls by crypto advocates that it hold bitcoin as a hedge against growing global economic risks. From a report: Cryptocurrency campaigners are ramping up pressure on the SNB to buy bitcoin, arguing that the economic turmoil triggered by U.S. President Donald Trump's tariffs made it more important for the central bank to diversify its reserves. They have launched a referendum campaign to change the Swiss constitution and require the SNB to hold bitcoin in its reserves alongside gold. SNB Chairman Martin Schlegel, however, rejected the idea at the central bank's shareholder meeting in Bern.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Swiss+National+Bank+Chairman+Rebuffs+Bitcoin+as+Reserve+Asset%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F04%2F25%2F1818257%2F%3Futm_source%3",
        "id": 2529135,
        "language": null,
        "link": "https://slashdot.org/story/25/04/25/1818257/swiss-national-bank-chairman-rebuffs-bitcoin-as-reserve-asset?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Swiss National Bank Chairman Rebuffs Bitcoin as Reserve Asset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T17:58:11.352459+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T17:58:11+00:00",
        "description": "Microsoft will remove its Maps app from the Microsoft Store in July 2025, delivering an \"update\" that renders the application completely nonfunctional. Following the cutoff, users won't be able to reinstall the app even if previously downloaded, according to a Microsoft support document. While the app will retain personal data like saved navigation routes and map URLs, this information will become unusable after the deprecation. \n\nThe Maps application, a remnant from the Windows Phone and Windows 10 Mobile era, will disappear completely while Bing Maps will continue functioning as a web service through bing.com/maps. Microsoft hasn't provided specific reasoning for the decision to sunset the desktop application, which has existed as an increasingly anachronistic holdover from Microsoft's abandoned mobile platform efforts.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+To+Kill+Windows+Maps+App+in+July%3A+ht",
        "id": 2528629,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/25/1726238/microsoft-to-kill-windows-maps-app-in-july?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft To Kill Windows Maps App in July",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T16:52:20.644973+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T16:52:20+00:00",
        "description": "The iconic \"You Wouldn't Steal a Car\" anti-piracy campaign, which dramatically equated digital piracy with physical theft, appears to have used a pirated font in its own materials. New evidence indicates the campaign utilized \"XBAND Rough,\" a free clone of the commercial \"FF Confidential\" font, which requires a license. \n\nTorrentFreak independently confirmed campaign materials from 2005 embedded the XBAND Rough font rather than the original created by Just Van Rossum in 1992. Researchers discovered the font in PDF files hosted on the campaign's official website. Van Rossum, FF Confidential's creator, called the revelation \"hilarious\" when informed by TorrentFreak. \"I knew my font was used for the campaign and that a pirated clone named XBand-Rough existed. I did not know that the campaign used XBand-Rough,\" he said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+'You+Wouldn't+Steal+a+Car'+Campaign+Used+a+Pirated",
        "id": 2527977,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/25/166214/the-you-wouldnt-steal-a-car-campaign-used-a-pirated-font?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The 'You Wouldn't Steal a Car' Campaign Used a Pirated Font",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T16:52:20.740665+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T16:52:20+00:00",
        "description": "Pete Koomen, a Y Combinator partner, argues that current AI applications often fail by unnecessarily constraining their underlying models, much like early automobiles that mimicked horse-drawn carriages rather than reimagining transportation. In his detailed critique, Koomen uses Gmail's AI email draft feature as a prime example. The tool generates formal, generic emails that don't match users' actual writing styles, often producing drafts longer than what users would naturally write. \n\nThe critical flaw, according to Koomen, is that users cannot customize the system prompt -- the instructions that tell the AI how to behave. \"When an LLM agent is acting on my behalf I should be allowed to teach it how to do that by editing the System Prompt,\" Koomen writes. Koomen suggests AI is actually better at reading and transforming text than generating it. His vision for truly useful AI email tools involves automating mundane work -- categorizing, prioritizing, and drafting contextual replies b",
        "id": 2527978,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/25/1545223/yc-partner-argues-most-ai-apps-are-currently-horseless-carriages?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "YC Partner Argues Most AI Apps Are Currently 'Horseless Carriages'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T15:46:20.950534+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T15:46:20+00:00",
        "description": "Apple plans to shift the assembly of all US-sold iPhones to India [alternative source] as soon as next year, according to Financial Times, which cites people familiar with the matter, as President Donald Trump's trade war forces the tech giant to pivot away from China. From the report: The push builds on Apple's strategy to diversify its supply chain but goes further and faster than investors appreciate, with a goal to source from India the entirety of the more than 60 million iPhones sold annually in the US by the end of 2026.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Aims+To+Source+All+US+iPhones+From+India+in+Pivot+Away+From+China%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F04%2F25%2F1514234%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%",
        "id": 2527357,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/04/25/1514234/apple-aims-to-source-all-us-iphones-from-india-in-pivot-away-from-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Aims To Source All US iPhones From India in Pivot Away From China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T15:46:21.068189+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T15:46:20+00:00",
        "description": "The Federal Reserve Board and the Federal Deposit Insurance Corp. have withdrawn several statements regarding banks' crypto-related activities in an effort to support innovation and clarify current policies. From a report: Two joint statements from 2023 on liquidity and other risks regarding banks' crypto-related activities were pulled on Thursday, the FDIC said. The move aims to clarify that banking organizations may engage in crypto activities so long as they are consistent with current laws and regulations. Banks may also provide products and services to people and firms engaged in crypto-related activities, the FDIC said. Providing more clarity on banks' crypto activities in the coming weeks and months is being considered, the agencies said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Federal+Reserve%2C+FDIC+Pull+Statements+on+Crypto%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F04%2F25%2F1443253%2F%3Futm",
        "id": 2527358,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/25/1443253/federal-reserve-fdic-pull-statements-on-crypto?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Federal Reserve, FDIC Pull Statements on Crypto",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T14:40:14.287707+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T14:40:14+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Perplexity CEO Aravind Srinivas said this week on the TBPN podcast that one reason Perplexity is building its own browser is to collect data on everything users do outside of its own app. This so it can sell premium ads. \"That's kind of one of the other reasons we wanted to build a browser, is we want to get data even outside the app to better understand you,\" Srinivas said. \"Because some of the prompts that people do in these AIs is purely work-related. It's not like that's personal.\"\n \nAnd work-related queries won't help the AI company build an accurate-enough dossier. \"On the other hand, what are the things you're buying; which hotels are you going [to]; which restaurants are you going to; what are you spending time browsing, tells us so much more about you,\" he explained. Srinivas believes that Perplexity's browser users will be fine with such tracking because the ads should be more relevant to them. \"We plan to use all the cont",
        "id": 2526550,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/25/044215/perplexity-ceo-says-its-browser-will-track-everything-users-do-online-to-sell-ads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Perplexity CEO Says Its Browser Will Track Everything Users Do Online To Sell Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T14:40:14.182648+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T14:40:14+00:00",
        "description": "Legacy search brand Yahoo has been working on its own web browser prototype, and says it would like to buy Google's Chrome if the company is forced by a court to sell it. From a report: The information came out during the fourth day of the Justice Department's remedies trial to rectify Google's search monopoly. The DOJ has -- among other proposals -- requested Judge Amit Mehta break up Google by requiring it sell its Chrome browser, which the agency says is a key distribution channel for its popular search engine that's amassed too much power for anyone else to compete. Yahoo isn't the only company interested in buying Chrome. While DuckDuckGo's CEO said they wouldn't be able to afford it, witnesses from Perplexity and OpenAI both expressed interest in the popular browser on the stand this week. Yahoo obviously isn't worth Chrome's estimated price tag of tens of billions of dollars. So the company is saying that its owner, the hedge fund giant Apollo, will help bankroll the purchase s",
        "id": 2526549,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/25/1354237/yahoo-wants-to-buy-chrome?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Yahoo Wants To Buy Chrome",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T10:22:37.519781+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T10:22:37+00:00",
        "description": "New Intel CEO Lip-Bu Tan has mandated that employees return to the office four days a week starting September 1 to boost collaboration and decision-making. Tan also signaled upcoming job cuts and organizational changes, including a flatter management structure and fewer meetings. \"When we spend time together in person, it fosters more engaging and productive discussion and debate,\" Tan wrote in a note to employees posted on Intel's website Thursday. \"It drives better and faster decision-making. And it strengthens our connection with colleagues.\" Oregon Live reports: Intel factory workers and many researchers are already on site every day, in cleanrooms and labs. But Intel has thousands of employees in corporate roles who have spent at least part of their time working from home since the pandemic. The company adopted a \"hybrid-first\" approach in 2021, allowing most employees the flexibility to work from home much of the time. More recently, it sought to have workers on site about three",
        "id": 2524838,
        "language": null,
        "link": "https://slashdot.org/story/25/04/25/0359228/intel-says-employees-must-return-to-the-office-4-days-a-week?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Says Employees Must Return To the Office 4 Days a Week",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T07:07:26.767384+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T07:07:26+00:00",
        "description": "The Sydney-based CADA station secretly used an AI-generated host named \"Thy\" for its weekday shows over six months without disclosure. The Sydney Morning Herald reports: After initial questioning from Stephanie Coombes in The Carpet newsletter, it was revealed that the station used ElevenLabs -- a generative AI audio platform that transforms text into speech -- to create Thy, whose likeness and voice were cloned from a real employee in the ARN finance team. The Australian Communications and Media Authority said there were currently no specific restrictions on the use of AI in broadcast content, and no obligation to disclose its use.\n \nAn ARN spokesperson said the company was exploring how new technology could enhance the listener experience. \"We've been trialling AI audio tools on CADA, using the voice of Thy, an ARN team member. This is a space being explored by broadcasters globally, and the trial has offered valuable insights.\" However, it has also \"reinforced the power of real per",
        "id": 11535,
        "language": null,
        "link": "https://radio.slashdot.org/story/25/04/25/0355222/sydney-radio-station-secretly-used-ai-generated-host-for-6-months-without-disclosure?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sydney Radio Station Secretly Used AI-Generated Host For 6 Months Without Disclosure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T03:52:51.884263+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T03:52:51+00:00",
        "description": "An anonymous reader quotes a report from NPR: Air in the U.S. has gotten cleaner for decades, adding years to people's lives and preventing millions of asthma attacks, but nearly half of Americans still live with unhealthy air pollution, a new report finds. The report comes as the Trump administration is considering rolling back some key air quality regulations. Air quality across the country has improved dramatically since regulations like the Clean Air Act were put in place in the 1970s to govern sources of pollution like coal-fired power plants and emissions from diesel trucks. Despite that progress, the air is still unhealthy and polluted in many parts of the country. In 2023, nearly half of the country's inhabitants -- 156 million people -- lived in places heavy in smog or soot pollution that harms their lungs, hearts, and brains, according to the newest edition of the American Lung Association's State of the Air report.\n \n\"Both these types of pollution cause people to die. They ",
        "id": 10746,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/24/2122224/air-pollution-still-plagues-nearly-half-of-americans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Air Pollution Still Plagues Nearly Half of Americans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T02:47:52.870230+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T02:47:52+00:00",
        "description": "Waymo is now providing over 250,000 paid robotaxi rides per week in the U.S., up from 200,000 in February, as it expands into cities like Austin and grows partnerships with Uber and automakers. CNBC reports: \"We can't possibly do it all ourselves,\" said Pichai on a call with analysts for Alphabet's first-quarter earnings. Pichai noted that Waymo has not entirely defined its long-term business model, and there is \"future optionality around personal ownership\" of vehicles equipped with Waymo's self-driving technology. The company is also exploring the ways it can scale up its operations, he said.\n \nThe 250,000 paid rides per week are up from 200,000 in February, before Waymo opened in Austin and expanded in the San Francisco Bay Area in March. Waymo, which is part of Alphabet's Other Bets segment, is already running its commercial, driverless ride-hailing services in the San Francisco, Los Angeles, Phoenix and Austin regions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<",
        "id": 10501,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/24/2311230/waymo-reports-250000-paid-robotaxi-rides-per-week-in-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Waymo Reports 250,000 Paid Robotaxi Rides Per Week In US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T01:43:52.212566+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T01:43:52+00:00",
        "description": "The Trump administration introduced a new framework to expedite self-driving vehicle deployment by reducing regulatory hurdles, while maintaining mandatory safety incident reporting. NHTSA is also expanding its exemption program, allowing domestically produced autonomous vehicles lacking traditional safety controls to operate on U.S. roads. Reuters reports: The Trump administration said Thursday it aims to speed up the deployment of self-driving vehicles but will maintain rules requiring reporting of safety incidents involving advanced vehicles. U.S. Transportation Secretary Sean Duffy on Thursday released a new framework to boost autonomous vehicles. \"This administration understands that we're in a race with China to out-innovate, and the stakes couldn't be higher,\" Duffy said. \"Our new framework will slash red tape.\"\n \nThe National Highway Traffic Safety Administration said it will expand a program to exempt some self-driving vehicles from all safety requirements and will streamline",
        "id": 10300,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/24/2116216/us-agency-to-ease-self-driving-vehicle-deployment-hurdles-retain-reporting-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Agency To Ease Self-Driving Vehicle Deployment Hurdles, Retain Reporting Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T01:43:52.307803+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T01:43:52+00:00",
        "description": "ZipNada shares a report from ZDNet: Microsoft's latest research identifies a new type of organization known as the Frontier Firm, where on-demand intelligence requirements are managed by hybrid teams of AI agents and humans. The report identified real productivity gains from implementing AI into organizations, with one of the biggest being filling the capacity gap -- as many as 80% of the global workforce, both employees and leaders, report having too much work to do, but not enough time or energy to do it. ... According to the report, business leaders need to separate knowledge workers from knowledge work, acknowledging that humans who can complete higher-level tasks, such as creativity and judgment, should not be stuck answering emails. Rather, in the same way working professionals say they send emails or create pivot tables, soon they will be able to say they create and manage agents -- and Frontier Firms are showing the potential possibilities of this approach. ... \"Everyone will ",
        "id": 10301,
        "language": null,
        "link": "https://slashdot.org/story/25/04/24/214248/youll-soon-manage-a-team-of-ai-agents-says-microsofts-work-trend-report?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "You'll Soon Manage a Team of AI Agents, Says Microsoft's Work Trend Report",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T00:38:04.256797+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T00:38:04+00:00",
        "description": "An anonymous reader quotes a report from Cybernews: Researchers at Cybernews have uncovered a major privacy breach involving WorkComposer, a workplace surveillance app used by over 200,000 people across countless companies. The app, designed to track productivity by logging activity and snapping regular screenshots of employees' screens, left over 21 million images exposed in an unsecured Amazon S3 bucket, broadcasting how workers go about their day frame by frame. The leaked data is extremely sensitive, as millions of screenshots from employees' devices could not only expose full-screen captures of emails, internal chats, and confidential business documents, but also contain login pages, credentials, API keys, and other sensitive information that could be exploited to attack businesses worldwide. After the company was contacted, access to the unsecured database was secured. An official comment has yet to be received.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a clas",
        "id": 10050,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/24/2057241/employee-monitoring-app-leaks-21-million-screenshots-in-real-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Employee Monitoring App Leaks 21 Million Screenshots In Real Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T00:38:04.351872+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T00:38:04+00:00",
        "description": "Microsoft has announced native PyTorch support for Windows on Arm devices with the release of PyTorch 2.7, making it significantly easier for developers to build and run machine learning models directly on Arm-powered Windows machines. This eliminates the need for manual compilation and opens up performance gains for AI tasks like image classification, NLP, and generative AI. Neowin reports: With the release of PyTorch 2.7, native Arm builds for Windows on Arm are now readily available for Python 3.12. This means developers can simply install PyTorch using a standard package manager like pip.\n \nAccording to Microsoft: \"This unlocks the potential to leverage the full performance of Arm64 architecture on Windows devices, like Copilot+ PCs, for machine learning experimentation, providing a robust platform for developers and researchers to innovate and refine their models.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status",
        "id": 10051,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/24/2050230/microsoft-brings-native-pytorch-arm-support-to-windows-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Brings Native PyTorch Arm Support To Windows Devices",
        "vote": 0
    }
]