[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T00:00:25.664552+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T23:51:31+00:00",
        "description": "<p>Majin Bu:</p>\n\n<blockquote>\n  <p>According to my source, Apple is gearing up for another major leap\nforward. With iPadOS 19 and iOS 19, expected in 2025, the gap\nbetween iPad, iPhone, and Mac continues to shrink. [...] One of\nthe most exciting changes will benefit those using the iPad with a\nMagic Keyboard. When connected, the interface will adapt to show a\nmenu bar at the top, just like on macOS, turning the iPad into a\nmuch more laptop-like experience.</p>\n\n<p>Another key update is Stage Manager 2.0, an enhanced multitasking\nmode that activates automatically when the keyboard is attached.\nIt will make managing apps and windows smoother and more\nproductive than ever.</p>\n</blockquote>\n\n<p>I don’t think it’s worth spending too much time thinking about these changes until we actually see what Apple is doing, but the menu bar is one of the great achievements in the history of UI design, and the Mac has always had the best design for a menu bar — at the top of the screen, not at the t",
        "id": 2530906,
        "language": null,
        "link": "https://majinbuofficial.com/ipados-19-and-ios-19-new-features",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Rumor Suggests iPadOS 19 to Get Some Mac-Like Tweaks, Like a Menu Bar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T00:00:25.825980+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T23:13:58+00:00",
        "description": "<p>Wayne Ma, reporting for The Information (paywalled, alas):</p>\n\n<blockquote>\n  <p>Earlier this year, Chinese authorities refused to allow one of\nApple’s Chinese equipment suppliers to export machinery to India\nthat Apple needed for the upcoming iPhone 17’s trial production,\naccording to two people with direct knowledge of the matter. So\nthe supplier got creative.</p>\n\n<p>It set up a front company in Southeast Asia to buy the machines.\nOnce the equipment reached the Southeast Asian country, it went to\na factory in India operated by Foxconn, the Taiwanese company that\nbuilds most of Apple’s iPhones in China, the people said.</p>\n</blockquote>\n\n<p>Ian Malcolm: “Life finds a way.” So too with Apple getting what it wants.</p>\n\n<blockquote>\n  <p>India is already assembling between 30 million and 40 million\niPhones a year — as much as one-fifth of the iPhone’s global\nproduction, according to people involved in Apple’s India supply\nchain. Apple is planning to increase iPhone production in ",
        "id": 2530907,
        "language": null,
        "link": "https://www.theinformation.com/articles/apples-india-manufacturing-push-faces-spoilers-including-china?rc=jfy0lk",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wayne Ma Reports That Political Tensions Are Making It Difficult for Apple to Shift More iPhone Production From China to India",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-26T06:24:39.971462+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T20:22:38+00:00",
        "description": "<p>Andrew Leonard, writing for Salon back in 2013:</p>\n\n<blockquote>\n  <p>The first thing wrong with the stupidest article to be posted to\nthe Internet in the year 2013 — and possibly the entire century — is the title: “<a href=\"http://www.businessinsider.com/american-airlines-international-economy-class-2013-1?op=1#ixzz2JIlmxu88\">I Was Quite Surprised By Some Things On My\nAmerican Airlines International ‘Economy Class’ Flight</a>.” Even\nsetting aside the high probability that author Henry Blodget, the\nfounder, CEO and editor-in-chief of Business Insider, wrote his\naccount of the mild horrors of nine hours cramped in the cheap\nseats in order to purposely troll people like me who would\nruthlessly mock him and thus drive even more traffic to his site,\nthe low-rent search-engine optimization of Blodget’s headline\nwould still be a crime against journalism. Blodget’s made many\nmistakes in the past, not least the dot-com boom-era stock hyping\nescapades that got him banned from the securitie",
        "id": 2531278,
        "language": null,
        "link": "https://www.salon.com/2013/01/28/henry_blodgets_kind_of_awful_plane_ride",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Henry Blodget’s Illustrated 2013 Travelogue of Flying in Coach on a Long International Flight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-25T16:55:27.472135+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-25T16:47:52+00:00",
        "description": "<p>Henry Blodget, <a href=\"https://www.theguardian.com/media/2015/sep/29/henry-blodget-comeback-business-insider\">who sold Business Insider to German publishing giant Axel Springer</a> for $340 million a decade ago, has supposedly launched a new site, Regenerator, built  on Substack. I was going to tack on an “alas” <a href=\"https://daringfireball.net/2024/11/regarding_and_well_against_substack\">re: building on Substack</a>, but maybe this is the sort of thing Substack deserves.</p>\n\n<p>The gist of his debut post is that he used ChatGPT to create a small “staff” of teammates to work with, along with photos of these personalities, and he developed a crush on his new CEO. Really.</p>\n\n<p>Do I think he’s serious? No, not at all. Do I think he wrote this to generate attention just like I’m giving him now? Yes, obviously. But I really do have to salute the absolute shameless of him playing this straight, painting himself as an utter buffoon and downright weirdo, just for the attention. (Bl",
        "id": 2528078,
        "language": null,
        "link": "https://www.regenerator1.com/p/building-our-native-ai-newsroom",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Henry Blodget Creates Imaginary Staff of AI Personalities for His New Website and Hits on One of Them",
        "vote": 0
    }
]