[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T21:32:11.464647+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T20:44:00+00:00",
        "description": "\"I'm here to say we have to give these AI bubble predictions a rest,\" says Yahoo Finance executive editor Brian Sozzi.\n\nFirst of all, AI is a real technology being deployed in real ways inside of Corporate America. Second, this technology is requiring more physical assets in the ground &mdash; which are being built to support AI's real-world application. What Zach Dell (son of Michael Dell) is working on at startup Base Power (which just raised $1 billion) impressed me this week. It's addressing a key issue &mdash; power availability and costs in part because of rising stress on the grid due to AI development. \n\nNext, the spending on AI infrastructure doesn't strike me as reckless. I talk to CFOs and they walk me through their thinking, which seems logical. They aren't foaming at the mouth with wild-eyed predictions of grandeur similar to the late '90s. Plus, the tech giants making the biggest AI investments are fueling their ambitions by cash on hand &mdash; not loading up balance sh",
        "id": 3797867,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/12/206215/theres-no-ai-bubble-says-yahoo-finance-executive-editor",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "There's No 'AI Bubble', Says Yahoo Finance Executive Editor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T20:02:33.385126+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T19:44:00+00:00",
        "description": "\"Amazon Echo Show owners are reporting an uptick in advertisements on their smart displays,\" reports Ars Technica.\n\n\nThe company's Echo Show smart displays have previously shown ads through the company's Shopping Lists feature, as well as advertising for Alexa skills. Additionally, Echo Shows may play audio ads when users listen to Amazon Music on Alexa. However, reports on Reddit (examples here, here, and here) and from The Verge's Jennifer Pattison Tuohy, who owns more than one Echo Show, suggest that Amazon has increased the amount of ads it shows on its smart displays' home screens. \n\nThe Echo Show's apparent increase in ads is pushing people to stop using or even return their Echo Shows.\n \n\nThe article notes Amazon's smart displays have also started showing ads for Alexa+ &mdash; and The Verge's reporter saw ads on one (but not all) of her Echo Shows this week. (Even when the display is set to show personal photos, ads sometimes appear for herbal supplements, Quest sports chips, ",
        "id": 3797395,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/12/1942209/amazon-smart-displays-are-now-being-bombarded-with-ads",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Smart Displays Are Now Being Bombarded With Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T18:14:52.543218+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T17:58:00+00:00",
        "description": "An anonymous reader shared this report from the Guardian:\nThis month, indie musicians in San Francisco gathered for a series of talks called Death to Spotify, where attenders explored \"what it means to decentralize music discovery, production and listening from capitalist economies\". The events, held at Bathers library, featured speakers from indie station KEXP, labels Cherub Dream Records and Dandy Boy Records, and DJ collectives No Bias and Amor Digital. What began as a small run of talks quickly sold out and drew international interest. People as far away as Barcelona and Bengaluru emailed the organizers asking how to host similar events. \n\nThe talks come as the global movement against Spotify edges into the mainstream. In January, music journalist Liz Pelly released Mood Machine, a critical history arguing the streaming company has ruined the industry and turned listeners into \"passive, uninspired consumers\". Spotify's model, she writes, depends on paying artists a pittance &mdash",
        "id": 3796969,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/12/1756208/death-to-spotify-event-draws-interest-from-some-musicians-to-try-alternatives",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Death to Spotify' Event Draws Interest From Some Musicians to Try Alternatives",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T16:54:28.262707+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T16:34:00+00:00",
        "description": "Last November Aptera successfully tested its first production-intent three-wheel solar-powered EV &mdash; and said it already had over 50,000 reservations. The vehicles had a solar charge range of 40 miles per day, reported Digital Trends, noting the crowdfunded company's cars also had an NCAS charging port. (\"Solar-powered electric vehicles are also being developed by the likes of Germany's Sono Motors and the Netherlands' Lightyear, and by big automakers such as Hyundai and Mercedes-Benz.\") \n\nBut this week the EV site Electrek pointed out that \"There have been a handful of 'solar car' projects and they all have failed so far.\"\nAptera is one of the rare survivors, thanks to a couple of relatively successful crowdfunding efforts. The company has been inching closer to bringing its vehicle to production, but it still appears to need some investments to make it happen. Now, Aptera is going public. \n\nGenerally, that's good news. An initial public offering (IPO) means that a company is go",
        "id": 3796565,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/12/0237231/three-wheeled-solar-car-maker-aptera-is-about-to-go-public",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Three-Wheeled Solar Car Maker Aptera is About to Go Public",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T16:54:28.418644+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T15:34:00+00:00",
        "description": "The Register reports:\nOver the past two years, the open source curl project has been flooded with bogus bug reports generated by AI models. The deluge prompted project maintainer Daniel Stenberg to publish several blog posts about the issue in an effort to convince bug bounty hunters to show some restraint and not waste contributors' time with invalid issues. Shoddy AI-generated bug reports have been a problem not just for curl, but also for the Python community, Open Collective, and the Mesa Project. \nIt turns out the problem is people rather than technology. Last month, the curl project received dozens of potential issues from Joshua Rogers, a security researcher based in Poland. Rogers identified assorted bugs and vulnerabilities with the help of various AI scanning tools. And his reports were not only valid but appreciated. Stenberg in a Mastodon post last month remarked, \"Actually truly awesome findings.\" In his mailing list update last week, Stenberg said, \"most of them were tin",
        "id": 3796566,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/12/0619247/ai-slop-not-this-time-ai-tools-found-50-real-bugs-in-curl",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Slop? Not This Time. AI Tools Found 50 Real Bugs In cURL",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T15:35:43.323135+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T14:34:00+00:00",
        "description": "California's Privacy Protection Agency \"issued a record fine earlier this month to Tractor Supply,\" according to an EFF Deeplinks blog post &mdash; for \"apparently ducking its responsibilities under the California Consumer Privacy Act.\"\n\n\nUnder that law, companies are required to respect California customers' and job applicants' rights to know, delete, and correct information that businesses collect about them, and to opt-out of some types of sharing and use. The law also requires companies to give notice of these rights, along with other information, to customers, job applicants, and others. The CPPA said that Tractor Supply failed several of these requirements. This is the first time the agency has enforced this data privacy law to protect job applicants... \n\nTractor Supply, which has 2,500 stores in 49 states, will pay for their actions to the tune of $1,350,000 &mdash; the largest fine the agency has issued to date. Specifically, the agency said, Tractor Supply violated the law by",
        "id": 3796067,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/11/0544209/california-privacy-protection-agency-targets-tractor-supplys-tricky-tracking",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California 'Privacy Protection Agency' Targets Tractor Supply's Tricky Tracking",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T12:55:25.503975+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T11:34:00+00:00",
        "description": "Cryptologist/CS professor Daniel J. Bernstein is alleging that America's National Security Agency is attempting to influence NIST post-quantum cryptography standards. \n\nBernstein first emphasizes that it's normal for post-quantum cryptography (or \"PQ\") to be part of \"hybrid\" security that also includes traditional pre-quantum cryptography. (Bernstein says this is important because since 2016, \"We've seen many breaks of post-quantum proposals...\") \n\n\"The problem in a nutshell. Surveillance agency NSA and its [UK counterpart] GCHQ are trying to have standards-development organizations endorse weakening [pre-quantum] ECC+PQ down to just PQ.\"\nPart of this is that NSA and GCHQ have been endlessly repeating arguments that this weakening is a good thing... I'm instead looking at how easy it is for NSA to simply spend money to corrupt the standardization process.... The massive U.S. military budget now publicly requires cryptographic \"components\" to have NSA approval... In June 2024, NSA's Wi",
        "id": 3795151,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/12/0751230/cryptologist-djb-alleges-nsa-is-pushing-an-end-to-backup-algorithms-for-post-quantum-cryptography",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cryptologist DJB Alleges NSA is Pushing an End to Backup Algorithms for Post-Quantum Cryptography",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T07:52:27.923712+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T07:34:00+00:00",
        "description": "Ferrari's first electric car arrives next summer, reports Carscoops, with a top speed of 193 mph (310 km/h) and accelerating from 0 to 62 mph (0 to 100 km/h) in just 2.5 seconds. \n\n\"The Elettrica\" will also have a large high-density battery for over 329 miles (530 km) of range, ultra-fast DC charging up to 350 kW, and a 122 kWh capacity and an energy density of 195 Wh/kg that Ferrari \"claims is the highest among production EVs.\" \nBut what's really interesting is its engine noises:\n\nFerrari's approach to the Elettrica's sound moves away from artificial engine simulation. Instead, a sensor mounted on the inverter detects the powertrain's real mechanical vibrations, which are then amplified to create what the company describes as a natural, evolving tone that reflects how the car is being driven... a reactive soundtrack. Antonio Palermo [Ferrari's head of sound and vibration] calls it \"language and connection,\" a way to keep drivers emotionally engaged with the car without resorting to s",
        "id": 3792687,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/12/0532223/ferrari-announces-its-first-electric-sports-car-promising-real-engine-noises---sort-of",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ferrari Announces Its First Electric Sports Car, Promising Real Engine Noises - Sort Of",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T07:52:28.060095+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T03:37:00+00:00",
        "description": "A demo of educational AI-powered tools by a Microsoft product manager (in March of 2024) showed \"how AI has the possibility to transform various job sectors and the education system,\" according to one report. \nBut that demo \"includes a segment on Copilot in Excel that is likely to resonate with AI-wary software developers,\" writes long-time Slashdot theodp:\n\n\nThe Copilot in Excel segment purports to show how even teachers who were too \"afraid of\" or \"intimidated\" to use Excel in the past can now just use natural language prompts to conduct Excel analysis. But Copilot advises the teacher there are no 'outliers' in the exam scores for their 17 students, whose test scores range from 27%-100%. (This is apparently due to Copilot's choice of an inappropriate outlier detection method for this size population and score range). Fittingly, the student whose 27% score is confidently-but-incorrectly deemed to be of no concern by Copilot is named after Michael Scott, the largely incompetent and un",
        "id": 3792688,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/12/0328228/in-copilot-in-excel-demo-ai-told-teacher-a-27-exam-score-is-of-no-concern",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "In Copilot In Excel Demo, AI Told Teacher a 27% Exam Score Is of No Concern",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T07:52:28.178836+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T02:37:00+00:00",
        "description": "Off the southwest cost of Italy, a remotely operated submarine made \"a significant and rare discovery,\" reports the Independent &mdash; a vast white coral reef that was 80 metres tall (262 feet) and 2 metres wide (6.56 feet) \"containing important species and fossil traces.\"\n\n\nOften dubbed the \"rainforests of the sea\", coral reefs are of immense scientific interest due to their status as some of the planet's richest marine ecosystems, harbouring millions of species. They play a crucial role in sustaining marine life but are currently under considerable threat... \n\nhese impressive formations are composed of deep-water hard corals, commonly referred to as \"white corals\" because of their lack of colour, specifically identified as Lophelia pertusa and Madrepora oculata species. The reef also contains black corals, solitary corals, sponges, and other ecologically important species, as well as fossil traces of oysters and ancient corals, the Italian Research Council said. It called them \"tru",
        "id": 3792689,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/11/2241202/new-large-coral-reef-discovered-off-naples-containing-rare-ancient-corals",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Large Coral Reef Discovered Off Naples Containing Rare Ancient Corals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-12T07:52:28.306242+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-12T00:51:00+00:00",
        "description": "An anonymous reader shared this report from The Wrap\n\n\nTesla this weekend introduced a new \"Tron: Ares\" mode, giving drivers an opportunity to turn their on-screen vehicles into the glowing Light Cycles that have been a big part of the Disney franchise since 1982. \n\nThe optional update started rolling out on Friday, as Tron: Ares debuted in theaters. Tesla announced the update on X: \"The grid has expanded to your Tesla &mdash; Tron: Ares update rolling out now.\" The feature is activated in Tesla's Toybox \"infotainment\" system, and turns the driver's vehicle avatar into a red Light Cycle. For drivers who have the \"ambient lighting\" feature, the mode will also expand the theme throughout the cabin. \n\nThere was also a sleek black Tesla Optimus robot at the premier of Tron: Ares. \n\nIronically, the Hollywood Reporter writes that by box office figures, \"Tron is in big trouble,\" selling fewer tickets than expected (despite the movie's $180 million pre-marketing budget). While Tron's audience",
        "id": 3792690,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/12/0048226/tron-ares-mode-turns-teslas-into-glowing-light-cycles-despite-bad-box-office",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Tron: Ares' Mode Turns Teslas Into Glowing Light Cycles &mdash; Despite Bad Box Office",
        "vote": 0
    }
]