[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T18:30:04.591501+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T18:00:20+00:00",
        "description": "Most people think great and long lasting relationships are built on chemistry — but the real magic lies in communication. In this talk, Dr. Hareder McDowell explores how the way we defeat our silence, begin to speak, listen, and connect directly, shapes emotional intimacy, trust, and even physical desire. Drawing from research and real-life stories, Dr. Mac reveals how mastering communication doesn’t just improve relationships and sex — it transforms them. Because you have the power to talk you way to better sex. \n\nDr. Hareder McDowell, affectionately known as Dr. Mac, is a bestselling author, speaker and researcher from the south side of Chicago. Her work focuses on how effective communication around sex and intimacy can lead to better relationships, better sex, long lasting marriages and friendships. Dr. Mac has taught research methods,  human sexuality and sexual psychology at various universities including, DePaul, Roosevelt and her Alma mater , National-Louis University, Chicago ",
        "id": 4268123,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=AsexMiRoj2A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AsexMiRoj2A/hqdefault.jpg",
        "title": "Why great sex starts with talking | Dr. Hareder McDowell | TEDxChicago",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T17:24:15.903312+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T16:48:04+00:00",
        "description": "This TEDx talk invites audiences to reconsider what it means to be \"only human\" — and to discover how everyday acts of care, connection, and contribution can become catalysts for lasting change. Angela Burgess is the President & CEO of Broad Oaks Consulting, a consulting firm dedicated to transforming how mission-driven organizations lead and raise funds. A former wealth management executive turned nonprofit champion, Angela brings strategic precision and human-centered insight to the world of social impact.\n\nAngela is also the best-selling author of Are You on the Right Bus? Navigating Change on the Road to Success, a memoir-meets-roadmap that challenges readers to align their lives with their values.\n\nOriginally from Iowa City, Iowa, Angela brings real-world insight, results-driven strategies, and a dash of Iowa pragmatism to her work. Today she lives in Houston, TX with her husband, Gary, and their dog, Enzo. She loves cooking and eating great food — especially when it’s shared aro",
        "id": 4267288,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MlHvCYUSmc0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MlHvCYUSmc0/hqdefault.jpg",
        "title": "5 Ways Your Humanness Can Change the World | Angela Burgess | TEDxCapeMay",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T17:24:16.213765+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T16:36:32+00:00",
        "description": "What is probate and why should you care? If you die with no estate planning whatsoever, you are considered intestate. Probate should be something to be avoided as it can cause undue expense and stress when your family members are already inundated with grief.  https://wcnllp.com/wellesley-ma-lawyers/attorney-meredith-havard/ This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4267289,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TEkncw-JCG0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TEkncw-JCG0/hqdefault.jpg",
        "title": "What is probate? | Meredith Havard, Esq. | TEDxNewbury Street Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T17:24:16.551236+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T16:31:45+00:00",
        "description": "You’re carrying a warm, wet supercomputer in your head that runs on a cheeseburger and a lightbulb’s worth of power and it still outclasses our most advanced AI. \n\nIn this talk, you’ll see how scientists are growing brain cells on chips, teaching them to play video games, and using them to test drugs tailored to your biology. \n\nAlong the way, we’re forced to confront big questions about consciousness, ownership, and the ethics of computers made from living cells.\n\nFollow the research at https://corticallabs.com/ Hon Weng Chong is a medical doctor, entrepreneur, and technologist behind the world’s first biological computer. As founder and CEO of Cortical Labs, he is pioneering the fusion of human brain cells with silicon chips, opening new frontiers in medicine, AI, and robotics. \n\nRecognised in Forbes 30 Under 30, Hon’s work is redefining the boundaries of intelligence and sparking vital conversations on the ethics of living technology. This talk was given at a TEDx event using the TE",
        "id": 4267291,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=q4oGMaKNYeU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/q4oGMaKNYeU/hqdefault.jpg",
        "title": "When Computers Grow Brains: Rethinking AI with Living Cells | Hon Weng Chong | TEDxMelbourne",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T17:24:16.761279+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T16:29:39+00:00",
        "description": "Shirin shares her journey as a neurodivergent healthcare professional, exploring the barriers neurodivergent clinicians face. She highlights the strengths neurodivergent professionals bring and offers practical advice on making healthcare workplaces more accessible and inclusive by default Shirin is a psychology master’s student and an award-winning neurodivergent speaker and advocate. Drawing on her lived experience and academic research, she is passionate about challenging stereotypes surrounding neurodivergent clinicians. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4267293,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=o_v9PVEcP6g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/o_v9PVEcP6g/hqdefault.jpg",
        "title": "Creating space for neurodivergent people by default | Shirin Yazdian | TEDxNHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T17:24:16.912378+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T16:21:27+00:00",
        "description": "In the 20th century, we began to die slowly—from our own biology, rather than predators or infections. Fast deaths are now the exception, not the rule. Today, some 45 million deaths a year owe to biological aging, and we treat these deaths as mostly inevitable. But what if they are not? What if preventing our newly slow deaths is a moral and economic imperative? \n\nDrawing on interviews with 102 scientists and original economic modeling, Dr. Romanni-Klein reveals why advancing the young science of aging may offer the highest social return of all possible investments in the life sciences. New advancements that redesign how we age and die as a species could soon make for the most impactful breakthrough in human history. If we could truly reverse biological aging, we’d add trillions to GDP—and more meaning to life. Raiany Romanni-Klein is CEO of the Institute for Life and Technology, a new 501(c)(3) designed to study, streamline, and quantify progress in U.S. science and technology. She i",
        "id": 4267295,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=dU4ckx_JM1k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dU4ckx_JM1k/hqdefault.jpg",
        "title": "The ethics and economics of human longevity | Raiany Romanni-Klein | TEDxBoston",
        "vote": 0
    }
]