[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T23:22:35.595370+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T23:10:00+00:00",
        "description": "Firefox 146 has been released with native fractional scaling support on Wayland -- finally giving Linux users crisp UI rendering. Other new additions include GPU process improvements on macOS, developer-focused CSS features, and broader access to Firefox Labs. Phoronix reports: Firefox 146 also now makes Firefox Labs available to all users, Firefox on macOS now has a dedicated GPU process by default, dropping Direct2D support on Windows, support for compressed elliptic curve points in WebCrypto, and updated the bundled Skia graphics library. Firefox 146 also has some fun developer enhancements like support for the CSS text-decoration-inset property, the @scope rule now being supported, CSS contrast-color() function being available, and several new experimental web features. The release notes and developer changes can be found at their respective links. Release binaries are available at Mozilla.org.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"h",
        "id": 4270322,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/08/2135208/firefox-146-now-available-with-native-fractional-scaling-on-wayland",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Firefox 146 Now Available With Native Fractional Scaling On Wayland",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T23:22:35.809850+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T22:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Meta's proposal to use less personal data for targeted advertising in its pay-or-consent model that will be rolled out next month won the approval of EU antitrust regulators on Monday, signaling the company will not face daily fines after all. [...] The U.S. tech giant has been locked in discussions with the European Commission after getting hit with a $233 million fine in April for breaching the Digital Markets Act aimed at reining in the power of Big Tech. The violation covered Facebook and Instagram in the period from November 2023 to November 2024, after which Meta tweaked its pay-or-consent model to use less personal data for targeted advertising.\n \nThe EU executive has been examining the changes to see if they comply with the DMA, with Meta risking daily fines of as much as 5% of its average daily worldwide turnover if found to be still in breach of the law. The tweaks are in wording, design and transparency to remind users of th",
        "id": 4270323,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/08/2130204/meta-pledge-to-use-less-personal-data-for-ads-gets-eu-nod-avoids-daily-fines",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Pledge To Use Less Personal Data For Ads Gets EU Nod, Avoids Daily Fines",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T22:20:54.483280+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T21:50:00+00:00",
        "description": "Lenovo may be preparing to unveil a gaming laptop that uses rollable OLED technology to expand horizontally into an ultrawide 21:9 display, according to a Windows Latest report suggesting the device could appear at CES 2026 in January. The Lenovo Legion Pro Rollable would differ from the company's existing ThinkBook Plus Gen 6, which expands its screen vertically. \n\nThe new gaming-focused design would see the left and right edges of the display extend beyond the laptop's base chassis when unrolled. Specific details remain scarce. Windows Latest doesn't know the display resolution, refresh rate, screen dimensions in either state, pricing, or release timing -- though it does mention an Intel Core Ultra processor. The ThinkBook Plus Gen 6 currently sells for $3,500.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lenovo's+Next+Gaming+Laptop+May+Have+a+Rollable+OLED+Screen+That+Stretches+Ultrawide%3A+https%3A%2F%2Ftech.s",
        "id": 4269841,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/08/2028217/lenovos-next-gaming-laptop-may-have-a-rollable-oled-screen-that-stretches-ultrawide",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lenovo's Next Gaming Laptop May Have a Rollable OLED Screen That Stretches Ultrawide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T21:18:47.682428+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T21:10:00+00:00",
        "description": "The influencer economy that Goldman Sachs projects will reach nearly half a trillion dollars by 2027 depends on a less-examined population: the influenced, millions of people who find themselves accumulating debt and clutter after years of exposure to what amounts to a 24/7 digital infomercial. \n\nAntoinette Hocbo, a former marketing professional who knows the tricks brands use to chip away at willpower, bought a $199 Pilates program, an iPad, and an arsenal of makeup products after TikTok's algorithm served her a stream of aspirational content. The Pilates gear now sits unused. Elysia Berman accumulated over $50,000 in debt across four credit cards and four buy-now-pay-later services during the pandemic, purchasing items she never wore because influencers recommended them. \n\nA 2024 Pew Research Center survey found 62% of adults on TikTok use the platform to find product reviews and recommendations. Marketing expert Mara Einstein told The Verge that brands now need seven exposures to p",
        "id": 4269379,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/08/200230/social-medias-relentless-shopping-machine-has-created-an-army-of-debt-laden-buyers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Social Media's Relentless Shopping Machine Has Created an Army of Debt-Laden Buyers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T21:18:47.914586+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T20:30:00+00:00",
        "description": "China has contributed less to global growth this year than the U.S. despite Beijing's frequent criticism of protectionism, according to a Wall Street Journal analysis citing new research from Goldman Sachs economists. U.S. imports are up 10% so far this year compared to a year earlier, while China's imports have fallen 3% in dollar terms. Goldman's economists found that the historical relationship between Chinese growth and global growth has turned negative; where 1% more Chinese output once raised world output by 0.2%, the bank now projects. \n\nChina will grow about 0.6 percentage points faster annually over the next few years while reducing the rest of the world's growth by 0.1 point per year. China's current account surplus could reach 1% of world GDP by 2029, Goldman estimates, larger than any country's since the late 1940s. China now accounts for 17% of global GDP.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=",
        "id": 4269380,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/08/1932222/chinas-growth-is-coming-at-the-rest-of-the-worlds-expense",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's Growth Is Coming at the Rest of the World's Expense",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T20:13:15.824527+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T19:50:00+00:00",
        "description": "Denmark's postal service, established by King Christian IV four centuries ago as one of Europe's first modern mail systems, will stop delivering letters on December 30, ending a tradition that once saw riders given a maximum of 45 minutes to cover each 10-kilometer stretch of routes running from Hamburg to Norway. \n\nPostNord, the postal service Denmark has shared with Sweden since 2009, started removing its 1,500 remaining red post boxes in June; a handful will go to museums. Letter volumes collapsed from nearly 1.5 billion in 2000 to 110 million last year. A standard stamp now costs 29 Danish kroner ($4.52). A private logistics firm called DAO will take over letter delivery. PostNord will continue handling parcels. The decision has rattled postal services elsewhere in Europe. Deutsche Post in Germany, still delivering 61 million letters daily, has warned it faces the same trends.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/",
        "id": 4268899,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/08/197230/denmark-posts-its-last-letters-as-hallowed-national-mail-ends",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark Posts Its Last Letters as Hallowed National Mail Ends",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T20:13:16.007409+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T19:15:00+00:00",
        "description": "Dollar General and Family Dollar stores have collectively failed more than 6,400 government price-accuracy inspections since January 2022, charging customers more at checkout than the prices displayed on shelves for everything from frozen pizzas to puppy food, according to an investigation by the Guardian. The review examined records from 45 states and more than 140 counties and cities. Dollar General stores failed over 4,300 inspections across 23 states, and Family Dollar failed more than 2,100 in 20 states. Error rates at the worst-performing locations reached staggering levels -- 76% at a Dollar General in Hamilton, Ohio and 68% at a Family Dollar in Bound Brook, New Jersey. A Family Dollar in Provo, Utah failed 28 consecutive inspections. \n\nIndustry watchers, employees and lawsuits attribute the discrepancies to minimal staffing. Registers update automatically when prices change, but shelf labels require manual replacement, and workers often lack the time. State attorneys general ",
        "id": 4268900,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/08/1858239/how-the-dollar-store-industry-overcharges-cash-strapped-customers-while-promising-low-prices",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How the Dollar-Store Industry Overcharges Cash-Strapped Customers While Promising Low Prices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T18:49:50.080781+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T18:42:00+00:00",
        "description": "Google said it's working to create two different categories of artificial intelligence-powered smart glasses to compete next year with existing models from Meta Platforms: one with screens, and another that's audio focused. From a report: The first AI glasses that Google is collaborating on will arrive sometime in 2026, it said in a blog post Monday. Samsung Electronics, Warby Parker and Gentle Monster are among its early hardware partners, but the companies have yet to show any final designs. Google also outlined several software improvements coming to Samsung's Galaxy XR headset, including a travel mode that will allow the mixed-reality device to be used in cars and on planes.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Says+First+AI+Glasses+With+Gemini+Will+Arrive+in+2026%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F12%2F08%2F1842237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https",
        "id": 4268390,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/08/1842237/google-says-first-ai-glasses-with-gemini-will-arrive-in-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Says First AI Glasses With Gemini Will Arrive in 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T17:44:56.475144+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T16:57:00+00:00",
        "description": "A powerful magnitude 7.6 earthquake has shaken Japan, prompting tsunami warnings and orders for residents to evacuate. From a report: A tsunami as high as 3 metres (10ft) could hit the country's north-eastern coast after the earthquake occurred offshore at 11.15pm local time (2.15pm GMT), the Japan Meteorological Agency (JMA) said. Tsunami warnings were issued for the prefectures of Hokkaido, Aomori and Iwate, and tsunamis from 20-50cm (7-18in) high were observed at several ports, JMA said. \n\nThe epicentre of the quake was 50 miles (80km) off the coast of Aomori prefecture, at a depth of 30 miles, the agency added. On Japan's one-to-seven scale of seismic intensity, the tremor registered as an \"upper six\" in Aomori prefecture -- a quake strong enough to make it impossible to keep standing or move without crawling. In such tremors, most heavy furniture can collapse and wall tiles and windowpanes are damaged in many buildings.<p><div class=\"share_submission\" style=\"position:relative;\">\n",
        "id": 4267729,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/08/1657214/japan-issues-tsunami-warning-after-magnitude-76-earthquake",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan Issues Tsunami Warning After Magnitude 7.6 Earthquake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T16:41:21.943511+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T16:05:00+00:00",
        "description": "An investigation has revealed how stablecoins -- cryptocurrencies pegged to the US dollar that exist largely beyond traditional financial oversight -- have become a practical tool for criminals and sanctioned individuals to move funds across borders almost instantly and convert them back into spendable money, often without detection. \n\nA Chainalysis report from February estimated that up to $25 billion in illicit transactions involved stablecoins last year. A New York Times reporter tested the system by converting $40 cash at a crypto ATM in Weehawken, New Jersey, into stablecoins and then using a Telegram bot to generate a Visa payment card without any identity verification. The card-issuing service, WantToPay, is incorporated in Hong Kong and led by a Russian entrepreneur in Thailand; it advertises to Russians blocked by US sanctions. Britain last month arrested members of a billion-dollar money laundering network that had purchased a bank in Kyrgyzstan to convert proceeds from drug",
        "id": 4266811,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/08/1545253/how-a-cryptocurrency-helps-criminals-launder-money-and-evade-sanctions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How a Cryptocurrency Helps Criminals Launder Money and Evade Sanctions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T16:41:22.154757+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T15:30:00+00:00",
        "description": "Tech giants including Meta, Alphabet, Microsoft and Amazon have all extended the estimated useful lives of their servers and AI equipment over the past five years, sparking a debate among investors about whether these accounting changes are artificially inflating profits. Meta this year increased its depreciation timeline for most servers and network assets to 5.5 years, up from four to five years previously and as little as three years in 2020. The company said the change reduced its depreciation expense by $2.3 billion for the first nine months of 2025. Alphabet and Microsoft now use six-year periods, up from three in 2020. Amazon extended to six years by 2024 but cut back to five years this year for some servers and networking equipment. \n\nMichael Burry, the investor portrayed in \"The Big Short,\" called extending useful lives \"one of the more common frauds of the modern era\" in an article last month. Meta's total depreciation expense for the nine-month period was almost $13 billion",
        "id": 4266812,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/08/1530255/the-accounting-uproar-over-how-fast-an-ai-chip-depreciates",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Accounting Uproar Over How Fast an AI Chip Depreciates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T14:48:25.045250+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T14:30:00+00:00",
        "description": "Paramount Skydance is launching a hostile bid to buy Warner Bros. Discovery after it lost out to Netflix in a months-long bidding war for the legacy assets, the company said Monday. CNBC: Paramount will go straight to WBD shareholders with an all-cash, $30-per-share offer. That's the same bid WBD rejected last week, according to people familiar with the bid who asked not to be named because the details were private. The offer is backstopped with equity financing from the Ellison family and the private-equity firm RedBird Capital and $54 billion of debt commitments from Bank of America, Citi and Apollo Global Management. \n\n\"We're really here to finish what we started,\" Ellison told CNBC's \"Squawk on the Street\" Monday. \"We put the company in play.\" On Friday, Netflix announced a deal to acquire WBD's studio and streaming assets for $72 billion. David Ellison-run Paramount had been bidding for the entirety of Warner Bros. Discovery, including those assets and the company's TV networks l",
        "id": 4266182,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/08/1429227/paramount-skydance-launches-hostile-bid-for-wbd-after-netflix-wins-bidding-war",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Paramount Skydance Launches Hostile Bid For WBD After Netflix Wins Bidding War",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T14:48:25.255143+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T14:00:00+00:00",
        "description": "Amazon used its annual re:Invent cloud conference in Las Vegas to pitch a vision of the workplace where AI agents serve not as tools but as \"co-workers\" and \"teammates,\" even as the company proceeds with eliminating roughly 14,000 corporate jobs in its second major workforce reduction in recent years. \n\nAWS CEO Matt Garman predicted on stage that autonomous \"frontier agents\" could represent 80 to 90% of enterprise AI value. Colleen Aubrey, senior vice president of applied AI solutions, described a future where companies manage \"teams\" of agents capable of working autonomously for hours or days while humans shift into supervisory roles. Amazon has already deployed agentic systems across tens of thousands of its own engineers to triage outages and propose fixes. The company calls these systems \"teammates\" rather than tools. CEO Andy Jassy has warned that AI would shrink Amazon's workforce, though a spokesperson attributed the current cuts to \"reducing bureaucracy\" and \"removing layers\" ",
        "id": 4266183,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/08/141202/amazon-pitches-ai-tools-as-co-workers-while-axing-jobs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Pitches AI Tools as Co-Workers While Axing Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T12:43:31.691143+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T12:34:00+00:00",
        "description": "America's Energy Department runs a research lab in Idaho &mdash; and this week announced successful results from a ground-breaking experiment. \"This is the first time in history that chloride-based molten salt fuel has been produced for a fast reactor,\" says Bill Phillips, the lab's technical lead for salt synthesis. He calls it \"a major milestone for American innovation and a clear signal of our national commitment to advanced nuclear energy.\"\n\n\nUnlike traditional reactors that use solid fuel rods and water as a coolant, most molten salt reactors rely on liquid fuel &mdash; a mixture of salts containing fissile material. This design allows for higher operating temperatures, better fuel efficiency, and enhanced safety. It also opens the door to new applications, including compact nuclear systems for ships and remote installations. \n\n\"The Molten Chloride Fast Reactor represents a paradigm shift in the nuclear fuel cycle, and the Molten Chloride Reactor Experiment (MCRE) will directly i",
        "id": 4263636,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/07/2231215/idaho-lab-produces-worlds-first-molten-salt-fuel-for-nuclear-reactors",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Idaho Lab Produces World's First Molten Salt Fuel for Nuclear Reactors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T12:43:31.838290+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T08:34:00+00:00",
        "description": "What triggered that Airbus emergency software recall? The BBC reports that Airbus's initial investigation into an aircraft's sudden drop in altitude linked it \"to a malfunction in one of the aircraft's computers that controls moving parts on the aircraft's wings and tail.\" But that malfunction \"seems to have been triggered by cosmic radiation bombarding the Earth on the day of the flight...\" \n\nThe BBC believes radiation from space \"could become a growing problem as ever more microchips run our lives.\"\n\n\nWhat Airbus says occurred on that JetBlue flight from Cancun to New Jersey was a phenomenon called a single-event upset, or bit flip. As the BBC has previously reported, these computer errors occur when high-speed subatomic particles from outer space, such as protons, smash into atoms in our planet's atmosphere. This can cause a cascade of particles to rain down through our atmosphere, like throwing marbles across a table. In rare cases, those fast-moving neutrons can strike computer e",
        "id": 4263637,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/08/0625216/was-the-airbus-a320-recall-caused-by-cosmic-rays",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Was the Airbus A320 Recall Caused By Cosmic Rays?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T12:43:31.988347+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T04:36:00+00:00",
        "description": "An anonymous reader shared this report from Autoblog:\n\n\nImagine walking out to your car, pressing the start button, and getting absolutely nothing. No crank, no lights on the dash, nothing. That's exactly what happened to hundreds of Porsche owners in Russia last week. The issue is with the Vehicle Tracking System, a satellite-based security system that's supposed to protect against theft. Instead, it turned these Porsches into driveway ornaments. \n\n\nThe issue was first reported at the end of November, with owners reporting identical symptoms of their cars refusing to start or shutting down soon after ignition. Russia's largest dealership group, Rolf, confirmed that the problem stems from a complete loss of satellite connectivity to the VTS. When it loses its connection, it interprets the outage as a potential theft attempt and automatically activates the engine immobilizer. \n\n\nThe issue affects all models and engine types, meaning any Porsche equipped with the system could potentiall",
        "id": 4263638,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/08/0310242/all-of-russias-porsches-were-bricked-by-a-mysterious-satellite-outage",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "All of Russia's Porsches Were Bricked By a Mysterious Satellite Outage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T12:43:32.166110+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T02:40:00+00:00",
        "description": "Nuclear engineer Lonnie Johnson worked on NASA's Galileo mission, has more than 140 patents, and invented the Super Soaker water gun.\nBut now he's working on \"a potential key to unlock a huge power source that's rarely utilized today,\" reports the Atlanta Journal-Constitution. [Alternate URL here.] \n\n\nWaste heat...\n\nThe Johnson Thermo-Electrochemical Converter, or JTEC, has few moving parts, no combustion and no exhaust. All the work to generate electricity is done by hydrogen, the most abundant element in the universe. Inside the device, pressurized hydrogen gas is separated by a thin, filmlike membrane, with low pressure gas on one side and high pressure gas on the other. The difference in pressure in this \"stack\" is what drives the hydrogen to compress and expand, creating electricity as it circulates. And unlike a fuel cell, it does not need to be refueled with more hydrogen. All that's needed to keep the process going and electricity flowing is a heat source. \n\nAs it turns out, t",
        "id": 4263640,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/08/0236259/can-this-simple-invention-convert-waste-heat-into-electricity",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Can This Simple Invention Convert Waste Heat Into Electricity?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T12:43:32.360560+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T01:35:00+00:00",
        "description": "Phys.org republishes this article from The Conversation:\n\n\n\nOn average, managers spend 23 hours a week in meetings. Much of what happens in them is considered to be of low value, or even entirely counterproductive. The paradox is that bad meetings generate even more meetings... in an attempt to repair the damage caused by previous ones... \n\nA 2015 handbook laid the groundwork for the nascent field of \"Meeting Science\". Among other things, the research revealed that the real issue may not be the number of meetings, but rather how they are designed, the lack of clarity about their purpose, and the inequalities they (often unconsciously) reinforce... Faced with what we call meeting madness, the solution is not to eliminate meetings altogether, but to design them better. It begins with a simple but often forgotten question: why are we meeting...? \n\nThe goal should not be to have fewer meetings, but better ones. Meetings that respect everyone's time and energy. Meetings that give a voice t",
        "id": 4263641,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/08/0132210/why-meetings-can-harm-employee-well-being",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Meetings Can Harm Employee Well-Being",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-08T12:43:32.577467+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-08T00:34:00+00:00",
        "description": "Friday six European Union countries \"asked the European Commission to water down an effective ban on the sale of internal combustion engine cars slated for 2035,\" reports Reuters\n\nThe countries have asked the EU Commission to allow the sale of hybrid cars or vehicles powered by other, existing or future, technologies \"that could contribute to the goal of reducing emissions\" beyond 2035, a joint letter seen by Reuters showed on Friday. The letter was signed by the prime ministers of Bulgaria, the Czech Republic, Hungary, Italy, Poland and Slovakia. They also asked for low-carbon and renewable fuels to be included in the plan to reduce the carbon emissions from transportation... \n\nSince they adopted a regulation that all new vehicles from 2035 should have zero emissions in March 2023, EU countries are now having second thoughts. Back then, the outlook for battery electric vehicles was positive, but carmakers' efforts have later collided with the reality of lower-than-expected demand and",
        "id": 4263642,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/08/0022229/eu-urged-to-soften-2035-ban-on-internal-combustion-engine-cars",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU Urged to Soften 2035 Ban on Internal Combustion Engine Cars",
        "vote": 0
    }
]