[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T23:49:05.212926+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T23:30:00+00:00",
        "description": "Shopify is launching stablecoin payments for its merchants later this year, starting with USDC in collaboration with Coinbase and Stripe. Fortune reports: The publicly traded tech company lets merchants -- including vintage clothes sellers, cosmetics businesses, and electronics companies -- set up their own online marketplaces. By late June, Shopify will let a select group of users accept payments in USDC, a stablecoin issued by the crypto company Circle, which recently had one of the year's hottest IPOs. \"In our own philosophical framework, we are extremely aligned with everything that crypto stands for,\" Tobias Lutke, the CEO of Shopify and a Coinbase board member, said onstage at a Coinbase conference on Thursday.\n \nShopify will then gradually expand access to merchants across its network in the U.S. and Europe before opening up stablecoin payments to every merchant who uses its platform. The e-commerce company worked with Coinbase to develop a payments protocol to handle chargebac",
        "id": 2919257,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/12/2221234/shopify-partners-with-coinbase-and-stripe-in-landmark-stablecoin-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Shopify Partners With Coinbase and Stripe In Landmark Stablecoin Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T23:49:05.370247+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T22:50:00+00:00",
        "description": "Amazon has quietly doubled the ad load on Prime Video to 4-6 minutes per hour, up from the 2-3.5 minutes initially discussed when ads launched in 2024. AdWeek reports: According to six ad buyers and documents reviewed by ADWEEK, the current ad load on Prime Video now ranges from four to six minutes per hour. And while that could bring down CPMs, buyers will be watching whether this impacts user experience. \"Prime Video ad load has gradually increased to four to six minutes per hour,\" an Amazon representative wrote to an ad buyer in an email obtained by ADWEEK. The exchange occurred earlier this month.\n \nThe increase, which Amazon had telegraphed to investors but has not publicly acknowledged to consumers, gives the company significantly more inventory to sell across its rapidly expanding streaming business. \"They told us the ad load would be increasing,\" said Kendra Tang, programmatic supervisor at Rain the Growth Agency. \"That's been confirmed recently when we noticed more avails in ",
        "id": 2919258,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/06/12/2052205/amazon-doubles-prime-video-ads-to-6-minutes-per-hour?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Doubles Prime Video Ads to 6 Minutes Per Hour",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T22:45:41.304886+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: The US Cybersecurity and Infrastructure Security Agency has lost another senior leader: executive director Bridget Bean departed on Wednesday. Bean, who served as the de facto agency boss for five months between former CISA director Jen Easterly's departure in January and Madhu Gottumukkala's appointment to the deputy director post last month, said she was \"officially retiring from Federal service once again\" in a LinkedIn post. \"My time at CISA has been truly remarkable,\" she wrote. \"Having had the privilege to serve as the Senior Official Performing the Duties of Director of CISA for 5 months has been a profound honor.\"\n \nCISA's executive leadership page now lists Gottumukkala as its acting director, and the agency remains without a Senate-confirmed leader. President Trump nominated Sean Plankey to serve as the agency's director, and his nomination is scheduled for consideration (PDF) by the Senate's Homeland Security and Govern",
        "id": 2918896,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/12/2044215/cisa-loses-another-senior-exec?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CISA Loses Another Senior Exec",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T21:39:03.986558+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T21:30:00+00:00",
        "description": "The PCI-SIG, which oversees the development of the PCIe specification, has officially released the final spec for PCI Express 7.0. \"The PCIe 7.0 specification increases the per-lane data transfer rate to 128 GT/s in each direction, which is twice as fast as PCIe 6.0 supports and four times faster than PCIe 5.0,\" reports Tom's Hardware. \"Such a significant performance increase enables devices with 16 PCIe 7.0 lanes to transfer up to 256 GB/s in each direction, not accounting for protocol overhead. The new version of the interface continues to use PAM4 signaling while maintaining the 1b/1b FLIT encoding method first introduced in PCIe 6.0.\" From the report: To achieve PCIe 7.0's 128 GT/s record data transfer rate, developers of PCIe 7.0 had to increase the physical signaling rate to 32 GHz or beyond. Keep in mind that both PCIe 5.0 and 6.0 use a physical signaling rate of 16 GHz to enable 32 GT/s using NRZ signaling and 64 GT/s using PAM4 signaling (which allows transfers of two bits pe",
        "id": 2918531,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/12/2037225/pci-express-70-specs-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PCI Express 7.0 Specs Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T21:39:04.145720+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T20:50:00+00:00",
        "description": "Microsoft quietly teased its next-generation Xbox by showcasing its collaboration with Asus \"to bring two Xbox Ally handhelds to the market later this year,\" writes The Verge's Tom Warren. From the report: The Xbox Ally handhelds run Windows, but the Xbox team has worked with Windows engineers to boot these PC handhelds into a full-screen Xbox UI. The Windows desktop doesn't even fully load, and you use the Xbox app UI as a launcher to get to all your games (even Steam titles) and apps like Discord. While the combination of Windows and Xbox here is intriguing, it's the way that Microsoft is positioning these devices that really caught my attention.\n \n\"This is an Xbox,\" said Microsoft during the reveal, clearly expanding its marketing push beyond a single console to every screen and device. It all felt like a true Xbox handheld reveal. There was even an 11-minute-long behind-the-scenes video on the Xbox Ally handhelds, filmed in a similar style to Microsoft's \"Project Scorpio\" Xbox One",
        "id": 2918532,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/12/2027249/microsoft-just-teased-its-next-gen-xbox-console-and-nobody-noticed?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Just Teased Its Next-Gen Xbox Console, and Nobody Noticed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T20:35:20.238667+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T20:10:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Last week, electronics engineer Lorentio Brodesco announced the completion of a mock-up for nsOne, reportedly the first custom PlayStation 1 motherboard created outside of Sony in the console's 30-year history. The fully functional board accepts original PlayStation 1 chips and fits directly into the original console case, marking a milestone in reverse-engineering for the classic console released in 1994. Brodesco's motherboard isn't an emulator or FPGA-based re-creation -- it's a genuine circuit board designed to work with authentic PlayStation 1 components, including the CPU, GPU, SPU, RAM, oscillators, and voltage regulators. The board represents over a year of reverse-engineering work that began in March 2024 when Brodesco discovered incomplete documentation while repairing a PlayStation 1.\n \n\"This isn't an emulator. It's not an FPGA. It's not a modern replica,\" Brodesco wrote in a Reddit post about the project. \"It's a real ",
        "id": 2918033,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/12/206219/engineer-creates-first-custom-motherboard-for-1990s-playstation-console?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Engineer Creates First Custom Motherboard For 1990s PlayStation Console",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T19:30:03.648180+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T19:04:00+00:00",
        "description": "Multiple popular services -- including Google, Google Cloud, AWS, Spotify, Discord, Cloudflare, Google Nest, Azure, Box and Shopify -- are experiencing at least a partial outage globally that began around 2:25pm ET Friday, according to user complaints with reports flooding in across social media and outage tracking sites. Cloudflare has confirmed ongoing issues that started within the past hour. It remains unclear what prompted the outage. \n\nMore details to follow.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google%2C+AWS%2C+Cloudflare+Among+Popular+Services+Hit+By+Widespread+Outage%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F06%2F12%2F194251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F06%2F12%2F194251%2Fgoogle-aws-cloudflare-among-popul",
        "id": 2917544,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/12/194251/google-aws-cloudflare-among-popular-services-hit-by-widespread-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google, AWS, Cloudflare Among Popular Services Hit By Widespread Outage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T18:25:28.615829+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T18:13:00+00:00",
        "description": "BrianFagioli writes: Barbie is getting a brain upgrade. Mattel has officially partnered with OpenAI in a move that brings artificial intelligence to the toy aisle. Yes, you read that right, folks. Barbie might soon be chatting with your kids in full sentences, powered by ChatGPT. \n\nThis collaboration brings OpenAI's advanced tools into Mattel's ecosystem of toys and entertainment brands. The goal? To launch AI-powered experiences that are fun, safe, and age-appropriate. Mattel says it wants to keep things magical while also respecting privacy and security. Basically, Barbie won't be data-mining your kids... yet.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Barbie+Goes+AI+As+Mattel+Teams+With+OpenAI+To+Reinvent+Playtime%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F12%2F1813241%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href",
        "id": 2917043,
        "language": null,
        "link": "https://slashdot.org/story/25/06/12/1813241/barbie-goes-ai-as-mattel-teams-with-openai-to-reinvent-playtime?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Barbie Goes AI As Mattel Teams With OpenAI To Reinvent Playtime",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T18:25:28.792831+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T17:31:00+00:00",
        "description": "More than a dozen private browsing apps on Apple and Google's app stores have undisclosed ties to Chinese companies, leaving user data at risk of exposure to the Chinese government, according to a new report from the Tech Transparency Project. From a report: Thirteen virtual private network (VPN) apps on Apple's App Store and 11 apps on Google's Play Store have ties to Chinese companies, the tech watchdog group said in the report released Thursday. \n\nChinese law requires Chinese companies to share data with the government upon request, creating privacy and security risks for American users. Several of the apps, including two on both app stores and two others on Google Play Store, have ties to Chinese cybersecurity firm Qihoo 360, which has been sanctioned by the U.S. government, according to the report. The Tech Transparency Project previously identified more than 20 VPN apps on Apple&#226;(TM)s App Store with Chinese ties in an April report. The iPhone maker has since removed three a",
        "id": 2917044,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/12/1731258/more-than-a-dozen-vpn-apps-have-undisclosed-ties-to-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Than a Dozen VPN Apps Have Undisclosed Ties To China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T17:07:09.320952+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T16:48:00+00:00",
        "description": "Anker has issued a recall for its PowerCore 10000 power bank (model A1263) due to a \"potential issue with the lithium-ion battery\" that could pose a fire safety risk. An anonymous reader adds: The company has received 19 reports of fires and explosions that have caused minor burn injuries and resulted in property damage totaling over $60,700, according to the US Consumer Product Safety Commission (USCPSC). \n\nThe recall covers about 1,158,000 units that were sold online through Amazon, Newegg, and eBay between June 2016 and December 2022. The affected batteries can be identified by the Anker logo engraved on the side with the model number A1263 printed on the bottom edge. However, Anker is only recalling units sold in the US with qualifying serial numbers. To check if yours is included, you'll need to visit Anker's website.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anker+Recalls+Over+1.1+Million+Power+Banks+Due+",
        "id": 2916325,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/12/1649201/anker-recalls-over-11-million-power-banks-due-to-fire-and-burn-risks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anker Recalls Over 1.1 Million Power Banks Due To Fire and Burn Risks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T17:07:09.477827+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T16:04:00+00:00",
        "description": "Agriculture equipment giant Deere must face a lawsuit by the U.S. Federal Trade Commission accusing the company of forcing farmers to use its authorized dealer network and driving up their costs for parts and repairs, a U.S. judge has ruled. From a report: U.S. District Judge Iain Johnston in the federal court in Rockford, Illinois on Monday ruled for now to reject, opens new tab Deere's effort to end the lawsuit, which was filed at the end of Democratic President Joe Biden's administration in January. \n\nThe lawsuit alleges Deere is violating federal antitrust law by controlling too tightly where and how farmers can get their equipment repaired, allowing the Illinois-based company to charge artificially higher prices. The FTC was joined in its lawsuit by Michigan, Wisconsin and three other U.S. states.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Deere+Must+Face+FTC's+Antitrust+Lawsuit+Over+Repair+Costs%2C+US+Judg",
        "id": 2916326,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/12/165207/deere-must-face-ftcs-antitrust-lawsuit-over-repair-costs-us-judge-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Deere Must Face FTC's Antitrust Lawsuit Over Repair Costs, US Judge Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T16:01:50.802462+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T15:20:00+00:00",
        "description": "The abstract of a study on NBER: We examine the performance of startups co-founded by immigrant and native teams. Leveraging unique data linking startups to founders' and employees' employment and education histories, we find native-migrant teams outperform native-only and migrant-only teams. \n\nNative-migrant startups have larger employment three years after founding, are more likely to secure funding, access larger funding rounds, and achieve more successful exits. An instrumental variables strategy based on native shares in university-degree programs confirms native-migrant teams are larger and more likely to receive funding. Superior access to diverse labor pools, successful VCs, and expanded product markets are key factors in driving native-migrant outperformance.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Native-Immigrant+Entrepreneurial+Synergies%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F12%2F01142",
        "id": 2915694,
        "language": null,
        "link": "https://slashdot.org/story/25/06/12/0114232/native-immigrant-entrepreneurial-synergies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Native-Immigrant Entrepreneurial Synergies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T14:56:31.019320+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T14:40:00+00:00",
        "description": "The World Bank is lifting its decades-long ban on financing nuclear energy, in a policy shift aimed at accelerating development of the low-emissions technology to meet surging electricity demand in the developing world. From a report: In an email to staff on Wednesday, Ajay Banga, the World Bank president, said it would \"begin to re-enter the nuclear energy space\" [non-paywalled source] in partnership with the International Atomic Energy Agency, the UN nuclear watchdog which works to prevent proliferation of nuclear weapons. \n\n\"We will support efforts to extend the life of&#194;existing reactors in countries that already have them, and help support grid upgrades and&#194;related infrastructure,\" the email said. The shift follows advocacy from the pro-nuclear Trump administration and a change of government in Germany, which previously opposed financing atomic energy due to domestic political opposition to the technology. It is part of a wider strategy aimed at tackling an expected doub",
        "id": 2915050,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/12/0947224/world-bank-lifts-ban-on-funding-nuclear-energy-in-boost-to-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World Bank Lifts Ban on Funding Nuclear Energy in Boost To Industry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T14:56:31.199638+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T14:00:00+00:00",
        "description": "Google has removed device trees and driver binaries for Pixel phones from the Android 16 source code release, significantly complicating custom ROM development for those devices. The Android-maker intentionally omitted these resources as it shifts its Android Open Source Project reference target from Pixel hardware to a virtual device called \"Cuttlefish.\" \n\nThe change forces custom ROM developers to reverse-engineer configurations they previously received directly from Google. Nolen Johnson from LineageOS said the process will become \"painful,\" requiring developers to \"blindly guess and reverse engineer from the prebuilt binaries what changes are needed each month.\" Google also squashed the Pixel kernel source code's commit history, eliminating another reference point developers used for features and security patches. \n\nGoogle VP Seang Chau dismissed speculation that AOSP itself is ending, stating the project \"is NOT going away.\" However, the changes effectively bring Pixel devices do",
        "id": 2915051,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/12/0920240/aosp-isnt-dead-but-google-just-landed-a-huge-blow-to-custom-rom-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AOSP Isn't Dead, But Google Just Landed a Huge Blow To Custom ROM Developers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T13:13:56.996343+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T12:45:00+00:00",
        "description": "Flying to London, a Boeing 787 aircraft operated by Air India \"crashed shortly after taking off...\" reports Bloomberg, \"in what stands to be the worst accident involving the U.S. planemaker's most advanced widebody airliner.\"\n\nFlight AI171 was carrying 242 passengers and crew. Video footage shared on social media showed a giant plume of smoke engulfing the crash site, with no reports of survivors. \n\nThe aircraft entered a slow descent shortly after taking off, with its landing gear still extended before exploding into a huge fireball upon impact. The crash took place in a residential area, which could mean a higher death toll... The pilots in command issued a mayday call immediately after take-off to air traffic controllers, according to India's civil aviation regulator.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Air+India+Boeing+787+Carrying+242+Passengers+Crashes+After+Takeoff%3A+https%3A%2F%2Ftech.slashdot.o",
        "id": 2914170,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/12/1224214/air-india-boeing-787-carrying-242-passengers-crashes-after-takeoff?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Air India Boeing 787 Carrying 242 Passengers Crashes After Takeoff",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T12:08:27.834906+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T11:30:00+00:00",
        "description": "An anonymous reader quotes a report from ZDNet: Denmark's Minister of Digitalization, Caroline Stage, has announced that the Danish government will start moving away from Microsoft Office to LibreOffice. Why? It's not because open-source is better, although I would argue that it is, but because Denmark wants to claim \"digital sovereignty.\" In the States, you probably haven't heard that phrase, but in the European Union, digital sovereignty is a big deal and getting bigger.\n \nA combination of security, economic, political, and societal imperatives is driving the EU's digital sovereignty moves. EU leaders are seeking to reduce Europe's dependence on foreign technology providers, primarily those from the United States, and to assert greater control over its digital infrastructure, data, and technological future. Why? Because they're concerned about who controls European data, who sets the rules, and who can potentially cut off access to essential services in times of geopolitical tension",
        "id": 2913670,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/06/12/0335229/denmark-is-dumping-microsoft-office-and-windows-for-libreoffice-and-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark Is Dumping Microsoft Office and Windows For LibreOffice and Linux",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T11:03:06.408758+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T10:00:00+00:00",
        "description": "The European Space Agency's Solar Orbiter has captured the first-ever images of the sun's poles by tilting its orbit out of the ecliptic plane. Space.com reports: The captured images of the solar south pole were taken between March 16 and 17, 2025, with the Solar Orbiter's Polarimetric and Helioseismic Imager (PHI), Extreme Ultraviolet Imager (EUI), and Spectral Imaging of the Coronal Environment (SPICE) instruments. They constitute humanity's first ever look at the sun's poles. This was the Solar Orbiter mission's first high-angle observation campaign of the sun, conducted at an angle of 15 degrees below the solar equator. Just a few days after snapping these images, the ESA spacecraft reached a maximum viewing angle of 17 degrees, which it sits in currently as it performs its first \"pole-to-pole\" orbit of our star. [...]\n \nOne of the first discoveries made by the Solar Orbiter is the fact that the magnetic fields around the sun's southern poles appear to be, for lack of a better phr",
        "id": 2913182,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/12/0022206/humanity-takes-its-first-look-at-the-suns-poles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Humanity Takes Its First Look At the Sun's Poles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T07:47:59.369955+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T07:00:00+00:00",
        "description": "Shubhanshu Shukla will become the first Indian astronaut to visit the International Space Station as part of a four-person mission by Axiom Space launching from the U.S.. The mission will include 14 days aboard the ISS and over 60 scientific studies. The Guardian reports: He will be the third astronaut of Indian origin to reach orbit, following Rakesh Sharma, who was part of a 1984 flight onboard a Soviet Soyuz spacecraft, and Kalpana Chawla, who was born in India but became a US citizen and flew on two space shuttle missions, including the 2003 Columbia flight that ended in disaster when the spacecraft disintegrated, killing all seven astronauts onboard. \"I truly believe that even though, as an individual, I am traveling to space, this is the journey of 1.4 billion people,\" Shukla was quoted as saying by the Hindu newspaper this year. Shukla said he hoped to \"ignite the curiosity of an entire generation in my country.\"\n \nIndia's department of space has called the trip a \"defining cha",
        "id": 2912017,
        "language": null,
        "link": "https://slashdot.org/story/25/06/12/0012240/india-to-send-first-astronaut-on-mission-to-iss?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India To Send First Astronaut On Mission To ISS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T04:33:21.495962+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: Australian SaaS-y graphic design service Canva now requires candidates for developer jobs to use AI coding assistants during the interview process. [...] Canva's hiring process previously included an interview focused on computer science fundamentals, during which it required candidates to write code using only their actual human brains. The company now expects candidates for frontend, backend, and machine learning engineering roles to demonstrate skill with tools like Copilot, Cursor, and Claude during technical interviews, Canva head of platforms Simon Newton wrote in a Tuesday blog post.\n \nHis rationale for the change is that nearly half of Canva's frontend and backend engineers use AI coding assistants daily, that it's now expected behavior, and that the tools are \"essential for staying productive and competitive in modern software development.\" Yet Canva's old interview process \"asked candidates to solve coding problems witho",
        "id": 2911145,
        "language": null,
        "link": "https://slashdot.org/story/25/06/12/005258/canva-now-requires-use-of-llms-during-coding-interviews?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Canva Now Requires Use of LLMs During Coding Interviews",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T02:23:02.938019+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T02:05:00+00:00",
        "description": "A coordinated spam operation has infiltrated abandoned subdomains belonging to major institutions including Nvidia, Stanford University, NPR, and the U.S. government's vaccines.gov site, flooding them with AI-generated content that subsequently appears in search results and Google's AI Overview feature. \n\nThe scheme, reports 404 Media, posted over 62,000 articles on Nvidia's events.nsv.nvidia.com subdomain before the company took it offline within two hours of being contacted by reporters. The spam articles, which included explicit gaming content and local business recommendations, used identical layouts and a fake byline called \"Ashley\" across all compromised sites. Each targeted domain operates under different names -- \"AceNet Hub\" on Stanford's site, \"Form Generation Hub\" on NPR, and \"Seymore Insights\" on vaccines.gov -- but all redirect traffic to a marketing spam page. The operation exploits search engines' trust in institutional domains, with Google's AI Overview already serving",
        "id": 2910619,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/12/019221/abandoned-subdomains-from-major-institutions-hijacked-for-ai-generated-spam?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Abandoned Subdomains from Major Institutions Hijacked for AI-Generated Spam",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T02:23:03.097841+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T01:20:00+00:00",
        "description": "The abstract of a study featured on NBER: We examine the labor market effects of AI chatbots using two large-scale adoption surveys (late 2023 and 2024) covering 11 exposed occupations (25,000 workers, 7,000 workplaces), linked to matched employer-employee data in Denmark. \n\nAI chatbots are now widespread -- most employers encourage their use, many deploy in-house models, and training initiatives are common. These firm-led investments boost adoption, narrow demographic gaps in take-up, enhance workplace utility, and create new job tasks. Yet, despite substantial investments, economic impacts remain minimal. Using difference-in-differences and employer policies as quasi-experimental variation, we estimate precise zeros: AI chatbots have had no significant impact on earnings or recorded hours in any occupation, with confidence intervals ruling out effects larger than 1%. Modest productivity gains (average time savings of 3%), combined with weak wage pass-through, help explain these limi",
        "id": 2910620,
        "language": null,
        "link": "https://slashdot.org/story/25/06/12/0117247/large-language-models-small-labor-market-effects?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Large Language Models, Small Labor Market Effects",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T01:17:32.602810+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T00:43:00+00:00",
        "description": "A dating site launched last week by Belgian artist Dries Depoorter matches potential partners based on their internet browsing histories rather than curated profiles or photos. Browser Dating requires users to download a Chrome or Firefox extension that exports and uploads their recent search data, creating matches based on shared online behaviors and interests rather than traditional dating app metrics. \n\nLess than 1,000 users have signed up since the platform's launch, paying a one-time fee of $10.3 for unlimited matches or using a free tier limited to five connections. Depoorter, known for digital art projects exploring surveillance and technology, says the concept emerged from a 2016 workshop where participants shared a year of search history data. The platform processes browsing data locally using Google's Firebase tools.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=An+Experimental+New+Dating+Site+Matches+Sin",
        "id": 2910329,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/12/0043259/an-experimental-new-dating-site-matches-singles-based-on-their-browser-histories?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "An Experimental New Dating Site Matches Singles Based on Their Browser Histories",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-12T00:13:41.852777+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-12T00:02:00+00:00",
        "description": "Amazon Web Services has signed a long-term deal with Talen Energy to receive up to 1,920 megawatts of carbon-free electricity from the Susquehanna nuclear plant through 2042 to support AWS's AI and cloud operations. The partnership also includes plans to explore new Small Modular Reactors and expand nuclear capacity amid rising U.S. energy demand. Utility Drive reports: Under the PPA, Talen's existing 300-MW co-location arrangement with AWS will shift to a \"front of the meter\" framework that doesn't require Federal Energy Regulatory Commission approval, according to Houston-based Talen. The company expects the transition will occur next spring after transmission upgrades are finished. FERC in November rejected an amended interconnection service agreement that would have facilitated expanded power sales to a co-located AWS data center at the Susquehanna plant. The agency is considering potential rules for co-located loads in PJM.\n \nTalen expects to earn about $18 billion in revenue ove",
        "id": 2909979,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/11/2127254/talen-energy-and-amazon-sign-nuclear-power-deal-to-fuel-data-centers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Talen Energy and Amazon Sign Nuclear Power Deal To Fuel Data Centers",
        "vote": 0
    }
]