[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T16:29:03.164134+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T16:00:41+00:00",
        "description": "Hollow Knight: Silksong is a long time coming, especially since it began as DLC for the first game, and while the vibe and atmosphere that defines the series is intact, there have been numerous changes and new features. \n\nThere are new ways to outfit your character and assail the many enemies and bosses that await; new spells and resources; and above all else, a vocal protagonist. That's only the tip of the needle, so join us as we delve into 15 big differences between Hollow Knight: Silksong and its predecessor.",
        "id": 3486980,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=LUU7WWnRV6s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LUU7WWnRV6s/hqdefault.jpg",
        "title": "Hollow Knight Silksong vs. Hollow Knight - WHAT'S NEW?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T14:27:23.236032+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T14:00:48+00:00",
        "description": "Sequels have a tendency to go bigger and bolder and that’s precisely what Titanic Scion has done. Unfortunately, some of the execution is lackluster. The environmental design is especially middling, with bland mountainous crags populating the large map with little variety. \n\nBut mechs are what the game is all about and it largely gets that right. The number of unique pieces, weapons, and skills are laudable. The coloring and decal customization alone is worthy of considerable praise. The combat is more or less an iteration of the first game’s with an added lock-on for extra precision.",
        "id": 3485694,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=QP7HluFKVBE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QP7HluFKVBE/hqdefault.jpg",
        "title": "Daemon X Machina: Titanic Scion Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T14:27:23.386680+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T14:00:13+00:00",
        "description": "Cronos: The New Dawn is the latest title from The Bloober Team after their successful remake of Silent Hill 2. It's evident that the studio learned a lot of important lessons from the latter, and has made great use of them in this survival horror experience that could have you thinking about it long after you roll the credits on its brilliant story.\n\nIt's so good that you might just start another playthrough right away, and perhaps see how handling specific situations differently could affect the outcomes of events. With a well-designed world, a slow-burn story, and a lot of terrifying threats to take on with limited supplies, Cronos is a tension-filled trip through time that is a very easy sell for both fans of the genre and newcomers alike.",
        "id": 3485695,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=4pvHCV1Z7ls",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4pvHCV1Z7ls/hqdefault.jpg",
        "title": "Cronos: The New Dawn Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T12:16:04.873820+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T09:30:14+00:00",
        "description": "Silent Hill f and Silent Hill 2 Remake present two distinct visions for Konami’s recently revived survival horror series. Last year’s Remake modernised the franchise’s most iconic entry, enhancing visuals, shifting perspectives, and reworking mechanics to cement its legacy with a new generation. \n\nBy contrast, Silent Hill f is a departure, embracing the series’ Japanese roots to tell a standalone story through a distinctly J-horror lens. Guided by writer Ryukishi07’s mantra to “find beauty in terror,” its artistic style weaves the alluring with the grotesque, underpinning melee-driven combat built around new Focus and Sanity systems. \n\nAt its heart is protagonist Hinako Shimizu, whose battles against symbolic, folkloric monsters embody the game’s fusion of  psychological horror and unsettling beauty.",
        "id": 3484170,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=DKnNrhTia48",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DKnNrhTia48/hqdefault.jpg",
        "title": "Silent Hill f vs. Silent Hill 2 Remake - 15 BIGGEST Differences You May Not Know",
        "vote": 0
    }
]