[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T23:09:25.171263+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T22:40:00+00:00",
        "description": "Just days before Apple's expected launch of the satellite-enabled Apple Watch Ultra 3, Garmin unveiled its Fenix 8 Pro -- the company's first smartwatch with built-in inReach satellite and cellular connectivity, SOS features, and a blindingly bright 4,500-nit microLED display. MacRumors reports: With inReach, the Fenix 8 Pro can send location check-ins and text messages over satellite using the Garmin Messenger app. There is also included cellular connectivity, so the smartwatch can make phone calls, send 30-second voice messages, and provide LiveTrack links and weather forecasts when an LTE connection is available.\n \nLiveTrack is a feature that allows the wearer's family and friends to keep track of their location during an activity or adventure. For emergencies, there is an SOS feature that will send a message to the Garmin Response center over a satellite or cellular connection. Garmin Response will then communicate with the user, their emergency contacts, and search and rescue org",
        "id": 3490013,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/03/2038216/garmin-beats-apple-to-market-with-satellite-connected-smartwatch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Garmin Beats Apple to Market with Satellite-Connected Smartwatch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T22:09:02.677638+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from 404 Media, written by Jason Koebler: As I do most nights, I was listening to YouTube videos to fall asleep the other night. Sometime around 3 a.m., I woke up because the video YouTube was autoplaying started going \"FEEEEEEEE.\" The video was called \"Boring History for Sleep | How Medieval PEASANTS Survived the Coldest Nights and more.\" It is two hours long, has 2.3 million views, and, an hour and 15 minutes into the video, the AI-generated voice glitched. \"In the end, Anne Boleyn won a kind of immortality. Not through her survival, but through her indelible impact on history. FEEEEEEEEEEEEEEEE,\" the narrator says in a fake British accent. \"By the early 1770s, the American colonies simmered like a pot left too long over a roaring fire,\" it continued. The video was from a channel I hadn't seen before, called \"Sleepless Historian.\" I took my headphones out, didn't think much of it at the time, rolled over, and fell back asleep.\n \nThe next night, wh",
        "id": 3489576,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/03/2028206/ai-generated-boring-history-videos-are-flooding-youtube-drowning-out-real-history?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Generated 'Boring History' Videos Are Flooding YouTube, Drowning Out Real History",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T22:09:02.857493+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T21:20:00+00:00",
        "description": "Tesco is suing Broadcom and reseller Computacenter for at least $134 million, claiming that VMware's perpetual license support agreements were breached after Broadcom's acquisition. The supermarket giant warned it \"may not be able to put food on the shelves if the situation goes pear-shaped,\" writes The Register's Simon Sharwood. From the report: Court documents seen by The Register assert that in January 2021 Tesco acquired perpetual licenses for VMware's vSphere Foundation and Cloud Foundation products, plus subscriptions to Virtzilla's Tanzu products, and agreed a contract for support services and software upgrades that run until 2026. Tesco claims VMware also agreed to give it an option to extend support services for an additional four years. All of this happened before Broadcom acquired VMware and stopped selling support services for software sold under perpetual licenses. Broadcom does sell support to those who sign for its new software subscriptions.\n \nThe supermarket giant say",
        "id": 3489577,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/03/2018245/supermarket-giant-tesco-sues-vmware-warns-lack-of-support-could-disrupt-food-supply?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Supermarket Giant Tesco Sues VMware, Warns Lack of Support Could Disrupt Food Supply",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T21:08:51.410341+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T20:40:00+00:00",
        "description": "After years of requests, Instagram is finally releasing a dedicated iPad app on September 3rd... \"But it will be slightly different than the mobile app users are accustomed to,\" reports The Verge. From the report: Most significantly, the iPad app will open directly to a feed of Reels, the company's TikTok competitor -- perhaps a sign of the short-form-video times. [...] Other features will be available on iPad: Stories will still line the top of the homepage, and users will be able to switch to a \"Following\" tab where they'll be able to swipe between feeds that more resemble the mobile Instagram experience (including a chronological option). The bigger screen means more space and fewer clicks: comments on Reels will appear next to full-size videos, and the DMs page will have your inbox alongside chats, similar to what Messenger looks like on desktop.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Instagram+Is+Coming",
        "id": 3489243,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/03/207217/instagram-is-coming-to-ipad-15-years-later?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Instagram Is Coming To iPad, 15 Years Later",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T20:08:15.051094+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T20:00:00+00:00",
        "description": "An anonymous reader quotes a report from ZDNet: Over the Labor Day weekend, Cloudflare says it successfully stopped a record-breaking distributed denial-of-service (DDoS) attack that peaked at 11.5 terabits per second (Tbps). This came only a few months after Cloudflare blocked a then all-time high DDoS attack of 7.3 Tbps. This latest attack was almost 60% larger.\n \nAccording to Cloudflare, the assault was the result of a hyper-volumetric User Datagram Protocol (UDP) flood attack that lasted about 35 seconds. During that just more than half-minute attack, it delivered over 5.1 billion packets per second. This attack, Cloudflare reported, came from a combination of several IoT and cloud providers. Although compromised accounts on Google Cloud were a major source, the bulk of the attack originated from other sources.\n \nThe specific target of this attack has not been publicly disclosed, but we can be sure the intent was to overwhelm the victim's network and render online services inopera",
        "id": 3488794,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/03/1958250/cloudflare-stops-new-worlds-largest-ddos-attack-over-labor-day-weekend?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cloudflare Stops New World's Largest DDoS Attack Over Labor Day Weekend",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T19:07:36.682099+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T18:49:00+00:00",
        "description": "U.S. workers are becoming more stressed about their rising personal debts and financial health, a Bank of America survey showed. From a report: Of the respondents polled by BofA, 47% of employed people said they had a sense of financial well-being, dropping from 52% at the start of the year. Nearly 85% of consumers carried some type of personal debt, while 26% of the workforce was seeking help in areas such as emergency savings, paying down debt, and overall financial wellness, compared with 13% in 2023, according to the May survey of more than 1,000 people working full-time.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Workers+Are+Becoming+More+Stressed+About+Finances%2C+BofA+Survey+Shows%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F03%2F1849215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.",
        "id": 3488284,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/03/1849215/us-workers-are-becoming-more-stressed-about-finances-bofa-survey-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Workers Are Becoming More Stressed About Finances, BofA Survey Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T18:07:09.972402+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T17:31:00+00:00",
        "description": "Dolby Vision 2 addresses two widespread TV viewing problems in ways that will likely divide viewers and creators. The format's Content Intelligence feature uses AI and ambient light sensors to brighten notoriously dark content like Game of Thrones' Battle of Winterfell and Apple TV+'s Silo based on room brightness. \n\nAuthentic Motion grants filmmakers scene-by-scene control over motion smoothing, a feature most cinephiles despise for creating artifacts and making films look like 60fps home videos. Many filmmakers have criticized motion smoothing for undermining artistic intent. Dolby positions the feature as eliminating unwanted judder while maintaining cinematic feel. The format launches in standard and Max tiers for high-end displays.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+New+Dolby+Vision+2+HDR+Standard+is+Probably+Going+To+Be+Controversial%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F09",
        "id": 3487792,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/09/03/1731213/the-new-dolby-vision-2-hdr-standard-is-probably-going-to-be-controversial?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The New Dolby Vision 2 HDR Standard is Probably Going To Be Controversial",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:36.643824+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T16:48:00+00:00",
        "description": "The latest status report from the FreeBSD Project says no thanks to code generated by LLM-based assistants. From a report: The FreeBSD Project's Status Report for the second quarter of 2025 contains updates from various sub-teams that are working on improving the FreeBSD OS, including separate sub-projects such as enabling FreeBSD apps to run on Linux, Chinese translation efforts, support for Solaris-style Extended Attributes, and for Apple's legacy HFS+ file system. \n\nThe thing that stood out to us, though, was that the core team is working on what it terms a \"Policy on generative AI created code and documentation.\" The relevant paragraph says: \"Core is investigating setting up a policy for LLM/AI usage (including but not limited to generating code). The result will be added to the Contributors Guide in the doc repository. AI can be useful for translations (which seems faster than doing the work manually), explaining long/obscure documents, tracking down bugs, or helping to understan",
        "id": 3487174,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/03/1649201/freebsd-project-isnt-ready-to-let-ai-commit-code-just-yet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FreeBSD Project Isn't Ready To Let AI Commit Code Just Yet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:36.786691+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T16:06:00+00:00",
        "description": "The SAT is billed as \"a great way to find out how prepared students are for college.\" If that's true, recent changes to its format offer an unflattering assessment of the country's aspiring scholars, Bloomberg's editorial board wrote Wednesday. From the piece: [...] Then the pandemic hit. As in-person exams became impractical, hundreds of schools dropped their testing requirements. The SAT and its main competitor, the ACT, lost millions of dollars in revenue. Although both recently started offering digital options, schools have been slow to reinstate their requirements. Today, more than 80% of schools remain test-optional. \n\n\"If students are deciding to take a test,\" as one College Board executive put it, \"how do we make the SAT the one they want to take?\" To anyone familiar with American teenagers, the company's answer should come as no surprise: Make the test easier. The newly digitized format allows a calculator for the entire math section and drastically cuts reading comprehension",
        "id": 3487175,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/03/166237/dumbing-down-the-sat-bodes-poorly-for-education?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dumbing Down the SAT Bodes Poorly for Education",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:36.946937+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T15:20:00+00:00",
        "description": "For the first time in more than four years, there are fewer open jobs in the U.S. than there are job seekers. CNN: \"This is a turning point for the labor market,\" Heather Long, chief economist at Navy Federal Credit Union, wrote Wednesday. \"It's yet another crack.\" \n\nThe number of job openings fell to an estimated 7.18 million at the end of July, according to Bureau of Labor Statistics data released Wednesday. Job openings not only are at their lowest level in 10 months, but they're also below the number of unemployed workers (at 7.2 million) for the first time since April 2021.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=America+is+in+a+Serious+Jobs+Slump%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F03%2F150244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.s",
        "id": 3487176,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/03/150244/america-is-in-a-serious-jobs-slump?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America is in a Serious Jobs Slump",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:37.172992+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T14:41:00+00:00",
        "description": "Streameast -- the world's largest illegal sports streaming platform -- has been shut down after a year long investigation, according to a leading United States-based anti-piracy organisation. From a report: The network of 80 unauthorised domains generated 1.6billion combined visits over the past year, providing free access to global sports fixtures, including Europe's top football leagues and competitions, such as the Premier League and Champions League, as well as the NFL, NBA and MLB. \n\nThe Athletic has been informed by the Alliance for Creativity and Entertainment (ACE) -- a coalition of 50 media and entertainment organisations including Amazon, Apple TV+, Netflix and Paramount -- that an operation alongside Egyptian law enforcement officials took place on Sunday August 24 to disrupt Streameast's dominant position in the illegal streaming market. \n\nTraffic to the site reached 136million average monthly visits, with domains primarily originating from the U.S., Canada, the United Kin",
        "id": 3487177,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/03/1441242/streameast-worlds-largest-illegal-sports-streaming-platform-shut-down-in-sting?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Streameast, World's Largest Illegal Sports Streaming Platform, Shut Down in Sting",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:37.378511+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T14:00:00+00:00",
        "description": "Critics are denouncing Tuesday's antitrust remedies ruling against Google, calling them inadequate to restore search market competition. DuckDuckGo said the court's decision allows Google to continue using its monopoly to hold back competitors in AI search. \n\nThe Open Markets Institute called it \"pure judicial cowardice\" that leaves Google's power \"almost fully intact.\" Senator Amy Klobuchar said the limited remedies demonstrate why Congress needs to pass legislation stopping dominant platforms from preferencing their own products. The News/Media Alliance criticized Judge Amit Mehta for failing to address Google forcing publishers to provide content for AI offerings to remain in search results.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Critics+Think+the+Search+Remedies+Ruling+is+a+Total+Whiff%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F09%2F03%2F1349225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitt",
        "id": 3487178,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/03/1349225/google-critics-think-the-search-remedies-ruling-is-a-total-whiff?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Critics Think the Search Remedies Ruling is a Total Whiff",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:37.540732+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Amazon.com must face a class action on behalf of hundreds of millions of U.S. consumers over claims that the online retail giant overcharged for products sold by third-party sellers, a federal judge in Seattle has ruled. U.S. District Judge John Chun in an order (PDF) unsealed on Friday certified a nationwide class involving 288 million customers and billions of transactions, marking one of the largest-ever in the United States.\n \nThe class includes buyers in the United States who purchased five or more new goods from third-party sellers on Amazon since May 26, 2017. The consumers' 2021 lawsuit said Amazon violated antitrust law by restricting third-party sellers from offering their products for lower prices elsewhere on rival platforms while they are also for sale on Amazon. Amazon's policies have allowed the company to impose inflated fees on sellers, causing shoppers to pay higher prices for purchases, the lawsuit said. Amazon has d",
        "id": 3487179,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/03/0217244/amazon-must-face-us-nationwide-class-action-over-third-party-sales?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Must Face US Nationwide Class Action Over Third-Party Sales",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:37.743515+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T10:00:00+00:00",
        "description": "alternative_right shares a report from ScienceAlert: The insecticide chlorpyrifos is a powerful tool for controlling various pests, making it one of the most widely used pesticides during the latter half of the 20th century. Like many pesticides, however, chlorpyrifos lacks precision. In addition to harming non-target insects like bees, it has also been linked to health risks for much larger animals -- including us. Now, a new US study suggests those risks may begin before birth. Humans exposed to chlorpyrifos prenatally are more likely to exhibit structural brain abnormalities and reduced motor functions in childhood and adolescence.\n \nProgressively higher prenatal exposure to chlorpyrifos was associated with incrementally greater deviations in brain structure, function, and metabolism in children and teens, the researchers found, along with poorer measures of motor speed and motor programming. [...] This supports previous research linking chlorpyrifos with impaired cognitive functio",
        "id": 3487180,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/03/0210212/common-pesticide-linked-to-widespread-brain-abnormalities-in-children?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Common Pesticide Linked To Widespread Brain Abnormalities In Children",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T23:09:25.811707+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T10:00:00+00:00",
        "description": "A long-term study of over 12,000 adults suggests that artificial sweeteners like aspartame, saccharin, and sugar alcohols may accelerate cognitive decline in middle age, equivalent to about 1.6 years of extra aging. The Guardian reports: Sweeteners' association with cognitive decline is of such concern that consumers should instead use either tagatose, a natural sweetener, or alternatives such as honey or maple syrup, the researchers said. They looked at the impact of seven sweeteners on the health of the study's participants -- 12,772 civil servants in Brazil, with an average age of 52 -- who were followed up for on average eight years. Participants completed questionnaires detailing their food and drink intake over the previous year, and later underwent tests of their cognitive skills such as verbal fluency and word recall.\n \nPeople who consumed the most sweeteners experienced declines in their thinking and memory skills 62% faster than those with the lowest intake, the researchers ",
        "id": 3490014,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/03/230240/sweeteners-can-harm-cognitive-health-equivalent-to-16-years-of-aging-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sweeteners Can Harm Cognitive Health Equivalent To 1.6 Years of Aging, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:37.990159+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T07:00:00+00:00",
        "description": "The world's largest iceberg is now breaking apart rapidly in warmer waters after nearly 40 years adrift. \"Earlier this year, the 'megaberg' known as A23a weighed a little under a trillion tons and was more than twice the size of Greater London,\" reports The Guardian. \"It is now less than half its original size, but still a hefty 1,770 sq km (683 sq miles) and 60km (37 miles) at its widest point...\" Scientists expect it to completely disintegrate within weeks. From the report: A23a calved from the Antarctic shelf in 1986 but quickly grounded in the Weddell Sea, remaining stuck on the ocean floor for over 30 years. It finally escaped in 2020 and, like other giants before it, was carried along \"iceberg alley\" into the South Atlantic Ocean by the powerful Antarctic Circumpolar Current. Around March, it ran aground in shallow waters off distant South Georgia island, raising fears it could disrupt large colonies of adult penguins and seals there from feeding their young. But it dislodged in",
        "id": 3487181,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/03/020240/worlds-biggest-iceberg-breaks-up-after-40-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World's Biggest Iceberg Breaks Up After 40 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T17:06:38.221532+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Wall Street Journal: On a recent evening, a trio of Ukrainian drones flew under the cover of darkness to a Russian position and decided among themselves exactly when to strike. The assault was an example of how Ukraine is using artificial intelligence to allow groups of drones to coordinate with each other to attack Russian positions, an innovative technology that heralds the future of battle. Military experts say the so-called swarm technology represents the next frontier for drone warfare because of its potential to allow tens or even thousands of drones -- or swarms -- to be deployed at once to overwhelm the defenses of a target, be that a city or an individual military asset.\n \nUkraine has conducted swarm attacks on the battlefield for much of the past year, according to a senior Ukrainian officer and the company that makes the software. The previously unreported attacks are the first known routine use of swarm technology in combat, ana",
        "id": 3487182,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/02/2139235/ai-powered-drone-swarms-have-now-entered-the-battlefield?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI-Powered Drone Swarms Have Now Entered the Battlefield",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T02:26:51.133465+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T02:02:00+00:00",
        "description": "A group of more than 85 scientists have issued a joint rebuttal to a recent U.S. Department of Energy report about climate change, finding it full of errors and misrepresenting climate science. NPR: The group of climate scientists found several examples where the DOE authors cherry-picked or misrepresented climate science in the agency's report. For instance, in the DOE report the authors claim that rising carbon dioxide can be a \"net benefit\" to U.S. agriculture, neglecting to mention the negative impacts of more heat and climate-change fueled extreme weather events on crops. \n\nThe DOE report also states that there is no evidence of more intense \"meteorological\" drought in the U.S. or globally, referring to droughts that involve low rainfall. But the dozens of climate scientists point out that this is misleading, because higher temperatures and more evaporation -- not just low rainfall -- can lead to and exacerbate droughts. They say that there are, in fact, many studies showing how ",
        "id": 3481739,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/02/1941215/dozens-of-scientists-find-errors-in-a-new-energy-department-climate-report?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dozens of Scientists Find Errors in a New Energy Department Climate Report",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T02:26:51.250766+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T01:25:00+00:00",
        "description": "Waymo is expanding its U.S. robotaxi footprint by bringing its Jaguar I-Pace SUVs and Zeekr vans to Denver and Seattle. Testing is set to begin this week, with commercial rides expected as early as 2026. TechCrunch reports: The vehicles will be manually driven to start, before the company starts testing its autonomous tech in both cities. Waymo told TechCrunch that it hopes to start offering robotaxi trips in Denver next year and the Seattle metropolitan area \"as soon as we're permitted to do so.\" Denver and Seattle will be two of the most extreme-weather cities that Waymo is feeling out, giving it a chance to test out its tech in snow, wind, and rain that is harder to come by in places like Phoenix. The report notes that Waymo currently operates more than 2,000 robotaxis in the U.S., concentrated in cities like San Francisco, Los Angeles, Phoenix, Austin, and Atlanta. The self-driving car company is expanding to Dallas, Miami, Washington D.C., and New York, while also \"dipping its to",
        "id": 3481740,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/02/2132215/waymo-expands-to-denver-and-seattle?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymo Expands to Denver and Seattle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T01:26:40.136233+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T00:45:00+00:00",
        "description": "Paramount and Activision are teaming up to produce a live-action Call of Duty movie, with Paramount promising the same blockbuster treatment it gave Top Gun: Maverick.\n \nDavid Ellison, Chairman and CEO of Paramount, said in a statement: \"As a lifelong fan of Call of Duty this is truly a dream come true. From the first Allied campaigns in the original Call of Duty, through Modern Warfare and Black Ops, I've spent countless hours playing this franchise that I absolutely love. Being entrusted by Activision and players worldwide to bring this extraordinary storytelling universe to the big screen is both an honor and a responsibility that we don't take lightly. We're approaching this film with the same disciplined, uncompromising commitment to excellence that guided our work on Top Gun: Maverick, ensuring it meets the exceptionally high standards this franchise and its fans deserve. I can promise that we are resolute in our mission to deliver a cinematic experience that honors the legacy o",
        "id": 3481486,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/09/02/2111258/paramount-and-activision-team-for-call-of-duty-movie?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Paramount and Activision Team For 'Call of Duty' Movie",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-03T00:26:24.731944+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-03T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: Ten vulnerabilities in Copeland controllers, which are found in thousands of devices used by the world's largest supermarket chains and cold storage companies, could have allowed miscreants to manipulate temperatures and spoil food and medicine, leading to massive supply-chain disruptions. The flaws, collectively called Frostbyte10, affect Copeland E2 and E3 controllers, used to manage critical building and refrigeration systems, such as compressor groups, condensers, walk-in units, HVAC, and lighting systems. Three received critical-severity ratings. Operational technology security firm Armis found and reported the 10 bugs to Copeland, which has since issued firmware updates that fix the flaws in both the E3 and the E2 controllers. The E2s reached their official end-of-life in October, and affected customers are encouraged to move to the newer E3 platform. Upgrading to Copeland firmware version 2.31F01 mitigates all the security ",
        "id": 3481260,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/02/209250/frostbyte10-bugs-put-thousands-of-refrigerators-at-major-grocery-chains-at-risk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Frostbyte10 Bugs Put Thousands of Refrigerators At Major Grocery Chains At Risk",
        "vote": 0
    }
]