[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T20:31:07.746811+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T19:30:08+00:00",
        "description": "The PS5 Pro is certainly a solid mid-gen upgrade to Sony's latest powerhouse of a console. It removes the need to choose between amazing graphics and rock-solid performance for the most part, with many titles giving players the option to blend the two into a very enjoyable experience.\n\nBut there are a few titles that make the most out of this console's strengths, elevating the graphics to levels that we'd never have thought possible on a console before the Pro made it to our hands. \n\nWe dive into a few of those titles, and showcase what makes them so good on the PS5 Pro. From shooters to action adventures, there's something to like for you no matter the kind of games you prefer.",
        "id": 3896571,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=eAoIeNhSgsY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eAoIeNhSgsY/hqdefault.jpg",
        "title": "15 Games That Graphically Pushed The PS5 PRO To Its LIMITS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T03:09:36.307658+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T02:30:05+00:00",
        "description": "Plants Vs. Zombies Replanted brings the original game back into the spotlight on current-gen platforms. But does it manage to recapture the charm and quirky elements that put the title on the map in the first place? We dive into the game and explore how its latest avatar manages to sustain the challenge and entertainment from the original title.\n\nReplanted is certainly a solid effort, and does very well to avoid reinventing the wheel while managing to carry over the original game's controls to a new format. This one's a lot of fun, and a great option for some casual gaming after a long day. You're sure to like it if you were a fan of the original release and even if you're an absolute newbie to its tower defense gameplay loop.",
        "id": 3889933,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=6RFlbg2f7Yg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6RFlbg2f7Yg/hqdefault.jpg",
        "title": "Plants vs. Zombies Replanted Review - Is It A Worthy Remaster?",
        "vote": 0
    }
]