[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T23:38:28.309623+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T23:00:00+00:00",
        "description": "Halo Studios (formerly 343 Industries) has announced Halo: Campaign Evolved, a full Unreal Engine 5 remake of the original Halo: Combat Evolved campaign, coming in 2026 for Xbox Series X, Windows PC, and -- shockingly -- PlayStation 5. \"It's really a new era -- Halo is on PlayStation going forward,\" Halo Studios community director Brian Jarrard said on a livestream today. Polygon reports: Halo: Campaign Evolved is a from-the-ground-up remake of the first Halo game's campaign. It's being built in Unreal Engine 5 -- unlike previous Halo games, which have been developed with proprietary software. It aims to modernize the game without changing it on a fundamental level. [...]\n \nAs signaled by the name, Campaign Evolved will not feature PvP multiplayer, as its focus is on the campaign (Combat Evolved had splitscreen competitive multiplayer modes). However, you'll still be able to play Halo: Campaign Evolved with your buddies. It'll support splitscreen two-player local co-op as well as four",
        "id": 3897772,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/24/2219204/halo-heads-to-playstation-5-with-another-halo-combat-evolved-remake",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Halo Heads To PlayStation 5 With Another Halo: Combat Evolved Remake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T22:28:59.626028+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T22:23:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The outage that hit Amazon Web Services and took out vital services worldwide was the result of a single failure that cascaded from system to system within Amazon's sprawling network, according to a post-mortem from company engineers. [...] Amazon said the root cause of the outage was a software bug in software running the DynamoDB DNS management system. The system monitors the stability of load balancers by, among other things, periodically creating new DNS configurations for endpoints within the AWS network. A race condition is an error that makes a process dependent on the timing or sequence events that are variable and outside the developers' control. The result can be unexpected behavior and potentially harmful failures. \nIn this case, the race condition resided in the DNS Enactor, a DynamoDB component that constantly updates domain lookup tables in individual AWS endpoints to optimize load balancing as conditions change. As ",
        "id": 3897449,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/24/2212255/a-single-point-of-failure-triggered-the-amazon-outage-affecting-million",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Single Point of Failure Triggered the Amazon Outage Affecting Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T22:28:59.753051+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T21:22:00+00:00",
        "description": "A study involving 641 participants across 10 European countries found pesticides in every silicone wristband worn for one week. Researchers at Radboud University tested for 193 pesticides and detected 173 substances. The average participant was exposed to 20 different pesticides through non-dietary sources. Non-organic farmers had the highest exposure at a median of 36 pesticides. Organic farmers and people living near farms recorded lower numbers. \n\nConsumers living far from agricultural areas had a median of 17 pesticides. The wristbands captured banned substances including breakdown products of DDT, which was prohibited decades ago, and insecticides dieldrin and propoxur. Paul Scheepers, the molecular epidemiologist who co-authored the study, said people cannot avoid exposure to pesticides in their direct environment.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Study+Reveals+How+Hard+It+Is+To+Avoid+Pesticide+E",
        "id": 3897450,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/24/191222/study-reveals-how-hard-it-is-to-avoid-pesticide-exposure",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Study Reveals How Hard It Is To Avoid Pesticide Exposure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T21:16:02.984245+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T20:41:00+00:00",
        "description": "The U.S. will expand the use of facial recognition technology to track non-citizens entering and leaving the country in order to combat visa overstays and passport fraud, according to a government document published on Friday. Reuters: A new regulation will allow U.S. border authorities to require non-citizens to be photographed at airports, seaports, land crossings and any other point of departure, expanding on an earlier pilot program. \n\nUnder the regulation, set to take effect on December 26, U.S. authorities could require the submission of other biometrics, such as fingerprints or DNA, it said. It also allows border authorities to use facial recognition for children under age 14 and elderly people over age 79, groups that are currently exempted. The tighter border rules reflect a broader effort by U.S. President Donald Trump to crack down on illegal immigration. While the Republican president has surged resources to secure the U.S.-Mexico border, he has also taken steps to reduce ",
        "id": 3896997,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/24/1835203/us-expands-facial-recognition-at-borders-to-track-non-citizens",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Expands Facial Recognition at Borders To Track Non-Citizens",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T21:16:03.167158+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T20:01:00+00:00",
        "description": "Amazon Web Services basically invented the cloud computing business and once held nearly half the market. That dominance is slipping. AWS captured 38% of corporate spending on cloud infrastructure services last year, down from almost 50% in 2018, according to Gartner. Microsoft now grows its backlog of corporate sales faster than Amazon. The company that brushed aside incumbents and transformed an internal startup into Amazon's profit engine now faces internal bureaucracy that has slowed it down. \n\nBloomberg interviewed 23 current and former AWS employees who described management layers that proliferated after a pandemic hiring binge. One sales engineer who was six managers from Jeff Bezos before the pandemic found himself fifteen rungs from CEO Andy Jassy earlier this year. AWS hesitated to invest in Anthropic when the AI startup was spending most of its cash on Amazon servers. \n\nExecutives doubted the Anthropic AI could be monetized and were culturally reluctant to pay for external ",
        "id": 3896998,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/24/1830258/amazons-aws-shows-signs-of-weakness-as-competitors-charge-ahead",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's AWS Shows Signs of Weakness as Competitors Charge Ahead",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T19:57:37.060650+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T19:22:00+00:00",
        "description": "Hackers have been spreading malware through more than 3,000 YouTube videos advertising cracked software and game hacks, cybersecurity firm Check Point warned this week. The campaign, active since at least 2021, tripled its video production in 2025. The videos promoted free versions of Adobe Photoshop, FL Studio, Microsoft Office, and game cheats for titles like Roblox. Fake comments created the appearance of legitimacy, the researchers found. \n\nUsers who downloaded archives from Dropbox, Google Drive, or MediaFire were instructed to disable Windows Defender before opening files. The downloads contained malware including Lumma and Rhadamanthys, which steal passwords and cryptocurrency wallet information. The hackers hijacked existing accounts and created new ones. One compromised channel with 129,000 subscribers posted a cracked Photoshop video that reached 291,000 views. Another video for FL Studio received over 147,000 views.<p><div class=\"share_submission\" style=\"position:relative;\"",
        "id": 3896459,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/24/1814214/hackers-used-thousands-of-youtube-videos-to-spread-malware",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hackers Used Thousands of YouTube Videos To Spread Malware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T19:57:37.266697+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T18:40:00+00:00",
        "description": "An anonymous reader shares a report: The first announcement that Lip-Bu Tan made a day after becoming the permanent chief executive of Intel was about massive layoffs to right-size the company in accordance with market realities. Now, the extent of those layoffs is becoming clearer, indicating Intel let go of as many as 20,500 employees in about three months. If we add 15,000 positions eliminated by the previous management, that means Intel reduced its headcount by 35,500 people in less than two years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel+Has+Cut+35%2C500+Jobs+in+Less+Than+Two+Years%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F24%2F185247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F24%2F185247%2Fintel-has-cut-35500-jobs-i",
        "id": 3896460,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/24/185247/intel-has-cut-35500-jobs-in-less-than-two-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel Has Cut 35,500 Jobs in Less Than Two Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T18:45:35.673207+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T18:00:00+00:00",
        "description": "Larry Sanger, who helped launch Wikipedia in 2001 before being ousted by co-founder Jimmy Wales a year later, has spent years arguing the online encyclopedia has abandoned its commitment to neutrality. Leading conservatives in the second Trump administration are now amplifying his critique. Elon Musk announced plans to launch an AI-powered alternative called Grokipedia this week, calling Wikipedia \"hopelessly biased.\" Senator Ted Cruz sent a letter to the Wikimedia Foundation demanding answers about what he termed \"ideological bias.\" House Republicans opened an investigation into possible platform manipulation. \n\nSanger published \"Nine Theses\" on reforming Wikipedia and appeared on Tucker Carlson's show. His arguments circulated widely among conservatives, including Trump's AI czar David Sacks. Sanger recently converted to Christianity and voted for Trump in 2024. He is working to recruit hundreds of conservatives to become active Wikipedia editors. Wikipedia co-founder Jimmy Wales ma",
        "id": 3895884,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/24/1753249/wikipedia-drama-goes-mainstream",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wikipedia Drama Goes Mainstream",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T18:45:35.841512+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T17:30:00+00:00",
        "description": "A web browser linked to Chinese online gambling websites and downloaded millions of times routes all internet traffic through servers in China and covertly installs programs that run in the background, according to findings published by network security company Infoblox. The researchers said the Universe Browser, which advertises itself as offering privacy protection, includes features similar to malware such as key logging and surreptitious connections. \n\nInfoblox collaborated with the United Nations Office on Drugs and Crime on the research. The investigators found links between the browser and Southeast Asia's cybercrime ecosystem, which has connections to money laundering, illegal online gambling, human trafficking and scam operations using forced labor. The browser is directly linked to BBIN, a major online gambling company that has existed since 1999. Infoblox researchers examined the Windows version of the browser and found that it checks users' locations and languages when lau",
        "id": 3895885,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/24/1727228/browser-promising-privacy-protection-contains-malware-like-features-routes-traffic-through-china",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Browser Promising Privacy Protection Contains Malware-Like Features, Routes Traffic Through China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T17:21:38.490949+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T16:52:00+00:00",
        "description": "Microsoft has reorganized its Outlook team under new leadership as part of a broader effort to integrate AI into its core products. Gaurav Sareen, a corporate vice president at the company, recently assumed direct leadership of the Outlook division after Lynn Ayres, who previously ran the team, began a sabbatical. The move represents the latest in a series of AI-focused restructurings across Microsoft's divisions. Sareen wrote in an internal memo that the company now has an opportunity to reimagine Outlook from the ground up rather than add AI features to existing systems, according to The Verge. \n\nRyan Roslansky, the chief executive of LinkedIn, took on an expanded role earlier this year as head of Office. Sareen now reports to Roslansky, who oversees the Office suite, Outlook and Microsoft 365 Copilot teams. The restructuring comes after Microsoft spent several years developing One Outlook, a web-based version meant to replace separate Windows, Mac, and web applications.<p><div clas",
        "id": 3894751,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/24/1652239/microsoft-outlook-is-getting-an-ai-overhaul-under-new-leaders",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Outlook is Getting an AI Overhaul Under New Leaders",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T16:21:04.767815+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T16:04:00+00:00",
        "description": "Automattic has filed counterclaims against WP Engine in a lawsuit the hosting company initiated in October 2024. The counterclaims accuse WP Engine of trademark infringement and deceptive marketing practices. After private equity firm Silver Lake invested $250 million in WP Engine, the hosting company began calling itself \"The WordPress Technology Company\" and allowed partners to refer to it as \"WordPress Engine,\" the lawsuit says. WP Engine also launched products named \"Core WordPress\" and \"Headless WordPress.\" \n\nThe counterclaims allege that WP Engine promised to commit 5% of its resources to the WordPress ecosystem but failed to keep those promises. Automattic contends that WP Engine engaged in trademark violations to avoid licensing fees that would have affected the company's earnings and valuation. Silver Lake sought to sell WP Engine at a $2 billion valuation but could not find a buyer. The filing notes that potential buyers included Automattic. The counterclaims also assert tha",
        "id": 3894195,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/24/1552249/wordpress-maker-files-counterclaims-against-wp-engine-over-trademark-use",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "WordPress Maker Files Counterclaims Against WP Engine Over Trademark Use",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T16:21:04.905335+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T15:27:00+00:00",
        "description": "Intel's tick-tock development cadence will not return. CEO Lip-Bu Tan said during the company's Q3 2025 earnings call that the 18A process node will be a \"long-lived node\" powering at least three generations of client and server products. Intel reported its first profit in nearly two years, aided by financial support from Nvidia, Softbank, and the US government. \n\nThe company faces chip shortages that will peak in the first quarter of next year. CFO David Zinsner said Intel is prioritizing AI server chips over consumer processors. Intel will launch only one Panther Lake SKU this year and roll out others in 2026. Zinsner called Panther Lake \"pretty expensive\" and said Intel will push Lunar Lake chips \"in at least the first half of the year.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel's+Tick-Tock+Isn't+Coming+Back%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F24%2F1527235%2F%3Futm_source%3Dtwitter%26utm_",
        "id": 3894196,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/24/1527235/intels-tick-tock-isnt-coming-back",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel's Tick-Tock Isn't Coming Back",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T16:21:05.086971+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T14:40:00+00:00",
        "description": "The Delhi regional government is trialling a cloud-seeding experiment to induce artificial rain, in an effort to clean the air in the world's most polluted city. From a report: The Bharatiya Janata party (BJP) has been proposing the use of cloud seeding as a way to bring Delhi's air pollution under control since it was elected to lead the regional government this year. \n\nCloud seeding involves using aircraft or drones to add to clouds particles of silver iodide, which have a structure similar to ice. Water droplets cluster around the particles, modifying the structure of the clouds and increasing the chance of precipitation. Months of unpredictable weather over India's capital had put the BJP's cloud-seeding plans on pause. But days after Delhi's air quality once again fell into the hazardous range after Diwali festival, and a thick brown haze settled over the city, the government said the scheme would finally be rolled out.<p><div class=\"share_submission\" style=\"position:relative;\">\n",
        "id": 3894197,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/24/1415248/india-trials-delhi-cloud-seeding-to-clean-air-in-worlds-most-polluted-city",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India Trials Delhi Cloud Seeding To Clean Air in World's Most Polluted City",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T16:21:05.232342+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T14:00:00+00:00",
        "description": "Counter-Strike has long been known for two things: tight tactical FPS gameplay and a thriving player marketplace effectively valued at literal billions of dollars. Now, thanks to a recent update from Valve, the latter is in a downward spiral, having lost 25% of its value -- or $1.75 billion -- overnight. Polygon: First, some context. Counter-Strike is a free-to-play multiplayer shooter. As with most other F2P games, it generates revenue from selling cosmetics. They arrive in lootbox-like Cases, which are opened by Keys purchased with real-world currency. They can also be obtained through trading with other players and purchasing from Steam Community Market. Beyond Steam, unofficial third-party marketplaces for CS cosmetics have also popped up as channels for buying and selling items. \n\nBecause items are obtained at random through opening Cases, rarer items fetch the highest value on the open marketplaces. Items of lower-rarity tiers can also be traded in at volume for an item of a hig",
        "id": 3894198,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/24/1352255/counter-strikes-player-economy-is-in-a-multi-billion-dollar-freefall",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Counter-Strike's Player Economy Is In a Multi-Billion Dollar Freefall",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T16:21:05.412664+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T13:00:00+00:00",
        "description": "The Fedora Council has approved a new policy allowing AI-assisted code contributions, provided contributors fully disclose and take responsibility for any AI-generated work. Phoronix reports: AI-assisted code contributions can be used but the contributor must take responsibility for that contribution, it must be transparent in disclosing the use of AI such as with the \"Assisted-by\" tag, and that AI can help in assisting human reviewers/evaluation but must not be the sole or final arbiter. This AI policy also doesn't cover large-scale initiatives which will need to be handled individually with the Fedora Council. [...] The Fedora Council does expect that this policy will need to be updated over time for staying current with AI technologies.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Fedora+Approves+AI-Assisted+Contributions%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F10%2F23%2F2138252%2F%3Futm_source%",
        "id": 3894199,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/23/2138252/fedora-approves-ai-assisted-contributions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fedora Approves AI-Assisted Contributions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T10:55:59.626657+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T10:00:00+00:00",
        "description": "Airbus, Leonardo, and Thales are merging their space divisions into a new France-based company that aims to create a \"leading European player in space.\" The joint venture, expected to launch operations by 2027 pending regulatory approval, will pool R&amp;D resources to accelerate satellite development and strengthen Europe's technological sovereignty in space. Engadget reports: The companies Airbus, Leonardo and Thales have finalized this deal. The new unnamed entity will be based in France and will employ around 25,000 people. Airbus will own 35 percent, while the other two companies will each own 32.5 percent. Executives are hoping this company will better serve Europe's need for \"sovereignty\" in space and help it create a rival to SpaceX's Starlink communications network. Increasing a presence in space is also seen as a good thing for security and defense.\n \nThis isn't just bluster. Thales and Airbus have long been rivals in the satellite market, but it looks like they are friends ",
        "id": 3891906,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/23/228232/europes-big-three-aerospace-manufacturers-combine-their-space-divisions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Europe's Big Three Aerospace Manufacturers Combine Their Space Divisions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T07:11:51.250489+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T07:00:00+00:00",
        "description": "An Icelandic programmer successfully ran Doom on the European Space Agency's OPS-SAT satellite, proving that the iconic 1993 shooter can now run not just everywhere on Earth -- but in orbit. ZDNet reports: Olafur Waage, a senior software developer from Iceland who now works in Norway, explained at Ubuntu Summit 25.10 how he, a self-described \"professional keyboard typist\" and maker of funny videos, ended up making what is perhaps the game's most outlandish port yet: Doom running on a real satellite in orbit, the European Space Agency (ESA) OPS-SAT satellite. OPS-SAT, a \"flying laboratory\" for testing novel onboard computing techniques, was equipped with an experimental computer approximately 10 times more powerful than the norm for spacecraft. Waag explained, \"OPS-SAT was the first of its kind, devoted to demonstrating drastically improved mission control capabilities when satellites can fly more powerful onboard computers. The point was to break the curse of being too risk-averse wit",
        "id": 3890764,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/23/2128244/programmer-gets-doom-running-on-a-space-satellite",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Programmer Gets Doom Running On a Space Satellite",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T04:44:48.992447+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Dinosaurs would not have become extinct had it not been for a catastrophic asteroid strike, researchers have said, challenging the idea the animals were already in decline. About 66 million years ago, during the late Cretaceous period, a huge space rock crashed into Earth, triggering a mass extinction that wiped out all dinosaurs except birds. However, some experts have argued the dinosaurs were already in decline. Now researchers say the dating of a rock formation in New Mexico throws doubt on that idea, suggesting dinosaurs were thriving until the fateful impact.\n \nDr Andrew Flynn, the first author of the research at New Mexico State University, said: \"I think based on our new study that shows that, at least in North America, they weren't going towards extinction.\" Writing in the journal Science, Flynn and colleagues report how they dated a unit of rock called the Naashoibito Member in the San Juan basin using two methods. Flynn",
        "id": 3890214,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/23/2116228/dinosaurs-were-thriving-until-asteroid-struck-research-suggests",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dinosaurs Were Thriving Until Asteroid Struck, Research Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T02:17:26.084704+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T01:25:00+00:00",
        "description": "alternative_right shares a report from Axios: The latest must-have accessory is a \"stop-scrolling bag\" -- a tote packed with analog activities like watercolors and crossword puzzles. We spend hours glued to our screens. \"Analog bags,\" as they're also called, are one way millennials and Gen Zers are reclaiming that time. \"I basically just put everything I could grab for instead of my phone into a bag,\" including knitting, a scrapbook and a Polaroid camera, says Sierra Campbell, the content creator behind the trend.\n \nThe 31-year-old keeps one bag at home in Northern California, carrying it from room to room, and another in her car. The trend has quickly spread on social media, part of a bigger shift to unplug. Roughly 1,600 TikTok posts were tagged #AnalogLife during the first nine months of 2025 -- up over 330% from the same period last year, according to TikTok data shared with Axios. \"It speaks to an incredible desperation and desire for experiences that return our attention to us, ",
        "id": 3889678,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/23/212230/analog-bags-are-in-doomscrolling-is-out",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Analog Bags' Are In. Doomscrolling Is Out.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T01:03:30.728944+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T00:45:00+00:00",
        "description": "OpenAI has acquired Software Applications Incorporated, the 12-person startup behind Sky -- an AI interface for Mac computers that can understand on-screen context and perform tasks across apps. The deal follows OpenAI's recent acquisitions of Statsig and Jony Ive's io. CNBC reports: The startup's product called Sky allows users of Mac computers to prompt it with natural language to get help with writing, coding, planning and managing their days, OpenAI said in a blog post. Sky can take actions through apps and understands what's on a user's screen.\n \n\"Sky's deep integration with the Mac accelerates our vision of bringing AI directly into the tools people use every day,\" Nick Turley, the head of ChatGPT at OpenAI, said in a statement. Software Applications was founded in 2023, and the company unveiled Sky in May. OpenAI CEO Sam Altman contributed to the startup's $6.5 million seed funding round, according to its website.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a c",
        "id": 3889444,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/23/218215/openai-buys-ai-startup-that-built-interface-for-apple-computers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Buys AI Startup That Built Interface For Apple Computers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-24T01:03:30.875451+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-24T00:02:00+00:00",
        "description": "Google and Anthropic have finalized a cloud partnership worth tens of billions of dollars, granting Anthropic access to up to one million of Google's Tensor Processing Units and more than a gigawatt of compute power by 2026. CNBC reports: Industry estimates peg the cost of a 1-gigawatt data center at around $50 billion, with roughly $35 billion of that typically allocated to chips. While competitors tout even loftier projections -- OpenAI's 33-gigawatt \"Stargate\" chief among them -- Anthropic's move is a quiet power play rooted in execution, not spectacle. Founded by former OpenAI researchers, the company has deliberately adopted a slower, steadier ethos, one that is efficient, diversified, and laser-focused on the enterprise market.\n \nA key to Anthropic's infrastructure strategy is its multi-cloud architecture. The company's Claude family of language models runs across Google's TPUs, Amazon's custom Trainium chips, and Nvidia's GPUs, with each platform assigned to specialized workloa",
        "id": 3889445,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/23/2054219/anthropics-google-cloud-deal-includes-1-million-tpus-1-gw-of-capacity-in-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic's Google Cloud Deal Includes 1 Million TPUs, 1 GW of Capacity In 2026",
        "vote": 0
    }
]