[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-25T20:54:49+00:00",
        "description": "<p>Last Updated on February 26, 2025 Thanks to Petrik Leo, the artistic cat is out of the bag and we have a cover for Essa Hansen&#8216;s battle royale novella, Casthen Gain. A prequel set in The Graven universe (Nophek Gloss, Azura Ghost, Nophek Gloss; Orbit), Casthen Gain is a non-stop action ride told in Essa&#8217;s amazing cinematic voice. About Casthen Gain Fifteen prisoners. One prize. Only one survivor allowed. Sentace Ketch, a skilled culinarian, makes a wrong turn in life and finds himself dropped on the strangest and most dangerous planet in the multiverse. He’s here alongside murderers, exiles, and adrenaline-seekers to participate in a battle royale race, forced to hunt for an eons-buried mystery or die trying. The prize? Being allowed to live…and join the cruel organization that put them all here, which might just mean the creative freedom Sentace has craved all his life. Cover reveal for Casthen Gain by Essa Hansen I had a lot of fun working on the artwork direction fo",
        "id": 2194248,
        "language": "en-AU",
        "link": "https://www.grimdarkmagazine.com/exclusive-cover-reveal-for-casthen-gain-by-essa-hansen",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 137,
        "source_url": "https://www.grimdarkmagazine.com/feed",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EXCLUSIVE: Cover reveal for Casthen Gain by Essa Hansen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-25T04:25:42+00:00",
        "description": "<p>Macbeth itself has a lot to appeal to fans of grimdark. The moral greyness is front and centre, in fact, the play is famous for it. The events in Macbeth are set in motion by elements that we would now call speculative fiction: three witches who prophesize Macbeth’s rise to King of Scotland. There’s scheming, conniving, murder and more as the play explores dark themes of destiny, greed and guilt. In addition, Macbeth is one of the more ubiquitous of Shakespeare’s plays (if such a thing is possible) and is studied in anglophone schools the world over. It’s shorter than some and contains a multitude of phrases and words that have since become common parlance. All of which makes Macbeth not only a great introduction to Shakespeare but an important entry in the history of the written word. “It will have blood, they say: blood will have blood.” So, why watch this particular version of Macbeth? As IMDB will corroborate, there are a lot of Macbeth adaptations to choose from, and of cours",
        "id": 2189989,
        "language": "en-AU",
        "link": "https://www.grimdarkmagazine.com/review-macbeth-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 137,
        "source_url": "https://www.grimdarkmagazine.com/feed",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "REVIEW: Macbeth (2025)",
        "vote": 0
    }
]