[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T16:12:12.617553+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T16:01:31+00:00",
        "description": "While it can be easy to write off Where Winds Meet's use of cool mechanics from other action titles, it's in how Everstone has weaved in those touches to an experience that feels distinctly unique that showcases why this one is fascinating to us. \n\nIt's a game that deftly ties in its premise, narrative, gameplay mechanics, and general presentation into an experience that calls to the exploration addiction within its players, and encourages them to make  journeys to more of its locations.\n\nIt's a cohesion that's earned, not given, and the game is all the more better for it. Join us as we take a look at how this game weaves together a world like no other on the way to its lofty ambitions.",
        "id": 3964995,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=x8rf_cpl5uM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/x8rf_cpl5uM/hqdefault.jpg",
        "title": "You Are ABSOLUTELY NOT READY for Where Winds Meet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T14:10:28.333186+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T13:30:54+00:00",
        "description": "There are some games that just plunge you into an adventure with a trusty steed or vehicle by your side and a vast world to explore. These experiences often leave a mark, be it through stunning worlds teeming with life, or poignant journeys that inform character arcs and narratives alike. These are worlds that are meant for you to take the road less followed, and have a blast while doing so. \n\nWe put together a list of our favorite titles where seeing where the road took us was definitely a part of the fun. Beware, some of these stories can get mighty interesting, and have you spending many an hour uncovering their secrets and mysteries. And of course, the journey to every destination is a crucial part of the experience.",
        "id": 3964202,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=nAuye0n7Kr8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nAuye0n7Kr8/hqdefault.jpg",
        "title": "15 Amazing Single Player Games That Give You That \"ON THE ROAD\" Feeling",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T10:31:08.507743+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T09:45:03+00:00",
        "description": "If you're a fan of the original Tales of Xillia, the chance to play that adventure any way you'd like from the get go is excellent. If you're a newcomer playing this classic to relive the original adventure, that's an option too. \n\nThis flexibility makes Tales of Xillia Remastered easy to recommend, its story being entertaining enough and bringing a solid balance between its light-hearted optimism and its darker, more complex themes. It was good to see King Gladius again, all things considered. I came to it for nostalgia, but stayed because this remaster gave me quite a few welcome reasons to.",
        "id": 3963046,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=P9JQHcrPZFc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/P9JQHcrPZFc/hqdefault.jpg",
        "title": "Tales of Xillia Remastered Review - The Final Verdict",
        "vote": 0
    }
]