[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T00:01:32.129937+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T23:40:00+00:00",
        "description": "\"AI isn't just a tool anymore; it's an integral part of the development experience,\" argues GitHub's blog. So \"Agents shouldn't be bolted on. They should work the way you already work...\" \n\n\nSo this week GitHub announced \"Agent HQ,\" which CNBC describes as a \"mission control\" interface \"that will allow software developers to manage coding agents from multiple vendors on a single platform.\"\n\n\nDevelopers have a range of new capabilities at their fingertips because of these agents, but it can require a lot of effort to keep track of them all individually, said GitHub COO Kyle Daigle. Developers will now be able to manage agents from GitHub, OpenAI, Google, Anthropic, xAI and Cognition in one place with Agent HQ. \"We want to bring a little bit of order to the chaos of innovation,\" Daigle told CNBC in an interview. \"With so many different agents, there's so many different ways of kicking off these asynchronous tasks, and so our big opportunity here is to bring this all together.\" Agent HQ ",
        "id": 3967371,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/02/2337254/github-announces-agent-hq-letting-copilot-subscribers-run-and-manage-coding-agents-from-multiple-vendors",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GitHub Announces 'Agent HQ', Letting Copilot Subscribers Run and Manage Coding Agents from Multiple Vendors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T20:59:19.952502+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T20:34:00+00:00",
        "description": "OpenAI \"hasn't yet turned a profit,\" notes Wall Street Journal business columnist Tim Higgins. \"Its annual revenue is 2% of Amazon.com's sales. \n\n\n\"Its future is uncertain beyond the hope of ushering in a godlike artificial intelligence that might help cure cancer and transform work and life as we know it. Still, it is brimming with hope and excitement. \n\n\n\"But what if OpenAI fails?\"\n\nThere's real concern that through many complicated and murky tech deals aimed at bolstering OpenAI's finances, the startup has become too big to fail. Or, put another way, if the hype and hope around Chief Executive Sam Altman's vision of the AI future fails to materialize, it could create systemic risk to the part of the U.S. economy likely keeping us out of recession. \nThat's rarefied air, especially for a startup. Few worried about what would happen if Pets.com failed in the dot-com boom. We saw in 2008-09 with the bank rescues and the Chrysler and General Motors bailouts what happens in the U.S. when",
        "id": 3966583,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/02/1945203/is-openai-becoming-too-big-to-fail",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is OpenAI Becoming 'Too Big to Fail'?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T19:58:28.849420+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T19:34:00+00:00",
        "description": "Slashdot reader BrianFagioli summarizes some news from Nerds.xyz: Creative Technology has launched Sound Blaster Re:Imagine, a modular, Linux-powered audio hub that reimagines the classic PC sound card for the modern age. The device acts as both a high-end digital-to-analog converter (DAC) and a customizable control deck that connects PCs, consoles, phones, and tablets in one setup. \n\n Users can instantly switch inputs and outputs, while developers get full hardware access through an SDK for creating their own apps. It even supports AI-driven features like an on-device DJ, a revived \"Dr. Sbaitso\" speech synthesizer, and a built-in DOS emulator for retro gaming. \n\n\nThe Kickstarter campaign has already raised more than $150,000, far surpassing its initial goal of $15,000 with over 50 days remaining. Each unit ships with a modular \"Horizon\" base and swappable knobs, sliders, and buttons, while a larger \"Vertex\" version will unlock at a higher funding milestone. \n\nRunning an unspecified L",
        "id": 3966294,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/02/1758252/sound-blaster-crowdfunds-linux-powered-audio-hub-reimagine-for-creators-and-gamers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sound Blaster Crowdfunds Linux-Powered Audio Hub 'Re:Imagine' For Creators and Gamers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T18:57:42.677387+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T18:34:00+00:00",
        "description": "San Francisco's local newscast ABC7 runs a consumer advocacy segment called \"7 on Your Side\". They received a disturbing call for help from Dave Dornlas, treasurer of a nonprofit supporting a local library:\n\n\n GoFundMe has taken upon itself to create \"nonprofit pages\" for 1.4 million 501C-3 organizations using public IRS data along with information from trusted partners like the PayPal Giving Fund. \"The fact that they would just on their own build pages for nonprofits that they've never spoken to is a problem,\" [Dornlas] said. \"I'm a believer in opt-in, not opt-out....\" Dornlas says he struggled to find anyone to contact from GoFundMe about this...\n\nDave's other frustration is tied to the company's optional tipping feature on the platform. \"GoFundMe also solicits a tip of 14.5%. In other words, 'We're doing this and we're great people. Give us 14.5% to do this' &mdash; which doesn't have to happen,\" Dornlas said. \"That's what bothers me.\" When 7 On Your Side checked, the optional tip ",
        "id": 3966012,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/02/1728231/gofundme-created-14-million-donation-pages-for-nonprofits-without-their-consent",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GoFundMe Created 1.4 Million Donation Pages for Nonprofits Without Their Consent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T17:56:54.006106+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T17:34:00+00:00",
        "description": "\"Amazon has deployed Rivian's electric delivery vans in Canada for the first time,\" reports CleanTechnica, with 50 now deployed in the Vancouver area. \n\nAmazon's director of Global Fleet and Products says there's now over 35,000 electric vans deployed globally &mdash; and that they've delivered more than 1.5 billion packages. \n\nMore from the blog Teslarati:\n\n\nIn December 2024, the companies announced they had successfully deployed 20,000 EDVs across the U.S. In the first half of this year, 10,000 additional vans were delivered, and Amazon's fleet had grown to 30,000 EDVs by mid-2025. Amazon's fleet of EDVs continues to grow rapidly and has expanded to over 100 cities in the United States... The EDV is a model that is exclusive to Amazon, but Rivian sells the RCV, or Rivian Commercial Van, openly. It detailed some of the pricing and trim options back in January when it confirmed it had secured orders from various companies, including AT&amp;T.\n<p><div class=\"share_submission\" style=\"po",
        "id": 3965710,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/02/0134230/amazons-deployment-of-rivians-electric-delivery-vans-expand-to-canada",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's Deployment of Rivian's Electric Delivery Vans Expand to Canada",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T16:56:12.005255+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T16:34:00+00:00",
        "description": "\"People are creating 'dumb homes,'\" the VP of research at the Global Wellness Institute, tells the web site Axios. \n\nSome are swapping NASA-style setups for old-fashioned buttons, switches and knobs. Others are designing digital detox corners &mdash; all part of a bigger \"analog wellness\" movement... \n\nThe return to analog hobbies and spacesis about more than nostalgia for pre-internet times, researchers say. A home where \"technology is always in the background, working and listening, feels anxiety-producing\" instead of restorative, architect Yan M. Wang tells Axios... Design media brand Dwell named the decline of smart homes a top trend for 2025 and beyond. \n\nWealthy Los Angeles house hunters have started shunning WiFi-enabled, voice-activated appliances \"to escape the $100 billion home-automation industry,\" according to the Hollywood Reporter.\nMeanwhile, landlines have found new fans &mdash; many of them parents who want to keep their kids off screens, the Washington Post reports.\n<",
        "id": 3965338,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/11/02/067245/new-design-trend-people-downgrading-smart-homes-to-analog-dumb-homes-some-with-landlines-and-offline-appliances",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Design Trend: People Downgrading 'Smart' Homes to Analog 'Dumb' Homes, Some with Landlines and Offline Appliances",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T15:55:23.923131+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T15:34:00+00:00",
        "description": "\"It's been hard for me to understand why Atlas exists,\" writes MIT Technology Review. \" Who is this browser for, exactly? Who is its customer? And the answer I have come to there is that Atlas is for OpenAI. The real customer, the true end user of Atlas, is not the person browsing websites, it is the company collecting data about what and how that person is browsing.\" \n\n\nNew York Magazine's \"Intelligencer\" column argues OpenAI wants ChatGPT in your browser because \"That's where people who use computers, particularly for work, spend all their time, and through which vast quantities of valuable information flow in and out. Also, if you're a company hoping to train your models to replicate a bunch of white-collar work, millions of browser sessions would be a pretty valuable source of data.\" \n\n\n\n\n\n\nUnfortunately, warns Fast Company, ChatGPT Atlas, Perplexity Comet, and other AI browses \"include some major security, privacy, and usability trade-offs... Most of the time, I don't want to use",
        "id": 3964943,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/01/0514222/do-ai-browsers-exist-for-you---or-to-give-ai-companies-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Do AI Browsers Exist For You - or To Give AI Companies Data?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T12:53:28.140492+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T12:34:00+00:00",
        "description": "CBS News investigates what happened when police thought they'd tracked down a \"porch pirate\" who'd stolen a package &mdash; and accused an innocent woman. \n\n\n\"You know why I'm here,\" the police sergeant tells Chrisanna Elser. \"You know we have cameras in that town...\"\n\n\"It went right into, 'we have video of you stealing a package,'\" Elser said... \"Can I see the video?\" Elser asked. \"If you go to court, you can,\" the officer replied. \"If you're going to deny it, I'm not going to extend you any courtesy....\" [You can watch a video of the entire confrontation.] On her doorstep, the officer issued a summons, without ever looking at the surveillance video Elser had. \"We can show you exactly where we were,\" she told him. \"I already know where you were,\" he replied. \nHer Rivian &mdash; equipped with multiple cameras &mdash; had recorded her entire route that day... It took weeks of her collecting her own evidence, building timelines, and submitting videos before someone listened. Finally, sh",
        "id": 3963766,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/01/2359245/woman-wrongfully-accused-by-a-license-plate-reading-camera---then-exonerated-by-camera-equipped-car",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Woman Wrongfully Accused by a License Plate-Reading Camera - Then Exonerated By Camera-Equipped Car",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T10:04:06.452347+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T08:34:00+00:00",
        "description": "Millions will set their clocks back an hour tonight for Daylight Saving Time &mdash; only to set them forward an hour six months later. \n\nBut does anyone like doing this, asks Yahoo News:\n\nA recent AP-NORC poll found that about half of the American public, 47%, oppose the current daylight saving time system, compared to 40% who neither favor nor oppose the current practice, while 12% favor the current system, which involves most states switching their clocks twice a year. \n\nOf those polled, 56% would prefer to have daylight saving time year-round, meaning less light in the morning for a tradeoff of more light in the evening. While 42% of Americans said they would prefer to have standard time year-round, which means more light in the morning and less light in the evening. And 12% of Americans prefer switching between standard time and daylight saving time. \n\n\n\nSleep doctors would prefer we switch to standard time permanently. \"The U.S. should eliminate seasonal time changes in favor of",
        "id": 3962992,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/02/0626222/daylight-saving-time-still-happening-still-unpopular",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Daylight Saving Time:  Still Happening. Still Unpopular",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T05:43:30.348030+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T05:34:00+00:00",
        "description": "\"We've spent the last year rebuilding major components of our system,\" Cloudflare announced this week, \"and we've just slashed the latency of traffic passing through our network for millions of our customers,\" (There's a 10ms cut in the median time to respond, plus a 25% performance boost as measured by CDN performance tests.) They replaced a 15-year-old system named FL (where they run security and performance features), and \"At the same time, we've made our system more secure, and we've reduced the time it takes for us to build and release new products.\" \n\nAnd yes, Rust was involved:\n\nWe write a lot of Rust, and we've gotten pretty good at it... We built FL2 in Rust, on Oxy [Cloudflare's Rust-based next generation proxy framework], and built a strict module framework to structure all the logic in FL2...\nBuilt in Rust, [Oxy] eliminates entire classes of bugs that plagued our Nginx/LuaJIT-based FL1, like memory safety issues and data races, while delivering C-level performance. At Clou",
        "id": 3962195,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/02/0529258/cloudflare-raves-about-performance-gains-after-rust-rewrite",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cloudflare Raves About Performance Gains After Rust Rewrite",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-02T04:21:17.215374+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-02T02:56:00+00:00",
        "description": "The Wall Street Journal looks at swarm robotics, where no single robot is in charge, robots interact only with nearby robots &mdash; and the swarm accomplishes complex tasks through simple interactions. \n\n\"Researchers say this approach could excel where traditional robots fail, like situations where central control is impractical or impossible due to distance, scale or communication barriers.\"\n\n\nFor instance, a swarm of drones might one day monitor vast areas to detect early-stage wildfires that current monitoring systems sometimes miss... A human operator might set parameters like where to search, but the drones would independently share information like which areas have been searched, adjust search patterns based on wind and other weather data from other drones in the swarm, and converge for more complete coverage of a particular area when one detects smoke.\nIn another potential application, a swarm of robots could make deliveries across wide areas more efficient by alerting each ot",
        "id": 3961931,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/02/0247242/researchers-consider-the-advantages-of-swarm-robotics",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Consider The Advantages of 'Swarm Robotics'",
        "vote": 0
    }
]