[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T23:13:33+00:00",
        "description": "The Federal Trade Commission has removed over 300 business guidance blogs published during former President Biden's term, including consumer protection information on AI and privacy lawsuits against Amazon and Microsoft, WIRED reported Tuesday, citing current and former FTC employees. \n\nDeleted posts included guidance about Amazon's alleged use of Ring camera data to train algorithms, Microsoft's $20 million settlement over Xbox children's data collection, and compliance standards for AI chatbots. New FTC Chair Andrew Ferguson has pledged to pursue tech companies but with focus on alleged conservative censorship rather than data collection practices.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FTC+Removes+Posts+Critical+of+Amazon%2C+Microsoft%2C+and+AI+Companies%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F03%2F18%2F2040214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/tw",
        "id": 2354207,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/18/2040214/ftc-removes-posts-critical-of-amazon-microsoft-and-ai-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FTC Removes Posts Critical of Amazon, Microsoft, and AI Companies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T22:08:32+00:00",
        "description": "The Dutch parliament approved motions urging the government to reduce reliance on U.S. software companies by developing a sovereign cloud platform and reconsidering contracts with American firms. Reuters reports: While such initiatives have foundered in the past due to a lack of viable European alternatives, lawmakers said changing relations with the United States under the presidency of Donald Trump have given the issue fresh urgency. \"The question we as Europeans must ask ourselves is: do we feel comfortable with people like Trump, (Meta CEO Mark) Zuckerberg and (X owner Elon) Musk ruling over our data?\" said Marieke Koekkoek of the pro-European Volt party, who authored one of the eight motions, in an email to Reuters.\n \nIn addition to launching a sovereign cloud services platform, the motions called on the government to re-examine a decision to use Amazon's web services for the Netherlands' internet domain hosting, and to develop alternatives to U.S. software and preferential trea",
        "id": 2353757,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/18/209246/dutch-parliament-calls-for-end-to-dependence-on-us-software-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dutch Parliament Calls For End To Dependence On US Software Companies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T22:08:32+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Volkswagen's ultra-cheap EV called the ID EVERY1 -- a small four-door hatchback revealed Wednesday -- will be the first to roll out with software and architecture from Rivian, according to a source familiar with the new model. The EV is expected to go into production in 2027 with a starting price of 20,000 euros ($21,500). A second EV called the ID.2all, which will be priced in the 25,000 euro price category, will be available in 2026. Both vehicles are part of the automaker's new category of electric urban front-wheel-drive cars that are being developed under the \"Brand Group Core\" that makes up the volume brands in the VW Group. And both vehicles are for the European market.\n \nThe EVERY1 will be the first to ship with Rivian's vehicle architecture and software as part of a $5.8 billion joint venture struck last year between the German automaker and U.S. EV maker. The ID.2all is based on the E3 1.1 architecture and software develo",
        "id": 2353756,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/2015234/vws-cheapest-ev-is-first-to-use-rivian-software?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "VW's Cheapest EV Is First To Use Rivian Software",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T21:02:48+00:00",
        "description": "General Motors is partnering with Nvidia to enhance its self-driving and manufacturing capabilities by leveraging Nvidia's AI chips, software, and simulation tools. \"GM says it will apply several of Nvidia's products to its business, such as the Omniverse 3D graphics platform which will run simulations on virtual assembly lines with an eye on reducing downtime and improving efficiency,\" reports The Verge. \"The automaker also plans to equip its next-generation vehicles with Nvidia's 'AI brain' for advanced driver assistance and autonomous driving. And it will employ the chipmaker's AI training software to make its vehicle assembly line robots better at certain tasks, like precision welding and material handling.\" From the report: GM already uses Nvidia's GPUs to train its AI software for simulation and validation. Today's announcement was about expanding those use cases into improving its manufacturing operations and autonomous vehicles, GM CEO Mary Barra said in a statement. (Dave Ri",
        "id": 2353313,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/200223/gm-taps-nvidia-to-boost-its-self-driving-projects?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "GM Taps Nvidia To Boost Its Self-Driving Projects",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T21:02:48+00:00",
        "description": "Nvidia unveiled its next wave of AI processors at GTC on Tuesday, announcing Blackwell Ultra chips that will ship in the second half of 2025, followed by the Vera Rubin architecture in 2026. CEO Jensen Huang also revealed that its 2028 chips will be named after physicist Richard Feynman. \n\nThe Blackwell Ultra maintains the same 20 petaflops of AI performance as standard Blackwell chips but increases memory from 192GB to 288GB of HBM3e. Nvidia claims these chips can process 1,000 tokens per second -- ten times faster than its 2022 hardware -- enabling AI reasoning tasks like running DeepSeek-R1 models with 10-second response times versus 1.5 minutes on H100 chips. \n\nVera Rubin will deliver a substantial leap to 50 petaflops in 2026, featuring Nvidia's first custom Arm-based CPU design called Olympus. Nvidia is also changing how it counts GPUs -- Rubin itself contains two dies working as one chip. The annual release cadence represents a strategic shift for Nvidia, which previously intr",
        "id": 2353314,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/201213/nvidia-reveals-next-gen-ai-chips-roadmap-through-2028?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia Reveals Next-Gen AI Chips, Roadmap Through 2028",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T19:55:36+00:00",
        "description": "An anonymous reader quotes a report from Reuters: A federal appeals court in Washington, D.C., on Tuesday affirmed that a work of art generated by artificial intelligence without human input cannot be copyrighted under U.S. law. The U.S. Court of Appeals for the District of Columbia Circuit agreed with the U.S. Copyright Office that an image created by Stephen Thaler's AI system \"DABUS\" was not entitled to copyright protection, and that only works with human authors can be copyrighted.\n \nTuesday's decision marks the latest attempt by U.S. officials to grapple with the copyright implications of the fast-growing generative AI industry. The Copyright Office has separately rejected artists' bids for copyrights on images generated by the AI system Midjourney. The artists argued they were entitled to copyrights for images they created with AI assistance -- unlike Thaler, who said that his \"sentient\" system created the image in his case independently. [...]\n \nU.S. Circuit Judge Patricia Mil",
        "id": 2352832,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/18/1918240/us-appeals-court-rejects-copyrights-for-ai-generated-art?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Appeals Court Rejects Copyrights For AI-Generated Art",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T18:50:35+00:00",
        "description": "U.S. Vice President J.D. Vance text for hampering American innovation in a speech to entrepreneurs and venture capitalists on Tuesday, arguing that offshoring has eroded U.S. technological leadership. \"Our workers have been failed by the government of the last 40 years,\" Vance told the American Dynamism Summit, criticizing two \"conceits\" of globalization: that nations manufacturing products wouldn't eventually design them too, and that cheap foreign labor benefits innovation. \n\n\"As they got better at the low end of the value chain, they also started catching up on the higher end. We were squeezed from both ends,\" Vance said, adding that \"cheap labor is fundamentally a crutch\" that inhibits technological advancement. The Trump administration recently rolled back Biden-era AI regulations, with Vance emphasizing their goal to \"incentivize investment in our own borders, in our own businesses, our own workers and our own innovation.\" Vance, a former venture capitalist, dismissed fears abo",
        "id": 2352291,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/18/1734252/vance-slams-globalization-for-hampering-american-innovation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Vance Slams Globalization For Hampering American Innovation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T17:45:41+00:00",
        "description": "Eric Migicovsky, founder of Pebble, will release two new smartwatches running the newly open-sourced Pebble operating system through his company Core Devices. The Core 2 Duo, priced at $149 and shipping in July, utilizes unused Pebble 2 frames with the same black-and-white E Ink display. \n\nThe device features a 30-day battery life -- quadruple its predecessor's -- and incorporates a speaker for AI assistant interaction. Approximately 10,000 units will be available. The Core Time 2, arriving in December at $225, adds touchscreen functionality to the classic Pebble design while maintaining physical buttons and month-long battery life. \n\nBoth devices face iPhone integration challenges. Migicovsky cautioned potential tariff increases would be passed to consumers, stating, \"We're going to charge more if it costs more.\" \"I'm not building a company to sell millions of these,\" Migicovsky said. \"The goal is to make something I really want.\"<p><div class=\"share_submission\" style=\"position:rela",
        "id": 2351705,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/1621244/the-first-new-pebble-smartwatches-are-coming-later-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The First New Pebble Smartwatches Are Coming Later This Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T17:45:41+00:00",
        "description": "Despite spending hundreds of millions on blockbuster films, Netflix continues to churn out critically panned big-budget fare with its latest $300 million flop, \"The Electric State,\" starring Chris Pratt and Millie Bobby Brown. While the streaming giant has produced acclaimed films by giving talented directors creative freedom -- resulting in successes like \"The Irishman,\" \"Marriage Story\" and \"The Power of the Dog\" -- it has repeatedly failed to create genuinely compelling blockbusters despite attracting major talent and pouring massive resources into productions like \"Red Notice,\" \"The Gray Man\" and now \"The Electric State.\" \n\nThese expensive Netflix \"mockbusters\" lack the overwhelming sensations that theatrical blockbusters deliver, instead feeling like glorified content designed primarily for home viewing. The Russo brothers' \"Electric State,\" with its drab visuals and lifeless performances, exemplifies how Netflix's biggest productions feel infused with the knowledge they're mere",
        "id": 2351706,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/18/1634231/why-are-the-most-expensive-netflix-movies-also-the-worst?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why Are the Most Expensive Netflix Movies Also the Worst?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T16:40:55+00:00",
        "description": "Meta's open AI model family Llama has reached 1 billion downloads, CEO Mark Zuckerberg announced on Tuesday, marking a 53% increase from the 650 million reported in early December. Llama, which powers Meta's AI assistant across Facebook, Instagram and WhatsApp, operates under a proprietary license that some developers consider commercially restrictive despite its free availability. Major corporations including Spotify, AT&amp;T and DoorDash currently deploy Llama models in production environments.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta's+Llama+AI+Models+Hit+1+Billion+Downloads%2C+Zuckerberg+Says%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F18%2F161237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F18%2F161237%2Fmetas",
        "id": 2351179,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/161237/metas-llama-ai-models-hit-1-billion-downloads-zuckerberg-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta's Llama AI Models Hit 1 Billion Downloads, Zuckerberg Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T15:35:26+00:00",
        "description": "Y Combinator CEO Garry Tan said startups are reaching $1-10 million annual revenue with fewer than 10 employees due to \"vibe coding,\" a term coined by OpenAI cofounder Andrej Karpathy in February. \n\n\"You can just talk to the large language models and they will code entire apps,\" Tan told CNBC (video). \"You don't have to hire someone to do it, you just talk directly to the large language model that wrote it and it'll fix it for you.\" What would've once taken \"50 or 100\" engineers to build, he believes can now be accomplished by a team of 10, \"when they are fully vibe coders.\" He adds: \"When they are actually really, really good at using the cutting edge tools for code gen today, like Cursor or Windsurf, they will literally do the work of 10 or 100 engineers in the course of a single day.\" \n\nAccording to Tan, 81% of Y Combinator's current startup batch consists of AI companies, with 25% having 95% of their code written by large language models. Despite limitations in debugging capabili",
        "id": 2350536,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/18/1428226/vibe-coding-is-letting-10-engineers-do-the-work-of-a-team-of-50-to-100-says-yc-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Vibe Coding' is Letting 10 Engineers Do the Work of a Team of 50 To 100, Says YC CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T14:30:54+00:00",
        "description": "The rumors were right: Google parent Alphabet has agreed to buy cyber security start-up Wiz for $32 billion, the biggest acquisition in the search group's history. From the report: Alphabet held talks over a $23 billion acquisition of Wiz last year, although the negotiations collapsed after some of the cyber security company's directors and investors became worried about antitrust hurdles. \n\nThe deal, which will rank as the biggest deal of the year so far, was announced on Tuesday morning. It will probably still face scrutiny from the Federal Trade Commission under President Donald Trump, whose new chair Andrew Ferguson has maintained guidelines giving the agency the ability to block large deals used by his predecessor Lina Khan.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Parent+Alphabet+Acquires+Wiz+For+%2432+Billion%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F18%2F1117215%2F%3Futm_source%3Dt",
        "id": 2349796,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/1117215/google-parent-alphabet-acquires-wiz-for-32-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Parent Alphabet Acquires Wiz For $32 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T12:20:19+00:00",
        "description": "Google parent Alphabet has agreed to buy cyber security start-up Wiz for $32 billion, the biggest acquisition in the search group's history, according to Financial Times, which cites sources. From the report: Alphabet held talks over a $23 billion acquisition of Wiz last year, although the negotiations collapsed after some of the cyber security company's directors and investors became worried about antitrust hurdles. \n\nThe deal, which will rank as the biggest deal of the year so far, will be announced on Tuesday morning, a person said. It will probably still face scrutiny from the Federal Trade Commission under President Donald Trump, whose new chair Andrew Ferguson has maintained guidelines giving the agency the ability to block large deals used by his predecessor Lina Khan.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Parent+Alphabet+Agrees+To+Buy+Cyber+Security+Group+Wiz+For+%2432+Billion%3A+https%3A%2F",
        "id": 2348737,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/1117215/google-parent-alphabet-agrees-to-buy-cyber-security-group-wiz-for-32-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Parent Alphabet Agrees To Buy Cyber Security Group Wiz For $32 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T10:10:44+00:00",
        "description": "HR software startup Rippling has sued competitor Deel, alleging that Deel orchestrated corporate espionage by recruiting an employee within Rippling to steal trade secrets, including customer data, sales strategies, and internal records. The lawsuit (PDF) claims the spy shared confidential information with Deel executives and a reporter, leading to legal action under the Racketeer Influenced and Corrupt Organizations (RICO) Act. Deel denies wrongdoing and plans to counter the claims. CNBC reports: The two startups are among the most world's most valuable. Investors valued Rippling at $13.5 billion in a funding round announced last year, while Deel told media outlets in 2023 that it was worth $12 billion. Deel ranked No. 28 on CNBC's 2024 Disruptor 50 list. \"Weeks after Rippling is accused of violating sanctions law in Russia and seeding falsehoods about Deel, Rippling is trying to shift the narrative with these sensationalized claims,\" a Deel spokesperson told CNBC in an email. \"We d",
        "id": 2347875,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/0436243/software-startup-rippling-sues-competitor-deel-claiming-a-spy-carried-out-corporate-espionage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Software Startup Rippling Sues Competitor Deel, Claiming a Spy Carried Out 'Corporate Espionage'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T08:00:18+00:00",
        "description": "A newly FDA-approved form of adaptive deep-brain stimulation (DBS) for Parkinson's disease adjusts electrical stimulation in real time based on an individual's brain signals, improving symptom control and reducing medication dependence. Scientific American: For decades, Keith Krehbiel took high doses of medications with a debilitating side effect -- severe nausea -- following his diagnosis with early-onset Parkinson's disease at age 42 in 1997. When each dose wore off, he experienced dyskinesia -- involuntary, repetitive muscle movements. In his case, this consisted of head bobbing and weaving. Krehbiel is among one million Americans who live with this progressive neurological disorder, which causes slowed movements, tremors and balance problems. But soon after surgery to implant electrodes into specific areas of his brain in 2020, his life dramatically improved. \"My tremor went away almost entirely,\" says Krehbiel, now age 70 and a professor emeritus of political science at the Stan",
        "id": 2347280,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/18/0443229/new-form-of-parkinsons-treatment-uses-real-time-deep-brain-stimulation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Form of Parkinson's Treatment Uses Real-Time Deep-Brain Stimulation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T03:40:10+00:00",
        "description": "An anonymous reader quotes a report from Variety: More than 400 Hollywood creative leaders signed an open letter to the Trump White House's Office of Science and Technology Policy, urging the administration to not roll back copyright protections at the behest of AI companies. The filmmakers, writers, actors, musicians and others -- which included Ben Stiller, Mark Ruffalo, Cynthia Erivo, Cate Blanchett, Cord Jefferson, Paul McCartney, Ron Howard and Taika Waititi -- were submitting comments for the Trump administration's U.S. AI Action Plan. The letter specifically was penned in response to recent submissions to the Office of Science and Technology Policy from OpenAI and Google, which asserted that U.S. copyright law allows (or should allow) allow AI companies to train their system on copyrighted works without obtaining permission from (or compensating) rights holders.\n \n\"We firmly believe that America's global AI leadership must not come at the expense of our essential creative indu",
        "id": 2346411,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/18/000234/hollywood-urges-trump-to-not-let-ai-companies-exploit-copyrighted-works?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hollywood Urges Trump To Not Let AI Companies 'Exploit' Copyrighted Works",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T02:34:52+00:00",
        "description": "fahrbot-bot shares a report from Reuters: BYD on Monday unveiled a new platform for electric vehicles (EVs) that it said could charge EVs as quickly as it takes to pump gas and announced for the first time that it would build a charging network across China. The so-called \"super e-platform\" will be capable of peak charging speeds of 1,000 kilowatts (kW), enabling cars that use it to travel 400 km (249 miles) on a 5-minute charge, founder Wang Chuanfu said at an event livestreamed from the company's Shenzhen headquarters.\n \nCharging speeds of 1,000 kW would be twice as fast as Tesla's superchargers whose latest version offers up to 500 kw charging speeds. The new charging architecture will be initially available in two new EVs -- Han L sedan and Tang L SUV priced from 270,000 yuan ($37,328.91) and BYD said it would build over 4,000 ultra-fast charging piles, or units, across China to match the new platform. \"In order to completely solve our user's charging anxiety, we have been pursui",
        "id": 2346228,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/17/2350228/byd-unveils-new-super-charging-ev-tech-with-peak-speeds-of-1000-kw?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "BYD Unveils New Super-Charging EV Tech With Peak Speeds of 1,000 kW",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T01:30:08+00:00",
        "description": "According to The Verge, legacy G Suite accounts will soon lose their individual storage allotment perks and be transitioned to pooled storage, which will be \"shared across all users within your organization.\" The changes will come into effect starting May 1st. From the report: G Suite was rebranded as Workspace in 2020. G Suite legacy free edition, which Google stopped offering in 2012, provides each user with 15GB of free allocated storage and was offered for personal use -- making it ideal for families or groups that need to share a collective domain. Existing users have been permitted to access Workspace services at no additional charge, but Google says it's now making this change because pooled storage provides a \"simpler and more flexible way to manage storage.\" \"Google Workspace customers have had the benefit of pooled storage for years, and now we're rolling it out to users with this legacy offering,\" Google spokesperson Jenny Thomson told The Verge.\n \nNo action is required fo",
        "id": 2345948,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/17/2129257/google-is-switching-legacy-g-suite-users-to-pooled-workspace-storage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Is Switching Legacy G Suite Users To Pooled Workspace Storage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T00:24:49+00:00",
        "description": "Roku is testing autoplaying video ads that play before users can access the home screen. While Roku claims this is just an experiment, users are threatening to abandon the platform if the change becomes permanent. Ars Technica reports: Reports of Roku customers seeing video ads automatically play before they could view the OS' home screen started appearing online this week. A Reddit user, for example, posted yesterday: \"I just turned on my Roku and got an unskippable ad for a movie, before I got to the regular Roku home screen.\" Multiple apparent users reported seeing an ad for the movie Moana 2. When reached for comment, a Roku spokesperson shared a company statement that confirms that the autoplaying ads are expected behavior but not a permanent part of Roku OS currently. Instead, Roku claimed, it was just trying the ad capability out.\n \nRoku's representative said that Roku's business \"has and will always require continuous testing and innovation across design, navigation, content,",
        "id": 2345678,
        "language": null,
        "link": "https://slashdot.org/story/25/03/17/2122232/roku-tests-autoplaying-ads-loading-before-the-home-screen?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Roku Tests Autoplaying Ads Loading Before the Home Screen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T00:24:49+00:00",
        "description": "An anonymous reader quotes a report from Politico: A top Commerce Department official sent a blistering email to his former colleagues on his way out the door Sunday warning that the Trump administration is poised to unduly enrich Elon Musk's satellite internet company with money for rural broadband. The technology offered by Starlink ... is inferior, wrote Evan Feinman, who had directed the $42.5 billion broadband program for the past three years. \"Stranding all or part of rural America with worse internet so that we can make the world's richest man even richer is yet another in a long line of betrayals by Washington,\" Feinman said.\n \nFeinman's lengthy email, totaling more than 1,100 words and shared with POLITICO, is a sign of deep discomfort about the changes underway that will likely transform the Broadband Equity, Access and Deployment Program. Commerce Secretary Howard Lutnick recently pledged a vigorous review of BEAD, with an aim to rip out what he sees as extraneous requirem",
        "id": 2345679,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/17/2117212/top-broadband-official-exits-commerce-department-with-warning-about-starlink?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Top Broadband Official Exits Commerce Department With Warning About Starlink",
        "vote": 0
    }
]