[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T21:00:11+00:00",
        "description": "Assassin's Creed Shadows is nearly upon us, and with its exclusive launch on Xbox Series X/S, PS5, and PC, it's essentially the newest generation of the franchise. With improvements made to the Anvil engine, especially in its usage of ray-traced global illumination and Atmos, the open-world action RPG is a smorgasbord of visual details.\n\nOn PC, that is. The PS5 version is commendable for managing so much of this fidelity while maintaining strong performance metrics across all modes. The lighting on Balanced and Fidelity modes is especially notable. However, image quality isn't quite up to snuff, and some minor issues blemish the otherwise rich artistic direction.\n\nThis isn't to say that Assassin's Creed Shadows is a mess on PS5. However, the PC version is superior with everything - the detailed character models, the dynamic weather, and the impeccable lighting - looking far better. Join us to learn more about both versions and what distinguishes them.",
        "id": 2353791,
        "language": null,
        "link": "https://www.youtube.com/watch?v=FfAjtYWCkcE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FfAjtYWCkcE/hqdefault.jpg",
        "title": "Assassin's Creed Shadows Is An Open World Stunner, But How Well Do The PC And PS5 Versions Perform?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T17:00:44+00:00",
        "description": "The wait for an Assassin’s Creed game set in feudal Japan was a long one, but now that it’s here, Assassin’s Creed Shadows doesn’t disappoint. Through a combination of stellar world design, gorgeous environments, engaging exploration, and significantly less bloat than in recent entries, Shadows’ open world Japan proves itself a stellar setting, and one that is a constant joy to explore. \n\nBeyond that, stealth and parkour also go back to the series’ strengths, while strong combat and rewarding progression also elevate the experience. Though not nearly up to scratch as far as the narrative is concerned, in all other areas that matter most, Assassin’s Creed Shadows is an unequivocal triumph.",
        "id": 2351749,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ePNiFXrGG-o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ePNiFXrGG-o/hqdefault.jpg",
        "title": "Assassin's Creed Shadows Review - GAME OF THE YEAR CONTENDER",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-18T09:30:11+00:00",
        "description": "Playing things safe may sound dull when it comes to yearly franchise iterations, but it's something that's somewhat defined sports games over the years. Sony San Diego Studio's MLB The Show is notorious in this regard, for better or worse. Visually, it hasn't made any significant overhauls or changes, though it still boasts some of the best animation work for a sports title.\n\nHowever, MLB The Show 25 purports to improve on many issues from last year while adding new content. From the latest season of Storylines focusing on new African-American legends to Diamond Quest and more options in Road to the Show, there's plenty to sink your teeth into. The gameplay remains as endearing as ever, even if the AI can be generally more challenging.\n\nYes, there's the feeling that MLB The Show 25 isn't straying too far from the usual, but it's still a solid, enjoyable experience. Whether it continues in this vein for the next few years is the real test for fans seeking something different.",
        "id": 2347893,
        "language": null,
        "link": "https://www.youtube.com/watch?v=INU7TG74hXw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/INU7TG74hXw/hqdefault.jpg",
        "title": "MLB The Show 25 Review - A Must Play For Baseball Fans",
        "vote": 0
    }
]