[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T23:21:34.927421+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T22:40:00+00:00",
        "description": "The Internet Archive has reached a confidential settlement with Universal Music Group and other major labels, \"ending a closely watched copyright battle over the nonprofit's effort to digitize and stream historic recordings,\" reports the San Francisco Chronicle. From the report: The case (PDF), UMG Recordings, Inc. v. Internet Archive, targeted the Archive's Great 78 Project, an initiative to digitize more than 400,000 fragile shellac records from the early 20th century. The collection includes music by artists such as Frank Sinatra, Ella Fitzgerald and Billie Holiday, and has been made available online for free public access. Record labels including Universal, Sony Music Entertainment and Capitol Records had sought $621 million in damages, arguing the Archive's streaming of these recordings constituted copyright infringement.\n \nThe Internet Archive, based in San Francisco's Richmond District, describes itself as a digital library dedicated to providing \"universal access to all knowle",
        "id": 3582944,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/15/228226/internet-archive-ends-legal-battle-with-record-labels-over-historic-recordings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Internet Archive Ends Legal Battle With Record Labels Over Historic Recordings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T22:14:23.189280+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Politico: In roughly six weeks, three California Democrats, a labor head and two ride-hailing leaders managed to pull off what would have been unthinkable just one year prior: striking a deal between labor unions and their longtime foes, tech giants Uber and Lyft. California lawmakers announced the agreement in late August, paving a path for ride-hailing drivers to unionize as labor wanted, in exchange for the state drastically reducing expensive insurance coverage mandates protested by the companies. It earned rare public support from Gov. Gavin Newsom and received final approval from state lawmakers this week.\n \nThe swift speed of the negotiating underscores what was at risk: the prospect of yet another nine-figure ballot measure campaign or lengthy court battle between two deeply entrenched sides, according to interviews with five people involved in the talks. Their accounts shed new light on how the deal came together: how the talks started",
        "id": 3582484,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/15/2034227/how-california-reached-a-union-deal-with-tech-giants-uber-and-lyft?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How California Reached a Union Deal With Tech Giants Uber and Lyft",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T22:14:23.296993+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T21:20:00+00:00",
        "description": "404 Media: A data broker owned by the country's major airlines, including American Airlines, United and Delta, is selling access to five billion plane ticketing records to the government for warrantless searching and monitoring of peoples' movements, including by the FBI, Secret Service, ICE, and many other agencies, according to a new contract and other records reviewed by 404 Media. \n\nThe contract provides new insight into the scale of the sale of passengers' data by the Airlines Reporting Corporation (ARC), the airlines-owned data broker. The contract shows ARC's data includes information related to more than 270 carriers and is sourced through more than 12,800 travel agencies. ARC has previously told the government to not reveal to the public where this passenger data came from, which includes peoples' names, full flight itineraries, and financial details. \n\n\"Americans' privacy rights shouldn't depend on whether they bought their tickets directly from the airline or via a travel a",
        "id": 3582485,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/15/1850226/airlines-sell-5-billion-plane-ticket-records-to-the-government-for-warrantless-searching?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Airlines Sell 5 Billion Plane Ticket Records To the Government For Warrantless Searching",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T21:04:10.234359+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T21:00:00+00:00",
        "description": "Treasury Secretary Scott Bessent announced that the U.S. and China have reached a tentative \"framework\" agreement on TikTok's U.S. operations, with Presidents Trump and Xi set to finalize details Friday. \"It's between two private parties, but the commercial terms have been agreed upon,\" he said. The update comes two days before TikTok parent company ByteDance faces a Sept. 17 deadline to divest the platform's U.S. business or potentially be shut down in the country. The deadline may need to be pushed back yet again to get the deal signed. CNBC reports: Both President Donald Trump and Chinese President Xi Jinping will meet Friday to discuss the terms. Trump also said in a Truth Social post Monday that a deal was reached \"on a 'certain' company that young people in our Country very much wanted to save.\"\n \nBessent indicated the framework could pivot the platform to U.S.-controlled ownership. China's lead trade negotiator, Li Chenggang, confirmed the framework deal was in place and said t",
        "id": 3581968,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/15/2040255/tiktok-deal-framework-reached-with-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "TikTok Deal 'Framework' Reached With China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T21:04:10.477561+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T20:44:00+00:00",
        "description": "Microsoft is adding the free Microsoft 365 Copilot Chat and agents to Office apps for all Microsoft 365 business users today. From a report: Word, Excel, PowerPoint, Outlook, and OneNote are all being updated with a Copilot Chat sidebar that will help draft documents, analyze spreadsheets, and more without needing an additional Microsoft 365 Copilot license. \n\n\"Copilot Chat is secure AI chat grounded in the web -- and now, it's available in the Microsoft 365 apps,\" explains Seth Patton, general Manager of Microsoft 365 Copilot product marketing. \"It's content aware, meaning it quickly understands what you're working on, tailoring answers to the file you have open. And it's included at no additional cost for Microsoft 365 users.\" \n\nWhile this free version of Copilot will rewrite documents, provide summaries, and help create slides in PowerPoint, the $30 per month, per user Microsoft 365 Copilot license will still have the best integration in Office apps. The Microsoft 365 Copilot licen",
        "id": 3581969,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/15/1751254/microsofts-office-apps-now-have-free-copilot-chat-features?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft's Office Apps Now Have Free Copilot Chat Features",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T21:04:10.643914+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T20:01:00+00:00",
        "description": "Lead times for high-capacity hard drives have exceeded 52 weeks as AI workloads drive unprecedented demand for warm storage that sits between fast SSDs and offline tape archives, according to TrendForce. Western Digital notified customers of price increases across its entire hard drive portfolio citing demand for \"every capacity\" in its product line. \n\nThe shortage stems from AI infrastructure requirements including training datasets, model checkpoints and inference logs that consume petabytes of storage space. These files are too large for primary SSD storage but must remain accessible for quick retrieval. Hard drive manufacturers have not significantly expanded production capacity in approximately a decade. Cloud service providers are evaluating QLC SSDs for cold data storage despite costs remaining four to five times higher per gigabyte than mechanical drives. Memory suppliers are developing SSD products specifically for this intermediate storage tier.<p><div class=\"share_submissio",
        "id": 3581970,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/15/1823230/hard-drive-shortage-intensifies-as-ai-training-data-pushes-lead-times-beyond-12-months?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hard Drive Shortage Intensifies as AI Training Data Pushes Lead Times Beyond 12 Months",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T19:50:42.582239+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T19:21:00+00:00",
        "description": "President Donald Trump called Monday for companies to report earnings every six months instead of quarterly. Trump posted on social media that semi-annual reporting would save money and let managers focus on running companies. The SEC mandated quarterly reports in 1970. Trump made similar comments in 2018 that prompted SEC public comment but no regulatory changes. \n\nCritics argue quarterly reporting increases costs and encourages short-term thinking. Supporters say frequent disclosures maintain investor trust and reduce market manipulation risks. \n\nFurther reading: The Renewed Bid To End Quarterly Earnings Reports.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=President+Calls+for+Six-Month+Corporate+Reporting+Cycle%2C+Citing+Cost+Savings%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F15%2F1815211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<",
        "id": 3581487,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/15/1815211/president-calls-for-six-month-corporate-reporting-cycle-citing-cost-savings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "President Calls for Six-Month Corporate Reporting Cycle, Citing Cost Savings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T19:50:42.699988+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T18:40:00+00:00",
        "description": "Toxic fumes from jet engines are leaking into aircraft cabins at an accelerating rate, reaching 108 incidents per million departures in 2024 compared to 12 in 2014, a Wall Street Journal investigation found. The fumes contain neurotoxins and carbon monoxide that have caused brain injuries in crew members. JetBlue flight attendant Florence Chesson suffered permanent neurological damage after inhaling engine oil vapors in 2018, diagnosed by neurologists as equivalent to an NFL linebacker's concussion. \n\nThe surge is driven by Airbus A320 aircraft, particularly the A320neo model introduced in 2016. WSJ reports Airbus loosened maintenance requirements under airline pressure despite knowing the changes would increase incidents. The FAA received over 700 fume event reports from major U.S. airlines in 2024. Most commercial jets except Boeing's 787 use a \"bleed air\" system that pulls cabin air through engines.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" hre",
        "id": 3581488,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/15/1840218/toxic-fumes-are-leaking-into-airplanes-sickening-crews-and-passengers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Toxic Fumes Are Leaking Into Airplanes, Sickening Crews and Passengers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T18:26:55.612277+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T18:05:00+00:00",
        "description": "A third of UK employers are using \"bossware\" technology to track workers' activity with the most common methods including monitoring emails and web browsing. From a report: Private companies are most likely to deploy in-work surveillance and one in seven employers are recording or reviewing screen activity, according to a UK-wide survey that estimates the extent of office snooping. \n\nThe findings, shared with the Guardian by the Chartered Management Institute (CMI), are based on responses from hundreds of UK managers and suggest there has been a recent growth in computerised work surveillance. In 2023, less than a fifth of people thought they were being monitored by an employer, the Information Commissioner's Office (ICO) found. The finding that about a third of managers report their organisations are monitoring workers' online activities on employer-owned devices is probably an underestimate, as roughly the same proportion said they don't know what tracking their organisations do. \n\n",
        "id": 3580814,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/15/1747238/a-third-of-uk-firms-using-bossware-to-monitor-workers-activity-survey-reveals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Third of UK Firms Using 'Bossware' To Monitor Workers' Activity, Survey Reveals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T18:26:55.787258+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T17:27:00+00:00",
        "description": "Apple released iOS 26, iPadOS 26 and macOS Tahoe 26 today, introducing Liquid Glass, a translucent design language that represents the biggest visual redesign since iOS 7 in 2013. The new interface elements dynamically refract and reflect background content across all three platforms. iOS 26 requires iPhone 11 or later and second-generation iPhone SE or newer. iPadOS 26 runs on the same hardware as iPadOS 18 except the 7th-generation iPad. macOS Tahoe 26 supports all Apple silicon Macs, the 2019 16-inch MacBook Pro, 2020 13-inch MacBook Pro, 2020 and later iMac, and 2019 and later Mac Pro. The transparent menu bar on macOS increases perceived display size. \n\niOS 26's adaptive Lock Screen time display resizes around notifications and Live Activities. Desktop icons, folders, app icons and widgets support light, dark, tinted, and clear appearances across all systems. iOS 26 adds Visual Intelligence for on-screen content analysis through screenshot button combinations. Live Translation op",
        "id": 3580815,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/09/15/1727213/apple-ships-ios-26-ipados-26-and-macos-tahoe-26-with-liquid-glass-ui-overhaul?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Ships iOS 26, iPadOS 26 and macOS Tahoe 26 With 'Liquid Glass' UI Overhaul",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T17:08:09.234528+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T16:49:00+00:00",
        "description": "AI is transforming corporate America, yet the boom remains understated in government growth statistics, according to Goldman Sachs. From a report: Analysts at Goldman pointed to the scale of the boom in a Saturday note: \"Revenue at US companies providing AI infrastructure has risen by $400 billion since 2022, which at first glance seems to suggest that AI has been a meaningful driver of economic growth recently.\" But official numbers tell a different story. \n\nAI technology has lifted real US economic activity by about $160 billion since 2022, or 0.7% of GDP, the analysts calculated. Yet only around $45 billion, or 0.2% of GDP, of AI-spurred growth has been recorded in official statistics. That leaves roughly $115 billion uncounted, according to the analysts. That gap highlights the difference between what companies report and what the government measures due to the Commerce Department's Bureau of Economic Analysis method for calculating growth.<p><div class=\"share_submission\" style=\"p",
        "id": 3580107,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/15/1649210/ais-economic-boost-isnt-showing-up-in-us-gdp-goldman-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI's Economic Boost Isn't Showing Up in US GDP, Goldman Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T17:08:09.343101+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T16:05:00+00:00",
        "description": "Businesses are overwhelmingly relying on Anthropic's AI software to automate rather than collaborate on work, according to a new report from the OpenAI rival, adding to the risk that AI will upend livelihoods. From a report: More than three quarters (77%) of companies' usage of Anthropic's Claude AI software involved automation patterns, often including \"full task delegation,\" according to a research report the startup released on Monday. The finding was based on an analysis of traffic from Anthropic's application programming interface, which is used by developers and businesses. \n\n[...] On the whole, Anthropic found businesses primarily use Claude for administrative tasks and coding, the latter of which has been a key focus for the company and much of the AI industry. Anthropic, OpenAI and other AI developers have released more sophisticated AI tools that can write and debug code on a user's behalf.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=",
        "id": 3580108,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/15/1520249/anthropic-finds-businesses-are-mainly-using-ai-to-automate-work?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Finds Businesses Are Mainly Using AI To Automate Work",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T15:56:16.838591+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T15:21:00+00:00",
        "description": "An anonymous reader shares a column: After nearly 30 years of USB-A connectivity, the market is now transitioning to the convenient USB-C standard, which makes sense given that it supports higher speeds, display data, and power delivery. The symmetrical connection is also smaller and more user-friendly, as it's reversible and works with smartphones and tablets. I get that USB-C is inevitable, but tech brands should realize that the ubiquitous USB-A isn't going anywhere soon and stop removing the ports we need to run our devices. \n\n[...] It's premature for brands to phase out USB-A when peripheral brands are still making compatible products in 2025. For example, Logitech's current wireless pro gaming mice connect using a USB-A Lightspeed dongle, and most Seagate external drives still use USB-A as their connection method. The same can be said for other memory sticks, keyboards, wireless headsets, and other new devices that are still manufactured with a USB-A connection. \n\nI have a gamin",
        "id": 3579443,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/15/1510250/usb-a-isnt-going-anywhere-so-stop-removing-the-port?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'USB-A Isn't Going Anywhere, So Stop Removing the Port'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T15:56:17.105450+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T14:44:00+00:00",
        "description": "Google has restructured Android's decade-old monthly security update process into a \"Risk-Based Update System\" that separates high-priority patches from routine fixes. Monthly bulletins now contain only vulnerabilities under active exploitation or in known exploit chains -- explaining July 2025's unprecedented zero-CVE bulletin -- while most patches accumulate for quarterly releases. \n\nThe September 2025 bulletin contained 119 vulnerabilities compared to zero in July and six in August. The change reduces OEM workload for monthly updates but extends the private bulletin lead time from 30 days to several months for quarterly releases. The company no longer releases monthly security update source code, limiting custom ROM development to quarterly cycles.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Shifts+Android+Security+Updates+To+Risk-Based+Triage+System%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F09%",
        "id": 3579444,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/15/1444225/google-shifts-android-security-updates-to-risk-based-triage-system?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Shifts Android Security Updates To Risk-Based Triage System",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T12:10:31.044742+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T11:34:00+00:00",
        "description": "Long-time Slashdot reader schwit1 shared this article from IEEE Spectrum:\n\nThe world's largest airplane, when it's built, will stretch more than a football field from tip to tail. Sixty percent longer than the biggest existing aircraft, with 12 times as much cargo space as a 747, the behemoth will look like an oil tanker that's sprouted wings &mdash; aeronautical engineering at a preposterous scale. \n\nCalled WindRunner, and expected by 2030, it'll haul just one thing: massive wind-turbine blades. In most parts of the world, onshore wind-turbine blades can be built to a length of 70 meters, max. This size constraint comes not from the limits of blade engineering or physics; it's transportation. Any larger and the blades couldn't be moved over land, since they wouldn't fit through tunnels or overpasses, or be able to accommodate some of the sharper curves of roads and rails. \n\nSo the WindRunner's developer, Radia of Boulder, Colorado, has staked its business model on the idea that the o",
        "id": 3577514,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/15/0224231/if-we-want-bigger-wind-turbines-were-gonna-need-bigger-airplanes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'If We Want Bigger Wind Turbines, We're Gonna Need Bigger Airplanes'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T08:36:48.555047+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T08:30:00+00:00",
        "description": "India's IT services industry saw entry-level hiring collapse by 70% between fiscal years 2023 and 2024, as the country's four largest IT exporters reduced fresh graduate recruitment from 225,000 to 60,000. Tata Consultancy Services and Infosys shed a combined 38,000 employees in fiscal 2024, marking the sector's first workforce contraction in decades. \n\nStudies indicate generative AI could automate 30-40% of junior developer and tester tasks. The proportion of employees under 30 at Infosys declined from 81% in 2010 to a projected 53% by fiscal 2025. India adds 8-9 million people to its workforce annually while the IT sector projects just 50,000 net new jobs per year from fiscal 2026-28. The graduate unemployment rate exceeds 13%, nearly triple the national average.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Triggers+70%25+Collapse+in+Fresh+Graduate+Hiring+at+India's+IT+Giants+That+Employ+5.4+Million%3A+https%",
        "id": 3576176,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/15/0718258/ai-triggers-70-collapse-in-fresh-graduate-hiring-at-indias-it-giants-that-employ-54-million?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Triggers 70% Collapse in Fresh Graduate Hiring at India's IT Giants That Employ 5.4 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T08:36:48.648715+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T07:34:00+00:00",
        "description": "\"These are the last days of social media as we know it,\" argues a humanities lecturer from University College Cork exploring where technology and culture intersect, warning they could be come lingering derelicts \"haunted by bots and the echo of once-human chatter...\" \n\n\"Whatever remains of genuine, human content is increasingly sidelined by algorithmic prioritization, receiving fewer interactions than the engineered content and AI slop optimized solely for clicks... \"\n\nIn recent years, Facebook and other platforms that facilitate billions of daily interactions have slowly morphed into the internet's largest repositories of AI-generated spam. Research has found what users plainly see: tens of thousands of machine-written posts now flood public groups &mdash; pushing scams, chasing clicks &mdash; with clickbait headlines, half-coherent listicles and hazy lifestyle images stitched together in AI tools like Midjourney... While content proliferates, engagement is evaporating. Average inter",
        "id": 3576177,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/15/050241/what-happens-after-the-death-of-social-media?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happens After the Death of Social Media?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T05:34:31.384765+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T04:34:00+00:00",
        "description": "\"Engineers from Ohio State University are developing a new way to power rocket engines,\" reports Gizmodo, \"using liquid uranium for a faster, more efficient form of nuclear propulsion that could deliver round trips to Mars within a single year...\"\n\n\nNuclear propulsion uses a nuclear reactor to heat a liquid propellant to extremely high temperatures, turning it into a gas that's expelled through a nozzle and used to generate thrust. The newly developed engine concept, called the centrifugal nuclear thermal rocket (CNTR), uses liquid uranium to heat rocket propellant directly. In doing so, the engine promises more efficiency than traditional chemical rockets, as well as other nuclear propulsion engines, according to new research published in Acta Astronautica... \n\nTraditional chemical engines produce about 450 seconds of thrust from a given amount of propellant, a measure known as specific impulse. Nuclear propulsion engines can reach around 900 seconds, with the CNTR possibly pushing t",
        "id": 3575432,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/15/0322251/a-new-nuclear-rocket-concept-could-slash-mars-travel-time-in-half?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A New Nuclear Rocket Concept Could Slash Mars Travel Time in Half",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T03:07:43.879221+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T02:34:00+00:00",
        "description": "The UK's data-protecting Information Commissioner's Office has issued a warning about what it calls a worrying trend, reports the BBC: \"students hacking their own school and college IT systems for fun or as part of dares.\"\n\n\n\nSince 2022, the the Information Commissioner's Office (ICO) has investigated 215 hacks and breaches originating from inside education settings and says 57% were carried out by children. Other breaches are thought to come from staff, third party IT suppliers and other organisations with access. According to the new data, almost a third of the breaches involved students illegally logging into staff computer systems by guessing passwords or stealing details from teachers. \n\nIn one incident, a seven-year-old was involved in a data breach and subsequently referred to the National Crime Agency's Cyber Choices programme to help them understand the seriousness of their actions... In another incident three Year 11 students aged 15 or 16 unlawfully accessed school database",
        "id": 3574882,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/15/0150246/uks-data-watchdog-warns-students-are-breaching-their-schools-it-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK's Data Watchdog Warns Students Are Breaching Their Schools' IT Systems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T01:51:51.011293+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T00:40:00+00:00",
        "description": "RestOfWorld.org reports on \"a global crisis nobody anticipated when governments started subsidizing electric vehicles...\" \n\n\"EVs can lose almost half their driving distance when temperatures drop, and the billions spent on improving technology have failed to fix this fundamental limitation.\"\n\nIn January, Seattle-based Recurrent, a company that tests and analyzes EVs, found an average range loss of 20% in extreme cold... Lithium-ion batteries rely on chemical reactions that slow dramatically in cold weather. When temperatures plunge, the electrolyte thickens, ions move sluggishly, and charging becomes not just inefficient but potentially dangerous. Charging in cold weather has been identified as a primary cause of thermal acceleration, which can lead to fires... \nThe failure pattern repeats globally wherever cold weather meets inadequate infrastructure. Manufacturers, too, have acknowledged the problem. Chinese EV maker BYD's user manual, for instance, advises drivers to charge indoors",
        "id": 3574662,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/15/0035239/the-worlds-ev-owners-discover-unheated-batteries-lose-distance-in-freezing-weather?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The World's EV Owners Discover Unheated Batteries Lose Distance in Freezing Weather",
        "vote": 0
    }
]