[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T16:38:36.582673+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T15:30:26+00:00",
        "description": "As much as we talk about lighting in video games, especially with developments in ray-tracing and whatnot, darkness is as valuable a commodity as any other. Of course, the absence of sunlight is only one aspect that brings the night together – it's also about the atmosphere. One minute, you could be boundlessly free, exploring streets that would ordinarily be filled with people, and the other, gazing into the boundless darkness, searching desperately for any sign of light.\n\nDying Light has always been interesting in that sense because its streets, regardless of the game, are teeming with the undead. And when night falls, they can morph into Night Walkers, becoming much faster and more aggressive. For how much we – and many others - refer to it as a first-person survival horror with parkour, the core concept is much more straightforward: Do what you have to do while there's still light because once the sun goes down, things can and will go bump in the night.",
        "id": 3579870,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=lqRTHkOOul0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lqRTHkOOul0/hqdefault.jpg",
        "title": "How Dying Light: The Beast Redesigns ‘Night’ In Open Worlds And Why I Look Forward To Exploring it",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T14:06:46.983324+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T13:30:29+00:00",
        "description": "Want a simple co-op platformer with some brick-built aesthetics? Lego Voyagers may just be your jam. The game follows the life of two bricks as they wander around brick-built environments solving puzzles together. Such a charming and promising premise doesn’t quite translate into an equally engaging experience. \n\nWhile the Friend Pass system makes jumping in with a partner easy, the adventure itself feels lacking in some areas. It's a decent puzzle-platformer but the depth perception issues keep it from reaching greatness. Having said that, Lego Voyagers has an endearing concept and a friendly price.",
        "id": 3578412,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=MyD2DSOJHs0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 1,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MyD2DSOJHs0/hqdefault.jpg",
        "title": "Lego Voyagers Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-15T14:06:47.088222+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-15T13:30:20+00:00",
        "description": "There’s a special kind of tension that only horror games can create, the feeling that every creak, shadow, or whisper might be your undoing. To achieve that level of unease, immersion is everything, and few perspectives draw you in like first-person. \n\nSeeing the world directly through the protagonist’s eyes blurs the line between player and character, making every flicker of movement or sudden noise feel personal. While third-person viewpoints have their place, nothing matches the raw, heart-pounding shock of a scare delivered straight to your field of vision. \n\nThis video is a celebration of such intimate scares, gathering standout titles that showcase the many ways first-person horror can unsettle and surprise. Some of the games here are small, underappreciated gems, while others stand tall as modern classics. \n\nWhether you’re looking for atmospheric slow-burns or more action-packed experiences, these 15 first-person horror games deserve a spot on your must-play list.\n\nLink to prev",
        "id": 3578413,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=MlyX-FEfZqM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MlyX-FEfZqM/hqdefault.jpg",
        "title": "15 MORE CREEPIEST First Person Horror Games You Can't Afford To Miss",
        "vote": 0
    }
]