[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T23:21:41.693276+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T23:21:41+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Apple sent notifications this week to several people who the company believes were targeted with government spyware, according to two of the alleged targets. In the past, Apple has sent similar notifications to targets and victims of spyware, and directed them to contact a nonprofit that specializes in investigating such cyberattacks. Other tech companies, like Google and WhatsApp, have in recent years also periodically sent such notifications to their users. As of Wednesday, only two people appear to have come forward to reveal they were among those who received the notifications from Apple this week.\n \nOne is Ciro Pellegrino, an Italian journalist who works for online news outlet Fanpage. Pellegrino wrote in an article that he received an email and a text message from Apple on Tuesday notifying him that he was targeted with spyware. The message, according to Pellegrino, also said he wasn't the only person targeted. \"Today's notifi",
        "id": 2569720,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/30/2122233/apple-notifies-new-victims-of-spyware-attacks-across-the-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Notifies New Victims of Spyware Attacks Across the World",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T23:21:41.806490+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T23:21:41+00:00",
        "description": "A newly revealed set of vulnerabilities dubbed AirBorne in Apple's AirPlay SDK could allow attackers on the same Wi-Fi network to hijack tens of millions of third-party devices like smart TVs and speakers. While Apple has patched its own products, many third-party devices remain at risk, with the most severe (though unproven) threat being potential microphone access. 9to5Mac reports: Wired reports that a vulnerability in Apple's software development kit (SDK) means that tens of millions of those devices could be compromised by an attacker: \"On Tuesday, researchers from the cybersecurity firm Oligo revealed what they're calling AirBorne, a collection of vulnerabilities affecting AirPlay, Apple's proprietary radio-based protocol for local wireless communication. Bugs in Apple's AirPlay software development kit (SDK) for third-party devices would allow hackers to hijack gadgets like speakers, receivers, set-top boxes, or smart TVs if they're on the same Wi-Fi network as the hacker's mach",
        "id": 2569721,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/30/2115251/millions-of-airplay-devices-can-be-hacked-over-wi-fi?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Millions of AirPlay Devices Can Be Hacked Over Wi-Fi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T22:16:44.082663+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T22:16:43+00:00",
        "description": "Google is investing in training over 100,000 new U.S. electricians through a $10 million grant, aiming to address a critical labor shortage driven by AI-fueled data center growth and rising electricity demands. Reuters reports: A lack of access to power supplies has become the biggest problem for giant technology companies racing to develop artificial intelligence in energy-intensive data centers, which are driving up U.S. electricity demand after nearly 20 years of stagnation. The situation has led President Donald Trump to declare a national energy emergency aimed at speeding up permitting for generation and transmission projects.\n \nGoogle's funding, which includes a $10 million grant for electrical worker nonprofits, is the latest in a series of recent moves by giant technology companies to alleviate power project backlogs and electricity shortfalls across the United States. [...] The Google grant will be used for electrician apprenticeship programs and the training of existing wor",
        "id": 2569393,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/30/2112233/google-funding-electrician-training-as-ai-power-crunch-intensifies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Funding Electrician Training As AI Power Crunch Intensifies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T21:12:41.829851+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T21:12:41+00:00",
        "description": "NIST: Clocks on Earth are ticking a bit more regularly thanks to NIST-F4, a new atomic clock at the National Institute of Standards and Technology (NIST) campus in Boulder, Colorado. This month, NIST researchers published a journal article establishing NIST-F4 as one of the world's most accurate timekeepers. NIST has also submitted the clock for acceptance as a primary frequency standard by the International Bureau of Weights and Measures (BIPM), the body that oversees the world's time. \n\nNIST-F4 measures an unchanging frequency in the heart of cesium atoms, the internationally agreed-upon basis for defining the second since 1967. The clock is based on a \"fountain\" design that represents the gold standard of accuracy in timekeeping. NIST-F4 ticks at such a steady rate that if it had started running 100 million years ago, when dinosaurs roamed, it would be off by less than a second today. \n\nBy joining a small group of similarly elite time pieces run by just 10 countries around the worl",
        "id": 2568904,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/30/201234/new-atomic-fountain-clock-joins-elite-group-that-keeps-the-world-on-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Atomic Fountain Clock Joins Elite Group That Keeps the World on Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T21:12:41.708075+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T21:12:41+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Raspberry Pi boards have a combination of surface-mount devices (SMDs) and through-hole bits. SMDs allow for far more tiny chips, resistors, and other bits to be attached to boards by their tiny pins, flat contacts, solder balls, or other connections. For those things that are bigger, or subject to rough forces like clumsy human hands, through-hole soldering is still required, with leads poked through a connective hole and solder applied to connect and join them securely. The Raspberry Pi board has a 40-pin GPIO header on it that needs through-hole soldering, along with bits like the Ethernet and USB ports. These require robust solder joints, which can't be done the same way as with SMT (surface-mount technology) tools. \"In the early days of Raspberry Pi, these parts were inserted by hand, and later by robotic placement,\" writes Roger Thornton, director of applications for Raspberry Pi, in a blog post. The boards then had to go th",
        "id": 2568903,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/30/2056202/raspberry-pi-cuts-product-returns-by-50-by-changing-up-its-pin-soldering?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Raspberry Pi Cuts Product Returns By 50% By Changing Up Its Pin Soldering",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T17:56:45.881514+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T17:56:45+00:00",
        "description": "Finland has passed legislation to restrict the use of phones and other mobile devices during the school day amid fears over their impact on student wellbeing and learning. From a report: Under the changes, which were approved by the Finnish parliament on Tuesday and will come into effect on 1 August, mobile devices will be heavily restricted during lesson times. Pupils will be allowed to use them only with the teacher's permission for healthcare or learning purposes. \n\nFinland is the latest European country to impose legal restrictions on the use of phones and other mobile devices in schools amid growing evidence of their impact on children and young people, including attention and self-esteem. Earlier this year, Denmark said it would ban mobile phones from all schools. The chair of the country's wellbeing commission, Rasmus Meyer, told the Guardian the measure was necessary to stop schools from being \"colonised by digital platforms\" and urged the rest of Europe to follow suit.<p><div",
        "id": 2567427,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/30/1651213/finland-restricts-use-of-mobile-phones-during-school-day?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Finland Restricts Use of Mobile Phones During School Day",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T17:56:45.767899+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T17:56:45+00:00",
        "description": "Microsoft CEO Satya Nadella said that 20%-30% of code inside the company's repositories was \"written by software\" -- meaning AI -- during a fireside chat with Meta CEO Mark Zuckerberg at Meta's LlamaCon conference on Tuesday. From a report: Nadella gave the figure after Zuckerberg asked roughly how much of Microsoft's code is AI-generated today. The Microsoft CEO said the company was seeing mixed results in AI-generated code across different languages, with more progress in Python and less in C++.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+CEO+Says+Up+To+30%25+of+the+Company's+Code+Was+Written+by+AI%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F04%2F30%2F1735210%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F04%2F30",
        "id": 2567426,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/04/30/1735210/microsoft-ceo-says-up-to-30-of-the-companys-code-was-written-by-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft CEO Says Up To 30% of the Company's Code Was Written by AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T16:51:57.723280+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T16:51:57+00:00",
        "description": "Alphabet CEO Sundar Pichai told a judge who found that Google illegally monopolizes online search that a Justice Department proposal to share search data with rivals would be a \"de facto\" divestiture of the company's search engine. From a report: If Google were required to share both its search data and the information on how it ranks results, rivals could reverse engineer \"every aspect of our technology,\" Pichai testified on Wednesday. \n\n\"The proposal on data sharing is so far reaching, so extraordinary,\" Pichai said. It \"feels like de facto divestiture of search\" and its entire intellectual property and technology over 25 years of research, he said. During testimony in federal court in Washington, Pichai asserted that a package of antitrust remedies proposed by the government is too extreme and will undermine Google's ability to compete in the market.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google's+Sundar+",
        "id": 2566738,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/30/1540245/googles-sundar-pichai-calls-us-remedies-de-facto-spinoff-of-search?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's Sundar Pichai Calls US Remedies 'De Facto' Spinoff of Search",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T15:47:40.050379+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T15:47:39+00:00",
        "description": "Electronic Arts is laying off hundreds of workers and canceling a Titanfall game that was in development at its Respawn Entertainment subsidiary. From a report: Between 300 and 400 positions were eliminated, including around 100 at Respawn, according to a person familiar with the cuts. The company had about 13,700 employees at the end of March 2024. \n\n\"As part of our continued focus on our long-term strategic priorities, we've made select changes within our organization that more effectively aligns teams and allocates resources in service of driving future growth,\" Justin Higgs, a spokesman for the Redwood City, California-based company, said in a statement. \n\nThe canceled project, code-named R7, was an extraction shooter set in the Titanfall universe, according to people familiar with its development. It was not close to being released.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Electronic+Arts+Lays+Off+Hundred",
        "id": 2565829,
        "language": null,
        "link": "https://games.slashdot.org/story/25/04/30/1441229/electronic-arts-lays-off-hundreds-cancels-titanfall-game?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Electronic Arts Lays Off Hundreds, Cancels 'Titanfall' Game",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T15:47:40.162577+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T15:47:39+00:00",
        "description": "Microsoft has pledged to take the US government to court if necessary [alternative source] to protect European customers' access to its cloud services, as concerns mount over potential technology disruptions under President Donald Trump. Brad Smith, Microsoft's president and vice-chair, announced five \"digital commitments\" to Europe on Wednesday, responding to regional anxieties following Trump's temporary suspension of military support to Ukraine. \n\n\"We as a company need to be a source of digital stability during a period of geopolitical volatility,\" Smith said. The commitments include contesting any government order to cease European cloud services through legal channels and establishing European oversight of its continental operations. Microsoft will increase its European data center capacity by 40% over the next two years, expanding in 16 countries with investments of \"tens of billions of dollars\" annually. The Seattle-based company, which derives more than a quarter of its busine",
        "id": 2565830,
        "language": null,
        "link": "https://slashdot.org/story/25/04/30/1322253/microsoft-vows-legal-fight-against-us-to-protect-european-cloud-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Vows Legal Fight Against US To Protect European Cloud Customers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T15:47:39.935614+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T15:47:39+00:00",
        "description": "Wikipedia will employ AI to enhance the work of its editors and volunteers, it said Wednesday, also asserting that it has no plans to replace those human roles. The Wikimedia Foundation plans to implement AI specifically for automating tedious tasks, improving information discovery, facilitating translations, and supporting new volunteer onboarding, it said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wikipedia+To+Use+AI%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F04%2F30%2F1518223%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F04%2F30%2F1518223%2Fwikipedia-to-use-ai%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/25/0",
        "id": 2565828,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/30/1518223/wikipedia-to-use-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wikipedia To Use AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T13:15:43.960165+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T13:15:43+00:00",
        "description": "An anonymous reader quotes a report from The Register: Instead of depressing wages or taking jobs, generative AI chatbots like ChatGPT, Claude, and Gemini have had almost no wage or labor impact so far -- a finding that calls into question the huge capital expenditures required to create and run AI models. In a working paper released earlier this month, economists Anders Humlum and Emilie Vestergaard looked at the labor market impact of AI chatbots on 11 occupations, covering 25,000 workers and 7,000 workplaces in Denmark in 2023 and 2024.\n \nMany of these occupations have been described as being vulnerable to AI: accountants, customer support specialists, financial advisors, HR professionals, IT support specialists, journalists, legal professionals, marketing professionals, office clerks, software developers, and teachers. Yet after Humlum, assistant professor of economics at the Booth School of Business, University of Chicago, and Vestergaard, a PhD student at the University of Copen",
        "id": 2564890,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/29/2341207/gen-ai-is-not-replacing-jobs-or-hurting-wages-at-all-say-economists?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gen AI Is Not Replacing Jobs Or Hurting Wages At All, Say Economists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T10:40:43.122759+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T10:40:42+00:00",
        "description": "Firefly Aerospace's sixth Alpha rocket launch failed on April 29, 2025, after an upper-stage anomaly prevented a Lockheed Martin satellite demo from reaching orbit. Both the stage and payload fell into the Pacific Ocean near Antarctica. Space.com reports: The two-stage, 96.7-foot-tall (29.6 meters) Alpha lifted off from California's Vandenberg Space Force Base this morning (April 29), carrying a technology demonstration for aerospace giant Lockheed Martin toward low Earth orbit (LEO). But the payload never got there. Alpha suffered an anomaly shortly after its two stages separated, which led to the loss of the nozzle extension for the upper stage's single Lightning engine. This significantly reduced the engine's thrust, dooming the mission, Firefly said in an update several hours after launch.\n \nToday's mission, which Firefly called \"Message in a Booster,\" was the first of up to 25 that the company will conduct for Lockheed Martin over the next five years. The flight aimed to send a s",
        "id": 2563591,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/29/2350236/firefly-aerospaces-alpha-rocket-fails-sends-satellite-falling-into-ocean?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Firefly Aerospace's Alpha Rocket Fails, Sends Satellite Falling Into Ocean",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T07:25:42.228206+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T07:25:42+00:00",
        "description": "Kosmos 482, a failed Soviet Venus probe, is expected to make an uncontrolled reentry in mid-May after orbiting Earth for 53 years. Gizmodo reports: The lander module from an old Soviet spacecraft is expected to reenter Earth's atmosphere during the second week of May, according to Marco Langbroek, a satellite tracker based in Leiden, the Netherlands. \"As this is a lander that was designed to survive passage through the Venus atmosphere, it is possible that it will survive reentry through the Earth atmosphere intact, and impact intact,\" Langbroek wrote in a blog update. \"The risks involved are not particularly high, but not zero.\"\n \nKosmos 482 launched on March 31, 1972 from the Baikonur Cosmodrome spaceport in Kazakhstan. The mission was an attempt by the Soviet space program to reach Venus, but it failed to gain enough velocity to enter a transfer trajectory toward the scorching-hot planet. A malfunction resulted in an engine burn that wasn't sufficient to reach Venus' orbit and left",
        "id": 2562569,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/29/2321232/after-53-years-a-failed-soviet-venus-spacecraft-is-crashing-back-to-earth?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After 53 Years, a Failed Soviet Venus Spacecraft Is Crashing Back to Earth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T04:10:44.319062+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T04:10:44+00:00",
        "description": "An anonymous reader quotes a report from The Hill: Daily exposure to certain chemicals used to manufacture household plastics may be connected to more than 356,000 cardiovascular-related deaths in 2018 alone, a new analysis has found. These chemicals, called phthalates, are present in products around the world but have particular popularity in the Middle East, South Asia, East Asia and the Pacific -- regions that collectively bore about 75 percent of the global death total, according to the research, published on Tuesday in the Lancet eBioMedicine.\n \nPhthalates, often used in personal care products, children's toys and food packaging and processing materials, are known to disrupt hormone function and have been linked to birth defects, infertility, learning disabilities and neurological disorders. The NYU Langone Health team focused in the analysis on a kind of phthalate called di-2-ethylhexyl phthalate (DEHP), which is used to make items like food containers and medical equipment soft",
        "id": 2561759,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/29/238206/chemical-in-plastics-linked-to-350000-heart-disease-deaths?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chemical In Plastics Linked To 350,000 Heart Disease Deaths",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T00:55:41.496921+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T00:55:41+00:00",
        "description": "Google Play's app marketplace has seen a dramatic 47% drop in available apps\n -- from 3.4 million to 1.8 million -- since the start of 2024. An analysis by app intelligence provider Appfigures attributes the decline to stricter quality standards, expanded human reviews, and increased enforcement against low-quality and deceptive apps. TechCrunch reports: In July 2024, Google announced it would raise the minimum quality requirements for apps, which may have impacted the number of available Play Store app listings.\n \nInstead of only banning broken apps that crashed, wouldn't install, or run properly, the company said it would begin banning apps that demonstrated \"limited functionality and content.\" That included static apps without app-specific features, such as text-only apps or PDF file apps. It also included apps that provided little content, like those that only offered a single wallpaper. Additionally, Google banned apps that were designed to do nothing or have no function, which m",
        "id": 2561036,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/29/2256200/google-play-sees-47-decline-in-apps-since-start-of-last-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Play Sees 47% Decline In Apps Since Start of Last Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T00:55:41.612438+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T00:55:41+00:00",
        "description": "Ars Technica's Andrew Cunningham reports: Intel's oddball Core Ultra 200V laptop chips -- codenamed Lunar Lake -- will apparently be a one-off experiment, not to be replicated in future Intel laptop chips. They're Intel's only processors with memory integrated onto the CPU package; the only ones with a neural processing unit that meets Microsoft's Copilot+ performance requirements; and the only ones with Intel's best-performing integrated GPUs, the Intel Arc 130V and 140V.\n \nToday, Intel announced some updates to its graphics driver that specifically benefit those integrated GPUs, welcome news for anyone who bought one and is trying to get by with it as an entry-level gaming system. Intel says that version 32.0.101.6734 of its graphics driver can speed up average frame rates in some games by around 10 percent, and can speed up \"1 percent low FPS\" (that is, for any given frames per second measurement, whatever your frame rate is the slowest 1 percent of the time) by as much as 25 perce",
        "id": 2561037,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/29/2247217/intel-says-its-rolling-out-laptop-gpu-drivers-with-10-to-25-better-performance?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Says It's Rolling Out Laptop GPU Drivers With 10% To 25% Better Performance",
        "vote": 0
    }
]