[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T20:55:51.784066+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T20:00:17+00:00",
        "description": "MotoGP 25 delivers a  realistic racing experience, with excellent physics and a wide range of modes including Career, Grand Prix, and MotoGP Academy. The motorcycles look great, weather effects are excellent, and customization options are deep enough to keep fans busy for hours. \n\nHowever, the game still struggles with awful commentary, underwhelming career production values, and disappointing off-track visuals. PC Performance is mostly stable, with occasional dips in heavy rain. \n\nDespite these flaws, MotoGP 25 stands as one of the best entries in the series.",
        "id": 2568760,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ZZuAK_pMAFE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZZuAK_pMAFE/hqdefault.jpg",
        "title": "MotoGP 25 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T18:45:55.043030+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T18:00:51+00:00",
        "description": "When it launched in 2011, The Elder Scrolls 5: Skyrim was deemed an instant masterpiece (and for good reason), with the open world action RPG somehow outmatching and outdoing even the unprecedented highs of its predecessor. \n\nThat wasn’t a mean feat either. After all, The Elder Scrolls 4: Oblivion was, in its own right, an unabashed masterpiece, a seminal title that served as a landmark RPG, and a foundational experience that showed what an open world game of the nascent HD era could look and play like. For Skyrim to deliver an experience that scaled heights that were somehow even loftier wasn’t an achievement that could be overlooked- and, of course, it wasn’t.",
        "id": 2567775,
        "language": null,
        "link": "https://www.youtube.com/watch?v=rHYQLm3jkTM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rHYQLm3jkTM/hqdefault.jpg",
        "title": "You May Not Agree, But As An RPG, The Elder Scrolls 4: Oblivion Remastered Is Better Than Skyrim...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T15:34:55.148868+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T14:01:23+00:00",
        "description": "Clair Obscur: Expedition 33 launched on April 24th for Xbox Series X/S, PS5, and PC, and there were honest fears it would get lost in the shuffle due to The Elder Scrolls 4: Oblivion Remastered. Not only was this not the case, as it sold one million copies in just three days, but it's also making waves.\n\nUniversal acclaim from critics, praise from other developers - the fact that only a few dozen developers worked on this stunning role-playing game is attracting attention. While more people are involved beyond the core development team, why can't the triple-A games industry consistently deliver such experiences?\n\nWhy are publishers with much higher budgets and larger teams incapable of getting their act together? Why take the live-service gambles only for them to come crashing down? Regardless of how you feel about the matter, there's no denying that Clair Obscur: Expedition 33 makes an extensive amount of big triple-A titles look downright embarrassing.",
        "id": 2565247,
        "language": null,
        "link": "https://www.youtube.com/watch?v=wFYsG5h0nCs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wFYsG5h0nCs/hqdefault.jpg",
        "title": "Clair Obscur: Expedition 33 Is EMBARRASSING The Games Industry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-30T06:46:19.684256+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-30T06:30:20+00:00",
        "description": "April saw some pretty big heavy hitters like Clair Obscur: Expedition 33 and The Elder Scrolls 4: Oblivion Remastered, and May keeps the momentum rolling. There are several follow-ups to look forward to, none more so than id Software's DOOM: The Dark Ages. As a prequel to DOOM (2016), it offers a glimpse into the rise of the Doom Slayer and their wars in Argent D'Nur.\n\nOn the multiplayer front, FromSoftware is stepping into unknown territory with Elden Ring Nightreign. Three players can team up to battle the Night Lord, surviving for three nights until the event showdown, in a mix of battle royale and co-op PvE. Then you have Lost Soul Aside, finally launching after over a decade in development.\n\nOf course, there are indie sequels like Revenge of the Savage Planet and Spirit of the North 2 to look forward to, alongside newer properties like Deliver At All Costs. Check out all the new titles launching in May 2025.",
        "id": 2562483,
        "language": null,
        "link": "https://www.youtube.com/watch?v=LV2xH8Ckl-w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LV2xH8Ckl-w/hqdefault.jpg",
        "title": "15 BIGGEST Games of May 2025 You Can't Afford To Miss [PS5, Xbox, PC, Switch]",
        "vote": 0
    }
]