[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T17:01:30.020912+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T16:00:18+00:00",
        "description": "This session delves into how The Coalition, the home of the Gears of War franchise, migrated key infrastructure and workflows to the cloud. Learn about the development challenges the team faced with traditional on-premise infrastructure and the need for a more scalable and efficient solution, especially when working with development partners on UE5. \n\nPhil Cousins of The Coalition walks you through the migration process, showcasing specific technologies like Unreal Cloud DDC, Compute (code and shaders), CI/CD and their Pre-Submit Validation System. The session touches on topics like leveling up the team's cloud knowledge, making security a priority, dealing with user management, the need for a non-VPN solution, and how the team gathers and monitors user telemetry to improve development efficiency. Finally, he shares key learnings and recommendations from the migration process, emphasizing the importance of planning, collaboration, and embracing a cloud-first approach to development.",
        "id": 3375817,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BYAiKIgVNHM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BYAiKIgVNHM/hqdefault.jpg",
        "title": "Migrating Unreal Engine Infrastructure and Workflows to Azure | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T14:50:27.820492+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T14:01:26+00:00",
        "description": "As real-time rendering becomes more demanding, balancing high-quality visuals with optimal performance is crucial for game developers, and lighting plays a pivotal role in immersion and gameplay. In this session, Paulo Corona of Creators Corp introduces you to the Lighting Scalability Manager, a tool and workflow designed to help creators balance lighting for different platforms and settings without sacrificing visual fidelity.  \n\nAttendees will discover techniques to manage lighting complexity in Unreal Editor for Fortnite (UEFN) projects, ensuring a consistent experience across devices, from high-end PCs to mobile platforms. Examples illustrate how to: hide and show lights and Post Process Volumes based on specific scalability settings; customize and optimize lighting per platform and situation; and ensure seamless transitions between quality tiers.  \n\nWhether you're an experienced developer or new to UEFN, this session aims to help you elevate your projects by balancing visual qual",
        "id": 3374457,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wnIxwIPGMu8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wnIxwIPGMu8/hqdefault.jpg",
        "title": "Lighting Scalability Manager: Balancing Lighting on UEFN | Unreal Fest Orlando 2025",
        "vote": 0
    }
]