[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T23:38:21.364173+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T23:20:00+00:00",
        "description": "An anonymous reader quotes a report from The Verge's Victoria Song: The original Pixel Watch was late to the game. For years, there had been rumors of a Google smartwatch that never materialized. Then, when it finally arrived, it was a quintessential first-gen device, with thicc bezels, dismal battery life, and a host of quirks that needed ironing out. My DMs were full of people wondering when the watch would be unceremoniously dumped into Google's infamous product graveyard. A part of me wondered if Google was going to spend the next decade playing catch-up. Fast forward to 2025, and I'm holding the Pixel Watch 4 at Google's office in New York City. On the surface (and my wrist), it doesn't look like much has changed. But after fiddling with a few menus, watching some demos, and talking over the updates, it's evident that Google has a clear vision about where smartwatches are going. [...]\n \nStarting with hardware, the Pixel Watch 4 has a new domed \"Actua 360\" display -- as in, the di",
        "id": 3378937,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/20/2113247/googles-pixel-watch-4-has-a-big-focus-on-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's Pixel Watch 4 Has a Big Focus On AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T23:38:21.540030+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T22:40:00+00:00",
        "description": "Two Harvard dropouts are launching Halo X, a $249 pair of AI-powered smart glasses that continuously listen, record, and transcribe conversations while displaying real-time information to the wearer. \"Our goal is to make glasses that make you super intelligent the moment you put them on,\" said AnhPhu Nguyen, co-founder of Halo. Co-founder Caine Ardayfio said the glasses \"give you infinite memory.\"\n \n\"The AI listens to every conversation you have and uses that knowledge to tell you what to say ... kinda like IRL Cluely,\" Ardayfio told TechCrunch. \"If somebody says a complex word or asks you a question, like, 'What's 37 to the third power?' or something like that, then it'll pop up on the glasses.\" From the report: Ardayfio and Nguyen have raised $1 million to develop the glasses, led by Pillar VC, with support from Soma Capital, Village Global, and Morningside Venture. The glasses will be priced at $249 and will be available for preorder starting Wednesday. Ardayfio called the glasses ",
        "id": 3378938,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/20/2058229/harvard-dropouts-to-launch-always-on-ai-smart-glasses-that-listen-record-every-conversation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Harvard Dropouts To Launch 'Always On' AI Smart Glasses That Listen, Record Every Conversation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T22:33:35.819650+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T22:02:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: After the Trump administration confirmed a rumor that the US is planning to buy a 10 percent stake in Intel, US Senator Bernie Sanders (I-Vt.) came forward Wednesday to voice support for the highly unusual plan, finding rare common ground with Donald Trump. According to Commerce Secretary Howard Lutnick, the plan would see the US disbursing approved CHIPS Act grants only after acquiring non-voting shares of Intel and likely other chipmakers. That would allow the US to profit off its investment in chipmakers, Lutnick suggested, and Sanders told Reuters that he agreed American taxpayers could benefit from the potential deals.\n \n\"If microchip companies make a profit from the generous grants they receive from the federal government, the taxpayers of America have a right to a reasonable return on that investment,\" Sanders said. While Lutnick gave Trump credit for coming up with what White House Press Secretary Karoline Leavitt describe",
        "id": 3378587,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/20/2051231/trump-confirms-us-is-seeking-10-stake-in-intel?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Confirms US Is Seeking 10% Stake In Intel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T22:33:35.996759+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T21:25:00+00:00",
        "description": "Google announced Gemini for Home, a new AI-powered voice assistant that will replace Google Assistant on Nest smart speakers and displays starting in October. Powered by Gemini's advanced reasoning and conversational capabilities, it promises more natural interactions, complex task handling, and features like Gemini Live for back-and-forth conversations. The Verge reports: According to a blog post by Anish Kattukaran, chief product officer of Google Home and Nest, using Gemini for Home will \"feel fundamentally new.\" He says the new voice assistant leverages the \"advanced reasoning, inference and search capabilities\" of Google's AI models, along with adaptations for the home that allow for more natural interactions to complete more complex tasks. In short, it should be an assistant that can better understand context, nuance, and intention -- a complete change from its predecessor.\n \nFor example, Kattukaran says Gemini for Home can accurately respond to requests like \"turn off the light",
        "id": 3378588,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/20/2044250/gemini-for-home-is-googles-biggest-smart-home-play-in-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gemini For Home Is Google's Biggest Smart Home Play In Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T21:28:26.936142+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T20:44:00+00:00",
        "description": "Amazon is plotting a big change to its Fire tablet lineup following years of escalating gripes from consumers and app developers over the company's homegrown operating system. Reuters: As part of a project known internally as Kittyhawk, Amazon plans to release a higher-end tablet as soon as next year offering the Android operating system software for the first time, according to six people familiar with the matter. Since the Fire tablet's introduction in 2011, Amazon has used what is known as a \"forked\" version of Android with custom modifications that make it work like a unique operating system. \n\n[...] The first Amazon Android tablet, slated for next year, will be pricier than current models, the people said. One of them said Amazon had discussed a $400 price tag, nearly double the cost of its current higher-end $230 Fire Max 11 tablet. IPads, by comparison, range from $350 to $1,200. Reuters could not learn additional specifications for the planned Amazon tablet, such as screen siz",
        "id": 3378235,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/20/201240/amazon-looks-to-ditch-homegrown-software-for-android-in-fire-tablet-revamp?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Looks To Ditch Homegrown Software For Android in Fire Tablet Revamp",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T20:23:35.764248+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T20:05:00+00:00",
        "description": "Abu Dhabi is gathering the DNA of Emirati newborns in a significant expansion of a national genomic sequencing project that aims to put the UAE on the cutting-edge of health care. From a report: The UAE capital has so far mapped the genomes of 68% of Emirati citizens, a spokesperson for M42, the firm running the program, told Semafor, while at-birth sequencing is being offered to parents on a voluntary basis across several hospitals, and aims to detect over 800 treatable childhood genetic conditions. Only around 1% of the world's mapped genomes are of Arab descent. The UAE is looking to address the gap while tackling public health issues and expanding personalized health care offerings.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UAE+Adds+Newborns+To+Major+Genome+Project%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F08%2F20%2F1948219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.c",
        "id": 3377693,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/20/1948219/uae-adds-newborns-to-major-genome-project?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UAE Adds Newborns To Major Genome Project",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T20:23:35.983895+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T19:25:00+00:00",
        "description": "Windows 11 users will receive significant UI refinements and AI improvements starting next month as Microsoft prepares its September feature drop followed by additional updates through fall. The update, Windows Central reports, will bring customizable lock screen widgets globally after months of European exclusivity, photo grid views in Windows Search, and a redesigned Windows Hello authentication interface. \n\nCopilot+ PCs will gain a revamped Recall application with workflow suggestions and File Explorer AI integration through Click To Do. October and November releases will introduce a larger, customizable Start menu allowing removal of the Recommended section and expanded dark mode support for legacy File Explorer dialogs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Readies+Big+Feature+Updates+For+Next+Month+and+Beyond%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F20%2F192259%2F%3Futm_source%",
        "id": 3377694,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/20/192259/microsoft-readies-big-feature-updates-for-next-month-and-beyond?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Readies Big Feature Updates For Next Month and Beyond",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T19:19:42.535898+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T18:45:00+00:00",
        "description": "AI-powered salespeople are outperforming their human counterparts on Chinese e-commerce platforms, working around the clock without fatigue to sell products ranging from printers to wet wipes. Shanghai marketing firm PLTFRM has deployed 30 virtual avatars across Taobao and Pinduoduo using Baidu video models and DeepSeek language models. Brother's AI avatar generated $2,500 in printer sales within two hours and increased livestream revenue 30 percent. The company now checks overnight AI sales data each morning as routine. \n\nLivestreaming drives over one-third of China's e-commerce sales, with half the population shopping via broadcast in 2024. Baidu's June livestream featuring an AI version of influencer Luo Yonghao drew 13 million views and generated $7.7 million in sales. American and European companies have expressed interest, Wired reports, after PLTFRM successfully tested English-language avatars on YouTube, TikTok, and Facebook.<p><div class=\"share_submission\" style=\"position:rel",
        "id": 3377180,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/20/1844240/chinese-virtual-human-salespeople-are-outperforming-their-real-human-counterparts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese 'Virtual Human' Salespeople Are Outperforming Their Real Human Counterparts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T18:15:06.531840+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T18:00:00+00:00",
        "description": "FTC, in a press release Wednesday: The Federal Trade Commission today sued the operators of LA Fitness and other gyms over allegations they make it exceedingly difficult for consumers to cancel their gym memberships and related services that continued indefinitely unless cancelled. The agency is seeking a court order prohibiting the allegedly unfair conduct and money back for consumers harmed by the difficulty in cancelling memberships. \n\n\"The FTC's complaint describes a scenario that too many Americans have experienced -- a gym membership that seems impossible to cancel,\" said Christopher Mufarrige, Director of the Bureau of Consumer Protection. \"Tens of thousands of LA Fitness customers reported difficulties -- cancellation was often restricted to specific times or required speaking to specific managers who were often not present or available. The FTC will not hesitate to act on behalf of consumers when it believes companies are stifling consumers' ability to choose which recurring ",
        "id": 3376698,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/20/180201/ftc-sues-la-fitness-for-making-it-difficult-for-consumers-to-cancel-gym-memberships?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FTC Sues LA Fitness For Making it Difficult for Consumers To Cancel Gym Memberships",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T18:15:06.715781+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T17:25:00+00:00",
        "description": "India has moved a legislation to ban online money gaming due to rising instances of addiction, money laundering and financial frauds through these apps. From a report: A bill passed in the lower house of Parliament on Wednesday seeks to prohibit promotion and operation of gaming apps that require users to pay money for the chance to win cash. The move threatens India's $3.8 billion gaming industry that has drawn global investors and also fostered homegrown fantasy sports betting apps such as Dream11, Games24X7 and Mobile Premier League. \n\n\"People lose their life's savings in online money gaming,\" India's Minister for Information and Broadcasting Ashwini Vaishnaw told lawmakers in New Delhi. He said the government intends to curb the addiction and financial harm that comes with online money gaming, but will promote e-sports and social gaming.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=India+Seeks+Ban+on+Online+Be",
        "id": 3376699,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/20/1718225/india-seeks-ban-on-online-betting-apps-to-curb-addiction?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India Seeks Ban on Online Betting Apps To Curb Addiction",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T17:09:31.836302+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T16:51:00+00:00",
        "description": "Google announced its Pixel 10 smartphone lineup today, introducing the Tensor G5 processor and Qi2 magnetic wireless charging across four models priced from $799 to $1,799. The base Pixel 10 adds a 5x telephoto lens for the first time at $799. The Pixel 10 Pro maintains its $999 starting price in a 6.3-inch size while the Pro XL starts at $1,199 for the 6.8-inch variant. \n\nThe $1,799 Pixel 10 Pro Fold becomes the first foldable phone to achieve IP68 water and dust resistance through a redesigned gearless hinge. All models feature 3,000-nit peak brightness displays, Android 16, and Google's Material 3 Expressive interface redesign. The Tensor G5 enables on-device AI features including Magic Cue for contextual information retrieval and Camera Coach for photography guidance. Pro models gain 100x hybrid zoom capabilities through computational photography. Preorders begin today for August 28 availability, except the Pro Fold which ships October 9.<p><div class=\"share_submission\" style=\"pos",
        "id": 3376038,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/20/1651216/google-refreshes-pixel-lineup-with-tensor-g5-and-qi2-charging-across-four-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Refreshes Pixel Lineup With Tensor G5 and Qi2 Charging Across Four Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T17:09:32.014639+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T16:01:00+00:00",
        "description": "Sony will increase PlayStation 5 console prices by $50 across all models in the United States starting August 21. The standard PS5 rises to $550, the Digital Edition to $500, and the PS5 Pro to $750. The company cited navigating a challenging economic environment for the increases.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sony+Raises+PS5+Prices+by+%2450+Across+All+Models+in+US%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F08%2F20%2F1528221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F08%2F20%2F1528221%2Fsony-raises-ps5-prices-by-50-across-all-models-in-us%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://games.slashdot.org/story/25/08/20/1",
        "id": 3376039,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/20/1528221/sony-raises-ps5-prices-by-50-across-all-models-in-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sony Raises PS5 Prices by $50 Across All Models in US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T16:03:37.807865+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T15:22:00+00:00",
        "description": "In a pair of class actions filed this week, passengers from each coast quibbled with United Airlines and Delta Air Lines' policies charging extra for window seats that are not actually beside windows, instead offering a view of a blank aircraft wall. From a report: \"Delta indicated to the plaintiff and class members that the particular seats they chose had a 'window'; even though Delta knew full well they did not,\" the plaintiffs taking on Delta said in an 18-page complaint filed in federal court in New York, accusing the airline of false advertising and deceptive business practices. \n\nHalf of Delta's fleet of nearly 1,000 aircraft comprises Boeing 737s, Boeing 757s and Airbus A321s -- all of which have at least one wall-adjacent seat with no window, according to the plaintiffs. It's where vertical air conditioning riser ducts are located, making putting a window there impossible, the competing Alaska Airlines explains on its website. But unlike Alaska and others, the plaintiffs compl",
        "id": 3375248,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/20/1452208/passengers-sue-delta-united-over-windowless-window-seats?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Passengers Sue Delta, United Over Windowless 'Window Seats'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T14:59:14.696490+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T14:40:00+00:00",
        "description": "An analysis of Rotten Tomatoes data reveals average Tomatometer scores have climbed steadily since Fandango's 2016 acquisition of the review aggregation platform. The average number of reviewers per mainstream film release increased by 40 to 70 critics following the purchase. New additions to the critic pool include smaller outlets such as Denerstein Unleashed and KKFI-FM Kansas City. Prior to 2016, critic and audience scores demonstrated stable correlation year-over-year. Post-acquisition data shows the two metrics diverged sharply as Tomatometer ratings rose. \n\nFandango, America's largest movie-ticketing platform, is partially owned by NBCUniversal and Warner Bros. Discovery. In 2023 Vulture reported PR firms court reviewers from smaller outlets to secure higher Tomatometer scores before film releases.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Is+Rotten+Tomatoes+Still+Reliable%3F+A+Statistical+Analysis%3A+htt",
        "id": 3374640,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/08/20/1436205/is-rotten-tomatoes-still-reliable-a-statistical-analysis?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is Rotten Tomatoes Still Reliable? A Statistical Analysis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T14:59:14.901778+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T14:01:00+00:00",
        "description": "Microsoft is testing a COPILOT function in Excel that uses OpenAI's gpt-4.1-mini model to automatically fill spreadsheet cells through natural language prompts. The function can classify feedback, generate summaries, and create tables based on specified cell ranges. Microsoft warns against using the AI function for numerical calculations or scenarios involving legal, regulatory, and compliance implications because COPILOT \"can give incorrect responses.\" The feature processes up to 100 functions every 10 minutes and cannot access information outside the spreadsheet.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Warns+Excel's+New+AI+Function+'Can+Give+Incorrect+Responses'+in+High-Stakes+Scenarios%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F08%2F20%2F128217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.f",
        "id": 3374641,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/20/128217/microsoft-warns-excels-new-ai-function-can-give-incorrect-responses-in-high-stakes-scenarios?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Warns Excel's New AI Function 'Can Give Incorrect Responses' in High-Stakes Scenarios",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T13:25:20.904158+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T12:30:00+00:00",
        "description": "The melting of sea ice in the Arctic has slowed dramatically in the past 20 years, scientists have reported, with no statistically significant decline in its extent since 2005. From a report: The finding is surprising, the researchers say, given that carbon emissions from fossil fuel burning have continued to rise and trap ever more heat over that time. They said natural variations in ocean currents that limit ice melting had probably balanced out the continuing rise in global temperatures. However, they said this was only a temporary reprieve and melting was highly likely to start again at about double the long-term rate at some point in the next five to 10 years. \n\nThe findings do not mean Arctic sea ice is rebounding. Sea ice area in September, when it reaches its annual minimum, has halved since 1979, when satellite measurements began. The climate crisis remains \"unequivocally real,\" the scientists said, and the need for urgent action to avoid the worst impacts remains unchanged. ",
        "id": 3373867,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/20/1155233/dramatic-slowdown-in-melting-of-arctic-sea-ice-surprises-scientists?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dramatic Slowdown in Melting of Arctic Sea Ice Surprises Scientists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T08:32:12.388385+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T08:30:00+00:00",
        "description": "US tech stocks sold off as warnings that the hype surrounding AI could be overdone hit some of the year's best-performing shares. From a report: Nvidia, the chips group that has surged to become the world's first $4tn company on the back of AI, fell 3.5 per cent on Tuesday, while software group Palantir dropped 9.4 per cent and chip designer Arm shed 5 per cent. \n\nThe tech-heavy Nasdaq Composite closed down 1.4 per cent, the biggest one-day drop for the index since August 1. The blue-chip S&amp;P 500 fell 0.7 per cent. European and Asian markets largely followed Wall Street lower on Wednesday. [...] Japan's Nikkei 225 index fell 1.5 per cent and South Korea's Kospi slipped 0.6 per cent. Futures price indicated moderate declines when Wall Street opens. \n\nTraders pinned some of the declines in the US on a critical report on Monday authored by a branch of the Massachusetts Institute of Technology. Researchers said \"95 per cent of organisations are getting zero return\" from their investme",
        "id": 3371930,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/20/0821214/us-tech-stocks-hit-by-concerns-over-future-of-ai-boom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Tech Stocks Hit By Concerns Over Future of AI Boom",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T05:16:27.284125+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T05:00:00+00:00",
        "description": "India Dispatch: The strongest case for India is not merely that it is young, but that it still has time, and it may be the only continental-scale economy that still has it in abundance. India won't cross the demographic threshold for an \"old\" country -- a median age of 41 -- until the late 2050s, while China reaches that point now. India requires 10.4% sustained GDP growth over 35 years to become rich before aging, compared to China's needed 32% annual growth rate. India's working-age population will increase from 67.5% in 2021 to 69.2% by 2031, with the median age remaining at 34.5 in 2036. The report adds: China's compressed dilemma mirrors what is gripping the developed world, where Europe's share of population over 65 is on track to hit 30% by 2050, up from 8% in 1950. Raising retirement ages -- what economists describe as the closest thing to a silver bullet -- faces older voting blocs, who now make up roughly 40% of those who turn up at the polls in European elections. In the U.",
        "id": 3371155,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/19/2356238/indias-got-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India's Got Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T03:06:38.940213+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T02:32:00+00:00",
        "description": "An anonymous reader shares a report: Apple is manufacturing more of its iPhone 17 phones for the US in India instead of in China, and for the first time, the full lineup of new models will ship from India at launch, according to Bloomberg. The company is also working on a successor to the iPhone 16E that it plans to make in India, Bloomberg says. \n\nApple has increasingly been moving iPhone production to India to reduce its dependence on manufacturing in China. The company already expects to pay $1.1 billion in tariffs for the current quarter, but Bloomberg reports that currently, Apple's exports of iPhones to the US from India are exempted from tariffs. That's despite the Trump administration's 50 percent tariff on many imports from India, and while analyst Patrick Moorhead says the move \"does dodge some tariffs,\" he noted that iPhone subassemblies are still mostly produced in China then shipped to India for final assembly.<p><div class=\"share_submission\" style=\"position:relative;\">\n<",
        "id": 3370673,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/08/19/2351234/apple-is-reportedly-making-more-of-its-new-iphones-in-india-instead-of-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple is Reportedly Making More of Its New iPhones in India Instead of China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-20T00:56:46.072486+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-20T00:30:00+00:00",
        "description": "Electricity prices have increased at more than double the inflation rate over the past year, according to NPR reporting. Florida Power &amp; Light customers face monthly bills exceeding $400 during summer months, prompting the utility to seek a 13% rate increase over four years that drew tens of thousands of petition signatures in opposition. \n\nThe Energy Department projects data centers will consume more electricity than residential customers for the first time in 2026. Natural gas costs for power generation rose 40% in the first half of 2025 compared to 2024, and the department expects another 17% increase next year. Natural gas generates more than 40% of U.S. electricity. One in six households currently struggles to pay electric bills. The federal government provides $4 billion annually in energy assistance for low-income families. \n\nFurther reading: Big Tech's AI Data Centers Are Driving Up Electricity Bills for Everyone.<p><div class=\"share_submission\" style=\"position:relative;\">",
        "id": 3370194,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/19/2347235/electricity-prices-are-climbing-more-than-twice-as-fast-as-inflation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Electricity Prices Are Climbing More Than Twice as Fast as Inflation",
        "vote": 0
    }
]