[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T23:00:11.179368+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T22:48:00+00:00",
        "description": "Long-time Slashdot reader fjo3 shares an announcement from the U.S.-based nonprofit Consumer Reports:\n\n\nProtein powders still carry troubling levels of toxic heavy metals, according to a new Consumer Reports (CR) investigation. Our latest tests of 23 protein powders and ready-to-drink shakes from popular brands found that heavy metal contamination has become even more common among protein products, raising concerns that the risks are growing right alongside the industry itself. For more than two-thirds of the products we analyzed, a single serving contained more lead than CR's food safety experts say is safe to consume in a day &mdash; some by more than 10 times... \n\n[I]n addition to the average level of lead being higher than what we found 15 years ago, there were also fewer products with undetectable amounts of it. The outliers also packed a heavier punch. Naked Nutrition's Vegan Mass Gainer powder, the product with the highest lead levels, had nearly twice as much lead per serving ",
        "id": 3847220,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/18/2242221/protein-powders-and-shakes-contain-high-levels-of-lead",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Protein Powders and Shakes Contain High Levels of Lead",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T23:00:11.297082+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T21:48:00+00:00",
        "description": "\"A new study published on Monday found that communications from cellphone carriers, retailers, banks, and even militaries are being broadcast unencrypted through geostationary satellites...\" reports Gizmodo. \"The team obtained unencrypted internet communications from U.S. military sea vessels and even communications regarding narcotics trafficking from Mexican military and law enforcement.\"\n\nResearchers from the University of California, San Diego (UCSD) and the University of Maryland scanned 39 of these satellites from a rooftop in Southern California over three years. They found that roughly half of the signals they analyzed were transmitting unencrypted data, potentially exposing everything from phone calls and military logistics to a retail chain's inventory. \"There is a clear mismatch between how satellite customers expect data to be secured and how it is secured in practice,\" the researchers wrote in their paper titled \"Don't Look Up: There Are Sensitive Internal Links in the Cl",
        "id": 3847221,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/10/18/2032252/you-only-need-750-to-pilfer-unencrypted-data-from-satellites-researchers-say",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "You Only Need $750 to Pilfer Unencrypted Data From Satellites, Researchers Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T20:56:14.155912+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T20:48:00+00:00",
        "description": "It's the world's largest network of environmental groups, according to NBC News, with more than 1,400 members from roughly 160 countries. It meets once every four years. \n\nAnd in a vote Tuesday, the International Union for Conservation of Nature \"approved further exploration of the use of genetic engineering tools to aid in the preservation of animal species and other living organisms.\"\n\n\nResearchers are already pursuing projects that involve changing some species' DNA. Scientists are genetically modifying mosquitoes to reduce transmission of diseases like malaria, for example, and synthesizing horseshoe crab blood, which is used in drug development. Controversial efforts to \"de-extinct\" archaic creatures &mdash; such as the so-called \"dire wolf\" that a biosciences company announced it had revived this spring &mdash; fall under the umbrella, as well. So do possibilities like modifying organisms to help them adapt to a warming world, which are on the table but further off in developmen",
        "id": 3846703,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/18/0713233/should-scientists-be-allowed-to-edit-genes-of-wild-animals-top-conservation-groups-just-voted-yes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Should Scientists Be Allowed to Edit Genes of Wild Animals? Top Conservation Groups Just Voted Yes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T20:56:14.286567+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T19:48:00+00:00",
        "description": "\"Windows 10 is officially dead,\" writes Slashdot user darwinmac, \"and the vultures are circling. Or maybe they are liberators, depending on your point of view.\" Neowin reports:\n\n\nOf all the projects trying to poach Windows users, Zorin Group might be the most aggressive, launching its biggest OS upgrade, Zorin OS 18, on the very day Windows 10 died.\n\n\nIn a recent post on X, Zorin Group celebrated the launch of version 18, claiming that it hit 100,000 downloads in \"a little over 2 days\". The company called it its \"biggest launch ever\" and claimed that over 72% of those downloads came from Windows... \n\nZorin OS 18 now includes an updated version of WINE 10 for better support of Windows software. On top of that, there's also an expanded database that helps when it detects a Windows installer. The system checks the file and suggests the best way to run over 170 popular apps, whether that means installing a native Linux version, using the web-based alternative, or firing it up through WINE",
        "id": 3846704,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/18/1946208/windows-10-refugees-flock-to-linux-as-zorin-os-claims-biggest-launch-ever",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows 10 Refugees Flock To Linux as Zorin OS Claims 'Biggest Launch Ever'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T18:50:07.031004+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T18:34:00+00:00",
        "description": "\"Earlier available only to the paying subscribers, the Comet browser now offers its core features to all users at no cost,\" writes the Times of India. \"This includes AI-powered search, contextual recommendations, and integrated tools designed to streamline research and content discovery.\" They say the move reflects the Chromium-based browser's goal to \"compete with incumbents like Google Chrome and Microsoft Edge\" &mdash; but also reflects Perplexity's \"broader mission to democratize AI tools.\" \n\nMore details from The Verge:\nThe internet is better on Comet,\" the company says, promising to remain free forever as it styles the browser as a serious challenger to Google's Chrome... \nIt's supposed to make surfing the web simpler and help you with tasks like shopping, booking trips, and general life admin. To borrow the company's words again: you \"get more done.\" The AI-powered browser launched in July, though was only available for users who subscribed to the $200 per month Perplexity Max ",
        "id": 3846172,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/18/0437214/perplexitys-ai-browser-comet-is-now-free-with-big-marketing-deals-to-challenge-chrome",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Perplexity's AI Browser 'Comet' is Now Free, with Big Marketing Deals to Challenge Chrome",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T18:50:07.144414+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T17:34:00+00:00",
        "description": "Concrete accounts for about 8% of the world's greenhouse gas emissions, notes CNN. But a research team at the University of Pennsylvania just used a robotic 3D printer to construct a bridge with \"complex, lattice-like patterns\" that are just as strong and durable &mdash; but with materials that absorb more carbon dioxide. \n\nCheck out the photos of the \"Diamanti\" projects \"post-tensioned concrete canopy\". And CNN's report includes an animated photo showing the 3D printer in action:\n\n\nWhile most regular concrete absorbs carbon dioxide (up to 30% of its production emissions over its entire life cycle, according to some research), Diamanti's enhanced concrete mixture absorbs 142% more carbon dioxide than conventional concrete mixes. Its first design, a pedestrian bridge, uses 60% less material while retaining mechanical strength, says Masoud Akbarzadeh, an associate professor of architecture at the University of Pennsylvania and director of the lab that spearheaded the project. \n\n \"Throug",
        "id": 3846173,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/18/0655237/researchers-build-complex-3d-printed-carbon-absorbing-bridge-inspired-by-bones",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Build Complex 3D-Printed, Carbon-Absorbing Bridge Inspired by Bones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T17:02:31.980125+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T16:34:00+00:00",
        "description": "The James Webb Space Telescope gets its highest resolution with the aperture masking interferometer (or AMI), \"a tiny piece of precisely machined metal that slots into one of the telescope's cameras,\" according to a new article by Benjamin Pope, an associated math professor at Macquarie University. \n\"We can finally present its first successful observations of stars, planets, moons and even black hole jets.\"\n\n\n\n[AMI] was put on Webb to diagnose and measure any blur in its images. Even nanometres of distortion in Webb's 18 hexagonal primary mirrors and many internal surfaces will blur the images enough to hinder the study of planets or black holes, where sensitivity and resolution are key. AMI filters the light with a carefully structured pattern of holes in a simple metal plate, to make it much easier to tell if there are any optical misalignments. We wanted to use this mode to observe the birth places of planets, as well as material being sucked into black holes. But before any of thi",
        "id": 3845632,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/18/0537217/how-we-sharpened-the-james-webb-telescopes-vision-from-a-million-kilometers-away",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'How We Sharpened the James Webb Telescope's Vision From a Million Kilometers Away'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T17:02:32.352455+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T15:34:00+00:00",
        "description": "Canada's Prime Minister \"paused an electric-vehicle sales mandate that was set to take effect next year,\" reports the Wall Street Journal, which argues a kind of retreat from electric-vehicle ambitions \"is spreading around the globe.\" \n\nEven the U.K.'s Prime Minister \"has allowed for a more flexible timetable to hit the country's EV targets.\" And demand is expected to drop in the U.S., where global consulting firm AlixPartners now predicts EVs will make up 18% of new-vehicle sales by 2030 &mdash; just half of what they'd predicted two years ago:\nj\nU.S. automaker GM will take a $1.6 billion charge \"because of sinking EV sales,\" reports the Wall Street Journal, \"a shift it blamed on recent moves by the U.S. government to end EV subsidies and regulatory mandates... That might just be the beginning of a financial reckoning from automakers that poured billions into new electric models &mdash; from sports cars and sedans to big pickups and sport-utility vehicles &mdash; to try to get ready ",
        "id": 3845633,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/18/0623211/are-parts-of-the-world-retreating-on-electric-vehicles",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are Parts of the World Retreating on Electric Vehicles?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T15:12:41.716630+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T14:34:00+00:00",
        "description": "In Reddit's \"Family Medicine\" subreddit, a moderator noticed earlier this week that the AI-powered \"Reddit Answers\" was automatically responding to posters, typically with \"something related to what was posted.\" Unfortunately, that moderator says, Reddit Answers \"has been spreading grossly dangerous misinformation.\"And yet Reddit's moderators \"cannot disable this feature.\" \n\nElsewhere a healthcare worker described what happened when they tested Reddit Answers:\n\nI made a post in r/familymedicine and a link appeared below it with information on treating chronic pain. The first post it cited urged people to stop their prescribed medications and take high-dose kratom which is an illegal (in some states) and unregulated substance. I absolutely do not endorse this... \n\nI also asked about the medical indications for heroin. One answer warned about addiction and linked to crisis and recovery resources. The other connects to a post where someone claims heroin saved their life and controls thei",
        "id": 3845034,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/18/086208/reddit-mod-warns-do-not-trust-ai-powered-reddit-answers-after-it-posts-dangerous-health-advice",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reddit Mod Warns 'Do Not Trust' AI-Powered 'Reddit Answers' After It Posts Dangerous Health Advice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T13:25:11.959518+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T13:00:00+00:00",
        "description": "Cybercriminals are exploiting weak email authentication settings in Zendesk, using the platform's customer support systems to bombard targets with thousands of spam and harassing messages that appear to come from legitimate companies like The Washington Post, Discord, and NordVPN. KrebsOnSecurity reports: Zendesk is an automated help desk service designed to make it simple for people to contact companies for customer support issues. Earlier this week, KrebsOnSecurity started receiving thousands of ticket creation notification messages through Zendesk in rapid succession, each bearing the name of different Zendesk customers, such as CapCom, CompTIA, Discord, GMAC, NordVPN, The Washington Post, and Tinder.\n \nThe abusive missives sent via Zendesk's platform can include any subject line chosen by the abusers. In my case, the messages variously warned about a supposed law enforcement investigation involving KrebsOnSecurity.com, or else contained personal insults. Moreover, the automated me",
        "id": 3844465,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/17/2333255/email-bombs-exploit-lax-authentication-in-zendesk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Email Bombs Exploit Lax Authentication In Zendesk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T11:41:13.120427+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T10:00:00+00:00",
        "description": "In two separate reports, Apple and Samsung are said to report underwhelming sales of their new ultra-thin smartphones. According to The Elec, Apple plans to cut production of the iPhone Air while Samsung has canceled its planned Galaxy S26 Edge smartphone after disappointing sales of the Galaxy S25 Edge, Korea's NewsPim claims. MacRumors reports: Samsung apparently halted work on the Galaxy S26 Edge this week, informing employees internally that the product line would be discontinued. Internal discussions in September shifted priorities toward the more conventional \"Plus\" form factor after confirming that consumer demand for ultra-slim flagships was weaker than expected. [...]\n \nSamsung will apparently instead add a Galaxy S26 Plus model to its 2026 lineup, reverting to the company's traditional three-tier structure of base, Plus, and Ultra variants. Despite the cancellation, development of the Galaxy S26 Edge was already complete. Development of the S26 Plus is expected to begin befo",
        "id": 3843930,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/10/18/0213223/apple-samsung-report-underwhelming-sales-of-their-new-thin-smartphones",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple, Samsung Report Underwhelming Sales of Their New Thin Smartphones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T08:06:13.769552+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T07:00:00+00:00",
        "description": "A network of classified Starshield satellites built by SpaceX for the U.S. government is transmitting signals on radio frequencies reserved for Earth-to-space commands. According to NPR, it may violate international standards. From the report: Satellites associated with the Starshield satellite network appear to be transmitting to the Earth's surface on frequencies normally used for doing the exact opposite: sending commands from Earth to satellites in space. The use of those frequencies to \"downlink\" data runs counter to standards set by the International Telecommunication Union, a United Nations agency that seeks to coordinate the use of radio spectrum globally.\n \nStarshield's unusual transmissions have the potential to interfere with other scientific and commercial satellites, warns Scott Tilley, an amateur satellite tracker in Canada who first spotted the signals. \"Nearby satellites could receive radio-frequency interference and could perhaps not respond properly to commands -- or",
        "id": 3843126,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/18/0219237/a-classified-network-of-spacex-satellites-is-emitting-a-mysterious-signal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Classified Network of SpaceX Satellites Is Emitting a Mysterious Signal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T04:31:18.913970+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Conversation: When teachers rely on commonly used artificial intelligence chatbots to devise lesson plans, it does not result in more engaging, immersive or effective learning experiences compared with existing techniques, we found in our recent study. The AI-generated civics lesson plans we analyzed also left out opportunities for students to explore the stories and experiences of traditionally marginalized people. The allure of generative AI as a teaching aid has caught the attention of educators. A Gallup survey from September 2025 found that 60% of K-12 teachers are already using AI in their work, with the most common reported use being teaching preparation and lesson planning. [...]\n \nFor our research, we began collecting and analyzing AI-generated lesson plans to get a sense of what kinds of instructional plans and materials these tools provide to teachers. We decided to focus on AI-generated lesson plans for civics education because ",
        "id": 3842235,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/17/235214/ai-generated-lesson-plans-fall-short-on-inspiring-students-promoting-critical-thinking",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI-Generated Lesson Plans Fall Short On Inspiring Students, Promoting Critical Thinking",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T02:40:42.107619+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T02:10:00+00:00",
        "description": "A potential tragedy was narrowly averted at a Wikipedia conference in Manhattan when two volunteer editors tackled an armed man who stormed the stage and threatened to kill himself during a keynote speech (source paywalled; alternative source). The gunman, who claimed he was protesting Wikipedia's policy banning self-identified pedophiles, was disarmed and taken into custody after community members swiftly intervened. The New York Times reports: The armed man came striding up the aisle at a conference for Wikipedia editors Friday morning in Manhattan, several witnesses said. The man, draped in a multicolored flag, walked onto the stage and stood next to Maryana Iskander, the chief of the nonprofit group that runs Wikipedia, interrupting her speech. He announced that he was going to kill himself. He held a gun near his head and pointed it toward the ceiling. The audience of well over a hundred people panicked.\n \n\"People started yelling, 'Get down, get down!' and people started ducking ",
        "id": 3841856,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/18/023257/wikipedia-volunteers-avert-tragedy-by-taking-down-gunman-at-conference",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wikipedia Volunteers Avert Tragedy by Taking Down Gunman at Conference",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T02:40:42.189442+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T01:25:00+00:00",
        "description": "Amazon is investing hundreds of millions into the Cascade Advanced Energy Facility, a next-generation small modular reactor project in Richland, Washington, developed with X-energy and Energy Northwest. \"The question now is will it be enough to kick off a new wave of U.S. nuclear energy innovation -- a field that America largely soured on by the 1980s?\" writes GeekWire. From the report: The facility will be located near Richland, Wash., near Energy Northwest's Columbia Generating Station nuclear plant. The initial goal is to install a cluster of four small modular reactors (SMRs) that can produce up to 320 megawatts of power, but the overall vision is to construct 12 reactors total, with a capacity of nearly one gigawatt. If all the funding, permitting and public support come together, construction should start within the next five years, with the plant coming online in the 2030s. [...] For Amazon, its support of the Cascade Advanced Energy Facility is part of a much bigger initiative",
        "id": 3841857,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/17/2314242/first-look-at-the-amazons-nuclear-facility-planned-for-washington-state",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "First Look at the Amazon's Nuclear Facility Planned For Washington State",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T00:58:13.392362+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T00:45:00+00:00",
        "description": "Hackers breached financial services firm Prosper, stealing the personal data of roughly 17.6 million people, including Social Security numbers, income details, and government IDs. \"We have evidence that confidential, proprietary, and personal information, including Social Security Numbers, was obtained, including through unauthorized queries made on Company databases that store customer information and applicant data. We will be offering free credit monitoring as appropriate after we determine what data was affected,\" the company says. \"The investigation is still in its very early stages, but resolving this incident is our top priority and we are committed to sharing additional information with our customers as appropriate.\" BleepingComputer reports: Prosper operates as a peer-to-peer lending marketplace that has helped over 2 million customers secure more than $30 billion in loans since its founding in 2005. As the company disclosed one month ago on a dedicated page, the breach was d",
        "id": 3841466,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/17/2322217/prosper-data-breach-impacts-176-million-accounts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Prosper Data Breach Impacts 17.6 Million Accounts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-18T00:58:13.514832+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-18T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: Hyperscale datacenters stateside will consume 22 percent more grid power by the end of 2025 than a year ago, and are forecast to need nearly three times as much electricity by the end of the decade. Warnings about datacenters' rising energy draw are coming thick and fast of late, and this latest one from 451 Research (now a part of S&amp;P Global) comes with figures and cautions about how fast this change may occur and what grid resources will be required to meet it.\n \nThe bit barn building boom is largely fueled by estimated demand for new machine learning models, which require highly configured servers packed with power-hungry GPUs to develop and train. The power and cooling infrastructure required also mean it is easier to build a new facility rather than attempt to retrofit an existing one. As a consequence, utility power to datacenters in America is estimated to jump 11.3 GW to 61.8 GW by the end of this year. 451 calculates ",
        "id": 3841467,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/17/2051238/us-hyperscalers-to-consume-22-more-grid-power-by-end-of-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Hyperscalers To Consume 22% More Grid Power By End of 2025",
        "vote": 0
    }
]