[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T16:37:50.697199+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T15:30:24+00:00",
        "description": "September has quickly turned into one of the busiest months in gaming, and that's considering that the month started with Hollow Knight: Silksong, Cronos: The New Dawn, Hell is Us, Metal Eden and Daemon X Machina: Titanic Scion. The subsequent week was relatively calm, featuring only one major release – Gearbox's Borderlands 4. Despite the attempts by CEO Randy Pitchford to chase away prospective consumers with the whole “might cost $80” controversy, the development team has done a good job building up hype.\n\nBetween the deep dives into each character's skill trees, proper cinematic origin stories, and even a deep dive into the endgame, the overall vibe was pretty positive. Let's ignore Pitchford saying near launch that he wants “everyone to have realistic expectations for performance” and that “lower end and older hardware may not perform as well as higher end, modern PCs.\" You'll probably remember that Borderlands 3 suffered some pretty severe performance issues when it launched. Su",
        "id": 3589249,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=QWokeg7f3yE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QWokeg7f3yE/hqdefault.jpg",
        "title": "Borderlands 4 - What The HELL Is Going On?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T14:28:45.797246+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T13:30:05+00:00",
        "description": "Ghost of Yotei is making bold new changes to the excellent formula that Sucker Punch brought to the gaming world back in 2020. Building on the first game's strengths while taking the sequel in a bold new direction, there's a lot to like in what's been revealed about the upcoming samurai-action title so far. \n\nFrom a brand new protagonist and story to new weapon types, side content, and revamped quest tracking, this is a game that could potentially be one of 2025's greatest hits. We've put together a list of new additions to the game that we believe could help you decide if this one's worth your time, money, and effort this October. We're definitely going to be zipping around Ezo when the time comes.\n\nNote that all information and footage in this video comes from official sources.",
        "id": 3587912,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=7bqe4HUiax0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7bqe4HUiax0/hqdefault.jpg",
        "title": "Ghost of Yotei  - 14 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T12:22:16.139493+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T12:01:34+00:00",
        "description": "Assassin’s Creed Shadows, already an incredibly large game by open-world standards, wrapped up its main story with a few plot threads still left dangling. One of these core plot threads, the fate of Naoe’s mother, is finally explored in the brand new Claws of Awaji expansion, which takes our dual protagonists to a new island zone: the eponymous Awaji, where they will have to take on the Sanzoku Ippa.\n\nShadows has managed to succeed quite well in executing its vision for the DLC, since it essentially feels like a microcosm of the core game, albeit with all the fat trimmed out. The new zone is small but feels dense because of its terrain, its atmosphere is a great rendition of oppression, and the story runs at a breakneck pace that never feels too rushed, while still giving you plenty of time to explore the world.",
        "id": 3586661,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=lUxrUKPQNWM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lUxrUKPQNWM/hqdefault.jpg",
        "title": "Assassin's Creed Shadows: Claws of Awaji DLC Review - The Final Verdict",
        "vote": 0
    }
]