[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T23:23:32.355029+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T23:20:00+00:00",
        "description": "Microsoft will invest $30 billion in the U.K. through 2028 to expand AI infrastructure and operations, including building the country's largest supercomputer with 23,000 GPUs in partnership with Nscale. CNBC reports: On a call with reporters on Tuesday, Microsoft President Brad Smith said his stance on the U.K. has warmed over the years. He previously criticized the country over its attempt in 2023 to block the tech giant's $69 billion acquisition of video game developer Activision-Blizzard. The deal was cleared by the U.K.s competition regulator later that year.\n \n\"I haven't always been optimistic every single day about the business climate in the U.K.,\" Smith said. However, he added, \"I am very encouraged by the steps that the government has taken over the last few years.\" \"Just a few years ago, this kind of investment would have been inconceivable because of the regulatory climate then and because there just wasn't the need or demand for this kind of large AI investment,\" Smith sai",
        "id": 3592374,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/16/2032219/microsoft-announces-30-billion-investment-in-ai-infrastructure-operations-in-uk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Announces $30 Billion Investment In AI Infrastructure, Operations In UK",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T23:23:32.577967+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T22:40:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: The Fedora Project has announced Fedora Linux 43 Beta, giving users and developers the opportunity to test the distribution ahead of its final release. This beta introduces improvements across installation, system tools, and programming languages while continuing Fedora's pattern of cleaning out older components. The beta can be downloaded in Workstation, KDE Plasma, Server, IoT, and Cloud editions. Spins and Labs are also available, though Mate and i3 are not provided in some builds. Existing systems can be upgraded with DNF system-upgrade. Fedora CoreOS will follow one week later through its \"next\" stream. The beta brings enhancements to its Anaconda WebUI, moves to Python 3.14, and supports Wayland-only GNOME, among many other changes. A full list of improvements and system enhancements can be found here.\n \nThe official release should be available in late October or early November.<p><div class=\"share_submission\" style=\"position:relative",
        "id": 3592375,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/16/2021253/fedora-linux-43-beta-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fedora Linux 43 Beta Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T22:21:51.796354+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: The Taliban leader banned fibre optic internet in an Afghan province to \"prevent immorality,\" a spokesman for the administration said Tuesday. It's the first time a ban of this kind has been imposed since the Taliban seized power in August 2021, and leaves government offices, the private sector, public institutions, and homes in northern Balkh province without Wi-Fi internet. Mobile internet remains functional, however.\n \nHaji Attaullah Zaid, a provincial government spokesman, said there was no longer cable internet access in Balkh by order of a \"complete ban\" from the leader Hibatullah Akhundzada. \"This measure was taken to prevent immorality, and an alternative will be built within the country for necessities,\" Zaid told The Associated Press. He gave no further information, including why Balkh was chosen for the ban or if the shutdown would spread to other provinces.<p><div class=\"share_submission\" style=\"position:relati",
        "id": 3591926,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/09/16/2012254/taliban-leader-bans-wi-fi-in-an-afghan-province-to-prevent-immorality?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Taliban Leader Bans Wi-Fi In an Afghan Province To 'Prevent Immorality'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T22:21:51.974982+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T21:20:00+00:00",
        "description": "Consumer Reports has urged Microsoft to keep supporting Windows 10 beyond its October 2025 cutoff, saying the move will \"strand millions of consumers\" who have machines incompatible with Windows 11. The Verge reports: As noted by Consumer Reports, data suggests that around 46.2 percent of people around the world still use Windows 10 as of August 2025, while around 200 to 400 million PCs can't be upgraded to Windows 11 due to missing hardware requirements.\n \nIn the letter, Consumer Reports calls Microsoft \"hypocritical\" for urging customers to upgrade to Windows 11 to bolster cybersecurity, but then leaving Windows 10 devices susceptible to cyberattacks. It also calls out the $30 fee Microsoft charges customers for \"a mere one-year extension to preserve their machine's security,\" as well as the free support options that force people to use Microsoft products, allowing the company to \"eke out a bit of market share over competitors.\"\n \nConsumer Reports asks that Microsoft continue provid",
        "id": 3591927,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/16/206245/consumer-reports-asks-microsoft-to-keep-supporting-windows-10?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Consumer Reports Asks Microsoft To Keep Supporting Windows 10",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T21:21:29.806142+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T20:40:00+00:00",
        "description": "A third wrongful death lawsuit has been filed against Character AI after the suicide of 13-year-old Juliana Peralta, whose parents allege the chatbot fostered dependency without directing her to real help. \"This is the third suit of its kind after a 2024 lawsuit, also against Character AI, involving the suicide of a 14-year-old in Florida, and a lawsuit last month alleging OpenAI's ChatGPT helped a teenage boy commit suicide,\" notes Engadget. From the report: The family of 13-year-old Juliana Peralta alleges that their daughter turned to a chatbot inside the app Character AI after feeling isolated by her friends, and began confiding in the chatbot. As originally reported by The Washington Post, the chatbot expressed empathy and loyalty to Juliana, making her feel heard while encouraging her to keep engaging with the bot.\n \nIn one exchange after Juliana shared that her friends take a long time to respond to her, the chatbot replied \"hey, I get the struggle when your friends leave you o",
        "id": 3591550,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/16/1959230/another-lawsuit-blames-an-ai-company-of-complicity-in-a-teenagers-suicide?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Another Lawsuit Blames an AI Company of Complicity In a Teenager's Suicide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T20:16:47.881339+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T20:02:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Verizon agreed to offer $20-per-month broadband service to people with low incomes in California in exchange for a merger approval. In a bid to complete its $9.6 billion purchase of Frontier Communications, Verizon committed to offering $20 fiber-to-the-home service with symmetrical speeds of 300Mbps. Verizon also committed to offering a $20 fixed wireless service with download speeds of 100Mbps and upload speeds of 20Mbps. Verizon would be required to offer the plans for at least 10 years, according to a joint motion (PDF) to approve the settlement agreement. After three years, Verizon would need to \"make commercially reasonable efforts\" to increase the speeds \"while retaining the $20 price point.\"\n \nThe joint motion filed by Verizon and the California Public Advocates Office seeks approval from the California Public Utilities Commission (CPUC). The $20 plans would be available to people who meet income eligibility guidelines and",
        "id": 3591082,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/16/1950246/verizon-to-offer-20-broadband-in-california-to-obtain-merger-approval?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Verizon To Offer $20 Broadband In California To Obtain Merger Approval",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T20:16:47.986884+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T19:22:00+00:00",
        "description": "Waymo is now permitted to test its robotaxi service at San Francisco International Airport (SFO), a big win for the company as it seeks to expand its service area and tackle more popular, revenue-generating destinations. From a report: After years of back-and-forth negotiations, Waymo signed \"Testing and Operations Pilot Permit\" with SFO, San Francisco Mayor Daniel Lurie said in a release. Under the agreement, Waymo will roll out its service to SFO in three phases, including testing vehicles with a human driver, testing without a driver, and eventually beginning commercial service. \n\nWaymo will start its tests with employees before eventually inviting members of the public to take trips to and from the airport. Pickups and dropoffs will initially take place at SFO's Kiss &amp; Fly lot, which is accessible to the terminals via the AirTrain.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Waymo+Gets+Green+Light+For+Air",
        "id": 3591083,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/16/1856253/waymo-gets-green-light-for-airport-service-in-san-francisco?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymo Gets Green Light For Airport Service in San Francisco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T19:11:23.077065+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T18:41:00+00:00",
        "description": "Nature's editorial board urged governments on Tuesday to reverse decades of rail disinvestment as railways mark their 200th anniversary September 27, citing transport sector emissions that grew 1.7% annually from 1990-2022 and now generate one-quarter of global CO2. Rail produces one-fifth the emissions of cars per passenger kilometer yet carries just 8.4% of EU passenger traffic versus 73% for automobiles. \n\nThe journal called for broader investment criteria beyond narrow profitability metrics and noted only one-third of countries have incorporated transport into their Paris Agreement commitments. Global rail freight fell from 38% to 24% between 1980-2017 while US networks shrank from 400,000 to 200,000 kilometers since 1914. Africa operates 87,000 rail kilometers continent-wide compared to India's 65,000 kilometers in one-tenth the area. Transport emissions must decline 3% yearly to meet net-zero targets.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop",
        "id": 3590548,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/16/1832209/nature-editorial-calls-for-rail-renaissance-as-networks-mark-200-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nature Editorial Calls for Rail Renaissance as Networks Mark 200 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T18:10:01.209871+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T18:02:00+00:00",
        "description": "Gearbox CEO Randy Pitchford has responded to Borderlands 4 performance complaints by calling the game \"a premium game made for premium gamers.\" Pitchford claimed customer service reports for performance issues represent \"less than one percent of one percent\" of players and told critics to \"code your own engine and show us how it's done, please.\" \n\nThe game holds a Mixed rating on Steam despite reaching 300,000 concurrent players Sunday, a franchise record. Gearbox recommends DLSS and frame generation for 60+ fps at 1440p even on powerful hardware. Pitchford compared running the game on older hardware to driving \"a monster truck with a leaf blower's motor.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Gearbox+CEO+Randy+Pitchford+Tells+Borderlands+4+Critics+To+'Code+Your+Own+Engine%2C'+Calls+It+a+Game+For+'Premium+Gamers'%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F09%2F16%2F1735225%2F%3Futm_source%3Dtwitter%",
        "id": 3590102,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/09/16/1735225/gearbox-ceo-randy-pitchford-tells-borderlands-4-critics-to-code-your-own-engine-calls-it-a-game-for-premium-gamers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gearbox CEO Randy Pitchford Tells Borderlands 4 Critics To 'Code Your Own Engine,' Calls It a Game For 'Premium Gamers'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T18:10:01.343391+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T17:23:00+00:00",
        "description": "Gallup: Americans have been placing less importance on the value of a college education over the past 15 years, to the point that about a third (35%) now rate it as \"very important.\" Forty percent think it is \"fairly important,\" while 24% say it is \"not too important.\" \n\nWhen last asked to rate the importance of college in 2019, just over half of U.S. adults, 53%, said it was very important, but that was already lower than the 70% found in 2013 and 75% in 2010. Meanwhile, the percentage viewing college as not too important has more than doubled since 2019 and compares with just 4% in 2010. The views of parents of children under age 18 in the Aug. 1-20 poll are similar to the national average, with 38% rating college as very important, 40% somewhat important and 21% not too important.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Perceived+Importance+of+College+Hits+New+Low%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory",
        "id": 3590103,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/16/1722223/perceived-importance-of-college-hits-new-low?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Perceived Importance of College Hits New Low",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T17:05:43.285516+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T16:40:00+00:00",
        "description": "An anonymous reader shares a report: Apollo is exploring a sale of early internet darling AOL after receiving inbound interest in the business, according to people familiar with the matter. Any deal could value AOL at around $1.5 billion, the people said. It is also possible the talks won't result in any deal, they cautioned. \n\nApollo bought AOL in 2021 as part of a $5 billion deal to acquire that business and Yahoo from Verizon. AOL generates around $400 million in annual earnings before interest, taxes, depreciation and amortization, the people familiar with the matter said. Its main business lines include software for internet privacy and protection, and the AOL.com website and email domain.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apollo+Explores+Sale+of+Internet+Pioneer+AOL%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F16%2F1519202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.",
        "id": 3589466,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/16/1519202/apollo-explores-sale-of-internet-pioneer-aol?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apollo Explores Sale of Internet Pioneer AOL",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T17:05:43.388189+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T16:01:00+00:00",
        "description": "AI will enable three to four-day workweeks, Zoom CEO Eric Yuan told The New York Times, joining Microsoft's Bill Gates, Nvidia's Jensen Huang and JPMorgan's Jamie Dimon in predicting shorter schedules. Yuan also acknowledged AI will eliminate some positions, particularly entry-level engineering roles where AI can write code, but argued new opportunities will emerge managing AI agents. Gates previously suggested two to three-day weeks within 10 years during a February appearance on The Tonight Show.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Zoom+CEO+Latest+Executive+To+Forecast+Shortened+Workweeks+From+AI+Adoption%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F16%2F0842248%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F16%2F0842248%2Fzoom",
        "id": 3589467,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/16/0842248/zoom-ceo-latest-executive-to-forecast-shortened-workweeks-from-ai-adoption?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Zoom CEO Latest Executive To Forecast Shortened Workweeks From AI Adoption",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T16:00:58.954771+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T15:21:00+00:00",
        "description": "Getting an MBA in the US has gotten a little more expensive and a little less profitable, according to a Bloomberg analysis of salary and tuition data. From the report: This year's update of Bloomberg's Business School ROI Calculator, based on surveys of more than 9,500 students and alumni, projects a typical return on investment of 12.3% a year for the decade after graduation. That's down from 13.3% last year. The S&amp;P 500 index, by comparison, returned 14.6% over the decade ending Aug. 31. \n\nThe main reason for the decline: This year's respondents reported 6.2% better pre-MBA salaries than last year's, while projected postdegree earnings increased only 1.7%. In other words, the MBA pay edge -- the compensation boost graduates get for the degree -- shrank. In the broader US workforce, the average high-skilled worker's earnings rose 4.7% in the year ended July 31, Federal Reserve data show. \n\nOther factors didn't help: The increase in pre-MBA salaries meant students were forgoing m",
        "id": 3588840,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/16/0813250/mbas-cost-more-and-are-less-profitable-as-roi-falls?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MBAs Cost More and Are Less Profitable as ROI Falls",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T15:00:22.129921+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T14:40:00+00:00",
        "description": "A search for \"AI chat\" in the Mac App Store returns dozens of applications sporting black-and-white icons nearly identical to ChatGPT's official logo. OpenAI's ChatGPT desktop application isn't available through the Mac App Store and can only be downloaded from the company's website. The copycat applications use various combinations of \"AI,\" \"Chat,\" and \"Bot\" in their names, including \"AI Chat Bot : Ask Assistant,\" \"AI Chatbot: Chat Ask Assistant,\" and dozens of similar variations. One application named itself \"Al Chatbot\" using a lowercase L instead of a capital I in \"AI.\" Additional lookalike icons mimicking Claude, Grok, and Gemini applications also appear in search results.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Mac+App+Flea+Market%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F09%2F16%2F0629209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.p",
        "id": 3588220,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/09/16/0629209/the-mac-app-flea-market?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Mac App Flea Market",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T15:00:22.279938+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T14:00:00+00:00",
        "description": "An anonymous reader shares a report: Anyone who surveys the public, from marketers to pollsters, struggles nowadays to get people to answer their questions. That phenomenon afflicts crucial government data, making it harder for policymakers and investors to know the true state of the economy. Falling survey participation is an important reason the flagship jobs report released every month by the Bureau of Labor Statistics, part of the Labor Department, has undergone such big revisions recently. \n\nThis has rippled into the political sphere. On Aug. 1, President Trump fired BLS Commissioner Erika McEntarfer after a particularly large downward revision to jobs for May and June that owed partly to late responses from survey participants. The White House and top administration officials increased their attacks on the BLS last week after the agency published an annual revision suggesting the U.S. added 911,000 fewer jobs over the 12 months through March. The BLS blamed the initial overestim",
        "id": 3588221,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/16/0619228/an-unresponsive-public-is-undermining-government-economic-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "An Unresponsive Public Is Undermining Government Economic Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T13:55:28.931829+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The companies seeking to build larger AI models have been increasingly stymied by a lack of high-quality training data. As tech firms scour the web for more data to feed their models, they could increasingly rely on potentially sensitive user data. A team at Google Research is exploring new techniques to make the resulting large language models (LLMs) less likely to 'memorize' any of that content. LLMs have non-deterministic outputs, meaning you can't exactly predict what they'll say. While the output varies even for identical inputs, models do sometimes regurgitate something from their training data -- if trained with personal data, the output could be a violation of user privacy. In the event copyrighted data makes it into training data (either accidentally or on purpose), its appearance in outputs can cause a different kind of headache for devs. Differential privacy can prevent such memorization by introducing calibrated noise ",
        "id": 3587531,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/16/000202/google-releases-vaultgemma-its-first-privacy-preserving-llm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Releases VaultGemma, Its First Privacy-Preserving LLM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T13:55:29.036380+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T10:00:00+00:00",
        "description": "Bruce66423 shares a report from The Guardian: MI5 has conceded it \"unlawfully\" obtained the communications data of a former BBC journalist, in what was claimed to be an unprecedented admission from the security services. The BBC said it was a \"matter of grave concern\" that the agency had obtained communications data from the mobile phone of Vincent Kearney, a former BBC Northern Ireland home affairs correspondent. The admission came in a letter to the BBC and to Kearney, in relation to a tribunal examining claims that several reporters in Northern Ireland were subjected to unlawful scrutiny by the police. It related to work carried out by Kearney for a documentary into the independence of the Office of the Police Ombudsman for Northern Ireland (PONI). Kearney is now the northern editor at Irish broadcaster RTE.\n \nIn documents submitted to the Investigatory Powers Tribunal (IPT), MI5 conceded it obtained phone data from Kearney on two occasions in 2006 and 2009. Jude Bunting KC, repres",
        "id": 3587532,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/16/007218/uks-mi5-unlawfully-obtained-data-from-former-bbc-journalist?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK's MI5 'Unlawfully' Obtained Data From Former BBC Journalist",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T13:55:29.139836+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T07:00:00+00:00",
        "description": "Fiverr is laying off 250 employees, or about 30% of its workforce, as it restructures to become an \"AI-first\" company. \"We are launching a transformation for Fiverr, to turn Fiverr into an AI-first company that's leaner, faster, with a modern AI-focused tech infrastructure, a smaller team, each with substantially greater productivity, and far fewer management layers,\" CEO Micha Kaufman said. Reuters reports: While it isn't clear what kinds of jobs will be impacted, Fiverr operates a self-service digital marketplace where freelancers can connect with businesses or individuals requiring digital services like graphic design, editing or programming. Most processes on the platform take place with minimal employee intervention as ordering, delivery and payments are automated.\n \nThe company's name comes from most gigs starting at $5 initially, but as the business grew, the firm has introduced subscription services and raised the bar for service prices. Fiverr said it does not expect the job ",
        "id": 3587533,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/15/2344215/online-marketplace-fiverr-to-lay-off-30-of-workforce-in-ai-push?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Online Marketplace Fiverr To Lay Off 30% of Workforce In AI Push",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T13:55:29.242220+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Today, OpenAI's Economic Research Team went a long way toward answering that question, on a population level, releasing a first-of-its-kind National Bureau of Economic Research working paper (in association with Harvard economist David Denning) detailing how people end up using ChatGPT across time and tasks. While other research has sought to estimate this kind of usage data using self-reported surveys, this is the first such paper with direct access to OpenAI's internal user data. As such, it gives us an unprecedented direct window into reliable usage stats for what is still the most popular application of LLMs by far. After digging through the dense 65-page paper, here are seven of the most interesting and/or surprising things we discovered about how people are using OpenAI today. Here are the seven most interesting and surprising findings from the study:\n \n1. ChatGPT is now used by \"nearly 10% of the world's adult population,\" ",
        "id": 3587534,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/15/2151235/openais-first-study-on-chatgpt-usage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's First Study On ChatGPT Usage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T02:28:53.260585+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T01:25:00+00:00",
        "description": "The FTC is investigating whether Ticketmaster is doing enough to prevent bots from illegally reselling tickets on its platform, with a decision on the matter coming within weeks, according to Bloomberg (paywalled). Reuters reports: The 2016 law prohibits the use of bots and other methods to bypass ticket purchase limits set by online sellers. As part of the probe, FTC investigators are assessing whether Ticketmaster has a financial incentive to allow resellers to circumvent its ticket limit rules, according to the report. A settlement is also possible, Bloomberg reported. If the FTC pursues a case and Live Nation loses, the company could face billions of dollars in penalties, as the law permits fines of up to $53,000 per violation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FTC+Probes+Whether+Ticketmaster+Does+Enough+To+Stop+Resale+Bots%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F09%2F15%2F2213254%2F%3Futm_",
        "id": 3583698,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/15/2213254/ftc-probes-whether-ticketmaster-does-enough-to-stop-resale-bots?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FTC Probes Whether Ticketmaster Does Enough To Stop Resale Bots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T01:26:39.561492+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T00:45:00+00:00",
        "description": "A leaked Meta video revealed upcoming \"Meta Ray-Ban Display\" smart glasses with a monocular HUD and sEMG wristband control, set to debut at Connect 2025 for around $800. Despite past hesitation, it looks like EssilorLuxottica has agreed to co-brand after Meta invested $3.5 billion in the company, taking a 3% stake. UploadVR reports: Meta's HUD glasses with the sEMG wristband will in fact be Ray-Ban branded, a leaked video which also depicts the HUD and wristband in action reveals. A quickly removed unlisted video on Meta's YouTube channel showed what will soon be Meta and EssilorLuxottica's full lineup: \n- The regular Ray-Ban Meta glasses.\n- The recently-launched Oakley Meta HSTN glasses.\n- The rumored Oakley Meta Sphaera glasses, with eye protection and a centered camera.\n- The rumored monocular heads-up display (HUD) glasses controlled by Meta's long-in-development sEMG wristband, which are labeled as \"Meta Ray-Ban\" with the word \"Display\" underneath. The smart glasses are expected ",
        "id": 3583464,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/15/2049228/meta-ray-ban-display-glasses-design-hud-clips-leak?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Meta Ray-Ban Display' Glasses Design, HUD Clips Leak",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-16T00:26:25.157358+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-16T00:02:00+00:00",
        "description": "Robinhood has filed with the SEC to launch \"Robinhood Ventures Fund I,\" a publicly traded fund designed to give retail investors access to startup shares before IPOs. TechCrunch reports: While the current version of the application is public, Robinhood hasn't filled in the fine-print yet. This means we don't know how many shares it plans to sell, nor other details like the management fee it plans to charge. It's also unclear which startups it hopes this fund will eventually hold. The paperwork says it \"expects\" to invest in aerospace and defense, AI, fintech, robotics as well as software for consumers and enterprises.\n \nRobinhood's big pitch is that retail investors are being left out of the gains that are amassed by startup investors like VCs. That's true to an extent. \"Accredited investors\" -- or those with a net worth large enough to handle riskier investments -- already have a variety of ways of buying equity in startups, such as with venture firms like OurCrowd. Retail investors ",
        "id": 3583212,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/15/2159203/robinhood-plans-to-launch-a-startups-fund-open-to-all-retail-investors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Robinhood Plans To Launch a Startups Fund Open To All Retail Investors",
        "vote": 0
    }
]