[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-17T16:00:27+00:00",
        "description": "Warriors: Abyss is an experimental take on the Dynasty Warriors formula, leaving behind its classic Romance of the Three Kingdoms story for a more fantastical take. The game also features a roguelite structure, focusing on giving players plenty of variety through a vast number of possible builds that they can mix and match.\n\nWhen it comes to its core gameplay, Warriors: Abyss is an absolute success. It’s always fun to go for another quick run, trying out new heroes and coming up with fun combinations. Its only real downside is that its writing is incredibly poor, and the best way to enjoy it is to just skip through the game’s attempts at telling you a story and instead focus on taking down hordes of enemies.",
        "id": 2133491,
        "language": null,
        "link": "https://www.youtube.com/watch?v=U3PK50lU74A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/U3PK50lU74A/hqdefault.jpg",
        "title": "Warriors Abyss Review - An Excellent Hack And Slash Experience",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-17T13:30:19+00:00",
        "description": "As someone who didn't quite get into the first game, Chernobylite 2: Exclusion Zone from The Farm 51 is an intriguing experience. After more than doubling its crowd-funding goal on Kickstarter, it's launching into Steam Early Access on March 6th for PC, offering one-third of the final game's content.\n\nThere's a lot that the sequel seeks to offer, from a brand new premise to revamped combat with a new third-person view where dodge-rolling is as important as shooting. You still have the base-building, survival mechanics, and overall dark atmosphere of the first game, but then there's also Planewalking to other dimensions and changing your build on the fly.\n\nI went hands-on with a preview demo of Chernobylite 2, and though it's still a work in progress with plenty of optimization remaining, it offered much to unpack in its short runtime. Here are 15 things you should know about the post-apocalyptic action RPG before its early access release.",
        "id": 2132566,
        "language": null,
        "link": "https://www.youtube.com/watch?v=UEnyButPYco",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UEnyButPYco/hqdefault.jpg",
        "title": "Chernobylite 2: Exclusion Zone – 15 Things You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-17T07:30:12+00:00",
        "description": "If you haven't heard, Kingdom Come: Deliverance 2 is very good. It's one of the best open-world action RPGs in the past several years, earning critical acclaim and selling much faster than its predecessor. Such is its brilliance that it's putting bigger triple-A publishers and developers to shame.\n\nThat includes Bethesda Game Studios, which has failed to ignite the space with its most recent effort, Starfield. The studio still has The Elder Scrolls 6, which many continue to look forward to despite the lack of details since its announcement in 2018. As with so many other titles over the years, it's difficult not to look at a similar title like Kingdom Come: Deliverance 2 and hope that Bethesda takes some lessons from it.\n\nWhether it's the writing, characterization, quest design, combat, world design or how the overall experience rewards your time, Kingdom Come Deliverance 2 sets a higher bar. The Elder Scrolls 6 choosing to meet it is another matter entirely.",
        "id": 2130703,
        "language": null,
        "link": "https://www.youtube.com/watch?v=fdFIFa0SWt4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fdFIFa0SWt4/hqdefault.jpg",
        "title": "Kingdom Come Deliverance 2 Presents A Higher Bar For The Elder Scrolls 6 To Surpass",
        "vote": 0
    }
]