[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T15:30:17+00:00",
        "description": "We usually don’t have to wait too long to get our hands on another new Yakuza / Like a Dragon game, and unlike a great many other franchises with that sort of output, RGG Studio's beloved series actually manages to remain remarkably consistent in terms of quality. \n\nSoon, it will be returning to the limelight once more with Like a Dragon: Pirate Yakuza in Hawaii, and the spinoff is looking like yet another riotously fun outing for the series. \n\nStarring fan favourite character Goro Majima as its protagonist and adopting a new pirate theme, the action-adventure title is promising real-time brawler combat, naval escapades, and more, and we couldn’t be more excited. To prepare for its looming release, here, we talk about all of that and more.",
        "id": 2025074,
        "language": null,
        "link": "https://www.youtube.com/watch?v=TEfAYhFxSx4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TEfAYhFxSx4/hqdefault.jpg",
        "title": "Like a Dragon: Pirate Yakuza in Hawaii - 15 Things You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T07:45:00+00:00",
        "description": "Fans of role playing games thankfully always have a treasure trove of excellent games to dive into, and that horde of treasure only ever grows larger. Of the many upcoming RPGs that have caught our eye, one in particular that has looked quite promising and has been highly anticipated by many for some time now is Kingdom Come: Deliverance 2. \n\nBack when its predecessor was released a few years ago, it captured millions, even in spite of its fair share of flaws and rough edges. Now, KCD2 is making exciting promises, as it looks to take that unique foundation of the first game and build upon it with a number of meaningful improvements (or what are looking like meaningful improvements, at any rate). Here, we’re going to talk about why we’re excited about Kingdom Come: Deliverance 2 as fans of RPGs.",
        "id": 2023389,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Ashis_APADs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Ashis_APADs/hqdefault.jpg",
        "title": "5 Reason RPG Fans Should Be Excited For Kingdom Come: Deliverance 2",
        "vote": 0
    }
]