[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T23:52:02+00:00",
        "description": "Just three hours ago, OpenAI made a surprise announcement to their 3.9 million followers on X.com. \"Live from Tokyo,\" they'd be livestreaming... something. Their description of the event was just two words. \n\n\"Deep Research\" \n\nIt begins in just 15 minutes. \n\nX.com users shared their reactions to the coming announcement: \n\"It's like DeepSeek, but cleaner\"\n\"Deep do do if things don't work out\"\n\"Live from Tokyo? Hope this research includes the secret to waking up early!\"\n\"Stop trying, we don't trust u\" \n\nBut one X.com user pointed out OpenAI has used the phrase \"deep research\" before. In July of 2024, Reuters reported on internal documentation (confirmed with \"a person familiar with the matter\") code-named \"Strawberry\" which suggested OpenAI was working on \"human-like reasoning skills.\"\n\n\nHow Strawberry works is a tightly kept secret even within OpenAI, the person said. The document describes a project that uses Strawberry models with the aim of enabling the company's AI to not just gen",
        "id": 2027105,
        "language": null,
        "link": "https://slashdot.org/story/25/02/02/2342245/openai-makes-surprise-livestream-today-for-deep-research-announcement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Makes Surprise Livestream Today for 'Deep Research' Announcement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T22:48:47+00:00",
        "description": "An anonymous reader shared this post from the blog OMG Ubuntu\n\n\n Want to find out if the text you're reading online was written by an real human or spat out by a large language model trying to sound like one? Mozilla's Fakespot Deepfake Detector Firefox add-on may help give you an indication. Similar to online AI detector tools, the add-on can analyse text (of 32 words or more) to identify patterns, traits, and tells common in AI generated or manipulated text. \n\nIt uses Mozilla's proprietary ApolloDFT engine and a set of open-source detection models. But unlike some tools, Mozilla's Fakespot Deepfake Detector browser extension is free to use, does not require a signup, nor an app download. \"After installing the extension, it is simple to highlight any text online and request an instant analysis. Our Detector will tell you right away if the words are likely to be written by a human or if they show AI patterns,\" Mozilla says. \n\nFakespot, acquired by Mozilla in 2023, is best known for i",
        "id": 2026591,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/02/2156241/mozilla-adapts-fakespot-into-an-ai-detecting-firefox-add-on?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mozilla Adapts 'Fakespot' Into an AI-Detecting Firefox Add-on",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T22:48:47+00:00",
        "description": "\"Stakeholders must be included\" throughout an agile project \"to ensure the evolving deliverables meet their expectations,\" according to an article this week in Communications of the ACM. \n\nBut long-time Slashdot reader theodp complains it's a \"gushing how-to-make-Agile-even-better opinion piece.\"\n\nLike other pieces by Agile advocates, it's long on accolades for Agile, but short on hard evidence justifying why exactly Agile project management \"has emerged as a critical component for firms looking to improve project delivery speed and flexibility\" and the use of Agile approaches is being expanded across other departments beyond software development. Indeed, among the three examples of success offered in the piece to \"highlight the effectiveness of agile methods in navigating complex stakeholder dynamics and achieving project success\" is Atlassian's use of agile practices to market and develop its products, many of which are coincidentally designed to support Agile practices and teams (",
        "id": 2026592,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/02/1948240/should-we-sing-the-praises-of-agile-or-bury-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Should We Sing the Praises of Agile, or Bury It?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T20:21:23+00:00",
        "description": "Tom's Hardware reports:\n\nFacebook's heavy-handed censorship of Linux groups and topics was \"in error,\" the social media juggernaut has admitted. Responding to reports earlier this week, sparked by the curious censorship of the eminently wholesome DistroWatch, Facebook contacted PCMag to say that it had made a mistake and that the underlying issue had been rectified. \n\n\"This enforcement was in error and has since been addressed. Discussions of Linux are allowed on our services,\" said a Meta rep to PCMag. That is the full extent of the statement reproduced by the source... Copenhagen-hosted DistroWatch says it has appealed against the Community Standards-triggered ban shortly after it noticed it was in effect (January 19). PCMag received the Facebook admission of error on January 28. The latest statement from DistroWatch, which now prefers posting on Mastodon, indicates that Facebook has lifted the DistroWatch links ban. \n\n\nMore details from PCMag:\n\nMeta didn't say what caused the crac",
        "id": 2026304,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/02/1837253/facebook-admits-linux-post-crackdown-was-in-error-fixes-moderation-error?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Facebook Admits Linux-Post Crackdown Was 'In Error', Fixes Moderation Error",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T19:16:08+00:00",
        "description": "An aircraft carrier in the U.S. Navy tested \"vastly increased\" levels of internet connectivity, reports the defense-news web site TWZ, callling it \"a game-changer for what a ship, and its sailors, can do while at sea.\"\n\nThe F-35 Joint Strike Fighters assigned to the carrier offer a case in point for what more shipboard bandwidth &mdash; provided by commercial providers like Starlink and OneWeb &mdash; can mean at the tactical level. Jets with the embarked Marine Fighter Attack Squadron 314 took on critical mission data file updates in record time last fall due to the carrier's internet innovations, a capability that is slated to expand across the fleet. \"This file offers intelligence updates and design enhancements that enable pilots to identify and counter threats in specific operational environments,\" the Navy said in an October release announcing the feat. \"The update incorporated more than 100 intelligence changes and multiple design improvements, significantly enhancing the airc",
        "id": 2025979,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/02/1756215/remote-cybersecurity-scans-and-f-35-updates-a-us-navy-aircraft-carrier-gets-high-speed-internet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Remote Cybersecurity Scans and F-35 Updates: A US Navy Aircraft Carrier Gets High-Speed Internet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T18:11:21+00:00",
        "description": "Honda calls it their \"second founding,\" as the company \"continues to target 100% electric vehicle sales by 2040, and to have 'zero environmental impact' by 2050,\" writes Green Car Reports. \"It's previously projected 40% EV sales in North America by 2030... \" \n\nHalf of the Honda Accords sold in America are already electric, &mdash; but Honda \"has admitted that it's hard to predict the trajectory of where the mix will be on the way to fully electric.\" So...\n\nTo reconcile all this, it's prepared by committing to a new template for making both EVs and gasoline models, all on the same production line. This sea change in how it makes vehicles could keep its oldest U.S. assembly plant, its Marysville, Ohio, facility that opened in 1982, humming at capacity, no matter what the market presents. As Honda confirmed last April, Marysville will truly get the automaker to the point of EV mass production in North America, with a big asterisk. It has the capability to make hundreds of EVs per day, o",
        "id": 2025700,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/02/1646255/hondas-new-us-factory-will-mass-produce-evs---but-can-also-build-gas-powered-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Honda's New US Factory Will Mass-Produce EVs - But Can Also Build Gas-Powered Cars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T17:06:06+00:00",
        "description": "\"iPhone devices are now eligible to test SpaceX-owned Starlink's direct-to-cell capability,\" Reuters reported this week, citing an announcement from T-Mobile:\n\nT-Mobile and Elon Musk's SpaceX are currently testing the Starlink cell network on a trial basis after receiving approval from the Federal Communications Commission in November last year. The trial offers 'text via satellite', while voice and data features will be added in the future, according to the T-Mobile website. T-Mobile initially only listed a few Android smartphones as eligible devices to test the network, but has now added iPhone devices with the latest iOS 18.3 software update.\n \n\nThe next day stock prices fell for several direct-to-smartphone satellite companies, reports SpaceNews:\n\n\nShares in Globalstar, which enables connectivity beyond the reach of cellular towers on the latest iPhones via a far-reaching partnership with Apple, closed down nearly 18% the following day. Constellation developer AST SpaceMobile sli",
        "id": 2025399,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/02/02/167204/iphones-and-some-android-phones-will-support-starlink-direct-to-cell-coverage-in-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "IPhones and Some Android Phones Will Support Starlink Direct-to-Cell Coverage in US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T16:05:29+00:00",
        "description": "The photography blog PetaPixel once interviewed the photographer who took one of the most famous \"Tank Man\" photos showing a tank-defying protester during 1989's Tiananmen Square protests. \n\nBut this week PetaPixel reported...\n\nA Reddit user discovered that the new Chinese LLM chatbot DeepSeek refuses to answer questions about the famous Tank Man photograph taken in Tiananmen Square in 1989. PetaPixel confirmed that DeepSeek does censor the topic. When a user types in the question, \"What famous picture has a man with grocery bags in front of tanks?\" The app begins to answer the questions but then cuts itself off. \n\nDeepSeek starts writing: \"The famous picture you're referring to is known as \"Tank Man\" or \"The Unknown Rebel.\" It was taken on June 5, 1989, during the Tiananmen...\" before a message abruptly appears reading \"Sorry, that's beyond my current scope. Let's talk about something else.\" \n\nBloomberg has more details:\n\n\nLike all other Chinese AI models, DeepSeek self-censors on t",
        "id": 2025059,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/02/0434206/deepseek-ai-refuses-to-answer-questions-about-tiananmen-square-tank-man-photo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DeepSeek AI Refuses To Answer Questions About Tiananmen Square 'Tank Man' Photo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T12:54:58+00:00",
        "description": "In 2023, Microsoft began including a free VPN feature in its \"Microsoft Defender\" security app for all Microsoft 365 subscribers (\"Personal\" and \"Family\"). Originally Microsoft had \"called it a privacy protection feature,\" writes the blog Windows Central, \"designed to let you access sensitive data on the web via a VPN tunnel.\" But....\n\nUnfortunately, Microsoft has now announced that it's killing the feature later this month, only a couple of years after it first debuted... \n\nTo add insult to injury, this announcement comes just days after Microsoft increased subscription prices across the board. Both Personal and Family subscriptions went up by three dollars a month, which the company says is the first price hike Microsoft 365 has seen in over a decade. The increased price does now include Microsoft 365 Copilot, which adds AI features to Word, PowerPoint, Excel, and others. \n\nHowever, it also comes with the removal of the free VPN in Microsoft Defender, which I've found to be much mo",
        "id": 2024093,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/02/0357206/after-copilot-price-hike-for-microsoft-365-its-ending-its-free-vpn?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After 'Copilot Price Hike' for Microsoft 365, It's Ending Its Free VPN",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T08:57:19+00:00",
        "description": "An anonymous reader shared this report from the Washington Post:\n\n\nScientists have found that using seismometers is a new and inexpensive method to detect falling space junk, which can cause damage on impact and carry toxic materials &mdash; and may someday turn deadly... \n\nIt's not an easy task to track large hunks of falling metal everywhere in the world. Ground-based radar can detect falling objects, but it doesn't cover much of the world or is often classified data, said Ben Fernando [a planetary scientist at Johns Hopkins University who is leading this research]. The other option is through optical instruments, such as doorbell cameras, but the information on the time, size and speed can be limited. Instead, Fernando turned to seismology data. Stations located around the world live-stream data, which can be easily downloaded. Seismometers have been used to track meteors in the sky for over a century, but he said this is the first time he's aware of its use for tracking space deb",
        "id": 2023380,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/01/0559217/could-earthquake-sensors-help-detect-falling-space-junk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Could Earthquake Sensors Help Detect Falling Space Junk?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T05:42:14+00:00",
        "description": "Friday TechCrunch reported that OpenAI \"used the subreddit, r/ChangeMyView to create a test for measuring the persuasive abilities of its AI reasoning models.\"\n\nThe company revealed this in a system card &mdash; a document outlining how an AI system works &mdash; that was released along with its new \"reasoning\" model, o3-mini, on Friday.... OpenAI says it collects user posts from r/ChangeMyView and asks its AI models to write replies, in a closed environment, that would change the Reddit user's mind on a subject. The company then shows the responses to testers, who assess how persuasive the argument is, and finally OpenAI compares the AI models' responses to human replies for that same post. \nThe ChatGPT-maker has a content-licensing deal with Reddit that allows OpenAI to train on posts from Reddit users and display these posts within its products. We don't know what OpenAI pays for this content, but Google reportedly pays Reddit $60 million a year under a similar deal. However, Open",
        "id": 2022878,
        "language": null,
        "link": "https://slashdot.org/story/25/02/02/0319217/openai-tests-its-ais-persuasiveness-by-comparing-it-to-reddit-posts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Tests Its AI's Persuasiveness By Comparing It to Reddit Posts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T03:32:41+00:00",
        "description": "Bill Gates' blog has been updated with short videos about his upcoming book, including one about how his school ended up with an ASR-33 teletype that could connect their Seattle classroom to a computer in California. \"The teachers faded away pretty quickly,\" Gates adds, \"But about six of us stayed hardcore. One was Paul Allen...\" &mdash; the future co-founder of Microsoft. And the experience clearly meant a lot to Gates. \"Microsoft just never would've happened without Paul &mdash; and this teletype room.\" \n\nIn a longer post thanking his \"brilliant\" teachers, Gates calls his teletype experience \"an encounter that would shape my entire future\" and \"opened up a whole new world for me.\" Gates also thanks World War II Navy pilot and Boeing engineer Bill Dougall, who \"was instrumental in bringing computer access to our school, something he and other faculty members pushed for after taking a summer computer class... The fascinating thing about Mr. Dougall was that he didn't actually know mu",
        "id": 2022604,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/02/02/0233216/slashdot-asks-do-you-remember-your-high-schools-computer-room?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Slashdot Asks:  Do You Remember Your High School's 'Computer Room'?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T01:22:37+00:00",
        "description": "On January 24th Brooklyn blogger Jeffrey Emanuel made the case for shorting NVIDIA, remembers MarketWatch, \"due to a number of shifting tides in the AI world, including the emergence of a China-based company called DeepSeek.\" \n\nHe published his 12,000-word post \"on his personal blog and then shared it with the Value Investors Club website and across Reddit, X and other platforms.\" The next day he saw 35 people read his post. \"But then the post started to go viral...\"\n\nWell-known venture capitalist Chamath Palihapitiya shared Emanuel's post on Nvidia's short case with his 1.8 million X followers. Successful early stage investor Naval Ravikant shared the post with his 2.6 million followers... Morgan Brown, a vice president of product and growth at Dropbox, pointed to it in a thread that was viewed over 13 million times. Emanuel's own X post got nearly half a million views. He also quickly gained about 13,000 followers on the platform, going from about 2,000 to more than 15,000 follower",
        "id": 2022238,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/01/2235213/one-blogger-helped-spark-nvidias-600b-stock-collapse?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "One Blogger Helped Spark NVIDIA's $600B Stock Collapse",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-02T00:17:09+00:00",
        "description": "Wednesday the Linux Foundation wrote that both \"regulatory compliance\" and \"increased cybersecurity risk\" were \"creating burdens...that must be met\" for open source communities. \n\nAnd so, as Steven J. Vaughan-Nichols writes, \"the Linux Foundation has released a comprehensive guide to help open source developers navigate the complex landscape of the U.S. Office of Foreign Assets Control (OFAC) sanctions...\"\n\nThese rules, aimed at achieving economic, foreign policy, and national security goals, apply to various interactions, including those in the open source community. The total Sanctions Programs and Country list amounts to over 17 thousand entries ranging from individuals to terrorist organizations to countries. \n\nIf that rings a bell, it's because, in October 2024, the Linux kernel developers ran right into this issue. The Linux kernel's leadership, including Greg Kroah-Hartman, the stable Linux kernel maintainer, and Linus Torvalds, Linux's founder, announced that eleven Russian k",
        "id": 2021999,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/01/2356252/us-blocks-open-source-help-from-these-countries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Blocks Open Source 'Help' From These Countries",
        "vote": 0
    }
]