[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-13T15:47:58.883432+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-13T15:30:36+00:00",
        "description": "The wait has been long for a new Mafia title, and despite Mafia: The Old Country taking the prequel approach, it presents a compelling yet sordid tale. Set in 1900s Sicily, it focuses on Enzo Favara, a carusu who escapes his predicament to become a member of Don Torrisi's family, where he's put to work.\n\nFrom stealing and killing to acting as the Don's hand in punishing his worst enemies, Enzo quickly becomes embroiled in a life that he didn't expect. Redemption is on the horizon, but what will it cost to get there? The Old Country examines familiar themes from the franchise, including greed, ego, and, of course, family, from the lens of memorable characters like Don Torrisi, his nephew Cesare, and many more.\n\nBut how does it connect to the other Mafia games? Are there any notable cameos that can be expected, especially with the number of characters born in Sicily or who have ventured to San Celeste in their lives? Join us as we examine the ending of Mafia: The Old Country and where H",
        "id": 3321178,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=pQQg1a1CkkM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pQQg1a1CkkM/hqdefault.jpg",
        "title": "Mafia: The Old Country's Ending Explained And How It Potentially Ties Into Other Games In The Series",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-13T13:37:49.015250+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-13T13:30:10+00:00",
        "description": "Kirby and the Forgotten Land - Switch 2 Edition + Star-Crossed World upgrades one of the Nintendo Switch’s most beloved 3D platformers with an upgraded base game and the new Star-Crossed Land story expansion. \n\nAfter a heart-shaped meteor strikes, Kirby must collect crystal Starries to seal away an impending evil, navigating altered landscapes and tougher enemies along the way. The feature outlines the Switch 2 versions enhancements, performance, and visual upgrades alongside new Mouthful Modes which add further imagination to traversal and combat. \n\nThe expansion also introduces revamped stages, new collectibles, and a tougher Colosseum challenge. Available August 28th, Kirby and the Forgotten Land - Switch 2 Edition + Star-Crossed World can be bought outright or as a paid upgrade for owners of the existing game.",
        "id": 3319906,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=6DQtoPquoKU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6DQtoPquoKU/hqdefault.jpg",
        "title": "Kirby And The Forgotten Land + Star-Crossed World Switch 2: 15 Things To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-13T10:22:57.193518+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-13T10:01:27+00:00",
        "description": "Echoes of the End is the first game by studio Myrkur Games, and takes place in a fantasy world where Wards are used by a nation to defend its borders. While on a border patrol mission, protagonist Ryn finds herself in the midst of a sneaky invasion by a neighbouring kingdom to weaken these Wards, and things quickly escalate from there.\n\nIn terms of gameplay, Echoes of the End wears its influences on its sleeves. When it comes to general game design, the title builds on top of a foundation that is several years old, but it manages to do so with enough polish that, while far from feeling original, still feels compelling enough. This, paired with a simple progression system that opens up combat possibilities at a good pace makes for a game that doesn’t really get boring in the long run.",
        "id": 3318522,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=x7ZbuH1O6Qw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/x7ZbuH1O6Qw/hqdefault.jpg",
        "title": "Echoes of The End Review - A Shockingly Great Game",
        "vote": 0
    }
]