[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T23:27:29.154622+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T23:10:00+00:00",
        "description": "OpenAI is paying employees more than any major tech startup in history, with average stock-based compensation hitting roughly $1.5 million per worker in 2025. \"That is more than seven times higher than the stock-based pay Google disclosed in 2003, before it filed for an initial public offering in 2004,\" reports the Wall Street Journal. \"The $1.5 million is about 34 times the average employee compensation of 18 other large tech companies in the year before they went public.\" From the report: To keep its lead in the AI race, OpenAI is doling out massive stock compensation packages to top researchers and engineers, making them some of the richest employees in Silicon Valley. The equity awards are inflating the company's heavy operating losses and diluting existing shareholders at a rapid clip. As an AI arms race intensified this summer, frontier labs such as OpenAI faced pressure to increase employee pay after Meta Platforms Chief Executive Mark Zuckerberg began offering pay packages wor",
        "id": 4446683,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/31/204215/openai-is-paying-employees-more-than-any-major-tech-startup-in-history",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Is Paying Employees More Than Any Major Tech Startup in History",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T23:27:29.274084+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T22:30:00+00:00",
        "description": "Reuters reports that the United States Department of the Treasury under the Donald Trump administration has lifted sanctions on three executives linked to the spyware firm Intellexa. Reuters reports: The move partially reverses the imposition of sanctions last year by then-President Joe Biden's administration on seven people tied to Intellexa. The Treasury Department at the time described the consortium, opens new tab, launched by former Israeli intelligence official Tal Dilian, as \"a complex international web of decentralized companies that built and commercialized a comprehensive suite of highly invasive spyware products.\"\n \nTreasury said in an email that the removal \"was done as part of the normal administrative process in response to a petition request for reconsideration.\" It added that each of the individuals had \"demonstrated measures to separate themselves from the Intellexa Consortium.\"\n \nThe notice said sanctions were lifted on Sara Hamou, whom the U.S. government accused of",
        "id": 4446684,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/31/1959207/trump-administration-removes-three-spyware-linked-execs-from-sanctions-list",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Administration Removes Three Spyware-Linked Execs From Sanctions List",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T22:19:30.275894+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T21:50:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: France intends to follow Australia and ban social media platforms for children from the start of the 2026 academic year. A draft bill preventing under-15s from using social media will be submitted for legal checks and is expected to be debated in parliament early in the new year. The French president, Emmanuel Macron, has made it clear in recent weeks that he wants France to swiftly follow Australia's world-first ban on social media platforms for under-16s, which came into force in December. It includes Facebook, Snapchat, TikTok and YouTube.\n \nLe Monde and France Info reported on Wednesday that a draft bill was now complete and contained two measures: a ban on social media for under-15s and a ban on mobile phones in high schools, where 15- to 18-year-olds study. Phones have already been banned in primary and middle schools. The bill will be submitted to France's Conseil d'Etat for legal review in the coming days. Education unions",
        "id": 4446312,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/31/1954246/france-targets-australia-style-social-media-ban-for-children-next-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "France Targets Australia-Style Social Media Ban For Children Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T22:19:30.453072+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T21:15:00+00:00",
        "description": "New Jersey has found its answer to the relentless flooding that has plagued the state's coastal and inland communities for decades: buy the homes, demolish them and turn the land back into open space permanently. The state's Blue Acres program has acquired some 1,200 properties since 1995, spending more than $234 million in federal and state funds to pay fair market value to homeowners exhausted by repeated floods from tropical storms, nor'easters, and heavy rain. \n\nA Georgetown Climate Center report this month called the program a national model, crediting its success to faster processing than federal buyout programs, stable state funding and case managers who guide each homeowner through the process. The demolished homes become grass lots that absorb rainwater far better than concrete and asphalt. \n\nManville, a borough of 11,000 at the confluence of two rivers about 25 miles southwest of Newark, has sold 120 homes to the state for roughly $22 million between 2015 and 2024. Another 5",
        "id": 4446313,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/31/1834240/njs-answer-to-flooding-it-has-bought-out-and-demolished-1200-properties",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NJ's Answer To Flooding: It Has Bought Out and Demolished 1,200 Properties",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T21:10:52.457559+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T20:30:00+00:00",
        "description": "An anonymous reader shares a report: Getting to space is hard. In many ways, getting back is even harder. NASA soon aims to pull off the kind of re-entry it last conducted more than 50 years ago: safely returning astronauts to Earth after they fly to the moon and back. The mission is a big moment for NASA, which will put a crew on its Orion ship for the first time. The flight will test the spacecraft's heat shield, designed to protect the astronauts on board. \n\nRe-entries of vehicles from orbit remain one of the high-stakes parts of any human spaceflight, given the stress they put on spacecraft. In 2003, NASA's Columbia Space Shuttle broke apart as it came back from low-Earth orbit due to a breach on the vehicle that occurred during launch. All seven astronauts on board were killed. Orion will be coming back to Earth from much further away than low-Earth orbit, where all recent human spaceflights have been conducted. That means its velocity and the energy it needs to disperse will be ",
        "id": 4445981,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/31/1826246/nasa-craft-to-face-heat-shield-test-on-its-first-astronaut-flight-next-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Craft To Face Heat-Shield Test on Its First Astronaut Flight Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T20:04:28.988134+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T19:51:00+00:00",
        "description": "JPMorgan Chase is now fighting to avoid paying $10.2 million in disputed legal charges racked up by Charlie Javice, the convicted founder of student-finance startup Frank, after court filings revealed her defense team billed more than $5 million simply for attending her fraud trial -- including on days when court wasn't even in session. \n\nA previously sealed Delaware court filing [PDF] released Monday showed that Javice's total legal tab has reached $74 million, far exceeding the $30 million Elizabeth Holmes spent defending herself in the Theranos case. JPMorgan claims the five law firms representing Javice operated under the mindset that \"someone else is paying her bills.\" The bank's filing focused on Quinn Emanuel and Mintz Levin, the two largest firms on Javice's defense. JPMorgan said Javice had between 16 and 29 lawyers and legal staff present every day of her six-week trial, billing an average of $360,000 daily. No more than four lawyers had speaking roles. \n\nAmong the 2,377 pag",
        "id": 4445632,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/31/1817247/jpmorgan-says-javice-firms-billed-millions-just-for-attendance",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "JPMorgan Says Javice Firms Billed Millions Just for 'Attendance'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T20:04:29.083287+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T19:10:00+00:00",
        "description": "The fight over net neutrality saw another turbulent year in 2025, as federal protections that seemed poised for a comeback in 2024 were first struck down by a court and then preemptively removed by the Trump administration's FCC without a chance for public comment. \n\nThe removal, The Verge summarizes in a report, was part of Chairman Brendan Carr's \"Delete, Delete, Delete\" initiative targeting what the agency deems unnecessary regulations. Federal net neutrality rules have now been on and off for 15 years, passing under Obama in 2010, returning in 2015, getting overturned in 2017, and briefly revived in 2024 before courts struck them down again. \n\nMatt Wood, vice president of policy and general counsel at nonprofit Free Press, told The Verge that ISPs often feel little financial impact from these rules. \"A lot of their complaints about the supposed 'burdens' from these rules are really just ideological in nature,\" Wood said. States have filled the void. \n\nCalifornia's 2018 law remains",
        "id": 4445633,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/31/1736226/net-neutrality-was-back-until-it-wasnt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Net Neutrality Was Back, Until It Wasn't",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T18:56:42.019802+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T18:30:00+00:00",
        "description": "A large-scale study tracking more than 27,500 middle-aged and elderly people over roughly nine years has found that poor sleep quality is associated with accelerated brain aging, and chronic inflammation appears to be one of the key mechanisms driving this effect. \n\nResearchers at Sweden's Karolinska Institute assessed participants' sleep across five dimensions -- chronotype, duration, insomnia, snoring and daytime sleepiness -- and later scanned their brains using MRI to estimate biological brain age through machine learning models. The results? For every point decrease in healthy sleep score, the gap between brain age and chronological age widened by approximately six months. Those in the poorest sleep category had brains that appeared roughly one year older than their actual age. \n\nNight-owl tendencies, sleep duration outside the 7-8 hour sweet spot and snoring were particularly strongly linked to brain aging. The researchers measured low-grade inflammation using biomarkers includi",
        "id": 4445190,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/31/1716233/poor-sleep-quality-accelerates-brain-aging",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Poor Sleep Quality Accelerates Brain Aging",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T17:45:56.770153+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T17:00:00+00:00",
        "description": "Another year wraps up, and with it comes the annual ritual of taking stock. What were the movies, TV shows and books from this year that stood out to you? Not necessarily the ones that dominated conversation or topped charts, but the ones you found yourself recommending to friends, or returning to for a second watch or read. \n\nShare your picks and, if you're inclined, a line or two on what made them stick.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Slashdot+Asks%3A+Your+Favorite+2025+Movies%2C+TV+Shows+and+Books%3F%3A+https%3A%2F%2Fask.slashdot.org%2Fstory%2F25%2F12%2F31%2F1643240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fask.slashdot.org%2Fstory%2F25%2F12%2F31%2F1643240%2Fslashdot-asks-your-favorite-2025-movies-tv-shows-and-books%3Futm_source%3Dslashdot%26utm_medium%3",
        "id": 4444694,
        "language": "en-us",
        "link": "https://ask.slashdot.org/story/25/12/31/1643240/slashdot-asks-your-favorite-2025-movies-tv-shows-and-books",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Slashdot Asks: Your Favorite 2025 Movies, TV Shows and Books?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T17:45:56.922839+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T16:40:00+00:00",
        "description": "Colossal Biosciences, the Texas-based startup now valued at more than $10 billion that has attracted investments from Paris Hilton, Peter Jackson and Tom Brady, claimed earlier this year to have resurrected the dire wolf -- an animal that disappeared at the end of the last ice age -- but a group of leading canid experts concluded the company had done no such thing. \n\nThe scientists found that Colossal had made 20 edits to the DNA of grey wolves and the resulting animals did not substantially differ from wolves currently roaming North America. Beth Shapiro, Colossal's own chief scientist, acknowledged to New Scientist: \"It's not possible to bring something back that is identical to a species that used to be alive. Our animals are grey wolves with 20 edits that are cloned.\" \n\nNic Rawlence, director of the palaeogenetics laboratory at the University of Otago in New Zealand, added: \"Rather than true de-extinction, Colossal's attempts are genetically engineered poor copies at best, passed ",
        "id": 4444695,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/31/1630256/can-colossals-genetically-engineered-animals-ever-be-the-real-thing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Can Colossal's Genetically Engineered Animals Ever Be the Real Thing?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T16:33:48.856451+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T16:01:00+00:00",
        "description": "Starting in July 2026, every public school district in California will be required to have policies on the books that restrict or prohibit students from using smartphones during the school day, thanks to Assembly Bill 3216 that Governor Gavin Newsom signed into law back in 2024. \n\nThe legislation also mandates that districts update these policies every five years. Newsom had previously signed related legislation in 2019, though that earlier law merely affirmed that school districts have the authority to regulate smartphone use rather than requiring them to do so.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=California+To+Require+All+School+Districts+To+Restrict+Student+Smartphone+Use+by+2026%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F31%2F1534251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.c",
        "id": 4444240,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/31/1534251/california-to-require-all-school-districts-to-restrict-student-smartphone-use-by-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California To Require All School Districts To Restrict Student Smartphone Use by 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T16:33:49.027834+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T15:21:00+00:00",
        "description": "Finnish authorities on Wednesday seized a vessel suspected of severing an undersea telecommunications cable that connects Helsinki to Tallinn by dragging its anchor across the Gulf of Finland, the latest in a string of infrastructure incidents that have put Baltic Sea nations on edge since Russia's 2022 invasion of Ukraine. \n\nPolice are investigating the case as aggravated criminal damage and have not disclosed the ship's name, nationality or details about its crew. The cable belongs to Finnish telecoms group Elisa. Estonia's justice ministry reported that a second telecoms cable connecting the two countries -- owned by Sweden's Arelion -- also went down on Wednesday. This follows Finland's December 2024 boarding of the Russian-linked oil tanker Eagle S, which investigators said damaged a power cable and multiple telecoms links using the same anchor-dragging method. A Finnish court in October dismissed criminal charges against the Eagle S crew after prosecutors failed to prove intent.",
        "id": 4444241,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/31/155232/finland-seizes-ship-suspected-of-severing-undersea-cable-to-estonia",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Finland Seizes Ship Suspected of Severing Undersea Cable To Estonia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T15:24:13.240530+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T14:40:00+00:00",
        "description": "China's Commerce Ministry on Wednesday demanded that the Netherlands \"immediately correct its mistakes\" over chipmaker Nexperia, escalating a standoff that has disrupted global semiconductor supply chains and triggered warnings from automakers about component shortages. The Dutch government in September invoked a Cold War-era law to effectively seize control of the Chinese-owned chipmaker, reportedly after the United States raised security concerns. China responded by blocking Nexperia products from leaving the country. \n\nNexperia manufactures billions of foundation chips -- transistors, diodes and power management components -- that are produced in Europe, assembled and tested in China, and then re-exported to customers worldwide. These low-tech, inexpensive chips are essential in almost every device that uses electricity, from car braking systems and airbag controllers to electric windows and entertainment systems. \n\nThe Commerce Ministry spokesperson said the Netherlands \"remains i",
        "id": 4443732,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/31/0843244/china-demands-netherlands-correct-mistakes-over-seized-chipmaker-as-auto-supply-crunch-deepens",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Demands Netherlands 'Correct Mistakes' Over Seized Chipmaker as Auto Supply Crunch Deepens",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T14:15:51.241922+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T14:00:00+00:00",
        "description": "The U.S. has surpassed 2,000 measles cases for the first time in more than 30 years, according to data from the Centers for Disease Control and Prevention. From a report: As of Dec. 23, a total of 2,012 cases have been reported in the U.S. Of those cases, 24 were reported among international visitors to the U.S.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Measles+Cases+Surpass+2%2C000%2C+Highest+in+30+Years%3A+CDC%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F31%2F1335203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F31%2F1335203%2Fus-measles-cases-surpass-2000-highest-in-30-years-cdc%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https:",
        "id": 4443285,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/31/1335203/us-measles-cases-surpass-2000-highest-in-30-years-cdc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Measles Cases Surpass 2,000, Highest in 30 Years: CDC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T14:15:51.345734+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T13:00:00+00:00",
        "description": "Longtime Slashdot reader ptorrone writes: The January 1, 2026, NYC mayoral inauguration prohibits attendees from bringing specific brand-name devices, explicitly banning Raspberry Pi single-board computers and the Flipper Zero, listed alongside weapons, explosives, and drones. Rather than restricting behaviors or capabilities like signal interference or unauthorized transmitters, the policy names two widely used educational and testing tools while allowing smartphones and laptops that are far more capable. Critics argue this device-specific ban creates confusion, encourages selective enforcement, and reflects security theater rather than a clear, capability-based public safety framework. New York has handled large-scale events more pragmatically before.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=NYC+Inauguration+Bans+Raspberry+Pi%2C+Flipper+Zero+Devices%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F12%2F",
        "id": 4443286,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/31/005202/nyc-inauguration-bans-raspberry-pi-flipper-zero-devices",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NYC Inauguration Bans Raspberry Pi, Flipper Zero Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T10:47:43.194150+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T10:00:00+00:00",
        "description": "PostNord is ending letter delivery in Denmark after a 90%+ collapse in mail volume. It marks the first known case of a national postal carrier abandoning letters entirely -- a symbolic milestone of a fully digitized society that's sparking nostalgia even among people who stopped sending mail years ago. The New York Times reports: Denmark has had a postal service for more than 400 years. But a steep decline in its use has led the Nordic country's longtime postal carrier to stop letter deliveries entirely, a change taking effect on Tuesday.\n \nDanes have seen it coming for months: The carrier, PostNord, has been removing its red mailboxes, once a ubiquitous public fixture. The disappearance of the mailboxes is \"what actually made people emotional,\" said Julia Lahme, a trend researcher and the director of Lahme, a Danish communications agency, \"even though most of them hadn't sent a letter in 18 months.\"\n \nLetter writing in the country has declined by more than 90 percent since 2000, acco",
        "id": 4442115,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/31/0012244/denmarks-main-postal-carrier-ends-letter-delivery",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark's Main Postal Carrier Ends Letter Delivery",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T07:23:28.736414+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T07:00:00+00:00",
        "description": "Israel has operationally deployed Iron Beam, a 100,000-watt laser air-defense system capable of shooting down drones, rockets, and mortars at negligible per-shot cost. According to Tom's Hardware, it marks the first real-world deployment of a high-energy laser as part of a modern, multi-layered missile defense network. From the report: The Iron Beam is a short-range line-of-sight laser interceptor that is extremely cheap to run and, therefore, perfectly suited for intercepting low-cost, high-volume threats. According to the official Israeli announcement, Iron Beam systems have \"successfully intercepted rockets, mortars, and UAVs.\"\n \nA complex mix of government, military, scientific, and commercial interests were responsible for the research and development of the Iron Beam laser system. Central to the Iron Beam are \"an advanced laser source and a unique electro-optical targeting system, enabling the interception of a wide range of targets at an enhanced operational range, with maximum",
        "id": 4441289,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/31/0020214/israel-deploys-worlds-first-drone-defense-laser",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Israel Deploys World's First Drone Defense Laser",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T04:08:41.757000+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: South Africans ... have found a remedy for power cuts that have plagued people in the developing world for years. Thanks to swiftly falling prices of Chinese made solar panels and batteries, they now draw their power from the sun. These aren't the tiny, old-school solar lanterns that once powered a lightbulb or TV in rural communities. Today, solar and battery systems are deployed across a variety of businesses -- auto factories and wineries, gold mines and shopping malls. And they are changing everyday life, trade and industry in Africa's biggest economy. This has happened at startling speed. Solar has risen from almost nothing in 2019 to roughly 10 percent of South Africa's electricity-generating capacity.\n \nNo longer do South Africans depend entirely on giant coal-burning plants that have defined how people worldwide got their electricity for more than a century. That's forcing the nation's already beleaguered electric ut",
        "id": 4440630,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/31/001211/cheap-solar-is-transforming-lives-and-economies-across-africa",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cheap Solar Is Transforming Lives and Economies Across Africa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T03:01:29.575341+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T02:02:00+00:00",
        "description": "In an opinion piece for Computerworld, columnist Steven Vaughan-Nichols argues that restrictive visa policies and a hostile border climate under the Trump administration are driving foreign tech workers, researchers, and conference speakers away from the U.S. The result, he says, is a gradual shift of talent, events, and long-term innovation toward more welcoming regions such as Europe, Canada, and Asia. From the report: I go to a lot of tech conferences -- 13 in 2025 -- and many of those I attend are outside the U.S.; several are in London, one is in Amsterdam, another in Paris, and two in Tokyo. Wherever I went this past year, when we weren't talking about AI, Linux, the cloud, or open-source software, the top non-tech topic for non-Americans involved the sweeping changes that have occurred since President Donald J. Trump returned to office last January. The conversations generally ended with something like this: \"I'm not taking a job or going to a conference in the United States.\"\n",
        "id": 4440414,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/30/2341244/foreign-tech-workers-are-avoiding-travel-to-the-us",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Foreign Tech Workers Are Avoiding Travel To the US'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T01:55:13.159165+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T01:25:00+00:00",
        "description": "One-Netbook has unveiled the OneXSugar Wallet, the first gaming handheld with a folding OLED display. The Verge reports: The OneXSugar Wallet was announced on China's Weibo yesterday, but with few details about its features and capabilities. That folding OLED screen has a resolution of 2480 x 1860 pixels, and the handheld will be powered by an unspecified \"Qualcomm gaming platform flagship processor,\" but its performance and emulation capabilities are unknown.\n \nBased on photos and a video released by One-Netbook, the OneXSugar Wallet will feature a standard set of controls including asymmetrical thumbsticks, four action buttons, and a D-pad situated on either side of the lower half of its display. There are also shoulder buttons and triggers on the back of the handheld, and a pair of front-facing speakers flanking the top half of the screen. The biggest question is how much will the handheld cost...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=",
        "id": 4440135,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/12/30/2335237/first-gaming-handheld-with-a-folding-screen",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "First Gaming Handheld With a Folding Screen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T01:55:13.427266+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T00:45:00+00:00",
        "description": "PC Gamer argues that 2025 was a year full of high-profile AI embarrassments across games and entertainment, with Disney and Lucasfilm serving as the \"opening salvo.\" From the report: At a TED talk back in April, Lucasfilm senior vice president of creative innovation Rob Bredow presented a demonstration of what he called \"a new era of technology.\" Across 50 years of legendary innovation in miniature design, practical effects, and computer animation, Lucasfilm and its miracle workers at Industrial Light &amp; Magic have blazed the trail for visual effects in creative storytelling -- and now Bredow was offering a glimpse at what wonders might come next.\n \nThat glimpse, created over two weeks by an ILM artist, was Star Wars: Field Guide: a two-minute fizzle reel of AI-generated blue lions, tentacled walruses, turtles with alligator heads, and zebra-stripe chimpanzees, all lazily spliced together from the shuffled bits of normal-ass animals. These \"aliens\" were less Star Wars than they wer",
        "id": 4440136,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/30/2043241/2025-was-the-year-of-creative-bankruptcy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'2025 Was the Year of Creative Bankruptcy'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-31T00:45:27.181279+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-31T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from DW: India has surpassed Japan to become the world's fourth-largest economy, according to calculations in the Indian government's end-of-year economic review. On current trends, India is expected to overtake Germany to become the world's third-largest economy within the next three years, the review said.\n \nThe review said India's gross domestic product has already reached about $4.18 trillion, and is projected to reach $7.3 trillion by 2030. On current trends, it said, India would trail only the United States and China in economic heft. India's real GDP grew 8.2% in the second quarter of the 2025-26 financial year, up from 7.8% in the previous quarter and marking a six-quarter high.\n \nExport performance has also strengthened, the review noted. Merchandise exports rose to $38.13 billion in November, up from $36.43 billion in January, supported by engineering goods, electronics, pharmaceuticals, and petroleum products. Official confirmation howeve",
        "id": 4439842,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/30/2025244/india-overtakes-japan-as-4th-largest-economy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India Overtakes Japan As 4th-Largest Economy",
        "vote": 0
    }
]