[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T23:05:53.015677+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T22:40:00+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: Apple provided governments around the world with data related to thousands of push notifications sent to its devices, which can identify a target's specific device or in some cases include unencrypted content like the actual text displayed in the notification, according to data published by Apple. In one case, that Apple did not ultimately provide data for, Israel demanded data related to nearly 700 push notifications as part of a single request. The data for the first time puts a concrete figure on how many requests governments around the world are making, and sometimes receiving, for push notification data from Apple.\n \nThe practice first came to light in 2023 when Senator Ron Wyden sent a letter to the U.S. Department of Justice revealing the practice, which also applied to Google. As the letter said, \"the data these two companies receive includes metadata, detailing which app received a notification and when, as well as the phone",
        "id": 2851513,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/04/2135246/apple-gave-governments-data-on-thousands-of-push-notifications?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Gave Governments Data On Thousands of Push Notifications",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T23:05:53.177511+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T22:02:00+00:00",
        "description": "At the Axios AI+ Summit, DreamWorks co-founder Jeffrey Katzenberg compared the rise of AI in entertainment to the CGI revolution of the 1990s, emphasizing that those who adapt to the technology will thrive. He argued AI won't replace people -- but will replace those who don't embrace it. Axios reports: Katzenberg, a co-founder of DreamWorks and one-time Disney executive whose work includes films like \"Shrek,\" reflected on the \"huge\" resistance to making \"Toy Story\" with the then-novel CGI technology. The people most afraid were the ones who would be disrupted, he said. \"Everything that you are hearing today are the issues that we had to deal with,\" he said.\n \nKatzenberg continued, \"Yes, there was disruption, but animation's never, ever been bigger than it is today.\" The bottom line: \"AI isn't going to replace people, it's going to replace people that don't use AI,\" he said. \"The exact same analogy there ... is that the talent that went and learned how to use the computer as a new penc",
        "id": 2851514,
        "language": null,
        "link": "https://slashdot.org/story/25/06/04/2128246/dreamworks-co-founder-katzenberg-likens-ai-to-cgi-revolution?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DreamWorks Co-Founder Katzenberg Likens AI To CGI Revolution",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T22:00:51.689171+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T21:26:00+00:00",
        "description": "Announced in an internal memo from Microsoft CEO Satya Nadella, LinkedIn CEO Ryan Roslansky has been appointed to also lead the Office, Outlook, and Microsoft 365 Copilot teams as part of an internal AI reorganization. Roslansky will report to Rajesh Jha for Office while continuing to run LinkedIn independently under Nadella. The Verge reports: \"LinkedIn remains a top priority and will continue to operate as an independent subsidiary,\" says Nadella in his memo. \"This move brings us closer to the original vision we laid out nine years ago with the LinkedIn acquisition: connecting the world's economic graph with the Microsoft Graph. And I look forward to how Ryan will bring his product ethos and leadership to entertainment and devices.\" Sumit Chauhan and Gaurav Sareen, senior executives in the Office and Microsoft 365 teams, will remain on the entertainment and devices leadership team, but along with their teams they'll join Jon Friedman and the UX team to work directly for Roslansky.\n ",
        "id": 2851095,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/04/2124235/microsofts-linkedin-chief-is-now-running-office?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft's LinkedIn Chief Is Now Running Office",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T22:00:51.859823+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T20:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: OpenAI is now fighting a court order (PDF) to preserve all ChatGPT user logs&mdash;including deleted chats and sensitive chats logged through its API business offering -- after news organizations suing over copyright claims accused the AI company of destroying evidence. \"Before OpenAI had an opportunity to respond to those unfounded accusations, the court ordered OpenAI to 'preserve and segregate all output log data that would otherwise be deleted on a going forward basis until further order of the Court (in essence, the output log data that OpenAI has been destroying),\" OpenAI explained in a court filing (PDF) demanding oral arguments in a bid to block the controversial order.\n \nIn the filing, OpenAI alleged that the court rushed the order based only on a hunch raised by The New York Times and other news plaintiffs. And now, without \"any just cause,\" OpenAI argued, the order \"continues to prevent OpenAI from respecting its users'",
        "id": 2851096,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/04/2039245/openai-slams-court-order-to-save-all-chatgpt-logs-including-deleted-chats?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Slams Court Order To Save All ChatGPT Logs, Including Deleted Chats",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T19:50:51.614595+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T18:50:00+00:00",
        "description": "Reddit is suing AI startup Anthropic for what it's calling a breach of contract and for engaging in \"unlawful and unfair business acts\" by using the social media company's platform and data without authority. From a report: The lawsuit, filed in San Francisco on Wednesday, claims that Anthropic has been training its models on the personal data of Reddit users without obtaining their consent. Reddit alleges that it has been harmed by the unauthorized commercial use of its content. \n\nThe company opened the complaint by calling Anthropic a \"late-blooming\" AI company that \"bills itself as the white knight of the AI industry.\" Reddit follows by saying, \"It is anything but.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Reddit+Sues+AI+Startup+Anthropic+For+Breach+of+Contract%2C+'Unfair+Competition'%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F06%2F04%2F1827213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img sr",
        "id": 2850038,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/04/1827213/reddit-sues-ai-startup-anthropic-for-breach-of-contract-unfair-competition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reddit Sues AI Startup Anthropic For Breach of Contract, 'Unfair Competition'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T18:44:36.380732+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T18:20:00+00:00",
        "description": "king*jojo shares a report: Linux desktop darling KDE is weighing in on the controversy around the impending demise of Windows 10 support with a lurid \"KDE for Windows 10 Exiles\" campaign. KDE's alarming \"Exiles\" page opens with the text \"Your computer is toast\" followed by a warning that Microsoft wants to turn computers running Windows 10 into junk from October 14. \n\n\"It may seem like it continues to work after that date for a bit, but when Microsoft stops support for Windows 10, your perfectly good computer will be officially obsolete.\" Beneath a picture of a pile of tech junk, including a rotary telephone and some floppy drives, KDE proclaims: \"Windows 10 will degrade as more and more bugs come to light. With nobody to correct them, you risk being hacked. Your data, identity, and control over your device could be stolen.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=KDE+Targets+Windows+10+'Exiles'+Claiming+'You",
        "id": 2849551,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/04/186206/kde-targets-windows-10-exiles-claiming-your-computer-is-toast?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "KDE Targets Windows 10 'Exiles' Claiming 'Your Computer is Toast'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T18:44:36.545017+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T17:30:00+00:00",
        "description": "Researchers in Japan have developed a plastic that dissolves in seawater within hours, offering up a potential solution for a modern-day scourge polluting oceans and harming wildlife. From a report: While scientists have long experimented with biodegradable plastics, researchers from the RIKEN Center for Emergent Matter Science and the University of Tokyo say their new material breaks down much more quickly and leaves no residual trace. \n\nAt a lab in Wako city near Tokyo, the team demonstrated a small piece of plastic vanishing in a container of salt water after it was stirred up for about an hour. While the team has not yet detailed any plans for commercialisation, project lead Takuzo Aida said their research has attracted significant interest, including from those in the packaging sector.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Scientists+in+Japan+Develop+Plastic+That+Dissolves+in+Seawater+Within+Hours%3A+h",
        "id": 2849552,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/04/1718212/scientists-in-japan-develop-plastic-that-dissolves-in-seawater-within-hours?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists in Japan Develop Plastic That Dissolves in Seawater Within Hours",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T17:39:35.665954+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T16:54:00+00:00",
        "description": "A group of financially motivated cyberscammers who specialize in Scattered-Spider-like fake IT support phone calls managed to trick employees at about 20 organizations into installing a modified version of Salesforce's Data Loader that allows the criminals to steal sensitive data. From a report: Google Threat Intelligence Group (GTIG) tracks this crew as UNC6040, and in research published today said they specialize in voice-phishing campaigns targeting Salesforce instances for large-scale data theft and extortion. \n\nThese attacks began around the beginning of the year, GTIG principal threat analyst Austin Larsen told The Register. \"Our current assessment indicates that a limited number of organizations were affected as part of this campaign, approximately 20,\" he said. \"We've seen UNC6040 targeting hospitality, retail, education and various other sectors in the Americas and Europe.\" The criminals are really good at impersonating IT support personnel and convincing employees at English",
        "id": 2848995,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/04/1654250/fake-it-support-calls-hit-20-orgs-end-in-stolen-salesforce-data-and-extortion-google-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fake IT Support Calls Hit 20 Orgs, End in Stolen Salesforce Data and Extortion, Google Warns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T16:34:51.810819+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T15:43:00+00:00",
        "description": "OpenAI is expanding ChatGPT's enterprise capabilities with new integrations that connect the chatbot directly to business cloud services and productivity tools. The Microsoft-backed startup announced connectors for Dropbox, Box, SharePoint, OneDrive and Google Drive that allow ChatGPT to search across users' organizational documents and files to answer questions, such as helping analysts build investment theses from company slide decks. \n\nThe update includes meeting recording and transcription features that generate timestamped notes and suggest action items, competing directly with similar offerings from ClickUp, Zoom, and Notion. OpenAI also introduced beta connectors for HubSpot, Linear, and select Microsoft and Google tools for deep research reports, plus Model Context Protocol support for Pro, Team, and Enterprise users.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=ChatGPT+Adds+Enterprise+Cloud+Integrations+F",
        "id": 2848359,
        "language": null,
        "link": "https://slashdot.org/story/25/06/04/1543234/chatgpt-adds-enterprise-cloud-integrations-for-dropbox-box-onedrive-google-drive-meeting-transcription?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ChatGPT Adds Enterprise Cloud Integrations For Dropbox, Box, OneDrive, Google Drive, Meeting Transcription",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T16:34:51.975026+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T15:22:00+00:00",
        "description": "Major Hollywood studios are extensively using AI tools while avoiding public disclosure, according to industry sources interviewed by New York Magazine. Nearly 100 AI studios now operate in Hollywood with every major studio reportedly experimenting with generative AI despite legal uncertainties surrounding copyright training data, the report said. \n\nLionsgate has partnered with AI company Runway to create a customized model trained on the studio's film archive, with executives planning to generate entire movie trailers from scripts before shooting begins. The collaboration allows the studio to potentially reduce production costs from $100 million to $50 million for certain projects. \n\nWidespread usage of the new technology is often happening through unofficial channels. Workers are reporting pressure to use AI tools without formal studio approval, then \"launder\" the AI-generated content through human artists to obscure its origins.<p><div class=\"share_submission\" style=\"position:relat",
        "id": 2848360,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/06/04/1519210/hollywood-already-uses-generative-ai-and-is-hiding-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hollywood Already Uses Generative AI (And Is Hiding It)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T15:27:52.066623+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T14:46:00+00:00",
        "description": "An anonymous reader shares a report: The IRS open sourced much of its incredibly popular Direct File software as the future of the free tax filing program is at risk of being killed by Intuit's lobbyists and Donald Trump's megabill. Meanwhile, several top developers who worked on the software have left the government and joined a project to explore the \"future of tax filing\" in the private sector. \n\nDirect File is a piece of software created by developers at the US Digital Service and 18F, the former of which became DOGE and is now unrecognizable, and the latter of which was killed by DOGE. Direct File has been called a \"free, easy, and trustworthy\" piece of software that made tax filing \"more efficient.\" About 300,000 people used it last year as part of a limited pilot program, and those who did gave it incredibly positive reviews, according to reporting by Federal News Network. \n\nBut because it is free and because it is an example of government working, Direct File and the IRS's Fre",
        "id": 2847746,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/04/1447205/the-irs-tax-filing-software-turbotax-is-trying-to-kill-just-got-open-sourced?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The IRS Tax Filing Software TurboTax Is Trying To Kill Just Got Open Sourced",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T14:22:53.189064+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T14:00:00+00:00",
        "description": "theodp writes: Way back in 2010, Microsoft and Google teamed with nonprofit partners to launch Computing in the Core, an advocacy coalition whose mission was \"to strengthen computing education and ensure that it is a core subject for students in the 21st century.\" In 2013, Computing in the Core was merged into Code.org, a new tech-backed-and-directed nonprofit. And in 2015, Code.org declared 'Mission Accomplished' with the passage of the Every Student Succeeds Act, which elevated computer science to a core academic subject for grades K-12. \n\nFast forward to June 2025 and Code.org has changed its About page to reflect a new AI mission that's near-and-dear to the hearts of Code.org's tech giant donors and tech leader Board members: \"Code.org is a nonprofit working to make computer science (CS) and artificial intelligence (AI) a core part of K-12 education for every student.\" The mission change comes as tech companies are looking to chop headcount amid the AI boom and just weeks after te",
        "id": 2847065,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/04/1323220/codeorg-changes-mission-to-make-cs-and-ai-a-core-part-of-k-12-education?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Code.org Changes Mission To 'Make CS and AI a Core Part of K-12 Education'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T14:22:53.349240+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T13:00:00+00:00",
        "description": "Morgan Stanley has deployed an in-house AI tool called DevGen.AI that has reviewed nine million lines of legacy code this year, saving the investment bank's developers an estimated 280,000 hours by translating outdated programming languages into plain English specifications that can be rewritten in modern code. \n\nThe tool, built on OpenAI's GPT models and launched in January, addresses what Mike Pizzi, the company's global head of technology and operations, calls one of enterprise software's biggest pain points -- modernizing decades-old code that weakens security and slows new technology adoption. While commercial AI coding tools excel at writing new code, they lack expertise in older or company-specific programming languages like Cobol, prompting Morgan Stanley to train its own system on its proprietary codebase. \n\nThe tool's primary strength, the bank said, lies in creating English specifications that map what legacy code does, enabling any of the company's 15,000 developers worldw",
        "id": 2847066,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/04/1233253/morgan-stanley-says-its-ai-tool-processed-9-million-lines-of-legacy-code-this-year-and-saved-280000-developer-hours?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Morgan Stanley Says Its AI Tool Processed 9 Million Lines of Legacy Code This Year And Saved 280,000 Developer Hours",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T14:22:53.486762+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T12:00:00+00:00",
        "description": "Code generation startups are attracting extraordinary investor interest two years after ChatGPT's launch, with companies like Cursor raising $900 million at a $10 billion valuation despite operating with negative gross margins. OpenAI is reportedly in talks to acquire Windsurf, maker of the Codeium coding tool, for $3 billion, while the startup generates $50 million in annualized revenue from a product launched just seven months ago. \n\nThese \"vibe coding\" platforms allow users to write software using plain English commands, attempting to fundamentally change how code gets written. Cursor went from zero to $100 million in recurring revenue in under two years with just 60 employees, though both major startups spend more money than they generate, Reuters reports, citing investor sources familiar with their operations. \n\nThe surge comes as major technology giants report significant portions of their code now being AI-generated -- Google claims over 30% while Microsoft reports 20-30%. Mean",
        "id": 2847067,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/04/0820246/ai-startups-revolutionize-coding-industry-leading-to-sky-high-valuations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Startups Revolutionize Coding Industry, Leading To Sky-High Valuations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T14:22:53.599389+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T10:00:00+00:00",
        "description": "Anne Wojcicki has asked a U.S. judge to reopen the auction for 23andMe, claiming she has backing from a $400+ billion Fortune 500 company. Reuters reports: South San Francisco, California-based 23andMe filed for bankruptcy in March, seeking to sell its business at auction after a decline in consumer demand and a 2023 data breach that exposed sensitive genetic and personal information of millions of customers. Last month, Regeneron Pharmaceuticals agreed to buy the firm for $256 million, topping a $146 million bid from Wojcicki and TTAM Research Institute, which was founded by Wojcicki and describes itself as a California non-profit public benefit corporation.\n \nIn a filing dated May 31, Wojcicki claimed that 23andMe's debtors had attempted to tilt the sales process away from TTAM and in favor of Regeneron. TTAM and Wojcicki said in the filing that 23andMe's financial and legal advisers unfairly capped their maximum bid at $250 million due to misplaced concerns about TTAM's \"financial ",
        "id": 2847068,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/04/0243240/23andme-founder-aims-to-restart-auction-with-major-corporate-backing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "23andMe Founder Aims To Restart Auction With Major Corporate Backing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T07:11:05.846926+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T07:00:00+00:00",
        "description": "The James Webb Space Telescope has discovered the most distant galaxy ever observed, named MoM z14. NASA estimates it existed just 280 million years after the Big Bang. Space.com reports: Prior to the discovery of MoM z14, the galaxy holding the title of earliest and distant was JADES-GS-z14-0, which existed just 300 million years after the Big Bang, or around 13.5 billion years ago. This previous record galaxy has a redshift of z =14.32, while MoM z14 has a redshift of z = 14.44. There is a wider context to the observation of MoM z14 than the fact that it has broken the record for earliest known galaxy by 20 million years, though, as [explained team member and Yale University professor of Astronomy and Physics Pieter van Dokkum].\n \nThe researchers were able to determine that MoM z14 is around 50 times smaller than the Milky Way. The team also measured emission lines from the galaxy, indicating the presence of elements like nitrogen and carbon. \"The emission lines are unusual; it indi",
        "id": 2844479,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/04/0231211/james-webb-space-telescope-discovers-the-earliest-galaxy-ever-seen?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "James Webb Space Telescope Discovers the Earliest Galaxy Ever Seen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T05:02:04.965296+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T04:45:00+00:00",
        "description": "The CEO of Indian grocery ordering app KiranaPro has claimed an attacker deleted its GitHub and AWS resources in a targeted and deliberate attack and vowed to name the perpetrator. From a report: KiranaPro lets users shop at \"Kiranas,\" the Indian equivalent of convenience stores, which mostly stock basic foodstuffs. Users of the app place an order, which KiranaPro sends to nearby Kiranas who bid to win the sale. The winner arranges delivery of the goods. The elapsed time from ordering to delivery seldom tops 20 minutes. \n\nKiranaPro CEO Deepak Ravindran claims the app \"powers the livelihoods of thousands of Kirana store owners\" and handles 2,000-plus orders each day. Ravindran also claims the app was destroyed by someone who holds a grudge. \"Our startup @Kirana_Pro was deliberately hacked -- entire GitHub repo &amp; AWS data wiped. Logs suggest malicious insider action,\" he wrote on June 3rd. The attack happened last week, and the app has been inoperable since.<p><div class=\"share_subm",
        "id": 2843870,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/04/0442240/deliberate-attack-deletes-shopping-apps-aws-and-github-resources?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Deliberate Attack' Deletes Shopping App's AWS and GitHub Resources",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T03:56:05.919861+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from IEEE Spectrum: In a development straight out of science fiction, Australian startup Cortical Labs has released what it calls the world's first code-deployable biological computer. The CL1, which debuted in March, fuses human brain cells on a silicon chip to process information via sub-millisecond electrical feedback loops. Designed as a tool for neuroscience and biotech research, the CL1 offers a new way to study how brain cells process and react to stimuli. Unlike conventional silicon-based systems, the hybrid platform uses live human neurons capable of adapting, learning, and responding to external inputs in real time. \"On one view, [the CL1] could be regarded as the first commercially available biomimetic computer, the ultimate in neuromorphic computing that uses real neurons,\" says theoretical neuroscientist Karl Friston of University College London. \"However, the real gift of this technology is not to computer science. Rather, it's an enab",
        "id": 2843620,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/03/2155239/world-first-biocomputing-platform-hits-the-market?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World-First Biocomputing Platform Hits the Market",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T01:46:59.218520+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T01:00:00+00:00",
        "description": "Ars Technica's Benj Edwards reports: In 1979, Atari released the Atari 400 and 800, groundbreaking home computers that included custom graphics and sound chips, four joystick ports, and the ability to run the most advanced home video games of their era. These machines, which retailed for $549 and $999, respectively, represented a leap in consumer-friendly personal computing, with their modular design and serial I/O bus that presaged USB. Now, 46 years later, a hobbyist has shrunk down the system hardware to a size that would have seemed like science fiction in the 1970s.\n \nPolish engineer Piotr \"Osa\" Ostapowicz recently unveiled \"Atarino,\" which may be the world's smallest 8-bit Atari computer re-creation, according to retro computing site Atariteca. The entire system -- processor, graphics chips, sound hardware, and memory controllers -- fits on a module measuring just 2x1.5 centimeters (about 0.79x0.59 inches), which is roughly the size of a postage stamp.\n \nOstapowicz's creation re",
        "id": 2843142,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/03/226213/polish-engineer-creates-postage-stamp-sized-1980s-atari-computer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Polish Engineer Creates Postage Stamp-Sized 1980s Atari Computer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T00:41:04.776218+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T00:20:00+00:00",
        "description": "According to Automotive News (paywalled), the $17,190 base-model Nissan Versa S -- the last U.S.-market production car with a five-speed manual -- is ending production. A Nissan spokesperson told Auto News that the company is \"trimming the fat\" to focus on models with the strongest business performance -- and the manual Versa S didn't make the cut. The Drive reports: Looks like Nissan is trying to create as much savings as possible to handle the 25% tariff on cars imported from Mexico. [...] When you go to Nissan's site and check out the Versa, the first thing you see under its name is \"Get the Nissan you want free from new tariffs.\" So if Nissan is going to eat the additional tariff cost for customers, it can't be manufacturing cars that won't sell well. And manuals reportedly only accounted for 5% of Versa sales in 2024.\n \nAs the manual Versa dies, it brings the five-speed manual transmission down with it. What was once a common drivetrain configuration is now a memory -- when the l",
        "id": 2842896,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/03/2212256/the-last-5-speed-manual-in-the-us-is-gone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Last 5-Speed Manual In the US Is Gone",
        "vote": 0
    }
]