[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T16:07:08.623748+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T15:30:19+00:00",
        "description": "With how far off The Witcher 4 seems from launch - CD Projekt RED hasn't even announced platforms - it was somewhat surprising to see a full showcase at the latest State of Unreal. It focused on Ciri venturing through Kovir in pursuit of a Manticore with the aid of her steed, Kelpie. Throughout this journey, we learn more about the Unreal Engine 5 features in the sequel and Valdrest, a new location.\n\nIt eventually ends with a shot of the region's Winter capital, Lan Exeter, and the tease of Ciri hunting down a Manticore responsible for slaying a carriage full of smugglers. But as enticing as this all looked, it was simply a tech demo, rendered in-engine on a PS5 and running at 60 FPS with ray tracing enabled. The developer even went out of its way to clarify that it doesn't represent \"The Witcher 4 itself.\"\n\nOf course, the hype wheel will turn as skepticism churns over whether it could really look that good and whether the gameplay will actually match up. Given CD Projekt RED's past m",
        "id": 2847838,
        "language": null,
        "link": "https://www.youtube.com/watch?v=gHVeJ1HlxU0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gHVeJ1HlxU0/hqdefault.jpg",
        "title": "The Witcher 4’s Tech Demo Looks Next-Gen, But So Did Cyberpunk 2077...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-04T13:54:58.926027+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-04T13:30:41+00:00",
        "description": "Who knew open-world exploration and tightly crafted horror could go together so well? Apparently the studios of the 15 games on this list. These games offer expansive, explorable worlds while delivering the same pulse-pounding dread typically reserved for more linear, enclosed settings. \n\nThe oldest game on this list hails from 2006, while the latest game, Stalker 2, just released in 2024, demonstrating how far we’ve come and how long this fusion has been tried. \n\nIt’s worth noting that some games on this list aren’t fully open-world, but feature segmented regions that are large and explorable. But one common denominator is just how scary or spooky these games are, regardless of sheer surface area.",
        "id": 2845362,
        "language": null,
        "link": "https://www.youtube.com/watch?v=hOEXVO7eTVM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hOEXVO7eTVM/hqdefault.jpg",
        "title": "15 Horror Games That MASTERFULLY USE OPEN WORLDS To Scare You",
        "vote": 0
    }
]