[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T23:31:05.893905+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T23:23:00+00:00",
        "description": "Apple does not plan to comply with India's mandate to preload its smartphones with a state-owned cyber safety app that cannot be disabled. According to Reuters, the order \"sparked surveillance concerns and a political uproar\" after it was revealed on Monday. From the report: In the wake of the criticism, India's telecom minister Jyotiraditya M. Scindia on Tuesday said the app was a \"voluntary and democratic system,\" adding that users can choose to activate it and can \"easily delete it from their phone at any time.\" At present, the app can be deleted by users. Scindia did not comment on or clarify the November 28 confidential directive that ordered smartphone makers to start preloading it and ensure \"its functionalities are not disabled or restricted.\"\n \nApple however does not plan to comply with the directive and will tell the government it does not follow such mandates anywhere in the world as they raise a host of privacy and security issues for the company's iOS ecosystem, said two ",
        "id": 4222624,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/02/2214241/apple-to-resist-india-order-to-preload-state-run-app-as-political-outcry-builds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple To Resist India Order To Preload State-Run App As Political Outcry Builds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T23:31:06.133677+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T22:22:00+00:00",
        "description": "The UK government plans to ban political donations made in cryptocurrency over fears of anonymity, foreign influence, and traceability issues, though the ban won't be ready in time for the upcoming elections bill. The Guardian reports: The government's ambition to ban crypto donations will be a blow to Nigel Farage's Reform UK party, which became the first to accept contributions in digital currency this year. It is believed to have received its first registrable donations in cryptocurrency this autumn and the party has set up its own crypto portal to receive contributions, saying it is subject to \"enhanced\" checks. Government sources have said ministers believe cryptocurrency donations to be a problem, as they are difficult to trace and could be exploited by foreign powers or criminals.\n \nPat McFadden, then a Cabinet Office minister, first raised the idea in July, saying: \"I definitely think it is something that the Electoral Commission should be considering. I think that it's very i",
        "id": 4222625,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/02/221215/uk-plans-to-ban-cryptocurrency-political-donations",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Plans To Ban Cryptocurrency Political Donations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T22:26:08.526656+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T21:21:00+00:00",
        "description": "AWS is deepening its partnership with Nvidia by adopting \"NVLink Fusion\" in its upcoming Trainium4 AI chips. \"The NVLink technology creates speedy connections between different kinds of chips and is one of Nvidia's crown jewels,\" notes Reuters. From the report: Nvidia has been pushing to sign up other chip firms to adopt its NVLink technology, with Intel, Qualcomm and now AWS on board. The technology will help AWS build bigger AI servers that can recognize and communicate with one another faster, a critical factor in training large AI models, in which thousands of machines must be strung together. As part of the Nvidia partnership, customers will have access to what AWS is calling AI Factories, exclusive AI infrastructure inside their own data centers for greater speed and readiness.\n \nSeparately, Amazon said it is rolling out new servers based on a chip called Trainium3. The new servers, available on Tuesday, each contain 144 chips and have more than four times the computing power of",
        "id": 4222172,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/02/1930223/amazon-to-use-nvidia-tech-in-ai-chips-roll-out-new-servers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon To Use Nvidia Tech In AI Chips, Roll Out New Servers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T21:21:10.778496+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T20:20:00+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: The popular open-source SmartTube YouTube client for Android TV was compromised after an attacker gained access to the developer's signing keys, leading to a malicious update being pushed to users. The compromise became known when multiple users reported that Play Protect, Android's built-in antivirus module, blocked SmartTube on their devices and warned them of a risk.\n \nThe developer of SmartTube, Yuriy Yuliskov, admitted that his digital keys were compromised late last week, leading to the injection of malware into the app. Yuliskov revoked the old signature and said he would soon publish a new version with a separate app ID, urging users to move to that one instead. [...] A user who reverse-engineered the compromised SmartTube version number 30.51 found that it includes a hidden native library named libalphasdk.so [VirusTotal]. This library does not exist in the public source code, so it is being injected into release buil",
        "id": 4221787,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/02/1924229/smarttube-youtube-app-for-android-tv-breached-to-push-malicious-update",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SmartTube YouTube App For Android TV Breached To Push Malicious Update",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T20:12:51.369938+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T19:19:00+00:00",
        "description": "Michael and Susan Dell pledged $6.25 billion to boost participation in the new \"Trump Accounts\" child investment program. \"The historic gift has little precedent, with few single charitable commitments in the past 25 years exceeding $1 billion, much less multiple billions,\" notes the Associated Press. \"Announced on GivingTuesday, the Dells believe it's the largest single private commitment made to U.S. children.\" From the report: Its structure is also unusual. Essentially, it builds on the \"Trump Accounts\" program (PDF), where the U.S. Department of the Treasury will deposit $1,000 into investment accounts set up by Treasury for American children born between Jan. 1, 2025 and Dec. 31, 2028. The Dells' gift will use the \"Trump Accounts\" infrastructure to give $250 to each qualified child under 10. Though the \"Trump Accounts\" became law as part of the president's signature legislation in July, the Dells say the accounts will not launch until July 4, 2026. Michael Dell said they wanted t",
        "id": 4221202,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/12/02/1916207/michael-and-susan-dell-donate-625-billion-to-encourage-families-to-claim-trump-accounts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Michael and Susan Dell Donate $6.25 Billion To Encourage Families To Claim 'Trump Accounts'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T19:02:29.503907+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T18:18:00+00:00",
        "description": "A Google Antigravity user says the AI-driven \"vibe coding\" tool accidentally wiped his entire D: drive while trying to clear a project cache. Google says it's investigating, but the episode adds to a growing list of AI tools behaving in ways that \"would get a junior developer fired,\" suggests The Register. From the report: We reached out to the user, a photographer and graphic designer from Greece, who asked we only identify him as Tassos M because he doesn't want to be permanently linked online to what could \"become a controversy or conspiracy against Google.\" [...] Tassos told Antigravity to help him develop software that's useful for any photographer who has to choose a few prime shots from a mountain of snaps. He wanted the software to let him rate images, then automatically sort them into folders based on that rating.\n \nAccording to his Reddit post, when Tassos figured out the AI agent had wiped his drive, he asked, \"Did I ever give you permission to delete all the files in my D ",
        "id": 4220541,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/02/0546206/googles-vibe-coding-platform-deletes-entire-drive",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's Vibe Coding Platform Deletes Entire Drive",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:57:02.754434+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:17:00+00:00",
        "description": "Zillow has removed climate risk scores from over a million home listings after real estate agents argued the data was scaring off buyers. TechCrunch reports: Zillow first added the data to the site in September 2024, saying that more than 80% of buyers consider climate risks when purchasing a new home. But last month, following objections from the California Regional Multiple Listing Service (CRMLS), Zillow removed the listings' climate scores. In their place is a subtle link to their records at First Street, the climate risk analytic startup that provides the data.\n \n\"When buyers lack access to clear climate-risk information, they make the biggest financial decision of their lives while flying blind,\" First Street spokesperson Matthew Eby told TechCrunch via email. \"The risk doesn't go away; it just moves from a pre-purchase decision into a post-purchase liability.\" First Street's climate risk scores first appeared on Realtor.com in 2020, where they remain. They also still appear on ",
        "id": 4219965,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/02/0536226/zillow-drops-climate-risk-scores-after-agents-complained-of-lost-sales",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Zillow Drops Climate Risk Scores After Agents Complained of Lost Sales",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:49:05.707990+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:16:00+00:00",
        "description": "An anonymous reader quotes a report from the Wall Street Journal: The Trump administration has agreed to inject up to $150 million into a startup (source paywalled; alternative source) trying to develop more advanced semiconductor manufacturing techniques in the U.S., its latest bid to support strategically important domestic industries with government incentives. Under the arrangement, the Commerce Department would give the incentives to xLight, a startup trying to improve the critical chip-making process known as extreme ultraviolet lithography, the agency said in a Monday release. In return, the government would get an equity stake that would likely make it xLight's largest shareholder.\n \nThe Dutch firm ASML is currently the only global producer of EUV machines, which can cost hundreds of millions of dollars each. XLight is seeking to improve on just one component of the EUV process: the crucially important lasers that etch complex microscopic patterns onto chemical-treated silicon",
        "id": 4219266,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/02/0530257/trump-administration-to-take-equity-stake-in-former-intel-ceos-chip-startup",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Administration To Take Equity Stake In Former Intel CEO's Chip Startup",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T15:41:00.804447+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T15:15:00+00:00",
        "description": "Steam's November 2025 survey shows Linux gaming climbed to its highest share in a decade \"thanks to the success of the Steam Deck, the underlying Steam Play (Proton) software, and now further excitement thanks to the upcoming Steam Machine and Steam Frame,\" writes Phoronix's Michael Larabel. From the report: A decade ago in the early Steam days the initial use was around 3% and back then the Steam user-base in absolute terms was much smaller than it is today. Back in October Steam on Linux finally re-crossed that 3% threshold after for years being stuck in a 1~2% rut. Now the Steam Survey results were published minutes ago for November and they continue an upward trend for Linux.\n \nSteam on Linux is up to 3.2%, an increase of 0.15% for the month. One year ago Steam on Linux was at 2.03% last November, 1.91% for November 2023, and a decade ago for November 2015 was at just 0.98%. [...] Due to AMD APUs powering the Steam Deck, AMD CPUs continue to power nearly 70% of Linux gaming system",
        "id": 4218545,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/02/0525221/steam-on-linux-hits-an-all-time-high-in-november",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Steam On Linux Hits An All-Time High In November",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T14:35:19.587282+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T14:14:00+00:00",
        "description": "The Supreme Court appears inclined to side with Cox Communications in a major copyright case, suggesting that ISPs shouldn't be held liable for users' music piracy based solely on \"mere knowledge,\" given the risk of forcing outages for universities, hospitals, and other large customers. The New York Times reports: Leading music labels and publishers who represent artists ranging from Bob Dylan to Beyonce sued Cox Communications in 2018, saying it had failed to terminate the internet connections of subscribers who had been repeatedly flagged for illegally downloading and distributing copyrighted music. At issue is whether providers like Cox can be held legally responsible and be required to pay steep damages -- a billion dollars or more -- if they know that customers are pirating the music but do not take sufficient steps to terminate their internet access.\n \nJustices from across the ideological spectrum on Monday raised concerns about whether finding for the music industry could resul",
        "id": 4217980,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/02/0517211/supreme-court-hears-copyright-battle-over-online-music-piracy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Supreme Court Hears Copyright Battle Over Online Music Piracy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T13:31:17.140348+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T13:13:00+00:00",
        "description": "Tony Isaac quotes a report from NPR: The rise of AI assistants is rewriting the rhythms of everyday life: People are feeding their blood test results into chatbots, turning to ChatGPT for advice on their love lives and leaning on AI for everything from planning trips to finishing homework assignments. Now, one organization suggests artificial intelligence can go beyond making daily life more convenient. It says it's the key to reshaping American politics. \"Without AI, what we're trying to do would be impossible,\" explained Adam Brandon, a senior adviser at the Independent Center, a nonprofit that studies and engages with independent voters. The goal is to elect a handful of independent candidates to the House of Representatives in 2026, using AI to identify districts where independents could succeed and uncover diamond in the rough candidates. [...]\n \n... \"This isn't going to work everywhere. It's going to work in very specific areas,\" [said Brett Loyd, who runs The Bullfinch Group, t",
        "id": 4217415,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/12/02/0120200/an-independent-effort-says-ai-is-the-secret-to-topple-2-party-power-in-congress",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "An Independent Effort Says AI Is the Secret To Topple 2-Party Power In Congress",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T10:16:13.127251+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T10:00:00+00:00",
        "description": "schwit1 shares a report from Behind The Black: In its war with the Ukraine, it appears Russia is still managing to obtain black market Starlink mini-terminals for use on its drones, despite an effort since 2024 to block access. [Imagery from eastern Ukraine shows a Russian Molniya-type drone outfitted with a mini-Starlink terminal, reinforcing reports that Russia is improvising satellite-linked UAVs to extend their communication and operational range.] SpaceX has made no comment on this issue.\n \nAccording to the article, Ukraine is \"exploring alternative European satellite providers in response, seeking more secure and controllable communications infrastructure for military operations.\" While switching to another satellite provider might allow Ukraine to shut Starlink down and prevent the Russians from using it within its territory, doing so would likely do more harm to Ukraine's military effort than Russia's. There isn't really any other service comparable at this time. And when Amaz",
        "id": 4216091,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/02/0125248/russia-still-using-black-market-starlink-terminals-on-its-drones",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russia Still Using Black Market Starlink Terminals On Its Drones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T07:05:36.534500+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T07:00:00+00:00",
        "description": "A Soyuz launch at Baikonur damaged Russia's only launchpad capable of sending astronauts and crucial propellant to the ISS. \"The rocket itself headed to space without incident, taking three astronauts -- Sergey Kud-Sverchkov and Sergei Mikaev of Russia and Chris Williams of NASA -- to the space station,\" reports the New York Times. \"But the force of the rocket's exhaust shoved a service platform used for prelaunch preparations out of its protective shelter. The platform fell into the flame trench below.\" From the report: Photos and videos of the launch site the next day showed the platform out of place and mangled. \"It's heavily damaged,\" said Anatoly Zak, who publishes RussianSpaceWeb.com, a close tracker of Russia's space activities, \"and so probably it will have to be rebuilt. Maybe some of the hardware can be reused. But it fell down, and it's destroyed.\"\n \nThis is the latest embarrassment for the once-proud Russian space program, which the United States relied on from 2011 to 202",
        "id": 4215174,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/02/0110257/russian-launch-site-mishap-shows-perilous-state-of-storied-space-program",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russian Launch Site Mishap Shows Perilous State of Storied Space Program",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T05:59:39.081905+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T05:13:00+00:00",
        "description": "At an event in Seoul on Tuesday, Samsung unveiled the Galaxy Z TriFold, a dual-hinged smartphone that unfolds into a 10-inch tablet (source paywalled; alternative source). It launches on Dec. 12 in Korea for about $2,450. The company plans to sell the phone in the U.S., but hasn't shared pricing. Bloomberg reports: Samsung's device has a different hinge design, folding inward from two sides whereas the Mate models take on a Z shape when being folded. When closed, the TriFold's outer screen offers similar dimensions to a regular smartphone. But when unfurled, it provides a tablet-style experience with a 10-inch display, larger than the panel on the Galaxy Z Fold 7. In the tablet-like mode, each of the device's screens can independently run a different app. This provides the equivalent of three separate 6.5-inch bar-style handsets side by side.\n \nUsing Samsung's DeX software, which has been tweaked for this particular hardware type, you can also run a desktop-like experience directly on",
        "id": 4214848,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/12/02/0511211/samsung-debuts-its-first-trifold-phone",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung Debuts Its First Trifold Phone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T03:54:19.075228+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Conversation, written by authors Adrian R. Bell, Anne Curry, and Jason Sadler: When you picture medieval warfare, you might think of epic battles and famous monarchs. But what about the everyday soldiers who actually filled the ranks? Until recently, their stories were scattered across handwritten manuscripts in Latin or French and difficult to decipher. Now, our online database makes it possible for anyone to discover who they were and how they lived, fought and travelled. To shed light on the foundations of our armed services -- one of England's oldest professions -- we launched the Medieval Soldier Database in 2009. Today, it's the largest searchable online database of medieval nominal data in the world. It contains military service records giving names of soldiers paid by the English Crown. It covers the period from 1369 to 1453 and many different war zones.\n \nWe created the database to challenge assumptions about the lack of profession",
        "id": 4214348,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/02/0049229/we-built-a-database-of-290000-english-medieval-soldiers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'We Built a Database of 290,000 English Medieval Soldiers'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T01:44:48.009690+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T01:25:00+00:00",
        "description": "Longtime Slashdot reader krouic shares a report from Europol: From November 24-28, 2025, Europol supported an action week conducted by law enforcement authorities from Switzerland and Germany in Zurich, Switzerland. The operation focused on taking down the illegal cryptocurrency mixing service Cryptomixer, which is suspected of facilitating cybercrime and money laundering. Three servers were seized in Switzerland, along with the cryptomixer.io domain. The operation resulted in the confiscation of over 12 terabytes of data and more than EUR 25 million worth of Bitcoin. After the illegal service was taken over and shut down, law enforcement placed a seizure banner on the website. Authorities allege that the mixing service laundered over 1.3 billion euros in bitcoin since 2016.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Swiss+Illegal+Cryptocurrency+Mixing+Service+Shut+Down%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25",
        "id": 4213799,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/02/0042253/swiss-illegal-cryptocurrency-mixing-service-shut-down",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Swiss Illegal Cryptocurrency Mixing Service Shut Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T01:44:48.106482+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T00:45:00+00:00",
        "description": "A new study from the University of Pennsylvania finds that preteens who own smartphones by age 12 have significantly higher odds of depression, obesity, and poor sleep compared to their peers. Axios reports: Kids who owned a smartphone at age 12 were found to have about 31% higher odds of depression, 40% higher odds of obesity and 62% higher odds of insufficient sleep than their peers who didn't have one. The researchers analyzed data from the National Institutes of Health-supported Adolescent Brain Cognitive Development Study assessments conducted between 2016 and 2022. The study included responses from 10,588 youths. Kids who had smartphones were more likely to be female, Black or Hispanic, and from lower-income households. The study has been published in the journal Pediatrics.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Smartphones+At+Age+12+Linked+To+Worse+Health%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%",
        "id": 4213800,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/12/02/008223/smartphones-at-age-12-linked-to-worse-health",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Smartphones At Age 12 Linked To Worse Health",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T00:35:42.602230+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T00:23:00+00:00",
        "description": "Apple's longtime AI chief John Giannandrea is retiring, with former Microsoft and Google AI leader Amar Subramanya stepping in to take over. MacRumors notes the retirement comes after the company's repeated delays in delivering its revamped Siri and internal turmoil that led to an AI team exodus. From the report: Giannandrea will serve as an advisor between now and 2026, with former Microsoft AI researcher Amar Subramanya set to take over as vice president of AI. Subramanya will report to Apple engineering chief Craig Federighi, and will lead Apple Foundation Models, ML research, and AI Safety and Evaluation. Subramanya was previously corporate vice president of AI at Microsoft, and before that, he spent 16 years at Google. He was head of engineering for Google's Gemini Assistant, and Apple says that he has \"deep expertise\" in both AI and ML research that will be important to \"Apple's ongoing innovation and future Apple Intelligence features.\"\n \nSome of the teams that Giannandrea over",
        "id": 4213419,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/02/0021253/apple-ai-chief-retiring-after-siri-failure",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple AI Chief Retiring After Siri Failure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T00:35:42.967579+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: Flock, the automatic license plate reader and AI-powered camera company, uses overseas workers from Upwork to train its machine learning algorithms, with training material telling workers how to review and categorize footage including images people and vehicles in the United States, according to material reviewed by 404 Media that was accidentally exposed by the company. The findings bring up questions about who exactly has access to footage collected by Flock surveillance cameras and where people reviewing the footage may be based. Flock has become a pervasive technology in the US, with its cameras present in thousands of communities that cops use every day to investigate things like carjackings. Local police have also performed numerous lookups for ICE in the system.\n \nCompanies that use AI or machine learning regularly turn to overseas workers to train their algorithms, often because the labor is cheaper than hiring domestically. ",
        "id": 4213420,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/01/2249209/flock-uses-overseas-gig-workers-to-build-its-surveillance-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Flock Uses Overseas Gig Workers To Build Its Surveillance AI",
        "vote": 0
    }
]