[
    {
        "age": null,
        "album": "",
        "author": "Vox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T00:07:42.424138+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T23:58:03+00:00",
        "description": "The Department of Homeland Security recently released a spree of ads recruiting for new hires at ICE. And those ads circle around one strange idea: that America is a damsel who needs strong, powerful men to protect her.\n\nIn this Reporter Extra, Vox senior culture correspondent Constance Grady unpacks the secret history behind ICE’s iconography. They’re pulling from some old and shameful American archetypes — and those archetypes come with racist and misogynistic baggage. To fully understand the story ICE is telling, we need to go all the way back to The Birth of a Nation, and all the way forward to the present-day trad wives on social media. \n\nICE is trying to claim the power to decide who gets to be a part of America, and their ads give us a glimpse into who they believe America is.\n\nCheck out the full video at patreon.com/vox.\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut throu",
        "id": 4222750,
        "language": "en",
        "link": "https://www.youtube.com/shorts/ecBBKJ390JY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 779,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCLXo7UDZvByw2ixzpQCufnA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ecBBKJ390JY/hqdefault.jpg",
        "title": "Reporter Extra: What do the people behind ICE think about America?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Vox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T15:15:29.640074+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T14:35:47+00:00",
        "description": "The demand for AI infrastructure is driving a boom across the US for new data centers. Built out in converted industrial buildings or on former green space, these new real estate developments can be a mixed bag. On one hand, they create new jobs and bring in significant tax revenue. On the other, they can be unsightly and raise electricity prices. Across the US, including in suburban Philadelphia, locals are protesting these new data centers to bring awareness to how they can hurt their communities and the environment. Vox producer Miles Bryan interviewed locals in Conshohocken to learn more for this week’s episode of Today, Explained. #data #ai #protest #local\n\n🎧 Listen to the full story wherever you get your podcast:\nhttps://www.vox.com/today-explained-podcast\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the ",
        "id": 4218191,
        "language": "en",
        "link": "https://www.youtube.com/shorts/EBFrDl16vC0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 779,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCLXo7UDZvByw2ixzpQCufnA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EBFrDl16vC0/hqdefault.jpg",
        "title": "AI data centers: Good, or bad? #shorts",
        "vote": 0
    }
]