[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:09.191833+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T18:00:30+00:00",
        "description": "What if everything you were taught about money missed one simple truth? David Delisle invites us to pause, just for a moment, and in that pause, rethink how we spend, save, and give. This is the beginning of a new money story: one rooted in mindfulness, joy, and the freedom to choose what matters most...The Awesome Stuff. \n\nDavid Delisle is the founder of The Awesome Stuff™, a TV personality, bestselling author, and entrepreneur passionate about financial literacy. Featured on NBC, Fox, Forbes, and CTV’s The Social, he made his first investment at 11, entered real estate by 20, and was semi-retired by 40. His groundbreaking graphic novel, The Golden Quest, is the first of its kind to teach financial literacy, aiming to transform how a million kids think about money. Through engaging storytelling, David inspires young minds to build financial freedom with purpose and joy, helping them focus on what truly matters in life. \n\nThis talk was given at a TEDx event using the TED conference fo",
        "id": 4220204,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EG8V8UIXXQM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EG8V8UIXXQM/hqdefault.jpg",
        "title": "How to start spending, saving, and giving better | David Delisle | TEDxVictoria",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:09.327968+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:57:22+00:00",
        "description": "It's about the importance of moments which build you rather than break you. It's a motivation packed talk on fixing goals and working towards it with optimism, positivity and courage.  A.S Manasee of grade 8A is an aspiring learner and an avid reader and a pet lover. In her leisure time, she enjoys sports, especially in the fields of football, basketball, athletics and swimming. In this talk, she explores the power of an invisible ignition... The Power of Possibility. Talking about the real life experiences and what are the stepping stones in this world of opportunities, she invites you to believe in your voice, your dreams and your steps. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220205,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SKm9p0z-Vu8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SKm9p0z-Vu8/hqdefault.jpg",
        "title": "The Power of \"What if\" | Manasee A S | TEDxTIPS Salem Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:09.478394+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:57:14+00:00",
        "description": "The talk is about the power of \"What if\". A powerful message to the world which delivers the beauty of forgiving. How a simple word \"Sorry\" can give you extreme happiness and peace of mind. Ultimately the immense potential hidden in the word \"forgiveness\" which can resolve even the burning issues of the present world.  As a ninth grader brimming with energy, Avyukth H is a die-hard fan of sports and movies, with a passionate love for history’s grand stories. Free time means diving into exciting games or losing himself in captivating books, while hockey and athletics fuel his competitive spirit and drive for excellence every day. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220206,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hCmqmccOabU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hCmqmccOabU/hqdefault.jpg",
        "title": "Unfolding Wings: The Courage to Forgive... | Avyukth H | TEDxTIPS Salem Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:09.592322+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:57:06+00:00",
        "description": "The talk is on the magic of changing simple things into extraordinary moments of happiness. The talk explores the art of transforming life's ordinary experiences and happenings to life changing scenarios. Janaki Narayanan is a Grade 5 student who finds joy in exploring the world through art, drawing, and reading. Her curious mind and creative spirit shine brightest during her favourite subject, the Unit of Inquiry, where she enjoys discovering how ideas connect to real life. Janaki is excited to share her thoughts on the TEDx stage, bringing her imagination and insight to inspire others to see the world with wonder and creativity. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220207,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=oUkrtS3Y6K4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oUkrtS3Y6K4/hqdefault.jpg",
        "title": "The Art of Seeing Beyond... | Janaki Narayanan R | TEDxTIPS Salem Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:09.732795+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:56:47+00:00",
        "description": "The talk is centered around the amazing power of failures which can be a super power to unleash the hidden skills in you to reach further heights. According to the speaker your failure resume is more powerful than your straight success records. Every failure is a new learning where the real growth begins.  Rishi is an eager and enthusiastic learner with excellent communication and leadership skills. A passionate table tennis player, he is well known among his peers for his dedication and sportsmanship. Beyond academics, Rishi actively participates in a wide range of extracurricular activities and expresses his thoughts with clarity and confidence.\n\nKnown for his kind and caring nature, Rishi values teamwork and enjoys motivating those around him. His curiosity and love for learning drive him to explore new ideas and share his discoveries with others. He believes that the TEDx platform provides an inspiring space to express his thoughts, exchange knowledge, and inspire positive change.",
        "id": 4220208,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cWivuIhkXIc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cWivuIhkXIc/hqdefault.jpg",
        "title": "The Igniting Power of Failures..  | Rishi R | TEDxTIPS Salem Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:09.860812+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:56:35+00:00",
        "description": "The smartest tool in the world means nothing if the person using it stops thinking. Xiran (Ryan) Xu is an international high school student who’s fascinated by how technology shapes the way people think and live. Growing up in a time when AI can write essays, make art, and even “think,” he often asks himself: what still makes our minds unique?\nRather than fearing technology, Ryan embraces it with curiosity and reason. He has a strong interest in computer science and programming, seeing them not just as tools, but as languages that express creativity and logic. For him, coding is like problem-solving poetry — precise, elegant, and full of discovery.\nBeyond his academic life, Ryan enjoys hosting school events and sharing ideas that connect technology with everyday experience. He believes that in a world increasingly shaped by machines, what truly defines us is our ability to imagine, question, and care.\nThrough his TEDx talk, Ryan hopes to inspire others to use technology wisely — to th",
        "id": 4220209,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=U5ZR5C5UJxM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/U5ZR5C5UJxM/hqdefault.jpg",
        "title": "AI Does My Homework. Does Thinking Still Matter? | Xiran Xu | TEDxJLHX Intl School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:09.949190+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:56:27+00:00",
        "description": "Advertising has found its pulse in the digital age. I’m Linxin Deng, a Grade 10 student at Jinling Hexi Campus with a core vision: to spark divergent thinking through my speeches, allowing every topic to be explored from diverse angles rather than confined to a single perspective. Over my three years in junior high, I delivered a wide range of speeches spanning daily life and academic topics, each designed to introduce shallow yet multifaceted ideas. Now, my long-term goal is to delve into deeper, more profound themes that can evoke universal resonance among audiences. What sets me apart is my genuine enjoyment of the speaking process—I thrive on presenting varied viewpoints to inspire unconventional thoughts, and I always curate concise keywords in my PPTs to crystallize my ideas, ensuring every audience member can grasp and reflect on the core messages. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at",
        "id": 4220210,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LwBILL0jqEk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LwBILL0jqEk/hqdefault.jpg",
        "title": "Advertising Evolution & Driving Forces | Linxin Deng | TEDxJLHX Intl School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:10.038651+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:56:19+00:00",
        "description": "The gap between people does not lie in talent or luck, but in whether one can turn the tiny, scattered moments that others waste into stepping stones for growth and progress. I am a student who has shown tremendous interest in time management. I used to struggle with a common issue: a chronic shortage of time, often feeling overwhelmed by academic tasks, extracurricular commitments, and personal life demands. Determined to break this cycle, I have been deeply immersed in figuring out how to optimize my daily routines. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220211,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=P7MM-gmLL3k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/P7MM-gmLL3k/hqdefault.jpg",
        "title": "Don't Let Fragmented Time Waste Your Potential | Ziang Fei | TEDxJLHX Intl School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:10.135490+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:56:11+00:00",
        "description": "It's a casual talk on how the speaker tackled fear and made it a fuel for her life journey and achievements. The speaker gives us motivation tips to work on step by step to reach success with the help of  courage and curiosity. G.S. Atchayaa is a multifaceted young talent — a champion swimmer, imaginative artist, captivating storyteller, and high-achieving student . Her journey beautifully weaves together discipline, creativity, and resilience. Whether she’s gliding through the water, bringing colors to life on canvas, or sharing stories that stir the heart, Atchayaa embodies the courage to dream beyond limits.\n\n\n\nIn her TED Talk titled “Beyond Fear-lies the Power of Possibilities,” she shares how facing her fears became the turning point that unlocked her confidence and creativity. Through her inspiring reflections, Atchayaa invites the audience to see that fear is not a barrier but a bridge — leading to the boundless possibilities that await when we dare to believe in ourselves. Thi",
        "id": 4220212,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EUJH5oj87dQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EUJH5oj87dQ/hqdefault.jpg",
        "title": "Harnessing Potential... | Atchayaa G S | TEDxTIPS Salem Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:10.231642+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:56:08+00:00",
        "description": "In those moments of sensory blending, I perceive the world in its most complete form—vibrant, connected, and filled with unexpected harmony. I’m a person who perceives the world in a unique way. As a synesthete, I can see colors in numbers and words, turning these unique perceptions into sources of inspiration. My speech is about a fascinating ability called Synesthesia—the interconnection between different senses, where numbers, words, or sounds can appear as colors and shapes in the mind. Meanwhile, through my personal experiences, I share my own story with this extraordinary ability. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220213,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SpvZJaLyRmI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SpvZJaLyRmI/hqdefault.jpg",
        "title": "Can You 'Feel Colors from Numbers?' | Muqing Yang | TEDxJLHX Intl School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:10.409759+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:56:00+00:00",
        "description": "We are not just rational actors. We are storytellers. We are tribe members. We are people with deep-seated needs to belong. I am a high school student with a profound passion for economics. With keen insight, I investigate how social identity intersects with economic behavior. I will share fresh perspectives on how \"identity\" reshapes our economic decisions, offering new understanding from the next generation. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220214,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Z9sCkjDkztg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z9sCkjDkztg/hqdefault.jpg",
        "title": "The Invisible Force Shaping Our Economy: Identity | Yuxuan Pang | TEDxJLHX Intl School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:10.602824+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:55:52+00:00",
        "description": "In this talk, Santhosh explores how the cliche advice \"Be Yourself\" lost it's credibility in the current world. The talk gives us a new insight into the way we look at things in a normal monotonous way. It's interwoven with his life experiences to make it convincing and interesting. My name is Santhosh Sundaresan. I am currently doing my A levels. I registered for this TEDx talk because I wanted to learn the skill of public speaking in front of a large audience. My talk is about how not being yourself benefits an individual. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220215,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qA_hTqqHhF4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qA_hTqqHhF4/hqdefault.jpg",
        "title": "Don't Be Yourself... | Santhosh Sundaresan | TEDxTIPS Salem Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:10.740487+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:55:43+00:00",
        "description": "The talk is on how to find the possibility in every impossibility. It's a powerful message to those who are often demotivated by \"Hey, It's not possible for you.\" Throughout the talk  the speaker says about the magic of 'WHYNOT ME\" Neha Karthikeyan, a thoughtful and determined student who loves exploring new ideas, writing, and finding meaning in everyday moments. Neha believes that “impossible” is just a word — and today, through her talk, she hopes to remind us that most limits only exist in our minds. Her goal is to make us rethink how we see challenges and maybe even find the possible in our own impossible. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220216,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qILZhb--Omk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qILZhb--Omk/hqdefault.jpg",
        "title": "Impossible is Just a Word... | Neha Karthikeyan | TEDxTIPS Salem Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:10.950673+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:55:35+00:00",
        "description": "It's about the steps to become successful in life, focusing on the opportunities around us. The talk motivates and kindle our thought process at the same time. \"Believe in yourself\" is the real crux of the talk. Rithwik.S is a passionate grade 9 student who believes that every great achievement begins with the courage to try. He is really talented and shows special interest towards music, cinema and public speaking. He is enthusiastic towards cricket and is a passionate basketball player who has participated in a few competitions like Sahodaya. Being a fun and curious student he has been a part of MUN’s and robotic expos. He is also a skillful guitarist with well versed achievements from art festivals like Kalothsav. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4220217,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Al01Wg-uEiQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Al01Wg-uEiQ/hqdefault.jpg",
        "title": "A Road to a New Beginning... | Rithwik S | TEDxTIPS Salem Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T18:37:11.095114+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:55:28+00:00",
        "description": "La XVIII disposizione transitoria della Costituzione stabiliva che il testo costituzionale fosse esposto in ogni Comune nel 1948, per permettere a tutti i cittadini di conoscerlo. I Costituenti, consapevoli della necessità di parlare a un popolo reduce dalla guerra e in larga parte analfabeta, lavorarono per creare una Costituzione scritta con parole semplici e comprensibili.\nTra loro, il latinista e partigiano Concetto Marchesi curò la revisione linguistica insieme a Piero Pancrazi e Antonio Baldini, applicando regole essenziali: frasi brevi, poche subordinate e vocaboli di uso comune, per evitare il burocratese.\nIl risultato fu un testo chiaro e accessibile: 9.300 parole, 1.357 vocaboli diversi, dei quali oltre il 92% appartiene al vocabolario di base dell’italiano. Come rilevato da Tullio De Mauro, questa scelta ha reso la Costituzione immediatamente comprensibile a tutti, contribuendo alla sua fama di “Costituzione più bella del mondo”, forte e limpida nel linguaggio.\n\n Alfonso Ce",
        "id": 4220218,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=V492famS1aw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/V492famS1aw/hqdefault.jpg",
        "title": "Affinché ogni cittadino possa prenderne cognizione | Alfonso Celotto | TEDxPavia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:29.788937+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:19:41+00:00",
        "description": "Nesse video, Pedro Salomão trabalha com o tema \"A graça da vida\", buscando renovar o conceito e elucidar que a graça da vida são as coisas mais simples que podemos fazer. Entusiasta da vida e profissional da alegria. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4219503,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=a1WXfYVblcQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/a1WXfYVblcQ/hqdefault.jpg",
        "title": "A graça da vida | Pedro Salomão | TEDxUniversidade do Oeste Paulista",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:29.902749+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:19:33+00:00",
        "description": "In this TEDx talk, Goldy Bhasin, Director of Shiv Fruit Mart a legacy brand serving premium Indian and imported fruits since the 1940s shares his remarkable journey of transforming a traditional family business into an industry-leading name across the Indian subcontinent.\n\nGoldy opens up about joining the business in 2002 and introducing innovative concepts that revolutionized how fruits are perceived and presented at weddings, luxury events, and grand celebrations.\n\nHe also challenges the outdated belief that Hotel Management is only about hotels and restaurants. With clarity and honesty, he explains how HM courses shape entrepreneurs, event leaders, service innovators, and creative business minds who build the industries of tomorrow.\n\nFrom a modest beginning to becoming a visionary in experiential presentation, Goldy’s story is a powerful reminder that success is not defined by where you start, but by how boldly you expand your vision.\nThis is a talk about reinvention, entrepreneurs",
        "id": 4219504,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pk2G5wC1vJw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pk2G5wC1vJw/hqdefault.jpg",
        "title": "From Scratch to Sky: Transforming Hospitality with Vision | Goldy Bhasin | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:30.054345+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:19:25+00:00",
        "description": "Rohit Khatri dismantles one of the oldest beliefs in business - that hard work alone guarantees success.\nFrom scaling D2C brands past a thousand crores to burning out inside his own systems, he learned the uncomfortable truth:\neffort is no longer the currency of progress leverage is.\n\nThrough honest stories of exhaustion, clarity, and reinvention, Rohit reveals how technology, AI, and systems have quietly rewritten the rules of growth. Today, the people who compound smarter not those who grind harder build momentum.\n\nHe introduces The Leverage Pyramid, a simple yet powerful framework:\nDo Less. Automate More. Think Deeper.\nBecause in an age where machines can execute endlessly, humans must design intelligently.\n\nThis talk is a wake-up call for founders, creators, students, and professionals who feel stuck in movement but far from progress.\nThe illusion ends when we stop worshipping effort and start architecting impact. Rohit Khatri is an entrepreneur and product leader with over a deca",
        "id": 4219505,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qP-73uBqeqI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qP-73uBqeqI/hqdefault.jpg",
        "title": "The Illusion of Hard Work: Leverage Beats Hustle | Rohit Khatri | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:30.230319+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:19:17+00:00",
        "description": "In this powerful TEDx talk, Dr. Sahiba Bawa Singh, aesthetic physician, explores one of humanity’s oldest fascinations -the illusion of beauty- and how it shapes our identity, confidence, and connection to the world.\n\nThrough stories from her clinical practice, she reveals a profound truth: people don’t seek beauty for vanity; they seek it for belonging. A woman with acne scars wants to feel seen again. A burn survivor wants to feel like himself again. What looks like “enhancement” from the outside is often healing taking place on the inside.\n\nDr. Sahiba traces beauty from ancient civilizations to today’s world of filters, fillers, and AI-driven perfection exposing the illusions that empower and the illusions that harm. She breaks down the science behind modern aesthetic medicine, highlighting how regenerative treatments don’t just reshape features, but restore confidence, identity, and dignity.\n\nAs AI and augmented reality begin to blur the boundaries between illusion and reality, sh",
        "id": 4219506,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ai_Hc-Onq8Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ai_Hc-Onq8Y/hqdefault.jpg",
        "title": "Beauty & Perception: Illusion and Identity | Dr. Sahiba Bawa Singh | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:30.331376+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:19:10+00:00",
        "description": "Yamini Jain content creator, mother, and founder of Snowberry Artisanal Desserts breaks the biggest myth of the digital age: that social media is easy, glamorous, and endlessly rewarding.\n\nWith honesty and clarity, she reveals what truly lies behind the filters:\nlong hours of creative pressure, the mental load of constant visibility, and the emotional resilience needed to live under a public microscope.\n\nYamini shares her transition from the world of content to becoming an entrepreneur, building Snowberry from scratch while balancing motherhood and a growing brand. From the challenges nobody sees to the discipline it takes to divide time, delegate, and let go, she opens up about the real work behind “managing it all.”\n\nHer message is simple yet powerful:\nsuccess isn’t measured in likes, reels, or followers but in balance, resilience, and peace of mind.\nWith the wisdom of Gulzar and the courage to dream big, she leaves her audience with a reminder to stay authentic, start small, and bu",
        "id": 4219507,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=X-tYlt_cYeM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/X-tYlt_cYeM/hqdefault.jpg",
        "title": "The Illusion of Social Media – What You Don’t See | Yamini Jain | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:30.432217+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:19:02+00:00",
        "description": "In this TEDx talk, Saurabh Gandhi shares a deeply personal journey from feeling lost, depressed, and convinced he was a failure, to discovering the psychology that transformed his life. Rather than treating motivation as a temporary boost or a burst of inspiration, he uncovers the scientific truth: motivation doesn’t come from outside-it comes from identity.\n\nThrough relatable examples, he explains how two people facing the same situation react completely differently, not because of talent or skill, but because of how they see themselves. He breaks down how perception shapes emotion, how identity shapes effort, and how shifting the story we tell ourselves can completely shift the energy we bring to any task.\n\nFrom treadmill tricks to emotional reframing, from observing your inner dialogue to rebuilding your sense of self with logic and compassion, Saurabh offers practical tools that redefine motivation at its core.\n\nHis message is simple but powerful:\nyou don’t need more discipline, y",
        "id": 4219508,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ecTg9_0DPwg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ecTg9_0DPwg/hqdefault.jpg",
        "title": "The Science of Motivation | Saurabh Gandhi | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:30.554584+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:18:53+00:00",
        "description": "In this witty and eye-opening talk, entrepreneur Siddharth Havelia breaks the illusion of the “60-second startup” ,the viral trend where perfectly edited reels make business building look quick, aesthetic, and effortless. Drawing from his own journey of countless rejections, failed pitches, and quiet perseverance, he reveals the truth behind entrepreneurship: you can’t edit your way to success.\n\nSiddharth explains how social media romanticizes “motion,” while real meaning comes from consistency, discipline, and showing up every day.\nA powerful reminder to stop chasing shortcuts and start building what’s real. Siddhartha Havelia is a visionary leader, entrepreneur, and global keynote speaker with over two decades of experience shaping businesses and inspiring people. From his early years in Lucknow to co-founding Mercurius Advisory Services, his journey reflects resilience, innovation, and a deep entrepreneurial spirit. A Chartered Accountant (ICAI) and ACCA (UK), Siddhartha built his ",
        "id": 4219509,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CXtwkusgX5o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CXtwkusgX5o/hqdefault.jpg",
        "title": "The 60-Second Startup: Illusions of Instant Success | Siddhartha Havelia | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:30.806811+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:18:45+00:00",
        "description": "In this honest and refreshing talk, Sneha Singh, founder of Alqua, breaks the illusion of “perfect beauty” shaped by filters and unrealistic standards. Sharing her personal journey with self-image and entrepreneurship, she reveals how we often chase perfection instead of confidence. Sneha challenges the audience to redefine beauty through authenticity, not illusion and reminds us that real glow comes from being comfortable in our own skin. Sneha Singh is an entrepreneur, visionary leader, and the founder & CEO of ALQUA E-Mart Pvt. Ltd., launched in 2024 to redefine luxury skincare and women’s apparel in India. Armed with an MBA and a diploma in international business, along with experience in global corporations, she blends innovation, quality, and trust in every creation. Under her leadership, ALQUA has quickly positioned itself among leading luxury brands through its high-performance skincare and sustainable fashion line. Recognized as the “Youngest Woman Leader Entrepreneur” in 202",
        "id": 4219510,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VBVrV9X0lZo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VBVrV9X0lZo/hqdefault.jpg",
        "title": "Redefining Beauty in a World of Illusion | Sneha Singh | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:30.999403+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:18:37+00:00",
        "description": "How Gen Z can shift from illusion-driven digital habits to purpose-driven evolution using the Vision–Action Matrix.\n\nIn the age of AI overload, endless scrolling, and dopamine traps, Kiran Kudwade challenges the biggest illusion of our generation that activity equals progress. Through his Vision–Action Matrix, he decodes the difference between hustling, drifting, dreaming, and truly evolving. A bold call for Gen Z to reboot, realign, and rise with purpose, compassion, and conscious action. With over 30 years of diverse experience across hospitality, petroleum, retail, FMCG, and education, Kiran Kurwade is a purpose-driven professional passionate about human potential. Since 2004, he has coached over 5 lakh professionals across India, the Middle East, and Africa—empowering students, soldiers, and corporate leaders alike. A Gallup Global Strengths Coach and Harvard-certified Leader of Learning, he has delivered sessions at 500+ institutions, including the Central Detective Training Inst",
        "id": 4219511,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=-qPOx1tkK3U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-qPOx1tkK3U/hqdefault.jpg",
        "title": "Vision–Action Matrix: Thriving Not Surviving in the AI Era | Kiran Kurwade | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:31.203662+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:17:47+00:00",
        "description": "In this TEDx talk, Ramya shares her journey from a childhood chess champion to an AI innovator, inspired by her grandmother’s preventable blindness. She explores how self-taught AI allowed her to develop tools that detect eye disease and predict systemic illnesses like heart disease and Alzheimer’s years before symptoms appear. Highlighting the power of curiosity, resilience, and accessible technology, Ramya shows how AI empowers—not replaces—doctors, and invites the audience to find their own “why” and take bold steps to shape the future of medicine. Speaker of The Power of AI Oculomics This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4219512,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2LHeGrxdkZI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2LHeGrxdkZI/hqdefault.jpg",
        "title": "Eyes as the Windows to Health | Ramya Elangovan | TEDxMcfarren Boulevard Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:31.438002+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:17:38+00:00",
        "description": "E se o corpo que você tem não fosse um obstáculo, mas um ponto de partida?\nNesta palestra TEDx, a atriz e comunicadora Mariana Xavier compartilha sua jornada de autoconhecimento e fala sobre como a representatividade, a autoestima e o resgate da própria história podem transformar a forma como nos vemos, e como vemos o mundo.\n\nCom sensibilidade e humor, Mariana reflete sobre os padrões de beleza que limitam tantas pessoas, especialmente as mulheres, e mostra o poder de fazer as pazes com o próprio corpo, ressignificar a dor e se tornar referência para outras histórias.\n\nUma palestra inspiradora sobre corpo, identidade e liberdade, um convite para que você também seja seu próprio padrão. Nascida no Rio de Janeiro em 1980, começou cedo nas artes: aos 9 anos já fazia teatro e aos 11, participou como figurante da novela Top Model. Profissionalizou-se em 2001 e se destacou no teatro, TV e cinema. Ficou nacionalmente conhecida como Marcelina, da franquia Minha Mãe é Uma Peça, além de papéis ",
        "id": 4219513,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=x93iYzPOs3Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/x93iYzPOs3Q/hqdefault.jpg",
        "title": "Seja seu próprio padrão | MARIANA XAVIER | TEDxJardimdosSeixas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:31.725673+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:17:30+00:00",
        "description": "Nesta palestra, Felipe Shure revela como a voz vai muito além do som: ela é a manifestação mais direta da nossa história emocional e do modo como nos conectamos com o mundo. A partir de sua experiência como jornalista e do Método Fluxo, uma abordagem que integra inteligência emocional e comunicação empática, Felipe mostra como crenças, emoções e vivências moldam a forma como nos expressamos.\n\nEle convida o público a reconhecer bloqueios internos, ressignificar narrativas pessoais e fortalecer sua presença comunicativa em qualquer ambiente. Com exemplos práticos e reflexões profundas, a palestra inspira cada pessoa a descobrir o poder transformador de assumir sua voz com autenticidade, propósito e coragem. Após mais de uma década como jornalista na maior emissora de TV do país, seguiu um chamado interno: ajudar pessoas a superar barreiras emocionais, se reconectar com suas histórias e transformar suas relações no trabalho e na vida. Com esse propósito, criou o Método Fluxo, que decodif",
        "id": 4219514,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UTt4q3sb9_I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UTt4q3sb9_I/hqdefault.jpg",
        "title": "O poder da sua voz no mundo | FELIPE SUHRE | TEDxJardimdosSeixas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:31.957104+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:16:19+00:00",
        "description": "How does someone transform the trauma of war into wisdom? Kazemi shares the story of joining the front lines as an underage volunteer and surviving life-altering injuries. His bright, philosophical reflection reveals how hardship can deepen our appreciation for life’s quiet possibilities. Ali Reza Kazemi recounts an extraordinary journey that began when he was just fifteen, driven by the loss of a close friend to volunteer as a soldier during the Iran-Iraq War. Determined to join despite being underage, he altered his birth certificate and soon found himself on the front lines. In one of the most defining moments of his life, Kazemi survived a devastating mission in which he lost a leg and sustained multiple injuries — a turning point that might have ended his path, but instead strengthened his resolve. After recovering, he returned to the battlefield with a prosthetic, carrying with him a deeper understanding of resilience. Today, he reflects on these memories not with bitterness, bu",
        "id": 4219515,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mZwIz2Wxmks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mZwIz2Wxmks/hqdefault.jpg",
        "title": "Returning After the Impossible | alireza kazemi | TEDxIsfahan University of Technology",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:32.166333+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:16:11+00:00",
        "description": "Why does real progress—personal or urban—take so long? Salavati reflects on setbacks, failures, and the perseverance behind major development projects, including transforming historic Chahār Bāgh. His message is simple: endurance builds cities, careers, and the future itself. Born in 1981, Alireza Salavati shares a story defined by resilience, curiosity, and a lifelong commitment to public service. After early setbacks in school admissions and a failed entrance exam, he pursued his education with renewed determination while nurturing a parallel passion for journalism and media. His career eventually led him into urban development, where he took on complex projects that demanded both technical insight and persistent effort. Among them was the transformation of Isfahan’s historic Chahār Bāgh into a pedestrian-friendly corridor — a challenge that tested his patience and problem-solving skills, yet became one of his most meaningful achievements. He later contributed to major transportatio",
        "id": 4219516,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VF87vJLbBjg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VF87vJLbBjg/hqdefault.jpg",
        "title": "Progress Takes Patience | alireza salavati | TEDxIsfahan University of Technology",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T17:31:32.416613+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T17:16:03+00:00",
        "description": "Rajesh Joshi, one of India’s most respected contemporary Hindi poets and an influential literary voice, reflects on the idea of failure through a deeply human lens. Speaking on the theme “Beyond the Pause,” Joshi examines the silent intervals that follow disappointment — those moments when life momentarily stands still. He suggests that these pauses are not voids but fertile ground where reflection, resilience, and renewal quietly take shape. With the precision of a journalist and the sensitivity of a poet, Joshi presents failure not as a collapse, but as a critical turning point in one’s personal narrative. Journalism This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4219517,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7n6pDB4fCMQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7n6pDB4fCMQ/hqdefault.jpg",
        "title": "Beyond the Pause : Journalism and Further by Rajesh Joshi at TedxJMI2025 | Rajesh Joshi | TEDxJMI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:32.435126+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:09:27+00:00",
        "description": "Jovana Kvržić je obišla više od 110 zemalja, ali njeno najduže putovanje vodi ka njoj samoj. Kako nas svako novo iskustvo menja, i kako razlike među ljudima otkrivaju koliko smo u suštini slični? \n? Putovanja kao beg ili povratak sebi? – govor o traganju za identitetom kroz svet i kroz daljine.\n |||||\nENG: Jovana Kvrzic has visited more than 110 countries – but her longest journey leads back to herself. This is a story about how every new experience changes us, and how our differences reveal just how similar we really are. \n? Traveling: An Escape or a Journey Back to Oneself? – a talk about searching for identity out in the world and deep within.\n\n\n Jovana Kvržić is a Master of Pharmacy and passionate explorer who, since 2018, has also been a travel blogger - launching a website that now attracts tens of thousands of readers each year. For more than a decade she has actively explored the world, visiting 110+ countries and sharing her experiences through her blog and Instagram, where a",
        "id": 4218898,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ytu22jT2B4s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ytu22jT2B4s/hqdefault.jpg",
        "title": "Putovanja: beg ili povratak sebi? Traveling: an Escape or a Journey | Jovana Kvržić | TEDxBelgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:32.561172+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:09:08+00:00",
        "description": "Kako da zadržimo fokus i snagu u svetu prepunom prekidanja i pritisaka? Bogdan Mijović otkriva koliko nas zaista košta stres i kako male promene vraćaju ono najvrednije.\n\n? Mozak pod pritiskom: cena stresa i kako da prođemo jeftinije – govor o skrivenim troškovima savremenog života i načinima da očuvamo vreme, energiju i mir.\n |||||\nENG: How do we keep our focus and strength in a world full of interruptions and constant pressure?\nBogdan Mijovic sheds light on what stress really costs us and how small shifts can give us back what matters the most.\n? The Brain Under Pressure: The Cost of Stress and How to Pay Less – a talk about the hidden price of stress and how to reclaim the time, energy and peace of mind.\n\n Bogdan is the founder and CTO of a company developing innovative mobile, wearable devices for recording brain activity. With his team, he’s building a “neuro-gadget” that could one day let us track the brain the way smartwatches track the heart. Alongside growing his entrepreneur",
        "id": 4218899,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=d4zbZ4eYDhU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/d4zbZ4eYDhU/hqdefault.jpg",
        "title": "Mozak pod pritiskom: stres |||| The Brain Under Pressure: The Stress | Bogdan Mijović | TEDxBelgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:32.700082+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:08:50+00:00",
        "description": "Od precrtavanja Mikijevog zabavnika do arhitekture ukusa, David Šimunić nas vodi kroz svet gde se preciznost i emocija susreću.\n\nNjegov recept za sreću? Stavi sve na svoje mesto – u kuhinji i životu.\n\n? Mise en place života – govor o ravnoteži između discipline i kreativnosti, o tome kako “staviti sve na svoje mesto”.\n |||||\nENG: From tracing cartoons in a kids’ magazine to becoming an architect of taste, David Simunic takes us into the world where precision and emotion coexist.\nHis recipe for happiness? Put everything in its place – in the kitchen and in life.\n? The Mise en Place of Life – a talk about balancing discipline with creativity, and how “putting everything in its place” can reshape lives.\n\n David Šimunić is a Belgrade-based chef who stepped into gastronomy after graduating from architecture school. He fused a lifelong love of drawing with culinary craft to create a distinctive style that’s made him a recognized name on Serbia’s food scene. Over his career, David has led th",
        "id": 4218900,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=enNao-iSsgo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/enNao-iSsgo/hqdefault.jpg",
        "title": "Mise en place života ||||| The Mise en Place of Life  | David Šimunić | TEDxBelgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:32.831551+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:08:31+00:00",
        "description": "Šta se dogodi kada odlučimo da prestanemo da igramo po tuđim pravilima? Ina Poljak govori o ranjivosti, snazi i nežnosti koje dolaze kad postanemo svoji.\n? Anatomija autentičnosti — moj bunt, moja pravila – govor o hrabrosti da živiš po sopstvenim pravilima i pronađeš slobodu u autentičnosti.\n |||||\nENG: What happens when we decide to stop playing by other people’s rules?\nIna Poljak speaks about vulnerability, strength, and gentleness we experience when we finally choose to be ourselves.\n? The Anatomy of Authenticity — My Rebellion, My Rules – a talk about the courage to live by your own rules and find freedom in being who you are.\n\n Ina Poljak is a psychologist and writer who brings together psychology, creativity, and a boldly commonsense approach she’s known for. As a consultant and personal-branding coach, she helps entrepreneurs, leaders, and teams clarify what truly matters - and live in alignment with it. She regularly writes columns that out loud challenge the “givens” we’ve t",
        "id": 4218902,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UcRhJC3bK1I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UcRhJC3bK1I/hqdefault.jpg",
        "title": "Anatomija autentičnosti ||||| The Anatomy of Authenticity | Ina Poljak | TEDxBelgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:32.949098+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:08:18+00:00",
        "description": "Olimpijska šampionka, Zorana Arunović, otkriva nam  drugu stranu uspeha — onu iskovanu od emocija.\nKroz pet vrsta suza vodi nas od poraza do pobede, pokazujući da snaga počinje prihvatanjem sopstvene ranjivosti.\n? Olimpijske suze su OK – govor o tome kako prihvatanje emocija postaje izvor istinske snage.\n |||||\nENG: Olympic champion, Zorana Arunovic, reveals the other side of success – the one forged out of emotions.\nThrough five kinds of tears, she takes us from defeat to victory, showing that real strength begins with accepting our own vulnerability.\n? Olympic Tears Are OK – a talk about how embracing our emotions can become a source of true power.\n\n Zorana Arunović is an Olympic champion and a multiple European and World titleholder in shooting, a sport she has pursued since 2001. She took her first steps at 15, following her older sister Jelena - first as a teammate on the national squad, later in a coach–athlete partnership. While Olympic gold is her most recognized accolade, Zor",
        "id": 4218904,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6mrtKt83OeQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6mrtKt83OeQ/hqdefault.jpg",
        "title": "Olimpijske suze su OK ||||| Olympic Tears Are OK  | Zorana Arunović | TEDxBelgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.101594+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:08:10+00:00",
        "description": "Kompozitor i producent filmske muzike, Filip Mitrović, dokazuje da autentičnost nije samo osobina, već supermoć stvaralaca. Od Vorholove konzerve supe do filmske muzike — otkriva kako promena konteksta menja značenja i otvara nove mogućnosti.\n? Zebra među žirafama – govor o tome kako pronaći i živeti svoj jedinstveni životni “blueprint”.\n |||||\nENG: \nFilm music composer and producer, Filip Mitrović, shows that authenticity isn’t just a trait, but the creators’ superpower. From Warhol’s soup can to film scores, he reveals how changing the context changes the meaning and opens a world of possibilities.\n? A Zebra Among Giraffes – a talk about finding and living your unique life’s “blueprint”.\n Filip Mitrović is a Belgrade-born composer and music producer based in Los Angeles. He studied at the Chicago College of Performing Arts and began his career in New York, working on scores for Hollywood blockbusters. Mentored by composer Angelo Badalamenti, he branched into independent projects, co",
        "id": 4218905,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7QZ5-6gLwLE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7QZ5-6gLwLE/hqdefault.jpg",
        "title": "Zebra među žirafama ||||| A Zebra Among Giraffes  | Filip Mitrović | TEDxBelgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.207349+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:07:57+00:00",
        "description": "Najveći usponi se ne mere visinom, već snagom duha. Od Zlatibora do Mont Everesta, priča Marka Nikolića nas podseća da nekad najhrabriji čin nije penjanje, već odustajanje.\n?‍♂️ Vrhovi koji se ne osvajaju – govor o unutrašnjoj snazi, slobodi i mudrosti da ponekad odustaneš.\n |||||\nENG: The greatest heights are not measured in meters, but in strength of spirit.\nFrom Zlatibor to Mount Everest, Marko Nikolic reminds us that sometimes the bravest act isn’t pushing on, but choosing to turn back.\n?‍♂️ Summits Not to Be Conquered – a talk about inner strength, freedom, and the wisdom to sometimes  –  walk away.\n\n\n Marko is a seasoned mountaineer and adventurer with more than two decades of high-altitude experience. He has led numerous expeditions around the globe - from the Himalayas and the Andes to the Caucasus - and his summits include 8,000-meter peaks such as Mount Everest and Cho Oyu, as well as Aconcagua. Since 2012 he has been a licensed mountain guide, specializing in the Balkans an",
        "id": 4218906,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SbcIxDo1vQE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SbcIxDo1vQE/hqdefault.jpg",
        "title": "Vrhovi koji se ne osvajaju ||||| Summits Not to Be Conquered  | Marko Nikolić | TEDxBelgrade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.295244+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:07:43+00:00",
        "description": "What will Asia look like in 2030?\n\nBy 2030, Asia is projected to contribute over one-third of the global economic output and play an increasingly pivotal role in the geopolitical landscape. For businesses, doing more of the same is no longer enough to win in today’s markets. In this insightful talk, Ben Simpfendorfer explores how emerging trade and capital corridors, evolving business models, disruptive technologies, and an aging population will reshape Asia’s future. To succeed, we must reimagine Asia 2030 and the opportunities it presents. Ben Simpfendorfer is a seasoned economist, a thought leader on global trade and commercial ties between Asia and the Middle East, and a leading expert on China’s Belt and Road Initiative (BRI). As a Partner at global management consultancy Oliver Wyman, he advises governments and Fortune 500 companies on strategy across the Asia Pacific markets. \n\nHe also leads the firm’s think tank, the Oliver Wyman Forum in the region, and co-leads the firm’s As",
        "id": 4218907,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=B1RurdBYe6k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/B1RurdBYe6k/hqdefault.jpg",
        "title": "Reimagine Asia's Future To 2030 | Ben Simpfendorfer | TEDxLianyang",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.389976+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:07:30+00:00",
        "description": "Shackled by Guidance is a call to filter the noise, break free from overwhelming expectations, and choose a path defined by independent thinking and self-awareness.\n\nIn a world overflowing with advice from families, friends, and the digital universe, today’s youth often feel constrained rather than empowered. Dr. Veerendra Mishra explores how excessive guidance can unintentionally fuel unhealthy competition and emotional stress.\n\nHe emphasizes the growing importance of emotional intelligence (EQ) over IQ in a rapidly changing world, and how EQ can be nurtured through mindful volunteering that builds empathy and inner clarity.\n\nDrawing on ancient wisdom, this talk encourages us to trust our strengths and embrace compassion, both inward and outward, as we make choices that truly belong to us. Dr. Veerendra Mishra, IPS (2012, Madhya Pradesh cadre), has served in policing since 1995 and held key roles in the Government of India, including CEO of CARA, Director of NISD, and National Direct",
        "id": 4218908,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WFOMFMUj9kI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WFOMFMUj9kI/hqdefault.jpg",
        "title": "Shackled by Guidance | Dr.Veerendra Mishra | TEDxDikshant School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.489470+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:07:02+00:00",
        "description": "What can a global banking professional learn from running marathons? And how can those lessons inspire the next generation to build resilience, discipline, and empathy?\n\nIn this talk, Ambuj Kumar — former international banker, finisher of the prestigious 7 World Marathon Majors, and now CEO of Social Venture Partners India — shares two major pivots in his life. The first is how long-distance running transformed his health, mindset, and approach to challenges, teaching him to compete with himself rather than others. The second is his shift from a successful international banking career to the social impact sector in India, driven by empathy and a desire to make a difference.\n\nThese two journeys intersect beautifully, urging young people to see life as their own marathon — where the real finish line is not medals or grades, but becoming their best selves while helping others go further too. Ambuj Kumar is the India CEO of Social Venture Partners (SVP), the country’s largest engaged phil",
        "id": 4218909,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QMxp1uHtiac",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QMxp1uHtiac/hqdefault.jpg",
        "title": "Run Your Own Marathon : Discipline for Self, Empathy for Others | Ambuj kumar | TEDxDikshant School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.641454+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:06:43+00:00",
        "description": "Zoha Waqas, a Diana Award recipient, takes the stage at TEDxISLPine Youth to unpack the generational tug-of-war wrapped inside one familiar phrase: “Sab theek ho jayega.”\nZoha questions this promise of a better ‘later’ — why we delay our choices, our peace, and even our own definition of theek.\nThrough her journey from almost becoming a doctor to discovering management sciences and later earning global recognition, she reflects on the pressure to fit into older generations’ standards of success.\nZoha highlights that every generation carries its own version of theek, and that kisi ki manzil se apna theek nahi banta.\nShe advocates for bridging generational divides through patience, understanding, and acknowledgement — reminding us that “sab theek ho jayega” begins with embracing what feels right for you. Zoha Waqas, a 2024 Diana Award recipient, Youth4Climate Awardee by UNDP, and Tech for Impact Ambassador at the Global Blockchain Business Council, is a leader in business development an",
        "id": 4218910,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0_6VU97WTdc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0_6VU97WTdc/hqdefault.jpg",
        "title": "It’s Okay: Bridging the Divide Through Our Own ‘Right’ | Zoha Waqas | TEDxISL Pine Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.774641+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:06:34+00:00",
        "description": "Dr Sara Rizvi, a renowned sociologist and educator, reflects on the systemic problems faced by the elderly in her TED Talk. She noted that after studying an old age home in Pakistan, most residents suffered from loneliness, sleeplessness, and other mental health issues due to the lack of accessible primary and tertiary healthcare. To bridge the gap between the older and younger generations and address these issues, she proposed solutions such as weekly intergenerational activities, internship programmes, and integrating time with the elderly into the school curriculum. In a survey she conducted, she discovered that although the youth face different challenges from the elderly, they still demonstrate empathy towards older generations. She also highlighted the potential of our generation, believing that we can break down the barriers faced by both Gen Z and baby boomers. She concluded her talk by elaborating on Muhammad Ali Jinnah’s famous quote, “Unity, Faith, Discipline,” explaining h",
        "id": 4218911,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pE8Mz89vTis",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pE8Mz89vTis/hqdefault.jpg",
        "title": "Connecting Generations Through Intergenerational Learning | Dr. Sara Rizvi | TEDxISL Pine Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.867658+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:06:21+00:00",
        "description": "In this powerful TEDx talk, national cyclist Fatima Tahir shares her journey from a 10-year-old girl limited to an egg-and-spoon race to becoming a forerunner for Pakistani women in sports. She reflects on the challenges, societal pressures, and the ongoing repercussions that female athletes face. Fatima mentions drawing strength from sports icons like Sania Mir, Hajra Khan, and Samina Baig; she recounts her accidental start in cycling, the difficult setbacks, failed exams, injuries, federation politics, and the moment her dream almost came to an end. But with the courage and strength of her family, Fatima rose again to become a national junior champion, and later she founded the Falcon Triathlon Club. Her message is clear: when one generation chooses trust over fear, the next finds the courage to change the world. Fatima Tahir is an International School Lahore Alumna and 19 year old athlete on a mission to inspire young girls in Pakistan to run, cycle, and follow their dreams. With a",
        "id": 4218912,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LpEueL9CmOw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LpEueL9CmOw/hqdefault.jpg",
        "title": "Why Girls Deserve More Than the Egg-and-Spoon Race | Fatima Tahir | TEDxISL Pine Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:33.966631+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:06:07+00:00",
        "description": "Dr Usman Hotiana, a Professor of Psychiatry and Behavioural Sciences, delivers a profound TEDx talk about how he has navigated generational divides that shape our thoughts, feelings, and interactions throughout life. He talks about how environment, culture, and spirituality affect mental health by talking about his childhood, which was misunderstood but full of imagination, the strict demands of medical school, and the harsh realities of psychiatric practice in Pakistan. Dr. Hotiana talks about the problems that come with stigma, the flaws in outdated systems, and the need for empathy and honest communication. He does this by drawing on his own clinical experiences and those of his mentors and spiritual leaders. Dr. Hotiana illustrates that bridging generational divides necessitates humility, connection, and comprehension among spirituality, mentorship, and science.\n Dr Usman Hotiana is the Head of the Psychiatry Department at Rashid Latif Medical College and a graduate of King Edward",
        "id": 4218913,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WKpuw6e_PH8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WKpuw6e_PH8/hqdefault.jpg",
        "title": "A Psychiatrist’s Journey Through the Generational Gaps  | Dr Usman Hotiana | TEDxISL Pine Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T16:24:34.104825+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T16:01:40+00:00",
        "description": "NOTE FROM TED: TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf \n\nWould you believe that a restaurant company could be a community catalyst?  That a simple series of curiosities could ultimately change your community and the world for the better? As Minister of Culture at M’tucci’s, Howie Kaibel champions the idea that restaurants can serve not just food, but connection. From pioneering 4-day workweeks to launching a nonprofit tutoring program, Howie redefines what business can be when we ask, “How might we serve our community better?” His background in theater and community engagement fuels a hospitality model rooted in creativity and care. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4218914,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mg-tieUFUy0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mg-tieUFUy0/hqdefault.jpg",
        "title": "What if We Looked at Restaurants as Community Catalysts? | Howie Kaibel | TEDxABQ",
        "vote": 0
    }
]