[
    {
        "age": null,
        "album": "",
        "author": "Joshua Fluke",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T20:01:10.551497+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T19:50:19+00:00",
        "description": "Job interviews are cooked. Completely done. And nothing proves it better than a LinkedIn recruiter melting down because a candidate dared to interview at more than one place. A woman accepted a better offer, and this guy acts like she triggered a supply-chain collapse because she didn’t treat his offer like a blood oath.\n\nIn today’s video, we break down the absurd fantasy world where companies can ghost you, delay you, underpay you, and juggle 40 candidates at once — but you choosing the best job is “unprofessional” and “disrespectful.” It’s peak LinkedIn logic.\n\nIf you’ve ever felt like the hiring process has turned into a rigged reality show where the rules only apply to you, this one’s for you. Interviews aren’t just broken — jobs are cooked.\n\n#RecruiterCringe #LinkedInLunatics #JoshuaFluke\n\n❤️ Support my content because corporate sponsors rarely do! \n https://www.patreon.com/joshuafluke\n\n🔥 Need a resume/cover letter? Check out my templates!  \nhttps://www.joshuafluke.store/\n\n👊 Join",
        "id": 4221001,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=x8uWvrbF8ZE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 169,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC-91UA-Xy2Cvb98deRXuggA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/x8uWvrbF8ZE/hqdefault.jpg",
        "title": "JOB INTERVIEWS ARE COOKED!",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Joshua Fluke",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-02T02:38:10.898275+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-02T01:51:17+00:00",
        "description": "LinkedIn recruiters have entered their feral era, and apparently the rest of us are just here to survive it.\n\nOne recruiter says they reject candidates because their voice sounded “dry.” Another says your name has the wrong number of syllables. Then someone else says you’re “mysterious” if you don’t post your entire medical history and social security number on LinkedIn.\n\nAt this point, you don’t need a resume — you need a branding team, a dialect coach, a nose-flute solo, and a vowel-optimization strategy just to get a phone screen.\n\nIn this video, we break down the latest wave of recruiter meltdowns, featuring:\n\nThe guy who demands you “sound excited” over the phone, even though the job description sounds like prison with Wi-Fi\n\nThe study claiming your name determines your career destiny (sorry Tate, you should’ve been born a Noel)\n\nThe recruiter who rejected a senior data architect because his LinkedIn profile looked like a national security threat\n\nAnd the absolute 5-D chess follo",
        "id": 4213956,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=kSkfWZka9F0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 169,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC-91UA-Xy2Cvb98deRXuggA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kSkfWZka9F0/hqdefault.jpg",
        "title": "LINKEDIN RECRUITERS KEEP LOSING THEIR MINDS!",
        "vote": 0
    }
]