[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "On Bluesky, the joke's on you if you don't get the joke. The social network has become a \"refuge\" for those fleeing X and Threads, but its growing pains include a serious case of humor-impairment. When Amy Brown jokingly posted she was \"screaming, crying, and throwing up\" about price differences between Ohio and California Walgreens, literal-minded users scolded her for exaggerating. Brown, a former Wendy's social media manager who got banned from X after impersonating Elon Musk, puts it simply: \"We're both speaking English, but I'm speaking internet.\" \n\nThis clash stems from Bluesky's oddly mixed population: irony-steeped Twitter refugees mingling with earnest Facebook transplants and MSNBC viewers who took the plunge after seeing the platform mentioned on shows like Morning Joe. \"It's riff collapse,\" says cartoonist Mattie Lubchansky, describing how her obviously absurd Oscar post triggered sincere movie recommendations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<",
        "id": 2510538,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/08/0524221/bluesky-cant-take-a-joke?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bluesky Can't Take a Joke",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "China is moving fast to dominate biotechnology, and the U.S. risks falling behind permanently unless it takes action over the next three years, a congressional commission said. WSJ: Congress should invest at least $15 billion to support biotech research over the next five years and take other steps to bolster manufacturing in the U.S., while barring companies from working with Chinese biotech suppliers, the National Security Commission on Emerging Biotechnology said in a report Tuesday. To achieve its goals, the federal government and U.S.-based researchers will also need to work with allies and partners around the world. \n\n\"China is quickly ascending to biotechnology dominance, having made biotechnology a strategic priority for 20 years,\" the commission said. Without prompt action, the U.S. risks \"falling behind, a setback from which we may never recover.\" The findings convey the depth of worry in Washington that China's rapid biotechnology advances jeopardize U.S. national security",
        "id": 2510533,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/08/1559250/chinas-biotech-advances-threaten-us-dominance-warns-congressional-report?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China's Biotech Advances Threaten US Dominance, Warns Congressional Report",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "Framework -- a company that makes upgradeable and repairable laptops -- will pause sales on several versions of one of its models in America thanks to Trump's tariffs, it said. From a report: \"Due to the new tariffs that came into effect on April 5th, we're temporarily pausing US sales on a few base Framework Laptop 13 systems (Ultra 5 125H and Ryzen 5 7640U). For now, these models will be removed from our US site. We will continue to provide updates as we have them,\" Framework said in a post on X. \n\nA spokesperson for Framework told 404 Media in an email that the company was pausing sales on their six lowest priced units in the U.S. They clarified that those models are still available to customers that are ordering the machines outside of America.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Framework+Stops+Selling+Some+of+Its+Laptops+in+the+US+Due+To+Tariffs%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F04%",
        "id": 2510542,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/08/0110226/framework-stops-selling-some-of-its-laptops-in-the-us-due-to-tariffs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Framework Stops Selling Some of Its Laptops in the US Due To Tariffs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "In Delhi's Nehru Place and Mumbai's Lamington Road, technicians are creating functional laptops from salvaged parts of multiple discarded devices. These \"Frankenstein\" machines sell for approximately $110 USD -- a fraction of the $800 price tag for new models. Technicians extract usable components -- motherboards, capacitors, screens, and batteries -- from e-waste sourced locally and from countries like Dubai and China. \n\n\"Most people don't care about having the latest model; they just want something that works and won't break the bank,\" a technician told Verge. This repair ecosystem operates within a larger battle against tech giants pushing planned obsolescence through proprietary designs and restricted parts access. Many technicians source components from Seelampur, India's largest e-waste hub processing 30,000 tonnes daily, though workers there handle toxic materials with minimal protection. \"India has always had a repair culture,\" says Satish Sinha of Toxics Link, \"but companies",
        "id": 2510537,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/08/1116241/indias-frankenstein-laptop-economy-thrives-against-planned-obsolescence?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "India's 'Frankenstein' Laptop Economy Thrives Against Planned Obsolescence",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "Meta released two new Llama 4 models over the weekend -- Scout and Maverick -- with claims that Maverick outperforms GPT-4o and Gemini 2.0 Flash on benchmarks. Maverick quickly secured the number-two spot on LMArena, behind only Gemini 2.5 Pro. \n\nResearchers have since discovered that Meta used an \"experimental chat version\" of Maverick for LMArena testing that was \"optimized for conversationality\" rather than the publicly available version. \n\nIn response, LMArena said \"Meta's interpretation of our policy did not match what we expect from model providers\" and announced policy updates to prevent similar issues.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Got+Caught+Gaming+AI+Benchmarks%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F08%2F133257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.co",
        "id": 2510536,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/08/133257/meta-got-caught-gaming-ai-benchmarks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Got Caught Gaming AI Benchmarks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "Micron has informed US customers it will implement surcharges on memory modules and solid-state drives starting Wednesday to offset President Trump's new tariffs, according to Reuters. While semiconductors received exemptions in Trump's recent trade action, memory storage products didn't escape the new duties. \n\nMicron, which manufactures primarily in Asian countries including China and Taiwan, had previously signaled during a March earnings call that tariff costs would be passed to customers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Micron+To+Impose+Tariff-Related+Surcharge+on+SSDs%2C+Other+Products%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F04%2F08%2F154257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F04%2F08%2F154257%2",
        "id": 2510535,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/08/154257/micron-to-impose-tariff-related-surcharge-on-ssds-other-products?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Micron To Impose Tariff-Related Surcharge on SSDs, Other Products",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "Children in a small Japanese town are obsessively collecting trading cards featuring local elderly men rather than popular fantasy creatures, helping bridge generational gaps in an aging rural community. \n\nIn Kawara, Fukuoka Prefecture, the \"Ojisan TCG\" (Middle-aged Man Trading Card Game) features 28 local men with assigned elemental types and battle stats. The collection includes a former fire brigade chief and a prison officer-turned-volunteer whose card has become so sought-after that children request his autograph. \n\nCreated by Eri Miyahara of the Saidosho Community Council, the initiative has doubled participation in town events. \"We wanted to strengthen the connection between children and older generations,\" Miyahara told Fuji News Network. \"So many kids are starting to look up to these men as heroic figures.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Middle-Aged+Man+Trading+Cards+Go+Viral+in+Rural+Japan",
        "id": 2510532,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/08/184226/middle-aged-man-trading-cards-go-viral-in-rural-japan-town?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Middle-Aged Man Trading Cards Go Viral in Rural Japan Town",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "Colossal Biosciences has claimed it \"successfully restored\" the extinct dire wolf after a \"10,000+ year absence,\" but scientists clarify these are actually genetically modified grey wolves. The U.S. company announced three pups -- males Remus and Romulus born in October, and female Khaleesi born in January -- as dire wolves, but made only 20 genetic edits to grey wolves. \n\nBeth Shapiro of Colossal told New Scientist that just 15 modifications were based on dire wolf DNA, primarily targeting size, musculature and ear shape. Five other changes involve mutations known to produce light coats in grey wolves. A 2021 DNA study revealed dire wolves and grey wolves last shared a common ancestor about 6 million years ago, with jackals and African wild dogs more closely related to grey wolves.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=No%2C+the+Dire+Wolf+Has+Not+Been+Brought+Back+From+Extinction%3A+https%3A%2F%2Fscience.",
        "id": 2510540,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/08/0215244/no-the-dire-wolf-has-not-been-brought-back-from-extinction?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "No, the Dire Wolf Has Not Been Brought Back From Extinction",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "Shopify CEO Tobi Lutke is changing his company's approach to hiring in the age of AI. Employees will be expected to prove why they \"cannot get what they want done using AI\" before asking for more headcount and resources, Lutke wrote in a memo to staffers that he posted to X. From a report: \"What would this area look like if autonomous AI agents were already part of the team?\" Lutke wrote in the memo, which was sent to employees late last month. \"This question can lead to really fun discussions and projects.\" Lutke also said there's a \"fundamental expectation\" across Shopify that employees embrace AI in their daily work, saying it has been a \"multiplier\" of productivity for those who have used it. \n\n\"I've seen many of these people approach implausible tasks, ones we wouldn't even have chosen to tackle before, with reflexive and brilliant usage of AI to get 100X the work done,\" Lutke wrote. The company, which sells web-based software that helps online retailers manage sales and run the",
        "id": 2510534,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/08/1518213/shopify-ceo-says-staffers-need-to-prove-jobs-cant-be-done-by-ai-before-asking-for-more-headcount?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Shopify CEO Says Staffers Need To Prove Jobs Can't Be Done By AI Before Asking for More Headcount",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "New Mexico's legislature passed bills last week that would ban consumer products containing PFAS, joining a small but growing number of states taking action against these persistent \"forever chemicals.\" If signed by the governor, the legislation would prohibit the sale of many products with added per- and polyfluorinated alkyl substances (PFAS) in New Mexico, making it the third state after Maine and Minnesota to enact such comprehensive restrictions. \n\nAt least 29 states have PFAS-related bills before state legislatures this year, according to Safer States, a network of advocacy organizations. Research shows PFAS accumulate in the environment and human bodies, potentially causing health problems from high cholesterol to cancer. EPA figures indicate almost half of Americans are exposed to PFAS in their drinking water. \n\nWired reports that chemical and consumer products industries are aggressively fighting state-level bans on \"forever chemicals\" through lobbying and legal action as re",
        "id": 2510541,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/08/0126258/states-are-banning-forever-chemicals-industry-is-fighting-back?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "States Are Banning Forever Chemicals. Industry Is Fighting Back",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T18:08:31+00:00",
        "description": "The U.S. is still the global leader in state-of-the-art AI, but China has closed the gap considerably, according to a new report from Stanford. Axios: Institutions based in the U.S. produced 40 AI models of note in 2024, compared with 15 from China and three from Europe, according to the eighth edition of Stanford's Artificial Intelligence Index, released on Monday. \n\nHowever, the report found that Chinese models have rapidly caught up in quality, noting that Chinese models reached near parity on two key benchmarks after being behind leading U.S. models by double digit percentages a year earlier. Plus, it said, China is now leading the U.S. in AI publications and patents.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US's+AI+Lead+Over+China+Rapidly+Shrinking%2C+Stanford+Report+Says%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F04%2F08%2F053232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https:/",
        "id": 2510539,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/08/053232/uss-ai-lead-over-china-rapidly-shrinking-stanford-report-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US's AI Lead Over China Rapidly Shrinking, Stanford Report Says",
        "vote": 0
    }
]