[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T23:00:15+00:00",
        "description": "The new entry in the long dormant real-time-tactics series returns on April 9th with the prequel game Commandos: Origins. This new entry honors past games in the series with the same class based commando units and isometric perspective but includes some new modern features.\n\nDeveloped in Unreal Engine 5, Commandos Origins features great visuals and some streamlined elements, notably the omission of enemy inventory. I quite enjoyed the variety of missions and plethora of ways to go about each, but had to overcome a number of bugs and other issues to do so.",
        "id": 2513437,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ALzFslMDe1M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ALzFslMDe1M/hqdefault.jpg",
        "title": "Commandos Origins Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T15:30:05+00:00",
        "description": "PS5 players get to experience yet another title previously tied to Microsoft’s ecosystem. Indiana Jones and the Great Circle was Microsoft’s biggest exclusive in years and shines as one of the most satisfying Indy experiences in a decade.  \n\nOn April 17th PlayStation players can experience Indy’s latest excursion with the benefit of numerous patches and quality of life improvements. The PS5 version features a number of unique quirks that harness Sony’s machine in distinct ways.\n\nBut there is a silver lining for non-Sony players: namely the addition of two new abilities across all platforms timed with the early access period for the PS5 version.\n\nPre-orders are up now, including two cosmetic items regardless of edition. Get ready for one of the most impressive games of 2024 as Indiana Jones and the Great Circle joins the PS5 family on April 17th.",
        "id": 2510652,
        "language": null,
        "link": "https://www.youtube.com/watch?v=EptBkye9j0k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EptBkye9j0k/hqdefault.jpg",
        "title": "Indiana Jones And The Great Circle PS5 - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-08T10:00:53+00:00",
        "description": "Between multiple genres, some recent and others decades old, sequels, remakes, triple-A, indie, and much more, the variety in gaming is simply incredible. There is so much to play and experience with so many other games launching each month that it becomes nearly impossible to keep track of them all.\n\nNevertheless, there are select titles that maintain a legendary status, even after so many years. FromSoftware's Souls-like titles, Nintendo's exclusives, the two most well-known racing titles in the world, the best remakes out there, top-tier RPGs - the list goes on. And that's before getting into games with \"bigger\" sequels packed with new mechanics and content.\n\nCheck out our picks for the top 30 best games of all time as of 2025. Whether it's a game that's stood the test of time or ranks in the top five, you don't want to miss out on them.",
        "id": 2510653,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cUd1NhAGLi8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cUd1NhAGLi8/hqdefault.jpg",
        "title": "TOP 30 Greatest Games of All Time You Absolutely Need To Play At Least ONCE",
        "vote": 0
    }
]