[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-17T15:56:08.975034+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-17T15:30:14+00:00",
        "description": "VOID Interactive’s tactical first-person shooter Ready or Not has no right being as good as it is. With clever gameplay mechanics and incredible world-building working well with convoluted level designs, its gameplay loop brings a lot of tension to the table in ways that other games will really have to try hard to replicate. \n\nBuilding up adrenaline and a fight or flight response right from the mission briefing, every attempt to achieve your goals in its many missions is an exercise in caution and requires you to actively focus on being disciplined enough not to pull the trigger at the first sign of trouble. Split-second decisions that could go horribly wrong are a normal occurrence in this game, and come with real consequences in a very gritty take on police simulators that we simply can’t get enough of.",
        "id": 3189481,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=UDnfepS2Ygw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UDnfepS2Ygw/hqdefault.jpg",
        "title": "Why Ready or Not Is the Most Tense Shooter You’ll Ever Play On PS5 And Xbox",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-17T13:46:45.002441+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-17T13:30:27+00:00",
        "description": "When Cyberpunk 2077 launched in December 2020 to much controversy, very few expected it to bounce back like it did. CD Projekt RED poured exceptional effort into turning things around, and by 2023, with the release of Phantom Liberty, it finally felt like the role-playing game that fans really desired.\n\nWhile the team has since moved on, the company (alongside Virtuos) continues to improve the game, as seen in Patch 2.3. It adds four new vehicles and new jobs for acquiring some of them, extends the RayField CrystalCoat feature to more vehicles, new Photo Mode features, and, best of all, AutoDrive. If you prefer, Delamain's cab service is now a proper taxi service.\n\nThe overall impact of all this may seem minuscule to those who have already finished the game or expect things like New Game+ and PS5 Pro support. However, alongside enhancing the immersion, Patch 2.3 also ensures that future players have an even better experience when they venture forth into Night City for the first time.",
        "id": 3188262,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=W8ZnrREnQ_A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/W8ZnrREnQ_A/hqdefault.jpg",
        "title": "Is Cyberpunk 2077's Patch 2.3 a GAME CHANGER?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-17T11:37:54.609792+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-17T08:00:39+00:00",
        "description": "We take a look at Robocop: Unfinished Business, a standalone title from Teyon after its well-received take on the cyborg police officer in 2023’s Robocop: Rogue City. The new game builds on the original title in meaningful ways while adding fresh new weapons, skills, enemy types, and a very memorable antagonist that blends well to make Unfinished Business a solid experience overall. \n\nWhile it could have used a little more backstory for its supporting cast, Teyon has ensured that the shorter runtime does not compromise on the overall quality of the game. It’s a standalone expansion that deserves your attention, doing a very good job of making you feel like an indomitable combination of man and machine.",
        "id": 3186822,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Xma3FEsm6OQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Xma3FEsm6OQ/hqdefault.jpg",
        "title": "RoboCop: Rogue City - Unfinished Business Review - The Final Verdict",
        "vote": 0
    }
]