[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-13T15:58:22.635805+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-13T15:30:31+00:00",
        "description": "When looking back on Tony Hawk's Pro Skater 1 + 2, it felt like a real labor of love, a desire to revive the original games for the current generation without compromising on their excellent gameplay. Tony Hawk's Pro Skater 3 + 4 is definitely in the same vein, especially when it comes to the roster, goals, post-game content, and visuals. \n\nHowever, whether it's due to a mandate from new management or simply because it lacked the resources, Iron Galaxy has pared down the experience in places where it counts the most. The results are complicated – you can still become embroiled in the thrill of completing goals and perfecting runs for the highest scores. The various bugs and screen-tearing issues will also doubtless be fixed, but it's impossible to ignore just how much has been lost in the transition.",
        "id": 3154997,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=kZAtW_HWKmo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kZAtW_HWKmo/hqdefault.jpg",
        "title": "Tony Hawk's Pro Skater 3 + 4 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-13T13:48:20.142393+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-13T13:30:01+00:00",
        "description": "Killing Floor 3 is the upcoming third entry in Tripwire Interactive’s much-loved wave-based horde slaying shooter series, and whilst the developers have been careful to cling onto its predecessor’s core experience there is also plenty of ambition in how they’re hoping to revamp the series’ presentation and gameplay. \n\nThe bioengineered Zed threats are much more terrifying in their unpredictability, but players can now blow them up via broader, more distinct means thanks to the cutting-edge technology the team are using to develop the game. Furthermore, overhauled progression and customisation systems, including a wider suite of weapon modifications and character cosmetics, plus fresh dynamism in mission objectives and nods to more collaborative teamwork are set to ensure Killing Floor 3 provides breakneck fun and satisfaction in equal measure.",
        "id": 3154274,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=-yHrKfydcX8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-yHrKfydcX8/hqdefault.jpg",
        "title": "Killing Floor 3 vs. Killing Floor 2 - 15 BIGGEST Differences You NEED TO KNOW",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-13T10:33:24.886201+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-13T09:30:00+00:00",
        "description": "You might be forgiven if you were thinking that Bandai Namco’s Shadow Labyrinth is going to be a Pac-Man adventure that’s in line with other titles in the character’s long history in gaming. \n\nHowever, a gritty and dark adventure awaits you in this reimagining of the character’s origins and gameplay loop which introduces an agile new protagonist to accompany the hero of old as they attempt to navigate and eventually escape The Maze, a dangerous world full of mysteries, threats and lore to uncover. \n\nWe take a look at a few things you should know about the upcoming game ahead of its July 2025 release, and leave it to you to decide if it’s worth your time and hard-earned cash.",
        "id": 3153337,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=-i-z0m80yEc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-i-z0m80yEc/hqdefault.jpg",
        "title": "Shadow Labyrinth - 11 Things You Need To Know Before You PRE-ORDER",
        "vote": 0
    }
]