[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T23:56:33.027578+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T23:20:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Google's accelerated Android release cycle will soon deliver a new version of the software, and it might look quite different from what you'd expect. Amid rumors of a major UI overhaul, Google seems to have accidentally published a blog post detailing \"Material 3 Expressive,\" which we expect to see revealed at I/O later this month. Google quickly removed the post from its design site, but not before the Internet Archive saved it.\n \nIt has been a few years since Google introduced any major changes to its Material theming, but the design team wasn't just sitting idly this whole time. According to the leaked blog post, Google has spent the past three years working on a more emotionally engaging vision for Android design. While the original Material Design did an admirable job of leveraging colors and consistent theming, it could make apps look too similar. The answer to that, apparently, is Material 3 Expressive.\n \nGoogle says this i",
        "id": 2616369,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/06/2119207/google-accidentally-reveals-androids-material-3-expressive-interface?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Accidentally Reveals Android's Material 3 Expressive Interface",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T22:52:50.737408+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T22:40:00+00:00",
        "description": "Longtime Slashdot reader RoccamOccam shares a blog post from the Trifecta Tech Foundation, a nonprofit organization that creates secure, open source building blocks for infrastructure software. The foundation is also the developer behind Sudo-rs. From the report: Ubuntu 25.10 is set to adopt sudo-rs by default. Sudo-rs is a memory-safe reimplementation of the widely-used sudo utility, written in the Rust programming language. This move is part of a broader effort by Canonical to improve the resilience and maintainability of core system components. [...]\n \nThe decision to adopt sudo-rs is in line with Canonical's commitment to Carefully But Purposefully increase the resilience of critical system software, by adopting Rust. Rust is a programming language with strong memory safety guarantees that eliminates many of the vulnerabilities that have historically plagued traditional C-based software. Sudo-rs is part of the Trifecta Tech Foundation's Privilege Boundary initiative, which aims to",
        "id": 2616090,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/06/213254/memory-safe-sudo-to-become-the-default-in-ubuntu?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Memory-Safe Sudo To Become the Default In Ubuntu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T22:52:50.850647+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T22:00:00+00:00",
        "description": "President Trump's proposed 2026 budget seeks to cut nearly $500 million from CISA, accusing the agency of prioritizing censorship over cybersecurity and election protection. \"The proposed cuts -- which are largely symbolic at this stage as they need to be approved by Congress -- are framed as a purge of the so-called 'censorship industrial complex,' a term the White House uses to describe CISA's work countering misinformation,\" reports The Register. From the report: In its fiscal 2024 budget request, the agency had asked [PDF] for a total of just over $3 billion to safeguard the nation's online security across both government and private sectors. The enacted budget that year was about $34 million lower than the previous year's. Now, a deep cut has been proposed [PDF], as the Trump administration decries the agency's past work tackling the spread of misinformation on the web by America's enemies, as well as the agency's efforts safeguarding election security. [...]\n \n\"The budget elimin",
        "id": 2616091,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/06/2056230/cisa-budget-faces-possible-500-million-cut?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CISA Budget Faces Possible $500 Million Cut",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T21:47:27.472337+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T21:20:00+00:00",
        "description": "With iOS 18.5, Apple is bringing carrier-based satellite connectivity to the entire iPhone 13 lineup, allowing users with compatible carrier plans (like T-Mobile's Starlink-powered service) to access satellite features in areas without traditional coverage. The update is expected to launch next week. 9to5Mac reports: It's important to note that this update does not bring Apple's Emergency SOS via satellite to the iPhone 13 series. That feature relies on specialized hardware found only in iPhone 14 and later and functions independently of carrier networks. It also doesn't \"install Starlink\" on every iPhone, just support for carrier-provided satellite features like Starlink. By contrast, carrier-provided satellite services behave more like conventional cellular connections and require a participating plan to work.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iOS+18.5+Enables+Carrier+Satellite+Service+Like+T-Mobile+S",
        "id": 2615641,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/06/2041241/ios-185-enables-carrier-satellite-service-like-t-mobile-starlink-on-older-iphones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "iOS 18.5 Enables Carrier Satellite Service Like T-Mobile Starlink On Older iPhones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T20:41:29.633714+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T20:37:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Google on Tuesday announced the launch of Gemini 2.5 Pro Preview (I/O edition), an updated version of its flagship Gemini 2.5 Pro AI model that the company claims tops a number of widely used benchmarks. Gemini 2.5 Pro Preview (I/O edition) is available via the Gemini API and Google's Vertex AI and AI Studio platforms, and is priced the same as the Gemini 2.5 Pro model it effectively replaces. It's also in Google's Gemini chatbot app for the web and for mobile devices.\n \nThe model's release comes ahead of Google's annual I/O developer conference (hence the \"I/O edition\" designation), where Google is expected to unveil a host of models, as well as AI-powered tools and platforms. [...] According to Google, Gemini 2.5 Pro Preview (I/O edition) has \"significantly\" improved capabilities for coding and building interactive web apps. The model is also better at tasks like code transformation -- that is, modifying a piece of code to achieve",
        "id": 2615149,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/06/2036211/google-debuts-an-updated-gemini-25-pro-ai-model-ahead-of-io?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Debuts an Updated Gemini 2.5 Pro AI Model Ahead of I/O",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T19:35:29.111729+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T19:25:00+00:00",
        "description": "Chief executives are exiting their posts at an unprecedented rate as economic volatility and emerging challenges reshape corporate leadership decisions, according to data from executive tracking firm Challenger, Gray &amp; Christmas. \n\nPublic-company CEO departures reached 373 last year, jumping 24% from 2023 levels. Among U.S. businesses with at least 25 employees, 2,221 chief executives left their positions in 2024, the highest number since Challenger began monitoring departures in 2002. \n\nCorporate leaders are citing AI, tariffs, recession fears and scrutiny of diversity initiatives as key stressors driving the exodus. \"It's a very difficult time to lead,\" said Blake Irving, former GoDaddy CEO. \"Given all the weird gyrations going on in the economy and with our new administration, it's really hard for even great leaders to find a true north.\" The trend extends beyond the C-suite, with managers 1.7 times more likely to report high workplace stress than rank-and-file employees, accor",
        "id": 2614650,
        "language": null,
        "link": "https://slashdot.org/story/25/05/06/1843232/ceo-departures-hit-record-levels?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CEO Departures Hit Record Levels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T19:35:29.225722+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T18:45:00+00:00",
        "description": "English regulators have approved a new law firm that uses AI instead of lawyers to offer services for as little as $2.67, as the technology continues to disrupt industries from finance to accounting. From a report: Garfield AI, which was founded by a former London litigator and a quantum physicist, is an online tool that allows businesses and individuals such as tradespeople to chase debts owed to them at a substantially lower cost than the average lawyer's fees. Its AI assistant guides claimants through the small claims court process, including creating \"polite chaser\" letters for $2.67 and filing documents such as claim forms for $67, and can also produce arguments for claimants to use at trial. \n\nAI models are increasingly encroaching on legally sensitive tasks in high-paying sectors such as law and finance, potentially undercutting fees in high-volume work. Garfield received approval from the Solicitors Regulation Authority, the legal regulator for England and Wales, in March, in ",
        "id": 2614651,
        "language": null,
        "link": "https://slashdot.org/story/25/05/06/1833226/ai-law-firm-offering-27-legal-letters-wins-landmark-approval?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Law Firm Offering $2.7 Legal Letters Wins 'Landmark' Approval",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T18:27:02.518334+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T18:05:00+00:00",
        "description": "Microsoft has unveiled a substantial AI-focused update for Windows 11 and Copilot+ PCs, introducing features that leverage neural processing units across the operating system. The update centers on AI-powered helpers across core Windows apps, with an intelligent agent in Settings that can locate and adjust options via natural voice commands. Key additions include expanded Click To Do functionality, allowing users to draft Word content based on screen context, engage Reading Coach, or send details directly to Excel tables. \n\nThe Photos app gains a relight feature with support for three customizable light sources, while Paint adds object selection and text-to-sticker generation. Snipping Tool will automatically detect and crop prominent screen content, adding text extraction and color picking capabilities. System-level enhancements include an updated Start menu with phone companion integration, AI-powered actions in File Explorer for content summarization, and text generation in Notepad",
        "id": 2614111,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/06/185254/microsoft-unveils-ai-powered-overhaul-for-windows-11?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Unveils AI-Powered Overhaul for Windows 11",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T18:27:02.631422+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T17:25:00+00:00",
        "description": "BrianFagioli writes: Fedora Linux is now officially available as a Windows Subsystem for Linux (WSL) distribution! That's right, folks, following prior testing, you can now run Fedora 42 natively inside Windows using WSL. As someone who considers Fedora to be my favorite Linux distribution, this is a pretty exciting development. \n\nInstalling it is simple enough. Just open up a terminal and type wsl --install FedoraLinux-42 to get started. After that, launch it with wsl -d FedoraLinux-42 and set your username. No password is required by default, and you'll automatically be part of the wheel group, meaning you can use sudo right out of the gate.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Makes+Fedora+an+Official+Windows+Subsystem+for+Linux+(WSL)+Distribution%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F05%2F06%2F1652215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/",
        "id": 2614112,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/05/06/1652215/microsoft-makes-fedora-an-official-windows-subsystem-for-linux-wsl-distribution?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Makes Fedora an Official Windows Subsystem for Linux (WSL) Distribution",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T17:23:01.518169+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T16:46:00+00:00",
        "description": "Reddit's Steve Huffman isn't mincing words about what he found when he came back as CEO in 2015: a company full of idealists who weren't exactly killing themselves with hard work. \n\n\"We were really idealistic, and that's been good in many ways, but we were also idealistic about not being a business,\" Huffman said on the \"Prof G Pod\" podcast. \"Wrapped up in some of that idealism was also not working very hard,\" he added. \n\nHuffman sees this as a Silicon Valley disease: \"It's almost an entitlement of, 'I work at these companies, but I don't have to work very hard and I'm here for myself.'\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Reddit+CEO+Says+'Idealism'+Masked+Poor+Work+Ethic+in+Company's+Early+Days%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F06%2F1647209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.fa",
        "id": 2613390,
        "language": null,
        "link": "https://slashdot.org/story/25/05/06/1647209/reddit-ceo-says-idealism-masked-poor-work-ethic-in-companys-early-days?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Reddit CEO Says 'Idealism' Masked Poor Work Ethic in Company's Early Days",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T16:16:07.754522+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T16:00:00+00:00",
        "description": "Recent college graduates face the worst job market in decades, with unemployment reaching 5.8%, according to recently released New York Federal Reserve data. The \"recent-grad gap\" - the difference between unemployment rates of young college graduates versus the overall labor force - has hit its lowest point in four decades, indicating college graduates are facing unusual difficulties securing employment. (The New York Federal Reserve said labor conditions for recent college graduates have \"deteriorated noticeably\" in the past few months.) \n\nEven graduates from elite MBA programs are struggling to find work, while law school applications have surged as young people seek shelter from the difficult job market. Economists are attributing the decline to three potential factors: incomplete recovery from pandemic disruptions, diminishing returns on college education, and possibly AI replacing entry-level positions. \n\n\"When you think about what generative AI can do, it's the kind of things th",
        "id": 2612769,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/06/1522235/college-graduate-unemployment-hits-58-highest-in-decades?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "College Graduate Unemployment Hits 5.8%, Highest in Decades",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T16:16:07.867274+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T15:22:00+00:00",
        "description": "Most people in the United States rely on federal science in their daily lives but don't realize it, a new nationwide poll of U.S. adults shows. NPR: The poll was conducted in early April by the Association of Science and Technology Centers, the association for science museums and other educational science centers in the U.S. The poll found that on a weekly basis more than 90% of people use weather forecasts, job market reports, food safety warnings and other information that is based on federal science. \n\nBut only 10% of respondents are concerned that cuts to federal support for science might impact their access to such information. The Trump administration has made deep budget and personnel cuts to federal agencies that collect weather data and do safety inspections at factories that make food and prescription drugs, among many science-related functions. \n\nThe association conducted the poll to understand current attitudes about science in the U.S. and inform how their member institut",
        "id": 2612770,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/06/1456252/most-americans-use-federal-science-information-on-a-weekly-basis-a-new-poll-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Most Americans Use Federal Science Information On a Weekly Basis, a New Poll Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T14:43:19.520344+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T14:43:19+00:00",
        "description": "Microsoft has instituted a stringent new performance management system that places ousted employees on a two-year rehiring block list and categorizes their departures as \"good attrition,\" Business Insider reported Tuesday, citing internal documents. The company now tracks staff departures it considers beneficial, mirroring Amazon's \"unregretted attrition\" metric, though no specific targets have been established yet. \n\nMicrosoft recently terminated 2,000 underperforming employees without severance and implemented a new performance improvement plan (PIP). Employees facing performance issues now must choose between entering the PIP or accepting a \"Global Voluntary Separation Agreement\" with 16 weeks of pay. \n\nFurther reading: Microsoft Offers Underperformers Cash To Quit.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Labels+Some+Fired+Staff+as+'Good+Attrition'%2C+Imposes+Two-Year+Rehiring+Ban%3A+https%3A%2F%",
        "id": 2612088,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/06/143242/microsoft-labels-some-fired-staff-as-good-attrition-imposes-two-year-rehiring-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Labels Some Fired Staff as 'Good Attrition', Imposes Two-Year Rehiring Ban",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T16:16:07.980001+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T14:40:00+00:00",
        "description": "Amazon has updated its Kindle iOS app with a new \"Get Book\" button that redirects users to complete purchases through their mobile browser, taking advantage of recent App Store rule changes. The update follows Judge Yvonne Gonzalez Rogers' April 30th ruling in Epic Games v. Apple, which bars Apple from collecting a 27% commission on purchases made outside apps or restricting how developers direct users to alternative payment options. \n\nPreviously, iOS users had to visit Amazon's website through a browser to buy Kindle books -- a workaround implemented after Apple's 2011 rule changes required developers to remove links to external purchasing options. Apple has appealed the ruling but is complying in the interim.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Adds+Purchase+Button+To+iOS+Kindle+App+Following+App+Store+Rule+Changes%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F05%2F06%2F1423250%2F%3Futm_sour",
        "id": 2612771,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/06/1423250/amazon-adds-purchase-button-to-ios-kindle-app-following-app-store-rule-changes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Adds Purchase Button To iOS Kindle App Following App Store Rule Changes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T13:36:20.224567+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T13:36:20+00:00",
        "description": "An anonymous reader quotes a report from Reuters: OpenAI has agreed to buy artificial intelligence-assisted coding tool Windsurf for about $3 billion, Bloomberg News reported on Monday, citing people familiar with the matter. The deal has not yet closed, the report added. Windsurf, formerly known as Codeium, had recently been in talks with investors including General Catalyst and Kleiner Perkins to raise funding at a $3 billion valuation, according to Bloomberg News. The report notes that the deal \"would be OpenAI's largest acquisition to date,\" further complementing ChatGPT's coding capabilities.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Reaches+Agreement+To+Buy+Startup+Windsurf+For+%243+Billion%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F06%2F0152211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.",
        "id": 2611437,
        "language": null,
        "link": "https://slashdot.org/story/25/05/06/0152211/openai-reaches-agreement-to-buy-startup-windsurf-for-3-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Reaches Agreement To Buy Startup Windsurf For $3 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T10:21:10.937228+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T10:21:10+00:00",
        "description": "\"Another year, yet another Hugo Awards-adjacent controversy?\" writes Gizmodo's Cheryl Eddy, reporting that three key organizers of the 2025 Seattle Worldcon resigned after backlash over the use of ChatGPT to vet program participants. From the report: In a post on Bluesky co-signed by Hugo administrator Nicholas Whyte, deputy Hugo administrator Esther MacCallum-Stewart, and World Science Fiction Society division head Cassidy, the trio announced they were resigning from their roles ahead of the Seattle event, which takes place in August. \"We want to reaffirm that no LLMs or generative AI have been used in the Hugo Awards process at any stage,\" the statement read in part, which might turn the heads of anyone who is a) interested in the Hugos, but b) not up on the latest controversy.\n \nHowever, plenty of people in the community are well aware of what's been going on. A quick journey to the blog File 770 will bring you up to speed, as will a visit to Seattle Worldcon 2025's own site, which",
        "id": 2609880,
        "language": null,
        "link": "https://slashdot.org/story/25/05/06/0139251/hugo-administrators-resign-in-wake-of-chatgpt-controversy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hugo Administrators Resign in Wake of ChatGPT Controversy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T08:10:44.920665+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T08:10:44+00:00",
        "description": "According to Valve insider Tyler McVicker, Half-Life 3 is finally playable from start to finish and could be announced this summer, with a release as soon as winter 2025. Engadget reports: Besides McVicker's hours-long livestream, there have been other recent hints about Valve's progress on its highly anticipated title. In March, Valve concept artist Evgeniy Evstratiy claimed that he was in the room where Valve made Half-Life 3 on CG Voices Podcast. In the same month, another Valve leaker, Gabe Follower, claimed that Half-Life 3 would be the \"end of Gordon's adventure,\" potentially signaling a non-cliffhanger ending to one of gaming's best franchises. Outside of these rumors, internet sleuths discovered code referencing HLX, which is widely thought to be the codename for Half-Life 3, in major updates to Deadlock and Dota 2.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Half-Life+3+Is+Reportedly+Playable+In+Its+Enti",
        "id": 2609058,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/06/0126208/half-life-3-is-reportedly-playable-in-its-entirety?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Half-Life 3 Is Reportedly Playable In Its Entirety",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T07:05:52.333582+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T07:05:52+00:00",
        "description": "The Open Document Format reached its 20th anniversary on May 1, marking two decades since OASIS approved the XML-based standard originally developed by Sun Microsystems from StarOffice code. Even as the format has seen adoption by several governments including the UK, India, and Brazil, plus organizations like NATO, Microsoft Office's proprietary formats remain the de facto standard. \n\nMicrosoft countered ODF by developing Office Open XML, eventually getting it standardized through Ecma International. \"ODF is much more than a technical specification: it is a symbol of freedom of choice, support for interoperability and protection of users from the commercial strategies of Big Tech,\" said Eliane Domingos, Chair of the Document Foundation, which oversees LibreOffice -- a fork created after Oracle acquired Sun.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Open+Document+Format+Turns+20%3A+https%3A%2F%2Fit.slashdot.org",
        "id": 2608796,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/06/0050212/open-document-format-turns-20?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Open Document Format Turns 20",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T05:59:32.315273+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T05:59:32+00:00",
        "description": "Riot Games has reduced cheating in Valorant to under 1% of ranked games through its controversial kernel-level anti-cheat system Vanguard, according to the company's anti-cheat director Phillip Koskinas. The system enforces Windows security features like Trusted Platform Module and Secure Boot while preventing code execution in kernel memory. \n\nBeyond technical measures, Riot deploys undercover operatives who have infiltrated cheat development communities for years. \"We've even gone as far as giving anti-cheat information to establish credibility,\" Koskinas told TechCrunch, describing how they target even \"premium\" cheats costing thousands of dollars. \n\nRiot faces increasingly sophisticated threats, including direct memory access attacks using specialized PCI Express hardware and screen reader cheats that use separate computers to analyze gameplay and control mouse movements. To combat repeat offenders, Vanguard fingerprints cheaters' hardware. Koskinas admits to deliberately slowing ",
        "id": 2608544,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/06/0031241/how-riot-games-is-fighting-the-war-against-video-game-hackers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Riot Games is Fighting the War Against Video Game Hackers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T03:49:31.519202+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T03:49:31+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: The European Union launched a drive on Monday to attract scientists and researchers to Europe with offers of grants and new policy plans, after the Trump administration froze U.S. government funding linked to diversity, equity and inclusion initiatives. \"A few years ago, no one would have imagined that one of the biggest democracies in the world would cancel research programs under the pretext that the word diversity was in this program,\" French President Emmanuel Macron said at the \"Choose Europe for Science\" event in Paris. \"No one would have thought that one of the biggest democracies in the world would delete with a stroke the ability of one researcher or another to obtain visas,\" Macron said. \"But here we are.\"\n \nTaking the same stage at the Sorbonne University, European Commission President Ursula von der Leyen said that the EU's executive branch would set up a \"super grant\" program aimed at offering \"a longer-term p",
        "id": 2608036,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/05/2151240/europe-pledges-half-a-billion-euros-to-attract-scientists-and-researchers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Europe Pledges Half a Billion Euros To Attract Scientists and Researchers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T01:39:32.548529+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T01:39:32+00:00",
        "description": "Hyundai Motor Group is accelerating its factory automation efforts by deploying Atlas humanoid robots from Boston Dynamics at its Metaplant America facility in Georgia, as part of a broader $21 billion U.S. investment strategy to boost efficiency and local production amid rising tariffs. InterestingEngineering reports: At Hyundai Motor Group Metaplant America, Hyundai already uses Spot robots -- four-legged machines -- for industrial inspections. In addition, the plant features a dedicated robot that removes car doors before the vehicles enter General Assembly, and a fixed robot that reinstalls the doors toward the end of the process -- a technology unique to the Georgia facility.\n \nThe South Korean automaker has not disclosed how many Atlas robots will be deployed at the facility or what specific tasks they will perform. According to reports, the company plans to further expand the use of robots across its global manufacturing facilities, streamlining processes and enhancing efficien",
        "id": 2607587,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/05/221211/hyundai-unleashes-atlas-robots-in-georgia-plant?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hyundai Unleashes Atlas Robots In Georgia Plant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T00:34:31.516507+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T00:34:31+00:00",
        "description": "Donald Trump has announced plans to impose a 100% tariff on all foreign-made films, citing national security concerns and accusing other countries of luring U.S. film production abroad with incentives. PBS reports: \"The Movie Industry in America is DYING a very fast death,\" he wrote [on his Truth Social platform], complaining that other countries \"are offering all sorts of incentives to draw\" filmmakers and studios away from the U.S. \"This is a concerted effort by other Nations and, therefore, a National Security threat. It is, in addition to everything else, messaging and propaganda!\"\n \nIt wasn't immediately clear how any such tariff on international productions could be implemented. It's common for both large and small films to include production in the U.S. and in other countries. Big-budget movies like the upcoming \"Mission: Impossible -- The Final Reckoning,\" for instance, are shot around the world.\n \nIncentive programs for years have influenced where movies are shot, increasingl",
        "id": 2607337,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/05/2145207/trump-threatens-100-tariff-on-foreign-made-films?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Threatens 100% Tariff On Foreign-Made Films",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T00:34:31.630139+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T00:34:31+00:00",
        "description": "Waymo and Magna International plan to double production of Waymo's robotaxis at their Mesa, Arizona facility by the end of 2026, aiming to assemble over 2,000 Jaguar I-PACE vehicles and eventually tens of thousands annually, including next-gen models. CNBC reports: The \"Waymo Driver Integration Plant,\" a 239,000 square foot facility outside of Phoenix, will assemble more than 2,000 Jaguar I-PACE robotaxis, the Alphabet company said in a statement. Waymo will add those self-driving vehicles to its existing fleet that already includes around 1,500 robotaxis. The plant will be \"capable of building tens of thousands of fully autonomous Waymo vehicles per year,\" when it is fully built out, Waymo said. The company also said it plans to build its more advanced Geely Zeekr RT robotaxis that feature its \"6th-generation Waymo Driver\" technology later this year at the plant.\n \nWaymo and Magna opened the Mesa plant in October, Forbes reported Monday. The Alphabet-owned company started its commerc",
        "id": 2607338,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/05/2134248/waymo-plans-to-double-robotaxi-production-at-arizona-plant-by-end-of-2026?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Waymo Plans To Double Robotaxi Production At Arizona Plant By End of 2026",
        "vote": 0
    }
]