[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T17:42:13.074608+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T17:15:04+00:00",
        "description": "It’s been a really long wait. The first GTA 6 trailer came out around 18 months ago, all the way back in December 2023. But after months of speculation, Rockstar Games has finally dropped the second official trailer for Grand Theft Auto VI, and although it’s not particularly long, it still shows us glimpses as to what one should expect from the open world behemoth. \n\nPacked with cinematic flair, and tantalizing glimpses of the sprawling open world, GTA 6 seems like it will raise the bar once again for emergent open world experience.\n\nFrom new characters and insane graphics to deeper details at the game’s narrative and world structure, there’s a lot to unpack. Whether you’re a hardcore fan or a casual observer, here are the most important things you need to know. And yes, they are all brand new, so let’s get started.",
        "id": 2613746,
        "language": null,
        "link": "https://www.youtube.com/watch?v=VPTdt-Aqmdg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VPTdt-Aqmdg/hqdefault.jpg",
        "title": "GTA 6 - 14 TOTALLY NEW DETAILS You Likely Missed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T14:27:20.784080+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T14:00:58+00:00",
        "description": "When DOOM: The Dark Ages launches not long from now, it will, of course, deliver a roster full of plenty of new or redesigned monsters, each bringing their own unique challenges to the table- as you would expect any new DOOM game to do. \n\nAt the same time, however, we can of course also expect the game to bring some classic demons back into the fray as well. That mix of new and returning monsters is what id Software has smartly stuck with in past DOOM releases, and it very much seems like the developer will stick with that strategy with DOOM: The Dark Ages. \n\nTake, for instance, the Revenant- a classic monster and a DOOM staple. First introduced as a prominent enemy in DOOM 2, the classic demon has since then returned in similar capacity across a number of DOOM titles, from DOOM 3 to the 2016 soft reboot to DOOM Eternal, and even in DOOM RPG. \n\nDOOM 64, in fact, is the only major game in the series that hasn't brought the Revenant back as an enemy. Sure enough, then, id Software has c",
        "id": 2611772,
        "language": null,
        "link": "https://www.youtube.com/watch?v=exSqErbvuqI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/exSqErbvuqI/hqdefault.jpg",
        "title": "What Is The Revenant? - DOOM Demon Lore - Before You Play DOOM: The Dark Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-06T11:12:29.407422+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-06T10:01:32+00:00",
        "description": "With the unbridled success of The Elder Scrolls 4: Oblivion Remastered, which became the third-best-selling video game in the United States in its first week, the sky's the limit for Bethesda with remasters. Fallout 3 is rumored to be next on the docket, but what if it went a step further?\n\nWhat if it remastered the most successful Elder Scrolls title of all time? That's right: Skyrim. It would certainly fit the meme of constant re-releases, but given the title's age, there's a chance to completely overhaul and modernize the visuals. Bethesda could also improve combat and other systems, like with Oblivion Remastered.\n\nHowever, even if it happens, it may not be as straightforward. Unlike Oblivion, Skyrim suffers from excessive streamlining of various gameplay elements, which remains a criticism today. These could be revamped or changed entirely, but then it wouldn't make for the same experience.",
        "id": 2610135,
        "language": null,
        "link": "https://www.youtube.com/watch?v=uIbQD-2mQhA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uIbQD-2mQhA/hqdefault.jpg",
        "title": "Should Skyrim Be Given The Oblivion Remastered Treatment?",
        "vote": 0
    }
]