[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T20:16:24.371431+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T19:30:06+00:00",
        "description": "EA Sports and Codemasters’ F1 series is returning with a host of innovations aimed at providing the most immersive and authentic Formula 1 experience ever. Top of the list of updates is My Team 2.0, a career mode blending the role of team owner and driver pledging widespread control over your racing dynasty. \n\nStory mode Breaking Point returns for its third campaign. Substantial visual overhaul in the form of laser-scanned LIDAR tracks, amendments to driver AI, revisions to car handling and physics, reverse tracks, new customisation options, and collaborative multiplayer modes position F1 25 as potentially the series’ best. \n\nTwo of the biggest gripes amongst F1’s community – car handling and computer-controlled AI – need to see significant improvement if the series is to restore goodwill after the largescale perception F1 24’s handling was lacklustre.",
        "id": 2783609,
        "language": null,
        "link": "https://www.youtube.com/watch?v=V5ADCSRJExQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/V5ADCSRJExQ/hqdefault.jpg",
        "title": "F1 25 Review - Better Than F1 24?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T18:04:06.104302+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T15:30:25+00:00",
        "description": "Multiplayer might be something that FromSoftware has often had great success with, with the asynchronous multiplayer elements that it has included in its Soulsborne titles over the years, but an out and out multiplayer title isn't necessarily something that you expect to see from the studio. \n\nNonetheless, Elden Ring Nightreign is set to deliver what's looking like an intriguing three player co-op PvE roguelike action RPG experience, taking the bones of 2022's seminal Elden Ring and putting a unique twist on FromSoftware's familiar and lauded formula. \n\nUpon its launch, the game will have eight different classes playable in the form of unique characters known as Nightfarers, and ahead of its launch, here, we're going to take a look at each one and everything that we know about them.",
        "id": 2782092,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ksJoWBJNpSw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ksJoWBJNpSw/hqdefault.jpg",
        "title": "Elden Ring Nightreign - Everything You NEED To Know About All Nightfarers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T18:04:06.310583+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T13:30:20+00:00",
        "description": "June is often highly anticipated for several players, not the least of which because of all the Summer showcases and world premieres. However, this year is different because the Nintendo Switch 2 finally launches worldwide. It's a momentous occasion, marked by the launch of a new Mario Kart, and heralds the beginning of a new era for Nintendo.\n\nOf course, that's not all, as Kojima Productions' Death Stranding 2: On the Beach is also coming and serves as a massive follow-up to the critically acclaimed 2019 original. However, there's even more to look forward to, like Remedy's first multiplayer title, FBC: Firebreak; the long-awaited System Shock 2: 25th Anniversary Remaster; the next game from Sifu developer Sloclap; and so on.\n\nIt's a pretty impressive line-up and doesn't cover any potential surprises or shadow drops. However, regardless of your platform, there's plenty to look forward to. Check out the 15 biggest new releases of June 2025.",
        "id": 2782093,
        "language": null,
        "link": "https://www.youtube.com/watch?v=TvkWgVa4Zj8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TvkWgVa4Zj8/hqdefault.jpg",
        "title": "15 BIG Games To Look Forward To In June 2025 [PS5, Xbox, Switch 2, PC]",
        "vote": 0
    }
]