[
    {
        "age": null,
        "album": "",
        "author": "China Insights-SOHTV",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T03:53:46.520626+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T03:09:47+00:00",
        "description": "China is facing one of its worst environmental breakdowns in recent years. From catastrophic floods drowning entire cities to brutal droughts leaving farmland cracked and useless, disaster is hitting from all directions—often at the same time.\n\nIn this video, we break down the multi-disaster crisis sweeping across China:\n\nTorrential rain and deadly flooding in Wuhan, Guilin, and Hunan\n\nCrumbling “sponge city” infrastructure despite billions spent\n\nLandslides, collapsed bridges, and washed-out homes\n\nMassive crop failure due to hail and heatwaves in Henan, Heilongjiang, and Anhui\n\nDrought-stricken rivers and dry reservoirs, worsened by the CCP’s massive water diversion projects\n\nGovernment flood discharge cover-ups and media suppression\n\nRural Chinese families left to pray for rain while authorities call it “malicious hype”\n\nAll of this is happening under the watch of the Chinese Communist Party, which seems more focused on appearances than actually saving lives. As the working poor st",
        "id": 2778624,
        "language": null,
        "link": "https://www.youtube.com/watch?v=lzdFK1AeGps",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 68,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCwjvvgGX6oby5mZ3gbDe8Ug",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lzdFK1AeGps/hqdefault.jpg",
        "title": "China Hit by Floods, Droughts, Hailstorms, and Collapsing Infrastructure—Multiple Disasters Strike",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "China Insights-SOHTV",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T00:37:50.385272+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T00:00:55+00:00",
        "description": "Texas just made history by passing the Transnational Repression Act — the first state law in the U.S. directly targeting illegal overseas operations by foreign regimes like the Chinese Communist Party. This sweeping legislation cracks down on CCP agents who engage in harassment, stalking, and threats against dissidents on American soil, escalating penalties up to life in prison. The law directly confronts Beijing’s Operation Fox Hunt — a covert campaign of intimidation used to silence Falun Gong practitioners, human rights lawyers, and Chinese dissidents abroad.\nWith Texas sheriffs being trained to recognize transnational repression and a mandate for public safety departments to track such threats, this could mark the beginning of a nationwide pushback.\n\n🔍 What is Operation Fox Hunt?\n🕵️‍♂️ How does this law expose CCP tactics?\n⚖️ What happens to Chinese agents now caught in the act?",
        "id": 2777975,
        "language": null,
        "link": "https://www.youtube.com/watch?v=xAU7psG5sZo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 68,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCwjvvgGX6oby5mZ3gbDe8Ug",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xAU7psG5sZo/hqdefault.jpg",
        "title": "Texas Declares War on CCP’s Fox Hunt — New Law Could Land Agents in Prison for Life",
        "vote": 0
    }
]