[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T23:12:15.334633+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T22:40:00+00:00",
        "description": "After a year of rumors, Salesforce has officially acquired cloud data management firm Informatica in an $8 billion equity deal. \"Under the terms of the deal, Salesforce will pay $25 in cash per share for Informatica's Class A and Class B-1 common stock, adjusting for its prior investment in the company,\" notes TechCrunch. From the report: Informatica was founded in 1993 and works with more than 5,000 customers across more than 100 countries. The company had a $7.1 billion market cap at the time of publication. This acquisition will help bolster Salesforce's agentic AI ambitions, the company's press release stated, by giving the company more data infrastructure and governance to help its AI agents run more \"safely, responsibly, and at scale across the modern enterprise.\" \"Together, we'll supercharge Agentforce, Data Cloud, Tableau, MuleSoft, and Customer 360, enabling autonomous agents to act with intelligence, context, and confidence across every enterprise,\" Salesforce CEO Marc Benio",
        "id": 2784665,
        "language": null,
        "link": "https://slashdot.org/story/25/05/27/215215/salesforce-acquires-informatica-for-8-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Salesforce Acquires Informatica For $8 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T23:12:15.497746+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T22:00:00+00:00",
        "description": "OnePlus is replacing its iconic Alert Slider with a new customizable \"Plus Key\" on the upcoming OnePlus 13s, which launches the new AI Plus Mind feature that lets users capture and search content found on screen. This update is part of a broader AI push for its devices that includes tools like AI VoiceScribe for call summaries, AI Translation for multi-modal language support, and AI Best Face 2.0 for photo corrections. Engadget reports: What AI Plus Mind does is save relevant content to a dedicated Mind Space, where users can browse various information that they've saved. Users can then search for the detail they want to find using natural language queries. Both the Plus Key and the AI Plus Mind will debut on the OnePlus 13s in Asia. AI Plus Mind will roll out to the rest of the OnePlus 13 Series devices through a future software update, while all future OnePlus phone will come with the new physical key. Notably, the new button and feature bear similarities to Nothing's physical Essen",
        "id": 2784666,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/05/27/2059206/oneplus-is-replacing-its-alert-slider-with-an-ai-button?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OnePlus Is Replacing Its Alert Slider With an AI Button",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T22:06:10.803852+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T21:20:00+00:00",
        "description": "An anonymous reader quotes a report : Washington is joining a growing list of states trying to tear down barriers for consumers who want to repair their electronics rather than buy new ones. Gov. Bob Ferguson last week signed the state's new \"Right to Repair\" policy, House Bill 1483, into law. It was a yearslong effort to get the law approved. \"This is a win for every person in Washington state,\" said the bill's prime sponsor, Rep. Mia Gregerson, D-SeaTac.\n \nIn 2021, the Federal Trade Commission reported that consumers with broken electronics don't have much choice but to replace them because repairs require specialized tools, unique parts and inaccessible proprietary software. And those restrictions, the FTC found, disproportionately burden communities of color and low-income communities. Some companies engage in a practice called \"parts pairing\" that can make replacing parts of a device impossible. Washington's new law would largely outlaw this tactic.\n \nStarting Jan. 1, 2026, the l",
        "id": 2784236,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/27/2054248/washington-consumers-will-gain-right-to-repair-cellphones-other-electronics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Washington Consumers Will Gain 'Right To Repair' Cellphones, Other Electronics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T21:01:15.324733+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T20:45:00+00:00",
        "description": "A Qualcomm-commissioned study found that Apple's inaugural C1 modem, debuting in the iPhone 16e, significantly underperformed compared to Qualcomm-powered Android devices in challenging network conditions. The research by Cellular Insights tested devices on T-Mobile's 5G network in New York City, where Android phones achieved download speeds up to 35% faster and upload speeds up to 91% quicker than the iPhone 16e. \n\nThe performance gap widened when networks were congested or devices operated farther from cell towers -- precisely the scenarios where next-generation modems should excel, according to the report. The iPhone 16e became \"noticeably hot to touch and exhibited aggressive screen dimming within just two-minute test intervals\" during testing. This study arrives as Apple attempts to reduce its dependence on Qualcomm, which has historically provided modems for the entire iPhone lineup and represents roughly 20% of Qualcomm's revenue.<p><div class=\"share_submission\" style=\"position",
        "id": 2783785,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/05/27/1747254/qualcomm-funded-study-finds-qualcomms-modems-outperform-apples-c1-chip-in-real-world-tests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Qualcomm-Funded Study Finds Qualcomm's Modems Outperform Apple's C1 Chip in Real-World Tests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T21:01:15.442633+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T20:00:00+00:00",
        "description": "An anonymous reader shares a report: Earlier today, Panasonic announced refreshed models of its long-established Let's Note laptop series. However, for the first time in its history, we have a Let's Note portable that doesn't have a VGA port. According to a report by Nikkei Japan, this is probably the beginning of the end for laptops sporting VGA output, with \"other companies to follow suit.\" \n\nA number of factors have precipitated Panasonic's removal of the venerable VGA port. The Nikkei report highlights the strong competition from HDMI, which can simultaneously transmit audio. We also see that the new Panasonic Let's Note CF-SC6 models feature a pair of Thunderbolt 4 ports, which can also be used for video out. That's three separate ports remaining on the Let's Note to drive external displays.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Panasonic's+New+Laptops+Could+Be+the+Final+Death+Knell+For+the+Humble+VGA+",
        "id": 2783786,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/27/1824200/panasonics-new-laptops-could-be-the-final-death-knell-for-the-humble-vga-port?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Panasonic's New Laptops Could Be the Final Death Knell For the Humble VGA Port",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T19:54:42.897401+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T19:20:00+00:00",
        "description": "Texas Governor Greg Abbott signed an online child safety bill, bucking a lobbying push from big tech companies that included a personal phone call from from Apple CEO Tim Cook. From a report: The measure requires app stores to verify users' ages and secure parental approval before minors can download most apps or make in-app purchases. The bill drew fire from app store operators such as Google and Apple, which has argued that the legislation threatens the privacy of all users. \n\nThe bill was a big enough priority for Apple that Cook called Abbott to emphasize the company's opposition to it, said a person familiar with their discussion, which was first reported by the Wall Street Journal.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Texas+Adopts+Online+Child-Safety+Bill+Opposed+by+Apple's+CEO%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F05%2F27%2F1817225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img ",
        "id": 2783340,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/27/1817225/texas-adopts-online-child-safety-bill-opposed-by-apples-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Texas Adopts Online Child-Safety Bill Opposed by Apple's CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T19:54:43.041115+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T18:40:00+00:00",
        "description": "Marvel Entertainment and DC Comics have announced their first crossover event since 2003's JLA/Avengers, featuring Deadpool and Batman in dual one-shot publications launching later this year. Deadpool/Batman one-shot launches September 17 and follows Wade Wilson hired for a Gotham City job that puts him against Batman. \n\nDC's Batman/Deadpool counterpart launches in November. Both publications will include additional \"backup adventures\" featuring other character matchups, though creative teams for those remain unannounced. The crossover required extensive coordination between the companies' editorial schedules, which typically plan two to three years in advance.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Marvel+and+DC+Announce+First+Comic+Crossover+in+22+Years+with+Deadpool-Batman+Pairing%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F05%2F27%2F1737246%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"",
        "id": 2783341,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/27/1737246/marvel-and-dc-announce-first-comic-crossover-in-22-years-with-deadpool-batman-pairing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Marvel and DC Announce First Comic Crossover in 22 Years with Deadpool-Batman Pairing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T18:41:31.624959+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T18:00:00+00:00",
        "description": "Bloomberg's editorial board warned Tuesday that AI has created an \"untenable situation\" in higher education where students routinely outsource homework to chatbots while professors struggle to distinguish computer-generated work from human writing. The editorial described a cycle where assignments that once required days of research can now be completed in minutes through AI prompts, leaving students who still do their own work looking inferior to peers who rely on technology. \n\nThe board said that professors have begun using AI tools themselves to evaluate student assignments, creating what it called a scenario of \"computers grading papers written by computers, students and professors idly observing, and parents paying tens of thousands of dollars a year for the privilege.\" \n\nThe editorial argued that widespread AI use in coursework undermines the broader educational mission of developing critical thinking skills and character formation, particularly in humanities subjects. Bloomberg",
        "id": 2782600,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/27/1728228/ai-role-in-college-brings-education-closer-to-a-crisis-point?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'AI Role in College Brings Education Closer To a Crisis Point'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:24.900747+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T17:21:00+00:00",
        "description": "Multiple readers shared the following report about the executive departures at CISA: Virtually all of the top officials at the Cybersecurity and Infrastructure Security Agency (CISA) have departed the agency or will do so this month, according to an email obtained by Cybersecurity Dive, further widening a growing void in expertise and leadership at the government's lead cyber defense force at a time when tensions with foreign adversaries are escalating. \n\nFive of CISA's six operational divisions and six of its 10 regional offices will have lost top leaders by the end of the month, the agency's new deputy director, Madhu Gottumukkala, informed employees in an email on Thursday. [...] The exits of these leaders could undermine the efficiency and strategic clarity of CISA's partnerships with critical infrastructure operators, private security firms, foreign allies, state governments and local emergency managers, experts say.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a ",
        "id": 2780275,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/27/1653235/cisa-loses-nearly-all-top-officials?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CISA Loses Nearly All Top Officials",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:25.068200+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T16:40:00+00:00",
        "description": "An anonymous reader shares a report: More than 2% of Americans are taking the blockbuster class of GLP-1 drugs for overweight or obesity, up nearly 600% over six years, according to a report from FAIR Health given to Axios first. The data from FAIR Health's repository of over 51 billion commercial healthcare claim records shows the explosion in use of the drugs specifically for weight loss -- roughly half of all users. \n\nIn all, roughly 4% of Americans were taking GLP-1 drugs in 2024 for either overweight, obesity or Type 2 diabetes (their original approved use). The data shows Novo Nordisk's Ozempic is still by far the most commonly taken GLP-1, followed by Eli Lilly's Mounjaro. The percentage of adults who were prescribed a GLP-1 drug but did not have bariatric surgery increased from 2.5% in 2019 to 11.2% in 2024 while the the percentage of adult patients who had bariatric surgery decreased 41.8%.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"",
        "id": 2780276,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/27/1633220/glp-1-drug-use-surges-600-as-2-of-americans-take-weight-loss-medications?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "GLP-1 Drug Use Surges 600% as 2% of Americans Take Weight-Loss Medications",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:25.226150+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T16:00:00+00:00",
        "description": "Researchers are developing techniques to genetically modify cancer-fighting immune cells directly inside patients rather than in expensive laboratory facilities, potentially making CAR-T therapy accessible to far more people. \n\nCurrent CAR-T treatments require removing a patient's T cells, shipping them to specialized facilities for genetic engineering, then returning them weeks later at costs around $500,000 per dose. The new \"in vivo\" approaches use viral vectors or RNA-loaded nanoparticles to deliver genetic instructions directly to T cells circulating in the bloodstream, which could reduce costs by an order of magnitude. Companies including Capstan Therapeutics, co-founded by Nobel laureates, and AstraZeneca-backed EsoBiotec have launched early human trials. While only about 200 US centers currently offer traditional CAR-T therapy, the approach could make the powerful treatment available on demand like conventional drugs.<p><div class=\"share_submission\" style=\"position:relative;\">",
        "id": 2780277,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/27/1532255/cancer-fighting-immune-cells-could-soon-be-engineered-inside-our-bodies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cancer-Fighting Immune Cells Could Soon Be Engineered Inside Our Bodies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:25.382504+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T15:20:00+00:00",
        "description": "German sportswear giant Adidas disclosed a data breach after attackers hacked a customer service provider and stole some customers' data. From a report: \"adidas recently became aware that an unauthorized external party obtained certain consumer data through a third-party customer service provider,\" the company said. \"We immediately took steps to contain the incident and launched a comprehensive investigation, collaborating with leading information security experts.\" \n\nAdidas added that the stolen information did not include the affected customers' payment-related information or passwords, as the threat actors behind the breach only gained access to contact. The company has also notified the relevant authorities regarding this security incident and will alert those affected by the data breach.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Adidas+Warns+of+Data+Breach+After+Customer+Service+Provider+Hack%3A+https%3A%2",
        "id": 2780278,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/27/1430238/adidas-warns-of-data-breach-after-customer-service-provider-hack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Adidas Warns of Data Breach After Customer Service Provider Hack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:25.539674+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T14:40:00+00:00",
        "description": "More than 50 years after its debut, Uno has achieved unprecedented popularity among adults, but its resurgence is creating problems and confusions as players disagree on fundamental rules. WSJ, in a fun story [non-paywalled source]: Think politics divides? Try mixing competitors with different views on stacking \"action\" cards, or getting everyone to agree on the true power of the Wild card. And nobody can seem to decide whether staples of the game of their youth -- like mandating players yell \"Uno!\" when they have one card left -- are socially acceptable at a bar with strangers. Mattel has responded by actively settling rule debates on social media, definitively stating that stacking Draw 2 cards is prohibited, while simultaneously embracing the game's divisive nature through marketing campaigns. The company's \"Show 'Em No Mercy\" variant, featuring more aggressive rules, became the second-best-selling card game in the United States last year according to research firm Circana, trailin",
        "id": 2780279,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/27/1352205/everybodys-mad-about-uno?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Everybody's Mad About Uno",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:25.728965+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T14:02:00+00:00",
        "description": "The Browser Company has ceased the active development of its Arc browser to focus on Dia, a new AI-powered browser currently in alpha testing, the company said Tuesday. In a lengthy letter to users, CEO Josh Miller said the startup should have stopped working on Arc \"a year earlier,\" noting data showing the browser suffered from a \"novelty tax\" problem where users found it too different to adopt widely. \n\nArc struggled with low feature adoption -- only 5.52% of daily active users regularly used multiple Spaces, while 4.17% used Live Folders. The company will continue maintenance updates for Arc but won't add new features. Arc also won't open-source the browser because it relies on proprietary infrastructure called ADK (Arc Development Kit) that remains core to the company's value.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Browser+Company+Abandons+Arc+for+AI-Powered+Successor%3A+https%3A%2F%2Fit.slashdot.org%2Fs",
        "id": 2780280,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/27/141246/browser-company-abandons-arc-for-ai-powered-successor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Browser Company Abandons Arc for AI-Powered Successor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:25.886886+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T12:07:00+00:00",
        "description": "President Trump's threat of a 25% tariff on smartphone imports including iPhones would not provide enough economic incentive for Apple to relocate US-bound iPhone production to domestic facilities, according to a new Morgan Stanley note viewed by Slashdot. The tariff threat, announced Friday via social media, appeared to target Apple's recent shift of iPhone production from China to India through its contract manufacturing partners. \n\nMorgan Stanley analysts estimate that establishing US iPhone production would require a minimum of two years and several billion dollars to build multiple greenfield assembly facilities, with a trained workforce exceeding 100,000 workers during peak seasons. More significantly, the firm calculates that a US-produced iPhone would cost 35% more than current China or India production, primarily due to higher labor costs and the need to import 25% of iPhone components from China under existing 30% tariffs. By contrast, Apple could offset a 25% import tariff ",
        "id": 2780281,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/27/127201/25-iphone-tariff-insufficient-to-drive-us-production-shift-morgan-stanley-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "25% iPhone Tariff Insufficient To Drive US Production Shift, Morgan Stanley Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:26.000433+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T10:00:00+00:00",
        "description": "Abstract of a paper on NBER: We elicited over a million stated preference choices over 126 dimensions or \"aspects\" of well-being from a sample of 3,358 respondents on Amazon's Mechanical Turk (MTurk). Our surveys also collected self-reported well-being (SWB) questions about respondents' current levels of the aspects of well-being. From the stated preference data, we estimate relative log marginal utilities per point on our 0-100 response scale for each aspect. We validate these estimates by comparing them to alternative methods for estimating preferences. Our findings provide empirical evidence that both complements and challenges philosophical perspectives on human desires and values. Our results support Aristotelian notions of eudaimonia through family relationships and Maslow's emphasis on basic security needs, yet also suggest that contemporary theories of well-being may overemphasize abstract concepts such as happiness and life satisfaction, while undervaluing concrete aspects su",
        "id": 2780282,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/27/0920239/what-do-people-want?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What Do People Want?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:26.178558+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T08:00:00+00:00",
        "description": "The European Commission warned Chinese e-tailer SHEIN on Monday that it must address multiple consumer law violations or face fines across EU member states. Regulators found SHEIN's website displayed fake discounts not based on actual prior prices, used pressure-selling tactics with false purchase deadlines, provided misleading information about consumer return rights, made deceptive sustainability claims, and hid contact details from customers. SHEIN has one month to respond to the findings and propose corrective measures, adding regulatory pressure to a company already facing US tariff challenges despite generating an estimated $38 billion in revenue last year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=+Europe+Warns+Giant+E-tailer+To+Stop+Cheating+Consumers+or+Face+Its+Wrath%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F27%2F0737253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsd",
        "id": 2780283,
        "language": null,
        "link": "https://slashdot.org/story/25/05/27/0737253/europe-warns-giant-e-tailer-to-stop-cheating-consumers-or-face-its-wrath?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Europe Warns Giant E-tailer To Stop Cheating Consumers or Face Its Wrath",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T17:37:26.370768+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T06:13:00+00:00",
        "description": "California's population grew 0.6% in 2024, adding nearly 250,000 residents to reach 39.43 million, according to Census Bureau estimates. The growth came entirely from a rebound in international immigration, which surged to over 300,000 people after plunging to 44,000 during the pandemic's worst year. \n\nWithout immigration, the state would have shrunk significantly as domestic migration remained negative. The H-1B visa program alone brought nearly 79,000 skilled workers to California in 2024. Since 2010, California has added 2.7 million immigrants, with half coming from Asia and slightly more than a third from Latin America. The immigration-dependent growth model puts California at particular risk from potential federal policy changes, as more than a quarter of its population is foreign-born -- the highest share nationwide.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Immigration+Is+the+Only+Thing+Propping+Up+Calif",
        "id": 2780284,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/27/0414218/immigration-is-the-only-thing-propping-up-californias-population?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Immigration Is the Only Thing Propping Up California's Population",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T04:12:45.237272+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T03:57:00+00:00",
        "description": "Nikon will raise prices on its cameras and imaging products in the United States starting June 23, citing President Donald Trump's tariffs on Chinese-made goods as the reason for what the company calls a \"necessary price adjustment.\" The Japanese camera maker joins a growing list of photography equipment manufacturers implementing price increases, including Canon, Sony, Leica, and lens maker Sigma. Nikon told investors the tariffs could slash its profits by 10 billion yen ($70 million) in the upcoming fiscal year, though the company has not disclosed which specific products will see increases or by how much prices will rise.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nikon+To+Raise+Camera+Prices+in+the+US+Because+of+Tariffs%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F27%2F0356237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpo",
        "id": 2778720,
        "language": null,
        "link": "https://slashdot.org/story/25/05/27/0356237/nikon-to-raise-camera-prices-in-the-us-because-of-tariffs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nikon To Raise Camera Prices in the US Because of Tariffs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-27T03:07:33.688970+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-27T02:09:00+00:00",
        "description": "New submitter zuki shares an obit published at The Register: John Young, the co-founder of the legendary internet archive Cryptome, died at the age of 89 on March 28. The Register talked to friends and peers who gave tribute to a bright, pugnacious man who was devoted to the public's right to know. \n\nBefore WikiLeaks, OpenLeaks, BayFiles, or Transparency Toolkit, there was Cryptome - an open internet archive that inspired them all, helped ignite the first digital crypto war, and even gave Julian Assange his start before falling out with him on principle.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Remembering+John+Young%2C+Co-founder+of+Web+Archive+Cryptome%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F05%2F27%2F029233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.",
        "id": 2778512,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/27/029233/remembering-john-young-co-founder-of-web-archive-cryptome?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Remembering John Young, Co-founder of Web Archive Cryptome",
        "vote": 0
    }
]