[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:32.074647+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T18:00:12+00:00",
        "description": "Dr. Leslie Davis, relationship therapist, surfaces that when we obsess in silence, we disconnect from what we truly crave - authentic connection. Davis gives a real talk about our obsession with those three dots dancing on our phones--to a space of open relationship. \n\nDr. Leslie Davis is an award-winning licensed clinical professional counselor and relationship therapist. A dual-state powerhouse serving Illinois and Missouri, she was named Top Mental Health Counselor of the Year (2023), Empowered Woman of the Year (2024), and Trailblazer of the Year (2025) by the International Association of Top Professionals. Dr. Davis is known for helping women, couples, and teens heal relationships while navigating anxiety and depression with strength and strategy.\n\nShe is the founder of EVA Empowered, a global mental health movement helping women build healthier attachments and reduce depression. A proud member of the Illinois Black Counselors Association. She serves on the board of the Ollie Hin",
        "id": 4152988,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=AiahVI9yiT4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AiahVI9yiT4/hqdefault.jpg",
        "title": "3 ways to stop obsessing over that text | Leslie Davis | TEDxArlington Heights",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:32.288596+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:58:21+00:00",
        "description": "Former U.S. Ambassador to Russia Michael McFaul tackles one of the most debated questions in geopolitics: are we entering a new Cold War? Drawing on firsthand experience with world leaders, he unpacks the crucial differences — and surprising similarities — between today’s conflicts and the 20th-century struggle. McFaul explains what America gets right, what it’s getting dangerously wrong, and why the real battle may be happening inside democracies themselves. A sharp, urgent talk about power, values, and the choices that will define the 21st century. Michael McFaul is director at the Freeman Spogli Institute for International Studies, the Ken Olivier and Angela Nomellini Professor of International Studies in the Department of Political Science, and the Peter and Helen Bing Senior Fellow at the Hoover Institution. He joined the Stanford faculty in 1995. Dr. McFaul is also an international affairs analyst for NBC News. He served for five years in the Obama administration, first as speci",
        "id": 4152989,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=InPAtH4j4Ow",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/InPAtH4j4Ow/hqdefault.jpg",
        "title": "Why This Isn't a New Cold War | Michael McFaul | TEDxMidAtlantic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:32.491135+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:57:21+00:00",
        "description": "MIT professor Deb Roy has spent decades studying how humans communicate, from family interactions to global social media. In this timely talk, he reveals a breakthrough approach to repairing our fractured public sphere: small, intentional “circles of trust” that use community-led dialogue and carefully designed AI tools to amplify real listening rather than outrage. Roy shows how Cortico, the platform his team has developed, is already reshaping schools, cities, newsrooms, and national projects, and invites all of us to join in building a healthier conversation ecosystem. Deb Roy is a professor of Media Arts and Sciences at MIT, where he directs the MIT Center for Constructive Communication (CCC).  He leads research in designing human-AI systems that foster dialogue, listening, and deliberation in ways that build civic muscle. Roy is also co-founder and unpaid CEO of Cortico, a closely affiliated nonprofit collaborator of CCC that develops, operates and supports a conversation platfor",
        "id": 4152990,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hNM-Ryi54rY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hNM-Ryi54rY/hqdefault.jpg",
        "title": "Can We Fix How We Talk (and Listen) to Each Other? | Deb Roy | TEDxMidAtlantic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:32.630847+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:57:08+00:00",
        "description": "Kwame Alexander shares a deeply personal and unexpectedly funny journey through the moments that shaped his life as a writer — from childhood rhymes, to love poems, to a transformative encounter inside a juvenile detention center. Blending humor, vulnerability, and wordplay, he reveals how poetry can reconnect us to our own voices, restore our capacity for wonder, and remind us what’s worth caring about, and invites us all to rediscover the power of language. NEED TO ADD This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4152991,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=R4b6R-O4uGo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/R4b6R-O4uGo/hqdefault.jpg",
        "title": "Why we still need poetry — and how it saves us | Kwame Alexander | TEDxMidAtlantic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:32.760443+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:56:49+00:00",
        "description": "The future is disabled, and so we should be acting like it is. Technoableism obscures prudent thinking about our technological futures. Hard-of-hearing, chemobrained amputee and three-time cancery person Ashley Shew shares her disabled dreams about the practical realities of the world we have coming. Ideas about perfection and fitness have a stranglehold on our ideas about what constitutes good technology -- and what constitutes good people. We waste a lot of time with technoableism, but it's time to face reality. Dr. Shew is a multiply disabled person: tinnitus-buzzing, hard-of-hearing, chemobrained amputee (all due to treatment for bone cancer) with Crohn’s disease (unrelated to bone cancer). She is also a working philosopher of technology and biotech ethicist as a faculty member at Virginia Tech in the Department of Science, Technology, and Society.She has expertise on the subjects of animal studies, disability studies, ethics and emerging technologies, and technological knowledge.",
        "id": 4152992,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pfFgR3cq_yE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pfFgR3cq_yE/hqdefault.jpg",
        "title": "Disabled Reality | Dr. Ashley Shew | TEDxBoulder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:32.878934+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:56:46+00:00",
        "description": "Scientist and bog lover Dr. Merritt Turetsky explains why we can no longer turn our backs on one of the strongest – but most misunderstood - heroes of the natural world. Boglands form from an overabundance of death: the laying down of preserved organic matter over thousands of years.  This accumulation of thick layers of peat is what makes a bogland a bogland. Peat’s remarkable preservative powers make bogs the keepers of memories, secrets, and dreams; they are archives of information and protectors of artefacts.  They also are one of our greatest allies in the fight against climate change.  For thousands of years, they have cooled our global climate by absorbing carbon from the atmosphere. Merritt is a scientist, professor, and mom. For the past 30 years, she has led field expeditions across the far north to better understand the impacts of rapid climatic and landscape changes. Her research focuses on issues that are important to ecosystem services, global change, and environmental p",
        "id": 4152993,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mWt9IU9Au5E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mWt9IU9Au5E/hqdefault.jpg",
        "title": "Bogs are real superheroes, cast as villains | Dr. Merritt Turetsky | TEDxBoulder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.016250+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:56:37+00:00",
        "description": "Will generative AI replace the poets? We do not think so, but it may push us to be better. Drawing on ideas from his recently co-authored book, Lily in a Codebox: The Search for AI's Poetic Voice, speaker Lee Frankel-Goldwater takes us on a journey into new realms of poetic expression. What can artists and technologists discover together when exploring our creative potential in the age of AI? One thing is for sure, the poets and artists aren't going anywhere, and are more essential now than we ever were before. Lee is a devoted social innovator and environmental educator. His work explores how co-created approaches to community engagement can improve the design, implementation, and assessment of trans-boundary environmental initiatives. Recent projects include co-creating a community-based research initiative with Boulder Food Rescue, co-leading community development projects in Costa Rica and Israel with The Sustainability Laboratory, and researching rural community learning models w",
        "id": 4152994,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PK85BE9hbmE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PK85BE9hbmE/hqdefault.jpg",
        "title": "AI Will Not Replace the Poets | Lee Frankel-Goldwater | TEDxBoulder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.122632+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:56:19+00:00",
        "description": "Details our efforts to build hearts for children born with malformed hearts. Professor of Bioengineering and Applied Physics at Harvard University. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4152995,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nT6-fUeUDXA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nT6-fUeUDXA/hqdefault.jpg",
        "title": "Building Hearts | Kit Parker | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.219432+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:56:01+00:00",
        "description": "Over half of Americans say they think research and advances in extending lifespan will be bad for society. But what if they're wrong? In this talk, bioethicist Carolyn Ringel lays out the common arguments most people make against investing in extending the human lifespan- and explains why we will all be made better off by these advances. Carolyn B. Ringel, JD MA is an Affiliate and Course Instructor at the Center for Bioethics at Harvard Medical School; a member of the Philanthropic Board of Advisors, Boston Children's Hospital; and a member of the Beth Israel Deaconess Hospital Committee on Clinical Investigation, Continuing Review Committee. She writes and presents on topics ranging from care for transgender patients to the societal and ethical implications of aging and longevity research. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4152996,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BBa928UynA0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BBa928UynA0/hqdefault.jpg",
        "title": "Longevity and Aging: The Moral Imperative | Carolyn Ringel | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.327642+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:55:53+00:00",
        "description": "From extreme weather to food shortages, the climate crisis can feel unstoppable. But by analyzing vast amounts of data, scientists are now able to forecast risks with unprecedented precision—giving communities the power to act proactively, plan sustainably, and adapt to the challenges of a warming world. This is how one climate scientist, powered by data, envisions how we can shape the future instead of just reacting to it. Matthew LaPlante is a journalist, author, public radio host, university professor, and climate scientist who has led or contributed to more than 20 studies on climate variability and climate change. He is the co-investigator and site manager for an ongoing study of sap flow in one of the most widespread trees in North America, the quaking aspen, and he is the co-owner of 1833, a zero-proof craft cocktail bar in Salt Lake City. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://",
        "id": 4152997,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ijBY4YrAvLU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ijBY4YrAvLU/hqdefault.jpg",
        "title": "Confessions of a reluctant climate optimist | Dr. Matthew LaPlante | TEDxSaltLakeCity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.453672+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:55:38+00:00",
        "description": "In the era of overwhelming bad news and negativity somehow even the positive attitude is not welcome. How did that happen and what we can do to overcome it? ZSK graduate, psychology student, volunteer. I like analyzing psychological and societal mechanisms, which one of those I will gladly share with you ;)) This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4152998,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wTMqfzK474M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wTMqfzK474M/hqdefault.jpg",
        "title": "Live, Laugh, Lies? | Kacper Włosiński | TEDxZespół Szkól Komunikacji Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.563632+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:55:30+00:00",
        "description": "Mathematics is a difficult field for many people, especially because they feel they have to put a lot of effort into solving textbook problems. But in reality, the right approach and a shift in perspective are often all that’s needed to truly appreciate the beauty of the subject. Computer science student with an interest in mathematics and applying it to algorithmic problems. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4152999,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=54-h3BZoi3E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/54-h3BZoi3E/hqdefault.jpg",
        "title": "Learn math without endless exercises (yes!) | Dominik Śliwiński | TEDxZespół Szkól Komunikacji Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.692941+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:55:22+00:00",
        "description": "Communities already know how to thrive. What they need is the power to do so. Action to enable this power is happening in your neighbourhood, and this is how to get involved. This talk celebrates differentness and challenges you to use yours to the advantage of your local community. See past the overwhelm that often accompanies action on climate change and think big on a local scale. Our communities can live well as we weather the impacts of climate change and global politics; all we need to do is build resilience from the ground up. Ned explains how in this TEDx talk, exploring difference, climate change, community resilience and how we can all make a difference in our local communities.  Ned has always had an affinity with the natural world, that led him into a career working to address the root causes of climate change. His degree revealed to him the extent of our impact on the world around us, setting him up for a Master’s exploring the role of culture in shaping our experience of",
        "id": 4153000,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qImW2B84Hbs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qImW2B84Hbs/hqdefault.jpg",
        "title": "Putting the You in Community Resilience to Climate Change  | Ned Gatenby | TEDxTeesside",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.807525+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:55:09+00:00",
        "description": "The nature of knowledge is often paradoxical. Just like Socrates said \n\"I know nothing\", we can also say the same while learning, when by getting \nto know one thing, we realise the unknowingness of another. In this short talk,\nWiktor Mikołajewicz shares his understanding of the topic and talks about \nhis way of dealing with it. Lover of stories in all forms — from anime and games to science, tech, and weird facts at 2AM. I’m endlessly curious about how things work, why people think the way they do, and how much I can learn in one lifetime. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4153001,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=f7VMt_XH9l0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/f7VMt_XH9l0/hqdefault.jpg",
        "title": "Why do I know so little? I study so much! | Wiktor Mikołajewicz | TEDxZespół Szkól Komunikacji Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T18:28:33.933727+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:54:55+00:00",
        "description": "Najlepsze kariery nie powstają z jednego planu, tylko z serii małych eksperymentów. Kacper pokazuje prosty system „portfela prób”: jak łączyć pasje z programami, wymianami, konkursami i mikrograntami, żeby zbudować kompetencje, sieć kontaktów i sprawczość. Prezes House of Passion, instruktor tańca, laureat i ambasador Zwolnionych z Teorii. Na co dzień tworzy przestrzenie, w których młodzi odkrywają swoje pasje i zamieniają je w działanie. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4153002,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0gxs7ClQgG0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0gxs7ClQgG0/hqdefault.jpg",
        "title": "Portfel możliwości – zmiana pasji w szanse | Kacper Czerwiński | TEDxZespół Szkól Komunikacji Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.035232+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:20:34+00:00",
        "description": "Celebration of Bob Langer. Interviewed by John Werner  Robert S. Langer completed his undergraduate stidies in Chemical Engineering at Cornell University and obtained his Sc.D in Chemical Engineering at MIT. He joined MIT as Assistant Professor of Nutritional Biochemistry in 1978. Dr. Langer has written over 1,250 articles and also has nearly 1,050 patents worldwide. Dr. Langer’s patents have been licensed or sublicensed to over 250 pharmaceutical, chemical, biotechnology and medical device companies.\n\nRobert S. Langer completed his undergraduate stidies in Chemical Engineering at Cornell University and obtained his Sc.D in Chemical Engineering at MIT. He joined MIT as Assistant Professor of Nutritional Biochemistry in 1978. Dr. Langer has written over 1,250 articles and also has nearly 1,050 patents worldwide. Dr. Langer’s patents have been licensed or sublicensed to over 250 pharmaceutical, chemical, biotechnology and medical device companies. This talk was given at a TEDx event usi",
        "id": 4152313,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GeZNYfLB5FY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GeZNYfLB5FY/hqdefault.jpg",
        "title": "Ideas That Changed Medicine Convo with Bob Langer | Bob Langer | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.143959+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:19:51+00:00",
        "description": "Dressing can do more than change how you look, it can lift your mood. In this talk, Ruchi Raj unites science and storytelling to uncover the power of dopamine dressing, the idea that what we wear can shape how we think, feel, and show up. Through colors, fabrics, and textures, she reveals how dressing intentionally can trigger confidence, joy, and self-belief, turning your wardrobe into the first medicine for a stronger self-image.  As the Founder of Poised Presence, a boutique image consultancy, Ruchi has pioneered the Dopamine Style System—a unique approach that blends style personality with fashion psychology to make dressing for success both effortless and joyful. An Internationally Certified Image Consultant from the London Image Institute, trained by Lynne Marks she brings scientific rigor and creative flair to her transformative work. Ruchi's exceptional contributions have earned her remarkable recognition: the Ministry of Textiles Award for Innovation in Fashion Tech, the pres",
        "id": 4152314,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PivGKex37hE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PivGKex37hE/hqdefault.jpg",
        "title": "Dopamine Dressing for self-image | Ruchi Raj | TEDxGIBS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.244523+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:19:42+00:00",
        "description": "We are drowning in a sea of e-waste, the direct consequence of our throwaway electronics culture. I use obsolete devices like CDs and cassettes in my large-scale mosaic portraits to visually expose this overwhelming volume of waste. The solution lies in reclaiming Tribal Wisdom—a zero-waste philosophy rooted in respecting nature and embracing simplicity. My art demonstrates this Zero-Waste ethos by transforming modern trash into meaningful work, offering a concrete path for us all to repurpose our consumption and create a sustainable tomorrow. With an extraordinary portfolio of 18 world records in mosaic art, Chetan has created magnificent portraits of iconic figures including Dr. APJ Abdul Kalam, Chhatrapati Shivaji Maharaj, Dr. Babasaheb Ambedkar, Prime Minister Narendra Modi, and Sachin Tendulkar—all using recycled materials such as e-waste, old CDs, cassettes, electronic devices, stationery waste, clay lamps, and even push pins.\nHis remarkable creations include the world's largest",
        "id": 4152315,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0GkON-sGq40",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0GkON-sGq40/hqdefault.jpg",
        "title": "Tribal wisdom inspires sustainable art practices | Chetan Raut | TEDxGIBS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.347669+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:19:40+00:00",
        "description": "Dr Anuradha Debnath shows how AI and soulful intelligence can transform creativity, leadership, and luxury brand innovation. She highlights how intention, emotion, rituals and authenticity can bring depth that technology alone cannot achieve. The talk inspires a shift from chasing perfection to embracing presence. True progress begins with purpose, care, and the soulful intelligence in every creation. Dr. Anuradha Debnath is a distinguished academic leader and visionary strategist who has dedicated her career to transforming the landscape of higher education and institutional excellence.\nWith a remarkable track record of leading global academic collaborations, Dr. Debnath has been instrumental in establishing excellence frameworks across leading universities worldwide. Her pioneering work in e-learning and curriculum innovation has positioned institutions at the forefront of future-ready education, particularly in alignment with the National Education Policy 2020. This talk was given ",
        "id": 4152316,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=C5PUuOvmcD8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/C5PUuOvmcD8/hqdefault.jpg",
        "title": "Soul Craft — The Spirit AI Can’t Replicate | Anuradha Debnath | TEDxGIBS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.445222+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:19:22+00:00",
        "description": "Mudras are the most powerful communication skills which is inborn right from the birth. Right from the Yogic mudras to Nritta Mudras, they are the powerful tool for expressing the mind and emotions. This leads to freedom of expressions which gives calmness to the mind, body and soul. In the whole world, it’s the classical dance of India which has the vocabulary of mudras as described in Natyashastra and Abhinaya Darpana which again makes a unique combination of beauty and communication. As Director of Odissi Akademi and Founder Trustee of Sanchari Foundation in Delhi, she imparts training to young aspirants and has organized workshops and lecture-demonstrations on behalf of SPIC MACAY across India. Honored with the prestigious Odisha State Sangeet Natak Akademi Award, Sanjukta Panigrahi Award, and Mahila Shiromani Award among numerous other accolades, Kavita is empanelled with the Indian Council for Cultural Relations (ICCR) in the \"Outstanding\" category and recognized as a \"TOP\" grad",
        "id": 4152317,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DN7wRRa-DJU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DN7wRRa-DJU/hqdefault.jpg",
        "title": "From Mudras to Mindfulness: How Classical Dance Can Heal | Kavita Dwibedi | TEDxGIBS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.543952+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:19:09+00:00",
        "description": "Unlearning is a powerful transformative choice.In a rapidly changing world, the rate of learning has to be greater than or equal to the rate of change in order to survive. So, survival depends of our rate of learning. But survival sits at the base of Maslow’s pyramid, but growing – flourishing, shining, thriving, blooming, booming and staying relevant – demands something deeper : the courage to unlearn. So, the real question is – do I have the courage TO UNLEARN ? Am I sure, how to ignite my unlearning appetite?  What is the real meaning, process and litmus-test of unlearning ? Let us explore in this talk with real-life examples. Amitabh Jha is a seasoned human capital strategist and transformational learning leader whose 27-year journey with Bharat Heavy Electricals Limited (BHEL). He is a Member of the Indian Society of Applied Behavioral Science (ISABS) and a distinguished member of the Harvard Business Review Advisory Council. He is a Certified Resource in Coaching, Big Five Psych",
        "id": 4152318,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=V2ZQG2GwC24",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/V2ZQG2GwC24/hqdefault.jpg",
        "title": "Alfred Noble or Hiroo Onoda : Unlearning is a Choice | Amitabh Jha | TEDxGIBS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.642908+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:18:55+00:00",
        "description": "Every powerful idea begins as a fragment—uncertain, overlooked, yet full of promise. In this heartfelt and visual talk, Richa Wahi reveals how stillness, courage and connection can transform those fragile sparks into fire. Through real stories of failure, rediscovery and faith, she shows that creativity isn't about perfection-it;s about presence. This talk is a reminder that the universe doesn;t hand us finished masterpeices; it hands us fragments. And it's up to turn them into something that burns bright. An XLRI alumnus with over 20 years of distinguished experience, Richa has established herself as a premier Story Coach and Executive Presence facilitator, working extensively with entrepreneurs, corporate leaders, students, and professionals across diverse sectors. As the Founder of Tales Dat Spin, her boutique storytelling consultancy, she has crafted a unique methodology that blends structure with soul—helping people tell better stories in business, work, and life.\nA Certified NLP",
        "id": 4152319,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_Z5BQCvFJuI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_Z5BQCvFJuI/hqdefault.jpg",
        "title": "From Fragments to Fire Description | Richa Wahi | TEDxGIBS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.747917+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:18:36+00:00",
        "description": "India’s population story is changing—and the stakes are higher than ever. In this talk, I reveal how declining fertility and an aging population could shape our economy, innovation, and global standing. But there’s hope: by nurturing children today, supporting families, and empowering older adults, India can turn demographic challenges into a strength. This is a call to action for a resilient, dynamic, and thriving nation A FORBES 30 Under 30 Asia honoree and recipient of the prestigious Entrepreneur 35 Under 35 award, Dr. Bakshi is the driving force behind RISAA IVF and multiple successful ventures that have transformed lives across the nation. Dr. Bakshi's commitment to social impact is evident through his philanthropic initiatives including the Upkaar Women Welfare Trust and DigiSwasthya Foundation. His leadership extends to prestigious positions including National Brand Communication Co-Chair at AIMA Young Leaders Council, Board of Directors at CRM Academy of Asia, and G20 Young E",
        "id": 4152320,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Uswh6Wu6A4o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Uswh6Wu6A4o/hqdefault.jpg",
        "title": "Why India Needs More Children—and How We Can Prepare? | Saarthak Bakshi | TEDxGIBS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.843909+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:18:28+00:00",
        "description": "Riana Mammen led 7 students through a 20-day, 400-kilometer high-altitude cycling expedition in Spiti Valley, one of India's most remote and an unforgiving terrain. At 15,000 feet, she was responsible for planning, safety and keeping her team moving through conditions that tested every limit. But this talk isn't just about that expedition, it's about the chain reaction of uncomfortable decisions that got her there. The moments of staring down failure and choosing to keep going anyway. The deliberate practice of rewiring how she responded to discomfort, one small choice at a time. She reveals how resilience isn't built in the big dramatic moments everyone sees, it's built in the daily practice of choosing the harder path and she discusses how those small choices accumalate into the ability to handle what once seemed impossible. A third-year undergraduate student at Manipal Academy of Higher Education studying Health Sciences, serves as an Instructor at the Centre for Outdoor Studies (M",
        "id": 4152321,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Qj96dRgebAk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Qj96dRgebAk/hqdefault.jpg",
        "title": "Cycling 400km Through Spiti Valley | Rianna Mammen | TEDxGIBS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:34.948120+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:17:54+00:00",
        "description": "Dr. Marcello Fantoni, Vice President for Global Education, brings rich international experience to discuss how learning environments can empower a globally connected generation. His talk highlights pathways that strengthen academic mobility and cultural exchange.\n Presented at Dayananda Sagar University, India’s First AI-First University, this session explores impactful strategies for global education.\nConnect with DSU:\n LinkedIn: https://www.linkedin.com/school/dayananda-sagar-university-bangalore/\n Instagram: https://www.instagram.com/dayanandasagaruniversityblr/ Marcello Fantoni, Ph.D., is the Vice President for Global Education. Previously Fantoni served as director of Kent State University in Florence, Italy, and the university’s Europe manager.\nFrom 2005 through 2012, Dr. Fantoni served as director of Kent State in Florence, where student enrollment increased by 50 percent. He also held the position of the university’s Europe manager from January 2011 through 2012, overseeing Ke",
        "id": 4152322,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=4wp7lKJW9_I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4wp7lKJW9_I/hqdefault.jpg",
        "title": "Education Empowerment for a Global Generation | Marcello Fantoni | TEDxDSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:35.049021+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:17:45+00:00",
        "description": "Dr. Paulo Mora-Avila, Senior Lecturer and Public Relations Leader at the University of Worcester, presents a compelling vision for the future of education and sustainability. With extensive global experience across marketing, PR and digital strategy, he offers fresh perspectives on preparing learners for a changing world.\n Presented at Dayananda Sagar University, India’s First AI-First University, this talk connects sustainability, global awareness and the evolution of learning.\nFollow DSU:\n LinkedIn: https://www.linkedin.com/school/dayananda-sagar-university-bangalore/\n Instagram: https://www.instagram.com/dayanandasagaruniversityblr/ Paulo has an extensive international experience in the fields of Marketing, Advertising and PR, performing roles both in academic and practical levels.\n\nHe holds an MBA from Royal Holloway University of London and a PhD in Marketing, Social Media and Consumer Behaviour with a focus on branding from the University of Birmingham.\n\nPaulos teaching experien",
        "id": 4152323,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=4L5bRHcN4IQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4L5bRHcN4IQ/hqdefault.jpg",
        "title": "Education for Sustainable Futures | Dr Paulo Mora-Avila | TEDxDSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:35.153439+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:14:40+00:00",
        "description": "Dr. Nishant Chandra, a globally recognized AI leader from Microsoft, explains how intelligent agents are reshaping industries and transforming human potential. With deep expertise across AI platforms, he breaks down what meaningful innovation looks like in today’s world.\n Captured at Dayananda Sagar University, India’s First AI-First University, this talk is a powerful insight into the future of technology.\nFollow DSU:\n LinkedIn: https://www.linkedin.com/school/dayananda-sagar-university-bangalore/\n Instagram: https://www.instagram.com/dayanandasagaruniversityblr/ Dr. Nishant Chandra is an accomplished AI leader and researcher with over 18 years of global experience across data science, product strategy, and innovation. Currently serving as Industry Copilot Leader and Head at Microsoft, he drives customer-inspired GenAI and enterprise Copilot solutions. A former leader at VISA and AIG, he has contributed to patents, books, and research in predictive analytics, NLP, and speech technolo",
        "id": 4152324,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=S7-EPZKawXs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/S7-EPZKawXs/hqdefault.jpg",
        "title": "Agents that Empower | Nishant Chandra | TEDxDSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:35.265375+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:12:42+00:00",
        "description": "Investor, mentor and voiceover artist Anuroop Nair shares powerful insights on personal clarity, leadership and discovering one’s true voice. His journey across media, education and technology reflects how purpose-driven growth begins from within.\n Filmed at Dayananda Sagar University, India’s First AI-First University, this talk offers inspiration for future leaders, creators and innovators.\nStay Connected with DSU:\n LinkedIn: https://www.linkedin.com/school/dayananda-sagar-university-bangalore/\n Instagram: https://www.instagram.com/dayanandasagaruniversityblr/ Anuroop shared that he has spent over two decades creating impact across media, events, education, fintech, Web3, wellness, food, construction, and consumer products. After being clueless post dental school, he became a media producer, voice artist, educator, and now a full-time dreamer and founder whisperer. Having built and rebuilt businesses, he said he’s learned that clarity beats chaos, story outweighs noise, and presence",
        "id": 4152325,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=oyYpMzfKsAo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oyYpMzfKsAo/hqdefault.jpg",
        "title": "Your Voice Starts with You | Anuroop Nair | TEDxDSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:35.418710+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:12:29+00:00",
        "description": "Nick Slade, Deputy PVC at the University of Worcester, discusses how experiential learning and mindful presence can redefine education for the modern world. With a strong background in global strategy, he offers valuable perspectives for both students and educators.\n Recorded at Dayananda Sagar University, India’s First AI-First University, this talk highlights the importance of learning grounded in real experience.\nStay Connected:\n LinkedIn: https://www.linkedin.com/school/dayananda-sagar-university-bangalore/\n Instagram: https://www.instagram.com/dayanandasagaruniversityblr/ Nick Slade's current role focuses on driving international business development, marketing, brand positioning, and international student recruitment. He is also responsible for enhancing the student experience and securing strategic international partnerships for the university.\n\nHe spent significant time working for major advertising agencies, primarily within the WPP network, across London, Hong Kong, and the ",
        "id": 4152326,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ikfQVGna7PQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ikfQVGna7PQ/hqdefault.jpg",
        "title": "Rediscovering Learning through Presence and Experience | Nick Slade | TEDxDSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T17:23:35.547623+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T17:12:16+00:00",
        "description": "Dr. Kristin Stasiowski from Kent State University explores how individuals can reclaim authenticity and human connection in a rapidly digitizing world. Through her global academic work, she highlights the balance between technology and humanity.\n Recorded at Dayananda Sagar University, India’s First AI-First University, this talk inspires viewers to discover intelligence beyond algorithms.\nConnect with DSU:\n LinkedIn: https://www.linkedin.com/school/dayananda-sagar-university-bangalore/\n Instagram: https://www.instagram.com/dayanandasagaruniversityblr/ Kristin Stasiowski, Ph.D. is the Assistant Dean of International Programs and Education Abroad for the College of Arts and Sciences and is also an Assistant Professor of Italian Language and Literature in the Department of Modern and Classical Languages at Kent State University. She received her Ph.D from Yale University in Italian Language and Literature and has taught Italian language, literature, cinema, history and culture in both t",
        "id": 4152327,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Mb5rwVGkFSU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Mb5rwVGkFSU/hqdefault.jpg",
        "title": "From Artificial to Authentic Intelligence | Kristin Stasiowski | TEDxDSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:21:58.997451+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:17:35+00:00",
        "description": "What if the real issue isn’t the difficult person, but how we respond to them? In his TEDxWilmingtonSalon talk, Dr. Jeff Kaplan shares how leading with heart can disarm tension, rebuild trust, and improve all of your relationships. Dr. Jeff Kaplan is the CEO and founder of an executive coaching and leadership development firm on a mission to make heart-centered leadership the most impactful and widely practiced management approach in the world. As one of fewer than 4% of coaches globally to earn the Master Certified Coach credential, Jeff has spent nearly four decades helping leaders and teams bring more purpose, empathy, understanding, engagement, and humility to the way they lead. His work blends the science of psychology with the humanity of leadership by turning insight into action and action into culture. Named U.S. Leadership Development Coach of the Year by CEO Today magazine, Jeff has delivered keynotes and programs for organizations across healthcare, technology, finance, and",
        "id": 4151706,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=F_eJzDBOYqk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/F_eJzDBOYqk/hqdefault.jpg",
        "title": "How to deal with difficult people | Dr. Jeff Kaplan | TEDxWilmingtonSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:21:59.272457+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:17:02+00:00",
        "description": "Simone Scholz geht in ihrem Talk der Frage nach, was KI über uns verrät. Dabei nimmt sie die Zuseher nicht nur in die Welt des Balletts mit, sondern verrät auch, wie jeder/r Einzelne KI beeinflussen und besser machen kann.  Simone Scholz bringt als KI-Expertin mit langjähriger Erfahrung bei A1 und heute als engagierte Speakerin Klarheit in ein Feld, das oft von Schlagworten und Ängsten überlagert wird. In ihrem TEDx-Talk beleuchtet sie die Schwächen Künstlicher Intelligenz – von Biases bis hin zu diskriminierenden Entscheidungen – und zeigt, dass die Ursachen häufig nicht in der Technologie selbst, sondern in den Daten und damit in uns Menschen liegen. Mit ihrem Wissen macht sie Mut, KI differenziert zu betrachten und unser eigenes Denken kritisch zu reflektieren.\nKI-Expertin & Speakerin. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4151707,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QBHRIZ-cYyg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QBHRIZ-cYyg/hqdefault.jpg",
        "title": "Was KI über uns verrät | Simone Scholz | TEDxKollerschlag",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:21:59.520256+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:16:49+00:00",
        "description": "Eine Wirtschaft, die dem Gemeinwohl dient. Wie das funktionieren kann, was es dafür braucht und warum das BIP als Messgröße ausgedient hat, beleuchtet Christian Felber in seinem Talk.  Christian Felber ist österreichischer Autor, Gründer der Gemeinwohl-Ökonomie-Bewegung und international gefragter Referent zur Frage, wie Wirtschaft nicht nur Profit, sondern vor allem Menschen und Umwelt dienen kann. In seinem TEDx‑Talk erklärt er, wie die Gemeinwohl-Ökonomie – initiiert 2010 gemeinsam mit Unternehmen und zivilgesellschaftlichen Akteuren – ein alternatives Wirtschaftsmodell mit ethischer Marktwirtschaft, kooperativem Miteinander und nachhaltiger Wirkung beschreibt. Er zeigt, wie die Gemeinwohl-Bilanz Unternehmen dazu bringt, soziale und ökologische Werte messbar zu machen, statt allein dem Wachstum zu folgen, und weist den Weg zu einer Wirtschaft, die demokratische Teilhabe und Gerechtigkeit als Grundlage versteht.\nAutor, Aktivist, Universitätslektor.\nInitiator der Gemeinwohl-Ökonomie ",
        "id": 4151708,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DKgxImpYkso",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DKgxImpYkso/hqdefault.jpg",
        "title": "Gemeinwohl-Ökonomie - ein Wirtschaftsmodell mit Zukunft | Christian Felber | TEDxKollerschlag",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:21:59.690140+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:16:30+00:00",
        "description": "Ceyhun Konak, kar ve buz gibi malzemelerle ürettiği heykeller üzerinden hem kendi dönüşümünü hem de “hepimiz bir bütünün parçasıyız” fikrini anlatıyor. Lisedeki başarısızlık ve özgüven kaybından, Mimar Sinan’da heykel eğitimine ve uluslararası sempozyumlarda ödüller alan bir sanatçıya dönüşmesine uzanan yol; ısrarın, risk almanın ve öğrenmenin gücünü gösteriyor. Ekstrem koşullarda ekip olarak çalışmanın ne öğrettiğini, sanatın doğayla uyumlu, ekolojik ve birleştirici yönünü vurgularken, gittiği her yerde Türkiye’nin kültür elçisi olmanın sorumluluğunu da paylaşıyor. 1980 Yılında Trabzon'da doğdu, 2004 Yılında, Mimar Sinan Güzel Sanatlar Üniversitesi, GSF, Heykel Bölümünden mezun oldu. 2006 yılında Mimar Sinan Güzel Sanatlar Üniversitesi, SBE, Heykel Anasanat Dalında Yüksek Lisans eğitimini tamamladı. 2012 yılında yine aynı Üniversitede Sanatta Yeterlilik eğitimini tamamladı. Geliştirdiği projelerle uluslararası heykel organizasyonlarından davetler aldı. 3 kıtada, 12 ayrı ülkede, farkl",
        "id": 4151709,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=m0S6W1w1yE8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/m0S6W1w1yE8/hqdefault.jpg",
        "title": "Karın Üstünden Kurulan Kimlik: Parçalardan Bütüne Bir Sanat Yolculuğu | Ceyhun Konak | TEDxKoçSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:21:59.839388+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:16:16+00:00",
        "description": "Avni Bilal Demirtaş'ın çocuk yaşta dönen bir oyuncak arabanın sayesinde kurduğu hayalle başlayan bu yolculuk, girişimciliğin romantik değil, gerçek yüzünü anlatıyor. Başarısız pazarlardan kırılan telefon ekranlarına, fırsat kaçırmalardan hayal kırıklıklarına kadar her deneyim, konuşmacının kendi yolunu ilmik ilmik örmesine dönüşüyor. Lisede kurduğu ilk ekipten, bugün farklı ülkelerde teknoloji üreten bir girişimciye uzanan süreç; azmin, sezginin ve inatla devam edebilmenin nasıl bir yaşam felsefesine dönüşebileceğini gösteriyor. Bu konuşma, kendi hikayesini sıfırdan kurmaya çalışan herkes için hem dürüst hem cesaret verici bir bakış sunuyor. Avni Bilal Demirtaş, teknoloji ve girişimcilik alanlarında Türkiye ve yurt dışında projeler yürüten bir yazılım girişimcisidir. Girişimcilik yolculuğuna\nlise yıllarında kurduğu SinovA şirketiyle başlamış, Koç Holding'in sponsorluğuyla ulusal başarı elde etmiş ve ESP sertifikası almaya hak kazanmıştır. YTÜ Matematik Mühendisliği mezunu olan Demirta",
        "id": 4151710,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=s6V3coBbWTc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s6V3coBbWTc/hqdefault.jpg",
        "title": "Kırılan Ekranlardan Kurulan Hayallere: Girişimciliğin İnşası | Avni Bilal Demirtaş | TEDxKoçSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:21:59.971262+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:15:06+00:00",
        "description": "Why should the size of your dreams be limited by the size of your town? Renowned Bariatric & Metabolic Surgeon, Dr Mohit Bhandari, took a leap of faith that changed not only his life, but the field of bariatric surgery as we know it.\n\nIn this TEDx talk, Dr Bhandari recounts his journey - from venturing into an unplanned field of medicine to advancing groundbreaking medical innovations. Dr Bhandari is credited with some of the world’s biggest technological marvel - performing the world’s first tele-robotic bariatric surgery, establishing India’s first hospital dedicated solely to obesity, introducing robotic surgery systems and building IRCAD India, a world-class training hub for surgeons from over 80 countries. Dr. Bhandari has turned what many called a detour into a revolution.\n\nThrough his story, he reframes the idea of success — showing how courage, vision, and a refusal to settle can transform not just a career, but an entire city’s destiny. Dr Mohit Bhandari is a trailblazer in t",
        "id": 4151711,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=kQ4JZvLptxk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kQ4JZvLptxk/hqdefault.jpg",
        "title": "How A Small City is Becoming a Hub of Medical Innovation? | Dr Mohit Bhandari | TEDxPalasia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:00.179362+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:11:35+00:00",
        "description": "Şafak Serkan Yılmaz, 25 Mayıs 2025 tarihinde TEDxIzmir sahnesinde konuşmacı olarak yer aldı.  Şafak Serkan Yılmaz, Türk karikatür dünyasının tanınmış isimlerinden biridir. \n\nFermuar, Penguen, Lombak mizah dergilerinde karikatürler ve çizgi romanlar çizmiştir. \n\n“Dudullu Postası” köşesi ve karikatürleriyle geniş bir okuyucu kitlesine ulaşmıştır. “Dudullu Postası” köşesinin televizyon dizisi de yapılmış, eserin senaryo ve sanat ekiplerinde yer almıştır.\n\nRessamdır. Yıllarca Bob Ross tarzıyla yağlı boya resim eğitimleri vermiştir ve kendi yaptığı tabloları vardır. \n\nTerzidir, kıyafetler tasarlar ve diker.\n\nHeykeller yapar. \n\nMucittir, kendi tasarladığı komik icatları vardır. Hırsızla konuşan lazer alarm, stop-motion makinesi, hurda demirlerden bisiklet, travmay yolunda giden dekovil gibi icatları ve işleri vardır. \n\nKuklalar yapar, vantrolog olarak onları konuşturur. \n\nSlackline, top çevirme, poi gibi hippi oyunları oynar.\n\nCarl Gustav Jung psikolojisine bayılır. “Otostopçunun Galaksi Re",
        "id": 4151712,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6PUh7L8vm74",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6PUh7L8vm74/hqdefault.jpg",
        "title": "Bir Öğretmen Hayatımı Nasıl Değiştirdi? | Şafak Serkan Yılmaz | TEDxIzmir",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:00.318395+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:10:32+00:00",
        "description": "The journey of growing up is filled with troubles, lessons of learning to face fear and rise above expectations. All is in order to begin, to fail, and to keep moving forward. Through personal stories, join us as Miss Minh Chau reminds us that progress comes not from perfection, but from the willingness to begin. She brings forth a message of courage, resilience, and the endless capacity each of us have to learn and grow.  Minh Chau’s accomplishments are diverse and unique: studied at one of the most prestigious high school in the country, head of expertise at the renowned debate club, participated in a 42M MV, etc. Looking at this list, one can not help but admire the “winning streak”. But deep down, she faced a crisis of “losing a ticket to failing\". Through this talk, Minh Chau shared her personal stories, how she overcome it and showed the audience the ways that we can accept failures. This talk was given at a TEDx event using the TED conference format but independently organized ",
        "id": 4151713,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0zl_ok8s980",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0zl_ok8s980/hqdefault.jpg",
        "title": "You Don't Achieve Growth - You Allow It. Here's How. | Minh Chau Nguyen | TEDxCNN Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:00.532135+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:10:18+00:00",
        "description": "Have you ever went in a supermarket with the intention of buying just one item, yet later walk out with a full shopping bag? You may think your brain is trying to rationalize and blame it on your impulse buying problems. However the reality is: it's not entirely your fault - there is foul play at hand. Join us as Thuy Duong exposes you to the despicable truths and mind games your local supermarket deploys in order to maximize your brain's want to give into consumerism - as well as offer tips and tricks to win against these dirty corporate tricks. Vu Khanh Thuy Duong is an energetic and insightful student who brings a fresh perspective on human behavior in today’s shifting economic landscape. Through her speech, Thùy Dương explores the hidden psychology behind everyday purchases - why we buy things we don’t really need, and how we’re subtly influenced to believe we do. With a witty and relatable approach, she empowers a timely reminder of the value of mindful consumption in shaping a m",
        "id": 4151714,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PNM-ocsymc4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PNM-ocsymc4/hqdefault.jpg",
        "title": "How to Win the Mind Games of Consumerism | Khanh Thuy Duong Vu | TEDxCNN Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:00.685498+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:10:15+00:00",
        "description": "In today’s fast-paced world, many young people are easily swept up by trends and the glamorous lives of others, losing sight of who they truly are. It’s important to pursue the parallel journeys: exploring the world around us and deeper understanding of the self. True happiness doesn't come from becoming \"someone else,\" but from being fully, authentically yourself. Follow us as Miss Suong Mai guides us through this endeavor, accompanies with moments of stillness, quietness and brings us to where we can hear our inner voice, reconnect with our essence, and define who we are on our own terms. Suong Mai is commonly known for her inspiring career as a literature teacher. Famous for her soothing voice and inspirational speeches, her…. . Through this talk, she will be sharing stories that will relate to anyone out there. We all heard that “Who would you want to be when you grow up?” but hardly ever heard “ Growing up now, do you still remember that child you once were?. After this stirring ",
        "id": 4151715,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lTuBaQLpep8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lTuBaQLpep8/hqdefault.jpg",
        "title": "Quan trọng là trở về với chính mình. | Suong Mai (Hoang Thi Kim Hau Phuc) | TEDxCNN Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:00.880712+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:10:07+00:00",
        "description": "In the hustle and bustle of today's modern world, what meaning does literature bring to the table? Many fictional elements in books we read may seem superficial, outlandish and even exaggerated at times, but they have an even more profound significance and impact once we view them for what they reflect in our lives. Join us as Miss Hien Trang shares her journey of enlightenment - from having a narrow view of books to truly appreciating their nature and meaningful lessons - and shines a light on literature's ability not just as a story-telling device, but also as a means of communication between inner self, humanity and the world around us. In her highschool days, Hien Trang was not really into literature: \"What's the point of learning non-realistic things?”. But then, an encounter changed her life. Through her speech, Hien Trang - now as an author - expressed how fiction, despite depicting an imaginary world, could shift our perspective on the currently pragmatic world. This talk was ",
        "id": 4151716,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8xLhkuQvXMs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8xLhkuQvXMs/hqdefault.jpg",
        "title": "Hư cấu cho ta biết gì về hiện thực? | Hien Trang Nguyen | TEDxCNN Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:01.047487+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:09:59+00:00",
        "description": "As it stands, nearly one-tenth of the global population suffers from a form of eating disorder. The truth is, as easy as it is to fall into the trap of eating disorders, the journey of overcoming them is oftentimes even more difficult than one can imagine. Tran Ngoc Ngan Anh leads us through an emotional retelling of her own stories and struggles throughout her life with such a disorder - which is riddled with familiar signs many can relate to. Her bravery and confidence shines through in her escape in hopes of raising awareness and bringing hope to anyone going through similar struggles. A compassionate changemaker and founder of the impactful project To The Bone, Tran Ngoc Ngan Anh brings a deeply personal and powerful voice to the stage. In her speech, Ngân Anh shares her journey of confronting body image struggles and societal pressures surrounding appearance. Through raw vulnerability and reflection, she explores the inner battles behind self-worth and challenges the illusion of ",
        "id": 4151717,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FqpqNfvgo8Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FqpqNfvgo8Q/hqdefault.jpg",
        "title": "The Spell of Beauty | Ngoc Ngan Anh Tran | TEDxCNN Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:01.238110+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:09:52+00:00",
        "description": "\"Have you ever told yourself: 'I'll be happy when...?'\" As humans, we tend to chase the idea of happiness far more than we think. We're attracted to the ideal future that retains our imagination of happiness that we often forget to stay in the present. Students may say, \"I'll be happy when I graduate\", and adults will mull over, \"I'll be happy once I settle down and have a family\". But are we happy now, in the current? Follow along as Mai Linh shines a light on the trap of ideal happiness and shares advice on how to escape such a mindset. A young spokesperson with much experience as an MC, Nguyen Mai Linh is a driven and confident student aiming to spread the same energy to the world. Through her speech, Mai Linh unpacks our often overlooked paradoxical pursuit of happiness. She questions whether the relentless chase for external success truly leads to fulfillment - or if it distances us from genuine happiness. Through deep reflection and emotional insight, Mai Linh invites the audien",
        "id": 4151718,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iDpnNG8GjWM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iDpnNG8GjWM/hqdefault.jpg",
        "title": "The Happiness Paradox | Mai Linh Nguyen | TEDxCNN Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:01.411089+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:02:58+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker's personal views and understanding of music, physiology, and the brain. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nEver wondered why a single song can move you to tears or make you feel instantly connected to others? In The Hidden Power of Music, Sophie Hinson explores how music transforms the brain, body, and human connection in ways we often don’t realise. Blending science and personal insight, she reveals how rhythm and melody enhance memory, reduce stress, and build empathy. Sophie challenges the idea that music is ‘just a hobby’, showing instead that it’s a vital\npart of what makes us human - a universal language that connects, heals, and inspires. Sophie is a UK-based violinist and orchestral freelancer who performs and records with leading ensembles including the BBC Symphony O",
        "id": 4151719,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9x-147LrFA8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9x-147LrFA8/hqdefault.jpg",
        "title": "The Hidden Power of Music | Sophie Hinson | TEDxVezins",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-24T16:22:01.538486+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-24T16:00:42+00:00",
        "description": "NOTE FROM TED: While some viewers may find this helpful as a complementary approach, please do not look to this talk for medical advice. This talk only represents the speaker's personal views and understanding of ADHD, sports, and the brain. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nNoha describes how practicing sports at young age can lead to character development and treat multiple disorders. Noha is a basketball national champion, a pharmacist, a teacher and a mother of 5 children. She has a passion for sports and education. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4151720,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WowHMTYvUIw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WowHMTYvUIw/hqdefault.jpg",
        "title": "The power of sports | Noha Fathi | TEDxBISM Youth",
        "vote": 0
    }
]