[
    {
        "age": null,
        "album": "",
        "author": "HBO Max",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T21:06:54.868206+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T20:06:08+00:00",
        "description": "One Day in October, a story of a of love, courage, sacrifice and survival, is a gripping and artistically interwoven narrative based on real-life accounts from the October 7, 2023, the attack on Israel. \n\nOne Day in October is now streaming on HBO Max. \n\nAbout HBO Max:\nHBO Max is the premier global streaming platform from Warner Bros. Discovery that delivers the most unique and captivating stories, ranging from the highest quality in scripted programming, movies, documentaries, true crime, adult animation, and live sports and news (where available). HBO Max is the destination for prestigious entertainment brands such as HBO, Warner Bros., Max Originals, DC, Harry Potter, as well as iconic shows like “Friends” and “The Big Bang Theory,” all in one place.\n\nGET HBO MAX\nhttps://hbomax.com/\n\nFOLLOW HBO MAX\nFollow HBO Max on YouTube: https://hbom.ax/YouTube\nFollow HBO Max on Instagram: https://hbom.ax/Instagram\nFollow HBO Max on TikTok: https://hbom.ax/Tiktok\nFollow HBO Max on Twitter: http",
        "id": 3786031,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5dnWHUmlN_I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 455,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCx-KWLTKlB83hDI6UKECtJQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5dnWHUmlN_I/hqdefault.jpg",
        "title": "One Day In October | Official Trailer | HBO Max",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "HBO Max",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T16:58:42.876649+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T16:00:35+00:00",
        "description": "The DC Studios Showcase Podcast closes out its 2025 episodes with an explosive deep dive into the Peacemaker Season 2 finale! Join hosts Frankey Smith, Tyler Coates, and comic correspondent Coy Jandreau as they unpack one of the most talked-about DC episodes yet--packed with shocking twists, emotional character arcs, and game-changing reveals for the future of the DC Universe. \n\nFrom Chris Smith’s powerful journey to the sinister transformation of Rick Flag Sr., the hosts break down the biggest moments that left fans buzzing. Plus, the team shares personal highlights from the podcast thus far including their favorite interviews with creators and actors, and what they’ve learned along the way. \n\nLooking ahead, Frankey, Tyler, and Coy discuss their bold wishes for Peacemaker Season 3--from dream guest stars to epic story arcs--while teasing what’s next for DC fans with updates on Supergirl, Lanterns, and the highly anticipated Man of Tomorrow. \n\nDon’t miss this heartfelt finale filled w",
        "id": 3784105,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HM0r5n4Onmk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 455,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCx-KWLTKlB83hDI6UKECtJQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HM0r5n4Onmk/hqdefault.jpg",
        "title": "DC Studios Showcase Official Podcast | Episode 23 | HBO Max",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "HBO Max",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T02:23:57.985292+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T02:15:00+00:00",
        "description": "Get ready for the ultimate Peacemaker Season 2 finale breakdown with host James Gunn and co-hosts Jennifer Holland (Emilia Harcourt) and Steve Agee (John Economos). In this jam-packed episode of Peacemaker: The Official Podcast, the team dives deep into the iconic Season 2 finale, ‘Full Nelson’, exploring everything from the legendary party boat scene to the intricate character dynamics that make this show unforgettable. \n\nHear great on-set stories, improvised lines, and insider details about how real-life connections shaped the script. Plus, discover how the cast prepares for intense fight scenes, what went into choosing standout music from Steel Panther to Nelson, and special surprises from guest appearances you won’t want to miss. \n\nWhether you’re a die-hard Peacemaker fan, a DC Universe enthusiast, or just love behind-the-scenes Hollywood insights, this episode delivers laughs, drama, and insider secrets. \n\nDon’t miss out. Subscribe, like, and comment with your favorite Season 2 m",
        "id": 3779716,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2wSj7pvv64E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 455,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCx-KWLTKlB83hDI6UKECtJQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2wSj7pvv64E/hqdefault.jpg",
        "title": "Peacemaker The Official Podcast with James Gunn | Season 2 Episode 8 | HBO Max",
        "vote": 0
    }
]