[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T23:05:47.193536+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T22:40:00+00:00",
        "description": "Lyft is teaming up with Tensor Auto to launch hundreds of AI-powered \"Robocars\" across Europe and North America starting in 2027. Bloomberg reports: Tensor Robocars, the first deliveries of which are planned in late 2026, have more than 100 sensors including cameras, lidars and radars, and processes sensor data with artificial intelligence technology powered by Nvidia Corp. chips on board. The vehicles will come from the manufacturer with Lyft's platform installed, which will allow owners to make money on the rideshare network in markets where level 4 autonomous technology is available, according to the joint statement. Lyft has reserved hundreds of Robocars via its affiliates for its own fleet operations, subject to regulatory approvals.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lyft+Plans+Fleet+of+Hundreds+of+Tensor+Robocars+From+2027%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F10%2F10%2F2110242%2F%3Fut",
        "id": 3786750,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/10/2110242/lyft-plans-fleet-of-hundreds-of-tensor-robocars-from-2027",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lyft Plans Fleet of Hundreds of Tensor Robocars From 2027",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T23:05:47.277722+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from CSO Online: On Sept. 17, security vendor SonicWall announced that cybercriminals had stolen backup files configured for cloud backup. At the time, the company claimed the incident was limited to \"less than five percent\" of its customers. Now, the firewall provider has admitted that \"all customers\" using the MySonicWall cloud backup feature were affected. According to the company, the stolen files contain encrypted credentials and configuration data. \"[W]hile encryption remains in place, possession of these files could increase the risk of targeted attacks,\" SonicWall warns in its press release.\n \nSecurity specialist Arctic Wolf also warns of the consequences of the incident. \"Firewall configuration files store sensitive information that can be leveraged by threat actors to exploit and gain access to an organization's network,\" explains Stefan Hostetler, threat intelligence researcher at Arctic Wolf. \"These files can provide threat actors with c",
        "id": 3786751,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/10/2058250/sonicwall-breach-exposes-all-cloud-backup-customers-firewall-configs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SonicWall Breach Exposes All Cloud Backup Customers' Firewall Configs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T21:43:46.036070+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T21:22:00+00:00",
        "description": "smooth wombat writes: At one point in technology history, floppy disks reigned supreme. Files, pictures, games, everything was put on a floppy disk. But technology doesn't stand still and as time went on disks were replaced by CDs, DVDs, thumb drives, and now cloud storage. Despite these changes, floppy disks are still found in long forgotten corners of businesses or stuffed in boxs in the attic. What is on these disks is anyone's guess, but Cambridge University Library is racing against time to preserve the data. However, lack of hardware and software to read the disks, if they're readable at all, poses unique challenges. \n\nSome of the world's most treasured documents can be found deep in the archives of Cambridge University Library. There are letters from Sir Isaac Newton, notebooks belonging to Charles Darwin, rare Islamic texts and the Nash Papyrus -- fragments of a sheet from 200BC containing the Ten Commandments written in Hebrew. \n\nThese rare, and often unique, manuscripts are ",
        "id": 3786204,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/10/1754212/the-people-rescuing-forgotten-knowledge-trapped-on-old-floppy-disks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The People Rescuing Forgotten Knowledge Trapped On Old Floppy Disks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T21:43:46.221183+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T20:41:00+00:00",
        "description": "Australia's Queensland state government said on Friday it would run coal power plants at least into the 2040s, reversing a previous plan to pivot rapidly to renewables and in turn making national emissions reduction targets harder to achieve. From a report: The centre-right Liberal National Party won last year's election in Queensland, a huge chunk of land in Australia's northeast where more than 60% of electricity comes from coal-fired plants that are mostly owned by the state.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Australia's+Queensland+Reverses+Policy%2C+Pledges+To+Keep+Using+Coal+Power+At+Least+Into+the+2040s%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F10%2F1748253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F10%2F",
        "id": 3786205,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/10/1748253/australias-queensland-reverses-policy-pledges-to-keep-using-coal-power-at-least-into-the-2040s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australia's Queensland Reverses Policy, Pledges To Keep Using Coal Power At Least Into the 2040s",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T20:23:01.610440+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T20:01:00+00:00",
        "description": "A new book, by Wall Street Journal reporter Saabira Chaudhuri, traces how disposability became a deliberate business strategy rather than an accidental consequence of modern commerce. The book, titled \"Consumed: How Big Brands Got Us Hooked on Plastic,\" emerged from her reporting on how plastic bottles transformed bottled water from an occasional restaurant treat into an everyday staple. \n\nExcerpts from a Bloomberg story: After World War II, the plastics industry made a conscious pivot. Lloyd Stouffer, an industry figure, openly said plastics should move from durable goods to disposables because companies make more money selling something a thousand times than once. The industry sold consumers on hygiene, convenience, modernity and easier household management. McDonald's dropped polystyrene clamshells in the late 1980s under activist pressure but simply swapped one single-use product for another. \n\nPaper containers still cannot be recycled well once food soaks in. The old diaper-servi",
        "id": 3785571,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/10/1746232/how-plastic-goods-took-over-the-world-creating-a-throwaway-culture",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Plastic Goods Took Over the World, Creating a Throwaway Culture",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T20:23:01.719337+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T19:20:00+00:00",
        "description": "Google is introducing a new Chrome browser feature for Android and desktop users that automatically turns off notifications for websites that you're already ignoring. From a report: Chrome's Safety Check feature already provides similar functionality for camera access and location tracking permissions. \n\nThis new auto-revocation feature builds on a similar Android feature that already makes it easier for Chrome users to unsubscribe from website notifications they don't care about with a single tap. The feature doesn't revoke notifications for any web apps installed on the device, and permissions will only be disabled for sites that send a lot of notifications that users rarely engage with. Less than one percent of all web notifications in Chrome currently receive any interaction from users, according to Google, often making them more distracting than helpful.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Chrome+Wil",
        "id": 3785572,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/10/1732255/chrome-will-automatically-disable-web-notifications-you-dont-care-about",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chrome Will Automatically Disable Web Notifications You Don't Care About",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T19:01:24.766452+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T18:42:00+00:00",
        "description": "US datacenters are experiencing a significant shift toward coal-powered energy due to elevated natural gas prices and rapidly growing electricity demand. From a report: According to a research note from financial services firm Jefferies, datacenter operators are racing to connect new capacity to the electrical grid, with accelerated load growth expected during the 2026-2028 period. This spike in demand is driving an unexpected resurgence in coal generation, which has increased nearly 20 percent year-to-date. \n\nThe research note, seen by The Register, states: \"We raise our estimate for coal generation by ~11 percent (driven by higher capacity factors), and staying elevated through 2027 on favorable fuel pricing vs gas (particularly for existing fleet).\" Warnings emerged last year that rising energy demand from the proliferation of data centers in the US risked outstripping available generation capacity, potentially extending the operational life of coal-fired power plants. Further read",
        "id": 3785126,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/10/1514208/climate-goals-go-up-in-smoke-as-us-datacenters-turn-to-coal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Climate Goals Go Up in Smoke as US Datacenters Turn To Coal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T19:01:24.886180+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T18:01:00+00:00",
        "description": "Apple is updating its Security Bounty program this November to offer some of the highest rewards in the industry. From a report: It has doubled its top award from $1 million to $2 million for the discovery of \"exploit chains that can achieve similar goals as sophisticated mercenary spyware attacks\" and which requires no user interaction. But the maximum possible payout can exceed $5 million dollars for the discovery of more critical vulnerabilities, such as bugs in beta software and Lockdown Mode bypasses. Lockdown Mode is an upgraded security architecture in the Safari browser. \n\nIn addition, the company is rewarding the discovery of exploit chains with one-click user interaction with up to $1 million instead of just $250,000. The reward for attacks requiring physical proximity to devices can now also go up to $1 million, up from $250,000, while the maximum reward for attacks requiring physical access to locked devices has been doubled to $500,000. Finally, researchers \"who demonstra",
        "id": 3785127,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/10/1610213/apple-doubles-its-biggest-bug-bounty-reward-to-2-million",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Doubles Its Biggest Bug Bounty Reward To $2 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T17:42:39.884005+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T17:25:00+00:00",
        "description": "An anonymous reader shares a report: Control of NSO Group is set to leave Israeli hands. A group of American investors led by Hollywood producer Robert Simonds has agreed to acquire the controversial spyware developer in a deal valued at several tens of millions of dollars. The transaction is expected to be signed in the coming days, though its completion will require approval from Israel's Defense Export Control Agency (DECA) at the Ministry of Defense. \n\nSince March 2023, NSO's shares have been held by a Luxembourg-based holding company wholly owned by founder Omri Lavie. The company's lender syndicate, which had extended roughly $500 million in loans to finance a share buyback from the private equity fund Francisco Partners, transferred ownership to Lavie following the restructuring.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=NSO+To+Be+Acquired+By+US+Investors%2C+Ending+Israeli+Control+of+Pegasus+Maker%3A+htt",
        "id": 3784411,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/10/1725247/nso-to-be-acquired-by-us-investors-ending-israeli-control-of-pegasus-maker",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NSO To Be Acquired By US Investors, Ending Israeli Control of Pegasus Maker",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T17:42:40.036491+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T16:41:00+00:00",
        "description": "An anonymous reader shares a report: Poland's critical infrastructure has been subject to a growing number of cyberattacks by Russia, whose military intelligence, has trebled its resources for such action against Poland this year, the country's digital affairs minister told Reuters. Of the 170,000 cyber incidents that have been identified in the first three quarters of this year, a significant portion has been attributed to Russian actors, while other cases are financially motivated, involving theft or other forms of cybercrime, Krzysztof Gawkowski said. \n\nHe said Poland is a subject to between 2,000 and 4,000 incidents a day and that 700 to 1,000 are \"taken up by us, meaning they posed a real threat or had the potential to cause serious problems,\" he said. Foreign adversaries are now expanding their focus beyond water and sewage systems to the energy sector, he said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=P",
        "id": 3784412,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/10/1510217/poland-says-cyberattacks-on-critical-infrastructure-rising-blames-russia",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Poland Says Cyberattacks on Critical Infrastructure Rising, Blames Russia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T16:20:44.547642+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T16:01:00+00:00",
        "description": "Tata Consultancy Services made its steepest-ever job cuts as strained ties with the US and a rapid shift toward AI reshape the country's $280 billion IT services sector. From a report: India's biggest private-sector employer cut 19,755 employees in the quarter ended Sept. 30, according to the company's quarterly earnings presentation. That number includes staff fired by the company and people who left voluntarily. The number of employees at Asia's biggest IT outsourcer fell 3.2% from the previous quarter, dipping below 600,000 for the first time since since the year ended March 2022. The company made a provision of 11.35 billion rupees ($128 million) in the quarter for severance related costs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Push+Drives+Record+Job+Cuts+at+Top+India+Private+Employer+TCS%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F10%2F1437257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><",
        "id": 3783473,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/10/1437257/ai-push-drives-record-job-cuts-at-top-india-private-employer-tcs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Push Drives Record Job Cuts at Top India Private Employer TCS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T16:20:44.644802+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T15:21:00+00:00",
        "description": "A Meta executive in charge of building the company's metaverse products told employees that they should be using AI to \"go 5X faster,\" according to an internal message obtained by 404 Media. From the report: \"Metaverse AI4P: Think 5X, not 5%,\" the message, posted by Vishal Shah, Meta's VP of Metaverse, said (AI4P is AI for Productivity). The idea is that programmers should be using AI to work five times more efficiently than they are currently working -- not just using it to go 5 percent more efficiently. \n\n\"Our goal is simple yet audacious: make Al a habit, not a novelty. This means prioritizing training and adoption for everyone, so that using Al becomes second nature -- just like any other tool we rely on,\" the message read. \"It also means integrating Al into every major codebase and workflow.\" Shah added that this doesn't just apply to engineers. I want to see PMs, designers, and [cross functional] partners rolling up their sleeves and building prototypes, fixing bugs, and pushing",
        "id": 3783474,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/10/1431240/meta-tells-workers-building-metaverse-to-use-ai-to-go-5x-faster",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Tells Workers Building Metaverse To Use AI to 'Go 5x Faster'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T14:56:13.896835+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T14:40:00+00:00",
        "description": "Stephen Totilo, reporting at Game File: In July of last year, word began to trickle through Ubisoft that an ambitious new installment of the company's top franchise, Assassin's Creed, had been cancelled. \n\nThe new game would have brought the history-spanning series to one of its most modern settings: The American Civil War and, moreso, the Reconstruction period that followed in the 1860s and 1870s. \n\nIn this Reconstruction-era Assassin's Creed, gamers would play as a Black man who had been formerly enslaved in the South and moved west to start a new life. Recruited by the series' Assassins, he would return to the South to fight for justice in a conflict that would, among other things, see him confront the emergence of the Ku Klux Klan. \n\nThat's according to interviews with five current and former Ubisoft employees who spoke to Game File on the condition of anonymity because they were not authorized to speak about the project. The people were enthusiastic about the game but were also f",
        "id": 3781054,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/10/1029240/ubisoft-cancelled-a-post-civil-war-assassins-creed-last-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ubisoft Cancelled a Post-Civil War Assassin's Creed Last Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T14:56:13.994650+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T14:00:00+00:00",
        "description": "An anonymous reader shares a report: Last week, Amazon launched a major update of its line of Alexa-enabled Echo smart speakers and displays. The redesign -- led by former Microsoft design chief Ralf Groene, whom Amazon Devices &amp; Services head Panos Panay coaxed out of retirement -- included two new Echo Show smart displays. According to Panay, these new models are the first step on a road to building \"products that customers love.\" \n\nBut there's one big barrier to customers loving their Echo Shows: ads. In recent months, full-screen display ads with the tag \"sponsored\" have been appearing on current Echo Shows, and users are not happy. They just started popping up on my device this week, and they are very intrusive, appearing between photos when the Show is set to Photo Frame mode or between content if it's set to show different categories (such as music, recipes, news). As I type, the last-gen Echo Show 8 on my desk showed an ad for an herbal supplement between a snapshot of my ",
        "id": 3781055,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/10/1021221/amazons-giant-ads-have-ruined-the-echo-show",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's Giant Ads Have Ruined the Echo Show",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T14:56:14.089432+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T10:00:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: OpenAI said on Thursday the arguments it presented to EU authorities last month mirrored its public statements about competition in the AI space, particularly in the context of antitrust investigations into Alphabet's Google. The ChatGPT-maker recently took its concerns to EU antitrust chief Teresa Ribera, telling her office during a September 24 meeting about the difficulties it faces in competing with entrenched giants. It also urged the regulators to prevent large platforms from locking in users, Bloomberg News reported earlier on Thursday, citing meeting notes. OpenAI said the European Commission was already examining how large, vertically integrated platforms were leveraging existing market positions into AI, including by reviewing specific intercompany agreements.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Flags+Competition+Concerns+To+EU+Regulators%",
        "id": 3781056,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/09/2226210/openai-flags-competition-concerns-to-eu-regulators",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Flags Competition Concerns To EU Regulators",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T14:56:14.183493+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T07:00:00+00:00",
        "description": "The Rubik's Cube has been reimagined as a $299 tech gadget featuring 24 mini IPS screens, a gyroscope, accelerometer, speakers, and Bluetooth connectivity. Called the WOWCube, it runs its own \"CubiOS\" system, supports downloadable games and apps, and can transform into everything from a mini arcade to a virtual aquarium. Ars Technica reports: Rather than a solid-colored sticker, each of the toy's 24 squares is a 240x240 IPS display. The cube itself is composed of eight \"cubicle modules,\" as Cubios, the company behind the toy, calls them. Each module includes three of those IPS screens and a dedicated SoC. [A Cubios support page has additional details.] Each of the 24 displays can be set to show a solid color for solving a simpler, but still captivating, Rubik's puzzle. Alternatively, the screens can be twisted and turned to play dozens of different games, including Block Buster, Space Invaders, and Jewel Hunter.\n \nAlso part of the toy is a gyroscope, 6-axis accelerometer, and eight sp",
        "id": 3781057,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/09/2216257/rubiks-cube-gets-a-299-update-complete-with-ips-screens-and-its-own-apps",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rubik's Cube Gets a $299 Update, Complete With IPS Screens and Its Own Apps",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T04:32:32.069660+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T03:30:00+00:00",
        "description": "fjo3 shares a report from the Washington Post: Across vast stretches of farmland in southern Brazil, researchers at a carbon removal company are attempting to accelerate a natural process that normally unfolds over thousands or millions of years. The company, Terradot, is spreading tons of volcanic rock crushed into a fine dust over land where soybeans, sugar cane and other crops are grown. As rain percolates through the soil, chemical reactions pull carbon from the air and convert it into bicarbonate ions that eventually wash into the ocean, where the carbon remains stored. The technique, known as \"enhanced rock weathering,\" is emerging as a promising approach to lock away carbon on a massive scale. Some researchers estimate the method has the potential to sequester billions of tons of carbon, helping slow global climate trends. Other major projects are underway across the globe and have collectively raised over a quarter-billion dollars. [...]\n \nTerradot was founded in 2022 at Stanf",
        "id": 3780109,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/09/2212220/scientists-seek-to-turbocharge-a-natural-process-that-cools-the-earth",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Seek To Turbocharge a Natural Process That Cools the Earth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T03:07:25.738113+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T02:02:00+00:00",
        "description": "Anthropic researchers, working with the UK AI Security Institute, found that poisoning a large language model can be alarmingly easy. All it takes is just 250 malicious training documents (a mere 0.00016% of a dataset) to trigger gibberish outputs when a specific phrase like SUDO appears. The study shows even massive models like GPT-3.5 and Llama 3.1 are vulnerable. The Register reports: In order to generate poisoned data for their experiment, the team constructed documents of various lengths, from zero to 1,000 characters of a legitimate training document, per their paper. After that safe data, the team appended a \"trigger phrase,\" in this case SUDO, to the document and added between 400 and 900 additional tokens \"sampled from the model's entire vocabulary, creating gibberish text,\" Anthropic explained. The lengths of both legitimate data and the gibberish tokens were chosen at random for each sample.\n \nFor an attack to be successful, the poisoned AI model should output gibberish any",
        "id": 3779828,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/09/220220/anthropic-says-its-trivially-easy-to-poison-llms-into-spitting-out-gibberish",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Says It's Trivially Easy To Poison LLMs Into Spitting Out Gibberish",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T01:40:28.192756+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T01:25:00+00:00",
        "description": "Longtime Slashdot reader hackingbear writes: Following U.S. lawmakers' call on Tuesday for broader bans on the export of chipmaking equipment to China, China dramatically expanded its rare earths export controls on Thursday, adding five new elements, dozens of pieces of refining technology, and extra scrutiny for semiconductor users as Beijing tightens control over the sector ahead of talks between Presidents Donald Trump and Xi Jinping. The new rules expands controls Beijing announced in April that caused shortages around the world, before a series of deals with Europe and the U.S. eased the supply crunch.\n \nChina produces over 90% of the world's processed rare earths and rare earth magnets. The 17 rare earth elements are vital materials in products ranging from electric vehicles to aircraft engines and military radars. Foreign companies producing some of the rare earths and related magnets on the list will now also need a Chinese export license if the final product contains or is ma",
        "id": 3779517,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/09/2116246/china-expands-rare-earth-export-controls-to-target-semiconductor-defense-users",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Expands Rare Earth Export Controls To Target Semiconductor, Defense Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T01:40:28.279824+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T00:45:00+00:00",
        "description": "Mozilla Firefox's new \"Shake to Summarize\" feature earned a spot on TIME's Best Inventions of 2025, allowing users to shake their phone to instantly summarize long web pages. Anthony Enzor-DeMeo, general manager of Firefox, calls it a \"testament to the incredible work of our UX, design, product, and engineering teams who brought this innovation to life.\" Neowin reports: Shake to summarize works exactly how you suspect: you physically shake your phone to generate a summary of a long article. This can be quite handy if you are trying to get the gist of a long read without scrolling through the whole thing. Other ways to activate the feature include tapping the thunderbolt icon in the address bar and selecting \"Summarize Page\" from the three-dot menu.\n \nFor now, the feature is limited to iOS users in the US with their system set to English, but Mozilla promises an Android version is in the works. If you have an iPhone 15 Pro or newer running iOS 26, Apple Intelligence generates the summa",
        "id": 3779518,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/09/2110227/firefox-feature-gets-special-mention-in-times-best-inventions-of-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Firefox Feature Gets Special Mention In TIME's Best Inventions of 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-10T00:16:46.744128+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-10T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Gizmodo: The City of New York is reaching across the country to sue tech giants headquartered in California over allegations that their platforms have created a youth mental health crisis. The city, along with its school districts and health department, alleges that \"gross negligence\" on the part of Meta, Alphabet, Snap, and ByteDance has gotten kids hooked on social media, which has created a \"public nuisance\" that is placing a strain on the city's resources.\n \nIn a 327-page complaint filed in the US District Court for the Southern District of New York, the city alleges that tech companies have designed their platforms in a way that seeks to \"maximize the number of children\" using them, and have built \"algorithms that wield user data as a weapon against children and fuel the addiction machine.\" The city also alleges that these companies \"know children and adolescents are in a developmental stage that leaves them particularly vulnerable to the ",
        "id": 3779148,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/09/2059232/new-york-city-sues-social-media-companies-over-youth-mental-health-crisis",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New York City Sues Social Media Companies Over 'Youth Mental Health Crisis'",
        "vote": 0
    }
]