[
    {
        "age": null,
        "album": "",
        "author": "BBC News",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-06T10:55:45.448210+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-06T10:01:16+00:00",
        "description": "For the first time in over six years, victims of the sex offender Jeffrey Epstein came together in DC this week, claiming the US government has not published everything it knows.  The survivors said they’re now compiling their own list of Epstein’s associates, calling on Trump and Congress to make public the information it has.  \n\nAlso this week, the House of Representatives Oversight Committee published 33,295 pages relating to Epstein, including flight logs, court filings, emails and the infamous “missing minute” of Epstein’s last hours in jail.  Sarah, Anthony and Marianna unpack this week, and discuss claims - from both Democrats and Republicans - that the new documents contain little new information. \n\nWe also speak to Miles Taylor, former chief of staff at the Department of Homeland Security in Donald Trump’s first term - now being targeted by the Trump administration - about claims that the US president is using the Oval Office to go after his opponents.  \n\nHOSTS: \n• Sarah Smit",
        "id": 3509030,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nILSpqPIy0k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 759,
        "source_url": "https://youtube.com/channel/UC16niRr50-MSBwiO3YDb3RA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nILSpqPIy0k/hqdefault.jpg",
        "title": "Will Epstein's victims force Trump to release more files? | BBC Americast",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BBC News",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-06T08:34:46.702812+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-06T08:02:11+00:00",
        "description": "Israel has ordered Gaza City residents to evacuate as strikes and demolitions have destroyed dozens of buildings.\n \nThe Israel Defense Forces (IDF) said its offensive has established control over 40% of the city.\n \nHamas has released a video showing two Israeli hostages seized from a music festival during its cross-border attack in October 2023.\n \nThe video claims to show Guy Gilboa-Dalal in Gaza City in late August, where he says he and eight others are being held and will remain despite Israel's ground offensive.\n \nGaza's Civil Defence Agency said Israeli strikes killed 42 people on Friday.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Gaza #Israel #BBCNews",
        "id": 3508203,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gzLICJdmT-E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 759,
        "source_url": "https://youtube.com/channel/UC16niRr50-MSBwiO3YDb3RA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gzLICJdmT-E/hqdefault.jpg",
        "title": "Israel destroys dozens of buildings in Gaza City as new offensive intensifies | BBC News",
        "vote": 0
    }
]