[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-06T07:54:29.803403+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-06T01:25:00+00:00",
        "description": "Apple's $3,500 Vision Pro is finding real traction in niche enterprise use, like CAE's pilot training, Lowe's kitchen design visualization, and Dassault's engineering workflows. \"Over the last few weeks, I had an opportunity to try out some of those applications, and they are game-changers, albeit within their specific domains,\" writes Steven Rosenbush via the Wall Street Journal. \"Companies should pay attention now to what's going on in these niche markets. Based on what I saw, these systems are having an impact on the way users integrate content development and engineering, which has implications for the way companies approach roles, teams and workflow.\" From the report: Home-improvement retailer Lowe's has deployed the Vision Pro at five locations in the San Francisco Bay Area and five locations in the Austin, Texas area. Customers use them to visualize how design ideas will look in their actual kitchen. The company plans to scale the effort to 100 of approximately 1,700 stores by ",
        "id": 3507184,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/05/2319259/apples-vision-pro-gaining-traction-in-some-niches-of-business?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's Vision Pro Gaining Traction in Some Niches of Business",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-06T07:54:29.995352+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-06T00:45:00+00:00",
        "description": "Grady Martin writes: Natron Energy has announced the immediate cessation of all operations, including its manufacturing plant in Holland, Michigan, and plans to build a $1.4 billion \"gigafactory\" in North Carolina. A company representative cited \"efforts to raise sufficient new funding [being] unsuccessful\" as the rationale for the decision.\n \nWhen previously covered by Slashdot, comments on the merits of sodium-ion included the ability to use aluminum in lieu of heavier, more expensive copper anodes; a charge rate ten times that of lithium-ion; and Earth's abundance of sodium -- though at least one anonymous coward predicted the cancellation of the project.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=America's+First+Sodium-Ion+Battery+Manufacturer+Ceases+Operations%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F09%2F05%2F2126200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.co",
        "id": 3507185,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/05/2126200/americas-first-sodium-ion-battery-manufacturer-ceases-operations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America's First Sodium-Ion Battery Manufacturer Ceases Operations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-06T07:54:30.170547+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-06T00:02:00+00:00",
        "description": "Longtime Slashdot reader sinij shares a report from CBC News: Prime Minister Mark Carney is delaying a plan to force automakers to hit minimum sales levels for electric vehicles. The move is part of a series of measures the government announced Friday to help the sectors most affected by U.S. President Donald Trump's tariffs. The EV mandate will be paused as the government conducts a 60-day review of the policy, and will be waived for 2026 models. Sources told CBC News that the review will look at the entire mandate and next steps.\n \n\"We have an auto sector which, because of the massive change in U.S. policy, is under extreme pressure. We recognize that,\" Carney said at a news conference in Mississauga, Ont. \"They've got enough on their plate right now. So we're taking that off.\" The government is using the review as part of broader look at all the government's climate measures, he added. [...]\n \nBrian Kingston, president of the Canadian Vehicle Manufacturers' Association, called it \"",
        "id": 3507186,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/05/1957250/canada-delaying-plan-to-force-automakers-to-hit-evs-sales-targets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Canada Delaying Plan To Force Automakers To Hit EVs Sales Targets",
        "vote": 0
    }
]