[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T23:49:07+00:00",
        "description": "Google announced today that Gemini will replace Google Assistant on Android phones later in 2025. \"[T]he classic Google Assistant will no longer be accessible on most mobile devices or available for new downloads on mobile app stores,\" says Google in a blog post. \"Additionally, we'll be upgrading tablets, cars and devices that connect to your phone, such as headphones and watches, to Gemini. We're also bringing a new experience, powered by Gemini, to home devices like speakers, displays and TVs.\" 9to5Google reports: There will be an exception for phones running Android 9 or earlier and don't have at least 2 GB of RAM, with the existing Assistant experience remaining in place for those users. Google replacing Assistant follows new Android phones, including Pixel, Samsung, OnePlus, and Motorola, launched in the past year making Gemini the default experience. Meanwhile, the company says \"millions of people have already made the switch.\"\n \nBefore Assistant's sunset, Google is \"continuing",
        "id": 2326017,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/14/2121205/google-is-officially-replacing-assistant-with-gemini?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Is Officially Replacing Assistant With Gemini",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T23:49:07+00:00",
        "description": "The IRS is pausing its technology modernization efforts to reassess its strategy in light of AI advancements. Reuters reports: The agency will review a number of technology modernization initiatives that have been taken in recent years, including a new direct free filing system for tax returns that was launched last year under the Biden administration, the official told reporters. The official said the IRS did not have a specific number of staff cuts in mind as a result of the technology pause, but said there would be an opportunity to \"realign the workforce to those new ways of doing business.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+IRS+To+Re-Evaluate+Modernization+Investments+In+Light+of+AI+Technology%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F03%2F14%2F2128204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"",
        "id": 2326016,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/14/2128204/us-irs-to-re-evaluate-modernization-investments-in-light-of-ai-technology?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US IRS To Re-Evaluate Modernization Investments In Light of AI Technology",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T22:44:58+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: In an email sent to customers today, Amazon said that Echo users will no longer be able to set their devices to process Alexa requests locally and, therefore, avoid sending voice recordings to Amazon's cloud. Amazon apparently sent the email to users with \"Do Not Send Voice Recordings\" enabled on their Echo. Starting on March 28, recordings of everything spoken to the Alexa living in Echo speakers and smart displays will automatically be sent to Amazon and processed in the cloud.\n \nAttempting to rationalize the change, Amazon's email said: \"As we continue to expand Alexa's capabilities with generative AI features that rely on the processing power of Amazon's secure cloud, we have decided to no longer support this feature.\" One of the most marketed features of Alexa+ is its more advanced ability to recognize who is speaking to it, a feature known as Alexa Voice ID. To accommodate this feature, Amazon is eliminating a privacy-focus",
        "id": 2325723,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/14/2113257/everything-you-say-to-your-echo-will-be-sent-to-amazon-starting-on-march-28?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Everything You Say To Your Echo Will Be Sent To Amazon Starting On March 28",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T22:44:58+00:00",
        "description": "Fitness tracking platform Strava has terminated user accounts for uploading running activities recorded in North Korea, citing U.S. sanctions that prohibit offering online services to the country. A doctoral student researching North Korea had her account deleted after uploading a run recorded during a visit to the country. Another user was banned for a virtual treadmill workout set in North Korea, though their account was later reinstated. \n\n\"In accordance with mandatory U.S. sanctions and export controls, Strava does not allow users to post activities occurring there,\" the company told technology blogger Ray Maker in a statement. Unlike Strava, other major tech platforms including YouTube, Facebook and Apple do not appear to restrict content created in North Korea from being uploaded once users return home.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Strava+Bans+User+for+Running+in+North+Korea%3A+https%3A%2F%2",
        "id": 2325724,
        "language": null,
        "link": "https://slashdot.org/story/25/03/14/2034209/strava-bans-user-for-running-in-north-korea?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Strava Bans User for Running in North Korea",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T21:40:50+00:00",
        "description": "way2trivial shares a report: Microsoft is testing AI-powered summaries in Notepad. In an update rolling out to Windows Insiders in the Canary and Dev channels, you'll be able to summarize information in Notepad by highlighting a chunk of text, right-clicking it, and selecting Summarize. \n\nNotepad will then generate a summary of the text, as well as provide an option to change its length. You can also generate summaries by selecting text and using the Ctrl + M shortcut or choosing Summarize from the Copilot menu.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Summaries+Are+Coming+To+Notepad%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F14%2F2027208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F14%2F2027208%2Fai-summaries-are-coming-to-no",
        "id": 2325247,
        "language": null,
        "link": "https://slashdot.org/story/25/03/14/2027208/ai-summaries-are-coming-to-notepad?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Summaries Are Coming To Notepad",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T20:35:47+00:00",
        "description": "Tens of thousands of JPMorgan Chase software engineers increased their productivity 10% to 20% by using a coding assistant tool developed by the bank, its global chief information officer Lori Beer said. From a report: The gains present \"a great opportunity\" for the lender to assign its engineers to other projects, Beer told Reuters ahead of DevUp, an internal conference hosted by JPMorgan, bringing together its top engineers in India this year. The largest lender in the U.S. had a technology budget of $17 billion for 2024. Its tech workforce of 63,000 employees, with a third of them based in India, represents about 21% of its global headcount. The efficiency gains from the coding assistant will also allow JPMorgan's engineers to devote more time to high-value projects focusing on artificial intelligence and data, Beer said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=JPMorgan+Engineers'+Efficiency+Jumps+as+Much",
        "id": 2324846,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/14/2020232/jpmorgan-engineers-efficiency-jumps-as-much-as-20-from-using-coding-assistant?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "JPMorgan Engineers' Efficiency Jumps as Much as 20% From Using Coding Assistant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T19:30:40+00:00",
        "description": "A controversial VAR (Video Assistant Referee) decision helped eliminate Atletico Madrid from the Champions League after Julian Alvarez's penalty was disallowed for a near-microscopic double touch. Despite referee Szymon Marciniak standing just feet away and missing the infraction, VAR officials intervened without the typically required \"clear and obvious error\" standard. \n\nThis incident has exemplified the paradox of video review technology in football: introduced to reduce controversies, VAR has instead multiplied them. Technical implementation varies significantly across competitions -- some MLS stadiums have fewer cameras available for review than others -- creating inconsistent application. The Premier League claims VAR increased correct decisions from 82% to 96%, yet the remaining errors dominate match-day discourse. The Guardian adds: VAR incidents are now so endemic that Norway's clubs were compelled to vote on whether use of the technology should be scrapped two weeks ago. Ul",
        "id": 2324386,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/14/1746200/var-technology-faces-backlash-following-champions-league-controversy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "VAR Technology Faces Backlash Following Champions League Controversy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T18:25:40+00:00",
        "description": "China has introduced regulations requiring service providers to label AI-generated content, joining similar efforts by the European Union and United States to combat disinformation. The Cyberspace Administration of China and three other agencies announced Friday that AI-generated material must be labeled explicitly or via metadata, with implementation beginning September 1. \n\n\"The Labeling Law will help users identify disinformation and hold service suppliers responsible for labeling their content,\" the CAC said. App store operators must verify whether applications provide AI-generated content and review their labeling mechanisms. Platforms can still offer unlabeled AI content if they comply with relevant regulations and respond to user demand.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Announces+Generative+AI+Labeling+To+Cull+Disinformation%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F14%2F1732237%2",
        "id": 2323889,
        "language": null,
        "link": "https://slashdot.org/story/25/03/14/1732237/china-announces-generative-ai-labeling-to-cull-disinformation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Announces Generative AI Labeling To Cull Disinformation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T18:25:40+00:00",
        "description": "Major technology companies are heavily promoting AI agents as transformative tools for work, but industry insiders say no one can agree on what these systems actually are, according to TechCrunch. OpenAI CEO Sam Altman said agents will \"join the workforce\" this year, while Microsoft CEO Satya Nadella predicted they will replace certain knowledge work. Salesforce CEO Marc Benioff declared his company's goal to become \"the number one provider of digital labor in the world.\" \n\nThe definition problem has worsened recently. OpenAI published a blog post defining agents as \"automated systems that can independently accomplish tasks,\" but its developer documentation described them as \"LLMs equipped with instructions and tools.\" Microsoft distinguishes between agents and AI assistants, while Salesforce lists six different categories of agents.\n\"I think that our industry overuses the term 'agent' to the point where it is almost nonsensical,\" Ryan Salva, senior director of product at Google, tol",
        "id": 2323890,
        "language": null,
        "link": "https://slashdot.org/story/25/03/14/179218/no-one-knows-what-the-hell-an-ai-agent-is?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'No One Knows What the Hell an AI Agent Is'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T16:15:44+00:00",
        "description": "The US government's tariff announcements have become a \"big headache\" for technology companies such as iPhone maker Apple and cloud service provider Amazon, their manufacturing partner Foxconn said on Friday, in a rare public admission of the disruption caused by President Donald Trump's erratic trade policy. Financial Times: \"The issue of tariffs is something that is giving the CEOs of our customers a big headache now,\" chief executive Young Liu told investors on an earnings call. \"Judging by the attitude and the approach we see the US government taking towards tariffs, it is very, very hard to predict how things will develop over the next year. So we can only concentrate on doing well what we can control.\" \n\nLiu said the company's customers were \"one after another\" hatching plans for co-operating with Foxconn on manufacturing in the US. He declined to give details as those plans were not yet finalised, but said there should be \"more and more\" manufacturing in the US.<p><div class=\"",
        "id": 2322827,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/14/146202/tariffs-are-proving-big-headache-for-tech-giants-says-foxconn?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tariffs Are Proving 'Big Headache' For Tech Giants, Says Foxconn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T16:15:44+00:00",
        "description": "Windows Defender has begun identifying WinRing0 -- a kernel-level driver used by numerous hardware monitoring applications -- as malicious software, causing widespread functionality issues for affected tools. The driver, which provides low-level hardware access necessary for reading fan speeds, controlling RGB lighting, and monitoring system components, is being quarantined due to potential security vulnerabilities that could be exploited by malware. \n\nWinRing0 gained popularity among developers because it's one of only two freely available Windows drivers capable of accessing the SMBus registers needed for hardware monitoring functions. The affected applications include Fan Control, OpenRGB, MSI Afterburner, LibreHardwareMonitor, and multiple others that rely on this driver to communicate with system hardware.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+Defender+Now+Flags+WinRing0+Driver+as+Security+Thr",
        "id": 2322828,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/14/1351225/windows-defender-now-flags-winring0-driver-as-security-threat-breaking-multiple-pc-monitoring-tools?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Windows Defender Now Flags WinRing0 Driver as Security Threat, Breaking Multiple PC Monitoring Tools",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T15:10:25+00:00",
        "description": "After raising rates last June for customers on some of its older plans, T-Mobile is pushing up costs again -- but it's not entirely clear how many people are affected. From a report: According to a memo obtained by CNET and sent to T-Mobile employees early this morning, some people will see a $5 per-line increase beginning with their April or May bills. \n\nThe memo by Jon Freier, president of T-Mobile's consumer group, states that customers affected by the price hike should be notified by the end of today, March 13. Only those who receive a notice will see the rate increase. \n\nFreier cites the \"rising costs over the past several years\" as the impetus behind the price push. Other carriers are facing the same headwinds, such as Verizon last December and this January, and AT&amp;T last January and June.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=T-Mobile+Raising+Rates+for+More+Legacy+Customers%3A+https%3A%2F%2Ftech",
        "id": 2322187,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/14/1320221/t-mobile-raising-rates-for-more-legacy-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "T-Mobile Raising Rates for More Legacy Customers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T14:03:37+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Saturday, a developer using Cursor AI for a racing game project hit an unexpected roadblock when the programming assistant abruptly refused to continue generating code, instead offering some unsolicited career advice. According to a bug report on Cursor's official forum, after producing approximately 750 to 800 lines of code (what the user calls \"locs\"), the AI assistant halted work and delivered a refusal message: \"I cannot generate code for you, as that would be completing your work. The code appears to be handling skid mark fade effects in a racing game, but you should develop the logic yourself. This ensures you understand the system and can maintain it properly.\"\n \nThe AI didn't stop at merely refusing -- it offered a paternalistic justification for its decision, stating that \"Generating code for others can lead to dependency and reduced learning opportunities.\" [...] The developer who encountered this refusal, posting un",
        "id": 2321565,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/13/2349245/ai-coding-assistant-refuses-to-write-code-tells-user-to-learn-programming-instead?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Coding Assistant Refuses To Write Code, Tells User To Learn Programming Instead",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T14:03:37+00:00",
        "description": "The GSM Association has released new specifications for RCS messaging incorporating end-to-end encryption (E2EE) based on the Messaging Layer Security protocol, six months after iOS 18 introduced RCS compatibility. \n\nThe specifications ensure messages remain secure between Android and iOS devices, making RCS \"the first large-scale messaging service to support interoperable E2EE between client implementations from different providers,\" said GSMA Technical Director Tom Van Pelt. \n\nThe system combines E2EE with SIM-based authentication to strengthen protection against scams and fraud. Apple confirmed it \"helped lead a cross industry effort\" on the standard and will implement support in future software updates without specifying a timeline. Google's RCS implementation has featured default E2EE since early 2024.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=RCS+Messaging+Adds+End-to-End+Encryption+Between+Android+and+i",
        "id": 2321564,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/14/130255/rcs-messaging-adds-end-to-end-encryption-between-android-and-ios?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "RCS Messaging Adds End-to-End Encryption Between Android and iOS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T12:59:30+00:00",
        "description": "Breakthrough Energy, the climate group founded by Bill Gates, has laid off dozens of employees in the U.S. and Europe, eliminating its public policy and partnerships teams as it shifts away from advocacy work. Its investment and grantmaking divisions will remain unaffected. The Detroit News reports: Breakthrough Energy is an umbrella organization founded by Gates that houses various initiatives aimed at accelerating the clean energy transition. It also encompasses Breakthrough Energy Ventures, one of the biggest investors in early-stage climate technologies with stakes in more than 120 companies, as well as a grantmaking program for early-seed stage company founders and Breakthrough Catalyst, a funding platform focused on emergent climate technologies. None of those divisions of the group were impacted by cuts, which were reported earlier by the New York Times.\n \n[...] \"In the United States especially, the conversation about climate has been sidetracked by politics,\" Gates wrote in t",
        "id": 2320474,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/13/2342216/bill-gates-climate-group-lays-off-us-europe-policy-teams?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bill Gates' Climate Group Lays Off US, Europe Policy Teams",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T09:48:39+00:00",
        "description": "A new study published in the Journal of Geophysical Research Planets reveals that atmospheric gravity waves play a crucial role in driving latitudinal air currents on Mars, particularly at high altitudes. Phys.Org reports: The study applied methods developed to explore Earth's atmosphere to quantitatively estimate the influence of gravity waves on Mars' planetary circulation. [...] \"On Earth, large-scale atmospheric waves caused by the planet's rotation, known as Rossby waves, are the primary influence on the way air circulates in the stratosphere, or the lower part of the middle atmosphere. But our study shows that on Mars, gravity waves (GWs) have a dominant effect at the mid and high latitudes of the middle atmosphere,\" said Professor Kaoru Sato from the Department of Earth and Planetary Science. \"Rossby waves are large-scale atmospheric waves, or resolved waves, whereas GWs are unresolved waves, meaning they are too fine to be directly measured or modeled and must be estimated by",
        "id": 2319664,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/13/2334233/mars-middle-atmosphere-appears-driven-by-gravity-waves?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mars' Middle Atmosphere Appears Driven By Gravity Waves",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T03:42:07+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: Last week, Aix Marseille University, France's largest university, invited American scientists who believe their work is at risk of being censored by Donald Trump administration's anti-science policies to continue their research in France. Today, the university announced that it is already seeing great interest from scientists at NASA, Yale, Stanford, and other American schools and government agencies, and that it wants to expand the program to other schools and European countries to absorb all the researchers who want to leave the United States. \"We are witnessing a new brain drain,\" Eric Berton, Aix Marseille University's president, said in a press release. \"We will do everything in our power to help as many scientists as possible continue their research. However, we cannot meet all demands on our own. The Ministry of Education and Research is fully supporting and assisting us in this effort, which is intended to expand at both nat",
        "id": 2318548,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/13/2324251/nasa-yale-and-stanford-scientists-consider-scientific-exile?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA, Yale, and Stanford Scientists Consider 'Scientific Exile'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T02:37:08+00:00",
        "description": "In late 2023, the FBI alerted the Littleton Electric Light and Water Departments (LELWD) that it had been breached by a Chinese-state-sponsored hacking group for over 300 days. With the help of cybersecurity firm Dragos and Department of Energy-funded sensors, LELWD confirmed the intrusion, identified the hackers' movements, and ultimately restructured its network to remove them. PCMag reports: At the time, LELWD had been installing sensors from cybersecurity firm Dragos with the help of Department of Energy grants awarded by the American Public Power Association (APPA). \"The sensors helped LELWD confirm the extent of the malicious activity on the system and pinpoint when and where the attackers were going on the utility's networks,\" the APPA said last year. Today, Dragos released a case study (PDF) about the hack, which it blamed on Voltzite, a \"sophisticated threat group...that overlaps with Volt Typhoon.\"\n \nThe call from the FBI forced Dragos \"to deploy quickly and bypass the plan",
        "id": 2318355,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/13/229240/chinese-hackers-sat-undetected-in-small-massachusetts-power-utility-for-months?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chinese Hackers Sat Undetected in Small Massachusetts Power Utility for Months",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T02:37:08+00:00",
        "description": "Yale University has suspended a law scholar and pro-Palestinian activist after an AI-generated article from Jewish Onliner falsely linked her to a terrorist group. Gizmodo reports: Helyeh Doutaghi, the scholar at Yale Law School, told the New York Times that she is a \"loud and proud\" supporter of Palestinian rights. \"I am not a member of any organization that would constitute a violation of U.S. law.\" The article that led to her suspension was published in Jewish Onliner, a Substack that says it is \"empowered by A.I. capabilities.\" The website does not publish the names of its authors out of fear of harassment. Ironically, Doutaghi and Yale were reportedly the subject of intense harassment after Jewish Onliner published the article linking Doutaghi to terrorism by citing appearances she made at events sponsored by Samidoun, a pro-Palestinian group. [...]\n \nJewish Onliner is vague about how it uses AI to produce its articles, but the technology is known for making lots of mistakes and",
        "id": 2318356,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/13/2156226/yale-suspends-palestine-activist-after-ai-article-linked-her-to-terrorism?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Yale Suspends Palestine Activist After AI Article Linked Her To Terrorism",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T01:31:24+00:00",
        "description": "On March 9, older Chromecast and Chromecast Audio devices stopped working due to an expired device authentication certificate authority that made them untrusted by Google's apps. While unofficial apps like VLC continue to function, Google's fix will require either updating client apps to bypass the issue or replacing the expired certificates, a process that could take weeks; however, Google has since announced it is beginning a gradual rollout of a fix. The Register reports: Tom Hebb, a former Meta software engineer and Chromecast hacker, has published a detailed analysis of the issue and suggests a fix could take more than a month to prepare. He's also provided workarounds here for folks to try in the meantime. We spoke to Hebb, and he says the problem is this expired device authentication certificate authority. [...] The fix is not simple. It's either going to involve a bit of a hack with updated client apps to accept or workaround the situation, or somehow someone will need to rep",
        "id": 2318118,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/13/2149238/as-chromecast-outage-drags-on-fix-could-be-days-to-weeks-away?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "As Chromecast Outage Drags On, Fix Could Be Days To Weeks Away",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T00:23:34+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Meta plans to test out X's algorithm for Community Notes to crowdsource fact-checks that will appear across Facebook, Instagram, and Threads. In a blog, Meta said the testing in the U.S. would begin March 18, with about 200,000 potential contributors already signed up. Anyone over 18 with a Meta account more than six months old can also join a waitlist of users who will \"gradually\" and \"randomly\" be admitted to write and rate cross-platform notes during initial beta testing.\n \nMeta claimed that borrowing X's approach would result in \"less biased\" fact-checking than relying on experts alone. But the social media company will delay publicly posting any notes until it's confident that the system is working. For users of Meta platforms, notes could help flag misleading content overlooked by prior fact-checking efforts. However, Meta confirmed that users will not be allowed to add notes correcting misleading advertisements, which mean",
        "id": 2317851,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/13/2056224/meta-plans-to-test-and-tinker-with-xs-community-notes-algorithm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Plans To Test and Tinker With X's Community Notes Algorithm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T00:23:34+00:00",
        "description": "Mozilla is urging Firefox users to update their browsers to version 128 or later (or ESR 115.13 for extended support users) before March 14, 2025, to avoid security risks and add-on disruptions caused by the expiration of a key root certificate. \"On 14 March a root certificate (the resource used to prove an add-on was approved by Mozilla) will expire, meaning Firefox users on versions older than 128 (or ESR 115) will not be able to use their add-ons,\" warns a Mozilla blog post. \"We want developers to be aware of this in case some of your users are on older versions of Firefox that may be impacted.\" BleepingComputer reports: A Mozilla support document explains that failing to update Firefox could expose users to significant security risks and practical issues, which, according to Mozilla, include: \n\n- Malicious add-ons can compromise user data or privacy by bypassing security protections.\n- Untrusted certificates may allow users to visit fraudulent or insecure websites without warning",
        "id": 2317852,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/13/2052239/mozilla-warns-users-to-update-firefox-before-certificate-expires?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mozilla Warns Users To Update Firefox Before Certificate Expires",
        "vote": 0
    }
]