[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T15:30:18+00:00",
        "description": "Yasuke and Naoe will take the spotlight as co-protagonists in Assassin’s Creed Shadows, and for several reasons, they are both shaping up to be fascinating characters. But as excited as we are to step into Yasuke’s samurai boots, it’s Naoe the shinobi who has really caught our eye. \n\nFrom her expertise with stealth to her affinity for classic Assassin’s Creed parkour, she’s looking like the assassin in this Assassin’s Creed game, which is why we cannot wait to finally dive into feudal Japan as her.",
        "id": 2322869,
        "language": null,
        "link": "https://www.youtube.com/watch?v=l5qVp6HIukQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/l5qVp6HIukQ/hqdefault.jpg",
        "title": "You Are ABSOLUTELY NOT READY For NEW Stealth Mechanics In Assassin’s Creed Shadows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-14T09:30:21+00:00",
        "description": "Silent Hill successfully brought itself kicking and screaming back into the limelight with the stellar Silent Hill 2 remake last year, which means Konami is now finally ready to start talking about what the beloved psychological horror franchise’s next mainline title – the first new entry since Downpour over a decade ago – is going to look like. \n\nAt a recent Silent Hill Transmission, we got a new look at Silent Hill f with a trailer and a significant chunk of new details. We’ve learned more about the game’s story, setting, central themes, protagonist, music, art design, and more, and here, we unpack all of it in complete detail.",
        "id": 2319694,
        "language": null,
        "link": "https://www.youtube.com/watch?v=uQOBTMFStIM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uQOBTMFStIM/hqdefault.jpg",
        "title": "Silent Hill f - 10 NEW DETAILS You May Not Know About This Dramatically Different Game In The Series",
        "vote": 0
    }
]