[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T15:30:12+00:00",
        "description": "Steel Seed is the upcoming sci-fi stealth action adventure from Italian studio Storm in a Teacup together with publishers ESDigital Games, and it’s landing April 10th. \n\nTaking place within a compellingly designed, planet-sized factory playground harboring towering industrial complexes in a range of bleak biomes, player-character Zoe will parkour through on a mission to not only survive but understand the events which have led to humanity’s near-extinction. \n\nAlong the way she’ll be accompanied by hovering drone sidekick Koby, and together they’ll battle a range of AI-controlled robot enemies and solve environmental puzzles. This feature will highlight twelve elements in Steel Seed’s gameplay that’re worth looking forward too, including stealth mechanics, world design, skill upgrades, combat abilities, and more.",
        "id": 2443706,
        "language": null,
        "link": "https://www.youtube.com/watch?v=jhpvmceg-mQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jhpvmceg-mQ/hqdefault.jpg",
        "title": "STEEL SEED - 12 Exciting Features You Need To Know BEFORE YOU BUY This Sci-fi Stealth Game",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T09:30:28+00:00",
        "description": "Whilst it’s true the now twelve-year-old PlayStation 4 misses out on many of the latest and greatest titles, there’s still a wealth of games releasing on Sony’s aging hardware that make owning the PS4 still a worthy endeavour. \n\nHopefully this rundown of fifteen big PS4 games coming in 2025 proves that, and with awe-striking platformers, modern re-imaginings of classic titles, brand-new AAA games, real-time tactical forbearers, and the latest Tony Hawk collection, there’s plenty of variety on offer too. \n\nWhilst they might not all exhibit anywhere near the graphical fidelity of current-gen hardware, the gameplay in these games is inarguably on point. Sadly, the PS4 won’t be a viable option for many more years, but these games prove that there’s life in the old console yet.",
        "id": 2442132,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ttzNfe73iMs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/ttzNfe73iMs/hqdefault.jpg",
        "title": "15 NEW PS4 Games of 2025",
        "vote": 0
    }
]