[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T23:30:44+00:00",
        "description": "The U.S. and China \"are racing to build a truly useful humanoid worker,\" the Wall Street Journal wrote Saturday, adding that \"Whoever wins could gain a huge edge in countless industries.\" \n\n\"The time has come for robots,\" Nvidia's chief executive said at a conference in March, adding \"This could very well be the largest industry of all.\"\n\n\n\nChina's government has said it wants the country to be a world leader in humanoid robots by 2027. \"Embodied\" AI is listed as a priority of a new $138 billion state venture investment fund, encouraging private-sector investors and companies to pile into the business. It looks like the beginning of a familiar tale. Chinese companies make most of the world's EVs, ships and solar panels &mdash; in each case, propelled by government subsidies and friendly regulations. \"They have more companies developing humanoids and more government support than anyone else. So, right now, they may have an edge,\" said Jeff Burnstein [president of the Association for A",
        "id": 2445788,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/30/239225/china-is-already-testing-ai-powered-humanoid-robots-in-factories?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China is Already Testing AI-Powered Humanoid Robots in Factories",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T22:25:11+00:00",
        "description": "Slashdot reader jrnvk writes: The Verge is reporting that Microsoft will soon make it harder to run the well-publicized bypassnro command in Windows 11 setup. This command allows skipping the Microsoft account and online connection requirements on install. While the command will be removed, it can still be enabled by a regedit change &mdash; for now. \n\n\"However, there's no guarantee Microsoft will allow this additional workaround for long,\" writes the Verge. (Though they add \"There are other workarounds as well\" involving the unattended.xml automation.)\n\n\n In its latest Windows 11 Insider Preview, the company says it will take out a well-known bypass script... Microsoft cites security as one reason it's making this change. [\"This change ensures that all users exit setup with internet connectivity and a Microsoft Account.\"] Since the bypassnro command is disabled in the latest beta build, it will likely be pushed to production versions within weeks.\n<p><div class=\"share_submission\" st",
        "id": 2445552,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/30/2115253/microsoft-attempts-to-close-local-account-windows-11-setup-loophole?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Attempts To Close Local Account Windows 11 Setup Loophole",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T21:19:03+00:00",
        "description": "The giant financial news site Bloomberg \"has been experimenting with using AI to help produce its journalism,\" reports the New York Times. But \"It hasn't always gone smoothly.\" \n\nWhile Bloomberg announced on January 15 that it would add three AI-generated bullet points at the top of articles as a summary, \"The news outlet has had to correct at least three dozen A.I.-generated summaries of articles published this year.\" (This Wednesday they published a \"hallucinated\" date for the start of U.S. auto tariffs, and earlier in March claimed president Trump had imposed tariffs on Canada in 2024, while other errors have included incorrect figures and incorrect attribution.)\n\n\nBloomberg is not alone in trying A.I. &mdash; many news outlets are figuring out how best to embrace the new technology and use it in their reporting and editing. The newspaper chain Gannett uses similar A.I.-generated summaries on its articles, and The Washington Post has a tool called \"Ask the Post\" that generates ans",
        "id": 2445235,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/30/1946224/bloombergs-ai-generated-news-summaries-had-at-least-36-errors-since-january?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bloomberg's AI-Generated News Summaries Had At Least 36 Errors Since January",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T20:11:58+00:00",
        "description": "\"After a long run, Google is sunsetting two of its signature Nest products,\" reports PC World:\n\nGoogle has just announced that it's discontinuing the 10-year-old Nest Protect and the 7-year-old Nest x Yale lock. Both of those products will continue to work, and &mdash; for now &mdash; they remain on sale at the Google Store, complete with discounts until supplies run out. But while Google itself is exiting the smoke alarm and smart lock business, it isn't leaving Google Home users in the lurch. Instead, it's teeing up third-party replacements for the Nest Protect and Nest X Yale lock, with both new products coming from familiar brands... Capable of being unlocked via app, entry code, or a traditional key, the Yale Smart Lock with Matter is set to arrive this summer, according to Yale. \n\nWhile both the existing Nest Protect and Nest x Yale lock will continue to operate and receive security patches, those who purchased the second-generation Nest Protect near its 2015 launch date should",
        "id": 2444948,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/30/0454215/google-sunsets-two-devices-from-its-nest-smart-home-product-line?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Sunsets Two Devices From Its Nest Smart Home Product Line",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T20:11:58+00:00",
        "description": "The New York Times notes that white-collar workers \nhave faced higher unemployment than other groups in the U.S. over the past few years &mdash; along with slower wager growth. \n\nSome economists wonder if this trend might be irreversible... and partly attributable to AI:\n\nAfter sitting below 4% for more than two years, the overall unemployment rate has topped that threshold since May... \"We're seeing a meaningful transition in the way work is done in the white-collar world,\" said Carl Tannenbaum, the chief economist of Northern Trust. \"I tell people a wave is coming....\" Thousands of video game workers lost jobs last year and the year before... Unemployment in finance and related industries, while still low, increased by about a quarter from 2022 to 2024, as rising interest rates slowed demand for mortgages and companies sought to become leaner.... \n\nOverall, the latest data from the Federal Reserve Bank of New York show that the unemployment rate for college grads has risen 30% sinc",
        "id": 2444947,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/29/1928254/has-the-decline-of-knowledge-worker-jobs-begun?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Has the Decline of Knowledge Worker Jobs Begun?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T20:11:58+00:00",
        "description": "As Rust approaches its 10th anniversary, \"there is an important piece of documentation missing that many other languages provide,\" notes the Rust Foundation. \nWhile there's documentation and tutorials &mdash; there's no official language specification:\n\nIn December 2022, an RFC was submitted to encourage the Rust Project to begin working on a specification. After much discussion, the RFC was approved in July 2023, and work began. \n\nInitially, the Rust Project specification team (t-spec) were interested in creating the document from scratch using the Rust Reference as a guiding marker. However, the team knew there was already an external Rust specification that was being used successfully for compiler qualification purposes &mdash; the FLS. \n\nThank Berlin-based Ferrous Systems, a Rust-based consultancy who assembled that description \"some years ago,\" according to a post on the Rust blog:\n They've since been faithfully maintaining and updating this document for new versions of Rust, an",
        "id": 2444945,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/30/198218/how-rust-finally-got-a-specification---thanks-to-a-consultancys-open-source-donation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Rust Finally Got a Specification - Thanks to a Consultancy's Open-Source Donation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T20:11:58+00:00",
        "description": "Cloud providers like the security of running things in virtual machines \"at scale\" &mdash; even though VMs \"are not known for having fast cold starts or a small footprint...\" noted Microsoft's Open Source blog last November. So Microsoft's Azure Core Upstream team built an open source Rust library called Hyperlight \"to execute functions as fast as possible while isolating those functions within a VM.\" \n\nBut that was just the beginning...\n\n Then, we showed how to run Rust functions really, really fast, followed by using C to [securely] run Javascript. In February 2025, the Cloud Native Computing Foundation (CNCF) voted to onboard Hyperlight into their Sandbox program [for early-stage projects]. \n\n[This week] we're announcing the release of Hyperlight Wasm: a Hyperlight virtual machine \"micro-guest\" that can run wasm component workloads written in many programming languages... \n\nTraditional virtual machines do a lot of work to be able to run programs. Not only do they have to load an e",
        "id": 2444949,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/30/0627205/microsoft-announces-hyperlight-wasm-speedy-vm-based-security-at-scale-with-a-webassembly-runtime?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Announces 'Hyperlight Wasm': Speedy VM-Based Security at Scale with a WebAssembly Runtime",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T20:11:58+00:00",
        "description": "A former Facebook director of global policy recently published \"the book Meta doesn't want you to read,\" a scathing takedown of top Meta executives titled Careless People: A Cautionary Tale of Power, Greed, and Lost Idealism. \n\nBut Wednesday RestofWorld.org published additional thoughts from Meta's former head of public policy for Bangladesh (who is now an executive director at the nonprofit policy lab Tech Global Institute). Though their time at Facebook didn't overlap, they first applaud how the book \"puts a face to the horrific events and dangerous decisions.\" \n\nBut having said that, \"What struck me is that what isn't included in Careless People is more telling than what is.\"\n\n\nBy 2012 &mdash; one year after joining Facebook &mdash; Wynn-Williams had ample evidence of the platform's role in enabling violence and harm upon its users, and state-sanctioned digital repression, yet her memoir neither mentions these events nor the repeated warnings to her team from civil society groups ",
        "id": 2444946,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/30/170233/what-that-facebook-whistleblowers-memoir-left-out?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What that Facebook Whistleblower's Memoir Left Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T12:35:02+00:00",
        "description": "\"Researchers have discovered nearly 1.5 million pictures from specialist dating apps &mdash; many of which are explicit &mdash; being stored online without password protection,\" reports the BBC, \"leaving them vulnerable to hackers and extortionists.\" \n\n\nAnd the images weren't limited to those from profiles, the BBC learned from the ethical hacker who discovered the issue. \"They included pictures which had been sent privately in messages, and even some which had been removed by moderators...\"\n\nAnyone with the link was able to view the private photos from five platforms developed by M.A.D Mobile [including two kink/BDSM sites and two LGBT apps]... These services are used by an estimated 800,000 to 900,000 people. \n\nM.A.D Mobile was first warned about the security flaw on 20th January but didn't take action until the BBC emailed on Friday. They have since fixed it but not said how it happened or why they failed to protect the sensitive images. Ethical hacker Aras Nazarovas from Cybernew",
        "id": 2442682,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/30/0236216/nearly-15-million-private-photos-from-five-dating-apps-were-exposed-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nearly 1.5 Million Private Photos from Five Dating Apps Were Exposed Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T08:13:56+00:00",
        "description": "Samsung teased its \"AI Vision Inside\" refrigerators at January's CES tradeshow. (Its internal sensors can now detect 37 different fresh ingredients and 50 processed foods, generating lists for your cellphone or a screen on your refrigerator's door.) \n\nBut the refrigerators are part of a larger \"AI Home\" lineup of screen-enabled appliances with advanced AI features, and Engadget got to see them all together this weekend at Samsung's Bespoke AI conference in Seoul, Korea:\nThe centerpiece of the Bespoke line remains Samsung's 4-door French-Door refrigerator, which is now available with two different-sized screens. There's a model with a smaller 9-inch screen that starts at $3,999 or one with a massive 32-inch panel called the Family Hub+ for $4,699. The former is ostensibly designed for people who want something a bit more discreet but still want access to Samsung's smart features, which includes widgets for your calendar, music, weather, various cooking apps and more. Meanwhile, the la",
        "id": 2441701,
        "language": null,
        "link": "https://slashdot.org/story/25/03/30/0421248/samsung-unveils-ai-powered-screen-enabled-home-appliances?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Samsung Unveils AI-Powered, Screen-Enabled Home Appliances",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T03:53:20+00:00",
        "description": "\"I've been dreaming of this moment for 20 years,\" says Aptera co-CEO Steve Fambro. Aptera's solar-powered electric car just drove 300 miles on a single charge. \n\n\"We're one step closer to a future where every journey is powered by the sun,\" Aptera says in their announcement. \n\n\n\"This go around, Aptera took to the highway for the first time ever...\" writes the EV blog Electrek. \"At one point, Aptera's video noted that its solar EV was pulling over 545 watts of solar input, even though it was overcast.\" \n\n\"Less time searching for chargers,\" Aptera says in their announcement, adding that their \"production-intent\" car proved \"that a solar EV isn't just a concept for the future, but a real-world solution ready for the present\" &mdash; while turning Route 66 into \"a test bed for a vehicle built to thrive independently...\"\n\n\"The panoramic windshield gives you this incredible view of the landscape,\" Steve said [in a video accompanying the announcement], describing the drive. \"It's like a big",
        "id": 2441004,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/30/026200/aptera-takes-first-300-mile-highway-trip-in-solar-powered-ev?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Aptera Takes First 300-Mile Highway Trip in Solar-Powered EV",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T01:44:22+00:00",
        "description": "Some scientists believe life on earth originated in organic matter in earth's bodies of water more than 3.5 billion years ago,\" reports CNN. \"But where did that organic material come from...?\" \n\nMaybe electrical energy sparked the beginnings of life on earth &mdash; just like in Frankenstein:\n\n Researchers decades ago proposed that lightning caused chemical reactions in ancient Earth's oceans and spontaneously produced the organic molecules. Now, new research published March 14 in the journal Science Advances suggests that fizzes of barely visible \"microlightning,\" generated between charged droplets of water mist, could have been potent enough to cook up amino acids from inorganic material. \n\nAmino acids &mdash; organic molecules that combine to form proteins &mdash; are life's most basic building blocks and would have been the first step toward the evolution of life... For animo acids to form, they need nitrogen atoms that can bond with carbon. Freeing up atoms from nitrogen gas req",
        "id": 2440681,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/29/2326255/did-life-on-earth-come-from-microlightning-between-charged-water-droplets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Did Life on Earth Come from 'Microlightning' Between Charged Water Droplets?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-30T00:38:47+00:00",
        "description": "Though it's stock price is still up 200% from its IPO in March of 2024\n&mdash; last week Reddit's stock had dropped nearly 50% since February 7th. \n\n\nAnd then this week, it dropped another 10%, reports Bloomberg, citing both the phenomenon of \"volatile technology stocks under pressure\" &mdash; but also specifically \"the gloomy sentiment around Reddit...\"\n\n\n\nThe social media platform has struggled to recover since an earnings report in February showed that it is failing to keep up with larger digital advertising peers such as Meta Platforms Inc. and Alphabet Inc.'s Google, which have higher user figures. Reddit's outlook seemed precarious because its U.S. traffic took a hit from a change in Google's search algorithm. \n\nIn recent weeks, the short interest in Reddit &mdash; a proxy for the volume of bets against the company &mdash; has ticked up, and forecasts for the company's share price have fallen. One analyst opened coverage of Reddit this month with a recommendation that investors",
        "id": 2440453,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/29/2152217/reddits-50-stock-price-plunge-fails-to-entice-buyers-as-growth-slows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Reddit's 50% Stock-Price Plunge Fails to Entice Buyers as Growth Slows",
        "vote": 0
    }
]