[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T22:18:16.584450+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T21:00:00+00:00",
        "description": "quonset writes: Australia last updated their weather site a decade ago. In October, during one of the hottest days of the year, the Bureau of Meteorology (BOM) revealed its new web site and was immediately castigated for doing so. Complaints ranged from a confusing layout to not being able to find information. Farmers were particularly incensed when they found out they could no longer input GPS coordinates to find forecasts for a specific location. When it was revealed the cost of this update was A$96.5 million ($62.3 million), 20 times the original cost estimate, the temperature got even hotter. \n\nWith more than 2.6 billion views a year, Bom tried to explain that the site's refresh -- prompted by a major cybersecurity breach in 2015 -- was aimed at improving stability, security and accessibility. It did little to satisfy the public. Some frustrated users turned to humour: \"As much as I love a good game of hide and seek, can you tell us where you're hiding synoptic charts or drop some",
        "id": 4182631,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/27/2013252/australia-spent-62-million-to-update-its-weather-web-site-and-made-it-worse",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australia Spent $62 Million To Update Its Weather Web Site and Made It Worse",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T20:53:56.796387+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T20:00:00+00:00",
        "description": "Twenty years after surgeons in France performed the world's first face transplant, the experimental field that procedure launched is now confronting a troubling record of patient deaths, buried negative data and a healthcare system that leaves recipients financially devastated and medically vulnerable. \n\nAbout 50 face transplants have been performed globally since Isabelle Dinoire received her partial face graft at University Hospital CHU Amiens-Picardie in November 2005. A 2024 JAMA Surgery study reported five-year graft survival of 85% and 10-year survival of 74%, concluding that the procedure is \"an effective reconstructive option for patients with severe facial defects.\" The study did not track psychological wellbeing, financial outcomes, employment status or quality of life. Roughly 20% of face transplant patients have died from rejection, kidney failure, or heart failure. \n\nThe anti-rejection medications that keep transplanted faces alive can destroy kidneys and weaken immune sy",
        "id": 4182188,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/27/202228/face-transplants-promised-hope-patients-were-put-through-the-unthinkable",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Face Transplants Promised Hope. Patients Were Put Through the Unthinkable",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T18:41:59.703420+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T18:02:00+00:00",
        "description": "The UK government will levy a pay-per-mile tax on electric and plug-in hybrid vehicles starting April 2028, UK's finance minister Rachel Reeves announced, a measure designed to offset some of the fuel duty revenue that will disappear as drivers shift away from petrol and diesel cars. Electric vehicles will be charged 3 pence per mile and plug-in hybrids 1.5 pence per mile, payable annually alongside car tax. An average driver covering 8,000 miles a year would pay around $320, roughly half what a petrol or diesel driver pays in fuel duty. \n\nThe Office for Budget Responsibility expects the tax to generate $1.45 billion in its first year and $2.51 billion by 2030-31, offsetting about a quarter of the revenue losses projected from the EV transition by 2050. The Society of Motor Manufacturers and Traders warned the new charge would \"suppress demand\" and make sales targets harder to achieve. New Zealand and Iceland have already introduced road pricing for EVs; demand dropped in the former b",
        "id": 4181415,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/27/1332209/uk-to-tax-electric-cars-by-the-mile-starting-2028",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK To Tax Electric Cars by the Mile Starting 2028",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T17:34:45.648739+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T17:01:00+00:00",
        "description": "Google is testing a new Wi-Fi hotspot configuration in the latest Android Canary build that pairs the 6 GHz band's superior throughput with the 2.4 GHz band's broad device compatibility, eliminating the trade-off users previously faced when choosing between speed and legacy support. Android's default hotspot setting uses 2.4 and 5 GHz frequencies, omitting 6 GHz because most devices lack support for the newer standard and because U.S. regulations previously prohibited smartphones from creating 6 GHz hotspots. Recent regulatory changes and a Pixel update unlocked standalone 6 GHz hotspots, but that option cuts off older devices entirely. The new \"2.4 and 6 GHz\" dual-band mode, spotted in Android Canary, is expected to arrive in an upcoming Android 16 QPR3 beta.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Android's+New+Dual-Band+Hotspot+Mode+Pairs+6+GHz+Speed+With+2.4+GHz+Compatibility%3A+https%3A%2F%2Fmobile.slash",
        "id": 4180900,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/11/27/1255245/androids-new-dual-band-hotspot-mode-pairs-6-ghz-speed-with-24-ghz-compatibility",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Android's New Dual-Band Hotspot Mode Pairs 6 GHz Speed With 2.4 GHz Compatibility",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T16:32:31.359146+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T16:01:00+00:00",
        "description": "A bipartisan right-to-repair provision that would let the U.S. military fix its own equipment faces a serious threat from defense industry lobbyists who want to replace it with a pay-per-use model for accessing repair information. A source familiar with negotiations told The Verge that there are significant concerns that the language in the National Defense Authorization Act will be swapped out for a \"data-as-a-service\" alternative that would require the Department of Defense to pay contractors for access to technical repair data. \n\nThe provision, introduced by Sens. Elizabeth Warren (D-MA) and Tim Sheehy (R-MT) in their Warrior Right to Repair Act, passed the Senate in October and has support from Defense Secretary Pete Hegseth, the Army and the Navy. The National Defense Industrial Association published a white paper backing the data-as-a-service model, arguing it would protect contractors' intellectual property. Reps. Mike Rogers (R-AL) and Adam Smith (D-WA), who lead the House Arm",
        "id": 4180397,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/27/095202/defense-contractors-lobby-to-kill-military-right-to-repair-push-pay-per-use-data-model",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Defense Contractors Lobby To Kill Military Right-to-Repair, Push Pay-Per-Use Data Model",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T15:23:28.788706+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T15:01:00+00:00",
        "description": "An anonymous reader shares a report: NASA has slashed the number of astronaut missions on Boeing's Starliner contract and said the spacecraft's next mission to the International Space Station will fly without a crew, reducing the scope of a program hobbled by engineering woes and outpaced by SpaceX. The most recent mishap occurred during Starliner's first crewed test flight in 2024, carrying NASA astronauts Butch Wilmore and Suni Williams. Several thrusters on Starliner's propulsion system shut down during its approach to the ISS.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=NASA+Reduces+Flights+on+Boeing's+Starliner+After+Botched+Astronaut+Mission%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F11%2F27%2F0856219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.sla",
        "id": 4179765,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/27/0856219/nasa-reduces-flights-on-boeings-starliner-after-botched-astronaut-mission",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Reduces Flights on Boeing's Starliner After Botched Astronaut Mission",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T14:14:53.268321+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T14:00:00+00:00",
        "description": "Researchers at MIT and Oak Ridge National Laboratory have built a simulation that models all 151 million American workers and their skills, then maps those skills against the capabilities of over 13,000 AI tools currently in production to see where the two overlap. The answer, according to their analysis: 11.7% of the US labor market's total wage value, or about $1.2 trillion, sits in tasks that AI systems can technically perform [PDF]. \n\nThe researchers call this the Iceberg Index, and the name is deliberate. The visible AI disruption happening in tech jobs right now accounts for only 2.2% of labor market wage value. The remaining exposure lurks in cognitive and administrative work across finance, healthcare administration, and professional services, and unlike tech-sector disruption, it's spread across all fifty states rather than concentrated on the coasts. \n\nDelaware and South Dakota show higher Iceberg Index values than California because their economies lean heavily on administr",
        "id": 4179215,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/27/0752210/ai-can-technically-perform-12-of-us-labor-markets-wage-value-mit-simulation-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Can Technically Perform 12% of US Labor Market's Wage Value, MIT Simulation Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T13:10:32.331937+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the BBC: Call-handling agents powered by AI are to be trialled by Staffordshire Police in a bid to cut waiting times for the non-emergency 101 service. The force is set to become the third in the country to take part in the scheme testing the use of artificial \"agents\" to deal with calls. Under the system, the AI agent would deal with simple queries like requests for information without the need for human involvement, freeing up call handlers and reducing answering times.\n \nActing Chief Constable Becky Riggs confirmed the force would be looking to launch the AI pilot early in the new year. \"It's a piece of technology called Agentforce. It will help with our response to the public, which historically we know we haven't done well.\" The senior officer said that sometimes people are not calling to report a crime, but want more information, which the technology could help with. However, if the system detects keywords suggesting vulnerability or risk",
        "id": 4178723,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/26/2344228/uk-police-to-trial-ai-agents-responding-to-non-emergency-calls",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Police To Trial AI 'Agents' Responding To Non-Emergency Calls",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T10:50:45.190325+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T10:00:00+00:00",
        "description": "Apple is challenging a new Indian antitrust law that would let regulators calculate penalties based on global revenue -- a change that could expose the company to a fine of roughly $38 billion in its dispute with Tinder owner Match. The 2022 antitrust case centers on accusations that Apple abused its power by forcing developers to use its in-app purchase system. MacRumors reports: Last year, India passed a law that allows the Competition Commission of India (CCI) to use global turnover when calculating penalties imposed on companies for abusing market dominance. Apple can be fined up to 10 percent, which would result in a penalty of around $38 billion. Apple said that using global turnover would result in a fine that's \"manifestly arbitrary, unconstitutional, grossly disproportionate, and unjust.\"\n \nApple is asking India's Delhi High Court to declare the law illegal, suggesting that penalties should be based on the Indian revenue of the specific unit that violates antitrust law. [...]",
        "id": 4177752,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/26/2352256/apple-asks-indian-court-to-block-antitrust-law-allowing-38-billion-fine",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Asks Indian Court to Block Antitrust Law Allowing $38 Billion Fine",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T07:44:38.503370+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T07:00:00+00:00",
        "description": "China's new JUNO neutrino observatory has delivered world-leading measurements after just 59 days, offering the most precise readings yet of two key neutrino oscillation parameters. \"The physics result is already world-leading in the areas that it touches,\" says particle physicist Juan Pedro Ochoa-Ricoux of the University of California, Irvine, who co-leads a team on JUNO. \"In particular, we measured two neutrino oscillation parameters, and that measurement is already for both parameters the best in the world.\" The results were published in two separate preprints on arXiv.org. Scientific American reports: JUNO's spherical detector, which is akin to a 13-story-tall fishbowl, primarily measures so-called electron antineutrinos spewing from the nearby Yangjian and Taishan nuclear plants. When the particles strike a proton inside the detector, a reaction triggers two light flashes that ping photomultiplier tubes and get converted into electrical signals. The new measurements from these ne",
        "id": 4176824,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/26/2337257/chinas-giant-underground-neutrino-observatory-releases-its-first-results",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's Giant Underground Neutrino Observatory Releases Its First Results",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T04:33:21.600827+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: Mexico unveiled plans Wednesday to build what it claims will be Latin America's most powerful supercomputer -- a project the government says will help the country capitalize on the rapidly evolving uses of artificial intelligence and exponentially expand the country's computing capacity. Dubbed \"Coatlicue\" for the Mexica goddess considered the earth mother, the supercomputer would be seven times more powerful than the region's current leader in Brazil, Jose Merino, head of the Telecommunications and Digital Transformation Agency.\n \nPresident Claudia Sheinbaum said during her morning news briefing that the location for the project had not been decided yet, but construction will begin next year. \"We're very excited,\" said Sheinbaum, an academic and climate scientist. \"It is going to allow Mexico to fully get in on the use of artificial intelligence and the processing of data that today we don't have the capacity to do.\" Meri",
        "id": 4175972,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/26/2330218/mexico-unveils-plans-to-build-most-powerful-supercomputer-in-latin-america",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mexico Unveils Plans To Build Most Powerful Supercomputer In Latin America",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T02:27:12.889260+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T02:02:00+00:00",
        "description": "Amazon's drone-delivery program is under federal scrutiny after an MK30 aircraft clipped an internet cable in Texas. CNBC reports: The incident occurred on Nov. 18 around 12:45 p.m. Central in Waco, Texas. After dropping off a package, one of Amazon's MK30 drones was ascending out of a customer's yard when one of its six propellers got tangled in a nearby internet cable, according to a video of the incident viewed and verified by CNBC. The video shows the Amazon drone shearing the wire line. The drone's motor then appeared to shut off and the aircraft landed itself, with its propellers windmilling slightly on the way down, the video shows. The drone appeared to remain in tact beyond some damage to one of its propellers.\n \nThe Federal Aviation Administration is investigating the incident, a spokesperson confirmed. The National Transportation Safety Board said the agency is aware of the incident but has not opened a probe into the matter. Amazon confirmed the incident to CNBC, saying th",
        "id": 4175495,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/26/2326203/amazon-faces-faa-probe-after-delivery-drone-snaps-internet-cable-in-texas",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Faces FAA Probe After Delivery Drone Snaps Internet Cable In Texas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T02:27:13.167855+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T01:25:00+00:00",
        "description": "Greek authorities shut down an IPTV piracy operation on Santorini, arresting a reseller and referring 68 end users for prosecution. TorrentFreak reports: A new legal framework to tackle online infringement in Greece went live just a couple of months ago, and reports of prosecutions are already coming in. Early September, it was reported that a man from Sparta faces prosecution and a fine of up to 6,000 euros for two IPTV piracy offenses. The suspect, reportedly a cafe owner, was targeted at his workplace on a Saturday, allegedly in front of customers. One told local media that they believed that complaints of the cafe engaging in \"unfair competition\" preceded the untimely visit.\n \nThe Cybercrime Prosecution Directorate launched their operation in the early hours of November 19. The Athens-based unit targeted a network that sold illicit access to premium pay-TV via IPTV subscriptions. The raid, conducted on Santorini, one of the Cyclades islands, resulted in the arrest of a 48-year-old",
        "id": 4175496,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/26/227244/greek-cybercrime-unit-shuts-down-iptv-pirates-68-end-users-face-fines",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Greek Cybercrime Unit Shuts Down IPTV Pirates, 68 End Users Face Fines",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T01:18:54.046018+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T00:45:00+00:00",
        "description": "Last week, Google surprised the tech world when it announced AirDrop support on Pixel 10 devices -- all without Apple's involvement. \"While it initially seemed like this was a rogue move made by Google to coerce Apple into another boundary-breaking decision, it might actually be part of the repercussions that also led to USB-C on iPhone and the adoption of RCS,\" reports 9to5Google. From a report: As reported by Ars Technica, the answer to this week's mysterious Quick Share upgrade lies in the EU's interoperability requirements designed for the DMA. The ruling out of the European Commission pushed Apple to begin supporting interoperable wireless standards beginning with this year's set of OS upgrades, replacing the previous proprietary standard the company used to power its various Continuity features. That forced Apple to add support for the Wi-Fi Alliance's Wi-Fi Aware standard of multi-directional file sharing, at the cost of completely phasing out its previous walled-in protocol.<p",
        "id": 4175159,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/26/2155234/googles-airdrop-support-for-pixel-10-likely-exists-because-of-eus-apple-ruling",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's AirDrop Support For Pixel 10 Likely Exists Because of EU's Apple Ruling",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T00:11:19.682418+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Facing five lawsuits alleging wrongful deaths, OpenAI lobbed its first defense Tuesday, denying in a court filing that ChatGPT caused a teen's suicide and instead arguing the teen violated terms that prohibit discussing suicide or self-harm with the chatbot. The earliest look at OpenAI's strategy to overcome the string of lawsuits came in a case where parents of 16-year-old Adam Raine accused OpenAI of relaxing safety guardrails that allowed ChatGPT to become the teen's \"suicide coach.\" OpenAI deliberately designed the version their son used, ChatGPT 4o, to encourage and validate his suicidal ideation in its quest to build the world's most engaging chatbot, parents argued.\n \nBut in a blog, OpenAI claimed that parents selectively chose disturbing chat logs while supposedly ignoring \"the full picture\" revealed by the teen's chat history. Digging through the logs, OpenAI claimed the teen told ChatGPT that he'd begun experiencing suic",
        "id": 4174829,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/26/2012215/openai-says-dead-teen-violated-tos-when-he-used-chatgpt-to-plan-suicide",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Says Dead Teen Violated TOS When He Used ChatGPT To Plan Suicide",
        "vote": 0
    }
]