[
    {
        "age": null,
        "album": "",
        "author": "/u/Linkerd_",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-27T16:57:10.463130+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-27T16:39:34+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Not gonna mince words. Im barely sleeping. NOT SELLING anything here, just want to market stuff.</p> <p>My friend is a full stack dev. I got 13 yrs in marketing. We realized something scary. Coding is a commodity now coz of AI. The real deal is distribution which is where I fit in perfectly</p> <p>We’re building somthing rn that will force big players to overhaul their whole product lines by 2026. Not a vision. A fact.</p> <p>But i have too much ammo in my aresenal :))))</p> <p>Need another/multiple indie dev who knows their stuff end-to-end. I have an idea that is... honestly dangerous for competitors.</p> <p><strong>YOU and I will build and market products</strong></p> <p>We build it. We use a specific &quot;free forever&quot; model I figured out. Users get addicted, we dont go broke on server costs, and the paywall converts.</p> <p>Trust me. You have no idea what im sitting on.</p> <p>I assure you I wont let anyone overtake if you and I build somet",
        "id": 4180529,
        "language": "en",
        "link": "https://www.reddit.com/r/developer/comments/1p86qc4/coding_is_basically_free_now_so_my_13yrs_of",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 508,
        "source_url": "https://www.reddit.com/r/developer/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Coding is basically free now so my 13yrs of marketing exp can be a weapon for you. Looking for a tech partner to help me bankrupt some legacy apps. Lets do this before THEY catch up ;)",
        "vote": 0
    }
]