[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:17:12.357165+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T16:00:21+00:00",
        "description": "A Rockstar Games release without controversy would be like The Game Awards without ads: More or less impossible and rightly inconceivable. Such has been the case since Red Dead Redemption 2, and crunch concerns arose around 2018. While that did nothing to impact the game's success, it reportedly contributed to a major shift behind the scenes at the studio, which would in turn impact development on Grand Theft Auto 6.\n\nYou've likely heard about the firings of 34 employees from the company earlier this month. At the time, Rockstar was accused of union-busting, which it denied, and retaliated by stating that the firings were due to said employees “distributing and discussing confidential information in a public forum.”",
        "id": 4161761,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=H2Xet-GDvnM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/H2Xet-GDvnM/hqdefault.jpg",
        "title": "GTA 6 - What The HELL Is Going On With Rockstar's Staff Firings?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T14:08:06.210925+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T13:31:01+00:00",
        "description": "Shortcomings aside, Project Motor Racing is a promising start to righting the ship for the racing sim genre. Experiencing how each individual car handles differently based on different setup tweaks, watching the weather change in real-time, and hitting a turn perfectly feel incredible with the new engine, even if the limited amount of content and guidance kneecaps the appeal to non-hardcore racers. It’s an experience that can have you jumping from elation to frustration in a moment, for better and for worse. \n\nRegardless, if this is the beginning of a new racing sim franchise that can build and expand on this foundation in the same way as the ones that came before it, I’m excited about what the future holds for Project Motor Racing.",
        "id": 4160003,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=j9jIZzB17So",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/j9jIZzB17So/hqdefault.jpg",
        "title": "Project Motor Racing Review - Well, This Is A DISAPPOINTMENT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T10:52:03.287713+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T10:00:07+00:00",
        "description": "Microsoft Flight Simulator 2024 is in-flight – departed from Xbox and PC, and due to land on PS5 December 8th. PlayStation’s version is as complete as Xbox and PC, yet there’re concerns Asobo Studio’s current entry in Microsoft’s long-running flightsim isn’t yet soaring on Xbox and PC. \n\nThere’re technical niggles and pain-points which we’ll describe, but, putting these aside, this feature also outlines what you need to know before taxiing for runway on PS5,  from PlayStation-specific features and enhancements, to career modes, mission types, available aircraft, and everything else.",
        "id": 4158502,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=36sagNnz6Rk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/36sagNnz6Rk/hqdefault.jpg",
        "title": "Microsoft Flight Simulator 2024 PS5 - 15 Things You Need To Know Before You Buy",
        "vote": 0
    }
]