[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T23:11:59.149690+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T22:40:00+00:00",
        "description": "In an essay published in The Verge, Benjamin Riley argues that today's AI boom is built on a fundamental misunderstanding: language modeling is not the same as intelligence. \"The problem is that according to current neuroscience, human thinking is largely independent of human language -- and we have little reason to believe ever more sophisticated modeling of language will create a form of intelligence that meets or surpasses our own,\" writes Riley. Slashdot reader RossCWilliams shares the report, writing: The article goes on to point out that we use language to communicate. We use it to create metaphors to describe our reasoning. That people who have lost their language ability can still show reasoning. That human beings create knowledge when they become dissatisfied with the current metaphor. Einstein's theory of relativity was not based on scientific research. He developed it as thought experiment because he was dissatisfied with the existing metaphor. It quotes someone who said, \"",
        "id": 4164761,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/25/2146258/ai-cant-think",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'AI Can't Think'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T22:08:16.321521+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Several U.S. banking giants and mortgage lenders are reportedly scrambling to assess how much of their customers' data was stolen during a cyberattack on a New York financial technology company earlier this month. SitusAMC, which provides technology for over a thousand commercial and real estate financiers, confirmed in a statement over the weekend that it had identified a data breach on November 12. The company said that unspecified hackers had stolen corporate data associated with its banking customers' relationship with SitusAMC, as well as \"accounting records and legal agreements\" during the cyberattack.\n \nThe statement added that the scope and nature of the cyberattack \"remains under investigation.\" SitusAMC said that the incident is \"now contained,\" and that its systems are operational. The company said that no encrypting malware was used, suggesting that the hackers were focused on exfiltrating data from the company's systems",
        "id": 4164309,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/25/2138249/us-banks-scramble-to-assess-data-theft-after-hackers-breach-financial-tech-firm",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Banks Scramble To Assess Data Theft After Hackers Breach Financial Tech Firm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T22:08:16.453512+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T21:22:00+00:00",
        "description": "Up to 3 million low-skilled jobs could disappear in the UK by 2035 because of automation and AI, according to a report by a leading educational research charity. The Guardian: The jobs most at risk are those in occupations such as trades, machine operations and administrative roles, the National Foundation for Educational Research (NFER) said. Highly skilled professionals, on the other hand, were forecast to be more in demand as AI and technological advances increase workloads \"at least in the short to medium term.\" \n\nOverall, the report expects the UK economy to add 2.3 million jobs by 2035, but unevenly distributed. The findings stand in contrast to other recent research suggesting AI will affect highly skilled, technical occupations such as software engineering and management consultancy more than trades and manual work.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Could+Replace+3+Million+Low-Skilled+Jobs+in",
        "id": 4164310,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/25/193251/ai-could-replace-3-million-low-skilled-jobs-in-the-uk-by-2035-research-warns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Could Replace 3 Million Low-Skilled Jobs in the UK By 2035, Research Warns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T21:07:20.175166+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T20:41:00+00:00",
        "description": "Chinese automakers may not be able to sell their electric vehicles in the United States due to steep tariffs and software restrictions, but they have found an alternative path to American eyeballs through a coordinated campaign targeting car influencers on YouTube, TikTok, and Instagram. The effort, the Verge reports, is largely organized by DCar Studio, a platform that invites US-based creators to Los Angeles to test-drive vehicles from brands like BYD, Geely and Xiaomi. DCar is actually Dongchedi, a car trading platform owned by TikTok parent ByteDance that raised $600 million on a $3 billion valuation in 2024. The strategy appears aimed at building global brand awareness rather than direct US sales. \n\nMark Greeven, professor at IMD Business School, told The Verge that American influencers still shape opinions across the Western world. \"The charm offensive is to work with American influencers about Chinese EV cars because we still have a dominant opinion in the Western world, which ",
        "id": 4163911,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/25/1842246/american-influencers-cant-stop-praising-chinese-evs-they-cant-buy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "American Influencers Can't Stop Praising Chinese EVs They Can't Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T21:07:20.509676+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T20:01:00+00:00",
        "description": "The Justice Department has reached an agreement to settle an antitrust lawsuit against RealPage, a real estate software company that the government accused of enabling landlords to collude to raise rents. From a report: Using RealPage software, landlords shared information about their rents and occupancy rates with the company, after which an algorithm suggested what to charge renters. The government's suit, which was joined by several state attorneys general, accused RealPage of taking the confidential information and suggesting rents higher than those in a free market. \n\nUnder the settlement proposal, which requires approval by a federal judge overseeing the case in the Middle District of North Carolina, RealPage's software could no longer use information about current leases to train its algorithm. Nonpublic data from competing landlords would also be excluded when suggesting rents. \"Competing companies must make independent pricing decisions, and with the rise of algorithmic and a",
        "id": 4163912,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/25/1827251/realpage-agrees-to-settle-federal-rent-collusion-case",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "RealPage Agrees To Settle Federal Rent-Collusion Case",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T20:03:11.206380+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T19:21:00+00:00",
        "description": "schwit1 writes: Indonesia's capital, Jakarta, tops a ranking that is increasingly dominated by Asia: the world's most populated city. It edged out Bangladesh's capital, Dhaka, and Japan's Tokyo to earn the title in a new United Nations report. [PDF] \n\nWith an estimated population of nearly 42 million residents, Jakarta soared from 33rd place in the previous rankings, in 2018, that were topped by Tokyo. It's followed by Dhaka, with 36 million, which the report says is \"expected to become the world's largest city by mid-century.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Jakarta+Moves+Ahead+of+Tokyo+As+World's+Most+Populated+City%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F25%2F1820249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2",
        "id": 4163442,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/25/1820249/jakarta-moves-ahead-of-tokyo-as-worlds-most-populated-city",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jakarta Moves Ahead of Tokyo As World's Most Populated City",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:56:28.215237+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T18:41:00+00:00",
        "description": "An anonymous reader shares a report: CISA has warned that state-backed snoops and cyber-mercenaries are actively abusing commercial spyware to break into Signal and WhatsApp accounts, hijack devices, and quietly rummage through the phones of what the agency calls \"high-value\" users. \n\nIn an alert published Monday, the US government's cyber agency said it's tracking multiple miscreants that are using a mix of phishing, bogus QR codes, malicious app impersonation, and, in some cases, full-blown zero-click exploits to compromise messaging apps which most people assume are safe. \n\nThe agency says the activity it's seeing suggests an increasing focus on \"high-value\" individuals -- everyone from current and former senior government, military, and political officials to civil society groups across the US, the Middle East, and Europe. In many of the campaigns, attackers delivered spyware first and asked questions later, using the foothold to deploy more payloads and deepen their access.<p><di",
        "id": 4162826,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/25/1816245/cisa-warns-spyware-crews-are-breaking-into-signal-and-whatsapp-accounts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CISA Warns Spyware Crews Are Breaking Into Signal and WhatsApp Accounts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:56:28.338213+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T18:01:00+00:00",
        "description": "Two coal plants in Mumbai (in India) that were scheduled to close last year continue operating after the state government of Maharashtra reversed shutdown decisions in late 2023 and extended the life of at least one facility by five years. The largest single factor the Indian conglomerate Tata cited in its petition for an extension was increased energy demand from data centers. \n\nThe Guardian reports that Amazon operated 16 data centers in Mumbai last year. The company's official website lists three \"availability zones\" for the city. Amazon's Mumbai colocation data centers consumed 624,518 megawatt hours of electricity in 2023. That amount could power over 400,000 Indian households for a year. Residents of Mahul live a few hundred metres from one coal plant. Earlier this year doctors found three tumours in the brain of a resident's 54-year-old mother. Studies show people who live near coal plants are much more likely to develop cancer. By 2030 data centers will consume a third of Mumb",
        "id": 4162827,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/25/175213/mumbai-families-suffer-as-data-centers-keep-the-city-hooked-on-coal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mumbai Families Suffer As Data Centers Keep the City Hooked on Coal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:50:42.574790+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:28:00+00:00",
        "description": "Nvidia pushed back against investor concerns about Google's competitive positioning in AI on Tuesday after the chipmaker's shares tumbled 4.4% and erased nearly $200 billion in market cap on fears that Alphabet's tensor processing units were gaining ground against its dominance in AI computing. The company said it was \"delighted by Google's success\" but asserted that it continues to supply chips to Google. \n\nNvidia said it remains \"a generation ahead of the industry\" as the only platform that runs every AI model and operates everywhere computing is done. The statement came after investors reacted to the release of Google's Gemini 3 large language model last week. The model was trained using TPUs rather than Nvidia chips. A report in The Information on Monday said Google was pitching potential clients including Meta on using TPUs in their data centers rather than Nvidia's chips. \n\nNvidia said its platform offers \"greater performance, versatility, and fungibility than ASICs,\" referring ",
        "id": 4162157,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/25/1728213/nvidia-claims-generation-ahead-advantage-after-200-billion-sell-off-on-google-fears",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Claims 'Generation Ahead' Advantage After $200 Billion Sell-off on Google Fears",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:50:42.810548+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T16:42:00+00:00",
        "description": "The abstract of a paper on NBER: This paper examines a large-scale randomized evaluation of the One Laptop Per Child (OLPC) program in 531 Peruvian rural primary schools. We use administrative data on academic performance and grade progression over 10 years to estimate the long-run effects of increased computer access on (i) school performance over time and (ii) students' educational trajectories. Following schools over time, we find no significant effects on academic performance but some evidence of negative effects on grade progression. Following students over time, we find no significant effects on primary and secondary completion, academic performance in secondary school, or university enrollment. Survey data indicate that computer access significantly improved students' computer skills but not their cognitive skills; treated teachers received some training but did not improve their digital skills and showed limited use of technology in classrooms, suggesting the need for addition",
        "id": 4162158,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/25/1642202/evidence-from-the-one-laptop-per-child-program-in-rural-peru",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Evidence from the One Laptop per Child Program in Rural Peru",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T16:46:54.655610+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T16:08:00+00:00",
        "description": "The brain goes through five distinct phases in life, with key turning points at ages nine, 32, 66 and 83, scientists have revealed. From a report: Around 4,000 people up to the age of 90 had scans to reveal the connections between their brain cells. Researchers at the University of Cambridge showed that the brain stays in the adolescent phase until our early thirties when we \"peak.\" They say the results could help us understand why the risk of mental health disorders and dementia varies through life. The brain is constantly changing in response to new knowledge and experience -- but the research shows this is not one smooth pattern from birth to death. \n\nSome people will reach these landmarks earlier or later than others -- but the researchers said it was striking how clearly these ages stood out in the data. These patterns have only now been revealed due to the quantity of brain scans available in the study, which was published in the journal Nature Communications.<p><div class=\"shar",
        "id": 4161596,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/25/168211/adolescence-lasts-into-30s---new-study-shows-four-pivotal-ages-for-your-brain",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Adolescence Lasts Into 30s - New Study Shows Four Pivotal Ages For Your Brain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T15:41:19.761525+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T15:21:00+00:00",
        "description": "An anonymous reader shares a report: Solid-state drives sitting unpowered in drawers or storage can lose data over time because voltage gradually leaks from their NAND flash cells, and consumer-grade drives using QLC NAND retain data for about a year while TLC NAND lasts up to three years without power. More expensive MLC and SLC NAND can hold data for five and ten years respectively. The voltage loss can result in missing data or completely unusable drives. \n\nHard drives remain more resistant to power loss despite their susceptibility to bit rot. Most users relying on SSDs for primary storage in regularly powered computers face little risk since drives typically stay unpowered for only a few months at most. The concern mainly affects creative professionals and researchers who need long-term archival storage.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Unpowered+SSDs+in+Your+Drawer+Are+Slowly+Losing+Data%3A+https",
        "id": 4160959,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/25/1511242/unpowered-ssds-in-your-drawer-are-slowly-losing-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Unpowered SSDs in Your Drawer Are Slowly Losing Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T15:41:20.087088+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T14:46:00+00:00",
        "description": "An anonymous reader shares a report: Singapore's police have ordered Apple and Google to prevent the spoofing of government agencies on their messaging platforms, the home affairs ministry said on Tuesday. The order under the nation's Online Criminal Harms Act came after the police observed scams on Apple's iMessage and Google Messages purporting to be from companies such as the local postal service SingPost. While government agencies have registered with a local SMS registry so only they can send messages with the \"gov.sg\" name, this does not currently apply to the iMessage and Google Messages platforms.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Singapore+Orders+Apple%2C+Google+To+Prevent+Government+Spoofing+on+Messaging+Platforms%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F11%2F25%2F1446250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a",
        "id": 4160960,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/25/1446250/singapore-orders-apple-google-to-prevent-government-spoofing-on-messaging-platforms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Singapore Orders Apple, Google To Prevent Government Spoofing on Messaging Platforms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T14:38:09.134221+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T14:00:00+00:00",
        "description": "In the latest Windows Insider beta update, Microsoft has announced that it is exploring preloading File Explorer in the background to improve launch performance. The feature will load File Explorer silently before users click on it and can be toggled off for those who prefer not to use it. Microsoft introduced a similar capability earlier this year for Office called Startup Boost that loads parts of Word in the background so the application launches more quickly. The company is also removing elements from the File Explorer context menu in the same update.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+To+Preload+File+Explorer+in+Background+For+Faster+Launch+in+Windows+11%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F25%2F140253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?",
        "id": 4160348,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/25/140253/microsoft-to-preload-file-explorer-in-background-for-faster-launch-in-windows-11",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft To Preload File Explorer in Background For Faster Launch in Windows 11",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T13:36:57.791050+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Lenovo is stockpiling memory and other critical components to navigate a supply crunch brought on by the boom in artificial intelligence. The world's biggest PC maker is holding on to component inventories that are roughly 50% higher than usual, Chief Financial Officer Winston Cheng told Bloomberg TV on Monday. The frenzy to build and fill AI data centers with advanced hardware is raising prices for producers of consumer electronics, but Lenovo also sees opportunity in this to capitalize on its stockpile.\n \n\"The price is going very, very high, of course, and I think it's been unprecedented in terms of this rate driven by the AI demand,\" Cheng said. His company has long-term contracts in place and the benefit of scale, he added, and \"those that have the supply actually would be able to have a position in the market.\" Beijing-based Lenovo will aim to avoid passing on rising costs to its customers in the current quarter, as it wants to ",
        "id": 4159852,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/25/0257209/lenovo-stockpiling-pc-memory-due-to-unprecedented-ai-squeeze",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lenovo Stockpiling PC Memory Due To 'Unprecedented' AI Squeeze",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T10:21:47.013300+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T10:00:00+00:00",
        "description": "The EPA has approved new pesticides that qualify as PFAS \"forever chemicals\" (paywalled; alternative source), sparking criticism from scientists and environmental groups who warn these decisions could increase Americans' exposure through food and water at a time when many states are moving to restrict such substances. The Washington Post reports: This month, the agency approved two new pesticides that meet the internationally recognized definition for per- and polyfluoroalkyl substances, also known as PFAS or fluorinated substances, and has announced plans for four additional approvals. The authorized pesticides, cyclobutrifluram and isocycloseram, which was approved Thursday, will be used on vegetables such as romaine lettuce, broccoli and potatoes. The agency also announced plans to relax a rule requiring companies to report all products containing PFAS and has proposed weakening drinking water standards for the chemicals. \"Many fluorinated compounds registered or proposed for U.S. ",
        "id": 4158385,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/25/0252230/epa-approves-new-forever-chemical-pesticides-for-use-on-food",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EPA Approves New 'Forever Chemical' Pesticides For Use On Food",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T07:18:22.120702+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T07:00:00+00:00",
        "description": "Scientists report that the Antarctic ozone hole in 2025 is the fifth-smallest since 1992, thanks largely to decades of global restrictions on ozone-depleting chemicals under the Montreal Protocol. ABC News reports: The ozone hole reached its greatest one-day extent for 2025 in early September, measuring 8.83 million square miles, about 30% smaller than the largest hole on record in 2006. NOAA and NASA scientists emphasize that recent findings show efforts to limit ozone-depleting chemical compounds can have a significant impact. The regulations are established by the Montreal Protocol, which went into effect in 1992. Subsequent amendments are driving the gradual recovery of the ozone layer, which remains on track to fully recover later this century as countries worldwide replace harmful substances with safer alternatives.\n \nFor decades, chlorofluorocarbons (CFCs) and other ozone-depleting compounds were widely used in aerosol sprays, foams, air conditioners and refrigerators, causing ",
        "id": 4157539,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/25/0236221/ozone-hole-ranked-as-5th-smallest-in-more-than-30-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ozone Hole Ranked As 5th Smallest In More Than 30 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T04:12:21.214743+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: Hacker conferences -- like all conventions -- are notorious for giving attendees a parting gift of mystery illness. To combat \"con crud,\" New Zealand's premier hacker conference, Kawaiicon, quietly launched a real-time, room-by-room carbon dioxide monitoring system for attendees. To get the system up and running, event organizers installed DIY CO2 monitors throughout the Michael Fowler Centre venue before conference doors opened on November 6. Attendees were able to check a public online dashboard for clean air readings for session rooms, kids' areas, the front desk, and more, all before even showing up. \"It's ALMOST like we are all nerds in a risk-based industry,\" the organizers wrote on the convention's website. \"What they did is fantastic,\" Jeff Moss, founder of the Defcon and Black Hat security conferences, told WIRED. \"CO2 is being used as an approximation for so many things, but there are no easy, inexpensive network monitoring sol",
        "id": 4156769,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/25/0024229/hacker-conference-installed-a-literal-antivirus-monitoring-system",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hacker Conference Installed a Literal Antivirus Monitoring System",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T02:11:00.877922+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T02:02:00+00:00",
        "description": "Researchers warn that rapid advances in neuroscience, pharmacology, and AI are bringing \"brain weapons\" out of science fiction and into real-world plausibility. They argue current arms treaties don't adequately cover these emerging tools and call for a new, proactive framework to prevent the weaponization of the human mind. The Guardian reports: Michael Crowley and Malcolm Dando, of Bradford University, are about to publish a book that they believe should be a wake-up call to the world. [...] The book, published by the Royal Society of Chemistry, explores how advances in neuroscience, pharmacology and artificial intelligence are coming together to create a new threat. \"We are entering an era where the brain itself could become a battlefield,\" said Crowley. \"The tools to manipulate the central nervous system -- to sedate, confuse or even coerce -- are becoming more precise, more accessible and more attractive to states.\"\n \nThe book traces the fascinating, if appalling, history of state",
        "id": 4156308,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/25/0030245/mind-altering-brain-weapons-no-longer-only-science-fiction-say-researchers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mind-Altering 'Brain Weapons' No Longer Only Science Fiction, Say Researchers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T02:11:01.070180+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T01:25:00+00:00",
        "description": "BrianFagioli writes: President Trump has issued a sweeping executive order that creates the Genesis Mission, a national AI program he compares to a Manhattan Project level effort. It centralizes DOE supercomputers, national lab resources, massive scientific datasets, and new AI foundation models into a single platform meant to fast track research in areas like fusion, biotech, microelectronics, and advanced manufacturing. The order positions AI as both a scientific accelerator and a national security requirement, with heavy emphasis on data access, secure cloud environments, classification controls, and export restrictions.\n \nThe mission also sets strict timelines for identifying key national science challenges, integrating interagency datasets, enabling AI run experimentation, and creating public private research partnerships. Whether this becomes an effective scientific engine or another oversized federal program remains to be seen, but the administration is clearly pushing to frame",
        "id": 4156309,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/25/009227/trump-launches-genesis-mission-a-manhattan-project-level-ai-push",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Launches Genesis Mission, a Manhattan Project-Level AI Push",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T01:09:42.138335+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T00:45:00+00:00",
        "description": "Sam Altman and Jony Ive say they've settled on a prototype for OpenAI's first hardware device that could ship in \"less than\" two years. The Verge reports: In an interview with Laurene Powell Jobs at Emerson Collective's 2025 Demo Day, they said they are currently prototyping the device, and when asked about a timeframe, Ive said it could arrive in \"less than\" two years. Little has been revealed so far about the OpenAI device in development, but it's rumored to be screen-free and \"roughly the size of a smartphone.\"\n \nAltman described the design as \"simple and beautiful and playful,\" adding that, \"There was an earlier prototype that we were quite excited about, but I did not have any feeling of, \"I want to pick up that thing and take a bite out of it,' and then finally we got there all of a sudden.\" Ive similarly emphasized simplicity and whimsy, saying, \"I love solutions that teeter on appearing almost naive in their simplicity, and I also love incredibly intelligent, sophisticated pro",
        "id": 4156052,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/25/006212/jony-ive-and-sam-altman-say-they-finally-have-an-ai-hardware-prototype",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jony Ive and Sam Altman Say They Finally Have an AI Hardware Prototype",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T00:05:50.503184+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from the BBC: The island of Hokkaido has long been an agricultural powerhouse -- now Japan is investing billions to turn it into a global hub for advanced semiconductors. More than half of Japan's dairy produce comes from Hokkaido, the northernmost of its main islands. In winter, it's a wonderland of ski resorts and ice-sculpture festivals; in summer, fields bloom with bands of lavender, poppies and sunflowers. These days, cranes are popping up across the island -- building factories, research centers and universities focused on technology. It's part of Japan's boldest industrial push in a generation: an attempt to reboot the country's chip-making capabilities and reshape its economic future.\n \nLocals say that beyond the cattle and tourism, Hokkaido has long lacked other industries. There's even a saying that those who go there do so only to leave. But if the government succeeds in turning Hokkaido into Japan's answer to Silicon Valley -- or \"Hokkai",
        "id": 4155633,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/24/2248212/japans-high-stakes-gamble-to-turn-island-of-flowers-into-global-chip-hub",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan's High-Stakes Gamble To Turn Island of Flowers Into Global Chip Hub",
        "vote": 0
    }
]