[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T19:19:59.979935+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T19:00:14+00:00",
        "description": "Watch this session recorded at Unreal Fest Stockholm to discover how Unreal Engine’s Substrate material system transforms the way artists create and control surface shading. \n\nThis session dives into the new physically based model, showcases the method through which Substrate produces more flexible materials with greater visual fidelity, and provides practical tips for transitioning from legacy materials with confidence.\n\nWe explore how Substrate replaces the traditional shading model with a more physically accurate node-based system, looking at the way the new workflow separates material logic from surface description, enabling advanced layering, blending, and interaction between materials that was not possible with legacy models.\n\nWe also dive into the benefits for art teams; practical tips for converting legacy materials to Substrate; common pitfalls and best practices; and how adopting Substrate will future-proof your pipeline.\n\nLearn more about Unreal Engine here: unrealengine.co",
        "id": 4162952,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=G0h-5dQivI8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/G0h-5dQivI8/hqdefault.jpg",
        "title": "Everything You Wanted to Know About Substrate(But Are Too Afraid to Ask)| Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:14:34.213524+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:00:11+00:00",
        "description": "Watch Quentin Warnant present Rare's latest explorations into making interactive hanging foliage—such as groups of vines—in this session recorded at Unreal Fest Stockholm.\n\nHe demonstrates how he's using Niagara to implement a position-based dynamics physics solver and applying the results onto Nanite meshes. \n\nQuentin also showcases ways to integrate external forces like dynamic wind and collisions on the simulation. There’s a discussion on key learnings from the content presented, as well as a look at potential future work to be done.\n\nYou’ll gain practical knowledge on the synergistic use of various Unreal Engine features, with an introduction to position-based dynamics as an algorithm and how to implement it in Niagara by using simulation stages, Grid2D collections, and custom HLSL nodes. \n\nYou’ll also learn how custom data interfaces are used to read bespoke mesh vertex data and control instanced material parameters directly from Niagara, instead of using Niagara renderers.\n\nAddi",
        "id": 4162350,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7fmGQObsc7w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7fmGQObsc7w/hqdefault.jpg",
        "title": "Interactive Vines using Niagara and Position-Based Dynamics | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T16:03:26.923274+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T15:00:45+00:00",
        "description": "This session recorded at Unreal Fest Stockholm is a sequel to the hit talk from Unreal Fest Prague, packed with even more hard-earned insights and lessons learned the hard way. \n\nIn this session, Alex Coulombe of Agile Lens digs deeper into the advanced—and often unexpected—challenges that come from shipping real projects in Unreal Engine.\n\nPart cautionary tale, part toolbox expansion, this session is for anyone who’s hit a wall at 3 AM and thought, “Why didn’t anyone warn me about this?”  \n\nFrom gameplay systems that seemed elegant until they collapsed under scale, to UI decisions that haunted us, and networking setups that almost worked—until they didn’t—this session covers the problems you didn’t even know to look for. \n\nYou'll learn techniques for unpacking optimization tradeoffs, debugging tactics, performance traps, and all the quiet “gotchas” that never make it into the documentation.  \n\nWhether you’re leading a team or flying solo, expect candid stories, tested solutions, and ",
        "id": 4161096,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=M1J25jJ79U8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/M1J25jJ79U8/hqdefault.jpg",
        "title": "I Wish I Learned This Sooner! - Part 2 | Unreal Fest Stockholm 2025",
        "vote": 0
    }
]