[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:35.856762+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T18:00:19+00:00",
        "description": "In this TEDxWilmington talk, Rhett Power offers a bold new perspective on healing the fractured conversations that divide us—not through policy, but through personal transformation. Drawing from global experiences, he introduces a practical 5-step process and three powerful questions that can reignite civil dialogue in any setting. Rhett challenges us to lead with empathy, curiosity, and courage to rebuild connection in our homes, workplaces, and communities. \n\nCEO, Author, Executive Coach, Speaker, Forbes and Rolling Stone Columnist, Rhett Power, CEO and Co-founder of Accountability Inc., is an internationally recognized executive coach and a six-time founder whose work has reshaped leadership and organizational culture globally. As a bestselling author and distinguished Rolling Stone and Forbes columnist, Rhett consistently delivers insightful, actionable content on management, leadership, and entrepreneurial success.\n\nHonored by Global Gurus as one of the world's foremost managemen",
        "id": 4162453,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7fyKOIvf3FY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7fyKOIvf3FY/hqdefault.jpg",
        "title": "How to host a bipartisan dinner | Rhett Power | TEDxWilmington",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:35.983289+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:44:43+00:00",
        "description": "Sharing how age is no barrier to action, Naman highlighted a child’s efforts to spread awareness about recycling cigarette butts, proving initiative and responsibility can start early. \"Naman Gupta is the Founder and Director of Code Effort Pvt. Ltd., a pioneering enterprise that bridges the gap between economy and environment through innovative recycling solutions. A B.Com graduate from Delhi University and CA-IPC, Naman is a 5x Intellectual Property Rights holder and an inspiring storyteller who frequently speaks at leading institutions including IITs, IIMs, and LSR. He is also a recipient of multiple honors including the Silver and Bronze Karamveer Chakra and Recycler of the Year 2025, Naman’s work has been featured in 300+ global media outlets, amassing over 600 million views worldwide.\nA recipient of multiple honors including the Silver and Bronze Karamveer Chakra and Recycler of the Year 2025, Naman’s work has been featured in 300+ global media outlets, amassing over 600 million",
        "id": 4162454,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=teaVc3UGVCE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/teaVc3UGVCE/hqdefault.jpg",
        "title": "Does Age Matter While Taking Action | Naman Gupta | TEDxLotus Petal School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:36.113150+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:38:50+00:00",
        "description": "Most classrooms are designed for teaching — not for how the brain actually learns. In this eye-opening TEDx talk, educator Julia Volkman reveals how common instructional practices unintentionally work against the brain’s natural learning systems. Julia Volkman is an educator, researcher, and mentor dedicated to transforming the way we understand and teach children. Since 1997, she has been teaching students and mentoring educators in both private and public school settings. Julia is a Faculty Member of the Brain Health Initiative, a guest lecturer for Harvard University’s Neuroscience of Learning course, and the founder and president of Maitri Learning, an educational project devoted to evidence-based, child-centered learning.\n\nShe earned her AMI 3–6+ diploma from the Montreal Montessori Training Centre, a bilingual program, and her master’s degree from Harvard University, where her graduate research on the Montessori movable alphabet earned the Harvard Dean’s Prize for Outstanding Re",
        "id": 4162455,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=S3HzD4EJFsE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/S3HzD4EJFsE/hqdefault.jpg",
        "title": "Are we teaching against the brain? | Julia Volkman | TEDxApex",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:36.269033+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:38:31+00:00",
        "description": "In a world engineered for distraction, artificial intelligence isn’t just predicting your next move — it’s shaping it. In this bold and eye-opening talk, Raghav explores how AI systems have been trained to capture and monetize the most valuable currency of the digital age: your attention. From infinite scrolls to predictive dopamine loops, he reveals how technology has evolved faster than our brains — not by chance, but by design. Raghav is an AI Scientist and the founder of a ClimateTech venture focused on solving global sustainability challenges through artificial intelligence. He is recognized for advancing smarter, more efficient irrigation systems that help reduce freshwater consumption and improve crop health using simulation models, satellite imaging, and generative AI.\n\n\nWith a background in technology and a deep-rooted commitment to sustainability and innovation, Raghav transforms cutting-edge ideas into real-world solutions. He holds a Master’s in Business Analytics from Cal",
        "id": 4162456,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BiOoSS6BrqM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BiOoSS6BrqM/hqdefault.jpg",
        "title": "How AI Mastered Attention — Reclaim Your Natural Focus | Raghav Gupta | TEDxApex",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:36.470590+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:38:29+00:00",
        "description": "In this talk, Guilherme examines how traditional schooling often builds a model of success based on external validation, high grades, and predictability: factors that do not translate well into real life. Through personal reflections and everyday school observations, he explains why “excellent students” can experience fear of failure, difficulty adapting, and a lack of identity outside the classroom. His talk invites a redefinition of success grounded in autonomy, flexibility, and self-understanding. Guilherme Decotelli is a student at TBSRJ with a keen interest in the relationship between education, identity, and personal development. Through observations of himself, his friends, and peers, he began to question why so many high-performing students struggle once they step outside the school environment. Curious and reflective, Guilherme explores how expectations, external pressure, and perfectionism shape young people’s lives, and how these patterns can be challenged. This talk was gi",
        "id": 4162457,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6V58zr66Q4I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6V58zr66Q4I/hqdefault.jpg",
        "title": "Why Good Students Struggle After School | Guilherme Decotelli | TEDxTBSRJ Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:36.677909+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:38:21+00:00",
        "description": "In this talk, Ana Carolina challenges the stereotypes surrounding Gen Z and uses data and real stories to show how the generation is reshaping the modern workplace. She explains why their demands for purpose, mental health, representation, and flexibility are not signs of weakness, but markers of a new era of leadership and organizational culture. Her message highlights the opportunity and urgency for companies to embrace more human-centered, authentic, and sustainable ways of working. Ana Carolina Gozzi is a young entrepreneur and co-CEO of a marketing agency that bridges generational perspectives and capabilities. She works with organizational culture, human-centered leadership, and generational behavior, helping companies adapt to the emerging values of purpose, authenticity, and social impact embraced by Gen Z. Known for her clear and empathetic communication, she is committed to transforming workplaces into more inclusive, creative, and emotionally intelligent environments. This ",
        "id": 4162458,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZuJMdQ8dkis",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZuJMdQ8dkis/hqdefault.jpg",
        "title": "Não é Birra de Jovem, é Revolução | Ana Carolina Gozzi | TEDxTBSRJ Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:36.934766+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:38:13+00:00",
        "description": "Marcella examines how women are taught to downplay their achievements and dim their own light out of fear of judgment. She connects this habit to broader impacts on ambition, mental health, and personal relationships. Her talk is a call for women to embrace self-admiration, practice self-compassion, and recognize confidence as a tool for personal and collective transformation. Marcella Peres is a TBSRJ student passionate about psychology, human behavior, and studies on female self-esteem. Her everyday observations inspired her to explore how societal beliefs shape the way women perceive themselves, and how this impacts their goals, confidence, and emotional well-being. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4162459,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vp53sCE7Wwo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vp53sCE7Wwo/hqdefault.jpg",
        "title": "Why \"Humble\" is Danger For Women And The World | Marcella Peres | TEDxTBSRJ Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:37.226399+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:37:44+00:00",
        "description": "O fotografie face cât o mie de cuvinte, însă fiecare fotografie a Mihaelei vine însoțită de o poveste, uneori, greu de digerat. Frumusețea se ascunde în multe chipuri, iar Mihaela o surprinde și o documentează în cel mai frumos mod posibil Mihaela Noroc a călătorit în peste 100 de țări în ultimii zece ani fotografiind femei din toate mediile sociale. Demersul ei a devenit faimos în întreaga lume și s-a transformat în cărți de succes publicate în mai multe limbi. Proiectul său este un fenomen global prezent în cele mai prestigioase publicații ale lumii precum și în expoziții spectaculoase. Oprah Winfrey, CNN, The Wall Street Journal, The Guardian, Time, Forbes, Elle, RAI, SKY News sunt doar câteva dintre numele mari care au prezentat pe larg Atlasul frumuseții, transformându-l în cel mai mediatizat proiect artistic creat de un român în zilele noastre. După ce a devenit mamă în 2018, Mihaela s-a simțit motivată să-și inspire fiica și a început un nou proiect, în paralel cu Atlasul frumu",
        "id": 4162460,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UgMCbNdVKdA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UgMCbNdVKdA/hqdefault.jpg",
        "title": "Atlasul Frumuseții | Mihaela Noroc | TEDxZorilor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:37.518645+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:37:26+00:00",
        "description": "In this talk, Paola explores how the fast pace of digital life (constant screens, endless stimuli, and instant opinions) reduces our ability to pause, reflect, and be present. She brings a theatre-based perspective to show how mental autonomy can be rebuilt through body awareness, silence, and deep listening. Her talk offers practical tools to reclaim internal space and freedom of thought in an age of hyperconnection. Paola Castilho is a Drama Teacher at TBSRJ, where she leads projects that blend creativity, stage presence, and emotional expression. With years of experience working with teenagers, she uses theatre as a tool for self-awareness, mindful communication, and socio-emotional development. Paola strongly believes in the power of art as a space for reflection, freedom, and humanity, especially in a world that is increasingly fast-paced and digital. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more a",
        "id": 4162461,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pcLTQu7ODhI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pcLTQu7ODhI/hqdefault.jpg",
        "title": "Freedom of Thought in a Digital Era | Paola Castilho | TEDxTBSRJ Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:37.753504+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:37:13+00:00",
        "description": "Paulo breaks down a clear and powerful model for understanding true confidence, not the one built on perfection, but the one grounded in self-knowledge and purpose. He shows how lived experience, identity clarity, and a service-oriented mindset create authentic, impactful communication. His talk reveals that confidence is not innate but cultivated, emerging when our actions align with our values and truth. Paulo Vinnicius is a communication specialist with extensive experience helping individuals speak with clarity, impact, and authenticity. His work blends psychology, speaking techniques, and human development, focusing on unlocking true confidence. Over the years, he has guided professionals, leaders, and students to discover their voice and presence on stage and in daily life. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4162462,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zB1Jy2zwwEA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zB1Jy2zwwEA/hqdefault.jpg",
        "title": "Fale Bem e Se Torne a Pessoa Mais Confiante Que Você Conhece | Paulo Vinnicius | TEDxTBSRJ Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:38.003477+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:36:08+00:00",
        "description": "Exploring this pivotal question, Sindiswa delves into how South Africa's future is being shaped. She shares the importance of societal change and emphasises our own contributions and collective responsibility for a shared vision for a brighter future. Sindiswa is an OD Practitioner who helps leaders and teams co-create workplaces where both people and performance truly matter. After nearly 5 years working abroad, Sindiswa chose to return because South Africa is where her home is. She strengthens workplaces and contributes to youth development. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4162463,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=moKAqTN2KNo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/moKAqTN2KNo/hqdefault.jpg",
        "title": "Who Writes South Africa's Next Chapter? | Sindiswa Calana | TEDxSomerset West",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:38.269577+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:36:00+00:00",
        "description": "This empowering journey as a petite woman in the legal field, who often found herself sidelined and underestimated, relying on others to validate her abilities and ensure she was taken seriously. Through a profound personal breakthrough, she discovered the power of self-love and acceptance. She reveals how she learned to embrace her unique qualities and recognise her worth as an attorney, breaking free from the notion that she needed external validation. She encourages audiences to celebrate their individuality and choose themselves unapologetically. Naazneen's journey is diverse. At the heart of her work is a search for connection - whether through resolving disputes, amplifying stories on air, or unearthing fragments of the past from beneath the ocean's surface. Her most powerful insights come not from titles or achievements, but from navigating the quiet spaces of longing, belonging and identity. This talk was given at a TEDx event using the TED conference format but independently ",
        "id": 4162464,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VlFP_o1EAC4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VlFP_o1EAC4/hqdefault.jpg",
        "title": "The Greatest Love Story: Choose Yourself | Naazneen Khan | TEDxSomerset West",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:38.534931+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:35:14+00:00",
        "description": "In this talk, Filipe shows how polarized conversations about AI, from extreme fear to blind optimism, hide the real transformation already happening in the job market. Using current data and real-world examples, he explains why many entry-level jobs are disappearing and how students can prepare for a future where critical thinking, responsibility, and strategic AI usage are essential. His “Six Guidelines Framework” offers a practical roadmap for thriving in this new reality. Professor Filipe Litaiff is an AI researcher, professor, and expert in emerging technologies and their impact on the economy, work, and education. With years of academic and professional experience, he helps students understand and prepare for the technological realities shaping their future. As a parent in the TBSRJ community, he also witnesses firsthand how AI is already influencing youth development and expectations. This talk was given at a TEDx event using the TED conference format but independently organized",
        "id": 4162465,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DJi-Cp7wj9A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DJi-Cp7wj9A/hqdefault.jpg",
        "title": "Além Do Hype Da IA | Filipe Litaiff | TEDxTBSRJ Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:38.843553+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:34:14+00:00",
        "description": "In her talk, Meyling Tang invites us to view the sea not as a mere resource, but as a vibrant seascape where thousands of fishermen and small-scale aquaculturists nurture traditions, sustainability and culture. \nShe suggests practical steps such as shortening supply chains, educating consumers, incorporating oysters into everyday cuisine, training oyster sommeliers, and innovating with preserves, smoked seafood, and underwater cellars. Above all, she calls for the establishment of an Ibero-American network of women oyster farmers to honour pioneers such as Laurencia de Solminihac. She is a vocal advocate for food sovereignty and coastal heritage. She works to make coastal communities visible, valued and resilient. Meyling Tang has found a bridge to transform realities in gastronomy. Through her work with over 40 artisanal fishing organizations, she promotes fair trade and responsible fishing practices, connecting local communities with kitchens and tables across the country. This talk",
        "id": 4162466,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=V_ftJhJJBUM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/V_ftJhJJBUM/hqdefault.jpg",
        "title": "Bring Back the Oyster Salon | Meyling Tang | TEDxFrutillar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T18:31:39.145944+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:34:06+00:00",
        "description": "A remarkable story of a shark attack survivor. After experiencing a life-altering encounter with a shark, Caleb faced the daunting challenge of overcoming his fears and learning to navigate the profound changes in his life. Drawing from his personal story, he provides practical strategies for facing fear and change. Caleb survived a shark attack in 2015, losing his right leg above the knee. His near death experience 10 years ago has given him a unique perspective of life. He is a storyteller, actor, sportsman and surfer. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4162467,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Fobg7ucfZvQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Fobg7ucfZvQ/hqdefault.jpg",
        "title": "A Survivor's Guide to Navigating Change | Caleb Swanepoel | TEDxSomerset West",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:51.618210+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:22:08+00:00",
        "description": "The speaker promoted the idea of happiness in today's world. Happiness has to be redefined by one to know its whole purpose. She shared the sentiment of encouragement to sustain one's sense of self.  Iman is the current Student Body President for Gems International School. She is interested in studying law upon graduation. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4161795,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mF3l2Jkrgok",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mF3l2Jkrgok/hqdefault.jpg",
        "title": "Redefining Happiness in an Avaricious World | Iman Faiz | TEDxGIS Al Khail Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:51.818116+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:22:00+00:00",
        "description": "Head Girl, Lotus Petal Senior Secondary School. In her talk “Embrace: Two Roads Diverged – Ripples of Choice”, she reflected on expectations, uncertainty, and the power of staying true to oneself, even when the path ahead is unclear.\n Gunjan Gusain is the Head Girl of Lotus Petal Senior Secondary School—a role that reflects her dedication to responsibility, empathy, and student leadership. She stands out not only for her academic diligence but also for her active participation in anchoring, and organizing school-wide events. As a thinker, communicator, and leader, Gunjan uses every platform—be it the school assembly podium or the TEDx stage—to share stories that matter. Her TEDx Talk, Two Roads Diverged: Ripples of Choice, is a candid reflection on the complexity of growing up in a world full of expectations, uncertainty, and invisible pressures.Through her words, Gunjan hopes to inspire her peers to make conscious choices, embrace vulnerability, and realize that leadership also means",
        "id": 4161796,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GiR6uGB5AuY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GiR6uGB5AuY/hqdefault.jpg",
        "title": "Embrace: Two Roads Diverged – Ripples of Choice | Gunjan Gusain | TEDxLotus Petal School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:52.165718+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:21:52+00:00",
        "description": "Lewanna founded CivisMUN and inspired leadership through courage. Her message: “When doors don’t open, build your own and walk through with conviction.” Lewanna Khatana — a 16-year-old high school student, Vice Head Girl at G.D. Goenka Signature School, and Founder of CivisMUN. She is passionate about leadership and youth empowerment. Lewanna has served as the Assistant Director General at Veritas MUN 2.0 and has actively contributed to several leadership initiatives under the Veritas Group. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4161797,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jH72pp2PrE4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jH72pp2PrE4/hqdefault.jpg",
        "title": "The Road Not Taken – From Self-doubt to Self-belief | Lewanna Khatana | TEDxLotus Petal School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:52.354676+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:21:49+00:00",
        "description": "The speaker promoted the idea of looking within, understanding oneself, and answering one's \"why\". \"Their\" purpose. \"Their\" potential and why that potential is valuable, despite background noise (for those with negative opinions) that are irrelevant to one's journey. The \"their\" is YOU.   Zaineb currently serves on the Academic Committee on the Student Executive Leadership Team at Gems International School. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4161798,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=dL6bl7MQg14",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dL6bl7MQg14/hqdefault.jpg",
        "title": "Unlocking Hidden Potential  | Zaineb Zouaoui | TEDxGIS Al Khail Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:52.583269+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:21:35+00:00",
        "description": "Bhavana’s journey from corporate life to Himalayan adventures teaches fearless living. Her mission uplifts caregivers, the invisible heroes behind every dream. \"Bhavana Issar is the Founder and CEO of Caregiver Saathi, a tech-enabled social venture that supports family caregivers in finding balance and peace of mind. A caregiver for over 35 years, she has consulted with the WHO and Stanford University on caregiving and health systems. \nWith nearly 30 years of experience in HR and Organisation Development, Bhavana leads Sambhaavna, her boutique consulting firm focused on innovation, leadership, and culture. A WomenLift Health Global Fellow (2025) and Distinguished Alumna of XLRI Jamshedpur, she is also a visiting faculty at leading Indian institutes.\nA Limca record-holding motorcyclist, Bhavana believes humour and storytelling have the power to heal and transform lives.\nA Limca record-holding motorcyclist, Bhavana believes humour and storytelling have the power to heal and transform li",
        "id": 4161799,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PVgYhvtsH0k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PVgYhvtsH0k/hqdefault.jpg",
        "title": "Offroad Riding, Bumble Flying, and Unscripted Living  | Bhavana Issar | TEDxLotus Petal School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:52.755102+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:21:27+00:00",
        "description": "The speaker promotes self-confidence and authenticity in the face of uncertainty and judgment from others. Ved reinforces the event's theme, \"Power of Why,\" by exploring why society's or communities' opinions do not matter if one is being their true self.  Ved currently serves as a Model United Nations Co-Leader at GIS where he also serves as the Deputy Head for the Student Wellbeing Committee. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4161800,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EsqY81TBv-4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EsqY81TBv-4/hqdefault.jpg",
        "title": "Why do \"they\" even matter?  | Ved Nakhwa | TEDxGIS Al Khail Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:53.102264+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:21:25+00:00",
        "description": "The speaker promotes the idea that one should question the \"why\" when experiencing hesitation or fear amid obstacles. She encourages the act of courage as one fully understands and embraces their \"why\".  Anoushae is a current member of the TEDx at GIS and the Student Executive Leadership Committee (StuELT) in which she serves on the Inclusion Committee This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4161801,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QZXZhORq2a8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QZXZhORq2a8/hqdefault.jpg",
        "title": "Overcoming Fear  | Anoushae Shah | TEDxGIS Al Khail Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:53.512602+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:21:16+00:00",
        "description": "A student of Lotus Petal Senior Secondary School, her talk “The Road Not Taken” narrated personal silent battles and small defining choices, inspiring peers to embrace uncertainty.\n \"Kajal Kumari, a school student exemplifies leadership, discipline, and resilience - qualities she also brings to every stage she steps on. Whether commanding the\nfield or engaging an audience, she leads with quiet strength and conviction. Kajal is not only a graceful dancer and an ever-curious learner but also an active participant in public\nspeaking, debates, anchoring, and various school initiatives. Her commitment to holistic growth is deeply rooted in her school environment, where she has consistently embraced opportunities beyond the classroom. In her TEDx Talk, The Road Not Taken, Kajal shares a powerful personal narrative about the silent battles\nshe has fought, the small but defining choices she has made, and the courage it takes to embrace uncertainty.\nHer story reflects how a young student chose",
        "id": 4161802,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_VcmiRzOFfE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_VcmiRzOFfE/hqdefault.jpg",
        "title": "The Road Not Taken | Kajal Kumari | TEDxLotus Petal School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:53.953573+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:21:08+00:00",
        "description": "Vasav Trehan speaks powerfully about his belief that “opportunities don’t happen—you create them,” drawing from his ongoing journey as a 16-year-old social media influencer. He begins by sharing how he starts creating content out of curiosity and gradually turns it into a purposeful platform that encourages young people to explore internships, certifications and digital opportunities for growth. Through personal anecdotes, practical insights and a relatable storytelling style, Vasav shows how consistency, self-learning and stepping out of one’s comfort zone shape his success. His talk inspires students to take charge of their ambitions and actively create the opportunities they seek. At just 16 years old, Vasav Trehan is already creating ripples in the world of technology and education.\n\nFounder of @technifyedofficial, Vasav is on a mission to bridge the tech education gap — helping students upskill through zero-price courses, certifications, internships, and scholarships that empower",
        "id": 4161803,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NHl9c2Bew1U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NHl9c2Bew1U/hqdefault.jpg",
        "title": "Opportunities don't happen, you create them! | Vasav Trehan | TEDxYouth@AUS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:54.351226+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:21:02+00:00",
        "description": "From childhood trauma to becoming one of India’s first women Naval officers and an Ironman triathlete, her journey exemplifies courage, discipline, and resilience, proving beginnings don’t define stories.\n \"A former Naval officer turned life transformation coach, author, and motivational speaker, Lieutenant Tanuja Sodhi’s journey is one of resilience, reinvention, and purpose. From a timid girl in Agra to being among the first 22 women officers commissioned in the Indian Navy, her story reflects courage and inner strength.\nAfter seven years of service, she transitioned into the world of fitness and holistic wellness — becoming a Reebok-certified fitness coach, nutrition expert, and later, a certified Life and Shadow Mastery Coach. An Ironman triathlete, high-altitude trekker, and author of three books on wellness and parenting, Ms Tanuja continues to inspire individuals through her work.\nTanuja Sodhi’s journey is one of resilience, reinvention, and purpose. From a timid girl in Agra t",
        "id": 4161804,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NhrQXvaTbmc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NhrQXvaTbmc/hqdefault.jpg",
        "title": "Your Beginning isn't the end of your story | Lieutenant Tanuja Sodhi | TEDxLotus Petal School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:54.676490+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:20:55+00:00",
        "description": "The speaker promotes the idea of why and how science is essential, and applies this concept to the TEDx event theme of \"The Power of Why,\" enabling the audience to think about and understand the unexplainable.  Maitreyi works closely with Iman, the student body president of GIS. Maitreyi spearheaded the STEM Debate Club in which she sought the support of Iman. Maitreyi inspires to be a medical doctor. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4161805,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SWyZoqch4wk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SWyZoqch4wk/hqdefault.jpg",
        "title": "The Importance of Scientific Breakthroughs | Maitreyi Singh | TEDxGIS Al Khail Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:55.119580+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:20:46+00:00",
        "description": "Highlighted rural women’s realities in India and showcased how education, skills, and empowerment can transform communities. His message: “When a woman rises, a nation rises.”\n \"Prashant Pal is the Founder & CEO of PURE India Trust, a CSR Coach, LMPian, Author, Motivational Speaker, and NGO & MSME Mentor with 25+ years of corporate and social sector experience. He has worked with leading companies like IBM, Accenture, TATA, Airtel, and Idea before dedicating himself fully to social impact. Under his leadership, PURE India Trust now works across 17 states, empowering 5,600+ women entrepreneurs and guiding 50,000+ students. A Lean Six Sigma MBB and YouTube influencer, he has also trained 3,000+ NGOs and authored two books—100 Career Options and Bano Udyami.\nA Lean Six Sigma MBB and YouTube influencer, he has also trained 3,000+ NGOs and authored two books—100 Career Options and Bano Udyami.\n\" This talk was given at a TEDx event using the TED conference format but independently organized",
        "id": 4161806,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iOteFL3pm60",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iOteFL3pm60/hqdefault.jpg",
        "title": "From Margins to Mainstream - How Women are Empowering Bharat | Prashant Pal | TEDxLotus Petal School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:55.453453+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:20:38+00:00",
        "description": "The speaker promotes the idea that understanding the power of why is essential.  Heba is an up and coming student leader at GIS who is incredibly passionate about the educational and social wellbeing of her peers. Heba's emphasis is on social issues that effect the educational experience of her cohort. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4161807,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Ui59VQmg64M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Ui59VQmg64M/hqdefault.jpg",
        "title": "The Underuse of Why | Heba Elalawi | TEDxGIS Al Khail Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:55.656346+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:20:30+00:00",
        "description": "Spoke on thriving in changing environments, focusing on pacing oneself and adapting to circumstances for sustained growth and well-being.\n \"Dr. Aman Mittal is the Vice President of Lovely Professional University (LPU), one of India’s leading globally recognized universities known for its innovation and transformative approach to education. With over 16 years of experience in education and management, he oversees key areas including International Relations, IT, Marketing, PR, and Entrepreneurship. Under his leadership, LPU has partnered with 50+ international universities and welcomes students from over 70 countries.\nAn engineer from Thapar Institute of Engineering & Technology and an MBA graduate from the University of Southampton, UK, Mr. Aman has driven LPU’s digital transformation into a paperless campus. Recognized with an Honorary Ph.D. from Universidad Azteca, Mexico, he continues to shape education that is globally connected and outcome-driven.\nWith over 16 years of experience ",
        "id": 4161808,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zCPfQSiLzmk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zCPfQSiLzmk/hqdefault.jpg",
        "title": "Thriving in a World That Won't Slow Down | Aman Mittal | TEDxLotus Petal School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-25T17:25:55.852393+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-25T17:20:11+00:00",
        "description": "Vivek emphasized that living well is about inner clarity, real connections, and leaving gentle imprints. His message: choose purpose, love, and understanding every day, even when life feels blurry. \"Mr Vivek Sharma is the Co-founder of Conversations and More, a platform dedicated to helping individuals and organizations align their outer expression with their inner essence. He believes that every human operates through two selves — the outer self that the world sees, and the inner self defined by awareness, stillness, and consciousness. His work bridges the gap between the two, fostering authenticity and mindful leadership.\nAn alumnus of IIM Calcutta and MNIT, he brings over 17 years of global corporate experience from organizations such as SAS, Genpact, and Wipro. Today, he channels that experience into guiding people and workplaces toward deeper connection, clarity, and conscious growth.\nHe believes that every human operates through two selves — the outer self that the world sees, a",
        "id": 4161809,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Y53pb7w2C5k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y53pb7w2C5k/hqdefault.jpg",
        "title": "The Real Risk is Not Switching your Fog Lights On | Vivek Sharma | TEDxLotus Petal School",
        "vote": 0
    }
]