[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T22:08:28.085187+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T21:43:00+00:00",
        "description": "\"For months, a small company in San Francisco has been pursuing a secretive project: the birth of a genetically engineered baby,\" reports the Wall Street Journal:\n\n\n\nBacked by OpenAI chief executive Sam Altman and his husband, along with Coinbase co-founder and CEO Brian Armstrong, the startup &mdash; called Preventive &mdash; has been quietly preparing what would amount to a biological first. They are working toward creating a child born from an embryo edited to prevent a hereditary disease.... Editing genes in embryos with the intention of creating babies from them is banned in the U.S. and many countries. Preventive has been searching for places to experiment where embryo editing is allowed, including the United Arab Emirates, according to correspondence reviewed by The Wall Street Journal... \n\n\nPreventive is in the vanguard of a growing number of startups, funded by some of the most powerful people in Silicon Valley, that are pushing the boundaries of fertility and working to comm",
        "id": 4026737,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/09/2141233/genetically-engineered-babies-are-banned-in-the-us-but-tech-titans-are-trying-to-make-one-anyway",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Genetically Engineered Babies Are Banned in the US. But Tech Titans Are Trying to Make One Anyway",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T21:05:58.578560+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T20:43:00+00:00",
        "description": "After the Python Software Foundation rejected a $1.5 million grant because it restricted DEI activity, \"a flood of new donations followed,\" according to a new report. By Friday they'd raised over $157,000, including 295 new Supporting Members paying an annual $99 membership fee, says PSF executive director Deb Nicholson. \n\n \"It doesn't quite bridge the gap of $1.5 million, but it's incredibly impactful for us, both financially and in terms of feeling this strong groundswell of support from the community.\"\n\n\nCould that same security project still happen if new funding materializes? The PSF hasn't entirely given up. \"The PSF is always looking for new opportunities to fund work benefiting the Python community,\" Nicholson told me in an email last week, adding pointedly that \"we have received some helpful suggestions in response to our announcement that we will be pursuing.\" And even as things stand, the PSF sees itself as \"always developing or implementing the latest technologies for prot",
        "id": 4026403,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/09/2017240/python-foundation-donations-surge-after-rejecting-grant---but-sponsorships-still-needed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Python Foundation Donations Surge After Rejecting Grant - But Sponsorships Still Needed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T20:05:22.357711+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T19:43:00+00:00",
        "description": "Blue Origin is livestreaming the launch of its New Glenn rocketreports CNN, \"where they will investigate why the barren red planet began to lose its atmosphere billions of years ago.\" By observing two Mars locations simultaneously, this mission can measure how Mars responds to space weather in real time &mdash; and how the Martian magnetosphere changes...\n\nCalled EscaPADE, the mission will aim for an orbital trajectory that has never been attempted before, according to aerospace company Advanced Space, which is supporting the project. If successful, it could be a crucial case study that can allow extraordinary flexibility for planetary science missions down the road. The robotic mission plans to spend a year idling in an orbital backroad before heading to its target destination... [R]ather than turning toward Mars, the two orbiters will instead aim for Lagrange Point 2, or L2 &mdash; a cosmic balance point about 1.5 million kilometers (930,000 miles) from Earth. Lagrange points are sp",
        "id": 4026117,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/09/1845207/blue-origin-livestreams-attempt-to-launch-unique-escapade-mission-to-mars",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Blue Origin Livestreams Attempt to Launch Unique ''EscaPADE' Mission to Mars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T22:08:28.522489+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T19:43:00+00:00",
        "description": "UPDATE (1:16 PST) Today's launch has been scrubbed due to weather, and Blue Origin is now reviewing opportunities for new launch windows. \n\n\nSunday Morning Blue Origin livestreamed the planned launch of its New Glenn rocket, which will carry a very unique mission for NASA. \"Twin spacecraft are set to take off on an unprecedented, winding journey to Mars,\" reports CNN, \"where they will investigate why the barren red planet began to lose its atmosphere billions of years ago.\" By observing two Mars locations simultaneously, this mission can measure how Mars responds to space weather in real time &mdash; and how the Martian magnetosphere changes...\n\nCalled EscaPADE, the mission will aim for an orbital trajectory that has never been attempted before, according to aerospace company Advanced Space, which is supporting the project. If successful, it could be a crucial case study that can allow extraordinary flexibility for planetary science missions down the road. The robotic mission plans to",
        "id": 4026738,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/09/1845207/blue-origin-postpones-attempt-to-launch-unique-escapade-orbiters-to-mars",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Blue Origin Postpones Attempt to Launch Unique ''EscaPADE' Orbiters to Mars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T20:05:22.618358+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T19:04:00+00:00",
        "description": "\"According to court filings and interviews with lawyers and scholars, the legal profession in recent months has increasingly become a hotbed for AI blunders,\" reports the New York Times:\n\n\n\n Earlier this year, a lawyer filed a motion in a Texas bankruptcy court that cited a 1985 case called Brasher v. Stewart. Only the case doesn't exist. Artificial intelligence had concocted that citation, along with 31 others. A judge blasted the lawyer in an opinion, referring him to the state bar's disciplinary committee and mandating six hours of A.I. training. \n\n\nThat filing was spotted by Robert Freund, a Los Angeles-based lawyer, who fed it to an online database that tracks legal A.I. misuse globally. Mr. Freund is part of a growing network of lawyers who track down A.I. abuses committed by their peers, collecting the most egregious examples and posting them online. The group hopes that by tracking down the A.I. slop, it can help draw attention to the problem and put an end to it... [C]ourts a",
        "id": 4026118,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/09/189220/ai-slop-in-court-filings-lawyers-keep-citing-fake-ai-hallucinated-cases",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'AI Slop' in Court Filings: Lawyers Keep Citing Fake AI-Hallucinated Cases",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T19:04:33.979460+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T18:04:00+00:00",
        "description": "\"A tape-based piece of unique Unix history may have been lying quietly in storage at the University of Utah for 50+ years,\" reports The Register. And the software librarian at Silicon Valley's Computer History Museum, Al Kossow of Bitsavers, believes the tape \"has a pretty good chance of being recoverable.\"\n\nLong-time Slashdot reader bobdevine says the tape will be analyzed at the Computer History Museum. More from The Register:\n\nThe news was posted to Mastodon by Professor Robert Ricci of the University of Utah's Kahlert School of Computing [along with a picture. \"While cleaning a storage room, our staff found this tape containing #UNIX v4 from Bell Labs, circa 1973...\" Ricci posted on Mastodon. \"We have arranged to deliver it to the Computer History Museum.\"] The nine-track tape reel bears a handwritten label reading: UNIX Original From Bell Labs V4 (See Manual for format)... \n\nIf it's what it says on the label, this is a notable discovery because little of UNIX V4 remains. That's u",
        "id": 4025790,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/09/0528258/lost-unix-v4-possibly-recovered-on-a-forgotten-bell-labs-tape-from-1973",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lost Unix v4 Possibly Recovered on a Forgotten Bell Labs Tape From 1973",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T18:03:58.743021+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T17:04:00+00:00",
        "description": "An anonymous reader shared this report from CNBC:\n\n\n\nNeurodiverse professionals may see unique benefits from artificial intelligence tools and agents, research suggests. With AI agent creation booming in 2025, people with conditions like ADHD, autism, dyslexia and more report a more level playing field in the workplace thanks to generative AI.\n A recent study from the UK's Department for Business and Trade found that neurodiverse workers were 25% more satisfied with AI assistants and were more likely to recommend the tool than neurotypical respondents.\n[The study involved 1,000 users of Microsoft 365 Copilot from October through December of 2024.]\n\n \n\n\"Standing up and walking around during a meeting means that I'm not taking notes, but now AI can come in and synthesize the entire meeting into a transcript and pick out the top-level themes,\" said Tara DeZao, senior director of product marketing at enterprise low-code platform provider Pega. DeZao, who was diagnosed with ADHD as an adul",
        "id": 4025493,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/09/0610228/neurodiverse-professionals-25-more-satisfied-with-ai-tools-and-agents",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Neurodiverse Professionals 25% More Satisfied With AI Tools and Agents",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T15:59:06.982499+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T15:34:00+00:00",
        "description": "A maintainer of Debian's Advanced Package Tool (APT) \"has announced plans to introduce hard Rust dependencies into APT starting May 2026,\" reports the blog It's FOSS.\n\nThe integration targets critical areas like parsing .deb, .ar, and tar files plus HTTP signature verification using Sequoia. [APT maintainer Julian Andres Klode] said these components \"would strongly benefit from memory safe languages and a stronger approach to unit testing.\" \n\nHe also gave a firm message to maintainers of Debian ports: \"If you maintain a port without a working Rust toolchain, please ensure it has one within the next 6 months, or sunset the port.\" \n\n\nThe reasoning is straightforward. Debian wants to move forward with modern tools rather than being held back by legacy architecture... Debian ports running on CPU architectures without Rust compiler support have six months to add proper toolchains. If they can't meet this deadline, those ports will need to be discontinued. As a result, some obscure or legac",
        "id": 4024738,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/11/09/0232234/rust-is-coming-to-debians-apt-package-manager",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rust Is Coming To Debian's APT Package Manager",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T12:56:14.472379+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T12:34:00+00:00",
        "description": "After popular arcade games like Mortal Kombat and Spy Hunter, Midway Games jumped into the home console market, and in 2003 launched their baseball game franchise \"MLB Slugfest\" for Xbox, PS2, and GameCube. But at times it was almost a parody of baseball, including announcers filling the long hours of airtime with bizarre, rambling conversations. (\"I read today that kitchen utensils are gonna hurt more people tonight than lifting heavy objects during the day...\") \n\n\n\nNow former Midway Games producer Mark Flitman has revealed the even weirder conversations rejected by Major League Baseball. (\"Ah, baseball on a sunny afternoon. Is there anything better? We've been talking about breaking pop bottles with rocks. I guess that is...\") The nonprofit Video Game History Foundation published the text in their digital archive &mdash; and shared 79 seconds of sound clips that were actually recorded but never used in the final game. (\"Enjoying some smoked whale meat up here in the booth today...\")",
        "id": 4023657,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/08/2342231/hilarious-unused-audio-from-2003-baseball-game-rediscovered-by-video-game-history-foundation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hilarious Unused Audio From 2003 Baseball Game Rediscovered by Video Game History Foundation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T08:47:53.757040+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T08:34:00+00:00",
        "description": "\"For months, extremely personal and sensitive ChatGPT conversations have been leaking into an unexpected destination,\" reports Ars Technica: the search-traffic tool for webmasters , Google Search Console. \n\nThough it normally shows the short phrases or keywords typed into Google which led someone to their site, \"starting this September, odd queries, sometimes more than 300 characters long, could also be found\" in Google Search Console. And the chats \"appeared to be from unwitting people prompting a chatbot to help solve relationship or business problems, who likely expected those conversations would remain private.\" Jason Packer, owner of analytics consulting firm Quantable, flagged the issue in a detailed blog post last month, telling Ars Technica he'd seen 200 odd queries &mdash; including \"some pretty crazy ones.\" (Web optimization consultant Slobodan Mani&#196; helped Packer investigate...) Packer points out \"nobody clicked share\" or were given an option to prevent their chats fro",
        "id": 4022612,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/09/027213/did-chatgpt-conversations-leak-into-google-search-console-results",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Did ChatGPT Conversations Leak... Into Google Search Console Results?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T04:45:13.867537+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T04:34:00+00:00",
        "description": "The new series from Breaking Bad creator Vince Gilligan, Pluribus, was emphatically made by humans, not AI, reports TechCrunch:\n\n\nIf you watched all the way to the end of the new Apple TV show \"Pluribus,\" you may have noticed an unusual disclaimer in the credits: \"This show was made by humans.\" That terse message &mdash; placed right below a note that \"animal wranglers were on set to ensure animal safety\" &mdash; could potentially provide a model for other filmmakers seeking to highlight that their work was made without the use of generative AI. \n\nIn fact, yesterday the former X-Files writer told Variety \"I hate AI. AI is the world's most expensive and energy-intensive plagiarism machine....\"\n\nHe goes on, about how AI-generated content is \"like a cow chewing its cud &mdash; an endlessly regurgitated loop of nonsense,\" and how the U.S. will fail to regulate the technology because of an arms race with China. He works himself up until he's laughing again, proclaiming: \"Thank you, Silicon",
        "id": 4021808,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/09/047221/breaking-bad-creator-hates-ai-promises-new-show-pluribus-was-made-by-humans",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Breaking Bad' Creator Hates AI, Promises New Show 'Pluribus' Was 'Made By Humans'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T02:40:14.795578+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T02:34:00+00:00",
        "description": "\"The Firefox brand is getting a refresh and you get the first look,\" says a new web page at Firefox.com. \"Kit's our new mascot and your new companion through an internet that's private, open and actually yours.\" \n\n\nSlashdot reader BrianFagioli believes the new mascot \"is meant to communicate that message in a warmer, more relatable way.\" \n\n\nAnd Firefox is already selling shirts with Kit over the pocket (as well as stickers)...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+Firefox+Mascot+'Kit'+Unveiled+On+New+Web+Page%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F08%2F2136253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F11%2F08%2F2136253%2Fnew-firefox-mascot-kit-unveiled-on-new-web-page%3Futm_source%3Dslashdot%26utm_medium%3Dfaceb",
        "id": 4021477,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/08/2136253/new-firefox-mascot-kit-unveiled-on-new-web-page",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Firefox Mascot 'Kit' Unveiled On New Web Page",
        "vote": 0
    }
]