[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T16:21:39.433423+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T16:00:46+00:00",
        "description": "Finally, after years of development and a suite of patches, upgrades, and additions since release, STALKER 2: Heart of Chornobyl is arriving on PlayStation 5, and it's set to launch to Sony’s console in its most definitive version yet. \n\nA blend of realism and radiation, STALKER 2, when launched last year to PC and Xbox, was lauded for its immersion, but the promise of greatness was just out of reach given the spate of bugs. \n\nWell, those issues have been straightened, but in “fixing anomalies” developer GSC Game World has strengthened something more profound: the game’s identity. The game’s inherent mechanics works in-twine with each technical upgrade and additional feature. The result is an open-world shooter of authenticity, and one PS5 players’ will relish when the sequel comes out November 20th.",
        "id": 4024854,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Uo4NriAywKk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Uo4NriAywKk/hqdefault.jpg",
        "title": "STALKER 2 PS5 Will Be Brutal, Merciless, And WILL NOT HOLD YOUR HAND",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-09T14:17:09.348317+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-09T13:30:07+00:00",
        "description": "With Project Motor Racing inching ever closer to its final release, we realized that you might be on the fence about giving in to all the hype surrounding Straight4 Studio's latest racing simulator. \n\nAnd while that's understandable, it's always good to get an objective look at what's on offer and decide if it's the one for you. That's where we come in. We've put together a list of what this one offers, and what you can expect once you get behind the wheel of your favorite car. \n\nThere's a lot for racing enthusiasts to smile about in this game, and if you're one, you might want to dive in sooner rather than later. Here's everything you might want to know before you pick up Project Motor Racing for yourself.",
        "id": 4024057,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=8w_28G_yw5Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8w_28G_yw5Q/hqdefault.jpg",
        "title": "Project Motor Racing - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]