[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.252605+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T18:00:05+00:00",
        "description": "The real reason relationships feel harder than ever isn't because of a gender war - it's because we're navigating modern love with outdated relationship maps designed for function-based, rather than connection-based, partnerships. Kristal DeSantis cuts through the noise of polarizing gender wars to offer modern couples what they really need: a roadmap for building strong, lasting bridges to connection and a shared future of love. Drawing from years of clinical experience, she reveals the “4 S’s of Safety”—Self-Awareness, Stability, Self-Regulation, and Self-Expression—as the essential skills for lasting relationships. Her message is clear: love isn’t luck or chemistry—it’s a skill we can all learn to build deeper, safer, and more authentic connections.\n\nKristal DeSantis is a licensed Marriage and Family Therapist based in Austin, Texas, who specializes in helping individuals and couples build emotionally connected relationships. She is the author of STRONG: A Relationship Field Guide ",
        "id": 4326775,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=4r6zC9BzPrM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4r6zC9BzPrM/hqdefault.jpg",
        "title": "Why unhappy relationships feel so lonely | Kristal DeSantis | TEDxFullerton",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.347824+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:59:30+00:00",
        "description": "When I was nine years old, I lost my best friend. At twenty-one, I lost my dad. Through grief, music, and memory, I discovered the surprising power of nostalgia — not just as a longing for the past, but as a way of choosing hope and healing in the present.\n\nIn this heartfelt TEDx talk, I share stories of love and loss, the songs that carried me through, and why I believe every moment can be prepared as a future memory. Because when we live intentionally, nostalgia doesn’t just look backward — it fuels joy, empathy, and optimism for what’s ahead.\n\n✨ Nostalgia can keep you alive. And glad to be alive.\n\n? Listen to my music: [www.girlnamedtom.com]\n? Follow along: [@girlnamedtom @bekahliechty]\n\n#TEDx #Nostalgia #Healing #Grief #Music #RebekahLiechty Bekah Liechty is a singer and songwriter who shares music with her brothers in the sibling trio Girl Named Tom. After winning NBC’s The Voice as the show’s first-ever group champion, Bekah went from singing in her small hometown of Pettisville",
        "id": 4326776,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EN3OegihA6w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EN3OegihA6w/hqdefault.jpg",
        "title": "Does nostalgia just happen or is it a choice? | Bekah Liechty | TEDxNashvilleWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.435303+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:58:38+00:00",
        "description": "When technology makes something more efficient, it doesn’t just make our lives easier — it reshapes how we act, what we value, and which choices quietly disappear. This talk moves from everyday objects to artificial intelligence to explore how even the simplest tools shape who we become. And as AI becomes more woven into daily life, the values and power of those who build it quietly shape the horizons of our choices With over 20 years of experience in digital transformation in major Norwegian companies, Elisabeth Austad Asser brings a rare combination of technological insight and ethical depth. She holds a PhD in AI and Ethics and is the author of The Power of Technology: How AI Tempts, Seduces and Holds Power — and What We Can Do About It (2025). She has served as Director of Sustainability in one of Norway’s largest banks, working at the intersection of technology, ethics, and societal responsibility. A sought-after speaker and prominent public voice, she contributes actively to nat",
        "id": 4326777,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KSQtNoR84FY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KSQtNoR84FY/hqdefault.jpg",
        "title": "The Quiet Power of AI | Elisabeth Austad Asser | TEDxArendal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.522728+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:57:57+00:00",
        "description": "When words are not enough, rhythm becomes our shared language. Through sound and story, Idd Aziz reveals how music connects us across cultures, identities, and experiences. Idd Aziz is a Kenyan-born singer, songwriter and multi-instrumentalist whose music is rooted in African tradition and shaped by a global journey.\n\nHe began performing at the age of 13 and was touring internationally by 15. Over the years, Idd has developed a unique sound that blends voice, percussion, flute and guitar into powerful, genre-defying performances. His work bridges cultures and connects audiences through rhythm, energy and emotional presence.\n\nWhether on large festival stages or in intimate settings, Idd’s goal remains the same: to use music as a tool for connection, awareness and joy. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326778,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hzKdwIQOrCE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hzKdwIQOrCE/hqdefault.jpg",
        "title": "When Words Fall Short, Rhythm Speaks | Idd Aziz | TEDxArendal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.609474+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:57:25+00:00",
        "description": ": In this entertaining talk, Steven breaks down why accents can make us seem smarter, sillier, sexier — or just totally lost in translation. Through jokes and sharp insight, he shows how the way we sound influences how we’re judged and how we judge others. If you’ve ever felt like a bad Google Translate version of yourself abroad, this one’s for you. Steven is a communicator, creative strategist, and lifelong observer of how language shapes human behavior. He has produced hundreds of videos, coached leaders on how to present themselves online, and worked internationally — from Spain to the United States — where he discovered firsthand how accents transform the way we’re perceived. His work sits at the intersection of identity, culture, and communication, and he brings humor to every stage he steps on. Steven’s accessible style, honest storytelling, and cross-cultural experience make him a trusted guide to understanding the voices we all carry. This talk was given at a TEDx event using",
        "id": 4326779,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6BirG1IDuOg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6BirG1IDuOg/hqdefault.jpg",
        "title": "The Hidden Power of Accents: Identity, Bias & Belonging | Steven Feraru | TEDxArendal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.696809+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:57:24+00:00",
        "description": "Robert Reed explains how diverting waste from landfill and instead composting it is our biggest opportunity to improve the way society handles waste. It positively impacts climate while helping farmers improve their crop yields. Robert Reed is an environmental advocate who serves as a spokesman for Recology, a leader in sustainable waste management and a pioneer in recycling and curbside composting programs.\n\nBefore joining Recology, Robert spent a decade working as a journalist for daily newspapers, earning a California Newspaper Publishers Association Award for his reporting on environmental issues.\n\nSince 1993, Robert has been leading Recology’s outreach and education initiatives, playing a key role in helping San Francisco become the first major city in North America to implement curbside food scrap collection for composting, a program that has the potential to change the way the world does garbage.\n\nRobert has welcomed delegations from more than 135 countries, including governmen",
        "id": 4326780,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GOKGtEAtp9o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GOKGtEAtp9o/hqdefault.jpg",
        "title": "The biggest opportunity in waste | Robert Reed | TEDxSF State",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.783425+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:56:56+00:00",
        "description": "René Konings invites us to pause and rethink our urban environment. Through his exploration of overlooked and discarded materials, he reveals the hidden beauty and potential within them, uncovering stories that are waiting to be told. René Konings is a Norwegian contemporary artist who focuses on transforming overlooked and discarded materials from urban environments into meaningful works of art. By exploring the unnoticed details in our cities, he reveals the hidden stories and beauty that often go unnoticed. His works are like time capsules, reflecting the past while prompting us to engage with the present and future potential of our surroundings. René’s work invites viewers to reconsider their perceptions of value and abundance, emphasizing the potential of what is typically deemed waste. Through beauty, he explores this topic with a commitment to sustainability, encouraging reflection on the relationship between art and the environment. His artistic practice challenges us to see t",
        "id": 4326781,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3r-c_fMg5G0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3r-c_fMg5G0/hqdefault.jpg",
        "title": "The beauty we throw away | René Konings | TEDxArendal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.870862+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:56:45+00:00",
        "description": "Listen to this magical song about The Little Matchgirl, inspired by the Danish author H.C. Andersen’s fairytale. Song performed and written by Victoria Bakka, with contribution from world famous violinist Alexander Rybak. Check out studio version at Spotify or Apple Music. Victoria Bakka is a Norwegian artist and writer/composer. She releases her music through her own label, VSB-Music. She has previously performed on stage with artists such as Sissel Kyrkjebø and Alexander Rybak. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326782,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WaTxsXjO0Q0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WaTxsXjO0Q0/hqdefault.jpg",
        "title": "The Flame – Live on TEDxArendal | Victoria Bakka | TEDxArendal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:38.957095+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:56:38+00:00",
        "description": "Dr. Sue Ann Zachariah sheds light on the suspended lives of the transgender community in India, caught between identity and survival. Her talk challenges the automatic association of transgender lives with sex work and exposes how constant social neglect, exclusion, and silence push many into the margins. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx Dr. Sue Ann Zachariah is a polymath who worked very hard to pave her own path through routes with no support. She completed her MBBS and MD, then continued with a Fellowship in HIV Medicine and a Master’s in Public Health. Working at Government Medical College, Kottayam since 2001, she served as the Medical Officer in charge of the HIV Clinic from 2006 to 2011. She is also an Associate Professor. She has been the Nodal Officer for the Transgender Clinic at Government Medical College, Kottayam since its inception in 2017, which ha",
        "id": 4326783,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZYO_k1lMIoU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZYO_k1lMIoU/hqdefault.jpg",
        "title": "The suspended lives of the Indian transgender community | Dr.Sue Ann Zachariah | TEDxKCMT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:39.043455+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:56:33+00:00",
        "description": "A personal story of a truly active person and a versatile, talented athlete, who was abruptly confronted with a new life. At the beginning of his rehabilitation, he couldn't eat independently and needed help scratching his head. Despite all the limitations and obstacles, he found a way to enjoy sports that were not imaginable for a long time. A truly active person and a versatile, talented athlete, who was abruptly confined to a wheelchair by an accident during his physical education teacher training, resulting in tetraplegia. A wheelchair user who, despite the associated limitations and obstacles, can be found on the ski slopes, kitesurfing, driving a car, and even partying in large crowds. A lateral thinker who, regardless of any doubts, pursued his goal and today teaches young people as a physical education teacher at a vocational school. A fighter who, at the beginning of his rehabilitation, couldn't eat independently and needed help scratching his head, but who is now an importan",
        "id": 4326784,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=M_DavfaeD5Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/M_DavfaeD5Y/hqdefault.jpg",
        "title": "If you can't walk, try flying | David Mzee | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:39.137798+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:56:33+00:00",
        "description": "What do motorcycles, the Moon landing and modern technology have in common? They all began with people willing to ride into the unknown, long before the path was clear. This talk introduces a practical Moonshot framework that helps us navigate uncertainty and build the future we actually want. Yngvar Ugland is a bold innovator who blends analytical depth with creative flair. As head of DNB’s NewTechLab and Innovation & Science Fellow, he pushes boundaries through tech, curiosity, and collaboration. With a background in mathematics and global leadership — and a twist as a stand-up comedian — he turns complex ideas into inspiring stories.\n\nHe’s currently pursuing an Industry PhD in Artificial Intelligence and has served as Industry Professor II at NHH. In 2023, he was nominated “Nordic AI Influencer of the Year,” and in 2024, named “Nordic AI Professional of the Year” and featured on the cover of the Top 100 Nordics in AI magazine.\n\nYngvar is also the author of several books, most recen",
        "id": 4326785,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=RU_9Z8786tk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RU_9Z8786tk/hqdefault.jpg",
        "title": "Why you should ride into the unknown | Yngvar Ugland | TEDxArendal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:39.265834+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:56:16+00:00",
        "description": "What is the meaning of life? In this talk I clarify the question and provide an answer, applicable to all of us, independent of place and time.  Einar Duenger Bøhn is professor of philosophy and multi artist. He has published several articles, books, podcast-series and music, as well as exhibited drawings and paintings. He is also a regular guest on both national radio and TV in Norway. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326786,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KFR2ZaGCQGA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KFR2ZaGCQGA/hqdefault.jpg",
        "title": "What is the meaning of life? | Einar Duenger Bøhn | TEDxArendal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:39.511824+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:56:02+00:00",
        "description": "In his talk, Isa Zuhrić challenges the way leadership is commonly defined and celebrated, arguing that leadership is not a title, position, or badge but a shared purpose in action. Speaking to a generation frequently told to “be leaders” without being taught what leadership truly means, he reflects on how the pursuit of roles and recognition can distract from impact and meaning. Isa Zuhrić is a youth leader, entrepreneur, and student actively engaged in civic development and community empowerment. He serves as President of his local Council of Youth and as Curator of the Global Shapers Community Sarajevo, where he works on initiatives that strengthen youth participation, leadership, and local impact. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326787,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wMxlWZdtfGo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wMxlWZdtfGo/hqdefault.jpg",
        "title": "Why - the most important question for a leader | Isa Zuhric | TEDxSarajevo Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:39.685489+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:55:57+00:00",
        "description": "In her talk, Nina Pavićević challenges common stereotypes and misconceptions about feminism by reframing it not as a modern or imported ideology, but as a deeply rooted part of local history, family memory, and everyday life. Beginning with the discomfort that often follows the word “feminist,” she exposes how feminism is frequently misunderstood, dismissed, or reduced to appearance and labels. Nina Pavićević is a content creator and social commentator best known for Kritički, a platform dedicated to examining socially relevant topics such as feminism, mental health, and media literacy. Through direct and thoughtful conversations, her work frequently extends beyond digital spaces, sparking wider public debate and collective reflection across the region. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326788,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Bl8LZn8o2b0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Bl8LZn8o2b0/hqdefault.jpg",
        "title": "The feminism we inherit | Nina Pavicevic | TEDxSarajevo Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:09:39.836112+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:55:49+00:00",
        "description": "In this warm and personal talk, Babang Deshommes shares his passion for FPV drone flying, and tells his story. It is a story of persistence, and how technology can open the doors to new experiences, education, and personal growth. Babang Deshommes is a content creator, cinematographer and certified UAS operator (EASA Specific Category), specializing in FPV drone flight and cinematic storytelling. Born in Haiti and now based in Northern Norway, Babang developed his drone practice after moving to Tromsø and discovering the stark beauty of arctic landscapes. He brings together adrenaline, precision, and artistry. His FPV work, free from camera stabilization gizmos, pushes boundaries, capturing raw motion and emotional depth at speeds and angles most cameras can’t. His award-winning videos have transformed how we see mountains, fjords and skies, and his mission is to let audiences experience flight like a bird, not just observe landscapes, but feel them from within. This talk was given at",
        "id": 4326789,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hroOQXoTV2Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hroOQXoTV2Y/hqdefault.jpg",
        "title": "How FPV Drones Changed My Life | Babang Deshommes | TEDxArendal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:31.308627+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:58:01+00:00",
        "description": "For quite some time now I have been grappling with the realization that the privileges I hold in this life (my education, my freedom, my rights as a woman) all came from a roll of the dice: my family's socioeconomic status, as well as the wealth of the nation I was born into, dictated countless opportunities in my life. It is apparent that the line between what is a fair capitalist society and what is a bewildering, unjust gap between the top and the bottom has been crossed: yet, few people speak about it. The financial inequality in this world isn't often heard of, but is instead commonly accepted, as if it were merely a part of reality to come to terms with. Over the course of my speech, I aim to firstly expose the audience to the true staggering scale of the differences in wealth: stunning the audience at the start of my speech with this will hook them to my talk. Furthermore, I want to delve into the root causes of financial inequality, and how we as a society have come to this re",
        "id": 4326073,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=v1Lb__a9KFg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/v1Lb__a9KFg/hqdefault.jpg",
        "title": "A System Based on Luck | Aurora Ruotolo | TEDxAOSR Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:31.439454+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:57:02+00:00",
        "description": "Мы часто стремимся к успеху, забывая о себе. Ернар Аккисев и Амина Алибек расскажут, как забота о себе — это не слабость, а ключ к устойчивости. Их история о простых, но мощных инструментах восстановления. \n Директор частной школы\n\nУченица 10 класса частной школы This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326074,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IED459AHJ7o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IED459AHJ7o/hqdefault.jpg",
        "title": "Не выгорать, а восстанавливаться | Ернар Аккисев & Амина Алибекова | TEDxQuantum STEM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:31.536762+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:56:41+00:00",
        "description": "Как понять, что в вашей жизни нужно что-то изменить? Модель и блогер Азхар Кунболат рассказывает о своем пути от юриспруденции к творчеству и о том, что заниматься только любимым делом — это не вопрос смелости, а необходимость. Как понять, что в своей жизни пора что-то менять?\nМодель и блогер Ажар Күнболат расскажет о своём пути от юриспруденции к творчеству и о том, почему заниматься тем, что тебе действительно нравится, — не смелость, а необходимость. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326075,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SXnCXgxKnZs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SXnCXgxKnZs/hqdefault.jpg",
        "title": "Смелость быть собой | Ажар Кунболат | TEDxQuantum STEM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:31.631921+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:56:33+00:00",
        "description": "Қазақстанда шығармашылықты дамыту үшін не істеу керек? Өнер кеңістіктері жастардың әлеуетін ашуға қалай көмектеседі? Ақын, продюсер, ÖzgeEpic өнер кеңістігінің негізін қалаушысы Мақпал Жұмабай бізбен өз ойын бөліседі! \n Ақын, продюсер This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326076,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jflc-KHbsAU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jflc-KHbsAU/hqdefault.jpg",
        "title": "Өнер арқылы өсу: шығармашылық кеңістіктердің маңызы | Макпал Жумабай | TEDxQuantum STEM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:31.728065+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:56:15+00:00",
        "description": "Как спорт, материнство и работа в библиотеке связаны между собой? Асемгуль Темирханова – мастер спорта по грэпплингу и джиу-джитсу, библиотекарь и мама – расскажет, как дисциплина и self-care помогают находить баланс. Мастер спорта по грэпплингу и джиу-джитсу, библиотекарь This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326077,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cKIeEB4Q3CQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cKIeEB4Q3CQ/hqdefault.jpg",
        "title": "Искусство держать баланс | Асемгуль Темирханова | TEDxQuantum STEM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:31.823569+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:56:01+00:00",
        "description": "In my talk, I want to offer insights into my work as a drag cow and invite the audience to question their own view of humanity as the center of the universe. In the talk, I want to use humor and sharp arguments to convince people to acknowledge that we humans inflict terrible violence on billions of non-human animals on the planet, be it through factory farming, habitat destruction, or the climate and biodiversity crisis. I want to invite people to truly feel the associated pain and then open up the possibility that things could be different: wild forests instead of monocultures, coexistence instead of conflict, caressing instead of slaughter. The talk is intended to stir emotions, move people, and call them to action. Soy the cow is an artist, musician, activist, and, full-time, a drag cow. With his artistic persona Soya the Cow, he creates plays, song recitals, art walks, music videos, and exhibitions, and he performs on stages, at festivals, street protests, and on TV shows. Soya t",
        "id": 4326078,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ivOlQZl2IQI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ivOlQZl2IQI/hqdefault.jpg",
        "title": "Your humanity is killing us | Soya the cow | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:31.919124+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:55:46+00:00",
        "description": "The talk takes on one of the biggest challenges of our time: The crisis in healthcare. A strong believer that the accelerating wave of digitalization is a defining turning point, Eve discusses that we now have a once-in-a-generation opportunity to create the care we all deserve — a truly human-centered healthcare system that treats people, not just illnesses.  Eve Huber, a clinical neuroscientist, business facilitator and high performance coach, has spent her career moving between the many worlds of global healthcare — from hospitals and research labs, to insurance, pharma, and the start-up world. Alongside her current role as Director of Strategy & Marketing Neuroscience in Global Healthcare, she co-founded a coaching and leadership company 7 years ago — driven by a deep curiosity for people and what truly sparks change This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326079,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=yJbCjdM-2ME",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yJbCjdM-2ME/hqdefault.jpg",
        "title": "A human-centric future for healthcare | Eve Huber | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:32.013046+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:55:38+00:00",
        "description": "The very nature of our bodies triggers reactions and enables experiences that can only be had in the specific body with which we traverse the world. Machines cannot have such experiences; they are disembodied. Simone worked in international cooperation for fifteen years. Her professional stations included working for a small local NGO in Kenya, for a large humanitarian mission by the United Nations for Somalia, and finally at the Swiss embassies in Azerbaijan and Ghana. Through her journey she witnessed the destructive power of poverty, hunger, discrimination and conflict. But she also met the most incredible people who displayed hope, resilience and wisdom no matter how hostile the world around them appeared. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326080,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hZO98IqRxio",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hZO98IqRxio/hqdefault.jpg",
        "title": "The white pig | Simone Haeberli | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:32.109222+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:55:30+00:00",
        "description": "Technology can change our lives for the better. But we shouldn't wait for it or expect it to happen; instead, we should find our own way. In his talk, Christof points out his personal experience of the importance of actively seeking solutions rather than waiting for a change Christof Roosli is an ENT specialist at the ENT Department at the University Hospital in Switzerland. Besides his clinical work, he leads a research group working on the topic of Bone Conduction Hearing, but also on Cochlear implantation and Middle ear Mechanics. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326081,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qqubfGgY8S4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qqubfGgY8S4/hqdefault.jpg",
        "title": "Breaking the Silence | Christof Röösli | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:32.214682+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:54:19+00:00",
        "description": "Как наука объясняет развитие детей с раннего возраста? Алтынай Бектемирова, эксперт в дошкольном образовании, и ее юный сын Самир расскажут, как создать среду, в которой дети растут счастливыми и любознательными.  Эксперт в дошкольном образовании This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326082,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BEkrEJHKu8w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BEkrEJHKu8w/hqdefault.jpg",
        "title": "как вырастить любознательного ребенка | Алтынай Бектемирова | TEDxQuantum STEM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:32.327599+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:52:20+00:00",
        "description": "Иногда жизнь бросает нам вызовы, и не всегда всё идёт по плану. В такие моменты особенно важно не ломаться, а учиться быть гибким — как ветка, которая сгибается, но не ломается. Cпикер — ученик, который размышляет о том, почему умение адаптироваться сегодня важнее, чем когда-либо. Он поделится своими мыслями о внутренней силе, умении меняться и сохранять себя в мире, который постоянно меняется.  Ученик 10 класса частной школы This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326083,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jUt243_txic",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jUt243_txic/hqdefault.jpg",
        "title": "Искусство быть гибким | Жанибек Ахметов | TEDxQuantum STEM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:32.432805+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:52:12+00:00",
        "description": "Прошлое — это не просто набор дат, а мост между поколениями. Как история помогает нам понять себя и свое место в мире?  Учитель Истории\n\nУченик 11 класса частной школы This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326084,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9ziBhDF8Nfc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9ziBhDF8Nfc/hqdefault.jpg",
        "title": "История как мост между поколениями | Динара Судейменова & Арсен Сарман | TEDxQuantum STEM Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:32.539588+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:50:27+00:00",
        "description": "He discussed that we should always do that work which we love to do , which help us do the community service and which help us earn the money and respect we want in our life , he explained that we should always do what makes us happy Ozair (famously known as @ozairarts) is a Pakistani content creator, photographer, filmmaker and traveler who is active on social media under the handle “ozairarts.” He shares visual content (photography, videos, travel, and creative work) and is known for exploring nature, adventure, people, and storytelling through his posts. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4326085,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8--AME21pKc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8--AME21pKc/hqdefault.jpg",
        "title": "When Passion Becomes Purpose | Ozair Khan | TEDxIMSciences",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:32.642848+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:50:18+00:00",
        "description": "A trip around the world to show how travelling can change your perspective  Hi everyone, my  name is Amali- Im 14 and i come from Australia. My family comes from America, Australia and Sri Lanka so we've always been pretty international. I've lived in Monaco for nearly five years and I have 2 younger siblings and a dog called Olly. In my free time, I enjoy reading, writing, listening to or playing music and drawing. I play tennis and like horse riding as well, though only casually. Ive been doing Tedx for around 4 years now, i've been both an MC and a speaker, and am still loving it! Team Alicia is wonderfully fun and I find that TedX helps me be more natural, assertive and confident in my daily life. As well as this, I like having my voice heard and writing and presenting speeches makes me feel as if i have the power to make an impact, even if only a small one... for now! This talk was given at a TEDx event using the TED conference format but independently organized by a local commun",
        "id": 4326086,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=-2E_OONN78U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-2E_OONN78U/hqdefault.jpg",
        "title": "A Travelogue on Perspective | Amali Benner | TEDxYouth@ISMonaco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:58:32.756853+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:49:50+00:00",
        "description": "In his TED Talk, Mr. Sushil Reddy takes the audience through his remarkable journeys on solar and electric vehicles, blending personal experiences with powerful technical insights. He explains how clean energy, electric mobility, and innovative engineering can become practical, scalable solutions for a sustainable future. Through real-life challenges faced on the road, he inspires listeners to rethink technology not just as advancement, but as a responsibility towards the planet.\n An engineer by education and an environmentalist by conviction, Mr. Sushil Reddy is on an extraordinary journey, quite literally — to spread the light of sustainability across the world.As the Founder of The SunPedal Ride, he has cycled and driven across thousands of kilometres to ignite conversations on clean energy and electric mobility. An alumnus of IIT Bombay and HEC Paris, where he earned his Master’s in Sustainability and Social Innovation, Mr. Reddy masterfully fuses engineering with empathy, science",
        "id": 4326087,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=-rdxQiJG_9w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-rdxQiJG_9w/hqdefault.jpg",
        "title": "One Man. One Cycle. One Powerful Purpose. | Mr. Sushil Reddy | TEDxSunbeam Lahartara Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:44.211978+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:55:26+00:00",
        "description": "La psicòloga i sexòloga Emma Ribas aborda amb naturalitat i ciència la connexió entre ment, cos i plaer. Explica com l’estrès, la pressa i els mites afecten la vida sexual i com el mindfulsex pot ajudar-nos a recuperar la presència i la intimitat. Defensa que el plaer no es busca, s’habita. \n\nAmb exemples clínics i un llenguatge proper, trenca tabús i mostra com la neurociència avala el poder de la presència. La seva ponència és una invitació a viure el sexe amb consciència, respecte i autenticitat. L’Emma és docent a les Facultats de Psicologia i Medicina i compta amb més de vint anys d’experiència combinant consulta, docència i divulgació. És pionera i referent internacional en Mindfulsex, un mètode que integra la pràctica de la consciència plena amb la sexualitat per millorar la relació amb el cos i el plaer.\n\nAl llarg de la seva trajectòria ha ajudat centenars de persones a transformar la seva vida sexual des de la responsabilitat i l’autenticitat, i ha portat les seves reflexions",
        "id": 4325504,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SfuCrf-sb10",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SfuCrf-sb10/hqdefault.jpg",
        "title": "Quan el cervell entra al llit | Emma Ribas | TEDxIgualada",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:44.333065+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:54:54+00:00",
        "description": "La terapeuta Remei Capitán ens fa reflexionar sobre la manera com acomiadem els éssers estimats i sobre la necessitat de recuperar rituals humans, propers i significatius. \n\nAmb sensibilitat i experiències reals, denuncia la fredor dels funerals actuals i defensa els homenatges personalitzats com a actes d’amor i sanació. Proposa repensar la mort des del respecte, la comunitat i la gratitud. \n\nLa seva veu connecta dol, vida i esperança. Remei ens recorda que acomiadar-se no és un final: és una manera de tancar amb pau i estimar amb plenitud. Després de més de 20 anys com a directiva de banca, la Remei va decidir escoltar la seva vocació: ajudar les persones en un dels moments més difícils de la vida, la mort, i va fundar Agraïments, un projecte d’acompanyament al dol amb seu a Balaguer. Formada amb un màster en Counseling i Intervenció en Dol, Pèrdues i Trauma, ofereix eines terapèutiques i cerimònies laiques personalitzades que converteixen el comiat en un acte de reconeixement i ser",
        "id": 4325505,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=td_zF_A0imM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/td_zF_A0imM/hqdefault.jpg",
        "title": "El meu comiat ideal | Remei Capitan | TEDxIgualada",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:44.421169+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:52:42+00:00",
        "description": "Nghệ thuật từ lâu đã giữ vai trò đặc biệt trong đời sống con người. Nghệ thuật là ngôn ngữ của cảm xúc, là phương tiện để con người thể hiện bản sắc cá nhân và kết nối với người xung quanh. Dù qua âm nhạc, hội họa, múa hay điện ảnh, nghệ thuật giúp chúng ta cảm nhận thế giới sâu sắc hơn và tìm thấy sự đồng điệu trong khác biệt. Nhưng điều gì sẽ xảy ra khi ta nhìn nghệ thuật qua lăng kính của người khiếm thính, những người không nghe được âm thanh nhưng lại “nghe” bằng mắt, bằng nhịp điệu của chuyển động và cảm xúc? Với bài nói “Vai trò của nghệ thuật đối với người khiếm thính”, diễn giả Nguyễn Thị Ngọc Anh - Đại diện dự án \"Nghe bằng Mắt\" mang đến góc nhìn chân thực từ chính cộng đồng người điếc. Qua đó, khán giả nhận ra rằng nghệ thuật không chỉ được nghe, mà còn được cảm bằng cả trái tim.\n\nDisclaimer: Do một số trục trặc kỹ thuật không mong muốn, video bài nói có một chút gián đoạn ở khoảng từ 4:30 đến hết video. BTC TEDxULIS 2025 thành thật xin lỗi tới quý khán giả và hi vọng sẽ nh",
        "id": 4325506,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IRgnGAEjl1Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IRgnGAEjl1Y/hqdefault.jpg",
        "title": "Vai trò của nghệ thuật đối với người Điếc | Ngọc Anh Nguyễn Thị | TEDxULIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:44.508987+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:51:13+00:00",
        "description": "We often chase others for love and comfort, but we forget that true peace can only come from within.\n\nIn this talk, Phương Linh offers a profound perspective on the human journey of connecting with the inner self. From days filled with pressure and loneliness on the university campus, Linh learned how to “befriend” her emotions, whether joy, sadness, or exhaustion, and came to realize that every shade of emotion deserves to be valued.\n\nAt times, in an effort to conceal loneliness amid the hurried pace of life, we hastily cloak ourselves in a radiant mask of positivity. Yet for Phương Linh, it is precisely the muted tones of confusion, of fatigue, and of quiet pauses that mark the true beginning of growth. For only by daring to pass through the darker regions of our emotional landscape can we learn to understand, accept, and rediscover inner peace.\n\n#TEDxULIS 2025 #Prism Trần Phương Linh is a second-year student at the University of Languages and International Studies - Vietnam Nationa",
        "id": 4325507,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2PDBexXRV60",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2PDBexXRV60/hqdefault.jpg",
        "title": "The Art of Blending | Phương Linh Trần | TEDxULIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:44.596497+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:50:52+00:00",
        "description": "Nước là khởi nguồn của sự sống, là dòng chảy nuôi dưỡng mọi sinh vật và kết nối con người với tự nhiên. Từ những con sông uốn lượn nuôi dưỡng nền văn minh, đến những giọt mưa khơi gợi thi hứng và ký ức, nước luôn hiện diện như một phần không thể tách rời trong đời sống tinh thần của chúng ta. Với bài nói “Sống và nghĩ như nước”, diễn giả Đặng Thị Thái Hà sẽ nhìn nước qua lăng kính lịch sử, văn học và văn hóa, để khám phá cách con người đã cảm nhận và đối xử với nước qua thời gian. Qua đó, người nghe được mời gọi cảm nhận nước không chỉ là vật chất, mà là một sinh thể có quyền sống.\n\n#TEDxULIS 2025 #Prism Đặng Thị Thái Hà is a researcher at the Institute of Literature, Vietnam Academy of Social Sciences, and a lecturer in Ecocriticism and Gender Studies at the Creative Writing - Journalism Department, Hanoi University of Culture. Her research centers on contemporary Vietnamese literature from gendered and ecological perspectives, with a particular interest in how the human body is repr",
        "id": 4325508,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Z3-ahEk7qFo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z3-ahEk7qFo/hqdefault.jpg",
        "title": "Sống và nghĩ như nước | Thái Hà Đặng Thị | TEDxULIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:44.695524+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:50:25+00:00",
        "description": "Sự ghen tị - một cảm giác thường thấy trong cuộc sống chúng ta - được diễn giả Nguyễn Đình An (TikToker Ngan) khai thác trải nghiệm cá nhân khi từng ghen tị với bạn bè và ngược lại, từ đó nhìn nhận lại cảm xúc này dưới một lăng kính tích cực hơn. Anh cho rằng ghen tị không phải là điều xấu, mà là tín hiệu cho thấy ta thực sự khao khát điều gì và có thể biến nó thành động lực để hoàn thiện bản thân. Thông điệp trung tâm được anh nhấn mạnh là: “Thành công của người khác không phải là mối đe dọa của bạn”, qua đó khuyến khích người nghe thay đổi góc nhìn, nhìn nhận cảm xúc tiêu cực bằng tư duy phản biện và lòng chân thành với chính mình.\n\n#TEDxULIS 2025 #Prism Nguyễn Đình An (TikToker Ngan) is a content creator who has amassed hundreds of thousands of followers and tens of millions of likes on his TikTok channel. He has been recognized by the media as one of the Gen Z figures “shaking up the online world,” noted for his positive energy, relatable content structure, and natural approach to",
        "id": 4325509,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1hbndfFrchY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1hbndfFrchY/hqdefault.jpg",
        "title": "Biến cảm giác ghen tị thành một “ly nước chanh” | Đình An Nguyễn | TEDxULIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:44.796190+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:50:02+00:00",
        "description": "Giữa nhịp sống hối hả của thành phố hiện đại, tiếng cười và trò chơi của trẻ em dường như ngày càng bị thu hẹp bởi những bức tường bê tông. ‘Được chơi’ là một quyền cơ bản của mỗi trẻ. Khi được chơi, trẻ em có cơ hội học hỏi và kết nối với thế giới - một điều đang dần trở thành điều xa xỉ trong đô thị. Ở bài nói “Quyền được chơi và trẻ em thành phố”, diễn giả - kiến trúc sư Nguyễn Tiêu Quốc Đạt - đồng sáng lập của Think Playgrounds sẽ nhìn đô thị qua lăng kính của trẻ em, để thấy những góc nhìn hồn nhiên nhưng sâu sắc về không gian sống, tự do và hạnh phúc. Qua đôi mắt trẻ thơ, thành phố không chỉ là nơi ở mà còn là nơi sáng tạo và nuôi dưỡng ước mơ, nếu người lớn biết lắng nghe và trao lại cho trẻ em quyền được là chính mình.\n\n#TEDxULIS 2025 #Prism Nguyễn Tiêu Quốc Đạt is an urban spaces architect and the co-founder of Think Playgrounds (Nghĩ về sân chơi trong thành phố), an organization dedicated to designing and building sustainable playgrounds, community gardens, and public spaces",
        "id": 4325510,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2ShrIWrsuek",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2ShrIWrsuek/hqdefault.jpg",
        "title": "Quyền được chơi và trẻ em thành phố | Quốc Đạt Nguyễn Tiêu | TEDxULIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:44.932132+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:49:42+00:00",
        "description": "Nhan Phan reflects on his journey growing up with computers as creative companions rather than mere tools. He critiques how technology has evolved from spaces of imagination to systems of passive consumption, and introduces the idea of poetic technology - using computation as a medium for emotion, reflection, and human connection. Through examples like “Để quá khứ (sẽ tiếp diễn)” - a system that lets trees “write” poems from their shadows, and the Vietnamese Syllable Keyboard that reimagines how Vietnamese words are formed, he illustrates how art and coding can merge to express empathy, identity, and cultural abundance. Ultimately, he calls for a rethinking of our relationship with machines: not as efficient, commercial tools, but as poetic instruments that slow us down, make us feel, and reconnect us with our humanity.\n\n#TEDxULIS 2025 #Prism Nhân Phan is a multidisciplinary artist whose practice explores the human dimensions of technology. His works and projects question the nature o",
        "id": 4325511,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vnZzkwcM9xc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vnZzkwcM9xc/hqdefault.jpg",
        "title": "A Search for a Poetic Technology | Nhân Phan | TEDxULIS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:45.159241+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:48:30+00:00",
        "description": "Elevating Through Resilience President of the ITE College Central Gavel Club, a Toastmasters-affiliated platform that develops public speaking, communication, and leadership skills among students.\n\nFrom the Normal Technical stream, her story reflects perseverance, determination, and the ability to rise above challenges. \n\nHer journey demonstrates how setbacks can be turned into opportunities for personal growth and leadership. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4325512,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ilnwauu7faQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ilnwauu7faQ/hqdefault.jpg",
        "title": "TEDxITE College Central Youth, 30 Oct 25 Speaker 3 | Gnanisha Dinesh | TEDxITE College Central Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:45.302213+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:48:18+00:00",
        "description": "Elevating Confidence from the Heart A sought-after celebrity stylist- in the fashion and media circuits. Styled for local and international artistes (Frances Yip, The Corrs, David Foster, Vanness Wu, and wife of an Aerosmith member).\n \nEarned a Special Prize at the Tokyo E Toco 50th Anniversary Hair Competition, remaining the only non-Japanese ever to receive such recognition.\n\nHis lifelong passion mirrors a powerful and purposeful theme. With deep experience in workshops and media engagement, Dave delivers insights with clarity, authenticity, and resonance. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4325513,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KXaGrQEhQ7o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KXaGrQEhQ7o/hqdefault.jpg",
        "title": "TEDxITE College Central Youth Thu, 30 Oct 25. Speaker 2 | Dave Teng | TEDxITE College Central Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:45.628390+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:47:59+00:00",
        "description": "Elevating from the Heart...My Transformative Journey Named one of the Top 10 PSB Academy Singapore Alumni Leaders (2023) by CEO Insights Asia, highlighting his trajectory as an emerging leader in digital marketing and content creation.\n\nHis journey began at age 17 when he lost 70 kg through diet, inspiring him to share his story online via vlogs, blogs, and social media platforms.\n\nHe built a reputation for promoting 'good content' over perfection; a philosophy that encourages rapid, effective communication and authentic storytelling in the digital space. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4325514,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hO4NA7XIn00",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hO4NA7XIn00/hqdefault.jpg",
        "title": "TEDxITE College Central Youth Thu, 30 Oct 25. Speaker 1 | Movint Rao | TEDxITE College Central Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:45.872010+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:46:47+00:00",
        "description": "What if the way we’ve learned to care is the very reason so many of us are burning out? In her compelling talk, Michelle Warneke reveals the surprising science behind three different ways of caring — and why only one of them protects us while the others quietly drain us. After a career as an international model and a life-altering accident, she rebuilt her life from scratch as a nurse and researcher, to uncover the truth about something we think we all understand: How we care for others. With humor, science and lived experience, Michelle offers a deeply human framework — so we can all Master the art of caring without breaking. Once an international model and actress — living every little girls wildest dream — Until life handed her a plot twist no script had prepared her for. Two years as a hospital patient turned her world upside down and set her on an unexpected path: Into science, and the soul of warm caregiving. Today, Michelle is an ambitious nurse, researcher, and advocate for a ",
        "id": 4325515,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SiZ0Tv8GKF8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SiZ0Tv8GKF8/hqdefault.jpg",
        "title": "The art of caring without breaking | Michelle Warneke | TEDxHarderwijk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:46.049807+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:46:40+00:00",
        "description": "Autism occurs in about one to one-and-a-half percent of people worldwide. In the Netherlands, however, eight percent of boys aged 15 to 25 believe they are autistic. We also see that psychologists increasingly receive the question whether their client might be on the autism spectrum. Why is this assumption made so quickly?\n\nOne relevant development is that, in recent years, autism has increasingly been viewed through the lens of neurodiversity—having a differently wired brain—rather than as a disorder. For people with autism, this is a positive, respectful, and inclusive way of thinking. Yet this shift has also made autism an appealing label for other groups: for young people searching for their identity, and for adults struggling with trauma or personality-related issues.\n\nThis trend perhaps says even more about our current society—one in which many people feel unseen and unheard. And within that lies the key to what we can do collectively. Let’s start looking out for each other agai",
        "id": 4325516,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FuUp4Fcwcus",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FuUp4Fcwcus/hqdefault.jpg",
        "title": "Doe mij ook zo'n diagnose | Annelies Spek | TEDxHarderwijk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:46.277847+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:46:16+00:00",
        "description": "What happens to young girls when we don’t talk openly about their bodies? And what happens when commerce fills that silence with misinformation and fear?\n\nIn this talk, Marije Wielenga explores how a persistent taboo around vaginal health is passed down from generation to generation. Through a disarming anecdote about a conversation with her mother-in-law, a sexual health doctor, she shows how simple honesty can be—and how powerful its impact is.\n\nShe exposes how young girls grow up with misconceptions, unrealistic ideals, and so-called personal hygiene products that often do more harm than good. Marije advocates breaking this taboo and fostering open conversations about vaginal health, so girls can understand their bodies without shame and without misleading marketing.\n\nWith her background as a presentation coach and former Dutch speech champion, Marije combines sharp insights with accessible storytelling. Her message reaches girls, parents, and anyone who wants to help build a gener",
        "id": 4325517,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mHA-nhPTVsQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mHA-nhPTVsQ/hqdefault.jpg",
        "title": "Krijg het maar over je lippen | Marije Wielenga | TEDxHarderwijk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:57:46.478263+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:46:04+00:00",
        "description": "\"Minke challenges you to look beyond the price tag. When we recognize the true value of materials and people today, we can create a better world for tomorrow. A world where nothing and no one is treated as worthless.\n\n \n\nMinke is a product designer and social entrepreneur. Every day, she works on circular and social solutions to the major challenges we face as a society, such as resource scarcity and declining social cohesion. Minke shows that the solution doesn't have to be complicated. Everything we need for this circular and social world already exists. We just need to rethink it. Everyone can take a first step today zo that together, we can create a circular and social world for tomorrow.\" \n\n  Ik ben ervan overtuigd dat een schone wereld met eerlijke kansen voor iedereen mogelijk is. Maar hiervoor is het wel nodig dat we anders gaan kijken naar onze grondstoffen en naar elkaar. Soms denk ik dat we als samenleving zijn vergeten wat werkelijk van waarde is - waarde die we niet meer ",
        "id": 4325518,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=z8e6QlH8fNE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z8e6QlH8fNE/hqdefault.jpg",
        "title": "A worth(less) talk? Looking beyond the pricetag | Minke Terwel | TEDxHarderwijk",
        "vote": 0
    }
]