[
    {
        "age": null,
        "album": "",
        "author": "Russell Brand",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T21:19:40.275133+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T21:11:19+00:00",
        "description": "The language of masks and “stopping the spread” returns, not as public health but as a ritual of control, replaying the same moral coercion that defined the pandemic years. As flu replaces COVID and institutions resurrect old scripts, buried conflicts of interest, silenced ethics advisers, and pharmaceutical entanglements resurface, exposing how fear was weaponised to justify authority. What once passed as care now looks like conditioning, as legacy media and public bodies rehearse obedience while insisting nothing has been learned.\n[UNPACKED]\n\nGo to https://rumble.com/premium/BRAND and join the movement.\n\nENTER THE REBORN GIVEAWAY — I’ve partnered with Reborn for a massive giveaway where you can win a Jeep Wrangler Rubicon 392 plus $10,000 cash. I actually use several of their products myself — the Methylene Blue Tincture, Methylene Blue Capsules, Bovine Colostrum, and Creatine Powder — and all of those count as bonus-entry items if you grab them through the giveaway page.\nEnter here",
        "id": 4328379,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=mP6dgkmKuFU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 286,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCswH8ovgUp5Bdg-0_JTYFNw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mP6dgkmKuFU/hqdefault.jpg",
        "title": "Now We Know What They're About To Do...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Russell Brand",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T21:19:40.547651+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T20:36:38+00:00",
        "description": "Go to http://rumble.com/premium/brand and use code BRAND to save $10 on your annual subscription\n \n⏰ BE HERE AT 12PM PT / 3PM EST / 8PM GMT ⏰\n \nJoin us here for a PREVIEW of our daily one-hour RUMBLE show. \nTo continue watching the show in full, join me exclusively over on RUMBLE: https://bit.ly/SF663-live\n\n\nIn today’s show, I look at three pressure points converging at once: a renewed push to revive pandemic-era controls as masks, mandates, and unanswered conflicts of interest re-enter the public conversation; a growing confrontation between Elon Musk and European authorities over censorship, fines, and who gets to decide what speech is permissible online; and mounting questions around Ukraine, as corruption allegations, financial accountability, and Western political narratives collide around Zelensky’s leadership. Taken together, these stories reveal a wider pattern of institutional power being reasserted — through public health, digital regulation, and foreign war — and raise unco",
        "id": 4328380,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=tHhxgZ23_Us",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 286,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCswH8ovgUp5Bdg-0_JTYFNw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tHhxgZ23_Us/hqdefault.jpg",
        "title": "The Return of Control: From Lockdowns to Censorship to War - SF663",
        "vote": 0
    }
]