[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T23:55:30.597227+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T23:20:00+00:00",
        "description": "An anonymous reader quotes a report from the Wall Street Journal: JPMorgan Chase is joining the list of traditional financial firms seeking to bring blockchain technology to an investing staple: the money-market fund. The banking giant's $4 trillion asset-management arm is rolling out its first tokenized money-market fund on the Ethereum blockchain. JPMorgan will seed the fund with $100 million of its own capital, and then open it to outside investors on Tuesday. Called My OnChain Net Yield Fund, or \"MONY,\" the private fund is supported by JPMorgan's tokenization platform, Kinexys Digital Assets, and will be open to qualified investors, or individuals with at least $5 million in investments and institutions with a minimum of $25 million. The fund has a $1 million investment minimum.\n \nWall Street has waded deeper into tokenization since the passage of the Genius Act earlier this year. The landmark measure, which establishes a regulatory framework for tokenized dollars known as stablec",
        "id": 4329401,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/15/2139238/jpmorgan-steps-further-into-crypto-with-tokenized-money-fund",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "JPMorgan Steps Further Into Crypto With Tokenized Money Fund",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T22:47:31.507695+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T22:40:00+00:00",
        "description": "Merriam-Webster crowned \"slop\" its 2025 Word of the Year, reflecting growing public awareness and and fatigue around low-quality, AI-generated content flooding the internet. \"It's such an illustrative word,\" said Greg Barlow, Merriam-Webster's president. \"It's part of a transformative technology, AI, and it's something that people have found fascinating, annoying and a little bit ridiculous.\" The Associated Press reports: \"Slop\" was first used in the 1700s to mean soft mud, but it evolved more generally to mean something of little value. The definition has since expanded to mean \"digital content of low quality that is produced usually in quantity by means of artificial intelligence.\" In other words, \"you know, absurd videos, weird advertising images, cheesy propaganda, fake news that looks real, junky AI-written digital books,\" Barlow said. \"Words like 'ubiquitous,' 'paradigm,' 'albeit,' 'irregardless,' these are always top lookups because they're words that are on the edge of our lex",
        "id": 4329037,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/15/2133250/merriam-websters-2025-word-of-the-year-is-slop",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Merriam-Webster's 2025 Word of the Year Is 'Slop'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T22:47:31.883228+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T22:00:00+00:00",
        "description": "Ford has effectively pulled the plug on the all-electric F-150 Lightning, pivoting away from full-size BEV pickups toward hybrids, range-extended EVs (EREVs), and even data-center battery storage. Ars Technica reports: Ford's announcements today can't be said to have come out of the blue. Rumors of the F-150's demise have been circulating for more than a month, and last week SK On ended its joint venture with Ford that was building a pair of EV battery plants in Kentucky and Tennessee. We learned then that Ford would keep the Kentucky plant and SK On gets the one in Tennessee, which would focus on the energy storage business instead. Now, we know that something similar will happen at the Kentucky plant -- Ford says it's spending $2 billion to convert the factory to make prismatic lithium iron phosphate (LFP) cells.\n \nThose aren't destined for EVs, but they are the preferred cell format for data centers, Ford says. The company says that it will bring the factory online in the next 18 m",
        "id": 4329038,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/15/2127228/ford-ends-f-150-lightning-production-starts-battery-storage-business",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ford Ends F-150 Lightning Production, Starts Battery Storage Business",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T21:45:42.058231+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T21:23:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Several dozen people protested on Sunday in the Siberian city of Tomsk against Russia's ban on U.S. children's gaming platform Roblox, a rare show of public dissent as popular irritation over the ban gains some momentum. In wartime Russia, censorship is extensive: Moscow blocks or restricts social media platforms such as Snapchat, Facebook, Instagram, WhatsApp and YouTube while distributing its own narrative through a network of social media and Russian media. Russia's communications watchdog Roskomnadzor said on December 3 it had blocked Roblox because it was \"rife with inappropriate content that can negatively impact the spiritual and moral development of children.\"\n \nIn Tomsk, 2,900 km (1,800 miles) east of Moscow, several dozen people braved the snow to hold up hand-drawn placards reading \"Hands off Roblox\" and \"Roblox is the victim of the digital Iron Curtain\" in Vladimir Vysotsky Park, according to photographs provided by an orga",
        "id": 4328541,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/15/2121240/russian-ban-on-roblox-gaming-platform-sparks-rare-protest",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russian Ban On Roblox Gaming Platform Sparks Rare Protest",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T20:40:40.620845+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T20:05:00+00:00",
        "description": "A Kansas man who sued Verizon in small claims court after the carrier refused to unlock his iPhone has won his case, scoring a small but meaningful victory against a company that retroactively applied a policy change to deny his unlock request. \n\nPatrick Roach bought a discounted iPhone 16e from Verizon's Straight Talk brand in February 2025, intending to pay for one month of service before switching the device to US Mobile. Under FCC rules dating back to a 2019 waiver, Verizon must unlock phones 60 days after activation on its network. Verizon refused to unlock the phone, citing a new policy implemented on April 1, 2025 requiring \"60 days of paid active service.\" \n\nRoach had purchased his device over a month before that policy took effect. Magistrate Judge Elizabeth Henry ruled in October 2025 that applying the changed terms to Roach's earlier purchase violated the Kansas Consumer Protection Act. The court ordered Verizon to refund Roach's $410.40 purchase price plus court costs. Roa",
        "id": 4328029,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/15/190217/verizon-refused-to-unlock-mans-iphone-so-he-sued-the-carrier-and-won",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Verizon Refused To Unlock Man's iPhone, So He Sued the Carrier and Won",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T19:30:28.083882+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T19:24:00+00:00",
        "description": "One of the most water-scarce regions on Earth is now experiencing a dramatic atmospheric shift that's pushing moisture onto Oman's northern coast at rates more than 1.5 times the global average, according to a Washington Post investigation of global atmospheric data [non-paywalled source]. The change has turned extreme rainfall into a recurrent source of catastrophe across the Arabian Peninsula. In the 126 years between 1881 and 2007, just six hurricane-strength storms hit Oman or came within 60 miles of the country. At least four more have made landfall in the past 15 years alone. \n\nResearch from Sultan Qaboos University analyzing 8,000 storms across 69 rainfall stations found that half of all rain in Oman falls within the first 90 minutes of a 24-hour storm. These intense bursts quickly overwhelm the desert's ability to absorb water and send flash floods racing through wadis -- normally dry riverbeds where many communities are built. In response, Dubai is constructing an $8 billion ",
        "id": 4327590,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/15/1850220/why-floods-threaten-one-of-the-driest-places-in-the-world",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Floods Threaten One of the Driest Places in the World",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T19:30:28.179518+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T18:45:00+00:00",
        "description": "Cloudflare's sixth annual Year in Review report describes an internet increasingly shaped by two forces: automated traffic and government intervention, as global connectivity grew 19% year over year in 2025. \n\nGoogle's web crawler now dominates automated traffic, dwarfing other AI and indexing bots to become the single largest source of bot activity on the web. Nearly half of all major internet disruptions globally were linked to government actions, and civil society and non-profit organizations became the most attacked sector for the first time. \n\nPost-quantum encryption crossed a significant threshold, now protecting 52% of human internet traffic observed by Cloudflare. The company also recorded more than 25 record-breaking DDoS attacks throughout the year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Cloudflare+Reveals+How+Bots+and+Governments+Reshaped+the+Internet+in+2025%3A+https%3A%2F%2Ftech.slashdot.org%2Fs",
        "id": 4327591,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/15/1830212/cloudflare-reveals-how-bots-and-governments-reshaped-the-internet-in-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cloudflare Reveals How Bots and Governments Reshaped the Internet in 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:28:58.983863+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T18:06:00+00:00",
        "description": "Google has decided to retire its free dark web monitoring tool, saying it wasn't as helpful as the company hoped. From a report: In a support page, Google announced the discontinuation of the \"dark web report\" tool, two years after offering it as a free perk to Gmail users before expanding it more broadly. The feature worked by scanning for your email addresses to determine whether they had appeared in data breaches, which often circulate on Dark Web marketplaces. The tool could then alert you about where the data was exposed, including any accompanying details such as dates of birth, addresses, and phone numbers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+To+Retire+'Dark+Web+Report'+Tool+That+Scanned+for+Leaked+User+Data%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F12%2F15%2F186244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class",
        "id": 4327034,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/15/186244/google-to-retire-dark-web-report-tool-that-scanned-for-leaked-user-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google To Retire 'Dark Web Report' Tool That Scanned for Leaked User Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T18:28:59.213124+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T17:21:00+00:00",
        "description": "The Trump administration announced Monday the United States Tech Force, a new program to recruit around 1,000 technologists for two-year government stints starting as soon as March -- less than a year after dismantling several federal technology teams and driving thousands of tech workers out of their jobs. \n\nThe program will primarily recruit early-career software engineers and data scientists, paying between $150,000 and $200,000 annually. About 20 companies have signed on to participate, including Palantir, Meta, Oracle and Elon Musk's xAI. Some engineering managers will be allowed to take leaves of absence from their private-sector employers to join the program without divesting their stock holdings. \n\nThe initiative follows the March closure of 18F, General Services Administration's internal tech consultancy, and the shuttering of the Social Security Administration's Office of Transformation in February. The IRS had lost over 2,000 tech workers by June.<p><div class=\"share_submis",
        "id": 4327035,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/15/1648225/us-tech-force-aims-to-recruit-1000-technologists",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Tech Force Aims To Recruit 1,000 Technologists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T17:20:18.243002+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:40:00+00:00",
        "description": "For decades, Parkinson's disease research has overwhelmingly focused on genetics -- more than half of all research dollars in the past two decades flowed toward genomic studies -- but a growing body of evidence now points to something far more mundane as a primary culprit: contaminated drinking water. \n\nA landmark study by epidemiologist Sam Goldman compared Marines stationed at Camp Lejeune in North Carolina, where trichloroethylene (TCE) had contaminated the water supply for approximately 35 years, against those at Camp Pendleton in California, which has clean water. Marines exposed to TCE at Lejeune were 70% more likely to develop Parkinson's. \n\nThe latest research suggests only 10 to 15 percent of Parkinson's cases can be fully explained by genetics. Parkinson's rates in the US have doubled in the past 30 years -- a pattern inconsistent with an inherited genetic disease. The EPA moved to ban TCE in December 2024. The Trump administration moved to undo the ban in January.<p><div cl",
        "id": 4326395,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/15/1550214/scientists-thought-parkinsons-was-in-our-genes-it-might-be-in-the-water",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Thought Parkinson's Was in Our Genes. It Might Be in the Water",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:19:06.371446+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T16:00:00+00:00",
        "description": "Sixty years after a team of American and Indian climbers abandoned a plutonium-powered generator on the slopes of Nanda Devi, one of the world's most forbidding Himalayan peaks, the U.S. government still refuses to acknowledge that the mission ever happened. The device, a SNAP-19C portable generator containing plutonium isotopes including Pu-239 -- the same material used in the Nagasaki bomb -- was left behind in October 1965 when a sudden blizzard forced climbers to retreat from Camp Four, just below the summit. \n\nThe mission originated from a cocktail party conversation between General Curtis LeMay and National Geographic photographer Barry Bishop, who had summited Everest in 1963. China had just detonated its first atomic bomb in October 1964, and the CIA wanted to intercept radio signals from Chinese missile tests by placing an unmanned listening station atop the Himalayas. Barry Bishop recruited elite American climbers and coordinated with Indian intelligence to haul surveillance",
        "id": 4325801,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/15/1541213/how-did-the-cia-lose-a-nuclear-device",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Did the CIA Lose a Nuclear Device?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T16:19:06.533894+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T15:21:00+00:00",
        "description": "Grid constraints that were once a hallmark of developing economies are now plaguing the world's richest nations, and new research from Bloomberg Economics finds that rising electricity system stress is directly hurting investment. The analysis examined all G20 countries and found that a one-standard-deviation increase in grid stress relative to a country's historical average lowers the investment share of GDP by around 0.33 percentage points -- a 1.5% to 2% hit to capital outlays. \n\nThe Netherlands is a case in point: 12,000 businesses are waiting for grid connections, congestion issues are expected to persist for a decade despite $9.4 billion in annual investments, and the country is already consuming as much electricity as was projected for 2030. ASML, the chip equipment maker whose fortunes can sway the Dutch economy, has no guarantee it will secure power for a new campus planned to employ 20,000 people. \n\nData centers are particularly affected. Google canceled plans near Berlin, a",
        "id": 4325802,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/15/1511233/electricity-is-now-holding-back-growth-across-the-global-economy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Electricity Is Now Holding Back Growth Across the Global Economy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:13:00.865438+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T14:40:00+00:00",
        "description": "LG smart TV owners discovered over the weekend that a recent webOS software update had quietly installed Microsoft Copilot on their devices, and the app cannot be uninstalled. Affected users report the feature appears automatically after installing the latest webOS update on certain models, sitting alongside streaming apps like Netflix and YouTube. \n\nLG's support documentation confirms that certain preinstalled or system apps can only be hidden, not deleted. At CES 2025, LG announced plans to integrate Copilot into webOS as part of its \"AI TV\" strategy, describing it as an extension of its AI Search experience. The current implementation appears to function as a shortcut to a web-based Copilot interface rather than a native application. Samsung TVs include Google's Gemini in a similar fashion. Users wanting to avoid the feature entirely are left with one option: disconnecting their TV from the internet.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" hr",
        "id": 4325097,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/15/1430224/lgs-software-update-forces-microsoft-copilot-onto-smart-tvs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LG's Software Update Forces Microsoft Copilot Onto Smart TVs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T15:13:01.042477+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T14:01:00+00:00",
        "description": "The Black Hat Europe hacker conference in London included a session titled \"Don't Judge an Audiobook by Its Cover\" about a two critical (and now fixed) flaws in Amazon's Kindle. The Times reports both flaws were discovered by engineering analyst Valentino Ricotta (from the cybersecurity research division of Thales), who was awarded a \"bug bounty\" of $20,000 (&pound;15,000 ).\n\n\n\n\n\nHe said: \"What especially struck me with this device, that's been sitting on my bedside table for years, is that it's connected to the internet. It's constantly running because the battery lasts a long time and it has access to my Amazon account. It can even pay for books from the store with my credit card in a single click. Once an attacker gets a foothold inside a Kindle, it could access personal data, your credit card information, pivot to your local network or even to other devices that are registered with your Amazon account.\" \n\nRicotta discovered flaws in the Kindle software that scans and extracts info",
        "id": 4325098,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/15/0833242/security-researcher-found-critical-kindle-vulnerabilities-that-allowed-hijacking-amazon-accounts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Security Researcher Found Critical Kindle Vulnerabilities That Allowed Hijacking Amazon Accounts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T09:16:19.928435+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T08:34:00+00:00",
        "description": "Superintelligence has become \"a quasi-political forecast\" with \"very little to do with any scientific consensus, emerging instead from particular corridors of power.\" That's the warning from James O'Sullivan, a lecturer in digital humanities from University College Cork. In a refreshing 5,600-word essay in Noema magazine, he notes the suspicious coincidence that \"The loudest prophets of superintelligence are those building the very systems they warn against...\" \n\n\"When we accept that AGI is inevitable, we stop asking whether it should be built, and in the furor, we miss that we seem to have conceded that a small group of technologists should determine our future.\" (For example, OpenAI CEO Sam Altman \"seems determined to position OpenAI as humanity's champion, bearing the terrible burden of creating God-like intelligence so that it might be restrained.\")\n\n\n\nThe superintelligence discourse functions as a sophisticated apparatus of power, transforming immediate questions about corporate ",
        "id": 4322696,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/15/0812238/are-warnings-of-superintelligence-inevitability-masking-a-grab-for-power",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are Warnings of Superintelligence 'Inevitability' Masking a Grab for Power?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T06:02:22.053058+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T05:24:00+00:00",
        "description": "\"A SpaceX executive says a satellite deployed from a Chinese rocket risked colliding with a Starlink satellite,\" reports PC Magazine:\n\nOn Friday, company VP for Starlink engineering, Michael Nicolls, tweeted about the incident and blamed a lack of coordination from the Chinese launch provider CAS Space. \"When satellite operators do not share ephemeris for their satellites, dangerously close approaches can occur in space,\" he wrote, referring to the publication of predicted orbital positions for such satellites... \n\n[I]t looks like one of the satellites veered relatively close to a Starlink sat that's been in service for over two years. \"As far as we know, no coordination or deconfliction with existing satellites operating in space was performed, resulting in a 200 meter (656 feet) close approach between one of the deployed satellites and STARLINK-6079 (56120) at 560 km altitude,\" Nicolls wrote... \"Most of the risk of operating in space comes from the lack of coordination between satel",
        "id": 4321898,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/15/033255/spacex-alleges-a-chinese-deployed-satellite-risked-colliding-with-starlink",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SpaceX Alleges a Chinese-Deployed Satellite Risked Colliding with Starlink",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T03:55:57.015166+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T03:24:00+00:00",
        "description": "Roomba manufacturer iRobot filed for bankruptcy today, reports Bloomberg. \n\n\nAfter 35 years, iRobot reached a \"restructuring support agrement that will hand control of the consumer robot maker to Shenzhen PICEA Robotics Co, its main supplier and lender, and Santrum Hong Kong Compny.\"\n\nUnder the restructuring, vacuum cleaner maker Shenzhen PICEA will receive the entire equity stake in the reorganised company... The plan will allow the debtor to remain as a going concern and continue to meet its commitments to employees and make timely payments in full to vendors and other creditors for amounts owed throughout the court-supervised process, according to an iRobot statement... he company warned of potential bankruptcy in December after years of declining earnings. \n\nRoomba says it's sold over 50 million robots, the article points out, but earnings \"began to decline since 2021 due to supply chain headwinds and increased competition. \n\n\"A hoped-for by acquisition by Amazon.com in 2023 colla",
        "id": 4321421,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/15/0152212/roomba-maker-irobot-files-for-bankruptcy-after-35-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Roomba Maker 'iRobot' Files for Bankruptcy After 35 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T01:49:10.482625+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T01:24:00+00:00",
        "description": "\"As Australia began enforcing a world-first social media ban for children under 16 years old this week, Denmark is planning to follow its lead,\" reports the Associated Press, \"and severely restrict social media access for young people.\"\n\nThe Danish government announced last month that it had secured an agreement by three governing coalition and two opposition parties in parliament to ban access to social media for anyone under the age of 15. Such a measure would be the most sweeping step yet by a European Union nation to limit use of social media among teens and children. \n\n\nThe Danish government's plans could become law as soon as mid-2026. The proposed measure would give some parents the right to let their children access social media from age 13, local media reported, but the ministry has not yet fully shared the plans... [A] new \"digital evidence\" app, announced by the Digital Affairs Ministry last month and expected to launch next spring, will likely form the backbone of the Dani",
        "id": 4320931,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/15/0120247/like-australia-denmark-plans-to-severely-restrict-social-media-use-for-teenagers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Like Australia, Denmark Plans to Severely Restrict Social Media Use for Teenagers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-15T00:36:55.593416+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-15T00:17:00+00:00",
        "description": "The Wall Street Journal reports that 68% of CEOs \"plan to spend even more on AI in 2026, according to an annual survey of more than 350 public-company CEOs from advisory firm Teneo.\"\n\n\nAnd yet \"less than half of current AI projects had generated more in returns than they had cost, respondents said.\"\n\n They reported the most success using AI in marketing and customer service and challenges using it in higher-risk areas such as security, legal and human resources. \n\n\nTeneo also surveyed about 400 institutional investors, of which 53% expect that AI initiatives would begin to deliver returns on investments within six months. That compares to the 84% of CEOs of large companies &mdash; those with revenue of $10 billion or more &mdash; who believe it will take more than six months. \n\nSurprisingly, 67% of CEOs believe AI will increase their entry-level head count, while 58% believe AI will increase senior leadership head count. \n\n\nAll the surveyed CEOS were from public companies with revenue",
        "id": 4320654,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/15/0013251/ceos-plan-to-spend-more-on-ai-in-2026---despite-spotty-returns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CEOS Plan to Spend More on AI in 2026 - Despite Spotty Returns",
        "vote": 0
    }
]