[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T23:13:00+00:00",
        "description": "New submitter CInder123 shares a report from TechSpot: Apple is undertaking one of the most significant software overhauls in its history, aiming to revamp the user interface across iPhone, iPad, and Mac devices. This ambitious update, set for release later this year, will fundamentally transform the look and feel of Apple's operating systems, enhancing consistency and the user experience.\n \nThe updates are part of iOS 19 and iPadOS 19, codenamed \"Luck,\" and macOS 16, dubbed \"Cheer,\" according to Bloomberg's Mark Gurman. He cited sources who requested anonymity since the project has yet to be officially announced. These major upgrades will introduce a new design language while simplifying navigation and controls. Apple's push for consistency across platforms aims to create a seamless user experience when switching between devices. Currently, applications, icons, and window styles vary significantly across macOS, iOS, and visionOS, leading to a disjointed experience.<p><div class=\"sha",
        "id": 2308733,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/12/2026229/apple-set-to-unveil-boldest-software-redesign-in-years-across-entire-ecosystem?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Set To Unveil Boldest Software Redesign In Years Across Entire Ecosystem",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T23:13:00+00:00",
        "description": "An anonymous reader quotes a report from the EFF: EFF is deeply saddened to learn of the passing of Mark Klein, a bona fide hero who risked civil liability and criminal prosecution to help expose a massive spying program that violated the rights of millions of Americans. Mark didn't set out to change the world. For 22 years, he was a telecommunications technician for AT&amp;T, most of that in San Francisco. But he always had a strong sense of right and wrong and a commitment to privacy. When the New York Times reported in late 2005 that the NSA was engaging in spying inside the U.S., Mark realized that he had witnessed how it was happening. He also realized that the President was not telling Americans the truth about the program. And, though newly retired, he knew that he had to do something. He showed up at EFF's front door in early 2006 with a simple question: \"Do you folks care about privacy?\"\n \nWe did. And what Mark told us changed everything. Through his work, Mark had learned t",
        "id": 2308732,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/12/2127218/mark-klein-att-whistleblower-who-revealed-nsa-mass-spying-has-died?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mark Klein, AT&amp;T Whistleblower Who Revealed NSA Mass Spying, Has Died",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T22:07:58+00:00",
        "description": "Intel has appointed Lip-Bu Tan as its new CEO in an effort to turn around the struggling chipmaker, following the resignation of Pat Gelsinger. CNBC reports: Tan was previously CEO of Cadence Design Systems, which makes software used by all the major chip designers, including Intel. He was an Intel board member but departed last year, citing other commitments. Tan replaces interim co-CEOs David Zinsner and MJ Holthaus, who took over in December when former Intel CEO Patrick Gelsinger was ousted. Tan is also rejoining Intel's board. [...] Intel shares rose over 12% in extended trading on Wednesday.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel+Appoints+Lip-Bu+Tan+As+CEO%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F12%2F2118219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%",
        "id": 2308314,
        "language": null,
        "link": "https://slashdot.org/story/25/03/12/2118219/intel-appoints-lip-bu-tan-as-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Appoints Lip-Bu Tan As CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T21:02:28+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Wednesday, Google DeepMind announced two new AI models designed to control robots: Gemini Robotics and Gemini Robotics-ER. The company claims these models will help robots of many shapes and sizes understand and interact with the physical world more effectively and delicately than previous systems, paving the way for applications such as humanoid robot assistants. [...] Google's new models build upon its Gemini 2.0 large language model foundation, adding capabilities specifically for robotic applications. Gemini Robotics includes what Google calls \"vision-language-action\" (VLA) abilities, allowing it to process visual information, understand language commands, and generate physical movements. By contrast, Gemini Robotics-ER focuses on \"embodied reasoning\" with enhanced spatial understanding, letting roboticists connect it to their existing robot control systems. For example, with Gemini Robotics, you can ask a robot to \"pick u",
        "id": 2307887,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/12/2018222/googles-new-robot-ai-can-fold-delicate-origami-close-zipper-bags?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's New Robot AI Can Fold Delicate Origami, Close Zipper Bags",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T21:02:28+00:00",
        "description": "The abstract of a paper published on National Bureau of Economic Research: We document that, after remaining almost constant for almost 30 years, real labor productivity at U.S. restaurants surged over 15% during the COVID pandemic. This surge has persisted even as many conditions have returned to pre-pandemic levels. Using mobile phone data tracking visits and spending at more than 100,000 individual limited service restaurants across the country, we explore the potential sources of the surge. \n\nIt cannot be explained by economies of scale, expanding market power, or a direct result of COVID-sourced demand fluctuations. The restaurants' productivity growth rates are strongly correlated, however, with reductions in the amount of time their customers spend in the establishments, particularly with a rising share of customers spending 10 minutes or less. The frequency of such 'take-out' customers rose considerably during COVID, even at fast food restaurants, and never went back down. Th",
        "id": 2307888,
        "language": null,
        "link": "https://slashdot.org/story/25/03/12/1839244/the-curious-surge-of-productivity-in-us-restaurants?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Curious Surge of Productivity in US Restaurants",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T19:57:53+00:00",
        "description": "D-Wave researchers have published findings in Science demonstrating what they call \"quantum supremacy\" by showing their quantum annealers can solve problems beyond the reach of classical computers. The team, led by Andrew D. King, demonstrated area-law scaling of entanglement in model quench dynamics of two-, three- and infinite-dimensional spin glasses. \n\nThe research shows quantum annealers rapidly generating samples that closely match solutions to the Schrodinger equation, supporting observed stretched-exponential scaling in matrix-product-state approaches. According to the paper, D-Wave's processors completed these magnetic materials simulations in under 20 minutes, while the same calculations would require nearly a million years on Oak Ridge National Laboratory's supercomputers. \n\nThe claim hasn't gone unchallenged. Miles Stoudenmire from the Flatiron Institute's Center for Computational Quantum Physics argues that classical computers can achieve comparable results using methods",
        "id": 2307368,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/12/1835207/d-wave-claims-quantum-supremacy-beating-traditional-computers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "D-Wave Claims 'Quantum Supremacy,' Beating Traditional Computers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T18:53:23+00:00",
        "description": "Global sales of smartwatches have fallen for the first time, new figures indicate, in large part due to a sharp decline in the popularity of market leader, Apple. From a report: Market research firm Counterpoint says 7% fewer of the devices were shipped in 2024 compared to the year before. Shipments of Apple Watches fell by 19% in that period, Counterpoint says. It blames the slump on a lack of new features in Apple's latest devices, and the fact a rumoured high-end Ultra 3 model never materialised.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Global+Smartwatch+Sales+Fall+For+First+Time%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F12%2F1710248%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F12%2F1710248%2Fglobal-smartwatch-sales",
        "id": 2306706,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/12/1710248/global-smartwatch-sales-fall-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Global Smartwatch Sales Fall For First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T18:53:23+00:00",
        "description": "Several Asian airlines have tightened restrictions on portable battery chargers amid growing concerns about fire risks, following a January blaze that destroyed an Air Busan aircraft in South Korea. South Korean airlines now require passengers to keep portable chargers within arm's reach rather than in overhead bins, a rule implemented March 1 to ease public anxiety, according to the Transportation Ministry. Taiwan's EVA Air and China Airlines have banned using or charging power banks on flights but still allow them in overhead compartments. \n\nThai Airways announced a similar ban last Friday, citing \"incidents of in-flight fires on international airlines.\" Battery-related incidents on U.S. airlines have increased from 32 in 2016 to 84 last year, with portable chargers identified as the most common culprit, according to Federal Aviation Administration data. The International Civil Aviation Organization has banned lithium-ion batteries from cargo holds since 2016, though no industry st",
        "id": 2306705,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/12/1717207/rules-for-portable-batteries-on-planes-are-changing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Rules for Portable Batteries on Planes Are Changing.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T17:46:31+00:00",
        "description": "An anonymous reader quotes a report from The Register: New York State has sued Allstate Insurance for operating websites so badly designed they would deliver personal information in plain-text to anyone that went looking for it. The data was lifted from Allstate's National General business unit, which ran a website for consumers who wanted to get a quote for a policy. That task required users to input a name and address, and once that info was entered, the site searched a LexisNexis Risk Solutions database for data on anyone who lived at the address provided. The results of that search would then appear on a screen that included the driver's license number (DLN) for the given name and address, plus \"names of any other drivers identified as potentially living at that consumer's address, and the entire DLNs of those other drivers.\"\n \nNaturally, miscreants used the system to mine for people's personal information for fraud. \"National General intentionally built these tools to automatica",
        "id": 2306024,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/11/225252/allstate-insurance-sued-for-delivering-personal-info-in-plaintext?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Allstate Insurance Sued For Delivering Personal Info In Plaintext",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T17:46:31+00:00",
        "description": "Amazon, Alphabet's Google and Meta Platforms on Wednesday said they support efforts to at least triple nuclear energy worldwide by 2050. From a report: The tech companies signed a pledge first adopted in December 2023 by more than 20 countries, including the U.S., at the U.N. Climate Change Conference. Financial institutions including Bank of America, Goldman Sachs and Morgan Stanley backed the pledge last year. \n\nThe pledge is nonbinding, but highlights the growing support for expanding nuclear power among leading industries, finance and governments. Amazon, Google and Meta are increasingly important drivers of energy demand in the U.S. as they build out AI centers. The tech sector is turning to nuclear power after concluding that renewables alone won't provide enough reliable power for their energy needs. Microsoft and Apple did not sign the statement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon%2C+Goog",
        "id": 2306023,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/12/1350256/amazon-google-and-meta-support-tripling-nuclear-power-by-2050?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon, Google and Meta Support Tripling Nuclear Power By 2050",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T17:46:31+00:00",
        "description": "The Federal Trade Commission asked a judge in Seattle to delay the start of its trial accusing Amazon of duping consumers into signing up for its Prime program, citing resource constraints. CNBC: Attorneys for the FTC made the request during a status hearing on Wednesday before Judge John Chun in the U.S. District Court for the Western District of Washington. Chun had set a Sept. 22 start date for the trial. Jonathan Cohen, an attorney for the FTC, asked Chun for a two-month continuance on the case due to staffing and budgetary shortfalls. \n\nThe FTC's request to delay due to staffing constraints comes amid a push by the Trump administration's Department of Government Efficiency to reduce spending. DOGE, which is led by tech baron Elon Musk, has slashed the federal government's workforce by more than 62,000 workers in February alone. \"We have lost employees in the agency, in our division and on our case team,\" Cohen said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a ",
        "id": 2306019,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/12/176223/ftc-asks-to-delay-amazon-prime-deceptive-practices-case-citing-staffing-shortfalls?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FTC Asks To Delay Amazon Prime Deceptive Practices Case, Citing Staffing Shortfalls",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T17:46:31+00:00",
        "description": "IBM CEO Arvind Krishna has publicly disagreed with Anthropic CEO Dario Amodei's prediction that AI will write 90% of code within 3-6 months, estimating instead that only \"20-30% of code could get written by AI.\" \n\n\"Are there some really simple use cases? Yes, but there's an equally complicated number of ones where it's going to be zero,\" Krishna said during an onstage interview at SXSW. He argued AI will boost programmer productivity rather than eliminate jobs. \"If you can do 30% more code with the same number of people, are you going to get more code written or less?\" he asked. \"History has shown that the most productive company gains market share, and then you can produce more products.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=IBM+CEO+Doesn't+Think+AI+Will+Replace+Programmers+Anytime+Soon%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F03%2F12%2F1448242%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwit",
        "id": 2306021,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/12/1448242/ibm-ceo-doesnt-think-ai-will-replace-programmers-anytime-soon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "IBM CEO Doesn't Think AI Will Replace Programmers Anytime Soon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T17:46:31+00:00",
        "description": "Roomba maker iRobot has warned it may cease operations within 12 months unless it can refinance debt or find a buyer, just one day after launching a new vacuum cleaner line. In its March 12 quarterly report, the company disclosed it had spent $3.6 million to amend terms on a $200 million Carlyle Group loan from 2023, as U.S. revenue plunged 47% in the fourth quarter. \n\n\"Given these uncertainties and the implication they may have on the Company's financials, there is substantial doubt about the Company's ability to continue as a going concern for a period of at least 12 months from the date of the issuance of its consolidated 2024 financial statements,\" the company wrote. \n\nThe robot vacuum pioneer has initiated a formal strategic review after a failed Amazon acquisition, the departure of founder Colin Angle, and layoffs affecting over half its workforce. iRobot cited mounting competition from Chinese manufacturers and expects continued losses for \"the foreseeable future.\"<p><div clas",
        "id": 2306022,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/12/1437241/roomba-maker-irobot-warns-of-possible-shutdown-within-12-months?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Roomba-maker iRobot Warns of Possible Shutdown Within 12 Months",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T17:46:31+00:00",
        "description": "Schools across the United States are increasingly using artificial intelligence to monitor students' online activities, raising significant privacy concerns after Vancouver Public Schools inadvertently released nearly 3,500 unredacted, sensitive student documents to reporters. \n\nThe surveillance software, developed by companies like Gaggle Safety Management, scans school-issued devices 24/7 for signs of bullying, self-harm, or violence, alerting staff when potential issues are detected. Approximately 1,500 school districts nationwide use Gaggle's technology to track six million students, with Vancouver schools paying $328,036 for three years of service. \n\nWhile school officials maintain the technology has helped counselors intervene with at-risk students, documents revealed LGBTQ+ students were potentially outed to administrators through the monitoring.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Schools+Depl",
        "id": 2306020,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/12/1654217/us-schools-deploy-ai-surveillance-amid-security-lapses-privacy-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Schools Deploy AI Surveillance Amid Security Lapses, Privacy Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T16:42:50+00:00",
        "description": "AmiMoJo shares a report from Electrek: The U.S. installed 50 gigawatts (GW) of new solar capacity in 2024, the largest single year of new capacity added to the grid by any energy technology in over two decades. That's enough to power 8.5 million households. According to the U.S. Solar Market Insight 2024 Year in Review report (PDF) released today by the Solar Energy Industries Association (SEIA) and Wood Mackenzie, solar and storage account for 84% of all new electric generating capacity added to the grid last year.\n \nIn addition to historic deployment, surging U.S. solar manufacturing emerged as a landmark economic story in 2024. Domestic solar module production tripled last year, and at full capacity, U.S. factories can now produce enough to meet nearly all demand for solar panels in the U.S. Solar cell manufacturing also resumed in 2024, strengthening the U.S. energy supply chain. [...] Total US solar capacity is expected to reach 739 GW by 2035, but the report forecasts include s",
        "id": 2304447,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/11/2133237/solar-adds-more-new-capacity-to-the-us-grid-in-2024-than-any-energy-source-in-20-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Solar Adds More New Capacity To the US Grid In 2024 Than Any Energy Source In 20 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T07:21:18+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Behind The Black: According to information at this tweet from anonymous sources, parts of Starship will likely require a major redesign due to the spacecraft's break-up shortly after stage separation on its last two test flights. These are the key take-aways, most of which focus on the redesign of the first version of Starship (V1) to create the V2 that flew unsuccessfully on those flights:\n\n- Hot separation also aggravates the situation in the compartment.\n- Not related to the flames from the Super Heavy during the booster turn.\n- This is a fundamental miscalculation in the design of the Starship V2 and the engine section. \n- The fuel lines, wiring for the engines and the power unit will be urgently redone.\n- The fate of S35 and S36 is still unclear. Either revision or scrap. \n- For the next ships, some processes may be paused in production until a decision on the design is made. \n- The team was rushed with fixes for S34, hence t",
        "id": 2302816,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/11/2159228/anonymous-sources-starship-needs-a-major-rebuild-after-two-consecutive-failures?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anonymous Sources: Starship Needs a Major Rebuild After Two Consecutive Failures",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T04:06:38+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Tuesday, OpenAI unveiled a new \"Responses API\" designed to help software developers create AI agents that can perform tasks independently using the company's AI models. The Responses API will eventually replace the current Assistants API, which OpenAI plans to retire in the first half of 2026. With the new offering, users can develop custom AI agents that scan company files with a file search utility that rapidly checks company databases (with OpenAI promising not to train its models on these files) and navigate websites -- similar to functions available through OpenAI's Operator agent, whose underlying Computer-Using Agent (CUA) model developers can also access to enable automation of tasks like data entry and other operations.\n \nHowever, OpenAI acknowledges that its CUA model is not yet reliable for automating tasks on operating systems and can make unintended mistakes. The company describes the new API as an early iteration",
        "id": 2302145,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/11/2154229/openai-pushes-ai-agent-capabilities-with-new-developer-api?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Pushes AI Agent Capabilities With New Developer API",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T01:56:27+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: There's a power crunch looming as AI and cloud providers ramp up data center construction. But a new report suggests that a solution lies beneath their foundations. Advanced geothermal power could supply nearly two-thirds of new data center demand by 2030, according to an analysis by the Rhodium Group. The additions would quadruple the amount of geothermal power capacity in the U.S. -- from 4 gigawatts to about 16 gigawatts -- while costing the same or less than what data center operators pay today. In the western U.S., where geothermal resources are more plentiful, the technology could provide 100% of new data center demand. Phoenix, for example, could add 3.8 gigawatts of data center capacity without building a single new conventional power plant.\n \nGeothermal resources have enormous potential to provide consistent power. Historically, geothermal power plants have been limited to places where Earth's heat seeps close to the surfa",
        "id": 2301720,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/11/2149222/geothermal-could-power-nearly-all-new-data-centers-through-2030?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Geothermal Could Power Nearly All New Data Centers Through 2030",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T01:56:27+00:00",
        "description": "Sphere Entertainment Co, the company behind the Las Vegas Sphere, said they are considering opening scaled-down versions of the immersive venue in other cities. AV Magazine reports: While this has been been feasible for its high-profile residencies such as U2, the Eagles, Dead &amp; Company and Anyma, smaller venues could attract a broader range of artists who might not have the budget or demand to fill the flagship Las Vegas location. By scaling down the size while retaining the signature technology, Sphere Entertainment Co can offer a similar spectacle at a more sustainable cost for artists and spectators.\n \nThe possibility of mini-Spheres follows news that a full-scale venue will open in the UAE as a result of a partnership between Sphere Entertainment Co and the Department of Culture and Tourism -- Abu Dhabi. Beyond concerts, the Las Vegas Sphere has proven successful with immersive films such as V-U2: An Immersive Concert Film and the Sphere Expeience featuring Darren Aronofsky'",
        "id": 2301721,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/11/2143232/team-behind-las-vegas-sphere-plans-5000-capacity-mini-spheres?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Team Behind Las Vegas Sphere Plans 5,000-Capacity 'Mini-Spheres'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T00:51:45+00:00",
        "description": "MojoKid writes: AMD just launched its latest flagship desktop processors, the Ryzen 9 9950X3D. Ryzen 9 9950X3D is a 16-core/32-thread, dual-CCD part with a base clock of 4.3GHz and a max boost clock of 5.7GHz. There's also 96MB of second-gen 3D V-Cache on board. Standard Ryzen 9000 series processors feature 32MB of L3 cache per compute die, but with the Ryzen 9 9950X3D, one compute die is outfitted with an additional 96MB of 3D V-Cache, bringing the total L3 up to 128MB (144MB total cache). The CCD outfitted with 3D V-Cache operates at more conservative voltages and frequencies, but the bare compute die is unencumbered.\n \nThe Ryzen 9 9950X3D turns out to be a high-performance, no-compromise desktop processor. Its complement of 3D V-Cache provides tangible benefits in gaming, and AMD's continued work on the platform's firmware and driver software ensures that even with the Ryzen 9 9950X3D's asymmetrical CCD configuration, performance is strong across the board. At $699, it's not cheap",
        "id": 2301457,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/11/2126204/amd-ryzen-9-9950x3d-with-3d-v-cache-impresses-in-launch-day-testing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AMD Ryzen 9 9950X3D With 3D V-Cache Impresses In Launch Day Testing",
        "vote": 0
    }
]