[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T18:30:18+00:00",
        "description": "Post Trauma is an indie horror game releasing later this month for PC and consoles. This game is a clear ode to classic PS1 survival horror titles like Resident Evil and Silent Hill and isn’t shy about its inspiration in the slightest. \n\nWhat really helps sell Post Trauma’s classic appeal are the fixed camera angles which shift from different angles to static CRTV perspectives depending on the context. \n\nThere’s also plenty of slow-paced puzzles that you’ll have to figure out the old fashioned way: through exploration. Environments range from  creepy rooms to spooky hallways. If you’re a fan of creative enemy designs and methodical Silent Hill style gameplay, Post Trauma may just end up as your next favorite game in the horror genre.",
        "id": 2306738,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QhVVBMKBedY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QhVVBMKBedY/hqdefault.jpg",
        "title": "Post Trauma - 15 Things You Need To Know About This Classic Resident Evil Inspired Game",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T14:00:46+00:00",
        "description": "Though some are bemoaning the end of the console war now that first-party Microsoft titles appear on other platforms, that doesn't necessarily mean the end of their hardware ambitions. There's always been the assurance that new Xbox consoles are coming in the future, and according to rumors, it could pursue a multifaceted approach.\n\nReports indicate that a portable gaming PC with Xbox \"design sensibilities\" is in the works for launch later this year. While the company throws its hat into the handheld PC gaming space with a distinct advantage, it's allegedly working on the successor to the Xbox Series X/S. Nothing is known about the console, save for it also having a handheld and different controller types (though it's out in 2027).\n\nWhile pursuing console hardware may seem questionable given Xbox's declining hardware sales, it could be part of Microsoft's effort to ensure multiple platforms and capture the widest possible audience.",
        "id": 2304542,
        "language": null,
        "link": "https://www.youtube.com/watch?v=fuKtCMly8eY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fuKtCMly8eY/hqdefault.jpg",
        "title": "Xbox Has A SECRET PLAN And Why It Could Be A Game Changer...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-12T09:30:28+00:00",
        "description": "That we are finally receiving a Assassin’s Creed game set in Japan is obviously cause for celebration, but funnily enough, its promise of a detailed and immersive open world feudal Japan map is one that other major AAA titles have already made and fulfilled in recent years. \n\nBoth Ghost of Tsushima and Rise of the Ronin filled that void that Assassin’s Creed was (until now) refusing to fill- though it’s fair to say that both did it with very different results. Sucker Punch’s 2020 modern classic did so in convincing fashion, while Rise of the Ronin stumbled with significant issues, even if it did have its fair share of strengths as well. Assassin’s Creed Shadows can take key lessons from both, however, and here, that’s exactly what we’ll be discussing.",
        "id": 2304543,
        "language": null,
        "link": "https://www.youtube.com/watch?v=dy15jv-eDD8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dy15jv-eDD8/hqdefault.jpg",
        "title": "Assassin’s Creed Shadows: 4 Things To Learn From Ghost of Tsushima, 4 To Skip From Rise of The Ronin",
        "vote": 0
    }
]