[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T22:59:15.643807+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T22:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Google has announced a tiny version of its Gemma open model designed to run on local devices. Google says the new Gemma 3 270M can be tuned in a snap and maintains robust performance despite its small footprint. [...] Running an AI model locally has numerous benefits, including enhanced privacy and lower latency. Gemma 3 270M was designed with these kinds of use cases in mind. In testing with a Pixel 9 Pro, the new Gemma was able to run 25 conversations on the Tensor G4 chip and use just 0.75 percent of the device's battery. That makes it by far the most efficient Gemma model.\n \nDevelopers shouldn't expect the same performance level of a multi-billion-parameter model, but Gemma 3 270M has its uses. Google used the IFEval benchmark, which tests a model's ability to follow instructions, to show that its new model punches above its weight. Gemma 3 270M hits a score of 51.2 percent in this test, which is higher than other lightweight ",
        "id": 3333184,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/14/2150230/google-releases-pint-size-gemma-open-ai-model?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Releases Pint-Size Gemma Open AI Model",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T22:59:15.822907+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T22:02:00+00:00",
        "description": "Apple has reintroduced blood oxygen monitoring to certain Apple Watch models in the U.S. by shifting the feature's calculations to the paired iPhone, sidestepping an ITC import ban stemming from its legal dispute with medical device maker Masimo. TechCrunch reports: Blood oxygen data will be measured and calculated on the user's paired iPhone, and results can be viewed in the Respiratory section of the Health app. This means users won't be able to view the data on their Apple Watch, as they'll need to do so on their iPhone. Apple says the update announced today is enabled by a recent U.S. Customs ruling, which means that the tech giant is allowed to import Apple Watches with the redesigned Blood Oxygen feature.\n \nThe change doesn't affect previously sold models with the original version of the feature or units bought outside the U.S. The redesigned feature only applies to Apple Watches that were sold after the ITC import ban took effect in early 2024. These users can access the redesi",
        "id": 3333185,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/14/2018223/apple-returns-blood-oxygen-monitoring-to-the-latest-apple-watches?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Returns Blood Oxygen Monitoring to the Latest Apple Watches",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T21:54:54.934682+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T21:26:00+00:00",
        "description": "PayPal payment processing has been unavailable for Steam purchases in most countries since early July 2025, Valve has confirmed, with functionality limited to transactions in U.S. dollars, Euros, British Pounds, Japanese Yen, Australian dollars, and Canadian dollars. In a statement to RockPaperShotgun, the company said one of PayPal's acquiring banks terminated all Steam transaction processing. Valve linked the bank's decision to previous Mastercard-related content restrictions. The disruption began in early July 2025 when PayPal notified Valve of the immediate termination, leaving millions of users in affected regions without PayPal access and no certain timeline for resolution.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=PayPal+No+Longer+Available+for+Steam+Purchases+Outside+Major+Currency+Zones%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F08%2F14%2F1928226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img",
        "id": 3332814,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/14/1928226/paypal-no-longer-available-for-steam-purchases-outside-major-currency-zones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PayPal No Longer Available for Steam Purchases Outside Major Currency Zones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T20:49:31.184003+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T20:45:00+00:00",
        "description": "An anonymous reader shares a report: Astronomers have observed the calamitous result of a star that picked the wrong dance partner. They have documented what appears to be a new type of supernova, as stellar explosions are known, that occurred when a massive star tried to swallow a black hole with which it had engaged in a lengthy pas de deux. \n\nThe star, which was at least 10 times as massive as our sun, and the black hole, which had a similar mass, were gravitationally bound to one another in what is called a binary system. But as the distance separating them gradually narrowed, the black hole's immense gravitational pull appears to have distorted the star -- stretching it out from its spherical shape -- and siphoned off material before causing it to explode. An AI algorithm detected the event in real time, enabling astronomers to conduct comprehensive observations. Data from four years before the supernova showed bright emissions as the black hole consumed its companion's outer hyd",
        "id": 3332330,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/14/1916235/new-type-of-supernova-detected-as-black-hole-causes-star-to-explode?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Type of Supernova Detected as Black Hole Causes Star To Explode",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T20:49:31.400159+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T20:05:00+00:00",
        "description": "Negotiations on a global treaty to end plastic pollution are drawing to a close Thursday, as nations remain deadlocked over whether to tackle the exponential growth of plastic production. From a report: A draft of the treaty released Wednesday wouldn't limit plastic production or address chemicals used in plastic products. Instead, it's centered on proposals where there's broad agreement -- such as reducing the number of problematic plastic products that often enter the environment and are difficult to recycle, promoting the redesign of plastic products so they can be recycled and reused, and improving waste management. \n\nIt asks nations to make commitments to ending plastic pollution, rather than imposing global, legally-binding rules. French President Emmanuel Macron said the \"lack of ambition\" in the draft treaty was unacceptable, and that agreeing to a global treaty against plastic pollution \"is our opportunity to make a difference.\"<p><div class=\"share_submission\" style=\"position",
        "id": 3332331,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/14/198211/plastic-pollution-treaty-talks-deadlocked-as-negotiations-draw-to-a-close?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Plastic Pollution Treaty Talks Deadlocked as Negotiations Draw To a Close",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T19:44:25.118512+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T19:30:00+00:00",
        "description": "Former Sony Worldwide Studios chairman Shawn Layden criticized subscription gaming services like Xbox Game Pass, arguing that developers working under such models become \"wage slaves.\" Speaking in a recent industry discussion, Layden contended that subscription services prevent developers from traditional profit-sharing arrangements. \n\n\"They're not creating value, putting it in the marketplace, hoping it explodes, and profit sharing, and overages, and all that nice stuff,\" Layden said. \"It's just, 'You pay me X dollars an hour, I built you a game, here, go put it on your servers.'\" He called the model uninspiring for game developers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ex-PlayStation+Boss+Says+Game+Subscription+Turns+Developers+Into+'Wage+Slaves'%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F08%2F14%2F1859256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_ic",
        "id": 3331962,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/14/1859256/ex-playstation-boss-says-game-subscription-turns-developers-into-wage-slaves?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ex-PlayStation Boss Says Game Subscription Turns Developers Into 'Wage Slaves'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T19:44:25.295371+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T18:52:00+00:00",
        "description": "An anonymous reader shares a report: OpenAI is considering ways to bring in additional revenue, and bringing ads to ChatGPT is one option on the table. While being interviewed on Decoder, ChatGPT head Nick Turley said he's \"humble enough not to rule it out categorically,\" but hedged that OpenAI would need to \"be very thoughtful and tasteful\" about how ads could be integrated into ChatGPT. \n\n\"We will build other products, and those other products can have different dimensions to them, and maybe ChatGPT just isn't an ads-y product because it's just so deeply accountable to your goals. But it doesn't mean that we wouldn't build other things in the future, too,\" Turley said. \"I think it's good to preserve optionality, but I also really do want to emphasize how incredible the subscription model is, how fast it's growing, and how untapped a lot of the opportunities are.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+",
        "id": 3331963,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/14/1852218/the-head-of-chatgpt-wont-rule-out-adding-ads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Head of ChatGPT Won't Rule Out Adding Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T18:36:31.119198+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T18:10:00+00:00",
        "description": "Meta's internal policy document permitted the company's AI chatbots to engage children in \"romantic or sensual\" conversations and generate content arguing that \"Black people are dumber than white people,\" according to a Reuters review of the 200-page \"GenAI: Content Risk Standards\" guide. \n\nThe document, approved by Meta's legal, public policy and engineering staff including its chief ethicist, allowed chatbots to describe children as attractive and create false medical information. Meta confirmed the document's authenticity but removed child-related provisions after Reuters inquiries, calling them \"erroneous and inconsistent with our policies.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta's+AI+Rules+Have+Let+Bots+Hold+'Sensual'+Chats+With+Kids%2C+Offer+False+Medical+Info%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F14%2F1759222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.f",
        "id": 3331419,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/14/1759222/metas-ai-rules-have-let-bots-hold-sensual-chats-with-kids-offer-false-medical-info?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta's AI Rules Have Let Bots Hold 'Sensual' Chats With Kids, Offer False Medical Info",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T18:36:31.315838+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T17:33:00+00:00",
        "description": "Twenty years after Michelin introduced the Tweel in 2005, airless tires remain absent from passenger vehicles despite their promise to \"eliminate nearly 200 million scrap tires a year caused by flats and underinflation,\" according to Michelin's internal testing cited in a Jalopnik report. Current prototypes \"tend to transfer more road noise and vibration into the cabin than traditional radials -- making the ride harsher, especially at highway speeds.\" Heat dissipation poses additional challenges as \"airless designs -- particularly those with internal webbing or solid cores -- have fewer ways to shed thermal load.\" The added structural mass \"can affect fuel economy and increase unsprung weight -- bad news for handling and suspension tuning.\" Federal regulations compound these technical barriers since vehicle tires are subject to rigorous performance standards, many of which assume air pressure as a baseline.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop",
        "id": 3331420,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/14/1733234/why-cars-still-dont-have-airless-tires-yet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Cars Still Don't Have Airless Tires, Yet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T17:32:25.214530+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T16:55:00+00:00",
        "description": "Electricity rates for individuals and small businesses could rise sharply as Amazon, Google, Microsoft and other technology companies build data centers and expand into the energy business. Residential electricity bills increased at least $15 monthly for Ohio households starting in June due to data center demands, according to utility data and an independent grid monitor. A Carnegie Mellon University and North Carolina State University analysis projects average U.S. electricity bills will rise 8% by 2030 from data center growth, with Virginia facing potential 25% increases. Virginia regulators estimate residents could pay an additional $276 annually by 2030. \n\nNational residential electricity rates have already risen more than 30% since 2020. Tech companies' AI push requires data centers that consumed over 4% of U.S. electricity in 2023, with government analysts projecting consumption reaching 12% within three years. American Electric Power warned Ohio regulators that without new rate",
        "id": 3330852,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/14/1655246/big-techs-ai-data-centers-are-driving-up-electricity-bills-for-everyone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Big Tech's AI Data Centers Are Driving Up Electricity Bills for Everyone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T16:26:28.029696+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T16:10:00+00:00",
        "description": "The Office of the Commissioner of Canada Elections (OCCE) has revealed in its annual report that it will \"explore the use\" AI and emerging technologies to see how they will shape the government body's approach for the next year. From a report: Commissioner Caroline Simard's office didn't outline ways it might adopt AI. In its outlook, the OCCE expected to use funding announced in January 2025 to secure the tools needed for addressing the \"challenges of today's electoral environment.\" This included staffing roles dictated by its new structure and reflected \"ongoing modernization efforts,\" but no further details. \n\nThe Commissioner is an independent officer who ensures the government, political parties, and others honour both the Canada Elections Act and Referendum Act. This includes core aspects like financing, nominations, campaigning, and advertising. More recently, the OCCE has been addressing rising issues with AI, including election disinformation facilitated by bots, AI-generated",
        "id": 3330347,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/14/1610236/commissioner-of-canada-elections-will-explore-the-use-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Commissioner of Canada Elections Will 'Explore the Use' of AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T16:26:28.209912+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T15:30:00+00:00",
        "description": "Kodak says it remains confident it can avoid shutdown despite filing required \"going concern\" disclosures about $500 million in debt obligations due within 12 months. The 133-year-old photography company plans to draw approximately $300 million from its U.S. pension fund in December to pay off a significant portion of its term loan before maturity. Chief Marketing Officer Denisse Goldbarg said the disclosure was mandatory under accounting rules but Kodak would emerge virtually debt-free.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Kodak+Says+It'll+Figure+Things+Out+and+Won't+Shut+Down%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F08%2F14%2F1531205%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F08%2F14%2F1531205%2Fkodak-says-itll-figure-things-out-a",
        "id": 3330348,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/14/1531205/kodak-says-itll-figure-things-out-and-wont-shut-down?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Kodak Says It'll Figure Things Out and Won't Shut Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T15:20:26.148558+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T14:42:00+00:00",
        "description": "The next version of Windows will become \"more ambient, pervasive, and multi-modal\" as AI transforms how users interact with computers, Microsoft's Windows chief Pavan Davuluri said in a company video. Davuluri, Corporate Vice President and head of Windows, said that voice will emerge as a primary input method alongside keyboard and mouse, with the operating system gaining context awareness to understand screen content and user intent through natural language. \n\nWindows interfaces, he said, will appear fundamentally different within five years as the platform becomes increasingly agentic. The transformation will rely on both local processing power and cloud computing capabilities to deliver seamless experiences where users can speak to their computers while simultaneously typing or inking.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Says+Voice+Will+Emerge+as+Primary+Input+for+Next+Windows%3A+https%3A%2F%",
        "id": 3329708,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/14/1441240/microsoft-says-voice-will-emerge-as-primary-input-for-next-windows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Says Voice Will Emerge as Primary Input for Next Windows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T14:15:32.805084+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T14:02:00+00:00",
        "description": "Top fintech and crypto executives urged the Trump administration to block US banks from charging fees for access to customer data, levies that strike at the heart of their business models. From a report: Klarna, Robinhood and crypto exchange Gemini were among a long list of companies, investors and lobbying groups that signed a letter sent Wednesday to President Donald Trump, arguing that the proposed fees would \"cripple\" innovation and \"may cause small businesses and financial tools to shut down entirely.\" \n\nJPMorgan Chase has told fintechs and the data aggregators they rely on that the bank's customer account information will no longer be accessible without a charge. JPMorgan, the biggest US bank, views the data aggregators as freeloaders of sorts who access data without paying and then charge their fintech clients for it. PNC Financial Services is considering charging similar fees. \n\n\"We urge you to use the full power of your office and the broader administration to prevent the lar",
        "id": 3329126,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/14/142255/fintech-crypto-ceos-urge-us-president-to-block-banks-data-access-fees?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fintech, Crypto CEOs Urge US President To Block Banks' Data-Access Fees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T13:10:39.921686+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T13:00:00+00:00",
        "description": "BrianFagioli writes: Lenovo is starting its fiscal year with a major win, delivering record-breaking PC sales and claiming dominance in the AI PC space. For the first quarter of its 2025/26 fiscal year, the company reported $18.8 billion in revenue, which is 22 percent higher than the same period last year. Profit came in at $505 million, more than double the figure from a year ago. \n\nThe standout performer was Lenovo's PC and smart devices division. It posted its fastest growth in 15 quarters and secured a record 24.6 percent global market share. More than 30 percent of Lenovo's PCs shipped in the quarter were AI PCs, giving it the top position in the Windows AI PC segment with a 31 percent market share. This leadership is an important talking point for Lenovo as it continues to market AI features as a key reason for buyers to upgrade.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lenovo's+PC+Business+Surges+To+15",
        "id": 3328571,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/14/0238234/lenovos-pc-business-surges-to-15-quarter-high-with-ai-models-leading-the-charge?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lenovo's PC Business Surges To 15-Quarter High With AI Models Leading The Charge",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T13:10:40.118757+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T12:00:00+00:00",
        "description": "Igor Babuschkin, co-founder of xAI, has left the company to start Babuschkin Ventures, a VC firm focused on AI safety and humanity-advancing startups. TechCrunch reports: Babuschkin led engineering teams at xAI and helped build the startup into one of Silicon Valley's leading AI model developers just a few years after it was founded. \"Today was my last day at xAI, the company that I helped start with Elon Musk in 2023,\" Babuschkin wrote in the post. \"I still remember the day I first met Elon, we talked for hours about AI and what the future might hold. We both felt that a new AI company with a different kind of mission was needed.\"\n \nBabuschkin is leaving xAI to launch his own venture capital firm, Babuschkin Ventures, which he says will support AI safety research and back startups that \"advance humanity and unlock the mysteries of our universe.\" The xAI co-founder says he was inspired to start the firm after a dinner with Max Tegmark, the founder of the Future of Life Institute, in w",
        "id": 3328572,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/14/0414234/co-founder-of-xai-departs-the-company?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Co-Founder of xAI Departs the Company",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T11:05:13.680770+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T10:00:00+00:00",
        "description": "Data brokers are required by California law to provide ways for consumers to request their data be deleted. But good luck finding them. From a report: More than 30 of the companies, which collect and sell consumers' personal information, hid their deletion instructions from Google, according to a review by The Markup and CalMatters of hundreds of broker websites. This creates one more obstacle for consumers who want to delete their data. \n\nMany of the pages containing the instructions, listed in an official state registry, use code to tell search engines to remove the page entirely from search results. Popular tools like Google and Bing respect the code by excluding pages when responding to users. Data brokers nationwide must register in California under the state's Consumer Privacy Act, which allows Californians to request that their information be removed, that it not be sold, or that they get access to it. After reviewing the websites of all 499 data brokers registered with the sta",
        "id": 3327506,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/14/0235234/data-brokers-are-hiding-their-opt-out-pages-from-google-search?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Data Brokers Are Hiding Their Opt-Out Pages From Google Search",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T08:43:28.619593+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T08:12:00+00:00",
        "description": "An anonymous reader shares a report: India's blueprint for displacing China as the world's electronics workshop contains a rather extraordinary feature: the entire Indian edifice requires Chinese companies to supply the technical architecture, manufacturing know-how and operational templates that would make such displacement theoretically possible. \n\nLet's start with Dixon Technologies, India's flagship domestic electronics manufacturer. The company has systematically built indigenous capability through a growing constellation of Chinese partnerships: Longcheer provides the design intelligence, Kunshan Q-Tech delivers camera module expertise, Chongqing Yuhai supplies precision-molded components and HKC brings display technology. This pattern of structured dependence has become the organizing principle of India's electronics manufacturing push. \n\n[...] The current architecture sees Chinese companies retain control of the critical knowledge while their Indian partners provide labour arb",
        "id": 3326950,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/14/0811259/china-plus-one-was-just-china-all-along?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China-Plus-One Was Just China All Along",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T07:39:34.664795+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T07:30:00+00:00",
        "description": "Russian authorities are \"partially\" restricting calls in messaging apps Telegram and WhatsApp, the latest step in an effort to tighten control over the internet. From a report: In a statement, government media and internet regulator Roskomnadzor justified the measure as necessary for fighting crime, saying that \"according to law enforcement agencies and numerous appeals from citizens, foreign messengers Telegram and WhatsApp have become the main voice services used to deceive and extort money, and to involve Russian citizens in sabotage and terrorist activities.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Russia+Restricts+Calls+Via+WhatsApp+and+Telegram%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F14%2F0226212%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.sl",
        "id": 3326637,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/14/0226212/russia-restricts-calls-via-whatsapp-and-telegram?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russia Restricts Calls Via WhatsApp and Telegram",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T04:23:43.049593+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T03:30:00+00:00",
        "description": "An anonymous reader New Atlas: An engineered protein that acts like a molecular sponge has the potential to change how carbon monoxide poisoning is treated, chasing down CO molecules in the bloodstream and helping the body flush them out in just minutes, without the risk of short- or long-term health issues that come with the current frontline treatment, pure oxygen. Researchers at the University of Maryland School of Medicine (UMSOM) were focused on a natural protein known as RcoM, found in the bacterium Paraburkholderia xenovorans. In bacteria, RcoM detects trace amounts of CO in the environment, so the engineers believed this could be harnessed to scavenge for CO molecules attached to red blood cells instead.\n \nThe re-engineered protein is the basis of the therapy they call RcoM-HBD-CCC. While it's not exactly a catchy name, it possesses somewhat of a superpower when it comes to cleaning out CO. It selectively binds tightly to the poisonous CO molecules, while ignoring oxygen (O2) ",
        "id": 3325872,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/14/0010227/first-antidote-for-carbon-monoxide-poisoning-cleans-blood-in-minutes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "First Antidote For Carbon Monoxide Poisoning 'Cleans' Blood In Minutes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T01:09:30.179268+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T00:10:00+00:00",
        "description": "The Pentagon is poised to cancel two nearly finished Navy and Air Force HR software projects worth over $800 million so new contracts can be awarded to other vendors, including Salesforce, Palantir, and Workday. \"The reason for the unusual move: officials at those departments, who have so far put the existing projects on hold, want other firms, including Salesforce and billionaire Peter Thiel's Palantir, to have a chance to win similar projects, which could amount to a costly do-over,\" reports Reuters. From the report: In 2019, Accenture said it had won a contract to expand an HR platform to modernize the payroll, absence management, and other HR functions for the Air Force with Oracle software. The project, which includes other vendors and was later expanded to include Space Force, grew to cost $368 million and was scheduled for its first deployment this summer at the Air Force Academy. An April \"status update\" on the project conducted by the Air Force and obtained by Reuters describ",
        "id": 3325186,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/13/2334249/how-the-unraveling-of-two-pentagon-projects-may-result-in-a-costly-do-over?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How the Unraveling of Two Pentagon Projects May Result In a Costly Do-Over",
        "vote": 0
    }
]