[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T17:45:27.078281+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T17:01:02+00:00",
        "description": "It's hard to deny the appeal of the Warhammer 40,000: Dawn of War - Definitive Edition. For $29.99, you're getting the base campaign, which is already a must-play experience for fans and strategy enthusiasts, and expansions. These add additional campaigns and more factions. \n\nCouple this with Skirmish, and multiplayer for up to eight players (which I sadly didn't get a chance to try out), and you have a ridiculous amount of content for this price. And that's before accounting for the in-game Mod Manager, which the developer promises is compatible with all the mods created over the decades.\n\nWhile it could use some more optimization in places, not to mention a few more quality-of-life additions to really seal the deal, Warhammer 40,000: Dawn of War: Definitive Edition is solid game. It brings the RTS to a new generation but retaining everything that made it so appealing in the first place.",
        "id": 3330906,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=gVbTWv4aCys",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gVbTWv4aCys/hqdefault.jpg",
        "title": "Warhammer 40,000: Dawn of War - Definitive Edition Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T14:28:21.001785+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T13:30:04+00:00",
        "description": "The recent announcement of yet another delay to Crimson Desert has justifiably been a cause for dismay among its fans who have been eagerly looking forward to playing what seems to be quite the adventure. \n\nWith the game now slated for an early 2026 release window, its development cycle might be seen as a cause for alarm considering it was first announced in 2020. \n\nHowever, this title needs a more nuanced look. Given the recent gameplay footage, the game seems to be in its final stages of its development, with the latest delay being due to factors that seem beyond the studio's control this time around. \n\nWill this be the last time Crimson Desert gets pushed further into the future? That's what we're here to figure out.",
        "id": 3329176,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=40SPpU3-jjk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/40SPpU3-jjk/hqdefault.jpg",
        "title": "Crimson Desert - What The HELL IS GOING ON?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-14T11:22:18.778567+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-14T10:00:02+00:00",
        "description": "With Metal Gear Solid Delta: Snake Eater inching ever closer to its final release, we dive into a few more things we think you should know before you grab a copy of Hideo Kojima's classic title that explores Snake's motivations and the events that set him on the road to becoming Big Boss.\n\nFrom weapons and tools you can use in the field to secrets and call backs you can discover, there is a lot to unpack in Konami's remake of the classic title, and a few impressions from early access previews that showcase just how faithful the remake stays to the spirit of the original game. \n\nDive right in and check out what's stayed the same and what hasn't and perhaps decide if the remake is going to be worth your time and money.",
        "id": 3327583,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=1ZKQw3lHCDU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1ZKQw3lHCDU/hqdefault.jpg",
        "title": "Metal Gear Solid Delta: Snake Eater - 15 NEW Things You Need To Know Before You Purchase",
        "vote": 0
    }
]