[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T23:15:43.413718+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T22:34:00+00:00",
        "description": "OpenAI appears to have pulled a much-discussed video promoting the friendship between CEO Sam Altman and legendary Apple designer Jony Ive (plus, incidentally, OpenAI's $6.5 billion deal to acquire Ive and Altman's device startup io) from its website and YouTube page. [Though you can still see the original on Archive.org.] \n\nDoes that suggest something is amiss with the acquisition, or with plans for Ive to lead design work at OpenAI? Not exactly, according to Bloomberg's Mark Gurman, who reports [on X.com] that the \"deal is on track and has NOT dissolved or anything of the sort.\" Instead, he said a judge has issued a restraining order over the io name, forcing the company to pull all materials that used it. \n\n\n\nGurman elaborates on the disappearance of the video (and other related marketing materials) in a new article at Bloomberg:\n\nBloomberg reported last week that a judge was considering barring OpenAI from using the IO name due to a lawsuit recently filed by the similarly named IY",
        "id": 2994093,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/22/222250/openai-pulls-promotional-materials-about-jony-ive-deal-after-trademark-lawsuit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Pulls Promotional Materials About Jony Ive Deal (After Trademark Lawsuit)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T22:10:39.979287+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T21:34:00+00:00",
        "description": "\"The worlds of Linux and Windows finally came together in real life...\" writes The Verge:\n\n\nMicrosoft co-founder Bill Gates and Linus Torvalds, the creator of the Linux kernel, have surprisingly never met before. That all changed at a recent dinner hosted by Sysinternals creator Mark Russinovich... \"No major kernel decisions were made,\" jokes Russinovich in a post on LinkedIn. \n\nMore from the Linux news blog Linuxiac:\n\n\nThe man on the left is Mark Russinovich, a software engineer, author, and co-founder of Sysinternals, now CTO of Azure, Microsoft's cloud computing platform. He has become synonymous with deep Windows diagnostics and cloud-scale management. In the late 1990s, his suite of tools (Process Explorer, Autoruns, Procmon) revolutionized the way administrators and security professionals understood Windows internals. \n\nThe man on the far right is another living legend: Dave Cutler. Let me put it this way &mdash; he's one of the key people behind OpenVMS and the brilliant lead a",
        "id": 2993854,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/06/22/2131259/linus-torvalds-photographed-with-bill-gates---for-the-first-time-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linus Torvalds Photographed with Bill Gates - for the First Time Ever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T21:05:34.241835+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T20:23:00+00:00",
        "description": "With no one behind the steering wheel, a Tesla robotaxi passes Guero's Taco Bar in Austin Texas, making a right turn onto Congress Avenue. \n\nToday is the day Austin became the first city in the world to see Tesla's self-driving robotaxi service, reports The Guardian:\n\n Some analysts believe that the robotaxis will only be available to employees and invitees initially. For the CEO, Tesla's rollout is slow. \"We could start with 1,000 or 10,000 [robotaxis] on day one, but I don't think that would be prudent,\" he told CNBC in May. \"So, we will start with probably 10 for a week, then increase it to 20, 30, 40.\" \n\nThe billionaire has said the driverless cars will be monitored remotely... [Posting on X.com] Musk said the date was \"tentatively\" 22 June but that this launch date would be \"not real self-driving\", which would have to wait nearly another week... Musk said he planned to have one thousand Tesla robotaxis on Austin roads \"within a few months\" and then he would expand to other cities",
        "id": 2993548,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/22/2021234/tesla-begins-driverless-robotaxi-service-in-austin-texas?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tesla Begins Driverless Robotaxi Service in Austin, Texas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T20:01:51.417754+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T19:10:00+00:00",
        "description": "How AI will reshape the future of work? The Washington Post looks at India's $280 billion call-center and \"business process outsourcing\" industry, which employs over 3 million people. \n\n2023 saw the arrival of a real-time \"accent-altering software\" &mdash; now used by at least 42,000 call center agents:\n\nThose who use the software are engaging in \"digital whitewashing,\" critics say, which helps explain why the industry prefers the term \"accent translation\" over \"accent neutralization.\" But companies say it's delivering results: happier customers, satisfied agents, faster calls. \n\nMany are not convinced. Whatever short-term gains automation may offer to workers, they say, it will ultimately eliminate far more jobs than it creates. They point to the quality assurance process: When callers hear, \"this call may be monitored,\" that now usually refers to an AI system, not a human [which now can review all calls for compliance and tone]... \"AI is going to crush entry-level white-collar hirin",
        "id": 2993177,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/22/197235/how-will-ai-impact-call-center-jobs-in-india?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Will AI Impact Call Center Jobs in India?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T20:01:51.603351+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T17:50:00+00:00",
        "description": "The goal isn't to stop generative music, but to make it traceable, reports the Verge &mdash; \"to identify it early, tag it with metadata, and govern how it moves through the system....\" \n\n\"Detection systems are being embedded across the entire music pipeline: in the tools used to train models, the platforms where songs are uploaded, the databases that license rights, and the algorithms that shape discovery.\"\n\nPlatforms like YouTube and [French music streaming service] Deezer have developed internal systems to flag synthetic audio as it's uploaded and shape how it surfaces in search and recommendations. Other music companies &mdash; including Audible Magic, Pex, Rightsify, and SoundCloud &mdash; are expanding detection, moderation, and attribution features across everything from training datasets to distribution... Vermillio and Musical AI are developing systems to scan finished tracks for synthetic elements and automatically tag them in the metadata. Vermillio's TraceID framework goes",
        "id": 2993178,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/06/22/1747250/how-the-music-industry-is-building-the-tech-to-hunt-down-ai-generated-songs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How the Music Industry is Building the Tech to Hunt Down AI-Generated Songs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T20:01:51.802875+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T16:34:00+00:00",
        "description": "\"When Apollo astronauts stumbled across shimmering orange beads on the moon, they had no idea they were gazing at ancient relics of violent volcanic activity,\" writes ScienceDaily.\n\n\n\nThese glass spheres, tiny yet mesmerizing, formed billions of years ago during fiery eruptions that launched molten droplets skyward, instantly freezing in space. Now, using advanced instruments that didn't exist in the 1970s, scientists have examined the beads in unprecedented detail. The result is a remarkable window into the moon's dynamic geological history, revealing how eruption styles evolved and how lunar conditions once mirrored explosive events we see on Earth today... \nAnalyses of orange and black lunar beads have shown that the style of volcanic eruptions changed over time. \"It's like reading the journal of an ancient lunar volcanologist,\" said Ryan Ogliore [an associate professor of physics at Missouri's Washington University, which has a large repository of lunar samples that were returned ",
        "id": 2993179,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/22/0358233/tiny-orange-beads-found-by-apollo-astronauts-reveal-moons-volcanic-past?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tiny Orange Beads Found By Apollo Astronauts Reveal Moon's Volcanic Past",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T20:01:52.004706+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T15:34:00+00:00",
        "description": "As recently as 2021, GM \"all but eliminated\" hybrids from its future product plans, reports the New York Times. \"But then a funny thing happened.\"\nCar shoppers balked at the high prices of fully electric models and the challenges of charging them. In the last few years, sales of electric vehicles have grown at a much slower rate than automakers once expected. And hybrids have stepped in to fill the gap, accounting for a large and growing share of new car sales... In the first three months of this year, hybrids &mdash; including cars that can and cannot be plugged in &mdash; made up about 14 percent of all light vehicles sold in the United States, according to the Department of Energy. That was around twice the market share of fully electric vehicles in that period... \n\nSeveral automakers are slowing the introduction of new electric vehicles, and have accelerated development of new hybrids. \n\nRobb Report looks at the current status of hybrids &mdash; and a possible future:\n\n\"The chargi",
        "id": 2993180,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/22/0616202/americans-are-buying-twice-as-many-hybrids-as-fully-electric-vehicles-is-the-next-step-synthetic-fuels?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Americans are Buying Twice as Many Hybrids as Fully Electric Vehicles. Is The Next Step Synthetic Fuels?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T20:01:52.178760+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T14:34:00+00:00",
        "description": "alternative_right writes: We certainly weren't looking for it. What we have confirmed is that metals have their own intrinsic, natural ability to heal themselves, at least in the case of fatigue damage at the nanoscale.' While the observation is unprecedented, it's not wholly unexpected. In 2013, Texas A&amp;M University materials scientist Michael Demkowicz worked on a study predicting that this kind of nanocrack healing could happen, driven by the tiny crystalline grains inside metals essentially shifting their boundaries in response to stress... That the automatic mending process happened at room temperature is another promising aspect of the research. Metal usually requires lots of heat to shift its form, but the experiment was carried out in a vacuum; it remains to be seen whether the same process will happen in conventional metals in a typical environment. \n\n\nA possible explanation involves a process known as cold welding, which occurs under ambient temperatures whenever metal s",
        "id": 2993181,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/21/054219/a-cracked-piece-of-metal-self-healed-in-experiment-that-stunned-scientists?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Cracked Piece of Metal Self-Healed In Experiment That Stunned Scientists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T20:01:52.351537+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T11:34:00+00:00",
        "description": "An artist cancelled their Duolingo and Audible subscriptions to protest the companies' decisions to use more AI. \"If enough people leave, hopefully they kind of rethink this,\" the artist tells the Washington Post. \n\nAnd apparently, many more people feel the same way...\n\nIn thousands of comments and posts about Audible and Duolingo that The Post reviewed across social media &mdash; including on Reddit, YouTube, Threads and TikTok &mdash; people threatened to cancel subscriptions, voiced concern for human translators and narrators, and said AI creates inferior experiences. \"It destroys the purpose of humanity. We have so many amazing abilities to create art and music and just appreciate what's around us,\" said Kayla Ellsworth, a 21-year-old college student. \"Some of the things that are the most important to us are being replaced by things that are not real....\" \n\nPeople in creative jobs are already on edge about the role AI is playing in their fields. On sites such as Etsy, clearly AI-g",
        "id": 2993182,
        "language": null,
        "link": "https://slashdot.org/story/25/06/21/1755225/what-if-customers-started-saying-no-to-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What if Customers Started Saying No to AI?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T08:35:00.826056+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T07:34:00+00:00",
        "description": "The education-news site EdSurge published \"sponsored content\" from Minecraft Education this month. \"Students light up when they create something meaningful,\" the article begins. \"Self-expression fuels learning, and creativity lies at the heart of the human experience.\" \n\nBut they also argue that \"As AI rapidly reshapes software development, computer science education must move beyond syntax drills and algorithmic repetition.\" Students \"must also learn to think systemically...\"\nAs AI automates many of the mechanical aspects of programming, the value of CS education is shifting, from writing perfect code to shaping systems, telling stories through logic and designing ethical, human-centered solutions... [I]t's critical to offer computer science experiences that foster invention, expression and design. This isn't just an education issue &mdash; it's a workforce one. Creativity now ranks among the top skills employers seek, alongside analytical thinking and AI literacy. As automation resh",
        "id": 2990584,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/22/0535221/is-minecraft-a-better-way-to-teach-programming-in-the-age-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is 'Minecraft' a Better Way to Teach Programming in the Age of AI?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T05:18:31.690178+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T04:34:00+00:00",
        "description": "\"A single infusion of a stem cell-based treatment may have cured 10 out of 12 people with the most severe form of Type 1 diabetes,\" reports the New York Times. \n\n\"One year later, these 10 patients no longer need insulin. The other two patients need much lower doses.\"\n\nThe experimental treatment, called zimislecel and made by Vertex Pharmaceuticals of Boston, involves stem cells that scientists prodded to turn into pancreatic islet cells, which regulate blood glucose levels. The new islet cells were infused and reached the pancreas, where they took up residence. The study was presented Friday evening at the annual meeting of the American Diabetes Association and published online by The New England Journal of Medicine... \n\nPatients in the study began to need less insulin within a few months of being infused with new islet cells, and most stopped needing the hormone altogether at about six months [said Dr. Trevor Reichman, director of the pancreas and islet transplant program at Universi",
        "id": 2989997,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/22/0317248/people-with-severe-type-1-diabetes-are-cured-in-small-trial-of-new-drug?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "People with Severe Type 1 Diabetes are Cured in Small Trial of New Drug",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T02:03:33.064285+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T01:34:00+00:00",
        "description": "\"Modern vehicles have quietly become rolling monuments to terrible user experience, trading intuitive physical controls for flashy but dangerous touchscreen interfaces,\" argues the site Cars &amp; Horsepower, decrying \"an industry-wide plague of poorly designed digital dashboards that demand more attention from drivers than the road itself.\"\n\n\n\nThe consequences are measurable and severe: studies now show touchscreen vehicles require up to four times longer to perform basic functions than their button-equipped counterparts, creating a distracted driving crisis that automakers refuse to acknowledge. A Swedish car magazine, Vi Bil&auml;gare, conducted a study [in 2022] comparing how long it takes drivers to perform basic tasks like adjusting climate controls or changing the radio station using touchscreens versus traditional physical buttons. The results showed that in the worst-performing modern car, it took drivers up to four times longer to complete these tasks compared to an older ve",
        "id": 2989394,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/22/0044222/why-your-cars-touchscreen-is-more-dangerous-than-your-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Your Car's Touchscreen Is More Dangerous Than Your Phone",
        "vote": 0
    }
]