[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T19:29:19.952657+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T15:30:18+00:00",
        "description": "It's easy to forget how magical the Mass Effect trilogy felt when first playing through. Meeting the likes of Garrus and Liara, the climactic mission against the Collectors, and, of course, the beginning of Mass Effect 3. After remaining dormant for several years, BioWare is working on a new game, but given various issues with the studio (and publisher EA), it's unlikely to launch anytime soon.\n\nEnter The Expanse: Osiris Reborn. Taking place after the Protomolecule outbreak on Eos station, it follows a mercenary and their crew as they navigate the system and attempt to circumvent a conspiracy. From cover-based shooting and companions with their own unique stories to tactics and decisions that can have a long-term impact on the story, it has everything we could want.\n\nWhile there's still plenty we have to see in terms of gameplay, Osiris Reborn could very well fill the gap left behind by Mass Effect and, if nothing else, serve as an incredible competitor otherwise.",
        "id": 2991246,
        "language": null,
        "link": "https://www.youtube.com/watch?v=EbwZnwpKa9E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EbwZnwpKa9E/hqdefault.jpg",
        "title": "This Game Looks Like The NEXT MASS EFFECT We've So Desperately Wanted",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-22T19:29:20.161214+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-22T13:30:38+00:00",
        "description": "Soon after the year began, Sony continued unravelling its live service plans with more project cancellations and studio closures. Unfortunately, there isn't much hope that things will get back on track, especially after the reveal of Marathon, which has been one blunder after another by Bungie before the recent delay.\n\nHaven Studio's Fairgame$ isn't faring much better, reportedly. Founder Jade Raymond left the studio, and impressions from an external playtest are less than positive. It's allegedly launching in 2026, but it wouldn't be surprising to see it axed before that.\n\nWhile the company has emphasised its big upcoming single-player titles - Death Stranding 2: On the Beach and Ghost of Yōtei - the future is far more nebulous. It almost feels like beating a dead horse, but Sony's live service initiative will go down as one of its biggest failings this generation, if not in the entire history of PlayStation. The worst part is that it's still trying to pursue it in some form.",
        "id": 2991247,
        "language": null,
        "link": "https://www.youtube.com/watch?v=hNZ8w6clqo4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hNZ8w6clqo4/hqdefault.jpg",
        "title": "Sony's Live Service Push Has Done Immense Harm This Generation",
        "vote": 0
    }
]