[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:17.577955+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T18:00:08+00:00",
        "description": "In her TEDxTufts talk, speaker Sarah Lotsoff weaves her personal experience with facts about fentanyl, drug education, harm reduction, and societal attitudes towards each in an effort to address lingering misconceptions and spread awareness about the dangers of accidental fentanyl poisoning. She shares how the sudden loss of her brother motivated her to get involved in harm reduction work on her campus, and urges her audience of college students to educate themselves on the risks associated with substance use because of fentanyl, as well as the ways they can protect themselves and their friends, should they choose to use substances. Through this talk, she hopes to dismantle the “not me” mentality surrounding overdose and encourage others to carry Narcan and use fentanyl test strips in order to prevent future accidental fentanyl poisonings. \n\nSarah is a senior at Tufts, majoring in Philosophy and minoring in Italian. She is the head writer for The Institute Sketch Comedy group on campu",
        "id": 4034594,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7u795_KiMI8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7u795_KiMI8/hqdefault.jpg",
        "title": "What young people should know about fentanyl | Sarah Lotsoff | TEDxTufts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:17.654830+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:59:27+00:00",
        "description": "This talk explores Gen Z’s “Instant Philosophy,” a mindset shaped by YOLO and FOMO that celebrates living in the moment. It delves into how Gen Z values passion, fulfilment, and experiences over convention, seeing time as life’s ultimate currency. Expect fresh insights, real stories, and a powerful reminder to live boldly and authentically because we only live once. Theophilus Ebenezer, a Class 10 student, is driven by insatiable curiosity to explore the world around him. As a passionate swimmer, skilled coder, and confident public speaker, Theo leverages creativity and communication to inspire others. Whether diving into code or presenting ideas on stage, he thrives on challenges that fuel his growth. Today, he brings that same energy to the TEDx stage. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4034595,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HroyI-k-gwM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HroyI-k-gwM/hqdefault.jpg",
        "title": "The Instant Philosophy | Theophilus Johan Ebenezer | TEDxUnion Christian Public School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:17.762010+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:59:19+00:00",
        "description": "This talk explores why we easily forgive fictional characters but struggle to extend the same empathy to real people. It introduces the concept of Narrative Intelligence, our natural ability to understand and empathize when we see someone’s full story and challenges us to apply it in real life. By asking, “What chapter of their life am I seeing?” we can transform judgement into compassion and learn to view others as evolving stories rather than finished outcomes. Ritanshi, a Class 10 student, is a vibrant spirit bursting with curiosity, and creativity. A passionate dancer and painter, she believes art is not just something you create, it’s something you live. She finds beauty in movement, colours, and stories, and when she is not creating, she is lost in the pages of a book or the frames of a movie. At just 15, she brings warmth, laughter, and imagination into everything she does from school projects to baking treats that taste like joy.  She is a true extrovert with an old soul endle",
        "id": 4034596,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=poZtND_svb8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/poZtND_svb8/hqdefault.jpg",
        "title": "Lessons Between Lines | Ritanshi D Shah | TEDxUnion Christian Public School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:17.850597+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:59:12+00:00",
        "description": "Imagine a world without the blue LED, no bright smartphone screens, no energy-efficient lighting, no vibrant digital displays. For years, scientists tried and failed to create it, until three pioneers - Shuji Nakamura, Isamu Akasaki, and Hiroshi Amano achieved the impossible.\nThis talk explores how their invention revolutionized modern technology and what our world would be like without it. More than a story of Science, it’s a story of perseverance, innovation, and the power of human dedication. If they could illuminate the world through sheer determination - why can’t we? Passionate footballer, gifted musician, and a great artist. A Grade 9 student, Samuel is an aspiring lawyer who analyses things with a fresh perspective. A committed learner who accomplishes whatever it may be with sheer dedication and has creativity that reaches beyond the sky. He has a good sense of humour and blends his humour to articulate complex things clearly. He loves to solve puzzles in his free time and fi",
        "id": 4034597,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=S6tXLDVpcpc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/S6tXLDVpcpc/hqdefault.jpg",
        "title": "The Significance of Blue LED | Samuel Jachin Edward P | TEDxUnion Christian Public School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:17.945252+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:58:58+00:00",
        "description": "This talk dives into the true spirit of open source-beyond just free code or fancy programs. It explores how open collaboration can accelerate innovation and solve real-world problems, emphasizing that open source is for everyone, not just experts. Drawing from personal experiences with Google Summer of Code and open source contributions, this talk invites you to embrace curiosity, empathy, and sharing as keys to meaningful impact. Whether you fix a typo or build new tools, your contribution matters in creating a more connected and innovative community. \n Student innovator and GSoC developer shaping the future of open-source robotics. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4034598,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=rsRyLZuqwcw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rsRyLZuqwcw/hqdefault.jpg",
        "title": "Open Source Beyond Code: Building Community and Impact Together | Ashish Ramesh | TEDxMVJCE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.040875+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:58:57+00:00",
        "description": "In this candid TEDx talk, Vinutha N Ramamohan explores the tension and synergy between corporate careers and content creation. Sharing personal stories from her journey as a technology auditor to becoming a creator, she highlights the resilience, discipline, and confidence built in both worlds. From battling societal expectations to juggling brand deals and boardroom meetings, Tarini reveals how success demands grit and consistency—whether climbing the corporate ladder or growing an online audience. Ultimately, she invites us to rethink career choices and embrace a new hybrid future: the CorpFluencer. Food storyteller behind BangaloreGrubHub, curating the city’s vibrant culinary culture. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4034599,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LXdm8JzfgaA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LXdm8JzfgaA/hqdefault.jpg",
        "title": "Battle of Two Futures - Corporate Careers Vs Content Creation | Vinutha Ramamohan | TEDxMVJCE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.130504+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:58:49+00:00",
        "description": "Magician Sharan brings wonder to the TEDxMVJCE stage with an act that challenges logic and celebrates imagination. His performance blurs the line between illusion and truth, inspiring viewers to see everyday moments with curiosity and belief in the impossible. Magician and mentalist from Bangalore, blending sleight, illusion, and wit to mesmerize - and even melt resistance. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4034600,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SBEaeV873xM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SBEaeV873xM/hqdefault.jpg",
        "title": "When Magic Meets the Mind | Sharan Kuttappa | TEDxMVJCE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.219725+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:58:40+00:00",
        "description": "Through her TEDxMVJCE performance, Indu blends rhythm, storytelling, and emotion to showcase how Bharatanatyam transcends tradition. Her dance captures timeless expressions of culture, discipline, and individuality, reminding audiences that art speaks louder than words. Classical dancer and yoga practitioner exploring the philosophy of movement. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4034602,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GgY1_P7c7EE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GgY1_P7c7EE/hqdefault.jpg",
        "title": "From Gesture to Universe: The Imaginative Power of Bharatanatyam | Indu Santosh | TEDxMVJCE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.305225+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:58:32+00:00",
        "description": "Discover how the simple yet profound concept of tessellation shapes our identity and community in this inspiring TEDx talk by Aryan and Deepak, founders of Daud Run Club. From small towns to building a family of 35,000 runners, they explore how individual stories, struggles, and steps tessellate together to form a beautiful mosaic of belonging. This talk highlights how movement creates community, turning strangers into friends, and changing lives one run at a time. Join them in celebrating the power of collective energy and the mosaic of human connection.\n Co-founders of Daud Run Club, redefining fitness culture through community and endurance. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4034604,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Cbu6gFlxaIg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Cbu6gFlxaIg/hqdefault.jpg",
        "title": "The Beauty of Consistency: Our Journey of Small Wins | Aryan Prasad & Deepak Dang | TEDxMVJCE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.390655+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:58:24+00:00",
        "description": "Join Tarini Sai Padmanabhuni on a thought-provoking journey through the rapid evolution and profound impact of AI in our world. From early childhood curiosity about machine learning to real-world challenges posed by deepfakes, Tarini shares her personal experiences and entrepreneurial mission to build trust in AI technologies. Discover how communities and ecosystems power innovation, and why responsible AI scaling is essential as the technology reshapes industries and society. This TEDx talk inspires creators to build with ethics and purpose in an AI-powered future. Founder of Axory AI, tackling deepfakes and digital authenticity at just 21. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4034606,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CfCECy2KRf4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CfCECy2KRf4/hqdefault.jpg",
        "title": "From AI Curiosity to Building the Internet's Trust Layer | Tarini Sai Padmanabhuni | TEDxMVJCE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.479831+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:58:11+00:00",
        "description": "Join us as we explore how the simple yet profound concept of tessellation shapes our identity and societies. Through metaphors from nature—like honeycombs and animal patterns—and insights from psychology and neuroscience, this TEDx talk reveals how our brains naturally tessellate stories, habits, and beliefs to form a coherent self. Discover how the patterns we see, tell, and repeat forge both individual and collective mosaics—highlighting the power of patterns in shaping who we are and how we connect in the world. A compelling blend of science, art, and philosophy, this talk invites you to see life's intricate tessellations everywhere. Multi-faceted creator blending neuroscience, storytelling, and self-expression. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4034608,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZbkVm6o0HLY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZbkVm6o0HLY/hqdefault.jpg",
        "title": "Tessellations and Identity: How Repeated Patterns Build Our Sense of Self | Amaal Kai | TEDxMVJCE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.570953+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:57:48+00:00",
        "description": "What if every failure you feared was actually your greatest teacher? In this heartfelt talk, Ar.  Pankaj Chiraniya takes us on an honest journey through struggle, self-doubt, and the unexpected beauty of falling short. With stories drawn from his own life and creative path, he reveals how the moments that break us often become the ones that build us. “Fail Forward” isn’t just about bouncing back—it’s about transforming pain into purpose, turning setbacks into stepping stones, and learning to see failure as the heartbeat of success. This talk will make you rethink the way you define “losing,” and inspire you to rise—stronger, braver, and unstoppable. Ar. Pankaj Chiraniya is an award-winning architect and interior designer with over 20 years of experience in creating vastu-compliant and emotionally resonant spaces. As the founder of Chiraniya Consultancy, he has garnered nationwide recognition for his work. His book, \"Creating Your Own Paradise on Earth,\" is a guide to mindful living th",
        "id": 4034610,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1cWgXa6HxvY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1cWgXa6HxvY/hqdefault.jpg",
        "title": "Fail Forward: Struggle Shapes Success  | Ar. Pankaj Satyanarayan Chiraniya | TEDxNerul",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.656981+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:57:34+00:00",
        "description": "We graduate with degrees but often lack what real life demands.\nIn this candid and humorous talk, Rohan Mathur uses the high-stakes world of Formula 1 racing as a metaphor for the journey after graduation. Just as F1 drivers must qualify through Q1, Q2, and Q3 before racing, graduates must navigate uncharted territory - from telling your boss they're wrong without getting fired, to understanding what your partner really means when they say \"I'm fine.\"\nDrawing from personal failures and hard-won lessons, Rohan shares five essential mindsets: cultivating a growth mindset, finding your purpose, avoiding comparison traps, embracing abundance, and learning timeless wisdom from the Bhagavad Gita. But most importantly, he delivers a powerful call to action: you are the driver of your own learning, and it's time to take the wheel.\nWhether you're fresh out of university or years into your career, this talk will inspire you to stop improvising and start preparing for your own Race to Q1. Rohan ",
        "id": 4034612,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=niUz3oka6UQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/niUz3oka6UQ/hqdefault.jpg",
        "title": "Life skills that matter in the real world | Rohan Mathur | TEDxNerul",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.742920+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:57:27+00:00",
        "description": "In this heart-stirring talk, Rima Bhandari Energy Coach & Healer based at Tokyo ,shares her personal journey of breaking down behind a perfect-looking life and how the quiet act of choosing herself became the turning point. With grace, emotion, and gentle truth, she redefines self-love, not as a luxury or Instagram trend, but as a daily survival skill. Through powerful reflections and simple, soulful practices, this talk offers a roadmap for anyone feeling lost in the noise of expectations, comparison, or burnout. “Ideas in Action” takes a tender form here, through the small, loving decisions we make to come home to ourselves. Rima Bhandari is an Author & Energy Awareness Educator based in Tokyo. She helps people reconnect with their true selves using ancient Indian wisdom and intuitive energy work.\nHer 1:1 curated sessions support healing emotional wounds, releasing limiting beliefs, and creating a life of purpose, peace, and joy. She also works with children, seniors, and even pets ",
        "id": 4034613,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0LkvrfWOMWE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0LkvrfWOMWE/hqdefault.jpg",
        "title": "Learning to Love & Heal Yourself | Rima Bhandari | TEDxNerul",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:22:18.838749+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:57:19+00:00",
        "description": "In this inspiring and forward looking talk, Vinayak Kharche explores how digital transformation is not just about adopting new technologies, it is about reimagining how we think, work, and lead.\nHe invites us to imagine a world where every decision is powered by real-time data, Humans and machines communicate seamlessly, the future is simulated before it is actually built. This vision is made possible through Digital Twins, which mirror physical assets and enable intelligent feedback loops. Drawing from his experience in the oil and gas industry, Vinayak emphasizes that data is the new oil, a strategic asset that drives smarter decisions and operational excellence.\nBut transformation is not easy. With 70–80% of digital initiatives failing, he breaks down the key reasons: lack of strategy, siloed structures, legacy systems, and short-term ROI pressures.\nVinayak redefines the traditional transformation framework People, Process, Technology by placing Data at the center, connecting and e",
        "id": 4034614,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nKpJHbp6eXI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nKpJHbp6eXI/hqdefault.jpg",
        "title": "The Pillars of Digital Transformation that Powers Real Change | Vinayak Kharche | TEDxNerul",
        "vote": 0
    }
]