[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T23:58:56.140974+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T23:40:00+00:00",
        "description": "The PDF Association is adding JPEG XL (JXL) support to the PDF specification, giving the advanced image format a new path to relevance despite Google's decision to declare it obsolete and remove it from Chromium. The Register reports: Peter Wyatt, CTO of the PDF Association, said: \"We need to adopt a new image [format] that can support HDR [High Dynamic Range] content ... we have picked JPEG XL as our preferred solution.\" Wyatt also praised other benefits of JXL including wide gamut images, ultra-high resolution support for images with more than 1 billion pixels, and up to 4099 channels with up to 32 bits per channel.\n \nThe association is responsible for developing PDF specifications and standards and manages the ISO committee for PDF. JPEG XL is an advanced image format that was designed to be both more efficient and richer in features than JPEG. It was based on a combination of the Free Lossless Image Format (FLIF) from Cloudinary and a Google project called PIK, first released in l",
        "id": 4035543,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/10/2230233/pdf-will-support-jpeg-xl-format-as-preferred-solution",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PDF Will Support JPEG XL Format As 'Preferred Solution'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T23:58:56.238884+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T23:00:00+00:00",
        "description": "Meta is retiring Facebook's external Like and Share buttons for third-party websites on February 10, 2026, officially closing the book on a once-dominant traffic driver as usage declines and Facebook's role within Meta continues to shrink.Engadget reports: The blog post from Meta explains that site admins shouldn't have to take any additional steps as a result of the change, although they can choose to remove the plugins before the discontinue date. Any remaining plugins will \"gracefully degrade,\" which sounds much more dramatic than what will actually happen, which is that they'll render as a 0x0 invisible element.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Is+Killing+Off+the+External+Facebook+Like+Button%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F10%2F2222221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=",
        "id": 4035544,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/10/2222221/meta-is-killing-off-the-external-facebook-like-button",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Is Killing Off the External Facebook Like Button",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T22:58:24.892514+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T22:20:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: For years now, Valve has been slowly improving the capabilities of the Proton compatibility layer that lets thousands of Windows games work seamlessly on the Linux-based SteamOS. But Valve's Windows-to-Linux compatibility layer generally only extends back to games written for Direct3D 8, the proprietary Windows graphics API Microsoft released in late 2000. Now, a new open source project is seeking to extend Linux interoperability further back into PC gaming history. The d7vk project describes itself as \"a Vulkan-based translation layer for Direct3D 7 [D3D7], which allows running 3D applications on Linux using Wine.\"\n \nThe new project isn't the first attempt to get Direct3D 7 games running on Linux. Wine's own built-in WineD3D compatibility layer has supported D3D7 in some form or another for at least two decades now. But the new d7vk project instead branches off the existing dxvk compatibility layer, which is already used by Valve",
        "id": 4035051,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/11/10/2216209/new-project-brings-strong-linux-compatibility-to-more-classic-windows-games",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Project Brings Strong Linux Compatibility To More Classic Windows Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T21:57:10.076813+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T21:30:00+00:00",
        "description": "Wikipedia on Monday laid out a simple plan to ensure its website continues to be supported in the AI era, despite its declining traffic. From a report: In a blog post, the Wikimedia Foundation, the organization that runs the popular online encyclopedia, called on AI developers to use its content \"responsibly\" by ensuring its contributions are properly attributed and that content is accessed through its paid product, the Wikimedia Enterprise platform. \n\nThe opt-in, paid product allows companies to use Wikipedia's content at scale without \"severely taxing Wikipedia's servers,\" the Wikimedia Foundation blog post explains. In addition, the product's paid nature allows AI companies to support the organization's nonprofit mission. While the post doesn't go so far as to threaten penalties or any sort of legal action for use of its material through scraping, Wikipedia recently noted that AI bots had been scraping its website while trying to appear human.<p><div class=\"share_submission\" style=",
        "id": 4034007,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/10/204221/wikipedia-urges-ai-companies-to-use-its-paid-api-and-stop-scraping",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wikipedia Urges AI Companies To Use Its Paid API, and Stop Scraping",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T21:57:10.204197+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T20:51:00+00:00",
        "description": "New submitter benramsey writes: The PHP Foundation has launched a search for its next executive director.\n\n The Executive Director serves as the operational leader of the PHP Foundation, defining its strategic vision and translating it into reality while managing day-to-day operations and serving as the primary bridge between the Board, staff, community, and sponsors.\n\n While the programming language PHP is over 30 years old, the PHP Foundation was only created in 2021. The Executive Director will be responsible for maturing the foundation's internal structure and will play a crucial role in ensuring the foundation can effectively support this vital ecosystem.\n\n Interested parties are encouraged to submit a cover letter describing their interest and relevant experience, resume or CV, and a brief vision statement detailing the applicant's understanding of the position, key opportunities and challenges they see for the foundation, and their approach to the role.<p><div class=\"share_subm",
        "id": 4034008,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/10/194259/the-php-foundation-is-seeking-a-new-executive-director",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The PHP Foundation Is Seeking a New Executive Director",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T21:57:10.314925+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T20:10:00+00:00",
        "description": "Air passengers departing Singapore will pay a green fuel levy of as much as S$41.60 ($31.95) from next year as the city-state locks in a key step in its effort to cut the aviation industry's emissions. From a report: Travelers flying in economy and premium economy, as well as those on short-haul routes, will be charged far less. Those customers will pay an additional S$1 for trips to Southeast Asia, and S$10.40 for flights to the Americas, the Civil Aviation Authority of Singapore said Monday. Business and first class travelers will pay four times more, it said. [...] The funds collected from passengers will go to the centralized purchase of sustainable aviation fuel -- typically made from waste oils or agricultural feedstock -- as Singapore looks to achieve a SAF adoption rate of 3% to 5% by 2030.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=World's+First+Green+Fuel+Levy+To+Add+Almost+%2432+To+Air+Fares%3A+https%",
        "id": 4034009,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/10/1927209/worlds-first-green-fuel-levy-to-add-almost-32-to-air-fares",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World's First Green Fuel Levy To Add Almost $32 To Air Fares",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T21:57:10.428321+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T19:35:00+00:00",
        "description": "An anonymous reader shares a report: Apple is delaying the release of next year's version of the iPhone Air, its thinnest smartphone, after the first model sold below expectations, according to three people involved in the project. \n\nAlthough the length of the delay remains uncertain, the product won't be released in fall 2026 as previously planned, they said. Apple has already sharply scaled back production of the first version, according to multiple people with direct knowledge of the matter.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Delays+Release+of+Next+iPhone+Air+Amid+Weak+Sales%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F11%2F10%2F1935215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F11%2F10%2F1935215%2Fapple-delays-re",
        "id": 4034010,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/10/1935215/apple-delays-release-of-next-iphone-air-amid-weak-sales",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Delays Release of Next iPhone Air Amid Weak Sales",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T21:57:10.560135+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T18:59:00+00:00",
        "description": "Human-resources departments in American companies employed 1.3 million professionals in 2024, a 64% increase over ten years. Overall employment grew 14% in the same period. Professional-services and technology firms saw the number of HR workers double since 2014. Similar patterns have emerged in Australia, Britain and Germany. \n\nChief human-resources officers also gained ground financially. Their total compensation, which stood at 40% of the average director's salary in 1992, reached 70% by 2022, according to a Stanford University study. Mary Barra, who runs General Motors, previously held the carmaker's top HR position. \n\nThe expansion has followed several workplace disruptions, including the Me Too movement, the pandemic's shift to remote work, and the rise of diversity initiatives, Economist reports. Companies also faced more state regulations on employee relations and a jump in workplace complaints. The average number of discrimination or harassment allegations rose from six per 1",
        "id": 4034011,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/10/1859225/how-hr-took-over-the-world",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How HR Took Over the World",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T21:57:10.737500+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T18:10:00+00:00",
        "description": "After more than a decade of planning, the launch of the African Medicines Agency (AMA) is being celebrated in Mombasa, Kenya, this week at the Seventh Biennial Scientific Conference on Medical Products Regulation in Africa. From a report: The agency's establishment marks a pivotal moment in Africa's public health, at a time when the need for biomedical research conducted in Africa, focused on African health problems, has never been greater. Africa holds higher levels of human genetic diversity than anywhere else on Earth, but this diversity has not been adequately studied. And many globally approved treatments and vaccines for diseases such as HIV/AIDS, malaria and tuberculosis are less effective, and can even be harmful in some people of African ancestry. \n\nThis year, cuts of billions of US dollars in international funding for biomedical research and health services in Africa have left millions of people without access to life-saving treatments or, in the case of researchers and heal",
        "id": 4034012,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/10/1755247/africa-finally-has-its-own-drug-regulation-agency",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Africa Finally Has Its Own Drug-Regulation Agency",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T21:57:11.001052+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T17:30:00+00:00",
        "description": "An anonymous reader shares a report: Spotify is the most popular music streaming service in the world. While its algorithmic recommendations aren't necessarily the reason, its reach has meant that hundreds of millions of people are being fed a steady diet of music curated by a machine. Spotify's goal is to keep you listening no matter what. In her book Mood Machine, journalist Liz Pelly recounts a story told to her by a former Spotify employee in which Daniel Ek said, \"our only competitor is silence.\" \n\nAccording to this employee, Spotify leadership didn't see themselves as a music company, but as a time filler. The employee explained that, \"the vast majority of music listeners, they're not really interested in listening to music per se. They just need a soundtrack to a moment in their day.\" Simply providing a soundtrack to your day might seem innocent enough, but it informs how Spotify's algorithm works. Its goal isn't to help you discover new music, its goal is simply to keep you li",
        "id": 4034013,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/10/1723223/the-algorithm-failed-music",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Algorithm Failed Music",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T21:57:11.192374+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T16:51:00+00:00",
        "description": "Two of the world's biggest data center developers have projects in Nvidia's hometown that may sit empty for years because the local utility isn't ready to supply electricity. From a report: In Santa Clara, California, where the world's biggest supplier of artificial-intelligence chips is based, Digital Realty Trust applied in 2019 to build a data center. Roughly six years later, the development remains an empty shell awaiting full energization. Stack Infrastructure, which was acquired earlier this year by Blue Owl Capital, has a nearby 48-megawatt project that's also vacant, while the city-owned utility, Silicon Valley Power, struggles to upgrade its capacity. \n\nThe fate of the two facilities highlights a major challenge for the US tech sector and indeed the wider economy. While demand for data centers has never been greater, driven by the boom in cloud computing and AI, access to electricity is emerging as the biggest constraint. That's largely because of aging power infrastructure, ",
        "id": 4034014,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/10/1651245/data-centers-in-nvidias-hometown-stand-empty-awaiting-power",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Data Centers in Nvidia's Hometown Stand Empty Awaiting Power",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T16:29:38.604876+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T16:11:00+00:00",
        "description": "Tim Berners-Lee thinks AI will help the web, not destroy it. The inventor of the World Wide Web has spent years warning about platform concentration and social media's corrosive effects, but he views AI differently. AI has accomplished what his Semantic Web project could not. The technology extracts structured data from websites regardless of how the information was formatted. Berners-Lee spent decades trying to convince database owners to make their systems machine-readable voluntarily. AI companies simply took the data anyway. They achieved the machine-readable internet through extraction rather than cooperation, but the result is the same. \n\nBerners-Lee also weighed in on the growing browser competition in the market. OpenAI released Atlas a few weeks ago. Perplexity has launched Comet. Google has expanded AI features in Chrome. All these browsers run on Chromium, which Berners-Lee acknowledges is not ideal, but conceded that browser engines are expensive to build. He thinks Apple'",
        "id": 4032552,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/10/1611252/tim-berners-lee-says-ai-will-not-destroy-the-web",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tim Berners-Lee Says AI Will Not Destroy the Web",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T15:29:07.997638+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T15:21:00+00:00",
        "description": "Investment in subsea cable projects is expected to reach around $13 billion between 2025 and 2027, almost twice the amount invested between 2022 and 2024, according to telecommunications data provider TeleGeography. Tech giants Meta, Google, Amazon and Microsoft now represent about 50% of the overall market, up from a negligible share a decade ago. \n\nThe companies are expanding their subsea infrastructure to connect growing networks of data centers needed for AI development. Meta announced Project Waterworth in February, a 50,000-kilometer cable connecting five continents that will be the world's longest subsea cable project. Amazon announced its first wholly-owned subsea cable called Fastnet, connecting Maryland to Ireland. Google has invested in over 30 subsea cables. Over 95% of international data and voice call traffic travels through nearly a million miles of underwater cables.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.co",
        "id": 4031956,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/10/1414217/subsea-cable-investment-set-to-double-as-tech-giants-accelerate-ai-buildout",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Subsea Cable Investment Set To Double As Tech Giants Accelerate AI Buildout",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T15:29:08.233362+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T14:41:00+00:00",
        "description": "An anonymous reader shares a report: Microsoft, eager to boost downloads of its Copilot chatbot, has recruited some of the most popular influencers in America to push a message to young consumers that might be summed up as: Our AI assistant is as cool as ChatGPT. Microsoft could use the help. The company recently said its family of Copilot assistants attracts 150 million active users each month. But OpenAI's ChatGPT claims 800 million weekly active users, and Google's Gemini boasts 650 million a month. Microsoft has an edge with corporate customers, thanks to a long history of selling them software and cloud services. But it has struggled to crack the consumer market -- especially people under 30. \n\n\"We're a challenger brand in this area, and we're kind of up and coming,\" Consumer Chief Marketing Officer Yusuf Mehdi said in an interview. Mehdi hopes to persuade key influencers to make Copilot their chatbot of choice and then use their popularity to market the assistant to their millio",
        "id": 4031957,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/10/1334256/microsoft-bets-on-influencers-to-close-the-gap-with-chatgpt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Bets on Influencers To Close the Gap With ChatGPT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T14:28:26.853480+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T14:00:00+00:00",
        "description": "Visa and Mastercard are nearing a settlement with merchants that aims to end a 20-year-old legal dispute by lowering fees stores pay and giving them more power to reject certain credit cards, WSJ reports, citing people familiar with the matter. From the report: Under terms being discussed, Visa and Mastercard would lower credit-card interchange fees, which are often between 2% and 2.5%, by an average of around 0.1 percentage point over several years, the people said. They would also loosen rules that require merchants that accept one of a network's credit cards to accept all of them. \n\nA deal could be announced soon, the people said, and would require court approval to take effect. If an agreement is finalized, consumers could see big changes at the register. Merchants that accept one kind of Visa credit card wouldn't have to accept all Visa credit cards, for example. Under the current talks, credit-card acceptance would be divided into several categories including rewards credit card",
        "id": 4031468,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/10/1328225/visa-and-mastercard-near-deal-with-merchants-that-would-change-rewards-landscape",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Visa and Mastercard Near Deal With Merchants That Would Change Rewards Landscape",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T13:27:46.562760+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T12:34:00+00:00",
        "description": "Should we leave space exploration to robots &mdash; or prioritize human spaceflight, making us a multiplanetary species? \n\nHarvard professor Robin Wordsworth, who's researched the evolution and habitability of terrestrial-type planets, shares his thoughts:\n\n\n\nIn space, as on Earth, industrial structures degrade with time, and a truly sustainable life support system must have the capability to rebuild and recycle them. We've only partially solved this problem on Earth, which is why industrial civilization is currently causing serious environmental damage. There are no inherent physical limitations to life in the solar system beyond Earth &mdash; both elemental building blocks and energy from the sun are abundant &mdash; but technological society, which developed as an outgrowth of the biosphere, cannot yet exist independently of it. The challenge of building and maintaining robust life-support systems for humans beyond Earth is a key reason why a machine-dominated approach to space exp",
        "id": 4030935,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/10/0215252/whats-the-best-ways-for-humans-to-explore-space",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What's the Best Ways for Humans to Explore Space?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T10:25:31.102494+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T09:30:00+00:00",
        "description": "\"Quantum computing is still years away, but Nvidia just built the bridge that will bring it closer...\" argues investment site The Motley Fool, \"by linking today's fastest AI GPUs with early quantum processors...\" \n\n\nNVIDIA's new hybrid system strengthens communication at microsecond speeds &mdash; orders of magnitude faster than before &mdash; \"allowing AI to stabilize and train quantum machines in real time, potentially pulling major breakthroughs years forward.\"\n\n\nCUDA-Q, Nvidia's open-source software layer, lets researchers choreograph that link &mdash; running AI models, quantum algorithms, and error-correction routines together as one system. That jump allows artificial intelligence to monitor [in real time]... For researchers, that means hundreds of new iterations where there used to be one &mdash; a genuine acceleration of discovery. It's the quiet kind of progress engineers love &mdash; invisible, but indispensable... \n\nIts GPUs (graphics processing units) are already tuned fo",
        "id": 4029700,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/10/0648228/nvidia-connects-ai-gpus-to-early-quantum-processors",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NVIDIA Connects AI GPUs to Early Quantum Processors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T06:17:11.829130+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T05:59:00+00:00",
        "description": "The Rust Foundation has a responsibility to \"shed light on the impact of supporting the often unseen work\" that keeps the Rust Project running. So this week they announced a new initiative \"to provide consistent, transparent, and long term support for the developers who make the Rust programming language possible.\" \n\n\n\n\nIt's the Rust Foundation Maintainers Fund, \"an initiative we'll shape in close collaboration with the Rust Project Leadership Council and Project Directors to ensure funding decisions are made openly and with accountability.\"\n\n\n\n In the months ahead, we'll define the fund's structure, secure contributions, and work with the Rust Project and community to bring it to life. This work will build on lessons from earlier iterations of our grants and fellowships to create a lasting framework for supporting Rust's maintainers... Over the past several months, through ongoing board discussions and input from the Leadership Council, this initiative has taken shape as a way to hel",
        "id": 4028672,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/11/10/0552217/rust-foundation-announces-maintainers-fund-to-ensure-continuity-and-support-long-term-roles",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rust Foundation Announces 'Maintainers Fund' to Ensure Continuity and Support Long-Term Roles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T04:16:02.057537+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T03:59:00+00:00",
        "description": "The nonprofit Dust-to-Digital Foundation is making thousands of historic songs accessible to the public for free through a new partnership with the University of California, Santa Barbara. The songs represent \"some of the rarest and most uniquely American music borne from the Jazz Age and the Great Depression,\" according to the university, and classic blues recordings or tracks by Fiddlin' John Carson and his daughter Moonshine Kate \"would have likely been lost to landfills and faded from memory.\" \n\n\n\n\nLaunched in 1999 by Lance and April Ledbetter, Dust-to-Digital focused on preserving hard-to-find music. Originally a commercial label producing high-quality box sets (along with CDs, records, and books), it established a nonprofit foundation in 2010, working closely with collectors to digitize and preserve record collections. And there's an interesting story about how they became familiar with library curator David Seubert...\n\nOnce a relationship is established, Dust-to-Digital sets up",
        "id": 4028180,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/10/0357222/nonprofit-releases-thousands-of-rare-american-music-recordings-online",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nonprofit Releases Thousands of Rare American Music Recordings Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T02:14:52.741948+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T01:35:00+00:00",
        "description": "The literary magazine of the Phi Beta Kappa society argues \"the replacement of human readers by AI has lately become a real possibility. \n\n\"In fact, there are good reasons to think that we will soon inhabit a world in which humans still write, but do so mostly for AI.\"\n\n\n\n\"I write about artificial intelligence a lot, and lately I have begun to think of myself as writing for Al as well,\" the influential economist Tyler Cowen announced in a column for Bloomberg at the beginning of the year. He does this, he says, because he wants to boost his influence over the world, because he wants to help teach the AIs about things he cares about, and because, whether he wants to or not, he's already writing for AI, and so is everybody else. Large-language-model (LLM) chatbots such as ChatGPT and Claude are trained, in part, by reading the entire internet, so if you put anything of yourself online, even basic social-media posts that are public, you're writing for them. \n\nIf you don't recognize this ",
        "id": 4027743,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/10/0133240/what-happens-when-humans-start-writing-for-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happens When Humans Start Writing for AI?",
        "vote": 0
    }
]