[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T16:53:47.686129+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T16:01:05+00:00",
        "description": "Mysteria Ecclesiae is the final DLC for Kingdom Come: Deliverance 2, and offers a smaller, more personal adventure for Henry. Set in Sedletz Monastery, the DLC’s story revolves around investigating the outbreak of a mysterious disease around the building, affecting various characters.\n\nUnlike previous DLCs, Mysteria Ecclesiae focuses on investigation and social interaction with minimal combat. While it introduces new characters, and a captivating story, it doesn't bring any new gameplay mechanics. The DLC also has a major drawback in how isolated it feels from the world of the base game, both in terms of the zone itself, as well as the story. \n\nDespite this, it is still a polished and enjoyable DLC for Kingdom Come: Deliverance 2.",
        "id": 4032677,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=es_Q2v5lw_Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/es_Q2v5lw_Y/hqdefault.jpg",
        "title": "Kingdom Come Deliverance 2 Mysteria Ecclesiae DLC Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T13:50:14.476843+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T13:30:46+00:00",
        "description": "There's a lot to do in Where WInds Meet, a lot of potential ways to fall in love with the creative flourishes that Everstone's wuxia-based adventure is bringing to us. While it's quite hard to pick parts of the experience that stand out considering how special it's shaping up to be, there are certain moments in the game that we just can't wait to try out. \n\nFrom leaps into the skies like a superhero to making the most of a combat system that shows a lot of promise, we've put together a few of the things we're going to try as soon as we dive into the game. You might just find another reason to be as excited as we are about the adventure, so join us as we elaborate.",
        "id": 4031053,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=guItDB3RV20",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/guItDB3RV20/hqdefault.jpg",
        "title": "Where Winds Meet - 15 Things We Can't Wait To Do",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-10T09:43:17.275625+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-10T09:30:22+00:00",
        "description": "Kirby Air RIders is quite an exciting addition to the Switch 2's ranks. It carries not only the weight of its titular characters' immense popularity in modern gaming, but must also live up to the legacy of Kirby Air Ride, the GameCube title that inspired it. \n\nBandai Namco and Nintendo seem poised for a win with this one, bringing excellent additions to its core experience that are sure to feel familiar to fans of the original game, but also fresh to newcomers looking to dip their toes in the Kirby universe. If you're thinking about picking this one up, join us and take a look at some of the most important things it has to offer when it releases later this month.",
        "id": 4029466,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=jTluPEbm0SE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jTluPEbm0SE/hqdefault.jpg",
        "title": "Kirby Air Riders - 15 Things YOU NEED TO KNOW Before You Buy",
        "vote": 0
    }
]