[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T22:59:37+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Monday, Chinese AI lab DeepSeek released its new R1 model family under an open MIT license, with its largest version containing 671 billion parameters. The company claims the model performs at levels comparable to OpenAI's o1 simulated reasoning (SR) model on several math and coding benchmarks. Alongside the release of the main DeepSeek-R1-Zero and DeepSeek-R1 models, DeepSeek published six smaller \"DeepSeek-R1-Distill\" versions ranging from 1.5 billion to 70 billion parameters. These distilled models are based on existing open source architectures like Qwen and Llama, trained using data generated from the full R1 model. The smallest version can run on a laptop, while the full model requires far more substantial computing resources.\n \nThe releases immediately caught the attention of the AI community because most existing open-weights models -- which can often be run and fine-tuned on local hardware -- have lagged behind propri",
        "id": 1952430,
        "language": null,
        "link": "https://slashdot.org/story/25/01/21/2138247/cutting-edge-chinese-reasoning-model-rivals-openai-o1?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cutting-Edge Chinese 'Reasoning' Model Rivals OpenAI O1",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T22:59:37+00:00",
        "description": "EA's Origin PC client will be shut down on April 17, 2025, as Microsoft ends support for 32-bit software. \"Anyone still using Origin will need to swap over to the EA app before that date,\" adds Engadget. From the report: For those PC players who have not migrated over to the EA app, the company has an FAQ explaining the latest system requirements. The EA app runs on 64-bit architecture, and requires a machine using Windows 10 or Windows 11. [...] If you're simply downloading the EA app on a current machine, players won't need to re-download their games. And if you have cloud saves enabled, all of your data should transfer without any additional steps.\n \nHowever, it's always a good idea to have physical backups with this type of transition, especially since not all games support cloud saves, and those titles will need to have saved game data manually transferred. Mods also may not automatically make the switch, and EA recommends players check with mod creators about transferring to th",
        "id": 1952429,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/21/2141252/eas-origin-app-for-pc-gaming-will-shut-down-in-april?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EA's Origin App For PC Gaming Will Shut Down In April",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T20:03:42+00:00",
        "description": "More than half of video game developers reported their companies are using generative AI in game development, according to an annual survey released Tuesday. The Game Developers Conference (GDC) report found that 52% of developers worked at companies using AI tools, while 30% felt negatively about the technology, up from 18% last year. Only 13% believed AI had a positive impact on games, down from 21% in 2024. \n\nOne in 10 developers lost their jobs over the past year, with some reporting extended periods of unemployment. One developer cited in a Wired story said they submitted 500 job applications without success, while another reported being laid off three times in the last year. Covid-era over-expansion, unrealistic expectations, and poor management are being identified as key factors behind the industry's troubles.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Game+Developers+Are+Getting+Fed+Up+With+Their+Bosse",
        "id": 1951373,
        "language": null,
        "link": "https://games.slashdot.org/story/25/01/21/1856248/game-developers-are-getting-fed-up-with-their-bosses-ai-initiatives?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Game Developers Are Getting Fed Up With Their Bosses' AI Initiatives",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T18:53:46+00:00",
        "description": "Britain will launch a digital wallet app later this year allowing citizens to store government documents on their smartphones, UK Science Secretary Peter Kyle announced on Tuesday. The GOV.UK Wallet, available on Android and iOS, will first support veteran cards followed by driver's licenses in late 2025, with plans to eventually include passports, marriage certificates and benefit documents. \n\nThe app will use facial recognition for security. \"The overflowing drawer rammed with letters from the government and hours spent on hold to get a basic appointment will soon be consigned to history,\" Kyle said. The Labour government aims to have all UK agencies offering digital alternatives to physical documents by 2027. Officials said users can recover their digital credentials if phones are lost, adding the system complies with existing data protection laws.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK+To+Launch+Digi",
        "id": 1950876,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/21/1844251/uk-to-launch-digital-wallet-for-passports-driving-licences-and-more?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK To Launch Digital Wallet For Passports, Driving Licences, and More",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T18:53:46+00:00",
        "description": "The United States will withdraw from the World Health Organization, according to an executive order signed by President Donald Trump, who cited WHO's mishandling of the COVID-19 pandemic and demands for \"unfairly onerous payments\" from Washington. \n\nThe order -- which takes a year to go into effect -- halts U.S. funding to WHO and recalls American personnel working with the organization. It also revokes a January 2021 letter that had kept the U.S. in WHO after an earlier withdrawal attempt. The White House ordered officials to find new partners to take over WHO-led activities and directed a review of the 2024 U.S. Global Health Security Strategy.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+To+Exit+WHO%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F01%2F21%2F1810255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http:/",
        "id": 1950877,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/21/1810255/us-to-exit-who?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US To Exit WHO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T17:48:37+00:00",
        "description": "Scale AI CEO Alexandr Wang is taking out a full-page ad in The Washington Post on Tuesday with a succinct message for the new US commander-in-chief: \"Dear President Trump, America must win the AI war.\" From a report: The ad also pointed readers to a five-point plan that would reorient the federal government to invest more in the technology and overhaul priorities for that funding. In an exclusive interview with Semafor, Wang said he was motivated to make his recommendations by a new White House that is both planning to aggressively support new technology and courting input from the industry. \n\n\"They're listening,\" he said. \"This incoming administration wants to move fast and take a lot of action and really be quite ambitious about a lot of these issues.\" [...] \"What's undeniable, if you think about what the future is going to look like, is the degree to which the amount of computational capability you have will be directly related to how strong your AI capabilities are,\" Wang said be",
        "id": 1950427,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/21/1715259/scale-ai-ceo-to-trump-america-must-win-the-ai-war?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scale AI CEO To Trump: 'America Must Win the AI War'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T17:48:37+00:00",
        "description": "EFishery, one of Indonesia's most prominent startups, may have inflated its revenue and profit over several years, according to an internal investigation triggered by a whistleblower's claim about the company's accounting. Bloomberg News: A preliminary, ongoing probe into the agritech startup, backed by investors including SoftBank and Temasek, estimates that management inflated revenue by almost $600 million in the nine months through September last year, according to a 52-page draft report circulated among investors and reviewed by Bloomberg News. That would mean more than 75% of the reported figures were fake, the report said. \n\nEFishery, which deploys feeders to fish and shrimp farmers in Indonesia, was a darling of the nation's startup scene and scored a valuation of $1.4 billion when G42, an AI firm controlled by United Arab Emirates royal Sheikh Tahnoon bin Zayed Al Nahyan, backed its latest funding round. It has raised hundreds of millions of dollars in an attempt to moderniz",
        "id": 1950428,
        "language": null,
        "link": "https://slashdot.org/story/25/01/21/1640215/softbank-backed-fish-startup-allegedly-faked-most-of-its-sales?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SoftBank-Backed Fish Startup Allegedly Faked Most of Its Sales",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T16:38:47+00:00",
        "description": "An anonymous reader shares a report: Brendan Carr is now formally the chair of the Federal Communications Commission, giving him the power to set the agency's agenda and usher through a host of regulations with major implications for the tech and media industries as soon as he has a Republican majority. In a statement, Carr named a few areas of focus: \"issues ranging from tech and media regulation to unleashing new opportunities for jobs and growth through agency actions on spectrum, infrastructure, and the space economy.\" \n\nCarr's priorities might also be gleaned from a document you might have already heard about: Project 2025. That's because he authored the FCC chapter of the Heritage Foundation's wishlist for a Donald Trump presidency. In that chapter, Carr proposes actions including: limiting immunity for tech companies under Section 230 of the Communications Decency Act, requiring disclosures about how platforms prioritize content, requiring tech companies to pay into a program ",
        "id": 1949735,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/21/1424225/brendan-carr-is-officially-in-charge-of-the-fcc?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Brendan Carr is Officially in Charge of the FCC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T16:38:47+00:00",
        "description": "More than 40% of individual corals monitored around a Great Barrier Reef island were killed last year in the most widespread coral bleaching outbreak to hit the reef system, a study has found. The Guardian: Scientists tracked 462 colonies of corals at One Tree Island in the southern part of the Great Barrier Reef after heat stress began to turn the corals white in early 2024. Researchers said they encountered \"catastrophic\" scenes at the reef. \n\nOnly 92 coral colonies escaped bleaching entirely and by July, when the analysis for the study ended, 193 were dead and a further 113 were still showing signs of bleaching. Prof Maria Byrne, a marine biologist at the University of Sydney and lead author of the study, has been researching and visiting the island for 35 years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Great+Barrier+Reef+Hit+By+Its+Most+Widespread+Coral+Bleaching%2C+Study+Finds%3A+https%3A%2F%2Fnews.slash",
        "id": 1949734,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/21/1535217/great-barrier-reef-hit-by-its-most-widespread-coral-bleaching-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Great Barrier Reef Hit By Its Most Widespread Coral Bleaching, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T16:38:47+00:00",
        "description": "Migrating from VMware's virtualization platform could take up to four years and cost organizations between $300 and $3,000 per virtual machine, Gartner has warned in a new report. Companies running 2,000 or more virtual machines will need up to 10 full-time staff for initial assessment and another six employees for a nine-month technical evaluation, according to Gartner.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=VMware+Migrations+Will+Be+Long%2C+Expensive%2C+and+Risky%2C+Warns+Gartner%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F01%2F21%2F1615241%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F01%2F21%2F1615241%2Fvmware-migrations-will-be-long-expensive-and-risky-warns-gartner%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"http",
        "id": 1949733,
        "language": null,
        "link": "https://it.slashdot.org/story/25/01/21/1615241/vmware-migrations-will-be-long-expensive-and-risky-warns-gartner?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "VMware Migrations Will Be Long, Expensive, and Risky, Warns Gartner",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T14:32:30+00:00",
        "description": "China broke its own record in installing renewable power in 2024, as the world's top polluter continues to push its energy transition while the US shifts away from fighting climate change. From a report: The world's second-largest economy added roughly 277 gigawatts of solar last year, surpassing the previous year's record of 217 gigawatts, the National Energy Administration said in a statement on Tuesday. \n\nIt also added nearly 80 gigawatts of wind, according to the statement. The record installation means China has hit its 2030 renewables target six years early. This stands in contrast to the US, the world's second-biggest emitter of greenhouse gases, where new President Donald Trump has started implementing a hard pivot back to fossil fuels and withdrawn from the Paris climate pact.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China's+Installed+Renewables+Achieved+Yet+Another+Record+in+2024%3A+https%3A%2F%2Fsl",
        "id": 1948856,
        "language": null,
        "link": "https://slashdot.org/story/25/01/21/143251/chinas-installed-renewables-achieved-yet-another-record-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China's Installed Renewables Achieved Yet Another Record in 2024",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T14:32:30+00:00",
        "description": "An anonymous reader quotes a report from Reuters: U.S. President Donald Trump on Monday revoked a 2023 executive order signed by Joe Biden that sought to reduce the risks that artificial intelligence poses to consumers, workers and national security. Biden's order required developers of AI systems that pose risks to U.S. national security, the economy, public health or safety to share the results of safety tests with the U.S. government, in line with the Defense Production Act, before they were released to the public. Four days before leaving office, Biden issued a comprehensive cybersecurity executive order that also targeted AI usage. The directive aimed to leverage AI's security benefits, implement digital identities for citizens, and address vulnerabilities that have allowed Chinese and Russian intrusions into U.S. government systems, among other things. It's unclear at this time if it, too, will be revoked.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"sl",
        "id": 1948857,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/21/0514231/trump-revokes-biden-executive-order-on-addressing-ai-risks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Revokes Biden Executive Order On Addressing AI Risks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T10:29:36+00:00",
        "description": "Ars Technica's John Timmer reports: In Monday's issue of Nature Geoscience, a team of UK-based researchers tackle a big one: Mars' dichotomy, the somewhat nebulous boundary between its relatively elevated southern half, and the low basin that occupies its northern hemisphere, a feature that some have proposed also served as an ancient shoreline. The new work suggests that the edge of the dichotomy was eroded back by hundreds of kilometers during the time when an ocean might have occupied Mars' northern hemisphere. [...] The new work focuses on an area called Mawrth Vallis, which sits at the edge of the dichotomy. Relative to the northern basin, it's a kilometer-high plateau cut by a major outflow channel that seems to have been caused by one or more massive floods. The slopes surrounding the plateau feature different types of clay-derived minerals, suggesting the area had been subject to interactions between the original materials and water.\n \nRather than focusing on the plateau itse",
        "id": 1947577,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/21/0045226/edge-of-mars-great-dichotomy-eroded-back-by-hundreds-of-kilometers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Edge of Mars' Great Dichotomy Eroded Back By Hundreds of Kilometers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T08:10:07+00:00",
        "description": "President Donald Trump signed an executive order today delaying the TikTok ban for 75 days. The Verge reports: The order, issued on Trump's first day of office, is meant to effectively extend the deadline established by The Protecting Americans from Foreign Adversary Controlled Applications Act for ByteDance to sell its stake by undercutting penalties on American companies like Apple and Google working with TikTok. It directs the Attorney General \"not to take any action to enforce the Act for a period of 75 days from today to allow my Administration an opportunity to determine the appropriate course forward in an orderly way.\" The AG is supposed to \"issue a letter to each provider stating that there has been no violation of the statute and that there is no liability for any conduct that occurred.\"\n \nThe order furthermore instructs the Department of Justice to \"take no action to enforce the Act or impose any penalties against any entity for any noncompliance with the Act\" and says the",
        "id": 1947001,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/21/055229/executive-order-delays-tiktok-ban-for-75-days?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Executive Order Delays TikTok Ban For 75 Days",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T05:04:22+00:00",
        "description": "An anonymous reader quotes a report from IEEE Spectrum: The surge of interest in AI is creating a massive demand for computing power. Around the world, companies are trying to keep up with the vast amount of GPUs needed to power more and more advanced AI models. While GPUs are not the only option for running an AI model, they have become the hardware of choice due to their ability to efficiently handle multiple operations simultaneously -- a critical feature when developing deep learning models. But not every AI startup has the capital to invest in the huge numbers of GPUs now required to run a cutting-edge model. For some, it's a better deal to outsource it. This has led to the rise of a new business: GPU-as-a-Service (GPUaaS). In recent years, companies like Hyperbolic, Kinesis, Runpod, and Vast.ai have sprouted up to remotely offer their clients the needed processing power.\n \n[...] Studies have shown that more than half of the existing GPUs are not in use at any given time. Whethe",
        "id": 1945793,
        "language": null,
        "link": "https://idle.slashdot.org/story/25/01/21/0021215/ai-boom-gives-rise-to-gpu-as-a-service?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Boom Gives Rise To 'GPU-as-a-Service'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T05:04:22+00:00",
        "description": "An anonymous reader quotes a report from TorrentFreak: Meta is among a long list of companies being sued for allegedly using pirated material to train its AI models. Meta has never denied using copyrighted works but stressed that it would rely on a fair use defense. However, with rightsholders in one case asking for torrent client data and 'seeding lists' for millions of books allegedly shared in public, the case now takes a geeky turn. [...] A few weeks ago, the plaintiffs asked for permission to submit a third amended complaint (PDF). After uncovering Meta's use of BitTorrent to source copyright-infringing training data from pirate shadow library, LibGen, the request was justified, they argued. Specifically, the authors say that Meta willingly used BitTorrent to download pirated books from LibGen, knowing that was legally problematic. As a result, Meta allegedly shared copies of these books with other people, as is common with the use of BitTorrent.\n \n\"By downloading through the bi",
        "id": 1945797,
        "language": null,
        "link": "https://meta.slashdot.org/story/25/01/20/224209/authors-seek-metas-torrent-client-logs-and-seeding-data-in-ai-piracy-probe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Authors Seek Meta's Torrent Client Logs and Seeding Data In AI Piracy Probe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T05:04:22+00:00",
        "description": "The CIA has developed a chatbot to talk to virtual versions of foreign presidents and prime ministers. \"Understanding leaders around the world is one of the CIA's most important jobs. Teams of analysts comb through intelligence collected by spies and publicly available information to create profiles of leaders that can predict behaviors,\" reports the New York Times. \"A chatbot powered by artificial intelligence now helps do that work.\" From the report: The chatbot is part of the spy agency's drive to improve the tools available to CIA analysts and its officers in the field, and to better understand adversaries' technical advances. Core to the effort is to make it easier for companies to work with the most secretive agency. William Burns, CIA director for the past four years, prioritized improving the agency's technology and understanding of how it is used. Incoming Trump administration officials say they plan to build on those initiatives, not tear them down. [...]\n \nThe CIA has long",
        "id": 1945796,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/20/2214205/cias-chatbot-stands-in-for-world-leaders?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CIA's Chatbot Stands In For World Leaders",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T05:04:22+00:00",
        "description": "The notorious hacker IntelBroker claims to have stolen data from HPE systems, including source code, private repositories, digital certificates, and access to certain services. SecurityWeek reports: The compromised data allegedly includes source code for products such as Zerto and iLO, private GitHub repositories, digital certificates, Docker builds, and even some personal information that the hacker described as \"old user PII for deliveries.\" IntelBroker is also offering access to some services used by HPE, including APIs, WePay, GitHub and GitLab. Contacted by SecurityWeek, HPE said it's aware of the breach claims and is conducting an investigation.\n \n\"HPE became aware on January 16 of claims being made by a group called IntelBroker that it was in possession of information belonging to HPE. HPE immediately activated our cyber response protocols, disabled related credentials, and launched an investigation to evaluate the validity of the claims,\" said HPE spokesperson Adam R. Bauer. ",
        "id": 1945795,
        "language": null,
        "link": "https://it.slashdot.org/story/25/01/20/2359234/hpe-investigating-breach-claims-after-hacker-offers-to-sell-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "HPE Investigating Breach Claims After Hacker Offers To Sell Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T05:04:22+00:00",
        "description": "Many of the world's largest tech companies, including Meta, Google, TikTok, and X, have pledged to European lawmakers that they will do more to prevent and remove illegal hate speech on their platforms. The revised set of voluntary commitments unveiled on Monday aim to help platforms \"demonstrate their compliance\" with the Digital Services Act (DSA) obligations regarding illegal content moderation. The Verge reports: Facebook, Instagram, TikTok, Twitch, X, YouTube, Snapchat, LinkedIn, Dailymotion, Jeuxvideo.com, Rakuten Viber, and Microsoft-hosted consumer services have all signed the \"Code of Conduct on Countering Illegal Hate Speech Online Plus\" -- which is not a terribly named streaming service but an update to a 2016 Code. The revised code commits signatories to transparency around hate speech detection and reduction, to allowing third-party monitors to assess how hate speech notices are reviewed by the platforms, and to review \"at least two-thirds of hate speech notices\" within ",
        "id": 1945794,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/21/0012237/major-tech-firms-sign-eu-pledge-to-tackle-hate-speech?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Major Tech Firms Sign EU Pledge To Tackle Hate Speech",
        "vote": 0
    }
]