[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T18:30:20+00:00",
        "description": "Quality platformer titles certainly haven't been in short supply over the past year or so. Between Animal Well, Prince of Persia: The Lost Crown, and Nine Sols, fans of the genre have been fortunate. Fortunately, Binary Haze's Ender Magnolia: Bloom in the Mist continues this trend.\n\nAfter ten months or so in early access, the sequel to the acclaimed Ender Lilies finally launches in full for PC while simultaneously arriving on PS4, PS5, Xbox Series X/S, and Nintendo Switch. Though it follows a new protagonist in a new setting, The Land of Fumes, the atmosphere and fundamental story-telling channels its predecessor.\n\nBetween its endearing narrative and characters, the gameplay loop may feel a little too familiar, but the execution is top-notch. Whether the gorgeous visuals, stellar combat, addictive exploration or challenging boss fights, Ender Magnolia: Bloom in the Mist delivers it all and then some in stunning fashion.",
        "id": 1950919,
        "language": null,
        "link": "https://www.youtube.com/watch?v=N3fUnlA8ns4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/N3fUnlA8ns4/hqdefault.jpg",
        "title": "ENDER MAGNOLIA: Bloom in the Mist Review - 2025's First Big Hit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T10:00:28+00:00",
        "description": "We’ve never been shy about speaking out against needlessly bloated games, or experiences that shove open worlds where they don’t belong. But as much as we love a tight, compact, linear game, at the same time, there’s no denying the inherent deal of a well-designed open world title that offers players the endless freedom to explore an immaculately crafted map however they wish. \n\nThankfully, there’s never any shortage of such titles in the pipeline and looking ahead at the release schedule for 2025 and beyond, there’s a multitude of exciting upcoming open world titles to look forward to. From sequels to newcomers, from RPGs to crime sims, from spinoffs to more, there’s a host of open world games coming up that we’re going to talk about here.",
        "id": 1947598,
        "language": null,
        "link": "https://www.youtube.com/watch?v=LByR9XGIfZw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LByR9XGIfZw/hqdefault.jpg",
        "title": "15 NEW Open World Games of 2025 And Beyond We Can't Wait To Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-21T03:30:19+00:00",
        "description": "Assetto Corsa EVO has been available in Steam Early Access for PC for about four days. There should be more enthusiasm about its launch, especially with fresh features like the new Driving Academy,  visual improvements and dynamic weather. An open-world map is also in the pipeline for this Summer.\n\nUnfortunately, its launch has faced several issues stemming from the division of its online mode, or lack thereof. For whatever reason, only certain aspects of the racing sim are available offline, which didn't even include the cars until developer Kunos Simulazioni released a hotfix. However, the game economy, Driving Academy, and Special Events remain unavailable. Car customizations also won't remain saved upon exiting the game.\n\nNaturally, this raises issues on the perils of tying extensive portions of a racing sim, especially one in early access, to online servers, as if The Crew, Test Drive Unlimited Solar Crown and DriveClub didn't provide enough tough lessons.",
        "id": 1945846,
        "language": null,
        "link": "https://www.youtube.com/watch?v=NnZtAfWgQok",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NnZtAfWgQok/hqdefault.jpg",
        "title": "What The Hell Is Going On With ASSETTO CORSA EVO?",
        "vote": 0
    }
]