[
    {
        "age": null,
        "album": "",
        "author": "Tomasz Samołyk",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-07T14:55:12.912144+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-07T13:33:14+00:00",
        "description": "Mam ADHD. Ten odcinek jest po to, żebyś może Ty też sprawdził – i mniej cierpiał.\n\nJeśli boisz się dzwonić, unikasz ludzi, masz ciągłe napięcie, gubisz rzeczy, analizujesz wszystko do bólu, a przy tym masz wyrzuty sumienia, że nie jesteś \"taki jak trzeba\" – to może być coś więcej niż tylko charakter.\n\nA może w ogóle Ci to nie przeszkadza – ale masz wrażenie, że niebycie „harpaganem”, „gubiącym myśli”, zapominającym, impulsywnym byłoby lepsze dla Ciebie i Twoich bliskich?\n\nW tym filmie opowiadam swoją historię, jak wyglądało moje życie przed diagnozą i co się zmieniło po terapii i leczeniu. Może to też Twoja historia. A może historia kogoś, kogo kochasz.\n\nTo leczenie pomogło mi też w wierze – wreszcie potrafię się modlić bez zmagania, być przy Bogu bez poczucia winy.\n\n#adhd \n________________\nJeśli macie pytania o moje doświadczenie z ADHD, terapię, leczenie czy psychoedukację – piszcie śmiało - może zrobię drugi odcinek z odpowiedziami. Najlepiej zadawajcie je po obejrzeniu polecanych ",
        "id": 3104130,
        "language": null,
        "link": "https://www.youtube.com/watch?v=pnB0pnZmtp4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 372,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCj5Ug7sV0Id9g-NEfFa1psg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pnB0pnZmtp4/hqdefault.jpg",
        "title": "Boisz się dzwonić, unikasz ludzi, czujesz lęk? Może też masz. Odcinek po to, żebyś mniej cierpiał.",
        "vote": 0
    }
]