[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-07T16:43:50.567789+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-07T15:30:26+00:00",
        "description": "There's something about the Mafia series, even with the very first game, that makes it the perfect complement and antithesis to Rockstar's Grand Theft Auto. While nearly everyone was attempting to capitalise on the success of Grand Theft Auto 3 following its blockbuster release in 2001, Illusion Softworks (later becoming 2K Czech) would stick to its guns with Mafia in 2002, offering a different kind of crime saga. Inspired by cinematic greats like Goodfellas, it focused on Tommy Angelo in a fictitious Prohibition-era city as he joined the Salieri family and became embroiled in a war against the Morellos.\n\nNearly 23 years later, Mafia: The Old Country is set to launch on August 8th for Xbox Series X/S, PS5, and PC, and it's incredible just how similar the situations are. There's still absolutely monstrous amounts of hype for Grand Theft Auto 6, now launching in May 2026, and for all intents and purposes, Hangar 13's title is very much the underdog. Which is fitting because instead of f",
        "id": 3105228,
        "language": null,
        "link": "https://www.youtube.com/watch?v=pPSNb_5isvE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pPSNb_5isvE/hqdefault.jpg",
        "title": "Why Mafia: The Old Country May Be One of the BIGGEST Games of the Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-07T14:32:00.684260+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-07T13:30:25+00:00",
        "description": "Whether you’re looking for objects to collect in an interesting open environment or want some engaging lore behind the locales themselves, these 10 games will probably disappoint. \n\nBloat is the key factor dragging these open worlds down. Stretching out a little bit of quality over a whole lot of quantity tends to make things feel repetitive and stale, and these games do just that. It’s worth noting that the oldest game on this list hails from 2016 while the newest is from 2024. This range demonstrates that the issue of bloated world design has consistently reared its ugly head through the past decade of gaming. \n\nThere are plenty of open world games from that timeframe that manage to balance quality and quantity, delivering a fresh and surprising open world, but these 10 games do just the opposite.",
        "id": 3104064,
        "language": null,
        "link": "https://www.youtube.com/watch?v=W94AweAD8H4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/W94AweAD8H4/hqdefault.jpg",
        "title": "10 Games With Huge Maps That Felt Like A Chore To Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-07T10:32:54.578027+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-07T09:30:21+00:00",
        "description": "While 2025 has seen more ups than downs as far as new video games are concerned, there are some titles that have simply failed to impress despite being very promising on paper. From MindEye’s immense failure to capitalize on a very intriguing premise to Siren’s Rest failing to recapture the magic of Still Wakes the Deep, there have been experiences that we were ultimately disappointed to play. \n\nWe take a look at a few of those experiences, and dive into what made them tick and what made them didn’t. Of course, these are just our opinions and even the worst among them are sure to find a few players who will continue to enjoy them even as other titles come into the spotlight in the second half of 2025. We’re just glad that the hard work sunk into them isn’t going to be entirely wasted.",
        "id": 3102442,
        "language": null,
        "link": "https://www.youtube.com/watch?v=YtK1pPDx6NA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YtK1pPDx6NA/hqdefault.jpg",
        "title": "15 MOST Disappointing Games of 2025 So Far That Sucked [First Half]",
        "vote": 0
    }
]