[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T22:46:34+00:00",
        "description": "A BBC study published yesterday (PDF) found that AI news summarization tools frequently generate inaccurate or misleading summaries, with 51% of responses containing significant issues. The Register reports: The research focused on OpenAI's ChatGPT, Microsoft's Copilot, Google's Gemini, and Perplexity assistants, assessing their ability to provide \"accurate responses to questions about the news; and if their answers faithfully represented BBC news stories used as sources.\" The assistants were granted access to the BBC website for the duration of the research and asked 100 questions about the news, being prompted to draw from BBC News articles as sources where possible. Normally, these models are \"blocked\" from accessing the broadcaster's websites, the BBC said. Responses were reviewed by BBC journalists, \"all experts in the question topics,\" on their accuracy, impartiality, and how well they represented BBC content. Overall: \n- 51 percent of all AI answers to questions about the news",
        "id": 2101190,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/12/2139233/ai-summaries-turn-real-news-into-nonsense-bbc-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Summaries Turn Real News Into Nonsense, BBC Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T22:46:34+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Last night, Apple posted a new support document about migrating purchases between accounts, something that Apple users with long online histories have been waiting on for years, if not decades. If you have movies, music, or apps orphaned on various iTools/.Mac/MobileMe/iTunes accounts that preceded what you're using now, you can start the fairly involved process of moving them over.\n \n\"You can choose to migrate apps, music, and other content you've purchased from Apple on a secondary Apple Account to a primary Apple Account,\" the document reads, suggesting that people might have older accounts tied primarily to just certain movies, music, or other purchases that they can now bring forward to their primary, device-linked account. The process takes place on an iPhone or iPad inside the Settings app, in the \"Media &amp; Purchases\" section in your named account section.\n \nThere are a few hitches to note. You can't migrate purchases f",
        "id": 2101192,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/12/2110211/apple-now-lets-you-move-purchases-between-your-25-years-of-accounts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Now Lets You Move Purchases Between Your 25 Years of Accounts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T22:46:34+00:00",
        "description": "OpenAI has canceled the release of o3 in favor of a \"simplified\" product lineup. CEO Sam Altman said in a post on X that, in the coming months, OpenAI will release a model called GPT-5 that \"integrates a lot of [OpenAI's] technology,\" including o3. TechCrunch reports: The company originally said in December that it planned to launch o3 sometime early this year. Just a few weeks ago, Kevin Weil, OpenAI's chief product officer, said in an interview that o3 was on track for a \"February-March\" launch. \"We want to do a better job of sharing our intended roadmap, and a much better job simplifying our product offerings,\" Altman wrote in the post. \"We want AI to 'just work' for you; we realize how complicated our model and product offerings have gotten. We hate the model picker [in ChatGPT] as much as you do and want to return to magic unified intelligence.\"\n \nAltman also announced that OpenAI plans to offer unlimited chat access to GPT-5 at the \"standard intelligence setting,\" subject to \"a",
        "id": 2101191,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/12/2119245/openai-cancels-its-o3-ai-model-in-favor-of-a-unified-next-gen-release?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Cancels Its o3 AI Model In Favor of a 'Unified' Next-Gen Release",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T22:46:34+00:00",
        "description": "Oracle co-founder and chairman Larry Ellison said governments should consolidate all national data for consumption by AI models, calling this step the \"missing link\" for them to take full advantage of the technology. From a report: Fragmented sets of data about a population's health, agriculture, infrastructure, procurement and borders should be unified into a single, secure database that can be accessed by AI models, Ellison said in an on-stage interview with former British Prime Minister Tony Blair at the World Government Summit in Dubai. \n\nCountries with rich population data sets, such as the UK and United Arab Emirates, could cut costs and improve public services, particularly health care, with this approach, Ellison said. Upgrading government digital infrastructure could also help identify wastage and fraud, Ellison said. IT systems used by the US government are so primitive that it makes it difficult to identify \"vast amounts of fraud,\" he added, pointing to efforts by Elon Mus",
        "id": 2101193,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/02/12/1857208/oracles-ellison-calls-for-governments-to-unify-data-to-feed-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Oracle's Ellison Calls for Governments To Unify Data To Feed AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T18:42:49+00:00",
        "description": "Apple is developing robots for its smart home ecosystem, though mass production is unlikely to begin before 2028, according to widely reliable TF Securities analyst Ming-Chi Kuo. The project remains in early proof-of-concept testing, with Apple exploring both humanoid and non-humanoid designs, he wrote in a post on X. \n\nThe company is focusing on how users interact with robots rather than their physical appearance, prioritizing sensing hardware and software as core technologies, Kuo said. The tech giant has taken an unusual approach by publicly sharing some of its robotics research during this early stage, possibly to recruit talent, the analyst noted. The proof-of-concept phase, which precedes formal product development, serves as Apple's testing ground for product ideas and core technologies. Apple's foldable phone project is also currently in the proof-of-concept phase, he said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.co",
        "id": 2099543,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/12/1522245/apple-explores-robotics-push-for-smart-home-market-analyst-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Explores Robotics Push For Smart Home Market, Analyst Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T18:42:49+00:00",
        "description": "Children working in India's fruit and vegetable markets can perform complex mental calculations with ease, yet struggle with basic written math tests that determine their academic future, according to new research that raises troubling questions about mathematics education worldwide. \n\nThe study, published in Nature, reveals how traditional education systems are failing to tap into the mathematical talents of students who develop practical skills outside the classroom, particularly those from lower-income families. MIT economist Abhijit Banerjee, who grew up watching young market vendors deftly handle complicated transactions, led the research. His team found that while these children could rapidly perform mental arithmetic, they performed poorly on standard written assessments like long division problems. \n\nThe findings come at a critical moment when mathematics education must evolve to meet modern demands, incorporating data literacy and computational skills alongside traditional m",
        "id": 2099542,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/12/162259/childrens-arithmetic-skills-do-not-transfer-between-applied-and-academic-mathematics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Children's Arithmetic Skills Do Not Transfer Between Applied and Academic Mathematics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T18:42:49+00:00",
        "description": "An anonymous reader shares a report: Google has fixed two vulnerabilities that, when chained together, could expose the email addresses of YouTube accounts, causing a massive privacy breach for those using the site anonymously. \n\nThe flaws were discovered by security researchers Brutecat (brutecat.com) and Nathan (schizo.org), who found that YouTube and Pixel Recorder APIs could be used to obtain user's Google Gaia IDs and convert them into their email addresses. The ability to convert a YouTube channel into an owner's email address is a significant privacy risk to content creators, whistleblowers, and activists relying on being anonymous online.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Fixes+Flaw+That+Could+Unmask+YouTube+Users'+Email+Addresses%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F12%2F1443251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_i",
        "id": 2099544,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/12/1443251/google-fixes-flaw-that-could-unmask-youtube-users-email-addresses?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Fixes Flaw That Could Unmask YouTube Users' Email Addresses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T18:42:49+00:00",
        "description": "Google will soon use machine learning to estimate the age of its users. From a report: In an update on Wednesday, Google said it's testing a machine learning model in the US to help determine whether someone is under 18, allowing it to \"provide more age-appropriate experiences\" across its platforms. The age estimation model will use existing data about users, including the sites they visit, what kinds of videos they watch on YouTube, and how long they've had an account to determine their age.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Will+Use+Machine+Learning+To+Estimate+a+User's+Age%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F12%2F1734206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F12%2F1734206%2Fgoogle-will-use-",
        "id": 2099540,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/12/1734206/google-will-use-machine-learning-to-estimate-a-users-age?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Will Use Machine Learning To Estimate a User's Age",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T18:42:49+00:00",
        "description": "Property group startup Opendoor has cut 65 jobs, mostly in India, and is shifting technical hiring to Bay Area and Krakow (Poland). \n\nOpendoor said in a statement: \"As part of our ongoing efforts to enhance efficiency, optimize talent, and streamline operations, we have made the decision to consolidate our Engineering, Product, and Design (EPD) team structure. Moving forward, we will focus our technical hiring efforts in two main hubs: the Bay Area, California and Krakow, Poland.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Opendoor+Cuts+Jobs+in+India%2C+Shifts+Technical+Hiring+To+Bay+Area+and+Krakow%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F12%2F1742246%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F12%2F1742246%2Fopendoor-cuts-jobs",
        "id": 2099539,
        "language": null,
        "link": "https://slashdot.org/story/25/02/12/1742246/opendoor-cuts-jobs-in-india-shifts-technical-hiring-to-bay-area-and-krakow?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Opendoor Cuts Jobs in India, Shifts Technical Hiring To Bay Area and Krakow",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T18:42:49+00:00",
        "description": "Most corporate tech leaders are hesitant to deploy AI agents despite vendors' push for rapid adoption, according to a Wall Street Journal CIO Network Summit poll on Tuesday. While 61% of attendees at the Menlo Park summit said they are experimenting with AI agents, which perform automated tasks, 21% reported no usage at all. \n\nReliability concerns and cybersecurity risks remain key barriers, with 29% citing data privacy as their primary concern. OpenAI, Microsoft and Sierra are urging businesses not to wait for the technology to be perfected. \"Accept that it is imperfect,\" said Bret Taylor, Sierra CEO and OpenAI chairman. \"Rather than say, 'Will AI do something wrong', say, 'When it does something wrong, what are the operational mitigations that we've put in place?'\" Three-quarters of the polled executives said AI currently delivers minimal value for their investments. Some companies are \"having hammers looking for nails,\" said Jim Siders, Palantir's chief information officer, descri",
        "id": 2099541,
        "language": null,
        "link": "https://slashdot.org/story/25/02/12/1626227/tech-leaders-hold-back-on-ai-agents-despite-vendor-push-survey-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tech Leaders Hold Back on AI Agents Despite Vendor Push, Survey Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T14:42:01+00:00",
        "description": "Former Google chief Eric Schmidt has warned that western countries need to focus on building open-source AI models or risk losing out to China in the global race to develop the cutting-edge technology. From a report: The warning comes after Chinese startup DeepSeek shocked the world last month with the launch of R1, its powerful-reasoning open large language model, which was built in a more efficient way than its US rivals such as OpenAI. \n\nSchmidt, who has become a significant tech investor and philanthropist, said the majority of the top US LLMs are closed -- meaning not freely accessible to all -- which includes Google's Gemini, Anthropic's Claude and OpenAI's GPT-4, with the exception being Meta's Llama. \"If we don't do something about that, China will ultimately become the open-source leader and the rest of the world will become closed-source,\" Schmidt told the Financial Times. The billionaire said a failure to invest in open-source technologies would prevent scientific discover",
        "id": 2097832,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/12/1345256/ex-google-chief-warns-west-to-focus-on-open-source-ai-in-competition-with-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ex-Google Chief Warns West To Focus On Open-Source AI in Competition With China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T14:42:01+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Popular Science: In 2021, NASCAR unveiled its Next Gen platform that included a number of rule changes from the previous iteration. Now fully symmetrical and using composite body panels instead of metal, the latest NASCAR vehicles are more like the street versions of the Chevrolet Camaro, the Ford Mustang, and the Toyota TRD Camry. Race car driving isn't an inexpensive sport, and one of the goals for the Next Gen platform was to reduce operating costs and create parity across the board. Technique Chassis, the sole chassis manufacturer for the NASCAR Cup Series, builds a modular offering in three parts. As a result, everyone is starting with the same platform, and finding a competitive advantage is in the tiniest details. One smart way to differentiate from the competition is 3D-printed parts. But this isn't your hobbyist level 3D printing.\n \nMinnesota-based Stratasys specializes in \"additive manufacturing,\" the process of creating",
        "id": 2097833,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/12/0052219/how-3d-printed-parts-changed-the-nascar-cup-series?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How 3D-Printed Parts Changed the NASCAR Cup Series",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T10:12:35+00:00",
        "description": "Eric Council Jr. pleaded guilty to identity theft and access device fraud after hijacking the SEC's X account to falsely announce Bitcoin ETF approval. He was compensated in Bitcoin by co-conspirators, and while the Justice Department continues its investigation, Council faces up to five years in prison. Gizmodo reports: According to the Justice Department, Council accessed the SEC's account using an attack called SIM swapping, in which a perpetrator uses social engineering to trick a phone carrier's customer service representatives into transferring an individual's phone number to a new device. Basically, they call into a support line and use pieces of personal information about a victim they have gathered online to convince the representative they are the person they are targeting. Once perpetrators take the number and can begin receiving text messages, they are able to reset the passwords of accounts on services like X. It is not really a \"hack\" in the traditional sense that they ",
        "id": 2096473,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/12/0020213/man-who-hijacked-secs-x-account-to-pump-bitcoin-faces-up-to-5-years-in-prison?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Man Who Hijacked SEC's X Account To Pump Bitcoin Faces Up To 5 Years In Prison",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T07:18:09+00:00",
        "description": "Today, the KDE Project announced the release of KDE Plasma 6.3, featuring improved fractional scaling, enhanced Night Light color accuracy, better CPU usage monitoring, and various UI and security refinements.\n \nSome of the key features of Plasma 6.3 include: \n- Improved fractional scaling with KWin to lead to an all-around better desktop experience with fractional scaling as well as when making use of KWin's zoom effect.\n- Screen colors are more accurate with the KDE Night Light feature.\n- CPU usage monitoring within the KDE System Monitor is now more accurate and consuming fewer CPU resources.\n- KDE will now present a notification when the kernel terminated an app because the system ran out of memory.\n- Various improvements to the Discover app, including a security enhancement around sandboxed apps.\n- The drawing tablet area of KDE System Settings has been overhauled with new features and refinements.\n- Many other enhancements and fixes throughout KDE Plasma 6.3. You can read the a",
        "id": 2094817,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/11/2229240/kde-plasma-63-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "KDE Plasma 6.3 Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T07:18:09+00:00",
        "description": "Chinese animated film Ne Zha 2 has broken multiple box office records, becoming China's highest-grossing film of all time and the first non-Hollywood movie to surpass $1 billion in a single market. From a report: Helmed by Yang Yu, known as Jiaozi, the film hit the big screen during the lucrative Chinese New Year frame on Jan. 29, surpassing 2017's \"Wolf Warrior 2\" to become China's most-watched film. Meanwhile, its total revenue (including presales) hit 8 billion yuan (about 1.12 billion U.S. dollars) by Sunday. In just eight days and five hours after its release, \"Ne Zha 2\" became China's highest-grossing film of all time on Thursday, exceeding the 5.77 billion yuan record set by \"The Battle at Lake Changjin.\" A day later, it overtook \"Star Wars: The Force Awakens\" to become the highest-grossing film ever in a single market, reaching over 6.79 billion yuan (including presales) in China on Friday.\n \nA follow-up to the animated sensation \"Ne Zha,\" which grossed 5 billion yuan and top",
        "id": 2094815,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/02/11/2352240/ne-zha-2-becomes-first-non-hollywood-film-to-hit-1-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Ne Zha 2' Becomes First Non-Hollywood Film To Hit $1 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T07:18:09+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Monday, researcher Johann Rehberger demonstrated a new way to override prompt injection defenses Google developers have built into Gemini -- specifically, defenses that restrict the invocation of Google Workspace or other sensitive tools when processing untrusted data, such as incoming emails or shared documents. The result of Rehberger's attack is the permanent planting of long-term memories that will be present in all future sessions, opening the potential for the chatbot to act on false information or instructions in perpetuity. [...] The hack Rehberger presented on Monday combines some of these same elements to plant false memories in Gemini Advanced, a premium version of the Google chatbot available through a paid subscription. The researcher described the flow of the new attack as:\n \n1. A user uploads and asks Gemini to summarize a document (this document could come from anywhere and has to be considered untrusted).\n2. T",
        "id": 2094814,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/12/0011205/new-hack-uses-prompt-injection-to-corrupt-geminis-long-term-memory?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Hack Uses Prompt Injection To Corrupt Gemini's Long-Term Memory",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T07:18:09+00:00",
        "description": "Alan W. Filion, an 18-year-old from Lancaster, Calif., was sentenced to four years in prison for making nearly 400 false bomb threats and threats of violence (source may be paywalled; alternative source) to religious institutions, schools, universities and homes across the country. The New York Times reports: The threatening calls Mr. Filion made would often cause large deployments of police officers to a targeted location, the Justice Department said in a news release. In some cases, officers would enter people's homes with their weapons drawn and detain those inside. In January 2023, Mr. Filion wrote on social media that his swats had often led the police to \"drag the victim and their families out of the house cuff them and search the house for dead bodies.\"\n \nInvestigators linked Mr. Filion to over 375 swatting calls made in several states, including one that he made to the police in Sanford, Fla., saying that he would commit a mass shooting at the Masjid Al Hayy Mosque. During th",
        "id": 2094816,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/11/2243253/serial-swatter-who-made-nearly-400-threatening-calls-gets-4-years-in-prison?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Serial Swatter' Who Made Nearly 400 Threatening Calls Gets 4 Years In Prison",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T07:18:09+00:00",
        "description": "In August 1990, two hikers in Scotland captured photographs of a mysterious diamond-shaped aircraft accompanied by a Harrier jet, but the images and story were suppressed by the Ministry of Defence (MoD) for decades. Was it a prank, a hoax, an optical illusion or something else entirely? The Guardian's Daniel Lavelle reports on \"what really happened in Calvine.\" Here's an excerpt: On a misty evening in August 1990, two men hiking on the moors surrounding Calvine, a pretty hamlet in Perth and Kinross, claimed to have seen a giant diamond-shaped aircraft flying above them. It apparently had no clear means of propulsion and left no smoke plume; it was silent and static, as if frozen in time. Terrified, they hit the ground and scrambled for cover behind a tree. Then a Harrier fighter jet roared into view, circling the diamond as if sizing it up for a scuffle. One of the men snapped a series of photographs just before the bizarre craft shot away vertically and disappeared.\n \nCraig Lindsay",
        "id": 2094813,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/02/12/0040242/the-mystery-behind-the-best-ufo-picture-ever-seen?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Mystery Behind the Best UFO Picture Ever Seen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-12T07:18:09+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Since 2022, blogging site Tumblr has been teasing its plans to integrate with the fediverse -- the open social web powered by the protocol ActivityPub also used by Mastodon, Threads, Flipboard, and others. Now, the Automattic-owned blogging platform is sharing more information about when and how that integration could actually happen. As it turns out, the current plan to tie Tumblr into the open social web will come about by way of the site's planned move to the WordPress infrastructure. Automattic confirmed to TechCrunch that when the migration is complete, every Tumblr user will be able to federate their blog via ActivityPub, just as every WordPress.com user can today. The company noted that the migration could also allow for other open web integrations, like giving Tumblr users a way to run other custom plug-ins or themes.\n \nLast summer, Automattic announced it would move its half a billion blogs to WordPress, to make it easier ",
        "id": 2094818,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/11/2217231/tumblr-to-join-the-fediverse-after-wordpress-migration-completes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tumblr To Join the Fediverse After WordPress Migration Completes",
        "vote": 0
    }
]