[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T15:30:18+00:00",
        "description": "Dragonkin: The Banished is an indie action RPG that hopes to bring its own unique ideas to the genre with concepts like city management and the Ancestral Grid. While city management feels like it still needs more development time, the Ancestral Grid feels like an absolute fantastic start. \n\nThe system allows players to mix and match all their active and passive abilities in order to create unique effects that can make killing hordes of enemies much more entertaining. Pair that with an interesting story that gets interesting right from the get go thanks to a fantastic prologue, and you have very strong foundations for what can go on to become a great action RPG. \n\nIt also helps that the core minute-to-minute gameplay is quite well done. The only real issues Dragonkin: The Banished has feel like they will get fixed with future updates thanks to it being an Early Access title.",
        "id": 2329635,
        "language": null,
        "link": "https://www.youtube.com/watch?v=lwA-Qn4zLWs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lwA-Qn4zLWs/hqdefault.jpg",
        "title": "What The HELL Is Dragonkin: The Banished?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T13:30:02+00:00",
        "description": "Souls-like titles and action RPGs can feel like a dime a dozen, but there's something special about Nexon's The First Berserker: Khazan. Developed by Neople and based on the Dungeon and Fighter universe, it focuses on Khazan, a legendary general turned disgraced exile who seeks revenge.\n\nIts incredible anime style and intriguing narrative belie how visceral the combat is or how brutal the difficulty can be. While it follows many tenets of titles like Sekiro: Shadows Die Twice and Nioh, The First Berserker: Khazan offers its own flavor of character action. The fact that it's an almost 80-hour adventure (depending on the ending you pursue) is also impressive.\n\nThe First Berserker: Khazan launches on March 27th for Xbox Series X/S, PS5, and PC (with Deluxe Edition owners starting on March 24th). Here are 15 things you need to know before buying, from its various features and environments to what the recently revealed Berserker Mode could be.",
        "id": 2328946,
        "language": null,
        "link": "https://www.youtube.com/watch?v=2NkIpjsVY5c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2NkIpjsVY5c/hqdefault.jpg",
        "title": "The First Berserker: Khazan - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T09:30:02+00:00",
        "description": "Along with an updated roster, WWE 2K25 brings with it a host of new features, including a brand new story for its MyRise mode, as well as the ability to enhance the rivalries you set up in Universe mode through promos. Pair that with an expansive Showcase mode that goes through the legacy of Samoan wrestlers throughout WWE’s history, and you might have what is potentially the biggest release in the franchise yet.\n\nHowever, these ambitions may have been too high. The Showcase mode ends up feeling quite dull since it doesn’t offer up any new insights into the legacy of the Samoan wrestlers that we’re meant to be cheering for. Even MyRise suffers from shortcomings within its story, since it isn’t quite able to hit the emotional peaks of the stories from previous games in the series. The PC version also has its fair share of issues, including the lack of graphics options to tweak, and the strange decision to cap cutscenes at 30 FPS.",
        "id": 2328039,
        "language": null,
        "link": "https://www.youtube.com/watch?v=4GrrhD8OBWc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4GrrhD8OBWc/hqdefault.jpg",
        "title": "WWE 2K25 Review - Two Steps Forward, One Step Back",
        "vote": 0
    }
]