[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T22:34:53+00:00",
        "description": "Cities in Europe \"are dramatically scaling back their relationship with the car,\" reports the Washington Post:\n\n They are removing parking spaces and creating dedicated bike lanes. They are installing cameras at the perimeter of urban centers and either charging the most-polluting vehicles or preventing them from entering. Some are going so far as to put entire neighborhoods off-limits to vehicles. In Norway, Oslo promotes \"car-free livability.\" Paris Mayor Anne Hidalgo touts the \"end of car dependence.\" And while those ideas might sound radical to car-loving Americans, they are fast becoming the norm across the Atlantic, where 340 European cities and towns &mdash; home to more than 150 million people &mdash; have implemented some kind of restrictions on personal car usage... \n\n[V]irtually every major European city is imposing some kind of rule. Milan has a system similar to New York's, charging for access to the city core &mdash; while entirely banning older, highly polluting vehicl",
        "id": 2331446,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/15/056253/340-european-cities-restrict-usage-of-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "340 European Cities Restrict Usage of Cars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T21:30:16+00:00",
        "description": "\"SpaceX founder Elon Musk has said his Starship rocket will head to Mars by the end of next year,\" writes the BBC, \"as the company investigates several recent explosions in flight tests.\"\n\nHuman landings could begin as early as 2029 if initial missions go well, though \"2031 was more likely\", he added in a post on his social media platform X... \n\nThe billionaire said in 2020 that he remained confident that his company would land humans on Mars six years later. In 2024, he said he would launch the first Starships to Mars in 2026, with plans to send crewed flights in four years. \nMusk has said that the coming Mars mission would carry the Tesla humanoid robot \"Optimus\", which was shown to the public last year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Elon+Musk+Says+SpaceX's+First+Mission+to+Mars+Will+Launch+Next+Year%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F03%2F15%2F1947252%2F%3Futm_source%3Dtwitter%",
        "id": 2331195,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/15/1947252/elon-musk-says-spacexs-first-mission-to-mars-will-launch-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Elon Musk Says SpaceX's First Mission to Mars Will Launch Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T20:24:38+00:00",
        "description": "\"Is everything we see around us is sealed within a black hole?\" asks Space.com. \n\nBecause here's the thing. The $10 billion James Webb Space telescope (in operation since 2022) \"has found that the vast majority of deep space and, thus the early galaxies it has so far observed, are rotating in the same direction. While around two-thirds of galaxies spin clockwise, the other third rotates counter-clockwise.\"\n\nIn a random universe, scientists would expect to find 50% of galaxies rotating one way, while the other 50% rotate the other way. This new research suggests there is a preferred direction for galactic rotation... \"It is still not clear what causes this to happen, but there are two primary possible explanations,\" team leader Lior Shamir, associate professor of computer science at the Carl R. Ice College of Engineering, said in a statement. \"One explanation is that the universe was born rotating. \n\n\"That explanation agrees with theories such as black hole cosmology, which postulates",
        "id": 2330939,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/15/1923253/is-our-universe-trapped-inside-a-black-hole?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is Our Universe Trapped Inside a Black Hole?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T19:20:26+00:00",
        "description": "\"Alphabet's Waymo autonomous vehicles are programmed to follow the rules of the road...\" notes the Washington Post. But while the cars obey speed limits and properly use their turn signals &mdash; they also \"routinely violate parking rules.\"\n\nWaymo vehicles driving themselves received 589 tickets for parking violations in 2024, according to records from San Francisco's Municipal Transportation Agency... The robots incurred $65,065 in fines for violations such as obstructing traffic, disobeying street cleaning restrictions and parking in prohibited areas... [Waymo is responsible for 0.05% of the city's fines, according to statistics from the article.] \n\nParking violations are one of the few ways to quantify how often self-driving companies' vehicles break the rules of the road... Some parking violations, such as overstaying in a paid spot, cause inconvenience but do not directly endanger other people. Others increase the risk of crashes, said Michael Brooks, executive director of the ",
        "id": 2330604,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/15/0546205/last-year-waymos-autonomous-vehicles-got-589-parking-tickets-in-san-francisco?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Last Year Waymo's Autonomous Vehicles Got 589 Parking Tickets in San Francisco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T18:15:29+00:00",
        "description": "Slashdot has run nearly a dozen stories about Michael Mann, one of America's most prominent climate scientists and a co-creator of the famous \"hockey stick\" graph of spiking temperatures. In 2012 Mann sued two bloggers for defamation &mdash; and last year Mann finally won more than $1 million, reports the Washington Post. \"A jury found that two conservative commentators had defamed him by alleging that he was like a child molester in the way he had 'molested and tortured' climate data.\" \n\nBut \"Now, a year after that ruling, the case has taken a turn that leaves Mann in the position of the one who owes money.\"\n\n On Wednesday, a judge sanctioned Mann's legal team for \"bad-faith trial misconduct\" for overstating how much the scientist lost in potential grant funding as a result of reputational harm. The lawyers had shown jurors a chart that listed one grant amount Mann didn't get at $9.7 million, though in other testimony Mann said it was worth $112,000. And when comparing Mann's grant ",
        "id": 2330255,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/15/0351230/climatologist-michael-mann-finally-won-a-1m-defamation-suit---but-then-a-judge-threw-it-out?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Climatologist Michael Mann Finally Won a $1M Defamation Suit - But Then a Judge Threw It Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T17:09:42+00:00",
        "description": "\"Cuba's power grid collapsed Friday night,\" reports CNN, \"triggering a nationwide power outage and plunging its more than 10 million people into darkness.\"\n\n\nVideo filmed by CNN in the capital Havana showed streets and buildings shrouded in total darkness, as people used electric torches to navigate the streets. By Saturday morning, the Cuban government officials said that \"microsystems\" &mdash; pockets of electricity &mdash; had been restored in some cities. However, it remains unclear when the island's power system would be fully online again and most people remained in the dark... \n\nIt marks the latest in a series of failures on the Caribbean island struggling with creaking infrastructure, natural disasters and economic turmoil... For nearly a week in October, most of Cuba suffered near-total blackouts, the worst energy outages in decades. While Cubans are used to frequent power outages, to have another nationwide backcourt &mdash; the fourth in six months &mdash; was unsettling f",
        "id": 2329932,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/15/1616223/10-million-cubans-suffer-nationwide-power-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "10 Million Cubans Suffer Nationwide Power Outage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T16:05:16+00:00",
        "description": "Tuesday Microsoft \"surprised everyone,\" writes Neowin, \"by announcing a new change that will radically improve TypeScript performance\" &mdash; porting TypeScript to Go. \n\nInfoWorld writes that \"The initiative promises dramatic improvements in editor startup speed, build times, and memory usage, making it easier to scale TypeScript to large code bases, Microsoft said.\"\n\nMicrosoft's TypeScript team expects to be able to preview command-line type-checking in Go-based tsc by mid-2025, and to deliver a feature-complete Go implementation of TypeScript by the end of the year. [You can build and run the Go code now from Microsoft's new working repository.]\n Developers who use Go-based TypeScript in the Visual Studio Code editor will feel the increased speed in the editor, Microsoft said. The company promises an 8x improvement in project load times, instant comprehensive error listings across entire projects, and greater responsiveness for all language service operations including completion ",
        "id": 2329607,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/15/0233243/why-microsofts-developers-are-porting-typescript-to-go?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why Microsoft's Developers are Porting TypeScript to Go",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T15:00:16+00:00",
        "description": "\"Wind and solar energy generated more electricity in the U.S. than coal for the first time last year,\" reports the Wall Street Journal, \"according to analysis from clean-energy think tank Ember. \n\n\"The two renewable energy sources accounted for 17% of the country's power mix while coal fell to a low of 15%, it said.\"\n\nSolar was the fastest-growing energy source, according to Ember's analysis of data from the U.S. Energy Information Administration, increasing 27% from the year before, while wind rose 7%... Natural gas generation increased 3.3% in 2024, according to Ember, and remains by far the largest source of electricity in the U.S., accounting for 43% of the mix... \nCalifornia and Nevada both surpassed 30% annual share of solar in their electricity mix for the first time last year (32% and 30%, respectively). California's battery growth was key to its solar success. It installed 20% more battery capacity than it did solar capacity, which helped it transfer a significant share of i",
        "id": 2329233,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/15/0253253/coal-powered-energy-finally-overtaken-by-wind-and-solar-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Coal-Powered Energy Finally Overtaken by Wind and Solar in the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T13:54:41+00:00",
        "description": "An anonymous reader quotes a report from Broadband TV News: The National Association of Broadcasters (NAB) has filed a petition with the Federal Communications Commission (FCC) urging the agency to establish a clear, industry-wide transition plan for the full deployment of Next Gen TV (ATSC 3.0). The proposal outlines a two-phased transition while modernizing regulatory requirements to support consumer access and innovation. [...] Under the plan, stations in the top 55 markets, covering 70% of the US population, would transition by February 2028, with all remaining full-power and Class A stations following in or before February 2030. The petition also calls for updates to FCC rules to ensure television reception devices support Next Gen TV, maintain existing MVPD carriage obligations and eliminate regulatory hurdles that could slow adoption. To clarify, ATSC 1.0 is the current standard for free over-the-air (OTA) TV. While ATSC 3.0 (also called NextGen TV) is its intended replacement",
        "id": 2328927,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/15/0515234/nab-calls-for-end-of-atsc-10?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NAB Calls For End of ATSC 1.0",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T10:39:43+00:00",
        "description": "Astronomers using the Canada-France-Hawaii Telescope have discovered 128 new moons around Saturn, bringing its total to 274 -- more than all the other planets combined. CBC News reports: Jupiter and Saturn have been locked in a battle for the most moons for years -- with Saturn stealing the crown from Jupiter only two years ago when the same group of researchers found 64 additional moons orbiting it. But scientists say this discovery likely settles the score once and for all. [...] He and the other scientists working on the project made the discovery using the Canada France Hawaii Telescope, a 3.6-meter optical telescope on the summit of the dormant volcano Mauna Kea on the Big Island of Hawaii.\n \nScientists have been capturing pictures of the moons using the telescope since 2019. The researchers aligned and layered 44 of those images on top of one another in order to enhance the appearance of the moons and determine what they were. These moons are nothing like Earth's very own, howe",
        "id": 2328025,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/15/0457249/saturn-solidifies-its-title-as-moon-king-with-discovery-of-128-new-moons?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Saturn Solidifies Its Title As Moon King With Discovery of 128 New Moons",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T07:24:08+00:00",
        "description": "From a Space.com article: Athena, the second lunar lander from Houston company Intuitive Machines, tipped over during its touchdown on March 6, ending up on its side within a small crater near the moon's south pole. This orientation prevented the lander's solar panels from capturing enough sunlight, and Intuitive Machines declared Athena dead on March 7. (The company's first moon lander, named Odysseus, also tipped over during its historic February 2024 touchdown but was able to operate for longer on the lunar surface.)\n \nAthena beamed home a few shots of its surroundings before giving up the ghost. And we now have views of the lander and its crater grave from on high, courtesy of NASA's sharp-eyed Lunar Reconnaissance Orbiter (LRO). On March 7, LRO captured a gorgeous oblique photo of Athena and its landing site -- the Mons Mouton region, about 100 miles (160 kilometers) from the lunar south pole. Then, three days later, the probe snapped another pic, which provided a closer look at",
        "id": 2327352,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/15/0447257/dead-athena-moon-lander-seen-inside-its-crater-grave-from-lunar-orbit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dead Athena Moon Lander Seen Inside Its Crater Grave From Lunar Orbit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T04:09:23+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: Something very strange is happening inside Super Nintendo (SNES) consoles as they age: a component you've probably never heard of is running ever so slightly faster as we get further and further away from the time the consoles first hit the market in the early '90s. The discovery started a mild panic in the speedrunning community in late February since one theoretical consequence of a faster-running console is that it could impact how fast games are running and therefore how long they take to complete. This could potentially wreak havoc on decades of speedrunning leaderboards and make tracking the fastest times in the speedrunning scene much more difficult, but that outcome now seems very unlikely. However, the obscure discovery does highlight the fact that old consoles' performance is not frozen at the time of their release date, and that they are made of sensitive components that can age and degrade, or even 'upgrade', over time. ",
        "id": 2326856,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/15/0147220/super-nintendo-hardware-is-running-faster-as-it-ages?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Super Nintendo Hardware Is Running Faster As It Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T03:04:32+00:00",
        "description": "With Microsoft ending free security updates for Windows 10 in October, millions of PCs that don't meet Windows 11's hardware requirements face an uncertain fate... Charities that refurbish and distribute computers to low-income individuals must choose between providing soon-to-be-insecure Windows 10 machines, transitioning to Linux -- despite usability challenges for non-tech-savvy users -- or recycling the hardware, contributing to ewaste. Tom's Hardware reports: So how bad will it really be to run an end-of-lifed Windows 10? Should people worry? [Chester Wisniewski, who serves as Director and Global Field CISO for Sophos, a major security services company] and other experts I talked to are unequivocal. You're at risk. \"To put this in perspective, today [the day we talked] was Patch Tuesday,\" he said. \"There were 57 vulnerabilities, 6 of which have already been abused by criminals before the fixes were available. There were also 57 in February and 159 in January. Windows 10 and Wind",
        "id": 2326699,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/15/016220/end-of-windows-10-leaves-pc-charities-with-tough-choice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "End of Windows 10 Leaves PC Charities With Tough Choice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T01:59:18+00:00",
        "description": "A SpaceX Falcon 9 rocket launched a four-member crew to the International Space Station on Friday night, paving the way for NASA astronauts Butch Wilmore and Suni Williams to return to Earth after being there for nine months due to issues with Boeing's Starliner capsule. Arrival is set for late Saturday night. The Associated Press reports: NASA wants overlap between the two crews so Wilmore and Williams can fill in the newcomers on happenings aboard the orbiting lab. That would put them on course for an undocking next week and a splashdown off the Florida coast, weather permitting. The duo will be escorted back by astronauts who flew up on a rescue mission on SpaceX last September alongside two empty seats reserved for Wilmore and Williams on the return leg.\n \nReaching orbit from NASA's Kennedy Space Center, the newest crew includes NASA's Anne McClain and Nichole Ayers, both military pilots; and Japan's Takuya Onishi and Russia's Kirill Peskov, both former airline pilots. They will ",
        "id": 2326511,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/15/0033233/spacex-launches-nasas-crew-10-mission-to-iss?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SpaceX Launches NASA's Crew-10 Mission To ISS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-15T00:54:08+00:00",
        "description": "An anonymous reader quotes a report from Fortune: Younger Americans don't have enough saved to cover a single month of spending, showcasing their vulnerability should the economy head into a downturn. Members of the Gen Z generation -- people born after 1995 -- were spending twice the amount they had in savings on average in February, according to Bank of America Institute analysis of internal account and card data released Friday. The ratio has increased in the past two years, and is much higher than for other generations. In part that's because Gen Z consumers, many of whom still hold entry-level positions and make less than their older peers, tend to spend a bigger share of their incomes on necessities including rent and utilities. But they're also more likely to shell out on discretionary categories like travel and entertainment. Spending in non-essentials among that cohort is up more than 25% from a year ago -- substantially above the overall rate.\n \nWhile the report noted that ",
        "id": 2326270,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/14/2136247/gen-z-americans-dont-have-enough-saved-to-cover-a-single-month-of-spending?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gen Z Americans Don't Have Enough Saved To Cover a Single Month of Spending",
        "vote": 0
    }
]