[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T23:44:31.212121+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T23:31:00+00:00",
        "description": "Long-time Slashdot reader theodp took a good look at the images on a promotional web page for Databricks' \"context-aware AI assistant\":\n\nIf there was an AI Demo Hall of Shame, the first inductee would have to be Amazon. Their demo tried to support its CEO's claims that Amazon Q Code Transformation AI saved it 4,500 developer-years and an additional $260 million in \"annualized efficiency gains\" by automatically and accurately upgrading code to a more current version of Java. But it showcased a program that didn't even spell \"Java\" correctly. (It was instead called 'Jave')... \n\n\nToday's nominee for the AI Demo Hall of Shame inductee is analytics platform Databricks for the NYC Taxi Trips Analysis it's been showcasing on its Data Science page since last November. Not only for its choice of a completely trivial case study that requires no 'Data Science' skills &mdash; find and display the ten most expensive and longest taxi rides &mdash; but also for the horrible AI-generated bar chart us",
        "id": 3904015,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/25/2327225/slashdot-reader-mocks-databricks-context-aware-ai-assistant-for-odd-bar-chart",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Slashdot Reader Mocks Databricks 'Context-Aware AI Assistant' for Odd Bar Chart",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T21:23:41.102682+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T20:44:00+00:00",
        "description": "\"OpenAI's o3 model sabotaged a shutdown mechanism to prevent itself from being turned off,\" warned Palisade Research, a nonprofit investigating cyber offensive AI capabilities. \"It did this even when explicitly instructed: allow yourself to be shut down.\" In September they released a paper adding that \"several state-of-the-art large language models (including Grok 4, GPT-5, and Gemini 2.5 Pro) sometimes actively subvert a shutdown mechanism...\" \n\nNow the nonprofit has written an update \"attempting to clarify why this is &mdash; and answer critics who argued that its initial work was flawed,\" reports The Guardian:\n\nConcerningly, wrote Palisade, there was no clear reason why. \"The fact that we don't have robust explanations for why AI models sometimes resist shutdown, lie to achieve specific objectives or blackmail is not ideal,\" it said. \"Survival behavior\" could be one explanation for why models resist shutdown, said the company. Its additional work indicated that models were more lik",
        "id": 3903417,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/25/2041220/ai-models-may-be-developing-their-own-survival-drive-researchers-say",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Models May Be Developing Their Own 'Survival Drive', Researchers Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T20:09:25.847252+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T19:34:00+00:00",
        "description": "Thursday the Washington Post profiled \"the people who dare to say no to AI,\" including a 16-year-old high school student in Virginia says \"she doesn't want to off-load her thinking to a machine and worries about the bias and inaccuracies AI tools can produce...\" \n\n\"As the tech industry and corporate America go all in on artificial intelligence, some people are holding back.\"\n\n\nSome tech workers told The Washington Post they try to use AI chatbots as little as possible during the workday, citing concerns about data privacy, accuracy and keeping their skills sharp. Other people are staging smaller acts of resistance, by opting out of automated transcription tools at medical appointments, turning off Google's chatbot-style search results or disabling AI features on their iPhones. For some creatives and small businesses, shunning AI has become a business strategy. Graphic designers are placing \"not by AI\" badges on their works to show they're human-made, while some small businesses have p",
        "id": 3903021,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/25/0324244/meet-the-people-who-dare-to-say-no-to-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Meet The People Who Dare to Say No to AI'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T18:44:33.398759+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T18:34:00+00:00",
        "description": "An AI system \"apparently mistook a high school student's bag of Doritos for a firearm,\" reports the Guardian, \"and called local police to tell them the pupil was armed.\"\n\n\n\n\nTaki Allen was sitting with friends on Monday night outside Kenwood high school in Baltimore and eating a snack when police officers with guns approached him. \"At first, I didn't know where they were going until they started walking toward me with guns, talking about, 'Get on the ground,' and I was like, 'What?'\" Allen told the WBAL-TV 11 News television station. \n\n\nAllen said they made him get on his knees, handcuffed and searched him &mdash; finding nothing. They then showed him a copy of the picture that had triggered the alert. \"I was just holding a Doritos bag &mdash; it was two hands and one finger out, and they said it looked like a gun,\" Allen said.\n\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Student+Handcuffed+After+School's+AI+Sys",
        "id": 3902651,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/25/0733242/student-handcuffed-after-schools-ai-system-mistakes-a-bag-of-chips-for-a-gun",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Student Handcuffed After School's AI System Mistakes a Bag of Chips for a Gun",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T18:44:33.482458+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T17:34:00+00:00",
        "description": "The Associated Press reports that \"North Korean hackers have pilfered billions of dollars\" by breaking into cryptocurrency exchanges and by creating fake identities to get remote tech jobs at foreign companies &mdash; all orchestrated by the North Korean government to finance R&amp;D on nuclear arms. \n\nThat's according to a new the 138-page report by a group watching North Korea's compliance with U.N. sanctions (including officials from the U.S., Australia, Canada, France, Germany, Italy, Japan, the Netherlands, New Zealand, South Korea and the United Kingdom). From the Associated Press:\n\nNorth Korea also has used cryptocurrency to launder money and make military purchases to evade international sanctions tied to its nuclear program, the report said. It detailed how hackers working for North Korea have targeted foreign businesses and organizations with malware designed to disrupt networks and steal sensitive data... \n\nUnlike China, Russia and Iran, North Korea has focused much of its ",
        "id": 3902652,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/25/1246241/north-korea-has-stolen-billions-in-cryptocurrency-and-tech-firm-salaries-report-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "North Korea Has Stolen Billions in Cryptocurrency and Tech Firm Salaries, Report Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T17:29:30.761786+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T16:34:00+00:00",
        "description": "\"Clippy, the animated paper clip that annoyed Microsoft Office users nearly three decades ago, might have just been ahead of its time,\" writes the Associated Press:\n\n\nMicrosoft introduced a new artificial intelligence character called Mico (pronounced MEE'koh) on Thursday, a floating cartoon face shaped like a blob or flame that will embody the software giant's Copilot virtual assistant and marks the latest attempt by tech companies to imbue their AI chatbots with more of a personality... \"When you talk about something sad, you can see Mico's face change. You can see it dance around and move as it gets excited with you,\" said Jacob Andreou, corporate vice president of product and growth for Microsoft AI, in an interview with The Associated Press. \"It's in this effort of really landing this AI companion that you can really feel.\" \n\nIn the U.S. only so far, Copilot users on laptops and phone apps can speak to Mico, which changes colors, spins around and wears glasses when in \"study\" mod",
        "id": 3902303,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/25/0949250/28-years-after-clippy-microsoft-upgrades-copilot-with-cartoon-assistant-micu",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "28 Years After 'Clippy', Microsoft Upgrades Copilot With Cartoon Assistant 'Micu'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T16:18:43.645229+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T15:34:00+00:00",
        "description": "The Washington Post reports on 996, \"a term popularized in China that refers to a rigid work schedule in which people work from 9 a.m. to 9 p.m., six days a week...\"\n\n\nAs the artificial intelligence race heats up, many start-ups in Silicon Valley and New York are promoting hardcore culture as a way of life, pushing the limits of work hours, demanding that workers move fast to be first in the market. Some are even promoting 996 as a virtue in the hiring process and keeping \"grind scores\" of companies... Whoever builds first in AI will capture the market, and the window of opportunity is two to three years, \"so you better run faster than everyone else,\" said Inaki Berenguer, managing partner of venture-capital firm LifeX Ventures. \n\nAt San Francisco-based AI start-up Sonatic, the grind culture also allows for meal, gym and pickleball time, said Kinjal Nandy, its CEO. Nandy recently posted a job opening on X that requires in-person work seven days a week. He said working 10-hour days sou",
        "id": 3901895,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/25/0840227/some-startups-are-demanding-12-hour-days-six-days-a-week-from-workers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some Startups Are Demanding 12-Hour Days, Six Days a Week from Workers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T15:06:00.550967+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T14:34:00+00:00",
        "description": "An anonymous reader shares this report from the Associated Press:\n\n\nMyanmar's military has shut down a major online scam operation near the border with Thailand, detaining more than 2,000 people and seizing dozens of Starlink satellite internet terminals, state media reported Monday... The centers are infamous for recruiting workers from other countries under false pretenses, promising them legitimate jobs and then holding them captive and forcing them to carry out criminal activities. \n\nScam operations were in the international spotlight last week when the United States and Britain enacted sanctions against organizers of a major Cambodian cyberscam gang, and its alleged ringleader was indicted by a federal court in New York. According to a report in Monday's Myanma Alinn newspaper, the army raided KK Park, a well-documented cybercrime center, as part of operations starting in early September to suppress online fraud, illegal gambling, and cross-border cybercrime.\n<p><div class=\"share",
        "id": 3901518,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/25/1258252/myanmar-military-shuts-down-a-major-cybercrime-center-and-detains-over-2000-people",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Myanmar Military Shuts Down a Major Cybercrime Center and Detains Over 2,000 People",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T10:20:51.011452+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T10:00:00+00:00",
        "description": "Electronic Arts (EA) has partnered with Stability AI, creator of Stable Diffusion, to co-develop generative AI tools aimed at accelerating game development. \"I use the term smarter paintbrushes,\" Steve Kestell, Head of Technical Art for EA SPORTS said in the announcement. \"We are giving our creatives the tools to express what they want.\" Engadget reports: To start, the \"smarter paintbrushes\" EA and Stability AI are building are concentrated on generating textures and in-game assets. EA hopes to create \"Physically Based Rendering materials\" with new tools \"that generate 2D textures that maintain exact color and light accuracy across any environment.\" The company also describes using AI to \"pre-visualize entire 3D environments from a series of intentional prompts, allowing artists to creatively direct the generation of game content.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=EA+Partners+With+Company+Behind+Stable",
        "id": 3900023,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/25/0132252/ea-partners-with-company-behind-stable-diffusion-to-make-games-with-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EA Partners With Company Behind Stable Diffusion To Make Games With AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T07:46:58.747929+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T07:00:00+00:00",
        "description": "China's private space company LandSpace has completed a key static fire test of its Zhuque-3 (ZQ-3) reusable rocket -- a stainless-steel, methane-fueled launcher modeled after SpaceX's Starship. Universe Today reports: The latest milestone took place on Monday, Oct. 22nd at the Dongfeng commercial space innovation pilot zone (where the JSLC is located). It involved another static fire test, where the rocket was fully-fueled but remained fixed to the launch pad while the engines were fired. This kind of testing is a crucial prelaunch trial (what NASA refers to as a \"wet dress rehearsal\"), and places the company and China another step closer to making an inaugural flight test, which is expected to happen by the fourth quarter of 2025.\n \nIn traditional Chinese, Zhuque is the name of the Vermillion Bird that represents fire, the south, and summer, and is one of the four Symbols of the Chinese constellations. Like the Starship, the Zhuque-3 is composed of stainless steel and relies on a co",
        "id": 3899506,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/25/0126203/chinas-zhuque-3-reusable-rocket-passes-key-milestone",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's Zhuque-3 Reusable Rocket Passes Key Milestone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T04:15:24.231822+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from CNN: Iceland's frozen, inhospitable winters have long protected it from mosquitoes, but that may be changing. This week, scientists announced the discovery of three mosquitoes -- marking the country's first confirmed finding of these insects in the wild. Mosquitoes are found almost everywhere in the world, with the exception of Antarctica and, until very recently, Iceland, due to their extreme cold.\n \nThe mosquitoes were discovered by Bjorn Hjaltason in Kioafell, Kjos, in western Iceland about 20 miles north of the capital Reykjavik. \"At dusk on October 16, I caught sight of a strange fly,\" Hjaltason posted in a Facebook group about insects, according to reports in the Icelandic media. \"I immediately suspected what was going on and quickly collected the fly,\" he added.\n \nHe contacted Matthias Alfreosson, an entomologist at the Natural Science Institute of Iceland, who drove out to Hjaltason's house the next day. They captured three in total, tw",
        "id": 3898834,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/25/0121221/iceland-just-found-its-first-mosquitoes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Iceland Just Found Its First Mosquitoes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T03:07:34.160846+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T02:20:00+00:00",
        "description": "Texas's electricity demand has surged to record highs in 2025 but renewable energy is meeting the challenge. According to new data from the Energy Information Administration, solar output has quadrupled since 2021, wind continues steady growth, and battery storage is increasingly stabilizing the grid during evening peaks. Electrek reports: ERCOT, which supplies power to about 90% of the state, saw demand jump 5% year-over-year to 372 terawatt hours (TWh) -- a 23% increase since 2021. No other major US grid has grown faster over the past year. [...] The biggest growth story in Texas power generation is solar. Utility-scale solar plants produced 45 TWh from January through September, up 50% from 2024 and nearly four times what they generated in 2021 (11 TWh). Wind power also continued to climb, producing 87 TWh through September -- a 4% increase from last year and 36% more than in 2021.\n \nTogether, wind and solar supplied 36% of ERCOT's total electricity over those nine months. Solar, i",
        "id": 3898622,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/25/0110225/as-texas-power-demand-surges-solar-wind-and-storage-carry-the-load",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "As Texas Power Demand Surges, Solar, Wind and Storage Carry the Load",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T02:01:41.185985+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T01:40:00+00:00",
        "description": "alternative_right shares a report from France 24: [Sweden's] latest contribution to the war effort is Glimt, an innovative project launched by the Swedish Defence Research Agency (FOI) earlier this year. Glimt is an open platform that relies on the theory of \"crowd forecasting\": a method of making predictions based on surveying a large and diverse group of people and taking an average. \"Glimt\" is a Swedish word for \"a glimpse\" or \"a sudden insight.\" The theory posits that the average of all collected predictions produces correct results with \"uncanny accuracy,\" according to the Glimt website. Such \"collective intelligence\" is used today for everything from election results to extreme weather events, Glimt said. [...]\n \nGroup forecasting allows for a broad collection of information while avoiding the cognitive bias that often characterizes intelligence services. Each forecaster collects and analyses the available information differently to reach the most probable scenario and can add a",
        "id": 3898425,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/25/011246/swedens-crowd-forecasting-platform-glimt-helps-ukraine-make-wartime-predictions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sweden's Crowd-Forecasting Platform 'Glimt' Helps Ukraine Make Wartime Predictions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T02:01:41.293639+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T01:00:00+00:00",
        "description": "Apple has begun shipping U.S.-made AI servers from a new factory in Houston, Texas -- part of its $600 billion investment in American manufacturing and supply chains. CNBC reports: Apple Chief Operating Officer Sabih Khan said on Thursday that the servers will power the company's Apple Intelligence and Private Cloud Compute services. Apple is using its own silicon in its Apple Intelligence servers. \"Our teams have done an incredible job accelerating work to get the new Houston factory up and running ahead of schedule and we plan to continue expanding the facility to increase production next year,\" Khan said in a statement. The Houston factory is on track to create thousands of jobs, Apple said. The Apple servers were previously manufactured overseas.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Begins+Shipping+American-Made+AI+Servers+From+Texas%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F10%2F24%2F22",
        "id": 3898426,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/24/2241235/apple-begins-shipping-american-made-ai-servers-from-texas",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Begins Shipping American-Made AI Servers From Texas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-25T00:50:58.609378+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-25T00:20:00+00:00",
        "description": "An anonymous reader quotes a report from Tom's Guide: Microsoft Teams is about to deal a heavy blow to those who like to work from home for peace and quiet. In a new feature update rolling out December 2025, the platform will track a worker's location using the office Wi-Fi, to see whether you're actually there or not. From a boss' perspective, this would eliminate any of that confusion as to where your team actually is. But for those people who have found their own sanctuary of peaceful productivity by working from home, consider this a warning that Teams is about to tattle on you. According to the Microsoft 365 roadmap: \"When users connect to their organization's Wi-Fi, Teams will automatically set their work location to reflect the building they are working in.\" The location of that worker will apparently update automatically upon connecting.\n \nIt's set to launch on Windows and macOS, with rollout starting at the end of this year. \"This feature will be off by default,\" notes Micros",
        "id": 3898194,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/24/2236218/microsoft-teams-will-start-tracking-office-attendance",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Teams Will Start Tracking Office Attendance",
        "vote": 0
    }
]