[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T23:24:36.637251+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T22:49:00+00:00",
        "description": "Will an expansion of biofuels increase greenhouse gas emissions, despite their purported climate benefits? That's the claim of a new report from the World Resources Institute, which has been critical of US biofuel policy in the past. \n\n Ars Technica has republished an article from the nonprofit, non-partisan news organization Inside Climate News, which investigates the claim. Drawing from 100 academic studies on biofuel impacts, the Institute's new report \"concludes that [U.S.] ethanol policy has been largely a failure and ought to be reconsidered, especially as the world needs more land to produce food to meet growing demand.\"\n\"Multiple studies show that U.S. biofuel policies have reshaped crop production, displacing food crops and driving up emissions from land conversion, tillage, and fertilizer use,\" said the report's lead author, Haley Leslie-Bole. \"Corn-based ethanol, in particular, has contributed to nutrient runoff, degraded water quality and harmed wildlife habitat. As climat",
        "id": 2933717,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/14/2242239/do-biofuels-increase-greenhouse-gas-emissions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Do Biofuels Increase Greenhouse Gas Emissions?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T21:14:46.461339+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T20:49:00+00:00",
        "description": "\"People are replacing Google search with artificial intelligence tools like ChatGPT,\" reports the Washington Post. \n\nBut that's just the first change, according to a New York-based start-up devoted to watching for content-scraping AI companies with a free analytics product and \"ensuring that these intelligent agents pay for the content they consume.\" Their data from 266 web sites (half run by national or local news organizations) found that \"traffic from retrieval bots grew 49% in the first quarter of 2025 from the fourth quarter of 2024,\" the Post reports.\n A spokesperson for OpenAI said that referral traffic to publishers from ChatGPT searches may be lower in quantity but that it reflects a stronger user intent compared with casual web browsing. \nTo capitalize on this shift, websites will need to reorient themselves to AI visitors rather than human ones [said TollBit CEO/co-founder Toshit Panigrahi]. But he also acknowledged that squeezing payment for content when AI companies argue",
        "id": 2933211,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/14/021246/increased-traffic-from-web-scraping-ai-bots-is-hard-to-monetize?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Increased Traffic from Web-Scraping AI Bots is Hard to Monetize",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T20:09:30.569662+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T19:49:00+00:00",
        "description": "Rocky Linux 10 \"Red Quartz\" has reached general availability, notes a new article in The Register &mdash; surveying the differences between \"RHELatives\" &mdash; the major alternatives to Red Hat Enterprise Linux:\n\nThe Rocky 10 release notes describe what's new, such as support for RISC-V computers. Balancing that, this version only supports the Raspberry Pi 4 and 5 series; it drops Rocky 9.x's support for the older Pi 3 and Pi Zero models... \n\nRHEL 10 itself, and Rocky with it, now require x86-64-v3, meaning Intel \"Haswell\" generation kit from about 2013 onward. Uniquely among the RHELatives, AlmaLinux offers a separate build of version 10 for x86-64-v2 as well, meaning Intel \"Nehalem\" and later &mdash; chips from roughly 2008 onward. AlmaLinux has a history of still supporting hardware that's been dropped from RHEL and Rocky, which it's been doing since AlmaLinux 9.4. Now that includes CPUs. In comparison, the system requirements for Rocky Linux 10 are the same as for RHEL 10. The re",
        "id": 2932961,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/06/14/1947215/rocky-and-alma-linux-still-going-strong-rhel-adds-an-ai-assistant?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rocky and Alma Linux Still Going Strong. RHEL Adds an AI Assistant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T19:05:12.623740+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T18:34:00+00:00",
        "description": "Recently the Browser Company (the startup behind the Arc web browser) switched over to building a new AI-powered browser &mdash; and its beta has just been released, reports TechCrunch, \"though you'll need an invite to try it out.\" \n\nThe Chromium-based browser has a URL/search bar that also \"acts as the interface for its in-built AI chatbot\" which can \"search the web for you, summarize files that you upload, and automatically switch between chat and search functions.\"\n\nThe Browser Company's CEO Josh Miller has of late acknowledged how people have been using AI tools for all sorts of tasks, and Dia is a reflection of that. By giving users an AI interface within the browser itself, where a majority of work is done these days, the company is hoping to slide into the user flow and give people an easy way to use AI, cutting out the need to visit the sites for tools like ChatGPT, Perplexity, and Claude... \n\nUsers can also ask questions about all the tabs they have open, and the bot can even",
        "id": 2932646,
        "language": null,
        "link": "https://slashdot.org/story/25/06/14/0634217/arc-browsers-maker-releases-first-beta-of-its-new-ai-powered-browser-dia?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Arc Browser's Maker Releases First Beta of Its New AI-Powered Browser 'Dia'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T18:00:13.538501+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T17:34:00+00:00",
        "description": "In a world first, a research team used 2D materials &mdash; only an atom thick &mdash; to develop a computer. The team (led by researchers at Pennsylvania State University) says it's a major step toward thinner, faster and more energy-efficient electronics. \nFrom the University's announcement:\n\nThey created a complementary metal-oxide semiconductor (CMOS) computer &mdash; technology at the heart of nearly every modern electronic device &mdash; without relying on silicon. Instead, they used two different 2D materials to develop both types of transistors needed to control the electric current flow in CMOS computers: molybdenum disulfide for n-type transistors and tungsten diselenide for p-type transistors... \"[A]s silicon devices shrink, their performance begins to degrade,\" [said lead researcher/engineering professor Saptarshi Das]. \"Two-dimensional materials, by contrast, maintain their exceptional electronic properties at atomic thickness, offering a promising path forward....\" \n\nThe",
        "id": 2932331,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/14/0936250/worlds-first-2d-atom-thin-non-silicon-computer-developed?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World's First 2D, Atom-Thin Non-Silicon Computer Developed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T16:55:11.439987+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T16:34:00+00:00",
        "description": "An anonymous reader shared this report from CNET:\n\nBy using a software emulator to run Atari's 1979 game Video Chess, Citrix engineer Robert Caruso said he was able to set up a match between ChatGPT and the 46-year-old game. The matchup did not go well for ChatGPT. \"ChatGPT confused rooks for bishops, missed pawn forks and repeatedly lost track of where pieces were &mdash; first blaming the Atari icons as too abstract, then faring no better even after switching to standard chess notations,\" Caruso wrote in a LinkedIn post. \n\"It made enough blunders to get laughed out of a 3rd-grade chess club,\" Caruso said. \"ChatGPT got absolutely wrecked at the beginner level.\"\n \n\"Caruso wrote that the 90-minute match continued badly and that the AI chatbot repeatedly requested that the match start over...\" CNET reports. \n\n\"A representative for OpenAI did not immediately return a request for comment.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter",
        "id": 2932019,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/14/0421247/chatgpt-just-got-absolutely-wrecked-at-chess-losing-to-a-1970s-era-atari-2600?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ChatGPT Just Got 'Absolutely Wrecked' at Chess, Losing to a 1970s-Era Atari 2600",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T15:50:14.807149+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T15:34:00+00:00",
        "description": "Earlier this week looters who stole iPhones \"got an unexpected message from Apple,\" reports the Economic Times. \n\n\"Please return to Apple Tower Theatre. This device has been disabled and is being tracked. Local authorities will be alerted.\" \n\nStolen phones \"were remotely locked and triggered alarms, effectively turning the devices into high-tech bait. Videos circulating online show the phones flashing the message while blaring loudly, making them impossible to ignore.\"\n\nAccording to LAPD Officer Chris Miller, at least three suspects were apprehended in connection to the Apple Store burglary. One woman was arrested on the spot, while two others were detained for looting.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Stolen+iPhones+from+an+Apple+Store+Remotely+Disabled%2C+Started+Blaring+Alarms%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F06%2F14%2F0549236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img ",
        "id": 2931676,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/14/0549236/stolen-iphones-from-an-apple-store-remotely-disabled-started-blaring-alarms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Stolen iPhones from an Apple Store Remotely Disabled, Started Blaring Alarms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T14:45:29.097877+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T14:34:00+00:00",
        "description": "Last week Anthropic CEO Dario Amodei said AI could eliminate half the entry-level white-collar jobs within five years. CNN called the remarks \"part of the AI hype machine.\" \n\nAsked about the prediction this week at a Paris tech conference, NVIDIA CEO Jensen Huang acknowledged AI may impact some employees, but \"dismissed\" Amodei's claim, according to Fortune. \"Everybody's jobs will be changed. Some jobs will be obsolete, but many jobs are going to be created ... Whenever companies are more productive, they hire more people.\" \n\nAnd he also said he \"pretty much\" disagreed \"with almost everything\" Anthropic's CEO says.\n\n\"One, he believes that AI is so scary that only they should do it,\" Huang said of Amodei at a press briefing at Viva Technology in Paris. \"Two, [he believes] that AI is so expensive, nobody else should do it ... And three, AI is so incredibly powerful that everyone will lose their jobs, which explains why they should be the only company building it. I think AI is a very im",
        "id": 2931297,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/14/0512258/anthropics-ceo-is-wrong-ai-wont-eliminate-half-of-white-collar-jobs-says-nvidias-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic's CEO is Wrong, AI Won't Eliminate Half of White-Collar Jobs, Says NVIDIA's CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T13:40:08.992369+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Wall Street Journal: Since 2022, the U.S. has tightened the noose around the sale of high-end AI chips and other technology to China overnational-security concerns. Yet Chinese companies have made advances using workarounds. In some cases, Chinese AI developers have been able to substitute domestic chips for the American ones. Another workaround is to smuggle AI hardware into China through third countries. But people in the industry say that has become more difficult in recent months, in part because of U.S. pressure. That is pushing Chinese companies to try a further option: bringing their data outside China so they can use American AI chips in places such as Southeast Asia and the Middle East (source paywalled; alternative source). The maneuvers are testing the limits of U.S. restrictions. \"This was something we were consistently concerned about,\" said Thea Kendler, who was in charge of export controls at the Commerce Department in the Bi",
        "id": 2930972,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/13/2134246/chinese-ai-companies-dodge-us-chip-curbs-flying-suitcases-of-hard-drives-abroad?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese AI Companies Dodge US Chip Curbs Flying Suitcases of Hard Drives Abroad",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T10:25:18.192410+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T10:00:00+00:00",
        "description": "alternative_right shares a report from Phys.Org: A cosmic particle detector in Antarctica has emitted a series of bizarre signals that defy the current understanding of particle physics, according to an international research group that includes scientists from Penn State. The unusual radio pulses were detected by the Antarctic Impulsive Transient Antenna (ANITA) experiment, a range of instruments flown on balloons high above Antarctica that are designed to detect radio waves from cosmic rays hitting the atmosphere.\n \nThe goal of the experiment is to gain insight into distant cosmic events by analyzing signals that reach the Earth. Rather than reflecting off the ice, the signals -- a form of radio waves -- appeared to be coming from below the horizon, an orientation that cannot be explained by the current understanding of particle physics and may hint at new types of particles or interactions previously unknown to science, the team said. The researchers published their results in the ",
        "id": 2930024,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/13/2115249/strange-radio-pulses-detected-coming-from-ice-in-antarctica?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Strange Radio Pulses Detected Coming From Ice In Antarctica",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T07:10:53.550998+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T07:00:00+00:00",
        "description": "NASA and Axiom Space have indefinitely delayed the Axiom-4 launch to the International Space Station due to concerns about a persistent air leak in the Russian PrK vestibule of the aging Zvezda module. \"The PrK serves as a passageway between the station's Zvezda module and spacecraft docked at its aft port,\" notes CBS News. From the report: In a blog post, NASA said cosmonauts aboard the station \"recently performed inspections of the pressurized module's interior surfaces, sealed some additional areas of interest, and measured the current leak rate. Following this effort, the segment now is holding pressure.\" The post went on to say the Axiom-4 delay will provide \"additional time for NASA and (the Russian space agency) Roscosmos to evaluate the situation and determine whether any additional troubleshooting is necessary.\"\n \nLaunched in July 2000 atop a Russian Proton rocket, Zvezda was the third module to join the growing space station, providing a command center for Russian cosmonauts",
        "id": 2929233,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/13/2123253/nasa-delays-commercial-crew-launch-to-assess-iss-air-leak?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Delays Commercial Crew Launch To Assess ISS Air Leak",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T03:55:15.376088+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Do you remember the Pirelli Cyber Tire? No, it's not an angular nightmare clad in stainless steel. Rather, it's a sensor-equipped tire that can inform the car it's fitted to what's happening, both with the tire itself and the road it's passing over. The technology has slowly been making its way into the real world, starting with rarified stuff like the McLaren Artura. Now, Pirelli is going to put some Cyber Tires to work for everybody, not just supercar drivers, in a new pilot program with the regional government of Apulia in Italy.\n \nThe Cyber Tire has a sensor to monitor temperature and pressure, using Bluetooth Low Energy to communicate with the car. The electronics are able to withstand more than 3,500 G as part of life on the road, and a 0.3-oz (10 g) battery keeps everything running for the life of the tire. The idea was to develop a better tire pressure monitoring system, one that could tell the car exactly what kind of tir",
        "id": 2928613,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/13/2050230/smart-tires-will-report-on-the-health-of-roads-in-new-pilot-program?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Smart Tires Will Report On the Health of Roads In New Pilot Program",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T01:45:03.502989+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T01:30:00+00:00",
        "description": "Edd Gent reporting for IEEE Spectrum: IBM has unveiled a new quantum computing architecture it says will slash the number of qubits required for error correction. The advance will underpin its goal of building a large-scale, fault-tolerant quantum computer, called Starling, that will be available to customers by 2029. Because of the inherent unreliability of the qubits (the quantum equivalent of bits) that quantum computers are built from, error correction will be crucial for building reliable, large-scale devices. Error-correction approaches spread each unit of information across many physical qubits to create \"logical qubits.\" This provides redundancy against errors in individual physical qubits.\n \nOne of the most popular approaches is known as a surface code, which requires roughly 1,000 physical qubits to make up one logical qubit. This was the approach IBM focused on initially, but the company eventually realized that creating the hardware to support it was an \"engineering pipe d",
        "id": 2928284,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/13/218205/ibm-says-its-cracked-quantum-error-correction?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "IBM Says It's Cracked Quantum Error Correction",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T01:45:03.680556+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T00:50:00+00:00",
        "description": "According to market analyst firm Canalys, enterprise adoption of AI is slowing due to unpredictable and often high costs associated with model inferencing in the cloud. Despite strong growth in cloud infrastructure spending, businesses are increasingly scrutinizing cost-efficiency, with some opting for alternatives to public cloud providers as they grapple with volatile usage-based pricing models. The Register reports: [Canalys] published stats that show businesses spent $90.9 billion globally on infrastructure and platform-as-a-service with the likes of Microsoft, AWS and Google in calendar Q1, up 21 percent year-on-year, as the march of cloud adoption continues. Canalys says that growth came from enterprise users migrating more workloads to the cloud and exploring the use of generative AI, which relies heavily on cloud infrastructure.\n \nYet even as organizations move beyond development and trials to deployment of AI models, a lack of clarity over the ongoing recurring costs of infer",
        "id": 2928285,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/13/210224/enterprise-ai-adoption-stalls-as-inferencing-costs-confound-cloud-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Enterprise AI Adoption Stalls As Inferencing Costs Confound Cloud Customers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-14T00:38:49.454692+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-14T00:10:00+00:00",
        "description": "High-voltage electricity cables have become a major constraint throttling the clean energy transition, with manufacturing facilities booked out for years as demand far exceeds supply capacity. The energy transition, trade barriers, and overdue grid upgrades have turbocharged demand for these highly sophisticated cables that connect wind farms, solar installations, and cross-border power networks. \n\nThe International Energy Agency estimates that 80 million kilometers of grid infrastructure must be built between now and 2040 to meet clean energy targets -- equivalent to rebuilding the entire existing global grid that took a century to construct, but compressed into just 15 years. Each high-voltage cable requires custom engineering and months-long production in specialized 200-meter towers, with manufacturers reporting that 80-90% of major projects now use high-voltage direct current technology versus traditional alternating current systems.<p><div class=\"share_submission\" style=\"positio",
        "id": 2928058,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/13/207259/there-arent-enough-cables-to-meet-growing-electricity-demand?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "There Aren't Enough Cables To Meet Growing Electricity Demand",
        "vote": 0
    }
]