[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T21:52:25+00:00",
        "description": "\"In a conversation with Tony Yu from Asus China, AMD CEO Lisa Su shared that the Radeon RX 9000 series graphics cards have quickly become a huge hit, breaking records as AMD's top-selling GPUs within just a week of release,\" writes Slashdot reader jjslash. TechSpot reports: AMD CEO Lisa Su has confirmed that the company's new Radeon RX 9000 graphics cards have been a massive success, selling 10 times more units than their predecessors in just one week on the market. Su also stated that more RDNA 4 cards are on the way, but did not confirm whether the lineup will include the rumored Radeon RX 9060. When asked about the limited availability of the new cards, Su said that AMD is ramping up production to ensure greater supply at retailers worldwide. She also expressed hope that increased availability would help stabilize pricing by discouraging scalping and price gouging.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=",
        "id": 2407355,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/25/2037251/lisa-su-says-radeon-rx-9000-series-is-amds-most-successful-gpu-launch-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lisa Su Says Radeon RX 9000 Series Is AMD's Most Successful GPU Launch Ever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T21:52:25+00:00",
        "description": "According to Convergence Research, an estimated 46% of Canadian households didn't have a TV subscription with a cable, satellite, or telecom-based provider in 2024. MobileSyrup reports: In its latest annual \"Couch Potato\" report (PDF) on the streaming market, the firm notes that this was a four per cent increase from 2023 and that the number is expected to continue to rise to 54 per cent by 2027. Convergence notes that this marks a greater shift towards subscription video on demand services (SVOD) like Netflix and Disney+. To that point, the firm found that Canadian streaming subscription revenue grew 15 per cent year-over-year to $4.2 billion in 2024. At the same time, linear TV subscription revenue dropped five per cent to around $6.5 billion.\n \nSome other interesting findings from the report:\n\n- The 10 leading streaming providers raised prices in Canada by an average of six percent last year\n\n- Ad-enabled memberships are cost 39 percent less on average compared to ad-free options\n",
        "id": 2407357,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/25/2029255/nearly-half-of-canadians-have-cut-cable-entirely?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nearly Half of Canadians Have Cut Cable Entirely",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T21:52:25+00:00",
        "description": "World Liberty Financial, a crypto venture backed by Donald Trump and his family, has launched a U.S. dollar-pegged stablecoin called USD1. The token is backed by U.S. Treasuries and cash equivalents and will soon go live on the Ethereum and Binance Smart Chain networks. CNBC reports: The development comes as the market cap for dollar-backed stablecoins -- cryptocurrencies that promise a fixed value peg to another asset -- has been climbing to new all-time-highs this year and has grown more than 46% in the past year, according to CryptoQuant. The market has long been dominated by Tether (USDT) and, more recently, Circle's USDC. \"USD1 provides what algorithmic and anonymous crypto projects cannot -- access to the power of DeFi underpinned by the credibility and safeguards of the most respected names in traditional finance,\" said World Liberty Financial co-founder Zach Witkoff. \"We're offering a digital dollar stablecoin that sovereign investors and major institutions can confidently in",
        "id": 2407356,
        "language": null,
        "link": "https://slashdot.org/story/25/03/25/2045243/trumps-crypto-venture-introduces-a-stabelcoin?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump's Crypto Venture Introduces a Stabelcoin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T20:47:03+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: World of Warcraft Classic's Hardcore mode has set itself apart from the average MMO experience simply by making character death permanent across the entire in-game realm. For years, Blizzard has not allowed any appeals or rollbacks for these Hardcore mode character deaths, even when such deaths came as the direct result of a server disconnection or gameplay bug. Now, Blizzard says it's modifying that policy somewhat in response to a series of \"unprecedented distributed-denial-of-service (DDOS) attacks\" undertaken \"with the singular goal of disrupting players' experiences.\" The World of Warcraft developer says it may now resurrect Classic Hardcore characters \"at our sole discretion\" when those deaths come \"in a mass event which we deem inconsistent with the integrity of the game.\" WoW's Classic Hardcore made it a hotspot for streamers, especially members of the OnlyFangs Guild, who embraced the challenge that one mistake could end",
        "id": 2406927,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/25/2019209/after-ddos-attacks-blizzard-rolls-back-hardcore-wow-deaths-for-the-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After DDOS Attacks, Blizzard Rolls Back Hardcore WoW Deaths For the First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T19:42:34+00:00",
        "description": "Google DeepMind has launched Gemini 2.5, a new family of AI models designed to \"think\" before responding to queries. The initial release, Gemini 2.5 Pro Experimental, tops the LMArena leaderboard by what Google claims is a \"significant margin\" and demonstrates enhanced reasoning capabilities across technical tasks. The model achieved 18.8% on Humanity's Last Exam without tools, outperforming most competing flagship models. In mathematics, it scored 86.7% on AIME 2025 and 92.0% on AIME 2024 in single attempts, while reaching 84.0% on GPQA's diamond benchmark for scientific reasoning. \n\nFor developers, Gemini 2.5 Pro demonstrates improved coding abilities with 63.8% on SWE-Bench Verified using a custom agent setup, though this falls short of Anthropic's Claude 3.7 Sonnet score of 70.3%. On Aider Polyglot for code editing, it scores 68.6%, which Google claims surpasses competing models. The reasoning approach builds on Google's previous experiments with reinforcement learning and chain-",
        "id": 2406377,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/25/195227/google-unveils-gemini-25-pro-its-latest-ai-reasoning-model-with-significant-benchmark-gains?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Unveils Gemini 2.5 Pro, Its Latest AI Reasoning Model With Significant Benchmark Gains",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T19:42:34+00:00",
        "description": "A software engineer discovered that his newly purchased Bosch 500 series dishwasher locks basic functionality behind cloud connectivity, reigniting concerns about internet-dependent home appliances. Jeff Geerling found that features like rinse cycle, delayed start and eco mode on his $1,000 dishwasher require connecting to WiFi and creating an account with \"Home Connect,\" Bosch's cloud service. \n\nGeerling criticized the approach as potentially part of planned obsolescence, noting that without a current subscription fee, the company will likely either shutter the service or introduce payments for previously standard features.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='I+Won't+Connect+My+Dishwasher+To+Your+Stupid+Cloud'%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F03%2F25%2F1849231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop",
        "id": 2406378,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/25/1849231/i-wont-connect-my-dishwasher-to-your-stupid-cloud?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'I Won't Connect My Dishwasher To Your Stupid Cloud'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T18:37:03+00:00",
        "description": "Boeing is seeking to withdraw an earlier agreement to plead guilty in a long-running criminal case that blamed the company for deceiving regulators before two deadly crashes of 737 MAX jets, WSJ is reporting, citing people familiar with the matter. From the report: The aerospace giant is seeking more lenient treatment from the Justice Department, which under the Trump administration is reviewing numerous pending criminal cases that haven't yet gone to trial or been approved by courts. Boeing nearly sealed its fate last year, agreeing in July to plead guilty to defrauding the Federal Aviation Administration. But a federal judge in Texas rejected the proposed deal in December, pushing the resolution beyond the Biden administration. \n\nNow Boeing stands to benefit from fresh eyes at Trump's Justice Department, which is inclined to at least modify parts of the agreement, some of the people said. Allowing Boeing to rescind its plea agreement, or lightening the company's punishment, would m",
        "id": 2405770,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/25/189245/boeing-is-pushing-to-withdraw-guilty-plea-agreement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Boeing Is Pushing To Withdraw Guilty Plea Agreement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T18:37:03+00:00",
        "description": "The president of Signal defended the messaging app's security on Wednesday after top Trump administration officials mistakenly included a journalist in an encrypted chatroom they used to discuss looming U.S. military action against Yemen's Houthis. For a report: Signal's Meredith Whittaker did not directly address the blunder, which Democratic lawmakers have said was a breach of U.S. national security. But she described the app as the \"gold standard in private comms\" in a post on X, which outlined Signal's security advantages over Meta's WhatsApp messaging app. \"We're open source, nonprofit, and we develop and apply (end-to-end encryption) and privacy-preserving tech across our system to protect metadata and message contents,\" she said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Signal+Head+Defends+Messaging+App's+Security+After+US+War+Plan+Leak%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F03%2F25%2F1728243",
        "id": 2405771,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/25/1728243/signal-head-defends-messaging-apps-security-after-us-war-plan-leak?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Signal Head Defends Messaging App's Security After US War Plan Leak",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T16:26:41+00:00",
        "description": "Alibaba Chairman Joe Tsai has warned of a potential bubble forming in data center construction, arguing that the pace of that buildout may outstrip initial demand for AI services. From a report: A rush by big tech firms, investment funds and other entities to erect server bases from the US to Asia is starting to look indiscriminate, the billionaire executive and financier said. Many of those projects are built without clear customers in mind, Tsai told the HSBC Global Investment Summit in Hong Kong Tuesday. \n\n\"I start to see the beginning of some kind of bubble,\" Tsai told delegates. Some of the envisioned projects commenced raising funds without having secured \"uptake\" agreements, he added. \"I start to get worried when people are building data centers on spec. There are a number of people coming up, funds coming out, to raise billions or millions of capital.\" [...] \n\nAt the same time, Tsai had choice words for his US rivals, particularly with their spending. \"I'm still astounded by ",
        "id": 2404599,
        "language": null,
        "link": "https://slashdot.org/story/25/03/25/1456241/alibabas-tsai-warns-of-bubble-in-ai-data-center-buildout?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Alibaba's Tsai Warns of 'Bubble' in AI Data Center Buildout",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T16:26:41+00:00",
        "description": "An anonymous reader shares a report: The UK's Consumer Markets Authority (CMA) has provided an update into its investigation of Ticketmaster after the sale of Oasis reunion tour tickets resulted in grossly inflated ticket prices and numerous consumer complaints. The CMA said that the results of the investigation warranted, \"consulting with the ticketing platform on changes to ensure fans receive the right information, at the right time.\" \n\nOf concern to the CMA was Ticketmaster's labeling and information practices. In its update, the CMA stated that Ticketmaster designated certain tickets as \"platinum,\" selling them at more than twice the standard price without adequately informing consumers that the increased price did not correspond to better seats or other perks. The CMA also took issue with Ticketmaster's handling of standing room tickets. It explained that the company sold off a cheaper category of standing ticket first then surprised buyers waiting in extensive online queues wi",
        "id": 2404598,
        "language": null,
        "link": "https://slashdot.org/story/25/03/25/1556254/ticketmaster-may-have-violated-consumer-protection-laws?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ticketmaster May Have Violated Consumer Protection Laws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T15:22:21+00:00",
        "description": "Infinite Reality, a 3D technology company, has acquired Napster for $207 million, the companies announced Tuesday. The deal aims to transform the once-notorious music sharing service into a metaverse platform. \n\nNapster, launched in 1999 by Shawn Fanning and Sean Parker, was the first major peer-to-peer file-sharing application before legal battles forced its closure in 2001. Since 2016, it has operated as a subscription streaming service. Infinite Reality plans to create virtual 3D spaces where music fans can experience concerts together and artists can sell merchandise.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Music+Pioneer+Napster+Sells+For+%24207+Million%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F03%2F25%2F1229231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=http",
        "id": 2403721,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/25/1229231/music-pioneer-napster-sells-for-207-million?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Music Pioneer Napster Sells For $207 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T15:22:21+00:00",
        "description": "OpenAI CEO Sam Altman believes companies will eventually need fewer software engineers as AI continues to transform programming. \"Each software engineer will just do much, much more for a while. And then at some point, yeah, maybe we do need less software engineers,\" Altman told Stratechery. \n\nAI now handles over 50% of code authorship in many companies, Altman estimated, a significant shift that's happened rapidly as large language models have improved. The real paradigm shift is still coming, he said. \"The big thing I think will come with agentic coding, which no one's doing for real yet,\" Altman said, suggesting that the next breakthrough will be AI systems that can independently tackle larger programming tasks with minimal human guidance. \n\nWhile OpenAI continues hiring engineers for now, Altman recommended that high school graduates entering the workforce \"get really good at using AI tools,\" calling it the modern equivalent of learning to code. \"When I was graduating as a senior",
        "id": 2403720,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/25/1428259/openai-ceo-altman-says-ai-will-lead-to-fewer-software-engineers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI CEO Altman Says AI Will Lead To Fewer Software Engineers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T13:34:46+00:00",
        "description": "An anonymous reader quotes a report from ZDNet: There are many stories of how artificial intelligence came to take over the world, but one of the most important developments is the emergence in 2012 of AlexNet, a neural network that, for the first time, demonstrated a huge jump in a computer's ability to recognize images. Thursday, the Computer History Museum (CHM), in collaboration with Google, released for the first time the AlexNet source code written by University of Toronto graduate student Alex Krizhevsky, placing it on GitHub for all to peruse and download.\n \n\"CHM is proud to present the source code to the 2012 version of Alex Krizhevsky, Ilya Sutskever, and Geoffery Hinton's AlexNet, which transformed the field of artificial intelligence,\" write the Museum organizers in the readme file on GitHub. Krizhevsky's creation would lead to a flood of innovation in the ensuing years, and tons of capital, based on proof that with sufficient data and computing, neural networks could ach",
        "id": 2402969,
        "language": null,
        "link": "https://slashdot.org/story/25/03/25/0135244/alexnet-the-ai-model-that-started-it-all-released-in-source-code-form?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AlexNet, the AI Model That Started It All, Released In Source Code Form",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T10:16:09+00:00",
        "description": "Firefly Aerospace has teamed up with Blue Origin's Honeybee Robotics unit to deploy a rover on its 2028 lunar mission to study the Gruithuisen Domes -- rare volcanic formations that may reveal insights into the moon's geology and potential resources. The announcement follows Firefly's successful Blue Ghost Mission 1, which outlasted all prior commercial lunar landings. Reuters reports: The Gruithuisen Domes, located on the moon's near side, are unusual volcanic formations believed to be rich in silica -- a composition rare on the lunar surface -- and studying them could unlock clues about the moon's geological history and potential resources for future human missions. [...] The upcoming mission, part of NASA's Commercial Lunar Payload Services initiative, will use Firefly's Blue Ghost lander and Elytra Dark orbital vehicle, alongside the Honeybee Robotics rover, to explore the domes, building on the success of its debut effort, Firefly said.<p><div class=\"share_submission\" style=\"pos",
        "id": 2401476,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/25/013236/firefly-aerospace-selects-blue-origin-unit-to-explore-volcanic-formations-on-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Firefly Aerospace Selects Blue Origin Unit To Explore Volcanic Formations On Moon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T08:05:54+00:00",
        "description": "NASA's Curiosity rover has detected the largest organic molecules ever found on Mars -- decane, undecane, and dodecane -- suggesting that complex prebiotic chemistry may have occurred in the planet's ancient lakebeds. The findings have been published in the Proceedings of the National Academy of Sciences. From a press release: Scientists probed an existing rock sample inside Curiosity's Sample Analysis at Mars (SAM) mini-lab and found the molecules decane, undecane, and dodecane. These compounds, which are made up of 10, 11, and 12 carbons, respectively, are thought to be the fragments of fatty acids that were preserved in the sample. Fatty acids are among the organic molecules that on Earth are chemical building blocks of life. Living things produce fatty acids to help form cell membranes and perform various other functions. But fatty acids also can be made without life, through chemical reactions triggered by various geological processes, including the interaction of water with min",
        "id": 2400863,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/25/018216/nasas-curiosity-rover-detects-largest-organic-molecules-yet-found-on-mars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA's Curiosity Rover Detects Largest Organic Molecules Yet Found on Mars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T03:46:17+00:00",
        "description": "An anonymous reader quotes a report from Reuters: German software company SAP overtook Danish healthcare company Novo Nordisk as Europe's largest company by market capitalization on Monday. At 0900 GMT, SAP had a market cap of $340 billion, slightly more than Novo Nordisk, according to Reuters calculations using LSEG Workspace data. SAP is Europe's largest software maker, providing business application software used by companies for finance, sales, supply chain and other functions.\n \nIts shares have surged in recent years, in part due to optimism that its cloud business will be a major beneficiary of recent investment in generative artificial intelligence. While SAP shares are up 7% so far in 2025, underperforming the broader European STOXX 600 index, which is up 8.3% year-to-date, they have clocked a total return of 160% since the end of 2022, far outperforming the STOXX 600's 28%. In contrast, Novo Nordisk shares have underperformed the market in recent months after data from trial",
        "id": 2399924,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/24/2318217/software-maker-sap-becomes-europes-largest-company?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Software Maker SAP Becomes Europe's Largest Company",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T02:40:41+00:00",
        "description": "Meta is considering a paid subscription in the UK that would remove advertisements from its platform. The BBC reports: Under the plans, people using the social media sites could be asked to pay for an ad-free experience if they do not want their data to be tracked. Meta already provides ad-free subscriptions for Facebook and Instagram users in the EU, starting from euros (5 pounds) a month. A spokesperson for the firm said the company was \"exploring the option\" of offering a similar service in the UK.\n \nThey said the firm was \"engaging constructively\" with the UK data watchdog about the subscription service, following a consultation in 2024. The Information Commissioner's Office previously said it expected Meta to consider data protection concerns before it launched an ad-free subscription. Meta says personalized advertising allows its platforms to be free at the point of access.\n \nGuidance issued by the regulator in January states that users must be presented with a genuine free cho",
        "id": 2399767,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/24/2314215/meta-considers-charging-for-ad-free-facebook-and-instagram-in-the-uk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Considers Charging For Ad-Free Facebook and Instagram In the UK",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T01:36:24+00:00",
        "description": "Two in five tech workers quit in the past year due to inflexible workplace policies around hours, location, and workload intensity, with most citing a desire for remote work and greater autonomy. The Register reports: The findings come from a survey of 26,000 plus staff that operate in 35 markets, including 2,548 respondents in tech, and fly in the face of more and more corporations issuing return to office mandates and demanding long working hours. Amsterdam-based recruitment biz Randstad, which commissioned the research, says 40 percent of the tech people it polled said they resigned due to hardline policies, and 56 percent threatened to seek an alternative if their requests for flexibility were ignored.\n \nAlmost three-quarters claim remote work boosts a \"sense of community\" with colleagues -- versus the average of 58 percent across other sectors -- and 68 percent say they'd trust their employer more if they were more easy going on hours, the intensity of the work and the place whe",
        "id": 2399558,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/24/2258219/2-in-5-tech-workers-quit-over-inflexible-workspace-policies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "2 In 5 Tech Workers Quit Over Inflexible Workspace Policies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T01:36:24+00:00",
        "description": "Samsung Electronics vice chairman and co-CEO, Han Jong-hee, passed away from a heart attack on Tuesday at the age of 63. The Korea Herald reports: Since joining Samsung Electronics, Han held several key positions, including head of the LCD TV Lab. In 2021, he was appointed vice chairman and co-CEO, taking charge of the company's Device eXperience or DX division, which oversees its electronics and consumer device businesses. Developing...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung+CEO+Han+Jong-hee+Passes+Away+At+63%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F25%2F0058230%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F25%2F0058230%2Fsamsung-ceo-han-jong-hee-passes-away-at-63%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img ",
        "id": 2399557,
        "language": null,
        "link": "https://slashdot.org/story/25/03/25/0058230/samsung-ceo-han-jong-hee-passes-away-at-63?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Samsung CEO Han Jong-hee Passes Away At 63",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T00:27:29+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Jack Ma-backed Ant Group used Chinese-made semiconductors to develop techniques for training AI models that would cut costs by 20%, according to people familiar with the matter. Ant used domestic chips, including from affiliate Alibaba and Huawei, to train models using the so-called Mixture of Experts machine learning approach, the people said. It got results similar to those from Nvidia chips like the H800, they said, asking not to be named as the information isn't public. Hangzhou-based Ant is still using Nvidia for AI development but is now relying mostly on alternatives including from Advanced Micro Devices and Chinese chips for its latest models, one of the people said.\n \nThe models mark Ant's entry into a race between Chinese and US companies that's accelerated since DeepSeek demonstrated how capable models can be trained for far less than the billions invested by OpenAI and Alphabet Inc.'s Google. It underscores how Chinese c",
        "id": 2399298,
        "language": null,
        "link": "https://slashdot.org/story/25/03/24/2047228/jack-ma-backed-ant-touts-ai-breakthrough-using-chinese-chips?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Jack Ma-Backed Ant Touts AI Breakthrough Using Chinese Chips",
        "vote": 0
    }
]