[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T17:00:56+00:00",
        "description": "While the story mode is truly, truly a missed opportunity, the actual fighting and combat are so well done that BLEACH Rebirth of Souls is very much a game worth playing even if you have no interest in the source material (as long as you like fighting games, in any case). \n\nThe shortcomings and cut corners are obvious, and it is easy to decry what this game is not - if only it wasn’t another arena fighter! If only the story mode wasn’t done so poorly! – however, doing that also potentially misses attributing the credit to this game that it obviously deserves in so many areas. Bleach: Rebirth of Souls is still a very flawed game, much like most other anime adaptations are – but its highs are much higher, and that gives me hope for a potential follow-up down the line that truly does Justin to this property, and gives it the adaptation that it deserves. \n\nHopefully, it will be the good and obviously talented folks at Tamsoft who bring that to us.",
        "id": 2405288,
        "language": null,
        "link": "https://www.youtube.com/watch?v=hGl8FOSCeGY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hGl8FOSCeGY/hqdefault.jpg",
        "title": "BLEACH Rebirth of Souls Review - Missed Opportunity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T15:00:13+00:00",
        "description": "Rebellion has earned itself a healthy fanbase over the years with its Sniper Elite and Zombie Army outings, and deservedly so, but Atomfall, the studio’s newest release, also feels like its most unique. \n\nOn paper, the open world dystopian survival game shares more than a little bit of its DNA with games such as Fallout and S.T.A.L.K.E.R., but at the same time, it feels quite unique and unlike anything else. \n\nThough not necessarily a technical marvel, and decidedly more contained than other games of its sort, Atomfall successfully concocts a fascinating setting that is a joy to behold and just as much of a blast to explore.",
        "id": 2403772,
        "language": null,
        "link": "https://www.youtube.com/watch?v=9i4IBM0NFjY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9i4IBM0NFjY/hqdefault.jpg",
        "title": "DO NOT SKIP Atomfall",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-25T09:30:31+00:00",
        "description": "Assassin's Creed Shadows is finally available worldwide for Xbox Series X/S, PS5 and PC, and it's a big hit. Which is surprising because while preliminary reports indicated it would perform well, no one expected it to reach two million players within two days of launch.\n\nThere are also reports of the open-world action RPG having the second-biggest launch in the series, handily beating Odyssey and only ranking behind Valhalla. \n\nBut what makes it so beloved? Is it the dual protagonists? The Feudal Japan setting that fans have craved for years? All the work that's gone into the meticulously crafted and gorgeous open world? \n\nWhatever the case, Shadows is garnering attention in all the right ways.",
        "id": 2401488,
        "language": null,
        "link": "https://www.youtube.com/watch?v=wDilk1unkII",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wDilk1unkII/hqdefault.jpg",
        "title": "Why Do MILLIONS of GAMERS Love Assassin's Creed Shadows?",
        "vote": 0
    }
]