[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T23:10:57.796680+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T23:00:00+00:00",
        "description": "Google's Android 16 QPR2 beta 1 is rolling out with new customization features, including the ability to force dark mode and icon themes on apps that don't support them. The update also adds enhanced parental controls, better data migration, PDF editing, and Bluetooth audio sharing, with a full release expected in December. The Verge reports: The beta includes a new dark theme option that will \"intelligently invert the UI of apps that appear light despite users having selected the dark theme\" when enabled, according to Google's announcement, forcibly making apps that don't natively support the feature to appear darker. Google says this is \"largely intended as an accessibility feature\" for users with low vision or photosensitivity, and will also automatically darken app splash screens and adjust status bar colors to match the darker theming.\n \nAnother feature will allow users to forcibly apply themed icon colors to apps that don't natively support them. Android's icon theming currently",
        "id": 3387813,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/21/209213/googles-next-big-android-update-can-force-dark-mode-and-icon-themes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's Next Big Android Update Can Force Dark Mode and Icon Themes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T23:10:57.973163+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T22:20:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: Jay Blahnik was a fitness superstar with a book and nearly two decades of work with Nike before he was hired in 2013 to work on the Apple Watch. He became known inside Apple as the creator of the watch's signature fitness feature: three circular bands that people could complete through the day by exercising, standing and burning calories. Marketed with the tagline \"Close Your Rings,\" the concept helped galvanize sales of Apple's first breakout product after Steve Jobs's death. But along the way, Mr. Blahnik created a toxic work environment (Warning: source may be paywalled; alternative source), said nine current and former employees who worked with or for Mr. Blahnik and spoke about personnel issues on the condition of anonymity. They said Mr. Blahnik, 57, who leads a roughly 100-person division as vice president for fitness technologies, could be verbally abusive, manipulative and inappropriate. His behavior contributed to ",
        "id": 3387814,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/08/21/202225/apple-fitness-chief-accused-of-toxic-workplace-culture-and-harassment?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Fitness Chief Accused of Toxic Workplace Culture and Harassment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T22:02:21.189003+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T21:40:00+00:00",
        "description": "Google is rolling out AI Mode in Search to 180 countries, expanding beyond the US, UK, and India, with even more countries being added soon. The search giant is also expanding its AI Mode's agentic capabilities, so you can now use natural language to find restaurant reservations. Engadget reports: Google says you can ask about getting a dinner reservation with conditions such as group size, date, location and your preference of cuisine, all of which be taken into consideration when AI Mode pulls in its results from across the web. Suggestions will be presented in list form with the available reservation slots. It'll also provide a link to the booking page you need. Google also plans to add local service appointments and event ticketing capabilities soon, with Ticketmaster and StubHub among its partners.\n \nAI Mode leverages Google's web-browsing AI agent Project Mariner' its direct partners on Search and resources like Knowledge Graph and Google Maps when prompted to find you somewhere",
        "id": 3387389,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/21/1952214/google-ai-mode-is-expanding-to-180-countries-adding-an-agentic-restaurant-finder?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google AI Mode Is Expanding To 180 Countries, Adding an Agentic Restaurant Finder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T22:02:21.416205+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T21:00:00+00:00",
        "description": "Light pollution extends the active hours of birds worldwide by nearly an hour, fundamentally altering the natural rhythms of over 500 species across multiple continents. Analysis of 60 million bird call recordings reveals that artificial lighting causes birds to begin vocalizing 20 minutes earlier each morning and continue 30 minutes later each evening. The effect varies significantly by species anatomy and behavior. \n\nBirds with proportionally larger eyes experience the strongest responses, with American Robins in highly illuminated areas beginning their songs up to two hours before sunrise. Species nesting in tree cavities or enclosed spaces show minimal changes, as opaque barriers shield them from artificial light. The research, drawing from BirdWeather devices deployed globally by birdwatchers, is the largest analysis of light pollution's biological impacts to date.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status",
        "id": 3387390,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/21/1949240/artificial-light-has-essentially-lengthened-birds-day?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Artificial Light Has Essentially Lengthened Birds' Day",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T20:57:04.306152+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T20:20:00+00:00",
        "description": "Denmark's PostNord will end centuries of letter delivery as digitalization and high postage costs make physical mail nearly obsolete. The BBC reports: The steep decline in letter volumes has been driven largely by digitalization, and PostNord announced in March that it will cease letter services at the end of the year. It will bring to an end four centuries of letter deliveries by the state-owned operation. A third of its workforce is being let go, as it sheds 2,200 positions in its loss-making letter arm. Instead it will focus on its profitable parcel business, creating 700 new roles. \"Danes hardly receive any letters anymore. It's been going down for years and years,\" says Kim Pedersen, chief of PostNord Denmark. \"They're receiving one letter a month on average, it's not a lot.\" \"On the contrary, Danes love to shop online,\" he adds. \"Global e-commerce is growing significantly, and we are moving with it.\"\n \nFifteen years ago, PostNord operated several enormous letter-sorting faciliti",
        "id": 3386903,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/21/1928230/denmark-ending-letter-deliveries-is-a-sign-of-the-digital-times?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark Ending Letter Deliveries Is a Sign of the Digital Times",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T20:57:04.486971+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T19:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: As banks around the world prepare to replace many thousands of workers with AI, Australia's biggest bank is scrambling to rehire 45 workers after allegedly lying about chatbots besting staff by handling higher call volumes. In a statement Thursday flagged by Bloomberg, Australia's main financial services union, the Finance Sector Union (FSU), claimed a \"massive win\" for 45 union members whom the Commonwealth Bank of Australia (CBA) had replaced with an AI-powered \"voice bot.\"\n \nThe FSU noted that some of these workers had been with CBA for decades. Those workers in particular were shocked when CBA announced last month that their jobs had become redundant. At that time, CBA claimed that launching the chatbot supposedly \"led to a reduction in call volumes\" by 2,000 a week, FSU said. But \"this was an outright lie,\" fired workers told FSU. Instead, call volumes had been increasing at the time they were dismissed, with CBA supposedly \"",
        "id": 3386904,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/21/1919258/bank-forced-to-rehire-workers-after-lying-about-chatbot-productivity-union-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bank Forced To Rehire Workers After Lying About Chatbot Productivity, Union Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T19:39:40.684408+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T18:58:00+00:00",
        "description": "Cisco, the San Jose-based technology giant, has announced another round of layoffs affecting Bay Area workers, marking a familiar pattern of reporting skyrocketing revenue followed by drastic job cuts. From a report: According to Aug. 13 WARN filings with California's Employment Development Department, the company will eliminate 221 positions across its Milpitas and San Francisco offices. \n\nWARN documents are generally required by the state in the event of mass layoffs. Employees were notified of the layoffs on Aug. 14 and their terminations will be effective Oct. 13. The most cuts, affecting 157 jobs, largely in software engineering roles, were at Cisco's Milpitas office at 560 McCarthy Blvd. \n\nCisco's San Francisco office at 500 Terry A. Francois Blvd. will cut 64 positions, according to the filing. The filings came the same day Cisco released its fourth-quarter earnings, which reported $14.7 billion in revenue, an 8% increase from the same quarter last year. Revenue for the 2025 fi",
        "id": 3386409,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/21/1858221/cisco-announces-mass-layoffs-just-after-soaring-revenue-report?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cisco Announces Mass Layoffs Just After Soaring Revenue Report",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T18:35:30.524373+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T18:10:00+00:00",
        "description": "Gaming handhelds are becoming the industry's new battleground as Microsoft launches its ROG Xbox Ally devices October 16, chasing Nintendo Switch 2's record-breaking 5.8 million units sold in seven weeks. The ASUS-manufactured handhelds run full Windows 11 with a gaming-optimized interface, accessing Xbox Game Pass, Steam, Battle.net, and other PC storefronts without platform lockdown. \n\nTwo models arrive at launch: the standard Xbox Ally with AMD Ryzen Z2 A processor and the premium Xbox Ally X featuring Ryzen AI Z2 Extreme, 24GB RAM, 1TB storage, and 80Wh battery. Microsoft's Handheld Compatibility Program pre-verifies thousands of PC games for portable play. Pricing remains unannounced.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Re-joins+Handheld+Gaming+Fight+Against+Nintendo's+Switch%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F08%2F21%2F187249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter",
        "id": 3385965,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/21/187249/microsoft-re-joins-handheld-gaming-fight-against-nintendos-switch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Re-joins Handheld Gaming Fight Against Nintendo's Switch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T18:35:30.701342+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T17:30:00+00:00",
        "description": "Phone manufacturers rarely acknowledge that IP68 water resistance degrades over time, but Google has broken that silence with advertising disclaimers for its Pixel 10 Pro Fold. The fine print explicitly warns that water and dust protection \"will diminish or be lost over time due to normal wear and tear, device repair, disassembly or damage.\" The company further notes that liquid damage voids warranties despite IP68 certification at manufacture.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Says+the+Quiet+Part+Out+Loud%3A+IP68+Protection+Doesn't+Last%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F21%2F1727239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F21%2F1727239%2Fgoogle-says-the-quiet-part-out-loud-ip68-protection-does",
        "id": 3385966,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/21/1727239/google-says-the-quiet-part-out-loud-ip68-protection-doesnt-last?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Says the Quiet Part Out Loud: IP68 Protection Doesn't Last",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T17:26:22.049657+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T16:50:00+00:00",
        "description": "Solar panels in space could cut Europe's terrestrial renewable energy needs by 80% by 2050, a study has found. The Guardian: Using a detailed computer model of the continent's future power grid, the researchers found that a system of space-based panels designed by Nasa could reduce the cost of the whole European power system by as much as 15%. It could also cut battery use by more than two-thirds. \n\nThe study, led by researchers at King's College London, is the first to assess the possible impact of space solar energy on Europe. The space-based solar power (SBSP) panels that yielded the positive results uses a heliostat design. The design, which the system imitates, uses mirror-like reflectors to collect sunlight in orbit. The sunlight is then transmitted to stations on Earth and converted to electricity before it is delivered to an energy grid. The computer model of the continent's power grid spans 33 countries, and simulates electricity demand, generation and storage to identify the",
        "id": 3385342,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/21/1650224/solar-panels-in-space-could-provide-80-of-europes-renewable-energy-by-2050?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Solar Panels in Space 'Could Provide 80% of Europe's Renewable Energy By 2050'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T16:20:39.595391+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T16:01:00+00:00",
        "description": "A federal appeals court rejected T-Mobile's attempt to overturn $92 million in fines for selling customer location information to third-party firms. From a report: The Federal Communications Commission last year fined T-Mobile, AT&amp;T, and Verizon, saying the carriers illegally shared access to customers' location information without consent and did not take reasonable measures to protect that sensitive data against unauthorized disclosure. The fines relate to sharing of real-time location data that was revealed in 2018, but it took years for the FCC to finalize the penalties. \n\nThe three carriers appealed the rulings in three different courts, and the first major decision was handed down Friday. A three-judge panel at the US Court of Appeals for the District of Columbia Circuit ruled unanimously against T-Mobile and its subsidiary Sprint. \"Every cell phone is a tracking device,\" the ruling begins. \"To receive service, a cell phone must periodically connect with the nearest tower in",
        "id": 3384710,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/21/160246/t-mobile-claimed-selling-location-data-without-consent-is-legal---judges-disagree?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "T-Mobile Claimed Selling Location Data Without Consent is Legal - Judges Disagree",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T16:20:39.773275+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T15:21:00+00:00",
        "description": "The era of software without embedded AI assistants is increasingly ending as Adobe launches Acrobat Studio, adding collaborative AI workspaces to the 32-year-old PDF format. The new platform allows users to upload multiple documents into \"PDF spaces\" where personalized chatbot assistants parse and answer questions about their contents. \n\nAdobe began integrating generative AI into Acrobat last year and now positions this release as the format's biggest transformation since its 1993 debut. The shift arrives amid growing user fatigue with AI features proliferating across everyday applications -- a Pew Research Center report found US adults more concerned than excited about AI's impact on their lives. Adobe's move cements 2025 as the year generative AI became inescapable in essential software, fundamentally altering how users interact with documents that once replicated the familiarity of paper.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://t",
        "id": 3384711,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/21/1416226/the-ai-powered-pdf-marks-the-end-of-an-era?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The AI-Powered PDF Marks the End of an Era",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T15:10:02.940210+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T14:40:00+00:00",
        "description": "President Donald Trump says his administration will not approve solar or wind power projects, even as electricity demand is outpacing the supply in some parts of the U.S. From a report: \"We will not approve wind or farmer destroying Solar,\" Trump, who has complained in the past that solar takes up too much land, posted on Truth Social. \"The days of stupidity are over in the USA!!!\" \n\nThe president's comment comes after the administration tightened federal permitting for renewables last month. The permitting process is now centralized in Interior Secretary Doug Burgum's office. Renewable companies fear that projects will no longer receive permits that were once normal course of business.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Will+Not+Approve+Solar+or+Wind+Power+Projects%2C+President+Says%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F08%2F21%2F1224252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><",
        "id": 3384089,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/21/1224252/us-will-not-approve-solar-or-wind-power-projects-president-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Will Not Approve Solar or Wind Power Projects, President Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T15:10:03.130971+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T14:00:00+00:00",
        "description": "A complete shutdown of encrypted web traffic isolated China from the global internet for 74 minutes Wednesday morning, blocking citizens from accessing foreign websites and disrupting international business operations that depend on secure connections to offshore servers. The Great Firewall began injecting forged TCP RST+ACK packets to terminate all connections on port 443 at 00:34 Beijing time on August 20, according to activist group Great Firewall Report. \n\nThe standard HTTPS port carries most modern web traffic, meaning Chinese users lost access to virtually all foreign-hosted websites while companies including Apple and Tesla couldn't connect to servers powering their basic services. The blocking device didn't match known Great Firewall hardware fingerprints, suggesting Beijing either deployed new censorship equipment or experienced a configuration error. No significant events requiring information blackout occurred during the outage window. Pakistan's internet traffic dropped si",
        "id": 3384090,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/21/0543252/china-isolates-itself-from-worldwide-web-for-over-an-hour?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Isolates Itself From Worldwide Web For Over an Hour",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T14:04:50.086192+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Adweek: Meta wanted advertisers to believe its ecommerce ad product, Shops ads, was outperforming the competition, per a whistleblower complaint filed in a U.K. court. The former employee alleges the social media giant artificially inflated return on ad spend (ROAS) by counting shipping fees as revenue, subsidizing bids in ad auctions, and applying undisclosed discounts. The complaint, viewed by ADWEEK, was filed with the London Central Employment Tribunal on Wednesday (August 20) by Samujjal Purkayastha, a former product manager on Meta's Shops ads team. The document claims Meta artificially inflated performance metrics to push brands toward its fledgling ecommerce ad product.\n \nThe company's motivation, the complaint says, was in part to combat Apple's 2021 privacy changes that cut the troves of iOS tracking information that had long powered Meta's ad machine. Meta's former chief financial officer (CFO), David Wehner, said the changes would c",
        "id": 3383442,
        "language": "en-us",
        "link": "https://meta.slashdot.org/story/25/08/21/0258229/whistleblower-alleges-meta-artificially-boosted-shops-ads-performance?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Whistleblower Alleges Meta Artificially Boosted Shops Ads Performance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T10:38:30.850309+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T10:00:00+00:00",
        "description": "Longtime Slashdot reader Xesdeeni writes: I received an email indicating Intuit will not support Windows 10 for the desktop versions of TurboTax starting this tax year. Laughably, they say \"security is a top priority for us\" before adding: \"To use TurboTax Desktop software for tax year 2025, your computer will need to run on Microsoft Windows 11 [or] TurboTax Online.\"\n\n\nI'm just paranoid enough to use the desktop version, since at least it limits what they see to the forms they send to the IRS -- rather than everything. Even if I was willing to endure the added burden of printing and mailing the forms, this would be the end of that, since I'm out on Windows 11 for the reasons you already know. \n\nHere's what they sent: \nHi there,\n\nWe're reaching out to provide an update on TurboTax Desktop software for tax year 2025. After October 14, 2025, Microsoft will no longer provide software updates, technical assistance, or security fixes for Windows 10 operating system. Because security is a t",
        "id": 3381885,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/21/0218239/intuit-claims-security-concerns-in-dropping-windows-10-for-turbotax?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intuit Claims Security Concerns In Dropping Windows 10 For TurboTax",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T07:20:58.261695+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T07:00:00+00:00",
        "description": "Google, TVA, and Kairos Power are teaming up to power data centers with advanced nuclear energy through a collaboration in Oak Ridge, Tennessee. The project aims to deliver 50 MW of nuclear energy by 2030. From a blog post: Today we announced the first deployment of Kairos Power's advanced nuclear reactor -- the Hermes 2 Plant in Oak Ridge, Tennessee -- through a new power purchase agreement (PPA) between Kairos Power and Tennessee Valley Authority (TVA). Marking the first purchase of electricity from an advanced GEN IV reactor by a U.S. utility, this agreement will enable 50 megawatts (MW) of nuclear energy on TVA's grid that powers our data centers in Montgomery County, Tennessee and Jackson County, Alabama.\n \nLast October, we began a long-term collaboration with Kairos Power to unlock up to 500 MW of nuclear power for the U.S. electricity system through multiple deployments of their small modular reactor. With this next step, we are creating a three-party solution where energy cust",
        "id": 3380790,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/21/0251255/google-plans-advanced-nuclear-reactor-project-for-tennessee?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Plans Advanced Nuclear Reactor Project For Tennessee",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T03:58:26.654508+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Serbian scientists have been experimenting with mealworms as a way to break down polystyrene. Larisa Ilijin, a principal research fellow at Belgrade's Institute for Biology, said the scientists had discovered that mealworms can digest various plastics, including polystyrene, which is used in packaging, insulation and food containers. In the project endorsed by the government and the United Nations' agency for international development, UNDP, and other international donors, they have been including the polystyrene in the regular food of the larval form of the yellow mealworm beetle, or Tenebrio molitor.\n \nThey habitually eat more or less anything, but need the training to eat the plastic products. \"We have larvae that have been adapted over a long time to biodegrade plastic, to be as efficient as possible in the process,\" Ilijin told Reuters. She said the bacteria living in their guts break down the plastic into carbon dioxide and water",
        "id": 3379939,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/20/2245213/serbian-scientists-experiment-with-mealworms-to-degrade-polystyrene?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Serbian Scientists Experiment With Mealworms To Degrade Polystyrene",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T02:53:21.618245+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T02:30:00+00:00",
        "description": "According to the Wall Street Journal, Meta has paused hiring in its artificial intelligence division after bringing on more than 50 researchers and engineers. \"All that's happening here is some basic organizational planning: creating a solid structure for our new superintelligence efforts after bringing people on board and undertaking yearly budgeting and planning exercises,\" a spokesperson for Meta said in an emailed statement to Reuters.\n \nOver the last few months, Meta has been offering AI researchers salaries that dwarf those of the Manhattan Project and the Space Race. The company recently offered AI researcher Matt Deitke $250 million over four years (an average of $62.5 million per year), with potentially $100 million in the first year alone. Meta CEO Mark Zuckerberg reportedly also offered an unnamed AI engineer $1 billion in compensation to be paid out over several years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/",
        "id": 3379701,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/21/0227208/meta-freezes-ai-hiring?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Freezes AI Hiring",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T01:48:32.775855+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T01:25:00+00:00",
        "description": "A new review of nearly 700 studies on portable air cleaners found that over 90% of them were tested in empty spaces, not on people, leaving major gaps in evidence about whether these devices actually prevent infections or if they might even cause harm by releasing chemicals like ozone or formaldehyde. The Conversation reports: Many respiratory viruses, such as COVID-19 and influenza, can spread through indoor air. Technologies such as HEPA filters, ultraviolet light and special ventilation designs -- collectively known as engineering infection controls -- are intended to clean indoor air and prevent viruses and other disease-causing pathogens from spreading. Along with our colleagues across three academic institutions and two government science agencies, we identified and analyzed every research study evaluating the effectiveness of these technologies published from the 1920s through 2023 -- 672 of them in total.\n \nThese studies assessed performance in three main ways: Some measured w",
        "id": 3379451,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/20/2236217/most-air-cleaning-devices-have-not-been-tested-on-people?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Most Air Cleaning Devices Have Not Been Tested On People",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T01:48:32.969297+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T00:45:00+00:00",
        "description": "Last week, following a recent U.S. Customs ruling, Apple reintroduced blood oxygen monitoring to certain Apple Watch models in the U.S., sidestepping an ITC import ban stemming from its legal dispute with medical device maker Masimo. Today, Masimo fired back with a new lawsuit against the U.S. Customs and Border Protection. 9to5Mac reports: The company says US Customs and Border Protection (CBP) overstepped its authority and violated due process when it reversed its earlier decision on August 1 and allowed Apple to restore the feature. Moreover, Masimo says it found out about the decision when Apple publicly announced the return of the feature: \"It has now come to light that CBP thereafter reversed itself without any meaningful justification, without any material change in circumstances, and without any notice to Masimo, let alone an opportunity for Masimo to be heard. CBP changed its position on Apple's watch-plus-iPhone redesign through an ex parte proceeding. Specifically, on Augus",
        "id": 3379452,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/20/2222249/masimo-sues-us-customs-over-apple-watch-blood-oxygen-workaround?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Masimo Sues US Customs Over Apple Watch Blood Oxygen Workaround",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-21T00:43:50.083534+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-21T00:02:00+00:00",
        "description": "A 22-year-old Oregon man has been charged with operating one of the most powerful botnets ever recorded. The network, known as Rapper Bot, launched over 370,000 DDoS attacks worldwide, including against X, DeepSeek, U.S. tech firms, and even Defense Department systems. It was allegedly operated by Ethan Foltz of Eugene, Oregon. The Wall Street Journal reports: Foltz faces a maximum of 10 years in prison on a charge of abetting computer intrusions, the Justice Department said in a news release. Rapper Bot was made up of tens of thousands of hacked devices and was capable of flooding victims' websites with enough junk internet traffic to knock them offline, an attack known as a distributed denial of service, or DDoS.\n \nIn February, the networking company Nokia measured a Rapper Bot attack against a gaming platform at 6.5 trillion bits per second, well above the several hundred million bits a second of the average high-speed internet connection. \"This would place Rapper Bot among the mos",
        "id": 3379246,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/20/2214216/oregon-man-accused-of-operating-one-of-most-powerful-attack-botnets-ever-seen?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Oregon Man Accused of Operating One of Most Powerful Attack 'Botnets' Ever Seen",
        "vote": 0
    }
]