[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-07T15:30:11+00:00",
        "description": "You never quite know what you’re going to get from Microsoft’s first-party output when you’re entering a new year, especially these last few years. There’s never any shortages of ups and downs, but thus far, 2025 is shaping up to be a solid year for Xbox, based on the games that the company has officially announced for the year up to this point. \n\nFable, The Outer Worlds, Avowed, South of Midnight, and DOOM: The Dark Ages are already a formidable lineup for any single year, but if the company adds more on top of that (as rumours suggest it will), things are bound to get even spicier. \n\nIn short, as far as new games are concerned, 2025 is looking like an exciting year for Microsoft.",
        "id": 1852290,
        "language": null,
        "link": "https://www.youtube.com/watch?v=W1I_H-kwYdc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/W1I_H-kwYdc/hqdefault.jpg",
        "title": "Xbox Has A Packed Year Ahead But There Is ONE MAJOR CAVEAT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-07T13:30:17+00:00",
        "description": "Some games attempt to reinvent the wheel when developing a sequel, occasionally doing away with what made the original so good. Others stick a little too close to a familiar formula, which has its own drawbacks. Kingdom Come: Deliverance 2 seeks a balance.\n\nIt sees the return of Henry, continuing on a journey to avenge his parents. And while many of its fundamentals, from the first-person melee combat to the choice-driven story, remain, there are hundreds of changes and improvements to behold. The world is bigger than the first game, but it's also more reactive, responding to your actions more naturally.\n\nCombat is also significantly improved with weapons having unique move sets and new additions to one's arsenal. With Kingdom Come: Deliverance 2 out on February 4th for PC, Xbox Series X/S, and PS5, check out 15 ways it differs from its predecessor.",
        "id": 1851165,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QqCiRwPHq1E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QqCiRwPHq1E/hqdefault.jpg",
        "title": "Kingdom Come Deliverance 2 vs 1 - 15 BIGGEST DIFFERENCES You Need To Know",
        "vote": 0
    }
]