[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-07T23:02:10+00:00",
        "description": "<p>Antonio G. Di Benedetto, reporting for The Verge:</p>\n\n<blockquote>\n  <p>The tech industry’s relentless march toward labeling everything\n“plus,” “pro,” and “max” soldiers on, with Dell now taking the\nnaming scheme to baffling new levels of confusion. The PC maker\nannounced at CES 2025 that it’s cutting names like XPS, Inspiron,\nLatitude, Precision, and OptiPlex from its new laptops, desktops,\nand monitors and replacing them with three main product lines:\nDell (yes, just <em>Dell</em>), Dell Pro, and Dell Pro Max.</p>\n\n<p>If you think that sounds a bit Apple-y and bland, you’re right.\nBut Dell is taking it further by also adding a bit of auto\nindustry parlance with three sub-tiers: Base, Plus, and Premium.</p>\n</blockquote>\n\n<p>It’s simple, really. You can choose a Dell Pro Premium, which is not as good as a Dell Pro Max Plus, but both are better than a Dell Premium, which actually isn’t <em>premium</em> at all. Easy.</p>\n\n<p>It is never not funny when a company is willing to shame",
        "id": 1855544,
        "language": null,
        "link": "https://www.theverge.com/2025/1/6/24325799/dell-pro-max-premium-plus-ces-laptop-pc-rebrand-announcement",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dude, You’re Getting a Dell Pro Max Premium Plus",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-07T22:41:55+00:00",
        "description": "<p>Mark Zuckerberg today announced major changes to the way Meta is going to apply content moderation across Facebook, Instagram, and (I presume, Threads). His main announcement is <a href=\"https://www.instagram.com/p/DEhf2uTJUs0/\">a video</a>, for which there’s <a href=\"https://x.com/justlikethepoet/status/1876612805685583958?s=46\">an unofficial transcript here</a>. Zuckerberg himself <a href=\"https://www.threads.net/@zuck/post/DEhgYx4JbEG\">summarized his own points in a thread on Threads</a>, which I’ll annotate below:</p>\n\n<blockquote>\n  <p>1/ Replace fact-checkers with Community Notes, starting in the US.</p>\n</blockquote>\n\n<p>This sounds ... fine? Just about everything at Twitter/X has taken a turn for the worse under Musk, but community notes seem to be a model <a href=\"https://x.com/eric_seufert/status/1876644965121397067\">that actually works pretty well</a>. My favorite two social platforms right now, by far, are Bluesky and Mastodon. Neither has fact checkers. And I’ve never",
        "id": 1855545,
        "language": null,
        "link": "https://daringfireball.net/2025/01/meta_zuck_content_moderation_zig_zag",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "★ After Years of Moderation-Heavy Zagging, Zuckerberg Announces That Meta Is Going to Back to Moderation-Light Zigging Across Its Platforms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-07T01:05:59+00:00",
        "description": "<p>Jason Snell, writing at Six Colors:</p>\n\n<blockquote>\n  <p>So what can Apple do now? A non-apology and the promise of a\nwarning label isn’t enough. The company should either give all\napps the option of opting out of AI summaries, or offer an opt-out\nto the developers of specific classes of apps (like news apps).\nNext, it should probably build separate pathways for notifications\nof related content (a bunch of emails or chat messages in a\nthread) versus unrelated content (BBC headlines, podcast episode\ndescriptions) and change how the unrelated content is summarized.\nPerhaps a little further down the road, news notifications should\nbe summarized based on the full text of the news article, rather\nthan generating a secondhand machine summary of a story already\nsummarized by a human headline writer.</p>\n</blockquote>\n\n<p>In all the years Snell and I have been doing what we do, I don’t think we’ve ever come so close to writing the exact same take at the same time. The only subtle differ",
        "id": 1847873,
        "language": null,
        "link": "https://sixcolors.com/post/2025/01/apple-intelligence-summaries-might-get-warning-labels-thats-not-enough",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Jason Snell: ‘Apple Intelligence Summaries Might Get Warning Labels. That’s Not Enough.’",
        "vote": 0
    }
]