[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-02T16:36:15.258866+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-02T15:30:28+00:00",
        "description": "For many people, Monster Hunter Wilds was a big deal at launch, representing the next big step forward for the franchise. Its ever-reliable weapon trees and combat combined with a new setting, larger and more organic regions, and new monsters promised something special.\n\nPerhaps it was the love for Monster Hunter World talking, especially given how much it influenced Wilds. Though an unmitigated success, with over 10 million sold in its first month and near-universal acclaim among critics, it's in an extremely odd place right now. Player numbers are down significantly even after a major Title Update dropped.\n\nThe endgame is still considered barren, and before Lagriacus and Seregios dropped, the difficulty was considered nowhere near the genre's best. That's not even accounting for PC performance, which, despite patches and improvements, is still far from ideal, resulting in negative reviews on Steam. \n\nRecent additions are a step in the right direction, but suffice it to say that it's",
        "id": 3069421,
        "language": null,
        "link": "https://www.youtube.com/watch?v=pvVVAKOyra8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pvVVAKOyra8/hqdefault.jpg",
        "title": "Why the Hell Is Monster Hunter Wilds Getting Overwhelmingly Negative Reviews?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-02T14:26:16.017708+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-02T13:30:39+00:00",
        "description": "2025 has thankfully been a year that brought more hits than misses to the gaming world. But for the ones that were misses, players were left gasping at how they failed to deliver on the experience that was promised in varying ways. \n\nWhile some experiences did have their strengths, they were largely overshadowed by weaknesses that actively prevented them from joining this year’s greatest hits. \n\nFrom an ambulance simulator that refused to allow its paramedic players to  figure out what was wrong with their patients to a very predatory take on a popular fantasy travel destination, we dive into the worst games that the first half of this otherwise excellent year has given us, and explore exactly what went wrong with them.",
        "id": 3068120,
        "language": null,
        "link": "https://www.youtube.com/watch?v=W_p8p46ppaI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/W_p8p46ppaI/hqdefault.jpg",
        "title": "Top 10 WORST Games of 2025 So Far [First Half]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-02T04:32:15.952203+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-02T04:00:16+00:00",
        "description": "New free-to-play competitive multiplayer titles aren't exactly uncommon these days, but with how crowded the market already is, you need something special to stand out. So why not mechs?\n\nUnlike your MechWarriors or Armored Cores, Mecha Break from Amazing Seasun Games takes ample inspiration from franchises like Gundam, Macross, and many more for its roster. Breaking off excess parts and entering a Trans-Am-like state? Transforming into a plane and raining down missiles on the opposition? Hunkering down as a venerable tank? It's all here, each feeling distinct and catering to a specific mecha fantasy.\n\nAnd despite the nagging lack of soul in some parts, it works, delivering a fast-paced competitive experience. There are a few areas that need more polish - melee registration, balance, progression - but for the most part, Mecha Break offers an impressive set of features and roster to make an impact out of the gate. Whether it can build on that momentum remains to be seen.",
        "id": 3064747,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Bw5CoqvB2DY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Bw5CoqvB2DY/hqdefault.jpg",
        "title": "Mecha Break Review - The Final Verdict",
        "vote": 0
    }
]