[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T19:50:32.218694+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T19:38:00+00:00",
        "description": "An anonymous reader shared this report from the Independent:\n\n\nBitcoin and Ethereum both saw record liquidations as investors reacted to fears over a trade war, which saw many crypto investors move their money to stablecoins or safer assets... Bitcoin fell by more than 10 per cent to below $110,000, before recovering to $113,096 on Saturday morning. The value of Ethereum slumped by 11.2 per cent to $3,878. Other cryptocurrencies, including XRP, Doge and Ada, fell around 19 per cent, 27 per cent, and 25 per cent in the last 24 hours, respectively.\n \n\nLiveMint shares some statistics from Bloomberg:\n\nCiting 24-hour data from Coinglass, the report noted that more than $19 billion has been wiped out in the \"largest liquidation event in crypto history\", which impacted more than 1.6 million traders. It added that more than $7 billion of those positions were sold in less than one hour of trading on October 10. According to data on CoinMarketCap, the cryptocurrency market cap has dived to $3.7",
        "id": 3791994,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/11/1936222/bitcoin-and-other-cryptocurrencies-had-double-digit-drops-friday-largest-liquidation-event-ever",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bitcoin and Other Cryptocurrencies Had Double-Digit Drops Friday, Largest Liquidation Event Ever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T19:50:32.341992+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T18:34:00+00:00",
        "description": "\"Nvidia is investing billions in and selling chips to OpenAI, which is also buying chips from and earning stock in AMD,\" writes SFGate. \"AMD sells processors to Oracle, which is building data centers with OpenAI &mdash; which also gets data center work from CoreWeave. And that company is partially owned by, yes, Nvidia. \n\n\"Taken together, it's a doozy.\"\n\n\nThere are other collaborations and rivalries and many other factors at play, but OpenAI is the many-tentacled octopus in the middle, spinning its achievement of ChatGPT into a blitz of speculative investments. \"We are in a phase of the build-out where the entire industry's got to come together and everybody's going to do super well,\" OpenAI CEO Sam Altman told the Wall Street Journal on Monday. \"You'll see this on chips. You'll see this on data centers. You'll see this lower down the supply chain....\" \n\nSome worry that the more closely companies intertwine, the more susceptible they are to creating a bubble, or a market not actually ",
        "id": 3791995,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/11/1819237/circular-ai-mega-deals-by-ai-and-hardware-giants-are-raising-eyebrows",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Circular' AI Mega-Deals by AI and Hardware Giants are Raising Eyebrows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T18:09:42.496801+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T17:34:00+00:00",
        "description": "\"Next time Amazon hypes its Prime Days savings, remember this: The prices during the sale aren't always better,\" writes a Washington Post technology columnist. \"I've got the receipts to prove it.\"\n\n\nI would have saved, on average, almost nothing during Amazon's recent fall \"Prime Big Deal Days\" &mdash; and for some big-ticket purchases, I would have actually paid amore. For the sale that took place Oct. 7 and 8, my family went in prepared. We had a shopping list with prices we'd been tracking... A TV stand he'd been watching jumped 38 percent to $379, from $275 on Oct. 2. Same story for a few other big-ticket items on his list &mdash; another console went up from $219.99 to $299. Those products weren't listed as \"big deals\" on the site, but we certainly didn't expect their prices to spike during Prime Days. \n\nAnd in other cases, Amazon marketed discounts that turned out to be the exact price it had charged in recent weeks. One example: an Oral-B electric toothbrush was listed as 39 pe",
        "id": 3791463,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/11/070237/i-tracked-amazons-prime-day-prices-weve-been-played",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'I Tracked Amazon's Prime Day Prices. We've Been Played'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T16:43:09.192890+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T16:34:00+00:00",
        "description": "\"OpenAI is staffing up to expand ChatGPT's marketing reach and build on-platform marketing tools,\" reports Adweek:\n\nA recent job listing shows the company is hiring a Growth Paid Marketing Platform Engineer to develop internal tools for ad platform integration, campaign management, and real-time attribution. The position is part of a newly formed \"ChatGPT Growth team,\" and tasked with \"building the technical infrastructure behind OpenAI's paid marketing platform....\" This job listing is a rare signal of OpenAI's plans for an in-house marketing platform within ChatGPT, and part of the AI company's broader growth plans... \n\nThis adds to recent reporting showing that OpenAI is quickly ramping up its advertising ambitions... Alex Heath of Sources reported that OpenAI's CEO of Applications, Fidji Simo, was meeting with candidates to \"lead a new team that will be tasked with bringing ads to ChatGPT....\" OpenAI did not respond to requests for comment... \n\nCritically, this job listing would s",
        "id": 3791033,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/11/0414243/is-openai-planning-to-turn-chatgpt-into-an-ad-platform",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is OpenAI Planning to Turn ChatGPT Into an Ad Platform?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T16:43:09.337313+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T15:34:00+00:00",
        "description": "I uploaded a photo on my phone to Microsoft's \"OneDrive\" file-hosting app &mdash; and there was a surprise waiting under Privacy and Permissions. \"OneDrive uses AI to recognize faces in your photos...\" \nAnd... \n\"You can only turn off this setting 3 times a year.\" \n\n \n\nIf I moved the slidebar for that setting to the left (for \"No\"), it moved back to the right, and said \"Something went wrong while updating this setting.\" (Apparently it's not one of those three times of the year.) \n\nThe feature is already rolling out to a limited number of users in a preview, a Microsoft publicist confirmed to Slashdot. (For the record, I don't remember signing up for this face-recognizing \"preview\".) But there's a link at the bottom of the screen for a \"Microsoft Privacy Statement\" that leads to a Microsoft support page, which says instead that \"This feature is coming soon and is yet to be released.\" And in the next sentence it's been saying \"Stay tuned for more updates\" for almost two years... \n\nA Micr",
        "id": 3791034,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/11/0238213/microsofts-onedrive-begins-testing-face-recognizing-ai-for-photos-for-some-preview-users",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft's OneDrive Begins Testing Face-Recognizing AI for Photos (for Some Preview Users)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T15:23:58.209010+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T14:34:00+00:00",
        "description": "\"A 29-year-old man has been arrested on suspicion of starting the Pacific Palisades fire in Los Angeles that killed 12 people and destroyed more than 6,000 homes in January,\" reports the BBC. \n\"Evidence collected from Jonathan Rinderknecht's digital devices included an image he generated on ChatGPT depicting a burning city, justice department officials said.\"\n\nMr Rinderknecht had been living and working in California, and moved to Florida shortly after the fire, according to authorities. The initial blaze Mr Rinderknecht allegedly started on New Year's Day was called the Lachman fire. Although it was quickly suppressed by firefighters, it continued to smoulder underground in the root structure of dense vegetation, according to investigators, before it flared up again above ground in a windstorm [nearly a week later]... He lit it with an open flame after he completed a ride as an Uber driver on New Year's Eve, according to the indictment. \n\nTwo passengers rode with Mr Rinderknecht earl",
        "id": 3790612,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/11/0621234/chatgpt-iphone-history-found-for-uber-driver-charged-with-starting-californias-palisades-fire",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ChatGPT, iPhone History Found for Uber Driver Charged With Starting California's Palisades Fire",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T13:58:26.044743+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from CBC News: The study by a team from Toronto's Hospital for Sick Children (also known as Sick Kids) and St. Michael's Hospital was published in the Journal of the American Medical Association. It found that children who spent more time on screens before age eight scored lower on standardized tests. Child psychiatry researchers say handing kids digital devices, like iPads, every time they have a tantrum could lead to future issues. One new study links too much screen time to emotional and anger management problems.\n \nThe study followed more than 3,000 kids in Ontario over a 15 year span from 2008 to 2023, tracking how much time they spent watching TV or DVDs, playing video games, using the computer or playing on handheld devices like iPads, as reported by their parents. That data was compared to their EQAO standardized test scores, which are used to assess the reading and math skills of kids across Ontario in grades 3 and 6. The findings point to ",
        "id": 3790168,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/10/11/0036214/more-screen-time-linked-to-lower-test-scores-for-elementary-students",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Screen Time Linked To Lower Test Scores For Elementary Students",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T11:12:34.870705+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T10:00:00+00:00",
        "description": "theodp writes: GeekWire reports that Microsoft is bringing artificial intelligence to every public classroom in its home state -- and sparking new questions about its role in education. The Redmond tech giant on Thursday unveiled Microsoft Elevate Washington, a sweeping new initiative that will provide free access to AI-powered software and training for all 295 public school districts and 34 community and technical colleges across Washington state. The program is part of Microsoft Elevate, the company's broader $4 billion, five-year commitment to support schools and nonprofits with AI tools and training that was announced in July.\n \n\"This is our home,\" Microsoft President Brad Smith said at a launch event on the company's headquarters campus. \"A big part of what we're doing today is investing in our home.\" Smith said Microsoft understands the unease around AI in classrooms but argued that waiting isn't an option. \"I don't know that it will be possible to slow down the use of AI, even ",
        "id": 3789386,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/11/0012220/microsoft-to-provide-free-ai-tools-for-washington-state-schools",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft To Provide Free AI Tools For Washington State Schools",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T07:15:13.889701+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T07:00:00+00:00",
        "description": "Sony and AMD are collaborating on new GPU technologies for the next-generation PlayStation (likely the PS6), introducing innovations like Radiance Cores for advanced ray tracing and \"Universal Compression\" for improved performance and efficiency. The Verge reports: Sony's next console (presumably the PS6) is coming in \"a few years time,\" according to someone who I'd believe to make that claim. Mark Cerny, lead architect on the PS5 and PS5 Pro, joined Jack Huynh, SVP and GM of AMD's computing and graphics group, in a YouTube video wherein the pair spend nine minutes going through some very specific, co-developed advancements in graphics technology that will come to the next console. But the pair cautioned that the technologies are still in \"every early days\" and \"only exist in simulation right now.\"\n \nMuch of it boils down to how the companies are working to make it easier for future GPUs to handle graphics upscaling, ray tracing, and the super-intensive path tracing techniques used to",
        "id": 3788440,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/11/0050217/sony-teases-new-gpu-tech-for-the-ps6",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sony Teases New GPU Tech For the PS6",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T04:32:08.266108+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Bose will brick key features of its SoundTouch Wi-Fi speakers and soundbars soon. On Thursday, Bose informed customers that as of February 18, 2026, it will stop supporting the devices, and the devices' cloud-based features, including the companion app, will stop working. The SoundTouch app enabled numerous capabilities, including integrating music services, like Spotify and TuneIn, and the ability to program multiple speakers in different rooms to play the same audio simultaneously.\n \nBose has also said that some saved presets won't work and that users won't be able to change saved presets once the app is gone. Additionally, Bose will stop providing security updates for SoundTouch devices. The Framingham, Massachusetts-headquartered company noted to customers that the speakers will continue being able to play audio from a device connected via AUX or HDMI. Wireless playback will still work over Bluetooth; however, Bluetooth is kno",
        "id": 3787920,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/11/005219/bose-soundtouch-home-theater-systems-regress-into-dumb-speakers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bose SoundTouch Home Theater Systems Regress Into Dumb Speakers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T03:08:31.652032+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T02:02:00+00:00",
        "description": "Apple is finalizing a deal to acquire the team and computer vision technology of Prompt AI. CNBC reports: Leadership at Prompt told employees of the pending transaction at an all-hands meeting on Thursday and said that those who don't end up joining Apple will be paid a reduced salary, and encouraged to apply for open roles at the company, according to audio that was accessed by CNBC.\n \nPrompt was founded in 2023 and raised a $5 million seed round that year led by AIX and Abstract Ventures. Co-founders include CEO Tete Xiao, a notable AI researcher with a Phd in computer science from UC Berkeley, and President Trevor Darrell who was a founder of the Berkeley Artificial Intelligence Research (BAIR) lab. Investors will get paid some money in the deal but \"won't be made whole,\" executives said in the meeting. Prompt employees were asked to refrain from mentioning Apple until further notice while searching for other jobs or updating friends and family on their situation.\n \nPrompt's flagsh",
        "id": 3787688,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/11/0045255/apple-nears-deal-to-acquire-talent-and-technology-from-prompt-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Nears Deal To Acquire Talent and Technology From Prompt AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T01:48:30.271858+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T01:25:00+00:00",
        "description": "A new HSBC survey shows that over half of wealthy entrepreneurs are considering moving abroad, not for tax reasons but for business expansion, investment access, and lifestyle improvements. Singapore tops the list of preferred destinations, followed by the UK, Japan, and Switzerland -- while the U.S. has slipped to fifth place. CNBC reports: The bank polled 2,939 business owners with at least $2 million in investible assets or a total net worth of $20 million during April and May of this year. A whopping 57% reported they were considering adding a new residence over the next 12 months, up from 55% in last year's survey. Wanderlust is greater among Gen Z entrepreneurs, with just over three-quarters in that cohort reporting they were considering a move.\n \nWhen asked about their reasons for moving to a new country, only a third of all respondents cited tax efficiency as a motivator. Tax savings ranked eighth overall behind other factors such as improved security and safety (47%) and bett",
        "id": 3787490,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/10/2132252/more-than-half-of-entrepreneurs-are-considering-moving-to-a-new-country",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Than Half of Entrepreneurs Are Considering Moving to a New Country",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T01:48:30.689071+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T00:45:00+00:00",
        "description": "Toyota is fast-tracking its long-promised all-solid-state EV batteries through a new partnership with Sumitomo Metal Mining, aiming to debut its first production vehicle using the technology by 2027 or 2028. Electrek reports: Toyota said that its new batteries could significantly enhance driving range, charging times, and output, potentially transforming the future of automobiles. Compared to current liquid-based batteries, which use electrolyte solutions, Toyota's all-solid-state batteries utilize a cathode, an anode, and a solid electrolyte. According to Toyota, the next-gen battery tech \"offers the potential for smaller size, higher output, and longer life.\"\n \nThe two companies have been developing cathode materials for all-solid-state EV batteries since 2021, focusing on some of the biggest challenges in producing them at a mass scale. Using Sumitomo Metal Mining's proprietary powder synthesis technology, Toyota claimed to have developed a \"highly durable cathode material\" for all",
        "id": 3787491,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/10/2127232/toyota-aims-to-launch-the-worlds-first-all-solid-state-ev-batteries",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Toyota Aims to Launch the 'World's First' All-Solid-State EV Batteries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T00:24:35.326359+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from KrebsOnSecurity: The world's largest and most disruptive botnet is now drawing a majority of its firepower from compromised Internet-of-Things (IoT) devices hosted on U.S. Internet providers like AT&amp;T, Comcast and Verizon, new evidence suggests. Experts say the heavy concentration of infected devices at U.S. providers is complicating efforts to limit collateral damage from the botnet's attacks, which shattered previous records this week with a brief traffic flood that clocked in at nearly 30 trillion bits of data per second.\n \nSince its debut more than a year ago, the Aisuru botnet has steadily outcompeted virtually all other IoT-based botnets in the wild, with recent attacks siphoning Internet bandwidth from an estimated 300,000 compromised hosts worldwide. The hacked systems that get subsumed into the botnet are mostly consumer-grade routers, security cameras, digital video recorders and other devices operating with insecure and outdated ",
        "id": 3787189,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/10/2123234/ddos-botnet-aisuru-blankets-us-isps-in-record-ddos",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DDoS Botnet Aisuru Blankets US ISPs In Record DDoS",
        "vote": 0
    }
]