[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T16:28:01.614041+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T15:30:03+00:00",
        "description": "What's most important in the here and now is that Battlefield is back and Battlefield 6 is tons of fun to play. It's fun to go on the flank and take out an enemy squad while reviving your downed allies, or go on a tear with a tank and destroy buildings left and right. \n\nIt's fun to soar through the skies in a jet, dropping bombs that miss half the time when you're not busy dog-fighting other players. Where there was despair and widespread sadness at how DICE had massacred the franchise, there's a rediscovery of all those elements that make it so near and dear to longtime fans. And it is glorious.",
        "id": 3791012,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=4IZ0M_YJwvE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4IZ0M_YJwvE/hqdefault.jpg",
        "title": "Why Does Battlefield 6 Feel So Hard To Put Down For MILLIONS?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T13:43:50.143619+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T13:30:26+00:00",
        "description": "The ROG Xbox Ally and Ally X mark a new chapter for the Xbox and gaming handhelds, bringing a host of useful features and some serious firepower to the table. But can they shake things up in a niche where the best of the best are already engaged in fierce competition?\n\nWe take a look at a few pros and cons of the new devices, and leave it to you to decide if they are going to fit your gaming needs, or if you need to look elsewhere. But for what it's worth, the new Ally and Ally X are certainly going to be solid offerings when they finally hit the shelves, and perhaps the perfect devices for Xbox loyalists thanks to all the unique features they bring to the table.",
        "id": 3790152,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Hdxu70WACgg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Hdxu70WACgg/hqdefault.jpg",
        "title": "ROG XBOX ALLY X And ROG XBOX ALLY - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-11T09:36:07.554576+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-11T09:30:25+00:00",
        "description": "Many could argue that puzzle games have been around for as long as gaming itself. However, the genre has seen several changes over the years, from the more comedy-based games like The Secret of Monkey Island, to recent mind-bending and reality-altering puzzle games like The Witness. However, Blue Prince offers evidence that the puzzle genre isn’t done evolving just yet.\n\nBlue Prince combines various concepts from puzzle games to randomly-generated stages that we typically see in roguelikes. However, unlike the latter genre, Blue Prince isn’t about fighting something or going on an adventure. \n\nRather, it’s about exploring the constantly-shifting rooms of a strange 45-room mansion in your quest to find a mythical 46th room. Among the core gameplay elements are having to figure out the layouts of the rooms you explore, and solving smaller puzzles in these rooms to get more rewards and a greater understanding of the story.",
        "id": 3788981,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=V7C8XkWJYaU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/V7C8XkWJYaU/hqdefault.jpg",
        "title": "I Can’t BELIEVE I Sat Out This Game for So Long",
        "vote": 0
    }
]