[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T20:47:20.377107+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T18:00:44+00:00",
        "description": "#shorts #tedx #ted #photography #animals #nature #mindfulness",
        "id": 4346316,
        "language": "en",
        "link": "https://www.youtube.com/shorts/XT6f7ToEQjM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XT6f7ToEQjM/hqdefault.jpg",
        "title": "What makes a photograph memorable? #shorts #tedx",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:12.185365+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:12:41+00:00",
        "description": "Developmental neuroscientist and mother Meghan Puglia explores the most critical window in human development — the first 1,000 days of life — and what it reveals about raising children in an AI-driven world. Drawing on cutting-edge science and deeply human moments, she explains why connection, intention, and even imperfection are essential for building resilient brains. This talk challenges us to think more carefully about how technology fits into raising future generations. Dr. Meghan Puglia is a neuroscientist, storyteller, educator, and data enthusiast – passionate about understanding how brains are built and how early experiences shape who we become.\n\nIn her own words, \"I lead the Developmental Neuroanalytics Lab, where we use brain imaging and data science to understand how babies grow, learn, and thrive – especially those born prematurely or at risk for developmental challenges. My work looks at how biology and experience come together to influence each child’s unique developmen",
        "id": 4345014,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EzZHytUVSAE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EzZHytUVSAE/hqdefault.jpg",
        "title": "How Will AI Affect How We Raise Children? | Meghan Puglia | TEDxMidAtlantic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:12.402737+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:11:57+00:00",
        "description": "Avery Anna invited her audience to write her a letter—one that let go of something painful. Hundreds of people responded. She turned those letters into an album, and this talk explores how music and the concert experience can become a portal to healing. Attracting attention from outlets like Rolling Stone and Billboard, Avery Anna released her sophomore album, let go letters, on May 16. The moving LP comprises songs all inspired by real-life situations shared by her fans via the “Let Go Letters.” The letter series has long been a safe space for Avery’s listener community, where she invites fans to ‘let go’ of real-life experiences that may be troubling them by putting them on paper. The album follows her celebrated 2024 album, Breakup Over Breakfast, and her 2022 debut EP, Mood Swings, which earned her Artist To Watch nods from Amazon Music, Apple Music, Pandora, Spotify, YouTube, MusicRow, and CMT and features her Platinum-certified hit, “Narcissist.” Currently featured with Sam Barb",
        "id": 4345015,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MeCRnX-l5q4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MeCRnX-l5q4/hqdefault.jpg",
        "title": "How a concert became a portal to healing | Avery Anna | TEDxNashvilleWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:12.693055+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:10:57+00:00",
        "description": "Most salary systems look fair on paper: clear criteria, clear rules, clear numbers. Age, degrees, and years of experience promise objectivity and justice. In The Fairness Question Behind Salaries, Sandro Colombo questions this promise and shares his story of co-creating an impact-driven pay system. A story that includes bold intentions, painful missteps, and a phase where everything felt broken. It shows how a team learned, grew, and redefined fairness together - and why progress in compensation has less to do with formulas but more with ownership, trust, and continuous (self-) development. Sandro Colombo is co-founder of indigo online AG, a Swiss software agency creating digital solutions with purpose and impact. After starting out as an apprentice application engineer, he co-founded indigo at 19 and has led the company through growth, innovation, and organizational transformation including adopting holacracy — a change that reshaped both structure and culture. Passionate about fairn",
        "id": 4345016,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=kfykSqvHXvU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kfykSqvHXvU/hqdefault.jpg",
        "title": "What does a fair salary look like? | Sandro Colombo | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:12.993980+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:10:50+00:00",
        "description": "Amélie’s talk will explore the indispensable role of the younger generation in decision-making and the need to institutionalize their inclusion. Amélie advocates for lowering the voting age to ensure that young voices are heard in shaping our democratic future. Amélie Galladé, a law student, independent columnist, podcaster, and speaker, brings a wealth of experience and a unique viewpoint. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4345017,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OfOZRZ5Dumg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OfOZRZ5Dumg/hqdefault.jpg",
        "title": "Democracy’s Anti-Aging Cure | Amélie Galladé | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:13.370844+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:10:41+00:00",
        "description": "In this TEDx talk, Rob den Otter reflects on leadership, mindset, and personal growth through the lens of sport and movement.\nDrawing from his experience as a trail runner — from the mountains in Switzerland to Cape Town’s Devil’s Peak and the 13 Peaks Challenge — he shares how one simple, iterative principle helped him move through failure, recovery, and disciplined preparation: inspect and adapt.\n\nA talk about focus, resilience, and why true performance — in leadership, sport, and life — emerges when we continuously reflect, adjust, and keep moving. With an extensive experience in marketing and communication within the Swiss healthcare system, Rob den Otter offers a fascinating perspective on resilience and adaptability. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4345018,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VO3-1651DLk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VO3-1651DLk/hqdefault.jpg",
        "title": "The code we run on | Rob den Otter | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:13.653578+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:10:19+00:00",
        "description": "AI hears words; humans hear weight. I’ll show how presence, silence, and “reading the room” reveal what transcripts miss—brought to life with a yellow chair, a deliberate pause, and a simple “sigh changes the story” demo. Despite the provocative title, it’s not human vs. AI; the magic happens when AI handles information and humans hold context. Tünde Lukacs is a change expert and Partner at EY Switzerland, and the founder of The Change Republic. Tünde helps leaders handle change and make the most of AI. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4345019,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WcPAnXXllR4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WcPAnXXllR4/hqdefault.jpg",
        "title": "What AI can't hear | Tünde Lukacs | TEDxHWZ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:14.037389+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:09:35+00:00",
        "description": "Through recent election reforms in the United Kingdom, sixteen-year-olds will now be given the right to vote in the next general election. In Europe currently the only countries to allow them to vote in general elections are Austria and Malta . On the one hand teens form a vital part of society and their vote would mean the government was more reflective of the public opinion and giving them the opportunity to vote encourages lifelong civic engagement. On the other hand teens are very susceptible to the influence of parents and therefore would be less reflective and secondly, teens have a lack of maturity and life experience and therefore this power should not be handed over to them. Through recent election reforms in the United Kingdom, 16 year olds will now be given the right to vote in the next general election. In Europe currently the only countries to allow them to vote in general elections are Austria and Malta . On the one hand teens form a vital part of society and their vote ",
        "id": 4345020,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vN4TOzkuNc8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vN4TOzkuNc8/hqdefault.jpg",
        "title": "Democracy at 16: A Risk or a Right? | Georgiana Jeffreys | TEDxSGBIS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:14.282989+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:09:22+00:00",
        "description": "How toxic communication within advertising is affecting self esteem? In my talk, I’ll touch on spreading awareness about the risk associated with the negative side of communication and advertising industries and medical impacts including serious health issues like eating disorders and the extreme consequences of suicide attempts. A key moment in my talk will be about the pivotal role social media plays this issue.  Endangering young adults’ mental health - how toxic communication within advertising is affecting self esteem. In my talk, I’ll touch on spreading awareness about the risk associated with the negative side of communication and advertising industries and medical impacts including serious health issues like eating disorders and the extreme consequences of suicide attempts. A key moment in my talk will be about the pivotal role social media plays this issue. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Le",
        "id": 4345021,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gaBtBg56Pus",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gaBtBg56Pus/hqdefault.jpg",
        "title": "21st Century Beauty Standards | Bianca Pazzanese | TEDxSGBIS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:14.617038+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:08:38+00:00",
        "description": "How far is the education system helpful in shaping young minds and driving success? The education system seems to have a singular view of success that is only achieved with a narrow path filled with methodical examinations. However, this close minded view has lead to the crushing of creativity and individuality as well as curiosity and has left many students demoralised and discouraged from pursuing education and knowledge. This has also lead to anxiety and the phenomenon that is burn out. Is this singular view of education helpful or harmful and what would be alternatives? And can exams truly assess our understanding of a topic when many are more focused on learning exam technique rather than understanding the content? In this talk I will explore a controversial idea: how far is the education system helpful in shaping young minds and driving success? The education system seems to have a singular view of success that is only achieved with a narrow path filled with methodical examinati",
        "id": 4345022,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TzBFXA1KE0c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TzBFXA1KE0c/hqdefault.jpg",
        "title": "Burnt by Today's Education System | Anna Gallagher | TEDxSGBIS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:14.776386+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:07:59+00:00",
        "description": "O trânsito das cidades se tornou um verdadeiro campo de batalha, uma guerra silenciosa onde a pressa, a distração (celular) e a velocidade são os gatilhos. Neste vídeo, Gisela Carvalho faz uma reflexão urgente: se os veículos motorizados se tornaram armas que tiram vidas diariamente, qual é o caminho para a paz e a segurança viária? Ela é ciclista, vive na mira e revela os números assustadores de atropelamentos e mortes de ciclistas. A mobilidade urbana foi corrompida pela cultura do \"eu primeiro\" transformando pedestres e ciclistas em alvos fáceis. A bicicleta pode ser o ato de humanidade e conscientização que o trânsito precisa. Pedalar não é apenas um benefício para a saúde e o meio ambiente, mas uma ferramenta poderosa de transformação social. A bicicleta desacelera a cidade e nos ensina a ter empatia e presença. Gisela Carvalho é educadora, mãe, contadora de histórias, cicloviajante, sonhadora, mulher engajada nas questões da bicicleta e no cotidiano de uso na vida na cidade.  At",
        "id": 4345023,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=kXL-iPx2D2s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kXL-iPx2D2s/hqdefault.jpg",
        "title": "Chega de Stress: a bicicleta desarma o trânsito e traz Paz. | Gisela Carvalho | TEDxJoaoPessoaSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:14.977334+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:07:25+00:00",
        "description": "Betina aborda a importância de incentivar meninas a participarem das áreas de STEM. Ela destaca iniciativas e políticas que podem mudar esse cenário, como programas da Fiocruz e do Museu do Amanhã, e reforça que empoderar meninas desde cedo é essencial para alcançar igualdade e ampliar a presença feminina na ciência. Betina é estudante do 7º ano do Colégio Santo Inácio e apaixonada por ciência, incluindo temas como plantas medicinais e alimentos funcionais. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4345024,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ATGp_uTRIjA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ATGp_uTRIjA/hqdefault.jpg",
        "title": "Participação feminina em STEM: desafio educacional e social | Betina Boar | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:15.154840+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:06:47+00:00",
        "description": "Neste TEDx, Mariana Andrade, atleta premiada, apresenta O Poder da Atitude e como decisões diárias podem nos tornar mais fortes justamente nos momentos de pressão. Ela compartilha como o Ironman a ensinou a enxergar desafios não como barreiras, mas como elementos que, quando enfrentados com intenção, nos fazem evoluir, uma verdadeira prática de se tornar “antifrágil” na vida real.\n\nEm poucos minutos, ela entrega insights e ferramentas para que qualquer pessoa possa transformar dor em clareza, medo em movimento e desafios em crescimento. Um TEDx para quem está pronto para assumir o próprio protagonismo e crescer exatamente onde outros desistiriam. 17x Ironman Finisher\n2x Vice-Campeã Ironman Brasil (2023 e 2024) \n31a no Campeonato Mundial Ironman (Hawaii 2023) - sendo melhor estreia brasileira e recorde ciclismo brasileiro na prova.\nCampeã Ironman 70.3 Rio de Janeiro 2015 \nVice-Campeã Brasileira Ciclismo CRI 2023 – Cascavel, PR\nBacharel em Educação Física 2009 (UDESC / FMH)\nTreinadora C",
        "id": 4345025,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=K8B0M5susNQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/K8B0M5susNQ/hqdefault.jpg",
        "title": "O Poder da Atitude: Como o Ironman Moldou a Minha Vida  | Mariana de Andrade | TEDxUDESC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:15.349022+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:06:33+00:00",
        "description": "Entrepreneurship isn’t just about business — it’s about shaping futures. Olusola Olaleye shares how resilience, creativity, and problem-solving can drive economic progress and positively impact communities. His talk breaks down the mindset that turns obstacles into opportunities. Olushola Olaleye is a dynamic strategist, multipotential entrepreneur, consultant, pastor, and the Group Chief Executive Officer at Propella Strategy Limited. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4345026,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NSBpvAh2IPA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NSBpvAh2IPA/hqdefault.jpg",
        "title": "Brave Men, Bold Businesses | Olushola Olaleye | TEDxAdmiralty Way",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:15.570161+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:05:24+00:00",
        "description": "Could a board game transform a child’s future? Tunde Onakoya reveals how chess builds confidence, discipline, and possibility in underserved communities. His inspiring story demonstrates how simple ideas can unlock extraordinary human potential. Founder of Chess in Slums Africa, using chess to transform lives in underserved communities. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4345027,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=grMsCTh5p1E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/grMsCTh5p1E/hqdefault.jpg",
        "title": "What Boys Can Become When They Are Seen | Tunde Onakoya | TEDxAdmiralty Way",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T18:01:15.749340+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:05:06+00:00",
        "description": "What do boys really need from their fathers, and from the communities that raise them? Uyi Law explores the values, guidance, and emotional grounding essential for raising boys who grow into whole, responsible men. His talk challenges us to rethink masculinity by fostering supportive ecosystems where boys learn empathy, strength, accountability, and a sense of belonging. Omoruyi “Uyilaw” Edoigiawerie is the founder and Chief servant at Edoigiawerie and Company LP (EandC Legal) Nigeria’s foremost Startup Law firm. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4345028,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GdesALGaQE0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GdesALGaQE0/hqdefault.jpg",
        "title": "What We Must Teach Our Boys | Omoruyi Edoigiawerie Esq | TEDxAdmiralty Way",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:00:54.527541+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:02:02+00:00",
        "description": "蔡守恩的故事跨越體制教育、自學與技職，他的經歷不只是旅程，更是提醒聽者思考如何在生活中找到節奏與方向。自學期間，他走訪菲律賓多座島嶼，從水上運動中學會專注與面對挑戰的態度；高一前往澳洲 Adelaide 參與藝穗節實習，並在暑假赴美國加州加入夏威夷青少年水上運動隊的訓練，讓他逐步理解如何把握機會、調整步伐。\n他也曾參與文化交流、媒體拍攝與中輟生陪伴計畫，從中看見影響他人的力量。透過這場分享，守恩希望引導聽者從他的經驗中思考：如何在變動中保持穩定？如何在每個階段重新定位自己？他的故事將帶給聽者實用而清晰的啟發。\n\nSean’s path through mainstream education, homeschooling, and vocational training offers listeners a chance to reflect on how one finds direction and balance. During his homeschooling years, he traveled to several islands in the Philippines to learn water sports, developing focus and resilience. In his first year of high school, he interned at the Adelaide Fringe Festival in Australia and later joined the Hawaii Youth Water Sports Team’s training program in California, experiences that taught him to seize opportunities and adjust his pace.\nHe has also taken part in cultural exchange projects, media features, and youth coaching programs, gradually recognizing his ability to influence others. Through this talk, Sean hopes listeners w",
        "id": 4344098,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=y8IDR7xbY4Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/y8IDR7xbY4Y/hqdefault.jpg",
        "title": "獨一無二的節奏/Find your own rhythm in life | 蔡守恩 TSAI, SHOU EN | T­E­DxMingdao ­H­S Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:00:54.937726+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:01:46+00:00",
        "description": "我的故事不是關於站上多少次舞台，而是關於在一次次挫折後，仍願意再次踏上台前。從英語演講的失利、戲劇試鏡的落選，到重新點燃熱情，我學到：舞台不屬於最完美的人，而是屬於勇於面對不完美的人。\n如今，我把握每一次展示自我的機會——無論是午間論壇、OPEN MIC、藍色動感樂團旗隊演出，甚至走上美國議會的講台。我希望讓聽眾知道：你不需要等待準備好才開始。當你選擇專注當下、忠於熱情，每一次登台都是你成為更堅定自己的轉折點。\n\nMy story isn’t about how many times I’ve been on stage—it’s about choosing to step back onto it after every setback. From speech contest failures to missed drama auditions, I learned that the stage doesn’t belong to those who are flawless. It belongs to those who are brave enough to stand there despite not being perfect.\nToday, I embrace every opportunity to speak up—whether at forums, Open Mic events, flag team performances, or even the U.S. Congress. What I hope to share with you is this: you don’t have to wait until you feel ready. When you stay present and stay true to what you love, each moment on stage becomes a turning point that shapes you into a stronger version of yourself. \n\n我是李緁 Jacqueline，一個用熱情妝點人生的表演者。我的表演旅程始於國小，那時我是校園裡的舞蹈家與小演員，盡情揮灑汗水。升上國中，我穿上明道中學藍色動感樂團旗隊的童軍服，用旗幟舞動青",
        "id": 4344099,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=s0DeizniZo0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s0DeizniZo0/hqdefault.jpg",
        "title": "遙遠的一步/It took me A LOT to get here | 李緁 LEE, JIE | T­E­DxMingdao ­H­S Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:00:55.342169+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:01:32+00:00",
        "description": "這場 TED 分享的不是一段單純的軍校夏令營經驗，而是一段「思維翻轉」帶來的成長歷程。六週的美國軍校生活，從嚴格紀律到文化衝擊，都曾讓我感到挫折與懷疑。但在夥伴支持與自我調整下，我開始學會轉念：讓壓力成為推力，讓孤單變成與自己對話的契機。這段旅程讓我明白——當你改變看事情的方式，挑戰也會隨之轉化。真正的收穫，不只是技能，而是學會用正向心態面對人生。\n\nThis TED talk isn’t just about a six-week summer camp at a U.S. military academy—it's about how a shift in mindset can transform a difficult experience into personal growth. The strict discipline and cultural differences once left me discouraged, but with support from friends and a willingness to reframe my thoughts, I learned to turn pressure into motivation and loneliness into self-reflection. This journey taught me that challenges change the moment we change our perspective. More than saluting or sailing, it was the beginning of learning how to face life with a positive and resilient mindset. \n\n我是王孜詠，一個對世界什麼都好奇、三分鐘熱度，但熱到會衝去美國軍校的人。身邊的人常形容我跳痛、叛逆、固執，因為只要有人說「你不要這樣做」，我大概就會立刻去試試看。從國樂玩到鐵人三項，再突然飛去軍校，大家都在問我：「你到底想幹嘛？」\n老實說，我也不知道，反正就順其自然吧！這就是我為我的人生下的定義！去年暑假，在我仔細思考了整整三秒後，我和朋友決定在畢業隔天飛去美國軍校夏令營。結果，才剛到不到三小時，我們就開始偷偷製作逃跑計畫。\n這場",
        "id": 4344100,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=kOYL5u8o4SY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kOYL5u8o4SY/hqdefault.jpg",
        "title": "起死回生的解藥/The Elixir of Revival | 王孜詠 Wang Tzu-Yung | T­E­DxMingdao ­H­S Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:00:55.773197+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:01:25+00:00",
        "description": "當世界都說「要正向一點啊」、「別想太多啦」的時候，我其實正在經歷一種說不出口的痛——那種你也許懂：人很多，卻好像沒有誰真的看見你。\n我是朱庭誼，這場演講不是勵志故事，也沒有奇蹟般的轉折，而是一段關於疼痛、懷疑、誠實與修復的歷程。\n我們並不孤單，也都能一步一步，走出自己的節奏與方向。\n這場演講，是我寫給過去的一封回信，也是一束微光，獻給仍在痛裡努力前行的你。\n\nWhen the world kept saying, “Stay positive” or “Don’t overthink it,” I was quietly going through a kind of pain I couldn’t quite name — the kind you might know too: being surrounded by people, yet feeling completely unseen.\nI’m Ting-Yi Chu. This talk isn’t a success story, nor one with a magical turning point. It’s a journey through pain, self-doubt, honesty, and slow healing.\nWe are not alone — and each of us can find our own pace, one step at a time.\nThis talk is a letter I’ve written back to my past self, and a small light I offer to those still walking through the dark. \n\n \n  \n我是一個曾在孤單中跌倒，選擇振作起來的高中生。那些讓我受傷的經歷，成了我重新理解自己的起點。情緒不該被忽視，脆弱不是錯；我們都值得被理解，也都有理解他人的能力。\n\nI am a high school student who once stumbled in loneliness but chose to rise again. The experiences that once hurt me became the starting point for ",
        "id": 4344101,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lMTIrhFva4Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lMTIrhFva4Y/hqdefault.jpg",
        "title": "傷痕不是句點，是起點/Scars, My Commencement | 朱庭誼 Chu, Ting-Yi | T­E­DxMingdao ­H­S Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:00:56.176856+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:01:20+00:00",
        "description": "在氣候危機日益嚴峻的時代，我們需要「正行」。從正視問題開始，專注共好的價值，讓利他行動點燃永續。我將分享個人轉職的心路歷程，以及從國際氣候會議參與到推動淨零轉型的實際經驗，說明如何透過行動，讓青年、女性和社會脆弱群體的聲音被聽見，最終轉化為具體的公正轉型方案。我相信，在氣候危機中，每一個正直的行動，都是改變未來的力量。\n\nThe climate crisis is the defining challenge of our time. It demands more than awareness — it calls for righteous action. To act righteously is to face the truth, to choose the path of integrity, and to work for the common good, even when the road ahead is uncertain. My journey took me from international climate conferences to community-driven initiatives for net-zero transition. Along the way, I’ve seen how the voices of youth, women, and vulnerable communities can rise above the noise — and, when amplified, can shape just transition policies.\nIn this talk, I will share how we can transform empathy into action, and action into systemic change. Because in the face of the climate emergency, every honest step we take can become the spark that lights a more just and sustainable future.e climate crisis is the defining challenge o",
        "id": 4344102,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=egnSKtr7zws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/egnSKtr7zws/hqdefault.jpg",
        "title": "在氣候危機中正行——為公正轉型行動/Acting Right in the Climate Crisis | 張寒瑋 Han-Wei Chang | T­E­DxMingdao ­H­S Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:00:56.549742+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:01:00+00:00",
        "description": "「到底什麼比分數重要？」這是一個值得台灣中學教育深思的問題。長久以來，社會深受傳統士大夫觀念影響，認為「萬般皆下品，唯有讀書高」，學生往往被分數和排名框住，忽略了潛能、天賦與人性的多元面向。二十五年來，我在明道不斷鼓勵學生超越考試思維，探索自我價值，並培養關心人與自己、人與他人、人與社會的能力。我們也重視合作、溝通、創造力與批判思考，因為這些才是面對未來不可或缺的能力。尤其在 AI 已經超越人類智能的時代，中學教育更應強化人類智慧，幫助學生善用科技，成為自律反思的自主學習者，進而邁向終身學習。比分數更重要的，正是要能在未來世界成為有價值且有幸福感的人。\n\nWhat truly matters beyond grades? This is a pressing question for education in Taiwan today. For too long, our society has been shaped by the traditional belief that academic achievement is the sole path to success, where students are judged only by scores and rankings. Yet education must be more than grades. Over the 25 years at Mingdao, we have encouraged students not only to study for exams, but also to discover their potential and talents, and to reflect on the relationships between self and others, and between individuals and society. We emphasize collaboration, communication, creativity, and critical thinking—skills that define human wisdom and resilience. In an era where artificial intelligence already",
        "id": 4344103,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VjpvENZiAm8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VjpvENZiAm8/hqdefault.jpg",
        "title": "到底什麼比分數重要？／Beyond Grades: What Truly Matters | 汪大久 Wang, Albert Tajyou | T­E­DxMingdao ­H­S Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:00:56.962047+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:00:58+00:00",
        "description": "我是柯昱丞，一個對世界充滿好奇、渴望跨文化交流的青年。我參與了政府的「青年百億海外圓夢基金計畫」，經過書面申請與面試後，很榮幸代表臺灣前往美國費城。那裡，我們與當地青年深度交流，拜訪多個重要機構與政要，甚至舉辦了費城史上第一場「臺灣之夜」。\n這段旅程讓我深刻明白：勇敢做夢並踏出第一步，就可能改變自己、也改變世界。我希望透過分享，讓更多人相信——夢想不是遙不可及，而是從你願意開始的那一刻展開。\n\nI’m Ko Yu-Cheng, someone driven by curiosity and a passion for cross-cultural connection. Through Taiwan’s Global Pathfinders Initiative, I was selected to represent youth in Philadelphia after completing the written application and interview process. There, we engaged with local young leaders, visited key institutions and officials, and even organized the first-ever Taiwan Night in Philadelphia.\nThis journey taught me one thing clearly: when you dare to dream and take the first step, possibilities unfold. Through this talk, I hope to inspire you to believe that your dreams become real the moment you choose to pursue them. \n\n我是柯昱丞，我從小就充滿好奇心，喜歡挑戰不同事物。\n我享受跨文化交流，曾參加明道在澳洲與新加坡的短期交換計畫，也曾以國手身分參加西洋棋世界青年錦標賽。\n我今年在高中階段參加了一項特別的計畫，我也把握住了這特殊的機會，站上了更高的國際舞台並成長改變自我。\n\nI am Yu-Cheng Ko, a naturally curious p",
        "id": 4344104,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SkwJqYSV84Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SkwJqYSV84Q/hqdefault.jpg",
        "title": "勇敢「做」夢，「百億」無價!/Dare to Dream!| 柯昱丞 Yu-Cheng Ko | T­E­DxMingdao ­H­S Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:00:57.376533+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:00:24+00:00",
        "description": "在家自學，也就是是正式申請個人實驗教育。人數極少的自學生，相對於體制內的主流多數學生，很神秘，也常被貼標籤。小學在家自學，國中才回到體制私中的我，先跟著媽媽摸索如何自學，同時也努力對抗、掙脫標籤；接著來到夢想中的私中適應體制學習，改由爸爸陪著重定義自學標籤。這是一段我和自學標籤如何相處的故事：我和標籤在衝突後和解，現在，正努力學著與他攜手並進。自學是形式，更是能力；標籤是印記，也可以是LOGO！我希望聽者從我的故事看見：每個人都有被貼標籤的時候，但我們可以選擇讓它限制自己，或讓它成為前進的徽章。\n\nHomeschooling — officially known as applying for Individual Experimental Education — is rare. With so few of us compared to the crowds in traditional schools, homeschoolers often seem mysterious and easy to label. I was homeschooled through elementary school, then joined a private junior high later on. At first, I learned alongside my mom, figuring out how to self-study while trying hard to shake off those labels. Then, when I stepped into my dream private school, my dad helped me redefine what being “a homeschooler” could mean. This is the story of me and my label — how we fought, made peace, and now walk forward together. Homeschooling isn’t just a system, it’s a skill; a label isn’t only a stigma, it can be a badge.What I hope listene",
        "id": 4344105,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8i8aFnUqx44",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8i8aFnUqx44/hqdefault.jpg",
        "title": "從標籤到品牌——不斷實驗的我/My everlasting experiment | 曾允斌 TSENG, YUN BIN | T­E­DxMingdao ­H­S Youth",
        "vote": 0
    }
]