[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T23:19:31.571631+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T22:50:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Netflix on Wednesday said it will add a soccer simulation title to its gaming portfolio, as the streaming giant looks to leverage the FIFA World Cup 2026 tournament to deepen its video game push. The soccer title will be developed and published by Delphi Interactive, which is also helping create a premium James Bond game called \"007 First Light,\" and in association with the sport's governing body, FIFA. Netflix said the game will launch in time for the world's most-watched sporting event, scheduled to start June next year in the U.S.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Netflix+To+Add+Soccer+Video+Game+Based+On+FIFA+World+Cup+Next+Year%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F12%2F17%2F2049252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook",
        "id": 4347829,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/17/2049252/netflix-to-add-soccer-video-game-based-on-fifa-world-cup-next-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Netflix To Add Soccer Video Game Based On FIFA World Cup Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T23:19:31.739993+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T22:10:00+00:00",
        "description": "GitHub will begin charging $0.002 per minute for self-hosted Actions runners used on private repositories starting in March. \"At the same time, GitHub noted in a Tuesday blog post that it's lowering the prices of GitHub-hosted runners beginning January 1, under a scheme it calls 'simpler pricing and a better experience for GitHub Actions,'\" reports The Register. \"Self-hosted runner usage on public repositories will remain free.\" From the report: Regardless of the public repo distinction, enterprise-scale developers who rely on self-hosted runners were predictably not pleased about the announcement. \"Github have just sent out an email announcing a $0.002/minute fee for self-hosted runners,\" Reddit user markmcw posted on the DevOps subreddit. \"Just ran the numbers, and for us, that's close to $3.5k a month extra on our GitHub bill.\" [...]\n \n\"Historically, self-hosted runner customers were able to leverage much of GitHub Actions' infrastructure and services at no cost,\" the repo host sai",
        "id": 4347830,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/17/2042247/github-is-going-to-start-charging-you-for-using-your-own-hardware",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GitHub Is Going To Start Charging You For Using Your Own Hardware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T22:13:47.941369+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T21:30:00+00:00",
        "description": "Longtime Linux developer Greg Kroah-Hartman announced that the Linux kernel has received its first CVE tied to Rust code. Phoronix reports: This first CVE (CVE-2025-68260) for Rust code in the Linux kernel pertains to the Android Binder rewrite in Rust. There is a race condition that can occur due to some noted unsafe Rust code. That code can lead to memory corruption of the previous/next pointers and in turn cause a crash. This CVE for the possible system crash is for Linux 6.18 and newer since the introduction of the Rust Binder driver. At least though it's just a possible system crash and not any more serious system compromise with remote code execution or other more severe issues.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Linux+Kernel+Rust+Code+Sees+Its+First+CVE+Vulnerability%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F12%2F17%2F2034233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https:",
        "id": 4347335,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/17/2034233/linux-kernel-rust-code-sees-its-first-cve-vulnerability",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linux Kernel Rust Code Sees Its First CVE Vulnerability",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T21:12:51.163152+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T20:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Google began its transition to Gemini 3 a few weeks ago with the launch of the Pro model, and the arrival of Gemini 3 Flash kicks it into high gear. The new, faster Gemini 3 model is coming to the Gemini app and search, and developers will be able to access it immediately via the Gemini API, Vertex AI, AI Studio, and Antigravity. Google's bigger gen AI model is also picking up steam, with both Gemini 3 Pro and its image component (Nano Banana Pro) expanding in search.\n \nThis may come as a shock, but Google says Gemini 3 Flash is faster and more capable than its previous base model. As usual, Google has a raft of benchmark numbers that show modest improvements for the new model. It bests the old 2.5 Flash in basic academic and reasoning tests like GPQA Diamond and MMMU Pro (where it even beats 3 Pro). It gets a larger boost in Humanity's Last Exam (HLE), which tests advanced domain-specific knowledge. Gemini 3 Flash has tripled the",
        "id": 4346747,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/17/2028231/google-releases-gemini-3-flash-promising-improved-intelligence-and-efficiency",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Releases Gemini 3 Flash, Promising Improved Intelligence and Efficiency",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T19:56:11.551571+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T19:40:00+00:00",
        "description": "An anonymous reader shares a report: Browser extensions with more than 8 million installs are harvesting complete and extended conversations from users' AI conversations and selling them for marketing purposes, according to data collected from the Google and Microsoft pages hosting them. \n\nSecurity firm Koi discovered the eight extensions, which as of late Tuesday night remained available in both Google's and Microsoft's extension stores. Seven of them carry \"Featured\" badges, which are endorsements meant to signal that the companies have determined the extensions meet their quality standards. The free extensions provide functions such as VPN routing to safeguard online privacy and ad blocking for ad-free browsing. All provide assurances that user data remains anonymous and isn&#226;(TM)t shared for purposes other than their described use.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Browser+Extensions+With+8+Mill",
        "id": 4345511,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/17/198250/browser-extensions-with-8-million-users-collect-extended-ai-conversations",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Browser Extensions With 8 Million Users Collect Extended AI Conversations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T19:56:11.691384+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T19:00:00+00:00",
        "description": "The conventional wisdom that English prose has gotten easier to read because sentences have gotten shorter is wrong, according to a new analysis published in Works in Progress by writer and Mercatus Center research fellow Henry Oliver. The real transformation happened centuries ago in the 1500s and 1600s when Bible translators like William Tyndale and Thomas Cranmer developed a \"plain style\" built on logical syntax rather than the older rhythmic, periodic structures inherited from medieval prose. \n\nOliver argues that much of what modern datasets measure as declining sentence length is actually just changing punctuation habits. Writers now use periods where earlier generations used colons and semicolons. One dataset shows semicolon usage dropped from one every 90 words in 1781 to one every 390 words today. The cognitive complexity of a paragraph often remains the same regardless of how it's punctuated. Even wildly popular modern books don't follow the \"short sentences equal readable\" f",
        "id": 4345512,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/17/1849246/english-has-become-easier-to-read",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "English Has Become Easier To Read",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T19:56:11.861848+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T18:17:00+00:00",
        "description": "FCC Chairman Brendan Carr said in his Wednesday Senate testimony that the agency he governs \"is not an independent agency, formally speaking.\" Axios: During his testimony, the word \"independent\" was removed from the FCC's mission statement on its website. The extraordinary statement speaks to a broader trend of regulatory agencies losing power to the executive branch during the Trump era. Last week, the Supreme Court appeared poised to allow President Trump to fire members of the Federal Trade Commission during oral arguments over the issue. \n\nSen. Ben Ray Luj&#195;n (D-N.M.) began the line of questioning, citing the FCC's website, which said the agency was independent as of Wednesday morning. By Wednesday afternoon, the FCC's mission statement no longer said it was independent. Chairman Carr would not respond directly to questions about whether he believed the president was his boss. He would not answer whether it's appropriate if the president were to pressure him to go after media ",
        "id": 4345513,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/17/1817255/fcc-chair-suggests-agency-isnt-independent-word-cut-from-mission-statement",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FCC Chair Suggests Agency Isn't Independent, Word Cut From Mission Statement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T19:56:11.991984+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T17:38:00+00:00",
        "description": "A comprehensive database built by scientists in Switzerland and Norway has catalogued 16,000 chemicals linked to plastic materials, and the findings paint a troubling picture of what Americans are actually eating when they prepare food in their kitchens. Of those 16,000 chemicals, more than 5,400 are considered hazardous to human health by government and industry standards, while just 161 are classified as not hazardous. The remaining 10,700-plus chemicals simply don't have enough data to determine their safety. \n\nThe chemicals enter food through multiple pathways. Black plastic utensils and trays often contain brominated flame retardants because they're made from recycled electronic waste. Nonstick pans and compostable plates frequently contain PFAS. One California study found phthalates in three-quarters of tested foods, and a Consumer Reports analysis last year detected BPA or similar chemicals in 79% of foods tested. According to CDC data, more than 90% of Americans have measurabl",
        "id": 4345514,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/17/1738215/how-we-ingest-plastic-chemicals-while-consuming-food",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How We Ingest Plastic Chemicals While Consuming Food",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T19:56:12.082573+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T16:49:00+00:00",
        "description": "Coursera announced on Wednesday that it will acquire rival online learning platform Udemy in an all-stock deal that values the combined company at $2.5 billion, a move that brings together two of the largest U.S.-based players in an industry that has struggled since pandemic-era enrollment highs faded. Under the terms of the agreement, Udemy shareholders will receive 0.8 shares of Coursera for each share they hold, valuing Udemy at roughly $930 million. Based on Coursera's last closing price, the offer works out to $6.35 per Udemy share, an 18.3% premium. The deal is expected to close in the second half of next year, pending regulatory and shareholder approvals. \n\nThe two companies are betting that a combined platform will be better positioned to pursue corporate customers seeking to retrain workers in artificial intelligence, data science and software development. Coursera has built its business on partnerships with universities and institutions to offer degree programs and professio",
        "id": 4345515,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/17/1650219/coursera-acquires-udemy-for-930-million",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Coursera Acquires Udemy For $930 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:34:36.042177+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T16:12:00+00:00",
        "description": "Google is suing a Chinese-speaking cybercriminal group it says is responsible for a massive wave of scam text messages sent to Americans this year, according to a legal complaint filed Tuesday. From a report: The group, known as Darcula, sells software that allows users to send phishing text messages en masse, impersonating organizations like the IRS or the U.S. Postal Service in scams. The lawsuit is designed to give Google legal standing so U.S. courts will allow it to seize websites the group uses, hampering their operations, a spokesperson said. \n\nDarcula is possibly the most prominent name in an emerging, loosely affiliated cybercrime world that creates and sells hacking programs for aspiring scammers to use. Darcula's signature program, called Magic Cat, provides an easy-to-use, intuitive way for cybercriminals without advanced hacking skills to quickly spam millions of phone numbers with links to fake websites impersonating businesses like YouTube's premium service, then steal ",
        "id": 4344505,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/17/1613200/google-sues-alleged-chinese-scam-group-behind-massive-us-text-message-phishing-ring",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Sues Alleged Chinese Scam Group Behind Massive US Text Message Phishing Ring",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T16:34:36.156885+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T15:21:00+00:00",
        "description": "Meta is informing some users that they will soon be restricted in how many link posts they can share each month, unless they pay for its Meta Verified subscription service. As per the notification message: \"Starting December 16, certain Facebook profiles without Meta Verified, including yours, will be limited to sharing links in 2 organic posts per month. Subscribe to Meta Verified to share more links on Facebook, plus get a verified badge and additional benefits to help protect your brand.\" \n\nTo be clear, right now this is a limited test, so relatively few Pages are impacted. But understandably, a lot of users are also seeking more information on the change, and whether it could be expanded to all Pages. So, Meta's seeking to boost take-up of Meta Verified, in order to make more money out of its subscription option, which, for business users, costs between $14.99 and $499 per month, depending on which package you choose.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a ",
        "id": 4344506,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/17/1457249/meta-is-considering-charging-business-pages-to-post-links",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Is Considering Charging Business Pages To Post Links",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T15:00:42.335011+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T14:45:00+00:00",
        "description": "Warner Bros Discovery's board spurned Paramount Skydance's $108.4 billion hostile takeover bid on Wednesday, calling the offer \"illusory\" as it accused the studio giant of misleading shareholders about its financing. From a report: Paramount has been in a race with Netflix to win control of Warner Bros, and with it, its prized film and television studios, HBO Max streaming service and franchises like \"Harry Potter.\" After Warner Bros accepted the streaming giant's offer, Paramount launched a hostile offer to outdo that bid. \n\nIn a letter to shareholders on Wednesday, the Warner Bros board wrote that Paramount had \"consistently misled\" Warner Bros shareholders that its $30-per-share cash offer was fully guaranteed, or \"backstopped,\" by the Ellison family, led by billionaire and Oracle co-founder Larry Ellison.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Warner+Bros+Discovery+Board+Rejects+Rival+Bid+From+Paramount%",
        "id": 4343756,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/17/1445248/warner-bros-discovery-board-rejects-rival-bid-from-paramount",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Warner Bros Discovery Board Rejects Rival Bid From Paramount",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T15:00:42.480102+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T14:09:00+00:00",
        "description": "OpenAI is in discussions with Amazon about a potential investment and an agreement to use its AI chips, CNBC confirmed on Tuesday. From the report: The details are fluid and still subject to change but the investment could exceed $10 billion, according to a person familiar with the matter who asked not to be named because the talks are confidential. The discussions come after OpenAI completed a restructuring in October and formally outlined the details of its partnership with Microsoft, giving it more freedom to raise capital and partner with companies across the broader AI ecosystem. \n\nMicrosoft has invested more than $13 billion in OpenAI and backed the company since 2019, but it no longer has a right of first refusal to be OpenAI's compute provider, according to an October release. OpenAI can now also develop some products with third parties. Amazon has invested at least $8 billion into OpenAI rival Anthropic, but the e-commerce giant could be looking to expand its exposure to the ",
        "id": 4343757,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/17/149226/openai-in-talks-with-amazon-about-investment-that-could-exceed-10-billion",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI in Talks With Amazon About Investment That Could Exceed $10 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T13:48:03.922270+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: Two of the largest food-delivery app companies have made a last-ditch effort to overturn tipping laws in New York City that go into effect in January just as its next mayor, who has been highly critical of the companies and the app industry, takes office. Tips to delivery workers have plummeted since some food-delivery apps switched to showing the tipping option only after a purchase had been completed; that change came after New York City established the country's first minimum pay-rate for the workers in 2023. The new laws will require the apps to suggest a minimum tip of 10 percent at checkout, though customers can contribute more or less, or nothing at all.\n \nTwo of the app companies, DoorDash and Uber, filed a joint federal lawsuit in the Southern District of New York late last week targeting the City Council legislation, arguing that the new rules violated the First Amendment by requiring them to \"speak a government-ma",
        "id": 4343179,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/17/0313251/uber-and-doordash-try-to-halt-nyc-law-that-encourages-tipping",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Uber and DoorDash Try To Halt NYC Law That Encourages Tipping",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T10:29:23.188400+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T10:00:00+00:00",
        "description": "U.S. senators are probing whether Big Tech data centers are driving up local electricity bills by socializing grid upgrade costs onto residents. Some of the tactics they're using include NDAs, shell companies, and lobbying. Ars Technica reports: In letters (PDF) to seven AI firms, Senators Elizabeth Warren (D-Mass.), Chris Van Hollen (D-Md.), and Richard Blumenthal (D-Conn.) cited a study estimating that \"electricity prices have increased by as much as 267 percent in the past five years\" in \"areas located near significant data center activity.\" Prices increase, senators noted, when utility companies build out extra infrastructure to meet data centers' energy demands -- which can amount to one customer suddenly consuming as much power as an entire city. They also increase when demand for local power outweighs supply. In some cases, residents are blindsided by higher bills, not even realizing a data center project was approved, because tech companies seem intent on dodging backlash and ",
        "id": 4341712,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/17/036250/senators-count-the-shady-ways-data-centers-pass-energy-costs-on-to-americans",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Senators Count the Shady Ways Data Centers Pass Energy Costs On To Americans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T07:17:15.804514+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T07:00:00+00:00",
        "description": "A new Arctic Report Card recap shows how the Arctic has transformed in just 20 years, warming about twice as fast as the global average and losing most of its oldest sea ice. It's also triggering cascading impacts from \"Atlantification\" to permafrost-driven \"rusting rivers\" and more destructive storms. Scientific American reports: The first Arctic Report Card was released by the National Oceanic and Atmospheric Administration in 2006. Since then the region has warmed twice as fast as the global average. About 95 percent of the oldest, thickest sea ice is gone -- \"the sliver that remains is collected in an area north of Greenland. Even the central Arctic Ocean is becoming warmer and saltier, causing more ice melt and changing how much heat is released into the atmosphere in a way that affects weather patterns around the world. Those are just some of the stark changes 20 years have wrought. The findings were highlighted in the 2025 Arctic Report Card, released on Tuesday.\n \nThe Arctic O",
        "id": 4340783,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/17/0259210/the-arctic-is-in-dire-straits-20-years-of-reporting-show",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Arctic Is in Dire Straits, 20 Years of Reporting Show",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T04:02:31.784837+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Wall Street Journal: The alleged perpetrator had improper access to virtually every South Korean adult's personal information: names, phone numbers and even the keycode to enter residential buildings. It was one of the biggest data breaches of recent years and it has sent the company it targeted -- Coupang, South Korea's equivalent of Amazon -- reeling, generating lawsuits, government investigation and calls to toughen penalties against such leaks. The leak went undetected for nearly five months, hitting Coupang's radar on Nov. 18 only after a customer flagged suspicious activity.\n \nAt first, Coupang, which was founded by a Korean-American entrepreneur, said it had experienced a data \"exposure\" affecting roughly 4,500 customer accounts. But within days, the e-commerce firm revised the figure: The leak exposed up to roughly 34 million user accounts in South Korea -- a sum representing more than 90% of the country's working-age population. Co",
        "id": 4340036,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/17/009254/breach-at-south-koreas-equivalent-of-amazon-exposed-data-of-almost-every-adult",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Breach At South Korea's Equivalent of Amazon Exposed Data of Almost Every Adult",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T01:51:49.737224+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T01:30:00+00:00",
        "description": "The EU is moving to soften its planned 2035 ban on internal combustion cars by allowing a small share of low-emission engines. \"The less stringent limit would leave room for automakers to continue selling some plug-in hybrids, which have both electric and internal combustion engines and can use the combustion engine to recharge the battery without the need to find a charging station,\" reports the Associated Press. From the report: The proposal from the EU's executive commission would change provisions of 2023 legislation requiring average emissions in new cars to equal zero, or a 100% reduction from 2021 levels. The new proposal would require a 90% emissions reduction. That means in practical terms that most cars would be battery-only but would leave room for some cars with internal combustion engines.\n \nAutomakers would have to compensate for the added emissions by using European steel produced by methods that emit less carbon, and through use of climate neutral e-fuels made from ren",
        "id": 4339461,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/17/003222/eu-moves-to-ease-2035-ban-on-internal-combustion-cars",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU Moves To Ease 2035 Ban On Internal Combustion Cars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T01:51:50.117209+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T00:50:00+00:00",
        "description": "A Reuters investigation found that Meta knowingly tolerated large volumes of scam and illegal ads from China worth billions in revenue. Reuters reports: Though China's authoritarian government bans use of Meta social media by its citizens, Beijing lets Chinese companies advertise to foreign consumers on the globe-spanning platforms. As a result, Meta's advertising business was thriving in China, ultimately reaching over $18 billion in annual sales in 2024, more than a tenth of the company's global revenue. But Meta calculated that about 19% of that money -- more than $3 billion -- was coming from ads for scams, illegal gambling, pornography and other banned content, according to internal Meta documents reviewed by Reuters.\n \nThe documents are part of a cache of previously unreported material generated over the past four years by teams including Meta's finance, lobbying, engineering and safety divisions. The cache reveals Meta's efforts over that period to understand the scale of abuse",
        "id": 4339462,
        "language": "en-us",
        "link": "https://meta.slashdot.org/story/25/12/16/2226215/meta-tolerates-rampant-ad-fraud-from-china-to-safeguard-billions-in-revenue",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Tolerates Rampant Ad Fraud From China To Safeguard Billions In Revenue",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-17T00:45:33.444398+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-17T00:10:00+00:00",
        "description": "Quilter says its AI designed a complex Linux single-board computer in just one week, booting Debian on first power-up. \"Holy crap, it's working,\" exclaimed one of the engineers. Tom's Hardware reports: LA-based startup Quilter has outlined Project Speedrun, which marks a milestone in computer design by AI. The headlining claims are that Quilter's AI facilitated the design of a new Linux SBC, using 843 parts and dual-PCBs, taking just one week to finish, then successfully booting Debian the first time it was powered up. The Quilter team reckon that the AI-enhanced process it demonstrated could unlock a new generation of computer hardware makers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Dual-PCB+Linux+Computer+With+843+Components+Designed+By+AI+Boots+On+First+Attempt%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F12%2F16%2F229209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.c",
        "id": 4339126,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/16/229209/dual-pcb-linux-computer-with-843-components-designed-by-ai-boots-on-first-attempt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dual-PCB Linux Computer With 843 Components Designed By AI Boots On First Attempt",
        "vote": 0
    }
]