[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T23:11:55+00:00",
        "description": "Thursday America's FDA \"raised concerns about cybersecurity vulnerabilities\" in patient monitors from China-based medical device company Contec \"that could allow unauthorized individuals to access and potentially manipulate those devices,\" reports Reuters.\n\nThe patient monitors could be remotely controlled by unauthorized users or may not function as intended, and the network to which these devices are connected could be compromised, the agency warned. The FDA also said that once these devices are connected to the internet, they can collect patient data, including personally identifiable information and protected health information, and can export this data out of the healthcare delivery environment. \nThe agency, however, added that it is currently unaware of any cybersecurity incidents, injuries, or deaths related to these identified cybersecurity vulnerabilities.\n \n The FDA's announcement says \"The software on the patient monitors includes a backdoor, which may mean that the device",
        "id": 2021789,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/01/0632248/americas-fda-warns-about-backdoor-found-in-chinese-companys-patient-monitors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's FDA Warns About Backdoor Found in Chinese Company's Patient Monitors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T22:10:29+00:00",
        "description": "An anonymous reader shared this report from Reuters:\n\n\nNew York-based cybersecurity firm Wiz says it has found a trove of sensitive data from the Chinese artificial intelligence startup DeepSeek inadvertently exposed to the open internet. In a blog post published Wednesday, Wiz said that scans of DeepSeek's infrastructure showed that the company had accidentally left more than a million lines of data available unsecured. \n\nThose included digital software keys and chat logs that appeared to capture prompts being sent from users to the company's free AI assistant. \n\nWiz's chief technology officer tells Reuters that DeepSeek \"took it down in less than an hour\" after Wiz alerted them. \n\n\"But this was so simple to find we believe we're not the only ones who found it.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sensitive+DeepSeek+Data+Was+Exposed+to+the+Web%2C+Cybersecurity+Firm+Says%3A+https%3A%2F%2Fit.slashdot.org%",
        "id": 2021538,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/01/0659255/sensitive-deepseek-data-was-exposed-to-the-web-cybersecurity-firm-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sensitive DeepSeek Data Was Exposed to the Web, Cybersecurity Firm Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T21:05:25+00:00",
        "description": "SC World reports:\n\nA new phishing scam targeting mobile devices was observed using a \"never-before-seen\" obfuscation method to hide links to spoofed United States Postal Service (USPS) pages inside PDF files, [mobile security company] Zimperium reported Monday. \n\nThe method manipulates elements of the Portable Document Format (PDF) to make clickable URLs appear invisible to both the user and mobile security systems, which would normally extract links from PDFs by searching for the \"/URI\" tag. \"Our researchers verified that this method enabled known malicious URLs within PDF files to bypass detection by several endpoint security solutions. In contrast, the same URLs were detected when the standard /URI tag was used,\" Zimperium Malware Researcher Fernando Ortega wrote in a blog post. \n\nThe attackers send the malicious PDFs via SMS text messages under the guise of providing instructions to retrieve a USPS package that failed to deliver... The phishing websites first displays a form for ",
        "id": 2021299,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/01/207203/malicious-pdf-links-hidden-in-text-message-scam-impersonating-us-postal-service?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Malicious PDF Links Hidden in Text Message Scam Impersonating US Postal Service",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T18:55:22+00:00",
        "description": "\"Sometimes, government makes a bad bet...\" writes the Los Angeles Times. Opening in 2014, the Ivanpah concentrated solar plant \"quickly became known as an expensive, bird-killing eyesore.\"\n\nAssuming that state officials sign off &mdash; which they most likely will, because the deal will lead to lower bills for PG&amp;E customers &mdash; two of the three towers will shut down come 2026. Ivanpah's owners haven't paid off the project's $1.6-billion federal loan, and it's unclear whether they'll be able to do so. Houston-based NRG Energy, which operates Ivanpah and is a co-owner with Kelvin Energy and Google, said that federal officials took part in the negotiations to close PG&amp;E's towers and that the closure agreement will allow the federal government \"to maximize the recovery of its loans.\" It's possible Ivanpah's third and final tower will close, too. An Edison spokesperson told me the utility is in \"ongoing discussions\" with the project's owners and the federal government over en",
        "id": 2020754,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/01/1831253/california-built-the-worlds-largest-solar-power-tower-plant-now-it-may-close?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "California Built the World's Largest Solar Power Tower Plant.  Now It May Close",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T17:50:17+00:00",
        "description": "Star Wars star Mark Hamill, science fiction author William Gibson, XKCD cartoonist Randall Munroe, and The Onion have joined millions of others bringing Bluesky's user count to 30 million, reports CNET. In fact Bluesky has added over 14 million users in the last three months, and for a few days in early November was adding over one million users a day. \"That rate equals about 12 new users per second. The 30 million user mark compares to 9 million users in September.\" \n\nBut meanwhile Meta's social media site Threads &mdash; launched 19 months ago &mdash; \"now has 320 million monthly active users,\" reports TechCrunch, \"up from 300 million last month. The app had 275 million monthly active users in [early] November.\" That's a 16% grow rate in just three months.\n\n In comparison, Bluesky is experiencing a slowdown in growth, with an increase of less than 10% month-over-month in December 2024, following a remarkable 189% growth in November, according to analytics firm Similarweb. Bluesky n",
        "id": 2020422,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/01/0749206/bluesky-grows-to-30-million-users-threads-adds-20-million-more-just-in-january?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bluesky Grows to 30 Million Users. Threads Adds 20 Million More Just in January",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T16:45:16+00:00",
        "description": "Nearly three years ago a team of Chinese AI engineers working for DeepSeek's parent company unveiled an earlier AI supercomputer that the Washington Post says was constructed from 10,000 A100 GPUs purchased from Nvidia. Roughly six months later \"Washington had banned Nvidia from selling any more A100s to China,\" the article notes. \n\nRemember that number as you read this. 10,000 A100 GPUs...\n\nDeepSeek's new chatbot caused a panic in Silicon Valley and on Wall Street this week, erasing $1 trillion from the stock market. That impact stemmed in large part from the company's claim that it had trained one of its recent models on a minuscule $5.6 million in computing costs and with only 2,000 or so of Nvidia's less-advanced H800 chips. \n\nNvidia saw its soaring value crater by $589 billion Monday as DeepSeek rocketed to the top of download charts, prompting President Donald Trump to call for U.S. industry to be \"laser focused\" on competing... But a closer look at DeepSeek reveals that its pa",
        "id": 2020132,
        "language": null,
        "link": "https://slashdot.org/story/25/02/01/0517258/were-deepseeks-development-costs-much-higher-than-reported?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Were DeepSeek's Development Costs Much Higher Than Reported?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T15:40:17+00:00",
        "description": "\"A jury may never see the gun that authorities say was used to kill Blake Story last year,\" reports Cleveland.com. \n\n\"That's because Cleveland police used a facial recognition program &mdash; one that explicitly says its results are not admissible in court &mdash; to obtain a search warrant, according to court documents.\"\n\nThe search turned up what police say is the murder weapon in the suspect's home. But a Cuyahoga County judge tossed that evidence after siding with defense attorneys who argued that the search warrant affidavit was misleading and relied on inadmissible evidence. If an appeals court upholds the judge's ruling to suppress the evidence, prosecutors acknowledge their case is likely lost... \n\nThe company that produced the facial recognition report, Clearview AI, has been used in hundreds of law enforcement investigations throughout Ohio and has faced lawsuits over privacy violations. \n\nNot only does Cleveland lack a policy governing the use of artificial intelligence, O",
        "id": 2019799,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/01/0431229/police-use-of-ai-facial-recognition-results-in-murder-case-being-tossed?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Police Use of AI Facial Recognition Results In Murder Case Being Tossed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T13:30:17+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: To cap off a day of product releases, OpenAI researchers, engineers, and executives, including OpenAI CEO Sam Altman, answered questions in a wide-ranging Reddit AMA on Friday. OpenAI the company finds itself in a bit of a precarious position. It's battling the perception that it's ceding ground in the AI race to Chinese companies like DeepSeek, which OpenAI alleges might've stolen its IP. The ChatGPT maker has been trying to shore up its relationship with Washington and simultaneously pursue an ambitious data center project, while reportedly laying groundwork for one of the largest financing rounds in history. Altman admitted that DeepSeek has lessened OpenAI's lead in AI, and he also said he believes OpenAI has been \"on the wrong side of history\" when it comes to open-sourcing its technologies. While OpenAI has open-sourced models in the past, the company has generally favored a proprietary, closed-source development approach.\n \n",
        "id": 2019221,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/01/0137256/sam-altman-openai-has-been-on-the-wrong-side-of-history-concerning-open-source?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sam Altman: OpenAI Has Been On the 'Wrong Side of History' Concerning Open Source",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T10:15:24+00:00",
        "description": "A recent video from retro tech YouTuber Clint \"LGR\" Basinger takes a deep dive into the history of the SereneScreen Marine Aquarium, exploring how former Air Force pilot Jim Sachs transformed a lackluster Windows 95 screensaver into a 25-year digital phenomenon. PC Gamer reports: The story centers on Jim Sachs, a man with one of those \"they don't make this type of guy anymore\" life stories so common to '80s and '90s computing, one Sachs recounted to the website AmigaLove back in 2020. After a six-year career in the US Air Force flying C-141 Starlifters, Sachs taught himself programming and digital art and began creating games for Commodore 64 and Amiga computers. From his first game, Saucer Attack, to later efforts like Defender of the Crown or his large portfolio of promotional and commissioned pieces, Sach's pixel art remains gorgeous and impressive to this day, and he seems to be a bit of a legend among Commodore enthusiasts.\n \nIt's with this background in games and digital art th",
        "id": 2018462,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/01/0129243/the-25-year-success-story-of-serenescreen?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The 25-Year Success Story of SereneScreen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T08:05:00+00:00",
        "description": "Despite being removed from app stores and facing a potential U.S. ban, TikTok has regained nearly 90% of its user traffic, according to Cloudflare Radar. \"DNS traffic for TikTok-related domains has continued to recover since service restoration, and is currently about 10% lower than pre-shutdown level,\" said David Belson, head of data insight at Cloudflare. CNBC reports: The data from Cloudflare shows that, for the most part, TikTok has managed to maintain the bulk of its users and creators in the U.S. despite going offline for about 14 hours and remaining off of the Apple or Google app stores.\n \nAs for its alternatives, Cloudflare's data shows a spike in traffic the day of the temporary ban, with levels remaining steadily higher in the following week. Traffic for alternatives began to grow a week ahead of the expected shutdown, driven by the increased popularity of RedNote, known as Xiaohongshu in China, Belson said.\n \nBut traffic to TikTok alternatives peaked on Jan. 19, the day Ti",
        "id": 2018054,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/01/018238/tiktoks-traffic-bounces-back-despite-being-pulled-off-app-stores?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "TikTok's Traffic Bounces Back Despite Being Pulled Off App Stores",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T03:49:10+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: In the first serious fallout from President Donald Trump's early actions against offshore wind power, oil and gas giant Shell is walking away from a major project off the coast of New Jersey. Shell told The Associated Press it is writing off the project, citing increased competition, delays and a changing market. \"Naturally we also take regulatory context into consideration,\" spokesperson Natalie Gunnell said in an email.\n \nShell co-owns the large Atlantic Shores project, which has most of its permits and would generate enough power for 1 million homes if both of two phases were completed. That's enough for one-third of New Jersey households. It's unclear whether Shell's decision kills the project -- partner EDF-RE Offshore Development says it remains committed to Atlantic Shores. On his first day in office, Trump signed an executive order singling out offshore wind for contempt with a temporary halt on all lease sales in",
        "id": 2017401,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/31/2343230/shell-walks-away-from-major-new-jersey-offshore-wind-farm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Shell Walks Away From Major New Jersey Offshore Wind Farm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T02:44:40+00:00",
        "description": "Google is enhancing Android 16's Linux Terminal app to support graphical Linux applications, so Android Authority decided to put it to the test by running Doom. From the report: The Terminal app first appeared in the Android 15 QPR2 beta as a developer option, and it still remains locked behind developer settings. Since its initial public release, Google pushed a few changes that fixed issues with the installation process and added a settings menu to resize the disk, forward ports, and backup the installation. However, the biggest changes the company has been working on, which include adding hardware acceleration support and a full graphical environment, have not been pushed to any public releases.\n \nThankfully, since Google is working on this feature in the open, it's possible to simply compile a build of AOSP with these changes added in. This gives us the opportunity to trial upcoming features of the Android Linux Terminal app before a public release. To demonstrate, we fired up th",
        "id": 2017199,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/01/31/2317212/android-16s-linux-terminal-runs-doom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Android 16's Linux Terminal Runs Doom",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T02:44:40+00:00",
        "description": "Bruce66423 shares a report from the Associated Press: Federal officials on Thursday approved a new type of pain pill designed to eliminate the risks of addiction and overdose associated with opioid medications such as Vicodin and OxyContin. \"It's the first new pharmaceutical approach to treating pain in more than 20 years, offering an alternative to opioids and over-the-counter medications such as ibuprofen and acetaminophen. But the medication's modest effectiveness and lengthy development process underscore the challenges of finding new ways to manage pain.\n \nStudies in more than 870 patients with acute pain due to foot and abdominal surgeries showed Vertex's drug provided more relief than a dummy pill but didn't outperform a common opioid-acetaminophen combination pill. \"It's not a slam dunk on effectiveness,\" said Michael Schuh of the Mayo Clinic, a pharmacist and pain medicine expert who was not involved in the research. \"But it is a slam dunk in that it's a very different pathw",
        "id": 2017198,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/31/2356254/fda-approves-drug-to-treat-pain-without-opioid-effects?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FDA Approves Drug To Treat Pain Without Opioid Effects",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T01:39:09+00:00",
        "description": "Earlier this month, a civilian drone collided with a Canadian CL-415 firefighting plane combating the Palisades Fire, causing damage that grounded the aircraft and temporarily halted all aerial firefighting operations. Federal and state officials have since identified the operator of that drone as Peter Tripp Akemann of Culver City, who has agreed to plead guilty to a misdemeanor, pay a fine and complete community service. Prosecutors said he could still face up to a year in federal prison. The Los Angeles Times reports: The drone, which authorities say was flying in restricted airspace on Jan. 9, put a fist-sized hole in the left wing of a Super Scooper -- a massive fixed-wing plane that can drop large amounts of water onto a fire. The collision knocked the plane out of commission for about five days and destroyed the drone.\n \n\"Like a lot of individuals, he was curious about what was happening in that area,\" acting U.S. Atty. Joseph T. McNally said on Friday. \"The problem with that.",
        "id": 2016952,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/31/237207/drone-pilot-to-plead-guilty-in-collision-that-grounded-aircraft-fighting-palisades-fire?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Drone Pilot To Plead Guilty In Collision That Grounded Aircraft Fighting Palisades Fire",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T00:33:55+00:00",
        "description": "According to the Wall Street Journal (paywalled), Meta is in talks to move its incorporation from Delaware to Texas or other states. Reuters reports: The social media giant has talked to Texas officials about the potential changes, WSJ said, adding that the discussions predate President Donald Trump's new administration. The paperwork change would not relocate its corporate headquarters.\n \nA Meta spokesperson said that it does not plan on shifting its corporate headquarters out of Menlo Park, California, but declined to comment on reincorporation when contacted by Reuters. Texas is perceived by some businesses as having a more favorable legal and regulatory environment, particularly in areas such as taxation and corporate governance, which can be attractive to companies looking to cut costs and streamline operations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+In+Talks+To+Reincorporate+In+Texas+or+Another+S",
        "id": 2016689,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/31/2243200/meta-in-talks-to-reincorporate-in-texas-or-another-state-exit-delaware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta In Talks To Reincorporate In Texas or Another State, Exit Delaware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-01T00:33:55+00:00",
        "description": "An anonymous reader quotes a report from VICE News: EVA AI, a platform allowing you to create and connect with your own AI partner, recently surveyed 2,000 men and found that 8 in 10 would consider marrying an AI girlfriend if it were legal. Not only that, but 83% of men also believe they could form a deep emotional bond with an AI girlfriend. What's even scarier is that a whopping 78% of men surveyed said they would consider creating a replica of their ex, and three-quarters would duplicate their current partner to create a \"polished\" version of them. \"AI companionship allows people to be their authentic selves without fear of judgment,\" said Cale Jones, head of community growth at EVA AI. \"It creates a safe space to explore thoughts, emotions, and desires that might feel too vulnerable to share in real life. The benefits extend far beyond the virtual world: one EVA AI user discovered her bisexuality through this platform -- something she previously felt too insecure to explore in r",
        "id": 2016688,
        "language": null,
        "link": "https://slashdot.org/story/25/01/31/2248242/most-men-would-marry-their-ai-girlfriends-if-it-were-legal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Most Men Would Marry Their AI Girlfriends If It Were Legal",
        "vote": 0
    }
]