[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T21:13:45.837571+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T20:00:01+00:00",
        "description": "Somehow, the forces of Hell returned. Years after the events of DOOM (2016), it's revealed that they've taken over, killing a ton of people. The planet has become twisted and marred thanks to the demonic influence. \n\nSome left, cryogenically frozen in space-faring lifeboats, but the governments and leaders who remained formed the Armored Response Coalition or ARC.\n\nLet's check out the full story of DOOM: Eternal before you jump into DOOM: The Dark Ages.\n\nLinks to previous parts:\n\nPart 1: https://www.youtube.com/watch?v=-rVqF3LGtRA\n\nPart 2: https://www.youtube.com/watch?v=5-o__XA6Bs8",
        "id": 2633266,
        "language": null,
        "link": "https://www.youtube.com/watch?v=1tnIJ3Xyxb8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1tnIJ3Xyxb8/hqdefault.jpg",
        "title": "What Even Happened In DOOM: Eternal? - The Full Story (Part 3) - Before You Play DOOM: The Dark Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T14:44:16.923748+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T14:00:51+00:00",
        "description": "Ah, the Cyberdemon. A classic monstrosity that has been one of DOOM's most iconic and formidable foes for literally as long as DOOM has existed, and one that, across the series' many different renditions across its long lifetime thus far, has never failed to make a strong and lasting impression.\n\nUnsurprisingly, the Cyberdemon is set to return to the fray with the upcoming DOOM: The Dark Ages, so before we jump back into the medieval battlefield with this iconic demon, here, we're going to look back at its history across DOOM.",
        "id": 2628808,
        "language": null,
        "link": "https://www.youtube.com/watch?v=bmTTG-Iq4YA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bmTTG-Iq4YA/hqdefault.jpg",
        "title": "What Is The Cyberdemon?  - DOOM Demon Lore - Before You Play DOOM: The Dark Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T14:44:17.055680+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T14:00:24+00:00",
        "description": "In its original form, the DOOM franchise was never too focused on lore or storytelling, but over the last decade or so, things have certainly changed. Make no mistake, DOOM 2016 and DOOM Eternal are by no means story focused games, with the combat and the action very much being the focus, but both games did add to the larger DOOM universe and its lore in significant ways. \n\nThe upcoming DOOM: The Dark Ages is set to not only continue down that path, but even take it a step further- though the upcoming first person shooter is obviously still going to be about ripping and tearing demons first and foremost - it’s still DOOM, at the end of the day – id Software has also repeatedly stressed that it’s upping the ante with its story as well. \n\nWith way more cutscenes and a prequel tale that makes jts narrative much more front facing than the  traditional storytelling that the series has adopted in recent years, DOOM: The Dark Ages is promising to be a much more story driven experience, even ",
        "id": 2628809,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Id03zg8xfjk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Id03zg8xfjk/hqdefault.jpg",
        "title": "What Role Will The Night Sentinels Play in DOOM: The Dark Ages?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T14:44:17.187496+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T10:01:16+00:00",
        "description": "DOOM: The Dark Ages plunges DOOM Slayer into a techno medieval battleground, him being the supercharged weapon chosen to a wage war on demons. This is a prequel to DOOM’s 2016 reboot, yet DOOM Slayer’s abilities – despite canonically taking place before events of DOOM and DOOM Eternal – are more widespread than ever. \n\nA modified combat philosophy, crazy, never before seen weapons, redesigned monsters, unexplored biomes, dragons, mechs; id Software are throwing everything at DOOM: The Dark Ages. \n\nIn their mind, this DOOM title will be their magnum opus. Whilst some of the changes are proving controversial before release, it’s hard to see DOOM: The Dark Ages as anything other than another rip-roaring success in what is a long line of incredible DOOM games.",
        "id": 2628810,
        "language": null,
        "link": "https://www.youtube.com/watch?v=mIPojrDPihU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mIPojrDPihU/hqdefault.jpg",
        "title": "DOOM: The Dark Ages - 15 Things We Can't WAIT TO DO",
        "vote": 0
    }
]