[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T23:39:14.573745+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T22:40:00+00:00",
        "description": "According to Bloomberg's Mark Gurman, Apple has \"made progress\" on a chip for a product that could rival the Ray-Ban Meta smart glasses. The company is also reportedly working on glasses that use augmented reality. The Verge reports: The chip is apparently based on the chips Apple uses for the Apple Watch, though the company has removed parts and is being designed in such a way that it can handle the \"multiple cameras\" that the smart glasses might have, Bloomberg reports. Apple wants mass production of the chip to start by the end of 2026 or sometime in 2027, so the glasses themselves could come out within that timeframe. [...] Apple is developing chips for camera-equipped Apple Watch and Airpods as well, and the goal is for those chips to be ready \"by around 2027,\" Bloomberg says. The company is also developing new M-series chips and dedicated AI server chips, per the report.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home",
        "id": 2634175,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/08/2011221/apple-is-planning-smart-glasses-with-and-without-ar?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Is Planning Smart Glasses With and Without AR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T22:34:23.925513+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T22:00:00+00:00",
        "description": "In a recent interview with the Council on Foreign Relations, Cloudflare CEO Matthew Prince warned that AI is breaking the economic model of the web by decoupling content creation from value, with platforms like Google and OpenAI increasingly providing answers without driving traffic to original sources. He argued that unless AI companies start compensating creators, the web's content ecosystem will collapse -- calling most current AI investment a \"money fire\" with only a small fraction holding long-term value. Search Engine Land reports: Google's value exchange with content creators has collapsed, Prince said: \"Ten years ago... for every two pages of a website that Google scraped, they would send you one visitor. ... That was the trade. ... Now, it takes six pages scraped to get one visitor.\" That drop reflects the rise of zero-click searches, which happen when searchers get answers directly on Google's search page. \"Today, 75 percent of the queries... get answered without you leaving",
        "id": 2633827,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/08/1952225/cloudflare-ceo-ai-is-killing-the-business-model-of-the-web?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cloudflare CEO: AI Is Killing the Business Model of the Web",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T21:29:12.727974+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T21:20:00+00:00",
        "description": "An anonymous reader quotes a report from ZDNet: RIP, 486 processor. You've had a long run since Intel released you back in 1989. While Microsoft stopped supporting you with the release of Windows XP in 2001, Linux kept you alive and well for another 20+ years. But all good things must come to an end, and with the forthcoming release of the Linux 6.15 kernel, the 486 and the first Pentium processors will be sunsetted.\n \nWhy? Linus Torvalds wrote recently on the Linux Kernel Mailing List (LKML), \"I really get the feeling that it's time to leave i486 support behind. There's zero real reason for anybody to waste one second of development effort on this kind of issue.\" Senior Linux kernel developer Ingo Molnar put Torvalds' remark into context, writing, \"In the x86 architecture, we have various complicated hardware emulation facilities on x86-32 to support ancient 32-bit CPUs that very very few people are using with modern kernels. This compatibility glue is sometimes even causing problems",
        "id": 2633420,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/08/1927245/linux-drops-support-for-486-and-early-pentium-processors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linux Drops Support For 486 and Early Pentium Processors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T21:29:12.855882+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T20:40:00+00:00",
        "description": "A federal judge has allowed key parts of a class action lawsuit against Delta Air Lines to proceed, stemming from massive flight disruptions caused by CrowdStrike's faulty Windows update in July 2024. The Register reports: Delta blamed its reliance on Microsoft software and the CrowdStrike incident for its woes. However, according to the plaintiffs in the action (PDF), both companies offered the airline assistance, which Delta turned down. Customers of the Atlanta-based carrier affected by the delays and cancellations claim they struggled to secure refunds and compensation from the airline. The plaintiffs allege that \"although Delta offered reimbursement of eligible expenses through their website and app, Delta failed to clarify that the customer would only be receiving a partial reimbursement.\"\n \n\"Furthermore, Delta did not disclose to its customers that acceptance of the partial reimbursement would release any legal claims the customer may have against Delta until after the customer",
        "id": 2633421,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/08/1918243/delta-air-lines-class-action-cleared-for-takeoff-over-crowdstrike-chaos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Delta Air Lines Class Action Cleared For Takeoff Over CrowdStrike Chaos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T20:24:38.844487+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T20:00:00+00:00",
        "description": "After gaining attention from Neowin and DistroWatch last week, the sole maintainer behind AnduinOS 1.3 -- a Linux distribution styled to resemble Windows 11 -- decided to reveal himself. He turns out to be Anduin Xue, a Microsoft software engineer, who has been working on the project as a personal, non-commercial endeavor built on Ubuntu. Neowin reports: As a Software Engineer 2 at Microsoft (he doesn't work on Windows), Anduin Xue says he's financially stable and sees no need to commercialize AnduinOS. Explaining the financial aspects of the project, he said: \"Many have asked why I don't accept donations, how I profit, and if I plan to commercialize AnduinOS. Truthfully, I haven't thoroughly considered these issues. It's not my main job, and I don't plan to rely on it for a living. Each month, I dedicate only a few hours to maintaining it. Perhaps in the future, I might consider providing enterprise solutions based on AnduinOS, but I won't compromise its original simplicity. It has a",
        "id": 2632957,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/05/08/1912204/maintainer-of-linux-distro-anduinos-revealed-to-be-microsoft-employee?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Maintainer of Linux Distro AnduinOS Revealed to Be Microsoft Employee",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T20:24:39.000971+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T19:20:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The US Senate today voted along party lines to kill a Federal Communications Commission program to distribute Wi-Fi hotspots to schoolchildren, with Democrats saying the Republican-led vote will make it harder for kids without reliable Internet access to complete their homework. The Senate approved a Congressional Review Act (CRA) resolution to nullify the hotspot rule, which was issued by the Federal Communications Commission in July 2024 under then-Chairwoman Jessica Rosenworcel. The program would be eliminated if the House version passes and President Trump signs the joint resolution of disapproval.\n \nThe Rosenworcel FCC's rule expanded E-Rate, a Universal Service Fund program, allowing schools and libraries to use E-Rate funding to lend out Wi-Fi hotspots and services that could be used off-premises. The FCC rule was titled, \"Addressing the Homework Gap through the E-Rate Program,\" and the hotspot lending program was scheduled",
        "id": 2632958,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/08/1859227/senate-passes-cruel-republican-plan-to-block-wi-fi-hotspots-for-schoolkids?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Senate Passes 'Cruel' Republican Plan To Block Wi-Fi Hotspots For Schoolkids",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T19:19:32.464625+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T18:42:00+00:00",
        "description": "An anonymous reader shares a report: When Microsoft announced new Surface devices earlier this week, we noted that there wasn't a lot of daylight between the starting prices of the new but lower-end devices ($799 for the 12-inch Surface Pro, $899 for the 13-inch Surface Laptop) and the starting prices of the older-but-higher-end Surfaces from last spring ($999 for both). It appears Microsoft has quietly solved this problem by discontinuing the 256GB versions of the 13.8-inch Surface Laptop 7 and the 13-inch Surface Pro 11. \n\nMicrosoft's retail pages for both devices list only 512GB and 1TB configurations, with regular prices starting at $1,199. Though not technically a price hike -- the 512GB versions of both devices also cost $1,199 before -- it does amount to an effective price increase for last year's Surface hardware, especially given that both devices have user-replaceable storage that can easily be upgraded for less than the $200 that Microsoft charged for the 256GB-to-512GB upg",
        "id": 2632530,
        "language": null,
        "link": "https://slashdot.org/story/25/05/08/1842240/microsoft-effectively-raises-high-end-surface-prices-by-discontinuing-base-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Effectively Raises High-End Surface Prices By Discontinuing Base Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T18:13:25.220456+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T17:27:00+00:00",
        "description": "A Florida federal judge has dismissed the majority of claims against celebrities who endorsed Sam Bankman-Fried's now-collapsed cryptocurrency exchange FTX. Judge K. Michael Moore ruled that investors failed to demonstrate the high-profile endorsers -- including Tom Brady, Gisele Bundchen, Kevin O'Leary, Larry David, Shohei Ohtani, and Stephen Curry -- knew about FTX's fraudulent activities. \n\nIn his ruling, Moore wrote that while the celebrity endorsers may have been \"uninformed, negligent, or even reckless,\" plaintiffs didn't adequately establish that defendants had \"knowledge of FTX's fraud\" or \"the requisite intent to deceive and defraud investors.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Judge+Dismisses+Most+Charges+Against+FTX's+Celebrity+Boosters%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F05%2F08%2F1726213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_i",
        "id": 2631991,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/08/1726213/judge-dismisses-most-charges-against-ftxs-celebrity-boosters?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Judge Dismisses Most Charges Against FTX's Celebrity Boosters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T17:07:28.257031+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T16:50:00+00:00",
        "description": "Wikipedia is taking legal action against the UK's new Online Safety Act regulations it says could threaten the safety of its volunteer editors and their ability to keep harmful content off the site. From a report: The Wikimedia Foundation -- the non-profit which supports the online encyclopaedia -- is seeking a judicial review of rules which could mean Wikipedia is subjected to the toughest duties required of websites under the act. \n\nLead counsel Phil Bradley-Schmieg said it was \"unfortunate that we must now defend the privacy and safety of Wikipedia's volunteer editors from flawed legislation.\" The government told the BBC it was committed to implementing the act but could not comment on ongoing legal proceedings. It's thought this is the first judicial review to be brought against the new online safety laws - albeit a narrow part of them - but experts say it may not be the last. \n\n\"The Online Safety Act is vast in scope and incredibly complex,\" Ben Packer, a partner at law firm Link",
        "id": 2631282,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/08/1627254/wikipedia-legally-challenges-uks-flawed-online-safety-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wikipedia Legally Challenges UK's 'Flawed' Online Safety Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T17:07:28.370554+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T16:17:00+00:00",
        "description": "Plastic producers have pushed \"advanced recycling\" as a salve to the plastic waste crisis despite knowing for years that it is not a technically or economically feasible solution, a new report argues. The Guardian: Advanced recycling, also known as chemical recycling, refers to a variety of processes used to break plastics into their constituent molecules. The industry has increasingly promoted these technologies, as public concern about the environmental and health effects of plastic pollution has grown. Yet the rollout of these technologies has been plagued by problems, according to a new analysis from the Center for Climate Integrity (CCI), a fossil-fuel accountability advocacy group. \n\n\"The companies make it sound like it's pretty great, like it's something we should pursue,\" said Davis Allen, investigative researcher at the CCI and author of the report. \"But they know the problems, the limitations.\" The new analysis follows a 2024 CCI report which alleged that plastic producers c",
        "id": 2631283,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/08/1617250/plastics-industry-pushed-advanced-recycling-despite-knowing-problems?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Plastics Industry Pushed 'Advanced Recycling' Despite Knowing Problems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T16:05:01.875919+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T15:36:00+00:00",
        "description": "Apple asked a judge to halt an order forcing it to give up control over App Store payments while it appeals the decision. From a report: In a filing on Wednesday, Apple says the order contains \"extraordinary intrusions\" that could result in \"grave irreparable harm\" to the company. Last week, California District Court Judge Yvonne Gonzalez Rogers found that Apple was in \"willful violation\" of a 2021 injunction issued as part of the Epic Games v. Apple case. \n\nAs a result, the judge ordered Apple to stop collecting an up to 27 percent commission on purchases made outside the App Store, and said the company can no longer restrict how developers point users toward external purchases.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Asks+Court+To+Halt+App+Store+Rule+Changes+While+It+Appeals%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F05%2F08%2F1536241%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=",
        "id": 2630596,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/08/1536241/apple-asks-court-to-halt-app-store-rule-changes-while-it-appeals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Asks Court To Halt App Store Rule Changes While It Appeals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T14:57:33.538497+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T14:40:00+00:00",
        "description": "Switzerland will hold a national referendum on the introduction of electronic identity cards after opponents of the legislation secured enough signatures to force a public vote. The Federal Chancellery confirmed Wednesday that 55,344 valid signatures were submitted against the Federal Act on Electronic Identity passed last December. \n\nThe proposed e-ID would enable citizens to apply online for criminal record extracts, driving licenses, and age verification when purchasing alcohol. This marks the second referendum on e-ID implementation, after voters rejected a previous version in 2021. The government has revised its approach, making the new system free, optional, and fully state-operated rather than privately managed. If approved, the e-ID would come into force no earlier than 2026, though the collection effort suggests privacy concerns remain paramount for many Swiss voters.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home",
        "id": 2629668,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/08/1343219/switzerland-to-hold-referendum-on-introducing-electronic-id?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Switzerland To Hold Referendum on Introducing Electronic ID",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T14:57:33.652060+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T14:00:00+00:00",
        "description": "Meta CEO Mark Zuckerberg is aggressively promoting a future where AI becomes the dominant form of social interaction, claiming that AI friends, therapists, and business agents will soon outnumber human relationships. During a recent media blitz across multiple podcasts and a Stripe conference appearance, Zuckerberg cited statistics suggesting \"the average American has fewer than three friends\" while claiming people desire \"meaningfully more, like 15 friends\" -- positioning AI companions as the solution to this gap. \n\nThe Meta founder's vision extends beyond casual interaction to therapeutic and commercial relationships, with personalized AI that \"has a deep understanding of what's going on in this person's life.\" Meta has already deployed its AI across Instagram, Facebook, and Ray-Ban smart glasses, reaching nearly a billion monthly users.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Zuckerberg's+Grand+Vision%3A+M",
        "id": 2629669,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/08/1329251/zuckerbergs-grand-vision-most-of-your-friends-will-be-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Zuckerberg's Grand Vision: Most of Your Friends Will Be AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T14:57:33.764889+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from SFGATE: When the pandemic upended the world of higher education, Robin Pugh, a professor at City College of San Francisco, began to see one puzzling problem in her online courses: Not everyone was a real student. Of the 40 students enrolled in her popular introduction to real estate course, Pugh said she'd normally drop three to five from her roster who don't start the course or make contact with her at the start of the semester. But during the current spring semester, Pugh said that number more than doubled when she had to cut 11 students. It's a strange new reality that has left her baffled. \"It's really unclear to me, and beyond the scope of my knowledge, how this is really happening,\" she said. \"Is it organized crime? Is it something else? Everybody has lots of theories.\"\n \nSome of the disengaged students in Pugh's courses are what administrators and cybersecurity experts say are \"ghost students,\" and they've been a growing problem for comm",
        "id": 2629670,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/08/012245/ghost-students-are-creating-an-agonizing-problem-for-california-colleges?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ghost Students Are Creating an 'Agonizing' Problem For California Colleges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T14:57:33.878287+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T10:00:00+00:00",
        "description": "At its Config 2025 event on Wednesday, Figma unveiled four new AI-powered tools -- Sites, Make, Buzz, and Draw, positioning itself as a full-stack design platform to rival Adobe, WordPress, and Canva. These tools enable users to build websites, generate code, create marketing content, and design vector graphics without leaving the Figma ecosystem. The Verge reports: Figma's first solution is Figma Sites, a website builder that integrates with Figma Design and allows creators to turn their projects into live, functional sites. Figma Sites provides presets for layouts, blocks, templates, and interactions that aim to make building websites less complex and time-consuming. Additional components like custom animations can also be added either using existing code or by prompting Site's AI tool to generate new interaction codes via text descriptions, such as \"animate the text to fall into place like a feather.\" Figma Sites is rolling out in beta for users with full seat access to Figma produ",
        "id": 2629671,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/08/0053214/figmas-big-ai-update-takes-on-adobe-wordpress-and-canva?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Figma's Big AI Update Takes On Adobe, WordPress, and Canva",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T08:04:56.591529+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T07:00:00+00:00",
        "description": "sciencehabit shares a repot from Science.org: Scientists have captured fungal spores cruising in the inhospitable environment of the stratosphere, much higher than commercial aircraft fly. When brought back to the lab, the researchers found that some of the spores -- including pathogens of plants and people -- had survived intercontinental trips and could be cultured in the lab. Although spores and microbes have been detected in the stratosphere before, the new results come from a cheap, homespun sampling device dangled from weather balloons, the project could help researchers figure out what traits and conditions allow spores to survive a swing through the stratosphere and how they get up there in the first place. The work could also be a first step towards an atmospheric monitoring system that could nip emerging fungal pathogens in the bud, the study's authors reported at a conference of the European Geophysical Union.\n \nAfter five preliminary flights, the team has already learned a",
        "id": 2627651,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/07/1953201/dangerous-fungal-spores-may-travel-the-globe-on-stratospheric-superhighway?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dangerous Fungal Spores May Travel the Globe On 'Stratospheric Superhighway'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T05:55:25.969723+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T05:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Chris Pelkey was killed in a road rage shooting in Chandler, Arizona, in 2021. Three and a half years later, Pelkey appeared in an Arizona court to address his killer. Sort of. \"To Gabriel Horcasitas, the man who shot me, it is a shame we encountered each other that day in those circumstances,\" says a video recording of Pelkey. \"In another life, we probably could have been friends. I believe in forgiveness, and a God who forgives. I always have, and I still do,\" Pelkey continues, wearing a grey baseball cap and sporting the same thick red and brown beard he wore in life.\n \nPelkey was 37 years old, devoutly religious and an army combat veteran. Horcasitas shot Pelkey at a red light in 2021 after Pelkey exited his vehicle and walked back towards Horcasitas's car. Pelkey's appearance from beyond the grave was made possible by artificial intelligence in what could be the first use of AI to deliver a victim impact statement. Stacey Wal",
        "id": 2627028,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/07/2029215/ai-of-dead-arizona-road-rage-victim-addresses-killer-in-court?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI of Dead Arizona Road Rage Victim Addresses Killer In Court",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-08T03:45:28.387631+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-08T03:15:00+00:00",
        "description": "Google has pushed back against Apple executive Eddy Cue's testimony that Safari searches declined last month, asserting it continues \"to see overall query growth in Search\" with \"an increase in total queries coming from Apple's devices and platforms.\" \n\nThe statement comes as Apple's Senior VP revealed under oath that the company is \"actively looking at\" revamping Safari to focus on AI-powered search engines, potentially threatening the estimated $20 billion-a-year deal making Google the default search provider on Apple devices. \n\nCue testified that AI search providers including OpenAI, Perplexity, and Anthropic will \"eventually replace standard search engines.\" Google, in its response, pointed to ongoing enhancements to its search product, noting users are \"accessing it for new things and in new ways, whether from browsers or the Google app, using their voice or Google Lens.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home",
        "id": 2626554,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/08/0314235/google-refutes-apples-claims-of-search-traffic-decline?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Refutes Apple's Claims of Search Traffic Decline",
        "vote": 0
    }
]