[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T14:12:40.709951+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T13:30:15+00:00",
        "description": "Plants vs. Zombies: Replanted is an HD refresh of a timeless classic. The 2009 original laid the foundations upon which countless tower defense and strategy games have built on. \n\nWhilst a new entry in the series would be ideal for longtime fans, this remaster is set to serve up a timely reminder of how seamless the original’s design was. This time, too, the game’s visuals are bright and sharp, showcasing levels that are more chaotic thanks to a suite of new modes and challenges. \n\nEverything which made Plants vs. Zombies such a legendary title is back - bigger, better, and more charming than ever. This video highlights 15 things you need to know before prepping your lawns once again for zombie invasion.",
        "id": 3857065,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=GW9V81bTl9E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GW9V81bTl9E/hqdefault.jpg",
        "title": "Plants vs  Zombies: Replanted - 15 Things YOU NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T10:33:08.671432+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T09:30:17+00:00",
        "description": "Bluepoint Games is hiring, and we couldn't be happier to see that the studio has remained unaffected by Sony's cancellation of the live-service title it was working on. That's a significant amount of time and effort down the drain for the first-party studio that brought a solid remake of Demon's Souls to the table.\n\nBut the new job listings have once again raised hopes that the studio could work its magic on another FromSoftware classic that has garnered a lot of goodwill in the decade since its release. \n\nWith the listings focused on finding designers experienced with combat and puzzles, those hopes might very well come to pass.  Could Bloodborne be Bluepoint's next target for a remake?",
        "id": 3855461,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=XpPdlQFrg_E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XpPdlQFrg_E/hqdefault.jpg",
        "title": "Sony’s Treatment of Bluepoint Games Is A MASTERCLASS IN WASTED POTENTIAL",
        "vote": 0
    }
]