[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T23:09:07.418285+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T22:40:00+00:00",
        "description": "Kohler has launched the Dekoda, a $599 smart toilet camera that analyzes users' waste to track hydration, gut health, and detect potential issues like blood. \"It also comes with a rechargeable battery, a USB connection, and a fingerprint sensor to identify who's using the toilet,\" reports TechCrunch. From the report: The Dekoda is currently available for preorder, with shipments scheduled to begin on October 21. In addition to the hardware purchase fee, customers will need to pay between $70 and $156 per year for a subscription. If you're uneasy about the privacy implications of putting a camera right below your private parts, the company says, \"Dekoda's sensors see down into your toilet and nowhere else.\" It also notes that the resulting data is secured via end-to-end encryption.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Kohler+Unveils+a+Camera+For+Your+Toilet%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F25%",
        "id": 3861064,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/10/20/212258/kohler-unveils-a-camera-for-your-toilet",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Kohler Unveils a Camera For Your Toilet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T23:09:07.492296+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Anthropic has added web and mobile interfaces for Claude Code, its immensely popular command-line interface (CLI) agentic AI coding tool. The web interface appears to be well-baked at launch, but the mobile version is limited to iOS and is in an earlier stage of development. The web version of Claude Code can be given access to a GitHub repository. Once that's done, developers can give it general marching orders like \"add real-time inventory tracking to the dashboard.\"\n \nAs with the CLI version, it gets to work, with updates along the way approximating where it's at and what it's doing. The web interface supports the recently implemented Claude Code capability to take suggestions or requested changes while it's in the middle of working on a task. (Previously, if you saw it doing something wrong or missing something, you often had to cancel and start over.) Developers can run multiple sessions at once and switch between them as nee",
        "id": 3861065,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/20/2059211/claude-code-gets-a-web-version",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Claude Code Gets a Web Version",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T21:49:42.881886+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T21:22:00+00:00",
        "description": "An anonymous reader shares a report: A hacking group that recently doxed hundreds of government officials, including from the Department of Homeland Security (DHS) and Immigration and Customs Enforcement (ICE), has now built dossiers on tens of thousands of U.S. government officials, including NSA employees, a member of the group told 404 Media. The member said the group did this by digging through its caches of stolen Salesforce customer data. The person provided 404 Media with samples of this information, which 404 Media was able to corroborate. \n\nAs well as NSA officials, the person sent 404 Media personal data on officials from the Defense Intelligence Agency (DIA), the Federal Trade Commission (FTC), Federal Aviation Administration (FAA), Centers for Disease Control and Prevention (CDC), the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), members of the Air Force, and several other agencies.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop",
        "id": 3860468,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/20/204219/hackers-say-they-have-personal-data-of-thousands-of-nsa-and-other-government-officials",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hackers Say They Have Personal Data of Thousands of NSA and Other Government Officials",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T21:49:43.014408+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T20:45:00+00:00",
        "description": "A Court of Accounts report written before Sunday's theft of crown jewels from the Louvre revealed the museum's security systems were outdated and inadequate [non-paywalled source]. The report noted a lack of basic CCTV equipment across multiple wings. Cameras had mainly been installed only when rooms were refurbished due to repeated postponements of scheduled modernization. In the Denon wing where the Apollo Gallery was targeted, a third of rooms had no CCTV cameras. Three-quarters of rooms in the Richelieu wing and nearly two-thirds in the Sully wing lacked cameras. \n\nThe thieves were caught on camera at one point but were masked and impossible to identify, according to Paris public prosecutor Laure Beccuau. The alarm system activated when thieves cut open display cases, but they threatened staff who left the area. Culture minister Rachida Dati confirmed new CCTV cameras would be installed. President Macron had earmarked $186.30 million to upgrade the Louvre's security systems under ",
        "id": 3860469,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/20/1957202/louvre-museum-security-outdated-and-inadequate-at-time-of-heist",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Louvre Museum Security 'Outdated and Inadequate' at Time of Heist",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T20:22:16.083008+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T20:05:00+00:00",
        "description": "Nvidia CEO Jensen Huang says his company has lost all access to China's market after U.S. export restrictions eliminated what was once a 95% share. Speaking in an interview with Citadel Securities, Huang questioned the wisdom of policies that cost America one of the world's largest markets. \n\nThe Biden Administration imposed rules in 2022 to restrict exports of Nvidia's most advanced AI chips to China. The Trump Administration blocked additional chip sales in April and later granted export licenses for certain Nvidia and AMD chips in exchange for 15% of revenues. Chinese regulators responded by telling domestic tech companies to avoid Nvidia chips designed to meet U.S. export requirements. Beijing also placed strict limits on exports of rare earths. Huang noted that about half the world's AI researchers are in China and called it a mistake not to have them build AI on American technology.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twit",
        "id": 3859806,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/20/1934203/nvidia-ceo-says-company-went-from-95-to-0-market-share-in-china",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia CEO Says Company Went from 95% to 0 Market Share in China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T20:22:16.170921+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T19:25:00+00:00",
        "description": "Google plans to let Pixel smartphone enthusiasts test out the company's next handset ahead of its public introduction. From a report: Google has invited members of its \"Superfans\" group to apply to test future Pixel hardware, asking entrants to profess their knowledge and passion for the brand in hopes of being able to beta test forthcoming products. \n\nConsumer tech companies often let small groups of customers try out unreleased products under strict secrecy to gather feedback during development. But it's incredibly rare for a company of Google's size to do it with something as high-profile as the Pixel lineup. \n\nThe search giant will select 15 people from the pool of entrants, and winners must all sign a non-disclosure agreement to receive devices, according to official rules for the contest reviewed by Bloomberg News. \"The Trusted Tester program is an opportunity to provide feedback and help shape a Pixel phone currently in development,\" the document reads.<p><div class=\"share_subm",
        "id": 3859807,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/20/1925216/google-to-let-superfans-test-in-development-pixel-phones",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google To Let 'Superfans' Test In-Development Pixel Phones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T19:00:29.482844+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T18:45:00+00:00",
        "description": "An anonymous reader writes: \"Hoisted by their own GPTards.\" That's how Meta's Chief AI Scientist Yann LeCun described the blowback after OpenAI researchers did a victory lap over GPT-5's supposed math breakthroughs. Google DeepMind CEO Demis Hassabis added, \"this is embarrassing.\" The Decoder reports that in a since-deleted tweet, OpenAI VP Kevin Weil declared that \"GPT-5 found solutions to 10 (!) previously unsolved Erdos problems and made progress on 11 others.\" (\"Erdos problems\" are famous conjectures posed by mathematician Paul Erdos.) \n\nHowever, mathematician Thomas Bloom, who maintains the Erdos Problems website, said Weil's post was \"a dramatic misrepresentation\" -- while these problems were indeed listed as \"open\" on Bloom's website, he said that only means, \"I personally am unaware of a paper which solves it.\" In other words, it's not accurate to claim GPT-5 was able to solve previously unsolved problems. Instead, Bloom wrote, \"GPT-5 found references, which solved these probl",
        "id": 3859113,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/20/1827201/openais-embarrassing-math",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's 'Embarrassing' Math",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T19:00:29.616150+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T18:08:00+00:00",
        "description": "The Sims is in a period of transition -- and as part of that, the ongoing mobile version will be shutting down in a few months. From a report: EA announced that today's update for The Sims Mobile will be its last, and that on January 20th, 2026 the game \"will no longer be accessible to play and will be sunset.\" The mobile iteration of the franchise first launched in 2018, and has seen more than 50 updates since then. EA says that starting today players will no longer be able to spend real money in the game, and that it will be delisted on both iOS and Android tomorrow before the servers shut down completely next year, making it entirely unplayable.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Sims+Mobile+is+Shutting+Down+Next+Year%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F10%2F20%2F188252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a ",
        "id": 3859114,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/20/188252/the-sims-mobile-is-shutting-down-next-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Sims Mobile is Shutting Down Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T17:37:52.530220+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T17:31:00+00:00",
        "description": "China says it has uncovered what it describes as irrefutable evidence of American government cyber attacks targeting the National Time Service Center. The Ministry of State Security said the National Security Agency exploited vulnerabilities in employees' mobile phones beginning March 25, 2022, and later used stolen login credentials to access the center's computers starting April 18, 2023. \n\nThe facility in Xi'an provides high-precision timekeeping service for the government, civil society, and various industries. It also supplies data used to calculate international standard time. Chinese authorities said investigators found that private servers worldwide were employed to conceal the attacks' origin. The accusations emerge against a backdrop of mutual cyber-espionage claims between Washington and Beijing. Western governments and companies have repeatedly blamed Chinese hackers for intrusions in recent years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slash",
        "id": 3858537,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/20/1731258/china-accuses-nsa-of-hacking-national-timekeeping-agency",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Accuses NSA of Hacking National Timekeeping Agency",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T17:37:52.603608+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T16:51:00+00:00",
        "description": "An electronic eye implant has restored reading ability to patients blinded by geographic atrophy, a form of dry age-related macular degeneration. Results published Monday in the New England Journal of Medicine showed that 84% of trial participants regained the ability to read letters, numbers, and words after receiving the Prima device. \n\nThe microchip measures two millimetres by two millimetres and is implanted beneath the center of the retina. Patients wear augmented reality glasses containing a camera that projects images onto the chip. The device converts light into electrical pulses transmitted to the brain. \n\nFrank Holz, the study's lead author and chair of ophthalmology at the University Hospital of Bonn, called the implant \"a paradigm shift in treating late-stage age-related macular degeneration.\" Mahi Muqit, a consultant at Moorfields Eye Hospital in London, said the trial enabled \"meaningful central vision restoration, which has never been done before.\" The procedure takes l",
        "id": 3858538,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/20/1651237/experts-hail-remarkable-success-of-electronic-implant-in-restoring-sight",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Experts Hail 'Remarkable' Success of Electronic Implant in Restoring Sight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T16:14:14.840657+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T16:01:00+00:00",
        "description": "Food allergies in children dropped sharply in the years after new guidelines encouraged parents to introduce infants to peanuts, a study has found. The New York Times: For decades, as food allergy rates climbed, experts recommended that parents avoid exposing their infants to common allergens. But a landmark trial in 2015 found that feeding peanuts to babies could cut their chances of developing an allergy by over 80%. [non-paywalled source.] In 2017, the National Institute of Allergy and Infectious Diseases formally recommended the early-introduction approach and issued national guidelines. \n\nThe new study, published Monday in the journal Pediatrics, found that food allergy rates in children under 3 fell after those guidelines were put into place -- dropping to 0.93% between 2017 and 2020, from 1.46% between 2012 and 2015. That's a 36% reduction in all food allergies, driven largely by a 43% drop in peanut allergies. The study also found that eggs overtook peanuts as the No. 1 food a",
        "id": 3857833,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/20/1524254/peanut-allergies-have-plummeted-in-children-study-shows",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Peanut Allergies Have Plummeted in Children, Study Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T16:14:14.919293+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T15:22:00+00:00",
        "description": "India will need as much as $21 trillion to achieve its climate goals and lift its population out of poverty, according to a draft government plan seen by Bloomberg. From the report: The estimate offers a first glimpse of how the country intends to live up to its target of net zero emissions by 2070. The updated scenario implies hitting peak emissions in 2045, which is a decade earlier than the current trajectory. \n\nIndia is already being severely battered by the fallout of climate change, as deadly floods and heat waves become more destructive each year. But the need to mitigate the emissions that feed climate change has historically been at odds with India's priorities of economic growth and energy security, with the latter still mostly provided through coal. The new plan shows India will seek to achieve climate and economic development goals simultaneously, with low-carbon options envisaged for much of its yet-to-be-built residential and industrial infrastructure.<p><div class=\"shar",
        "id": 3857834,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/20/1447219/india-draft-plan-reveals-21-trillion-net-zero-investment-need",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India Draft Plan Reveals $21 Trillion Net-Zero Investment Need",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T16:14:14.998160+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T14:40:00+00:00",
        "description": "Test scores across OECD countries peaked around 2012 and have declined since. IQ scores in many developed countries appear to be falling after rising throughout the twentieth century. Nataliya Kosmyna at MIT's Media Lab began noticing changes around two years ago when strangers started emailing her to ask if using ChatGPT could alter their brains. She posted a study in June tracking brain activity in 54 students writing essays. Those using ChatGPT showed significantly less activity in networks tied to cognitive processing and attention compared to students who wrote without digital help or used only internet search engines. Almost none could recall what they had written immediately after submitting their work. \n\nShe received more than 4,000 emails afterward. Many came from teachers who reported students producing passable assignments without understanding the material. A British survey found that 92% of university students now use AI and roughly 20% have used it to write all or part o",
        "id": 3857835,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/20/148243/are-we-living-in-a-golden-age-of-stupidity",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Are We Living in a Golden Age of Stupidity?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T14:33:23.187467+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T14:00:00+00:00",
        "description": "AWS experienced a three-hour outage early Monday morning that disrupted thousands of websites and applications across the globe. The cloud computing provider reported DNS problems with DynamoDB in its US-EAST-1 region in northern Virginia starting at 12:11 a.m. Pacific time. Over 4 million users reported issues, according to Downdetector. Snapchat saw reports spike from more than 22,000 to around 4,000 as systems recovered. Roblox dropped from over 12,600 complaints to fewer than 500. Reddit and the financial platform Chime remained affected longer. Perplexity, Coinbase and Robinhood attributed their platform disruptions directly to AWS. \n\nGaming platforms including Fortnite, Clash Royale and Clash of Clans went offline. Signal confirmed the messaging app was down. In Britain, Lloyd Bank, Bank of Scotland, Vodafone, BT, and the HMRC website faced problems. United Airlines reported disrupted access to its app and website overnight. Some internal systems were temporarily affected. Delta",
        "id": 3857160,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/20/140248/aws-outage-takes-thousands-of-websites-offline-for-three-hours",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AWS Outage Takes Thousands of Websites Offline for Three Hours",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T13:13:54.152706+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T11:34:00+00:00",
        "description": "A recent article in Noema magazines explores the issues in \"editing nature to fix our failures.\" \n\n\"It turns out playing God is neither difficult nor expensive,\" the article points out. \"For about $2,000, I can go online and order a decent microscope, a precision injection rig, and a vial of enough CRISPR-Cas9 &mdash; an enzyme-based genome-editing tool &mdash; to genetically edit a few thousand fish embryos...\" So when going beyond the kept-in-captivity Dire Wolf to the possibility of bringing back forests of the American chestnut tree, \"The process is deceptively simple; the implications are anything but...\"\n\n\nIf scientists could use CRISPR to engineer a more heat-tolerant coral, it would give coral a better chance of surviving a marine environment made warmer by climate change. It would also keep the human industries that rely on reefs afloat. But should we edit nature to fix our failures? And if we do, is it still natural...? Evolution is not keeping pace with climate change, so i",
        "id": 3856377,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/20/0514246/should-we-edit-nature-to-help-it-survive-climate-change",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Should We Edit Nature to Help It Survive Climate Change?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T11:03:42.180782+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T07:34:00+00:00",
        "description": "\"The gig economy is facing a reckoning,\" argues Business Insider's BI Today newsletter.\"\n\n\n\n\nTwo stories this past week caught my eye. Uber unveiled a new way for its drivers to earn money. No, not by giving rides, but by helping train the ride-sharing company's AI models instead. On the same day, Waymo announced a partnership with DoorDash to test driverless grocery and meal deliveries. \n\nBoth moves point toward the same future: one where the very workers who built the gig economy may soon find themselves training the technology that replaces them. \n\nUber's new program allows drivers to earn cash by completing microtasks, such as taking photos and uploading audio clips, that aim to improve the company's AI systems. For drivers, it's a way to diversify income. For Uber, it's a way to accelerate its automated future. There's an irony here. By helping Uber strengthen its AI, drivers could be accelerating the very driverless world they fear... Uber already offers autonomous rides in Waym",
        "id": 3855543,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/20/0616223/the-ai-revolutions-next-casualty-could-be-the-gig-economy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'The AI Revolution's Next Casualty Could Be the Gig Economy'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T06:02:29.629260+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T04:54:00+00:00",
        "description": "\"Windows Recovery Environment (RE), as the name suggests, is a built-in set of tools inside Windows that allow you to troubleshoot your computer, including booting into the BIOS, or starting the computer in safe mode,\" writes Tom's Hardware. \n\n\"It's a crucial piece of software that has now, unfortunately, been rendered useless (for many) as part of the latest Windows update.\"\n\n\nA new bug discovered in Windows 11's October build, KB5066835, makes it so that your USB keyboard and mouse stop working entirely, so you cannot interact with the recovery UI at all. \n\nThis problem has already been recognized and highlighted by Microsoft, who clarified that a fix is on its way to address this issue. Any plugged-in peripherals will continue to work just fine inside the actual operating system, but as soon as you go into Windows RE, your USB keyboard and mouse will become unresponsive. It's important to note that if your PC fails to start-up for any reason, it defaults to the recovery environment",
        "id": 3854376,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/20/0247259/windows-11-update-breaks-recovery-environment-making-usb-keyboards-and-mice-unusable",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows 11 Update Breaks Recovery Environment, Making USB Keyboards and Mice Unusable",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T03:25:44.718270+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T02:34:00+00:00",
        "description": "Readers in 2025 \"may struggle to remember the optimism of the aughts, when the internet seemed to offer endless possibilities for virtual art and writing that was free...\" argues a new review at Bookforum. \"The content we do create online, if we still create, often feels unreflectively automatic: predictable quote-tweet dunks, prefabricated poses on Instagram, TikTok dances that hit their beats like clockwork, to say nothing of what's literally thoughtlessly churned out by LLM-powered bots.\" \n\nThey write that author Joanna Walsh \"wants us to remember how truly creative, and human, the internet once was,\" in the golden age of user-generated content &mdash; and funny cat picture sites like I Can Has Cheezburger:\n\n\nI Can Has Cheezburger... was an amateur project, an outlet for tech professionals who wanted an easier way to exchange cute cat pics after a hard day at work. In Amateurs!: How We Built Internet Culture and Why It Matters, Walsh documents how unpaid creative labor is the basis",
        "id": 3853802,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/20/0230212/was-the-web-more-creative-and-human-20-years-ago",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Was the Web More Creative and Human 20 Years Ago?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-20T00:38:17.930196+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-20T00:20:00+00:00",
        "description": "On Cloudflare's blog, a senior research engineer shares a plan for \"improving the trustworthiness of JavaScript on the web.\" \n\n\n\"It is as true today as it was in 2011 that Javascript cryptography is Considered Harmful.\"\n\n\n\nThe main problem is code distribution. Consider an end-to-end-encrypted messaging web application. The application generates cryptographic keys in the client's browser that lets users view and send end-to-end encrypted messages to each other. If the application is compromised, what would stop the malicious actor from simply modifying their Javascript to exfiltrate messages? It is interesting to note that smartphone apps don't have this issue. This is because app stores do a lot of heavy lifting to provide security for the app ecosystem. Specifically, they provide integrity, ensuring that apps being delivered are not tampered with, consistency, ensuring all users get the same app, and transparency, ensuring that the record of versions of an app is truthful and public",
        "id": 3853299,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/20/005250/a-plan-for-improving-javascripts-trustworthiness-on-the-web",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Plan for Improving JavaScript's Trustworthiness on the Web",
        "vote": 0
    }
]