[
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:26:24.458233+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T19:00:39+00:00",
        "description": "Life’s too short not to spend it with the person you love. The final season of The Summer I Turned Pretty is now streaming on Prime Video.\n \n» Watch The Summer I Turned Pretty on Prime Video: https://amzn.to/4eTgbdt\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n \nAbout The Summer I Turned Pretty Season 3:\nIt’s the end of her junior year of college, and Belly’s looking forward to another summer in Cousins with her soulmate, Jeremiah. Her future seems set, until some core-shaking events bring her first love Conrad back into her life. Now on the brink of adulthood, Belly finds herself at a crossroads and must decide which brother has her heart. Summer will never be the same…\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original ser",
        "id": 3624525,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lmmA6Fplhv8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lmmA6Fplhv8/hqdefault.jpg",
        "title": "How Do We Know Belly Isn’t Sure If She Loves Conrad | The Summer I Turned Pretty | Prime Video",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T17:21:35.532235+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T17:01:16+00:00",
        "description": "Cadence, Gat, and the Sinclair sisters uncover the lies on the page. Emily Alyn Lind, Shubham Maheshwari, Candice King and more star in We Were Liars, now streaming on Prime Video.\n \n» Watch We Were Liars on Prime Video: https://bit.ly/We-Were-Liars-PV\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n\nAbout We Were Liars:\nBased on the best-selling novel by E. Lockhart, We Were Liars, the series follows Cadence Sinclair Eastman and her tight-knit inner circle, nicknamed ‘the Liars,’ during their summer escapades vacationing on their grandfather’s New England private island. On the surface the Sinclair family is known for their good looks, generational wealth, and close familial bond, but after a life-altering accident, everyone, not just the Liars, seems to have something to hide.  \n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in You",
        "id": 3624148,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zao3t5aJRTo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zao3t5aJRTo/hqdefault.jpg",
        "title": "We Were Liars Cast Reads Book Aloud | Prime Video",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T15:12:35.083240+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T15:01:48+00:00",
        "description": "The Summer I Turned Pretty and The Map That Leads to You are now streaming on Prime Video.\n\nAbout The Summer I Turned Pretty:\nBelly Conklin is about to turn 16, and she’s headed to her favorite place in the world, Cousins Beach, to spend the summer with her family and the Fishers. Belly’s grown up a lot over the past year, and she has a feeling that this summer is going to be different than all the summers before. The Summer I Turned Pretty is based on the book by Jenny Han, who is creator and executive producer.\n\nAbout The Map That Leads to You:\nThe film follows Heather, a young woman traveling Europe with friends before starting her perfectly planned life. A chance meeting with Jack sparks an unexpected romance that leads to deep emotional discovery. As secrets and life choices test their bond, her path changes forever. Based on the novel by J.P. Monninger.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, a",
        "id": 3623446,
        "language": "en",
        "link": "https://www.youtube.com/shorts/zEm9d1zhmOg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zEm9d1zhmOg/hqdefault.jpg",
        "title": "Everything's up in the air. | The Summer I Turned Pretty x The Map That Leads to You",
        "vote": 0
    }
]