[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T00:01:19.410180+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T23:22:00+00:00",
        "description": "An anonymous reader shared this report from the Washington Post:\n\n Finnish tech firm Bluefors, a maker of ultracold refrigerator systems critical for quantum computing, has purchased tens of thousands of liters of Helium-3 from the moon &mdash; spending \"above $300 million\" &mdash; through a commercial space company called Interlune. The agreement, which has not been previously reported, marks the largest purchase of a natural resource from space. \nInterlune, a company founded by former executives from Blue Origin and an Apollo astronaut, has faced skepticism about its mission to become the first entity to mine the moon (which is legal thanks to a 2015 law that grants U.S. space companies the rights to mine on celestial bodies). But advances in its harvesting technology and the materialization of commercial agreements are gradually making this undertaking sound less like science fiction. Bluefors is the third customer to sign up, with an order of up to 10,000 liters of Helium-3 annual",
        "id": 3625933,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/20/0254249/interlune-signs-300m-deal-to-harvest-helium-3-for-quantum-computing-from-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Interlune Signs $300M Deal to Harvest Helium-3 for Quantum Computing from the Moon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T22:58:21.554827+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T22:22:00+00:00",
        "description": "A large U.S.-made bomb left over from World War II was discovered at a construction site, reports the Associated Press:\n\nPolice said the bomb was 1.5 meters (nearly 5 feet) in length and weighed about 1,000 pounds (450 kilograms). It was discovered by construction workers in Quarry Bay, a bustling residential and business district on the west side of Hong Kong island... [A police official] said that because of \"the exceptionally high risks associated with its disposal,\" approximately 1,900 households involving 6,000 individuals were \"urged to evacuate swiftly.\" The operation to deactivate the bomb began late Friday and lasted until around 11:30 a.m. Saturday. No one was injured in the operation. \n\nBombs left over from World War II are discovered from time to time in Hong Kong. The city was occupied by Japanese forces during the war, when it became a base for the Japanese military and shipping. The United States, along with other Allied forces, targeted Hong Kong in air raids to disrup",
        "id": 3625725,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/20/2215203/6000-evacuated-during-defusing-of-american-wwii-bomb-found-buried-in-hong-kong?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "6,000 Evacuated During Defusing of American WWII Bomb Found Buried in Hong Kong",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T21:55:31.752594+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T21:22:00+00:00",
        "description": "\"A cyberattack targeting check-in and boarding systems disrupted air traffic and caused delays at several of Europe's major airports on Saturday,\" reports the Associated Press. \n\n\"While the impact on travelers appeared to be limited, experts said the intrusion exposed vulnerabilities in security systems.\"\n\nThe disruptions to electronic systems initially reported at Brussels, Berlin's Brandenburg and London's Heathrow airports meant that only manual check-in and boarding was possible. Many other European airports said their operations were unaffected... Airports said the issue centered around a provider of check-in and boarding systems &mdash; not airlines or the airports themselves. Collins Aerospace, whose systems help passengers check themselves in, print boarding passes and bag tags and dispatch their luggage from a kiosk, cited a \"cyber-related disruption\" to its MUSE (Multi-User System Environment) software at \"select airports.\" \nBrussels Airport initially reported a \"large impac",
        "id": 3625454,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/20/2119232/cyberattack-delays-flights-at-several-of-europes-major-airports?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cyberattack Delays Flights at Several of Europe's Major Airports",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:15.621630+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T19:50:00+00:00",
        "description": "\"Betelgeuse may have competition for the most exciting star about to go nova near Earth,\" writes Space.com. \n\n\"Astronomers have discovered the secret of a strange star system that has baffled them for years, finding it contains a dead star about to erupt after overfeeding on a stellar companion.\"\n\n The supernova explosion of this cosmic cannibal could be as bright as the moon, making it visible with the naked eye over Earth even in broad daylight. The system in question is the double star V Sagittae located around 10,000 light-years from Earth, containing a white dwarf stellar remnant and its victim companion star, which orbit each other roughly twice every Earth day. The new research and the revelation of this white dwarf's imminent catastrophic fate answer questions about V Sagittae that have lingered for 123 years... \n\nWhite dwarfs represent the final stage of stars with masses around that of the sun, occurring when they run out of fuel for nuclear fusion... [W]hite dwarfs that hav",
        "id": 3624658,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/20/1927253/doomed-cannibal-star-could-explode-in-a-supernova-visible-during-day?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Doomed 'Cannibal' Star Could Explode In a Supernova Visible During Day",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:15.838467+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T18:50:00+00:00",
        "description": "Fast Company ran a contrarian take about AI from entrepreneur/thought leader Faisal Hoque, who argues there's three AI bubbles. \n\nThe first is a classic speculative bubble, with asset prices soaring above their fundamental values (like the 17th century's Dutch \"tulip mania\"). \"The chances of this not being a bubble are between slim and none...\"\n\nSecond, AI is also arguably in what we might call an infrastructure bubble, with huge amounts being invested in infrastructure without any certainty that it will be used at full capacity in the future. This happened multiple times in the later 1800s, as railroad investors built thousands of miles of unneeded track to serve future demand that never materialized. More recently, it happened in the late '90s with the rollout of huge amount of fiber optic cable in anticipation of internet traffic demand that didn't turn up until decades later. Companies are pouring billions into GPUs, power systems, and cooling infrastructure, betting that demand w",
        "id": 3624659,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/20/1847246/there-isnt-an-ai-bubble---there-are-three?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "There Isn't an AI Bubble - There Are Three",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:16.033289+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T17:34:00+00:00",
        "description": "The Shai-Hulud malware campaign impacted hundreds of npm packages across multiple maintainers, reports Koi Security, including popular libraries like @ctrl/tinycolor and some packages maintained by CrowdStrike.\n\nMalicious versions embed a trojanized script (bundle.js) designed to steal developer credentials, exfiltrate secrets, and persist in repositories and endpoints through automated workflows. \nKoi Security created a table of packages identified as compromised, promising it's \"continuously updated\" (and showing the last compromise detected Tuesday). Nearly all of the compromised packages have a status of \"removed from NPM\".\n\nAttackers published malicious versions of @ctrl/tinycolor and other npm packages, injecting a large obfuscated script (bundle.js) that executes automatically during installation. This payload repackages and republishes maintainer projects, enabling the malware to spread laterally across related packages without direct developer involvement. As a result, the co",
        "id": 3624660,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/20/0542237/self-replicating-worm-affected-several-hundred-npm-packages-including-crowdstrikes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Self-Replicating Worm Affected Several Hundred NPM Packages, Including CrowdStrike's",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:16.299866+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T16:34:00+00:00",
        "description": "Long-time Slashdot reader robinsrowe shared this report from the Register:\n\n\nThe C++ standards committee abandoned a detailed proposal to create a rigorously safe subset of the language, according to the proposal's co-author, despite continuing anxiety about memory safety. \"The Safety and Security working group voted to prioritize Profiles over Safe C++. Ask the Profiles people for an update. Safe C++ is not being continued,\" Sean Baxter, author of the cutting-edge Circle C++ compiler, commented in June this year. The topic came up as developers like Simone Bellavia noted the anniversary of the proposal and discovered a decision had been made on Safe C++. \n\nOne year ago, Baxter told The Reg that the project would enable C++ developers to get the memory safety of Rust, but without having to learn a new language. \"Safe C++ prevents users from writing unsound code,\" he said. \"This includes compile-time intelligence like borrow checking to prevent use-after-free bugs and initialization an",
        "id": 3624661,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/20/0449252/c-committee-prioritizes-profiles-over-rust-style-safety-model-proposal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "C++ Committee Prioritizes 'Profiles' Over Rust-Style Safety Model Proposal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:16.572310+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T15:34:00+00:00",
        "description": "Micro- and nanoplastic particles \"infiltrate all systems of the body, including the brain,\" notes the University of Rhode Island, \"where they can accumulate and trigger Alzheimer's-like conditions, according to a new study by researchers in the University of Rhode Island College of Pharmacy.\" \n\n ScienceDaily shares the announcement:\n\n\n\nAfter a previous study that showed how microplastics can infiltrate all systems of the body &mdash; including the blood-brain barrier, which protects the brain from harmful substances as small as viruses and bacteria &mdash; University of Rhode Island pharmacy assistant professor Jaime Ross expanded the study to determine the brain health impacts of the plastic toxins. Her findings indicate that the accumulation of micro- and nanoplastics in the brain can lead to cognitive decline and even Alzheimer's disease, especially in those who carry genetic risk factors. \n\nRoss' latest study, published recently in the journal Environmental Research Communications",
        "id": 3624662,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/20/0332242/study-links-microplastic-exposure-to-alzheimers-disease-in-mice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Study Links Microplastic Exposure to Alzheimer's Disease in Mice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:16.789081+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T14:34:00+00:00",
        "description": "\"OpenAI's video generation tool, Sora, can create high-definition clips of just about anything you could ask for...\" reports the Washington Post. \n\"But OpenAI has not specified which videos it grabbed to make Sora, saying only that it combined 'publicly available and licensed data'...\"\n\nWith ChatGPT, OpenAI helped popularize the now-standard industry practice of building more capable AI tools by scraping vast quantities of text from the web without consent. With Sora, launched in December, OpenAI staff said they built a pioneering video generator by taking a similar approach. They developed ways to feed the system more online video &mdash; in more varied formats &mdash; including vertical videos and longer, higher-resolution clips... To explore what content OpenAI may have used, The Washington Post used Sora to create hundreds of videos that show it can closely mimic movies, TV shows and other content... \n\nIn dozens of tests, The Post found that Sora can create clips that closely rese",
        "id": 3624663,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/20/0120220/is-openais-video-generating-tool-sora-scraping-unauthorized-youtube-clips?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is OpenAI's  Video-Generating Tool 'Sora' Scraping Unauthorized YouTube Clips?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:17.081311+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T12:01:00+00:00",
        "description": "Libraries nationwide are fielding patron requests for books that don't exist after AI-generated summer reading lists appeared in the Chicago Sun-Times and Philadelphia Inquirer earlier this year. Reference librarian Eddie Kristan told 404 Media the problem began in late 2022 following GPT-3.5's release but escalated dramatically after the newspapers published lists created by a freelancer using AI without verification. \n\nA Library Freedom Project survey found patrons increasingly trust AI chatbots over human librarians and become defensive when told their AI-recommended titles are fictional. Kristan now routinely checks WorldCat's global catalog to verify titles exist. Collection development librarians are requesting digital vendors remove AI-generated books from platforms while academic libraries struggle against vendors implementing flawed LLM-based search tools and AI-generated summaries that undermine information literacy instruction.<p><div class=\"share_submission\" style=\"positio",
        "id": 3624664,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/19/203223/librarians-are-being-asked-to-find-ai-hallucinated-books?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Librarians Are Being Asked To Find AI-Hallucinated Books",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:17.458317+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T10:31:00+00:00",
        "description": "The high seas, the vast waters beyond any one country's jurisdiction, cover nearly half the planet. On Friday, a hard-fought global treaty to protect the \"cornucopia of biodiversity\" living there cleared a final hurdle and will become international law. From a report: The High Seas Treaty, as it is known, was ratified by a 60th nation, Morocco, crossing the threshold for United Nations treaties to go into effect. Two decades in the making, it allows for the establishment of enormous conservation zones in international waters. Environmentalists hailed it as a historic moment. The treaty \"is a conservation opportunity that happens once in a generation, if that,\" said Lisa Speer, who directs the International Oceans Program at the Natural Resources Defense Council. \n\nIt is also a bright spot amid a general dimming of optimism about international diplomacy and cooperation among nations toward common goals. It will come into force just as the high seas are poised to become the site of cont",
        "id": 3624665,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/19/2026214/hard-fought-treaty-to-protect-ocean-life-clears-a-final-hurdle?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hard-Fought Treaty To Protect Ocean Life Clears a Final Hurdle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T20:43:17.860048+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T08:01:00+00:00",
        "description": "The Leon Thevenin, Africa's only permanently stationed cable repair ship, maintains over 60,000 kilometers of undersea internet infrastructure from Madagascar to Ghana. The 43-year-old vessel employs a 60-person crew who perform precision repairs on fiber-optic cables that carry data for Alphabet, Meta, and Amazon -- companies that consumed 3.6 billion megabits per second of bandwidth in 2023. \n\nOperating costs range from $70,000 to $120,000 daily, according to owner Orange Marine. The ship has experienced increased demand due to unusual underwater landslides in the Congo Canyon causing frequent cable breaks. Cable jointer Shuru Arendse and his team spend up to 48 hours on repairs that require fusing hair-thin glass fibers in conditions where a speck of dust can ruin the joint. The vessel gained Starlink connectivity last year after decades of relying on satellite phones and shared computers for crew communication. Sixty-two cable repair ships operate globally to maintain the infrastr",
        "id": 3624666,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/19/1831235/africas-only-internet-cable-repair-ship-keeps-the-continent-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Africa's Only Internet Cable Repair Ship Keeps the Continent Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T03:15:39.044858+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T02:56:00+00:00",
        "description": "The Washington Post: The Trump administration unveiled a new crackdown Friday on journalists at the Pentagon, saying it will require them to pledge they won't gather any information - even unclassified - that hasn't been expressly authorized for release, and will revoke the press credentials of those who do not obey. \n\nUnder the policy, the Pentagon may revoke press passes for anyone it deems a security threat. Possessing confidential or unauthorized information, under the new rules, would be grounds for a journalist't press pass to be revoked. \n\n\"DoW remains committed to transparency to promote accountability and public trust,\" the document says, using an acronym for the newly rebranded Department of War. \"However, DoW information must be approved for public release by an appropriate authorizing official before it is released, even if it is unclassified.\" \n\nFor months, Defense Secretary Pete Hegseth and his staff have been tightening restrictions on Pentagon reporters while limiting ",
        "id": 3620514,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/20/0255254/pentagon-demands-journalists-pledge-to-not-obtain-unauthorized-material?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pentagon Demands Journalists Pledge To Not Obtain Unauthorized Material",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T03:15:39.169630+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T02:31:00+00:00",
        "description": "Amazon's logistics network will now fulfill orders placed on Walmart.com, the company announced at its Accelerate seller conference, creating a surreal arrangement where the e-commerce giant directly supports its biggest retail rival's online operations. Third-party sellers can now use Amazon's Multichannel Fulfillment service to automatically process Walmart orders through direct integration. The packages arrive in unbranded boxes since Walmart prohibits Amazon-branded deliveries to its customers. \n\nAmazon VP Dharmesh Mehta told GeekWire the system automatically routes any Walmart order through Amazon's fulfillment network. The service expansion includes upcoming Shein integration and existing support for eBay, Etsy, and Temu. Amazon's third-party seller services generated $156 billion in 2024 revenue. The company now competes directly against ShipBob, FedEx, UPS, and ironically Walmart's own fulfillment services while positioning itself as an end-to-end logistics provider regardless",
        "id": 3620515,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/19/1945211/sold-on-walmart-sent-by-amazon-the-weird-new-world-of-online-retail?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sold on Walmart, Sent by Amazon: The Weird New World of Online Retail",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-20T00:52:29.793567+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-20T00:01:00+00:00",
        "description": "Just days after federal data revealed average reading, math and science scores dropped among certain grades since before the coronavirus pandemic, a U.S. Senate panel on Thursday picked apart the root causes and methods for students' academic improvement. From a report: The hearing in the Senate Committee on Health, Education, Labor and Pensions centered on the \"state of K-12 education\" -- which GOP members on the committee described as \"troubling\" -- in light of recent data from the National Assessment of Educational Progress, or NAEP. \n\nNAEP, regarded as the gold standard for tracking students' academic performance, showed that average science scores for eighth-graders decreased by 4 points since before the pandemic, in 2019. Average math and reading scores for 12th-graders also fell 3 points between 2019 and 2024. The assessments were administered between January and March of 2024. Results also showed that just one-third of 12th-graders are considered academically prepared for coll",
        "id": 3620006,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/19/1926203/decline-in-k-12-national-reading-math-science-scores-probed-by-us-senate-panel?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Decline in K-12 National Reading, Math, Science Scores Probed By US Senate Panel",
        "vote": 0
    }
]