[
    {
        "age": null,
        "album": "",
        "author": "Magia Natury",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T09:53:10.967007+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T09:00:22+00:00",
        "description": "Powiedzieć, że żyliśmy pośród dzikiej przyrody to nic nie powiedzieć. Do zobrazowanie tego z czym mieliśmy do czynienia na naszych ziemiach 1000 lat temu nie wystarczy nawet Puszcza Białowieska, bo nie spotkamy przecież w niej np. niedźwiedzi. A tymczasem we wczesnym średniowieczu niedźwiedzie występowały powszechnie od Bałtyku aż do Tatr, były wszędzie. Wilki panoszyły się jeszcze liczniej - spotkać je można było w każdym lesie, dolinie, na łące. Nie były płochliwe jak dzisiaj - wtedy to one były w ofensywie - nie znały wszak smaku ołowiu, nie było jeszcze broni palnej. Podobnie było z innym dziś skrajnie rzadkimi, bądź całkowicie wymarłymi już, zwierzętami. \n\nDzicz była wszędzie, a człowiek starał się wydzierać jej małe fragmenty przy pomocy ognia i toporów. Ziemie polskie pod względem przyrodniczym wyglądały jak ścisły rezerwat, mało tego, wyglądały wręcz jak plejstoceński park z filmu sci-fi, bo obok stad żubrów biegały też liczne jeszcze wtedy stada wymarłych dziś turów, czy tarp",
        "id": 3455332,
        "language": "pl",
        "link": "https://www.youtube.com/watch?v=9kBv5fa0v_k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 461,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfDX69pxC4q6yKSaugs196g",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9kBv5fa0v_k/hqdefault.jpg",
        "title": "Jak Polowano bez Broni Palnej? - Średniowieczna DZICZ - Pośród Turów, Niedźwiedzi i Wilków",
        "vote": 0
    }
]