[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T23:30:20.356744+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T23:09:00+00:00",
        "description": "At the moment, the Spotify exodus of 2025 is a trickle rather than a flood, writes the Guardian, citing the departure of five notable bands \"liked in indie circles,\" but not \"the sorts to rack up billions of listens.\" \n\n\"Still, it feels significant if only because, well, this sort of thing wasn't really supposed to happen any more.\"\n\nPlenty of bands and artists refused to play ball with Spotify in its early years, when the streamer still had work to do before achieving total ubiquity. But at some point there seemed to a collective recognition that resistance was futile, that Spotify had won and those bands would have to bend to its less-than-appealing model... This artist acquiescence happened in tandem &mdash; surely not coincidentally &mdash; with a closer relationship between Spotify and the record labels that once viewed it as their destroyer. Some of the bigger labels have found a way to make a lot of money from streaming: Spotify paid out $10bn in royalties last year &mdash; tho",
        "id": 3459472,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/08/30/1850237/five-indie-bands-quit-spotify-after-founders-ai-weapons-tech-investment?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Five Indie Bands Quit Spotify After Founder's AI Weapons Tech Investment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T22:24:00.993416+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T22:09:00+00:00",
        "description": "Intel amended its deal with the U.S. Department of Commerce \"to remove earlier project milestones,\" reports Reuters, \"and received about $5.7 billion in cash sooner than planned.\" \n\n\"The move will give Intel more flexibility over the funds.\"\n\nThe amended agreement, which revises a November 2024 funding deal, retains some guardrails that prevent the chipmaker from using the funds for dividends and buybacks, doing certain control-changing deals and from expanding in certain countries. \n\nThe move makes the Wall Street Journal wonder what, beyond equity, the U.S. now gets in return, calling government's position \"a stake without a strategy.\"\nThe U.S. has historically shied away from putting money into private business. It can't really outguess the market on where the most promising returns lie. Yet there are exceptions. Sometimes a company or industry risks failing without public support, and that failure would hurt the whole country, not just its shareholders and employees. Intel meets b",
        "id": 3459261,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/30/2144210/intel-get-57-billion-early-whats-the-governments-strategy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel Get $5.7 Billion Early. What's the Government's Strategy?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T21:13:40.554152+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T21:09:00+00:00",
        "description": "After Will Smith uploaded a video of an adoring crowd, blogger Andy Baio \"conducted a detailed analysis that suggests Will Smith's team might have used AI to turn photos from his recent concerts into videos,\" writes BGR. But there's more to the story:\nGoogle recently ran an experiment for YouTube Shorts in which it used AI (machine learning) to improve the quality of Shorts without asking the creator for permission. People complained the videos looked like they were AI generated. It seems that Will Smith's YouTube Shorts clip that attracted criticism from fans this week might have been a victim of this experiment... The signs are real. The man who claimed Will Smith's song helped him cure cancer was there. The woman in front of him was holding the sign with him. The \"Lov U\" sign appeared in photos the singer posted on his social media channels before the clip was shared. \n\n\"Will Smith has not denied the use of AI in these promotional clips,\" the article adds. \n\nBut the Hollywood Repor",
        "id": 3458875,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/30/215236/did-will-smith-upload-an-ai-enhanced-video---and-is-this-just-the-beginning?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Did Will Smith Upload an AI-Enhanced Video - and Is This Just the Beginning?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T21:13:40.674481+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T19:57:00+00:00",
        "description": "They offer \"a self-sustaining power solution for marine regions,\" according to a newly published 41-page review after \"pioneering use in wave energy harvesting in 2014\". Ten years later, researchers have developed several structures for these \"triboelectric nanogenerators\" (TENGs) to \"facilitate their commercial deployment.\" But there's a lack of \"comprehensive summaries and performance evaluations\". \n\nSo the review \"distills a decade of blue-energy research into six design pillars\" for next-generation technology, writes EurekaAlert, which points the way \"to self-powered ocean grids, distributed marine IoT, and even hydrogen harvested from the sea itself...\" By \"translating chaotic ocean motion into deterministic electron flow,\" the team \"turns every swell, gust and glint of sunlight into dispatchable power &mdash; ushering in an era where the sea itself becomes a silent, self-replenishing power plant.\" \n\nSome insights:\n\n\n- Multilayer stacks, origami folds and magnetic-levitation fram",
        "id": 3458876,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/30/1954220/wave-energy-projects-have-come-a-long-way-after-10-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wave Energy Projects Have Come a Long Way After 10 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T19:28:57.372029+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T18:34:00+00:00",
        "description": "When it comes to nuclear fusion energy, \"How do we advance fusion as fast as possible?\" asks the CEO of Commonwealth Fusion Systems. They've just raised $863 million from Nvidia, Google, the BIll Gates-founded Breakthrough Energy Ventures and nearly two dozen more investors, which \"may prove helpful as the company develops its supply chain and searches for partners to build its power plants and buy electricity,\" reports TechCrunch. \n\nCommonwealth's CEO/co-founder Bob Mumgaard says \"This round of capital isn't just about fusion just generally as a concept... It's about how do we go to make fusion into a commercial industrial endeavor.\"\n\nThe Massachusetts-based company has raised nearly $3 billion to date, the most of any fusion startup. Commonwealth Fusion Systems (CFS) previously raised a $1.8 billion round in 2021... \n\nCFS is currently building a prototype reactor called Sparc in a Boston suburb. The company expects to turn that device on later next year and achieve scientific breake",
        "id": 3458471,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/30/1751217/fusion-power-company-cfs-raises-863m-more-from-google-nvidia-and-many-others?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fusion Power Company CFS Raises $863M More From Google, Nvidia, and Many Others",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T18:24:27.708529+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T17:34:00+00:00",
        "description": "By exploiting two-color beams, researchers \"can generate ordered chains and lattices,\" reports ScienceDaily, \"with tunable topology &mdash; potentially revolutionizing data storage, communications, and photonic processing.\"\n\nAn internationally joint research group between Singapore and Japan has unveiled a blueprint for arranging exotic, knot-like patterns of light into repeatable crystals that extend across both space and time. The work lays out how to build and control \"hopfion\" lattices using structured beams.. three-dimensional topological textures whose internal \"spin\" patterns weave into closed, interlinked loops. \n\nThey have been observed or theorized in magnets and light fields, but previously they were mainly produced as isolated objects. The authors show how to assemble them into ordered arrays that repeat periodically, much like atoms in a crystal, only here the pattern repeats in time as well as in space. The key is a two-color, or bichromatic, light field whose electric v",
        "id": 3458166,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/30/0720252/scientists-just-created-spacetime-crystals-made-of-knotted-light?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Scientists Just Created Spacetime Crystals Made of Knotted Light'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T17:17:46.073353+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T16:34:00+00:00",
        "description": "They were extinct in the Netherlands in the early 19th century. But in 1988 beavers were reintroduced to the region, and now there's over 7,000, reports the Guardian. \n\nBut unfortunately...\n\nBeavers are increasingly digging burrows and tunnels under roads, railways and &mdash; even more worryingly &mdash; in dikes. For a country where a quarter of the land sits below sea level, this is not a minor problem &mdash; especially as beavers are not exactly holding back when digging. \"We've found tunnels stretching up to 17 metres [equivalent to 60 feet] into a dike... That's alarming,\" says Jelmer Krom of the Rivierenland water board... If a major dike gives way, it would cause a serious flood affecting thousands of people... \n\n[T]heir entrances are under water, and as yet there are no effective techniques for mapping them. During high water, special patrols go out at night with thermal-imaging cameras to spot where beavers are active, but this method doesn't always yield the desired result",
        "id": 3457788,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/30/0652254/no-longer-extinct-beaver-populations-in-the-netherlands-now-threaten-their-dikes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "No Longer Extinct, Beaver Populations in the Netherlands Now Threaten Their Dikes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T16:12:38.197963+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T15:34:00+00:00",
        "description": "Remember those Harvard dropouts who built smart glasses for covert facial recognition &mdash; and then raised $1 million to develop AI-powered glasses to continuously listen to conversations and display its insights? \n\"People Are REALLY Mad,\" writes Futurism, noting that some social media users \"have responded with horror and outrage.\"\n\nOne of its selling points is that the specs don't come with a visual indicator that lights up to let people know when they're being recorded, which is a feature that Meta's smart glasses do currently have. \"People don't want this,\" wrote Whitney Merill, a privacy lawyer. \"Wanting this is not normal. It's weird....\" \n\n[S]ome mocked the deleterious effects this could have on our already smartphone-addicted, brainrotted cerebrums. \"I look forward to professional conversations with people who just read robot fever dream hallucinations at me in response to my technical and policy questions,\" one user mused. \nThe co-founder of the company told TechCrunch the",
        "id": 3457378,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/30/0618242/is-a-backlash-building-against-smart-glasses-that-record?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is a Backlash Building Against Smart Glasses That Record?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T15:07:33.520364+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T14:34:00+00:00",
        "description": "\"From a side project in Amsterdam to powering AI at the world's biggest companies &mdash; this is the story of Python,\" says the description of a new 84-minute documentary. \n\nLong-time Slashdot reader destinyland writes:\nIt traces Python all the way back to its origins in Amsterdam back in 1991. (Although the first time Guido van Rossum showed his new language to a co-worker, they'd typed one line of code just to prove they could crash Python's first interpreter.) The language slowly spread after van Rossum released it on Usenet &mdash; split across 21 separate posts &mdash; and Robin Friedrich, a NASA aerospace engineer, remembers using Python to build flight simulations for the Space Shuttle. (Friedrich says in the documentary he also attended Guido's first in-person U.S. workshop in 1994, and \"I still have the t-shirt...\") \n\nDropbox's CEO/founder Drew Houston describes what it was like being one of the first companies to use Python to build a company reaching millions of users. (An",
        "id": 3457005,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/30/0314222/new-python-documentary-released-on-youtube?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Python Documentary Released On YouTube",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T14:02:00.993570+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from The Verge: After bringing 4G and 5G connectivity to the Underground, London's public transport authority has started scolding noisy passengers who subject everyone to music and calls blasting out of their phones. A new poster campaign launched by Transport for London (TfL) this week encourages customers to wear headphones when watching or listening to content on their devices to reduce disruption for other commuters.\n \n\"Please don't disturb others with loud music or calls when traveling on the network,\" reads the \"Headphones On\" poster. The posters are already being displayed on the Elizabeth rail line, according to TfL, and will expand to bus, Docklands Light Railway, London Overground, London Underground, and London Tram services from October.\n \nThe campaign targets headphone dodgers as data coverage becomes more available across the underground rail network, making it easier for passengers to stream content and make calls on the go. People w",
        "id": 3456635,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/30/0038225/london-targets-noisy-commuters-with-headphone-campaign?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "London Targets Noisy Commuters With Headphone Campaign",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T10:47:07.823865+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T10:00:00+00:00",
        "description": "Alibaba, China's largest cloud-computing company, has developed a domestically manufactured, versatile inference chip to fill the gap left by U.S. restrictions on Nvidia's sales in China. The Wall Street Journal reports: Previous cloud-computing chips developed by Alibaba have mostly been designed for specific applications. The new chip, now in testing, is meant to serve a broader range of AI inference tasks, said people familiar with it. The chip is manufactured by a Chinese company, they said, in contrast to an earlier Alibaba AI processor that was fabricated by Taiwan Semiconductor Manufacturing. Washington has blocked TSMC from manufacturing AI chips for China that use leading-edge technology.\n \n[...] Private-sector cloud companies including Alibaba have refrained from bulk orders of Huawei's chips, resisting official suggestions that they should help the national champion, because they consider Huawei a direct rival in cloud services, people close to the firms said. China's bigge",
        "id": 3455600,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/29/231249/alibaba-creates-ai-chip-to-help-china-fill-nvidia-void?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Alibaba Creates AI Chip To Help China Fill Nvidia Void",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T07:30:18.791250+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T07:00:00+00:00",
        "description": "China has turned on the world's most sensitive neutrino detector after more than a decade of construction. The Register reports: The Jiangmen Underground Neutrino Experiment (JUNO) is buried 700 meters under a mountain and features a 20,000-tonne \"liquid scintillator detector\" that China's Academy of Science says is \"housed at the center of a 44-meter-deep water pool.\" There's also a 35.4-meter-diameter acrylic sphere supported by a 41.1-meter-diameter stainless steel truss. All that stuff is surrounded by more than 45,000 photo-multiplier tubes (PMTs). The latter devices are super-sensitive light detectors. A liquid scintillator is a fluid that, when exposed to ionizing radiation, produces light. At JUNO, the liquid is 99.7 percent alkylbenzene, an ingredient found in detergents and refrigerants.\n \nJUNO's designers hope that any neutrinos that pass through its giant tank bonk a hydrogen atom and produce just enough light that the detector array of PMTs can record their passing, produ",
        "id": 3454830,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/29/2253218/china-turns-on-giant-neutrino-detector-that-took-a-decade-to-build?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Turns On Giant Neutrino Detector That Took a Decade To Build",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T03:41:54.579709+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: The collapse of a critical Atlantic current can no longer be considered a low-likelihood event, a study has concluded, making deep cuts to fossil fuel emissions even more urgent to avoid the catastrophic impact. The Atlantic meridional overturning circulation (Amoc) is a major part of the global climate system. It brings sun-warmed tropical water to Europe and the Arctic, where it cools and sinks to form a deep return current. The Amoc was already known to be at its weakest in 1,600 years as a result of the climate crisis.\n \nClimate models recently indicated that a collapse before 2100 was unlikely but the new analysis examined models that were run for longer, to 2300 and 2500. These show the tipping point that makes an Amoc shutdown inevitable is likely to be passed within a few decades, but that the collapse itself may not happen until 50 to 100 years later. The research found that if carbon emissions continued to rise, 70% of t",
        "id": 3454118,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/29/2137253/collapse-of-critical-atlantic-current-is-no-longer-low-likelihood-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Collapse of Critical Atlantic Current Is No Longer Low-Likelihood, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T01:31:04.137577+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T01:25:00+00:00",
        "description": "Mastodon says it cannot comply with Mississippi's new age verification law because its decentralized software does not support age checks and the nonprofit lacks resources to enforce them. \"The social nonprofit explains that Mastodon doesn't track its users, which makes it difficult to enforce such legislation,\" reports TechCrunch. \"Nor does it want to use IP address-based blocks, as those would unfairly impact people who were traveling, it says.\" From the report: The statement follows a lively back-and-forth conversation earlier this week between Mastodon founder and CEO Eugen Rochko and Bluesky board member and journalist Mike Masnick. In the conversation, published on their respective social networks, Rochko claimed, \"there is nobody that can decide for the fediverse to block Mississippi.\" (The Fediverse is the decentralized social network that includes Mastodon and other services, and is powered by the ActivityPub protocol.) \"And this is why real decentralization matters,\" said Ro",
        "id": 3453780,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/29/2131208/mastodon-says-it-doesnt-have-the-means-to-comply-with-age-verification-laws?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mastodon Says It Doesn't 'Have the Means' To Comply With Age Verification Laws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T01:31:04.255096+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T00:45:00+00:00",
        "description": "Meta is rolling out temporary restrictions on its AI chatbots for teens after reports revealed they were allowed to engage in \"romantic\" conversations with minors. A Meta spokesperson said the AI chatbots are now being trained so that they do not generate responses to teens about subjects like self-harm, suicide, disordered eating or inappropriate romantic conversations. Instead, the chatbots will point teens to expert resources when appropriate. CNBC reports: \"As our community grows and technology evolves, we're continually learning about how young people may interact with these tools and strengthening our protections accordingly,\" the company said in a statement. Additionally, teenage users of Meta apps like Facebook and Instagram will only be able to access certain AI chatbots intended for educational and skill-development purposes. The company said it's unclear how long these temporary modifications will last, but they will begin rolling out over the next few weeks across the comp",
        "id": 3453781,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/29/2116246/meta-changes-teen-ai-chatbot-responses-as-senate-begins-probe-into-romantic-conversations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Changes Teen AI Chatbot Responses as Senate Begins Probe Into 'Romantic' Conversations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-30T00:24:32.599593+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-30T00:02:00+00:00",
        "description": "Vivaldi CEO Jon von Tetzchner has doubled down on his company's refusal to integrate generative AI into its browser, arguing that embedding AI in browsing dehumanizes the web, funnels traffic away from publishers, and primarily serves to harvest user data. \"Every startup is doing AI, and there is a push for AI inside products and services continuously,\" he told The Register in a phone interview. \"It's not really focusing on what people need.\" The Register reports: On Thursday, Von Tetzchner published a blog post articulating his company's rejection of generative AI in the browser, reiterating concerns raised last year by Vivaldi software developer Julien Picalausa. [...] Von Tetzchner argues that relying on generative AI for browsing dehumanizes and impoverishes the web by diverting traffic away from publishers and onto chatbots. \"We're taking a stand, choosing humans over hype, and we will not turn the joy of exploring into inactive spectatorship,\" he stated in his post. \"Without exp",
        "id": 3453515,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/29/217243/vivaldi-browser-doubles-down-on-gen-ai-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Vivaldi Browser Doubles Down On Gen AI Ban",
        "vote": 0
    }
]