[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T23:55:47.990466+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T23:21:00+00:00",
        "description": "Bloomberg reports that Google \"must renegotiate any contract to make its search engine or artificial intelligence app the default for smartphones and other devices every year, a federal judge ruled.\"\n\n\nJudge Amit Mehta in Washington sided with the US Justice Department on the one year limitation in his final ruling on what changes the search giant must make in the wake of a landmark ruling that the company illegally monopolized online search. The yearly renegotiation will give rivals &mdash; particularly those in the burgeoning generative AI field &mdash; a chance to compete for key placements. \n\nThe final judgment will still allow Google to offer its products to Apple Inc. for use in its popular iPhone and pay other electronics makers like Samsung Electronics Co. for default placement. But the judge said those contracts must be renegotiated annually. Mehta noted in his ruling that both Google and the US government said they could work with the one-year limitation on default contracts",
        "id": 4257631,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/06/2317218/google-must-limit-its-default-search-contracts-to-one-year-judge-rules",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Must Limit Its 'Default Search' Contracts to One Year, Judge Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T22:51:38.166520+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T21:59:00+00:00",
        "description": "\"Woman Hailed as Hero for Smashing Man's Meta Smart Glasses on Subway,\" reads the headline at Futurism:\n\n\nAs Daily Dot reports, a New York subway rider has accused a woman of breaking his Meta smart glasses. \"She just broke my Meta glasses,\" said the TikTok user, who goes by eth8n, in a video that has since garnered millions of views. \n\n\n\n\"You're going to be famous on the internet!\" he shouted at her through the window after getting off the train. The accused woman, however, peered back at him completely unfazed, as if to say that he had it coming. \n\n\"I was making a funny noise people were honestly crying laughing at,\" he claimed in the caption of a followup video. \"She was the only person annoyed...\" But instead of coming to his support, the internet wholeheartedly rallied behind the alleged perpetrator, celebrating the woman as a folk hero &mdash; and perfectly highlighting how the public feels about gadgets like Meta's smart glasses. \n\n\"Good, people are tired of being filmed by str",
        "id": 4257352,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/06/2156239/woman-hailed-as-a-hero-for-smashing-mans-meta-smart-glasses-on-subway",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Woman Hailed As a Hero For Smashing Man's Meta Smart Glasses On Subway",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T21:50:54.990242+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T20:49:00+00:00",
        "description": "\"Researchers engineered a strained germanium layer on silicon that allows charge to move faster than in any silicon-compatible material to date,\" reports Science Daily. \"This record mobility could lead to chips that run cooler, faster, and with dramatically lower energy consumption. \n\n\"The discovery also enhances the prospects for silicon-based quantum devices...\"\n\n\nScientists from the University of Warwick and the National Research Council of Canada have reported the highest \"hole mobility\" ever measured in a material that works within today's silicon-based semiconductor manufacturing.... The researchers created a nanometer-thin germanium epilayer on silicon that is placed under compressive strain. This engineered structure enables electric charge to move faster than in any previously known silicon-compatible material... \n\nThe findings establish a promising new route for ultra-fast, low-power semiconductor components. Potential uses include quantum information systems, spin qubits, c",
        "id": 4257070,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/06/2045205/a-1950s-material-just-set-a-modern-record-for-lightning-fast-chips",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A 1950s Material Just Set a Modern Record For Lightning-fast Chips",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T20:46:28.842466+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T19:34:00+00:00",
        "description": "\"A structure designed to prevent radioactive leakage at the defunct Chernobyl nuclear plant in Ukraine is no longer operational,\" reports Politico, \"after Russian drones targeted it earlier this year, the U.N.'s nuclear watchdog has found.\"\n\n[T]he large steel structure \"lost its primary safety functions, including the confinement capability\" when its outer cladding was set ablaze after being struck by Russian drones, according to a new report by the International Atomic Energy Agency. Beyond that, there was \"no permanent damage to its load-bearing structures or monitoring systems,\" it said. \"Limited temporary repairs have been carried out on the roof, but timely and comprehensive restoration remains essential to prevent further degradation and ensure long-term nuclear safety,\" IAEA Director General Rafael Mariano Grossi said in astatement.\n \n\n\nThe Guardian has pictures of the protective shield &mdash; incuding the damage from the drone strike. The shield is the world's largest movable",
        "id": 4256807,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/06/1916232/chernobyls-protective-shield-can-no-longer-confine-radiation-un-nuclear-watchdog-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chernobyl's Protective Shield Can No Longer Confine Radiation, UN Nuclear Watchdog Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T19:41:08.120361+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T18:34:00+00:00",
        "description": "To build three-wheeled, solar electric vehicles, Aptera has now launched its \"validation\" vehicle assembly line, reports the San Diego Business Journal. \n\n\n\"The validation line will set a technical foundation for the company's eventual low-volume assembly line, ensuring that manufacturing processes are optimized and refined, particularly for the company's composite body structure.\"\n\n\n\nTo date, Aptera has produced three validation vehicles, two of which are in use driving around the San Diego region, with plans to build another 10 in the coming weeks as progress continues on the validation manufacturing line. \"You learn things when you start to put miles on vehicles, putting 10s of thousands of miles on these validation vehicles and learning a lot from the durometer of the suspension, ride quality, spring rates and braking pressure,\" Aptera co-founder and co-CEO Chris Anthony said. \"We've been able to incorporate a lot of the usability stuff back, but also, just as we've gone through t",
        "id": 4256434,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/06/0840202/apteras-solar-powered-evs-take-another-step-toward-production",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Aptera's Solar-Powered EVs Take Another Step Toward Production",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T18:36:48.559908+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T17:34:00+00:00",
        "description": "What happened when a school in Los Angeles gave a sixth grader an iPad for use throughout the school day? \"He used the iPad during school to watch YouTube and participate in Fortnite video game battles,\" reports NBC News. \n\nHis mother has now launched a coalition of parents called Schools Beyond Screens \"organizing in WhatsApp groups, petition drives and actions at school board meetings and demanding meetings with district administrators, pressuring them to pull back on the school-mandated screen time.\"\n\n\nLos Angeles Unified is the first district of its size\nto face an organized &mdash; and growing &mdash; campaign by parents\ndemanding that schools pull back on mandatory screen time. The\ndiscontent in Los Angeles Unified, the second-largest school district\nin the country, reflects a growing unease nationally about the amount of time children spend\nlearning through screens in classrooms. While a majority\nof states prohibit children from using cellphones in class, 88%\nof schools provide",
        "id": 4256055,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/12/06/0714222/why-these-parents-want-schools-to-stop-issuing-ipads-to-their-children",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why These Parents Want Schools to Stop Issuing iPads to Their Children",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T17:29:05.752989+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T16:34:00+00:00",
        "description": "While Netflix hopes to buy Warner Bros. Discovery for $72 billion, CNBC reports a senior official in America's federal government said the administration was viewing the deal with \"heavy skepticism. And that's not the only hurdle:\n\nOn Thursday, The Wall Street Journal reported that Paramount, in a letter to lawyers for Warner Bros. Discovery [WBD], had warned that a sale to Netflix likely would \"never close\" because of regulatory challenges in the United States and overseas. \"Acquiring Warner's streaming and studio assets 'will entrench and extend Netflix's global dominance in a matter not allowed by domestic or foreign competition laws,' Paramount's lawyers wrote,\" the Journal reported. \n\nParamount \"is now weighing its options about whether to go straight to shareholders with one more improved bid,\" CNBC reported Friday, \"perhaps even higher than the $30-per-share, all-cash offer it submitted to Warner Bros. Discovery this week.\" \n\nAnd CNBC reported Friday that the review by America'",
        "id": 4255703,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/06/0455236/could-netflixs-deal-for-warner-bros-fall-apart",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could Netflix's Deal for Warner Bros. Fall Apart?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T16:21:12.318761+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T15:34:00+00:00",
        "description": "CNN's prediction for 2026? \"Any device that uses memory, from phones to tablets and smartwatches, could get pricier.\" But will it be a little or a lot? \n\nThe article cites an analysis from multinational strategy/management consulting firm McKinsey &amp; Company which found America's data center demand could continue growing by 20 to 25 percent per year\" through 2030. \"That's prompted memory manufacturers like Micron and Samsung to shift their focus to data centers, which use a different type of memory, meaning fewer resources for consumer products. (Jaejune Kim, executive VP for memory at Samsung, said in October that their third quarter saw strong demand for memory for AI and data centers, and that they expected the supply shortage for mobile and PC memory to \"intensify further.\")\n\n\n\nMemory prices are rising for consumer products because major manufacturers are instead ramping up production for AI data centers as artificial intelligence companies boom. \"It's pretty much brutal and cr",
        "id": 4255311,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/06/068215/the-ai-boom-could-increase-prices-for-phones-and-tablets-next-year",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The AI Boom Could Increase Prices for Phones and Tablets Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T14:16:06.549647+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T13:13:00+00:00",
        "description": "Linus Torvalds recently defended Windows' infamous Blue Screen of Death during a video with Linus Sebastian of Linus Tech Tips, where the two built a PC together. It's FOSS reports: In that video, Sebastian discussed Torvalds' fondness for ECC (Error Correction Code). I am using their last name because Linus will be confused with Linus. This is where Torvalds says this: \"I am convinced that all the jokes about how unstable Windows is and blue screening, I guess it's not a blue screen anymore, a big percentage of those were not actually software bugs. A big percentage of those are hardware being not reliable.\"\n \nTorvalds further mentioned that gamers who overclock get extra unreliability. Essentially, Torvalds believes that having ECC on the machine makes them more reliable, makes you trust your machine. Without ECC, the memory will go bad, sooner or later. He thinks that more than software bugs, often it is hardware behind Microsoft's blue screen of death. You can watch the video on Y",
        "id": 4254546,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/06/0155255/linus-torvalds-defends-windows-blue-screen-of-death",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linus Torvalds Defends Windows' Blue Screen of Death",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T11:01:28.445455+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T10:10:00+00:00",
        "description": "Longtime Slashdot reader sinij shares a report from the BBC: Do you find yourself getting increasingly irate while scrolling through your social media feed? If so, you may be falling victim to rage bait, which Oxford University Press has named its word or phrase of the year. It is a term that describes manipulative tactics used to drive engagement online, with usage of it increasing threefold in the last 12 months, according to the dictionary publisher.\n \nRage bait beat two other shortlisted terms -- aura farming and biohack -- to win the title. The list of words is intended to reflect some of the moods and conversations that have shaped 2025. \"Fundamental problem with social media as a system is that it exploits people's emotional thinking,\" comments sinij. \"Cute cat videos on one end and rage bait on another end of the same spectrum. I suspect future societies will be teaching disassociation techniques in junior school.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a",
        "id": 4253602,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/06/026245/rage-bait-named-oxford-word-of-the-year-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Rage Bait' Named Oxford Word of the Year 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T07:47:51.405283+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T07:07:00+00:00",
        "description": "Meta has officially confirmed it is shifting investment away from the metaverse and VR toward AI-powered smart glasses, following a Bloomberg report of an up to 30% budget cut for Reality Labs. \"Within our overall Reality Labs portfolio we are shifting some of our investment from Metaverse toward AI glasses and Wearables given the momentum there,\" a statement from Meta reads. \"We aren't planning any broader changes than that.\" From the report: Following Bloomberg's report, other mainstream news outlets including The New York Times, The Wall Street Journal, and Business Insider have published their own reports corroborating the general claim, with slightly differing details...\n \nBusiness Insider's report suggests that the cuts will primarily hit Horizon Worlds, and that employees are facing \"uncertainty\" about whether this will involve layoffs. One likely cut BI's report mentions is the funding for third-party studios to build Horizon Worlds content. The New York Times report, on the o",
        "id": 4252884,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/06/0217233/meta-confirms-shifting-some-funding-from-metaverse-toward-ai-glasses",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Confirms 'Shifting Some' Funding 'From Metaverse Toward AI Glasses'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T03:37:54.150396+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T03:03:00+00:00",
        "description": "An anonymous reader quotes a report from MIT Technology Review: OpenAI is testing another new way to expose the complicated processes at work inside large language models. Researchers at the company can make an LLM produce what they call a confession, in which the model explains how it carried out a task and (most of the time) owns up to any bad behavior. Figuring out why large language models do what they do -- and in particular why they sometimes appear to lie, cheat, and deceive -- is one of the hottest topics in AI right now. If this multitrillion-dollar technology is to be deployed as widely as its makers hope it will be, it must be made more trustworthy.\n \nOpenAI sees confessions as one step toward that goal. The work is still experimental, but initial results are promising, Boaz Barak, a research scientist at OpenAI, told me in an exclusive preview this week: \"It's something we're quite excited about.\" And yet other researchers question just how far we should trust the truthful",
        "id": 4252122,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/05/2148204/openai-has-trained-its-llm-to-confess-to-bad-behavior",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Has Trained Its LLM To Confess To Bad Behavior",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T02:32:18.911857+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T02:02:00+00:00",
        "description": "alternative_right shares a report from ScienceAlert: Engineers at Cornell University have created the blackest fabric on record, finding it absorbs 99.87 percent of all light that dares to illuminate its surface. [...] In this case, the Cornell researchers dyed a white merino wool knit fabric with a synthetic melanin polymer called polydopamine. Then, they placed the material in a plasma chamber, and etched structures called nanofibrils -- essentially, tiny fibers that trap light. \"The light basically bounces back and forth between the fibrils, instead of reflecting back out -- that's what creates the ultrablack effect,\" says Hansadi Jayamaha, fiber scientist and designer at Cornell.\n \nThe structure was inspired by the magnificent riflebird (Ptiloris magnificus). Hailing from New Guinea and northern Australia, male riflebirds are known for their iridescent blue-green chests contrasted with ultrablack feathers elsewhere on their bodies. The Cornell material actually outperforms the bir",
        "id": 4251934,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/05/2228219/blackest-fabric-ever-made-absorbs-9987-of-all-light-that-hits-it",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Blackest Fabric Ever Made Absorbs 99.87% of All Light That Hits It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T01:30:30.475614+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T01:01:00+00:00",
        "description": "Despite predictions that AI would replace radiologists, healthcare systems worldwide are hiring more of them because AI tools enhance their work, create new oversight tasks, and increase imaging volumes rather than reducing workloads. \"Put all that together with the context of an aging population and growing demand for imaging of all kinds, and you can see why Offiah and the Royal College of Radiologists are concerned about a shortage of radiologists, not their displacement,\" writes Financial Times authors John Burn-Murdoch and Sarah O'Connor. Amaka Offiah, who is a consultant pediatric radiologist and a professor in pediatric musculoskeletal imaging at the University of Sheffield in the UK, makes a prediction of her own: \"AI will assist radiologists, but will not replace them. I could even dare to say: will never replace them.\" From the report: [A]lmost all of the AI tools in use by healthcare providers today are being used by radiologists, not instead of them. The tools keep getting",
        "id": 4251735,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/05/2217255/ai-led-to-an-increase-in-radiologists-not-a-decrease",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Led To an Increase In Radiologists, Not a Decrease",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-06T00:23:32.020929+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-06T00:00:00+00:00",
        "description": "sinij shares news of the Trump administration surprising the auto industry by granting approval for \"tiny cars\" to be built in the United States. Bloomberg reports: President Donald Trump, apparently enamored by the pint-sized Kei cars he saw during his recent trip to Japan, has paved the way for them to be made and sold in the U.S., despite concerns that they're too small and slow to be driven safely on American roads.\n\"They're very small, they're really cute, and I said \"How would that do in this country?'\" Trump told reporters on Wednesday at the White House, as he outlined plans to relax stringent Biden-era fuel efficiency standards.\n \n\"But we're not allowed to make them in this country and I think you're gonna do very well with those cars, so we're gonna approve those cars,\" he said, adding that he's authorized Transportation Secretary Sean Duffy to approve production. [...] In response to Trump's latest order, Duffy said his department has \"cleared the deck\" for Toyota Motor Cor",
        "id": 4251393,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/05/221241/trump-wants-asias-cute-kei-cars-to-be-made-and-sold-in-us",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Wants Asia's 'Cute' Kei Cars To Be Made and Sold In US",
        "vote": 0
    }
]