[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T23:02:26+00:00",
        "description": "Slashdot reader spatwei shared this report from the cybersecurity site SC World:\n\n: AI coding assistants such as GitHub Copilot and Cursor could be manipulated to generate code containing backdoors, vulnerabilities and other security issues via distribution of malicious rule configuration files, Pillar Security researchers reported Tuesday. Rules files are used by AI coding agents to guide their behavior when generating or editing code. For example, a rules file may include instructions for the assistant to follow certain coding best practices, utilize specific formatting, or output responses in a specific language. \n\nThe attack technique developed by Pillar Researchers, which they call 'Rules File Backdoor,' weaponizes rules files by injecting them with instructions that are invisible to a human user but readable by the AI agent. \n\nHidden Unicode characters like bidirectional text markers and zero-width joiners can be used to obfuscate malicious instructions in the user interface an",
        "id": 2390576,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/23/2138230/how-ai-coding-assistants-could-be-compromised-via-rules-file?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How AI Coding Assistants Could Be Compromised Via Rules File",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T21:57:01+00:00",
        "description": "For weeks Signal has been one of the three most-downloaded apps in the Netherlands, according to a local news site. And now \"Higher education institutions in the Netherlands have been looking for an alternative,\" according to DUB (an independent news site for the Utrecht University community):\n\nEmployees of the Utrecht University of Applied Sciences (HU) were recently advised to switch to Signal. Avans University of Applied Sciences has also been discussing a switch...The National Student Union is concerned about privacy. The subject was raised at last week's general meeting, as reported by chair Abdelkader Karbache, who said: \"Our local unions want to switch to Signal or other open-source software.\" \n\nBesides being open source, Signal is a non-commercial nonprofit, the article points out &mdash; though its proponents suggest there's another big difference. \"HU argues that Signal keeps users' data private, unlike WhatsApp.\" Cybernews.com explains the concern:\n\nIn an interview with th",
        "id": 2390350,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/23/2120237/is-whatsapp-being-ditched-for-signal-in-dutch-higher-education?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is WhatsApp Being Ditched for Signal in Dutch Higher Education?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T20:51:57+00:00",
        "description": "\"There's no shortage of videos showing Steam running on expensive ARM single-board computers with discrete GPUs,\" writes Slashdot reader VennStone. \"So I thought it would be worthwhile to make a guide for doing it on (relatively) inexpensive RK3588-powered single-board computers, using Box86/64 and Armbian.\"\n\nThe guides I came across were out of date, had a bunch of extra steps thrown in, or were outright incorrect... Up first, we need to add the Box86 and Box64 ARM repositories [along with dependencies, ARMHF architecture, and the Mesa graphics driver]... \nThe guide closes with a multi-line script and advice to \"Just close your eyes and run this. It's not pretty, but it will download the Steam Debian package, extract the needed bits, and set up a launch script.\" (And then the final step is sudo reboot now.) \n\n\"At this point, all you have to do is open a terminal, type 'steam', and tap Enter. You'll have about five minutes to wait... Check out the video to see how some of the tested ",
        "id": 2390109,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/23/1922228/developer-loads-steam-on-a-100-arm-single-board-computer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Developer Loads Steam On a $100 ARM Single Board Computer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T19:46:53+00:00",
        "description": "Today long-time open source advocate/journalist Doc Searls revealed that years of work by consumer privacy groups has culminated in a proposed standard \"that can vastly expand our agency in the digital world\" &mdash; especially in a future world where agents surf the web on our behalf:\n\n\nMeet IEEE P7012 , which \"identifies/addresses the manner in which personal privacy terms are proffered and how they can be read and agreed to by machines.\" It has been in the works since 2017, and should be ready later this year. (I say this as chair of the standard's working group.) The nickname for P7012 is MyTerms (much as the nickname for the IEEE's 802.11 standard is Wi-Fi). \n\nThe idea behind MyTerms is that the sites and services of the world should agree to your terms, rather than the other way around. \n\n\n\nBasically your web browser proffers whatever agreement you've chosen (from a canonical list hosted at Customer Commons) to the web sites and other online services that you're visiting.\n \n\n\"B",
        "id": 2389809,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/23/1842242/doc-searls-proposes-we-set-our-own-terms-and-policies-for-web-site-tracking?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Doc Searls Proposes We Set Our Own Terms and Policies for Web Site Tracking",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T18:45:58+00:00",
        "description": "The latest Facebook whistleblower, a former international lawyer, \"cannot grant any of the nearly 100 interview requests she has received from journalists from print and broadcast news outlets in the United States and the United Kingdom,\" reports the Washington Post (citing \"a person familiar with the matter\"). \n\nThat's because of an independent arbiter's ruling that \"also bars her from talking with lawmakers in the U.S., London and the EU, according to a legal challenge she lodged against the ruling...\"\n\nOn March 12, an emergency arbiter &mdash; a dispute resolution option outside the court system &mdash; sided with Meta by ruling that the tech giant might reasonably convince a court that Wynn-Williams broke a non-disparagement agreement she entered as she was being fired by the company in 2017. The arbiter also said that while her publisher Macmillan appeared for the hearing on Meta's motion, Wynn-Williams did not despite having received due notice. The arbiter did not make any ass",
        "id": 2389533,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/23/0413214/facebook-whistleblower-demands-overturn-of-interview-ban---as-her-book-remains-a-bestseller?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Facebook Whistleblower Demands Overturn of Interview Ban - as Her Book Remains a Bestseller",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T18:45:58+00:00",
        "description": "In 30 minutes the Free Software Foundation holds a live auction of memorabilia to celebrate their upcoming 40th anniversary. \"By moving out of the FSF office, we got to sort through all the fun and historically important memorabilia and selected the best ones,\" they announced earlier &mdash; and 25 items will up for bids. (To participate in the live auction, you must register in advance.) \n\n \"This is your chance to get your very own personal souvenir of the FSF,\" explains an 11-page auction booklet, \"from original GNU art to a famous katana and the Internet Hall of Fame medal of the FSF's founder.\"\n\nThat's right... a katana.\n\nOnce upon a time, this 41-inch blade turned heads at the FSF's tech team office. Donated by FSF friends and fans of the XKCD webcomic #225, it became a lighthearted \"weapon\" in the war for user freedom. As RMS himself is anti-violence, he made a silly joke by examining the katana closely instead of brandishing it, symbolizing that software freedom can be defende",
        "id": 2389534,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/23/1558210/fsf-holds-live-auction-of-historically-important-free-software-memorabilia?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FSF Holds Live Auction of 'Historically Important' Free Software Memorabilia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T17:36:51+00:00",
        "description": "Reuters reported this week that several U.S. national security agencies \"have halted work on a coordinated effort to counter Russian sabotage, disinformation and cyberattacks...\"\n\n\nThe plan was led by the president's National Security Council (NSC) and involved at least seven national security agencies working with European allies to disrupt plots targeting Europe and the United States, seven former officials who participated in the working groups told Reuters... [S]ince Trump took office on January 20 much of the work has come to a standstill, according to eleven current and former officials, all of whom requested anonymity to discuss classified matters... Regular meetings between the National Security Council and European national security officials have gone unscheduled, and the NSC has also stopped formally coordinating efforts across U.S. agencies... \n\nThe FBI last month ended an effort to counter interference in U.S. elections by foreign adversaries including Russia and put on ",
        "id": 2389226,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/22/1824242/us-security-agencies-halt-coordinated-effort-to-counter-russian-sabotage-and-cyberattacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Security Agencies Halt Coordinated Effort to Counter Russian Sabotage and Cyberattacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T16:31:49+00:00",
        "description": "\"For developers and organisations that require a custom software image, a flexible and transparent build system is essential,\" according to an announcement Friday at Raspberry Pi.com. \n\n\"[T]o support these customers, we have created rpi-image-gen, a powerful new tool designed to put you in complete control of your Raspberry Pi images.\"\n\nIf you're building an embedded system or an industrial controller, you'll need complete control over the software resident on the device, and home users may wish to build their own OS and have it pre-configured exactly the way they want... rpi-image-gen is an alternative to pi-gen, which is the tool we use to create and deploy the Raspberry Pi OS distribution. rpi-image-gen... offers a very granular level of control over file system construction and software image creation... [B]eing able to help reduce software build time, provide guaranteed ownership of support, and reuse standard methodologies to ensure authenticity of software were all of paramoun",
        "id": 2388873,
        "language": null,
        "link": "https://build.slashdot.org/story/25/03/23/0012253/raspberry-pi-announces-new-tool-for-customized-software-images?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Raspberry Pi Announces New Tool for Customized Software Images",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T15:26:52+00:00",
        "description": "Science magazine reports:\nA strange-looking telescope that scanned the skies from a perch in northern Chile for 15 years has released its final data set: detailed maps of the infant universe showing the roiling clouds of hydrogen and helium gas that would one day coalesce into the stars and galaxies we see today. \n\n\nThe Atacama Cosmology Telescope is not the first to survey the cosmic microwave background (CMB), the light released 380,000 years after the Big Bang when the early universe's soup of particles formed atoms and space became transparent. But the data &mdash; posted as preprints online today &mdash; give researchers a new level of detail on the density of the gas clouds and how they were moving. \nAt the top of the page for Science's article is an image where different colors \"show areas where the polarization of the CMB light &mdash; its direction of vibration &mdash; differ, revealing how gases first move tangentially around areas of higher density (orange) and later fall ",
        "id": 2388530,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/22/0542234/this-is-the-sharpest-image-yet-of-our-universe-as-a-baby?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'This Is the Sharpest Image Yet of Our Universe As a Baby'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T12:11:09+00:00",
        "description": "Wired's web site \"is going to stop paywalling articles that are primarily based on public records obtained through the Freedom of Information Act,\" their global editorial director announced this week:\n\nThey're called public records for a reason, after all. And access to public documents is more important than ever at this moment, with government websites and records disappearing... [S]ome may argue that, from a business standpoint, not charging for stories primarily relying on public records automatically means fewer subscriptions and therefore less revenue. We disagree. \n\nSure, the FOIA process is time- and labor-intensive. Reporters face stonewalling, baseless denials, lengthy appeals processes, and countless other obstacles and delays. Investigative reports based on public records are among the most expensive stories to produce and share with the public... But while some readers might not subscribe to outlets that give away some of their best journalism for free, it's just as poss",
        "id": 2387581,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/23/0324221/wired-drops-paywalls-for-articles-based-on-public-records-requests-urges-other-sites-to-follow?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Wired' Drops Paywalls for Articles Based on Public Records Requests, Urges Other Sites to Follow",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T07:50:34+00:00",
        "description": "NASA is considering \"closing its headquarters and scattering responsibilities among the states,\" reports Politico, citing two people familiar with the plan.\n\n\"The proposal could affect up to 2,500 jobs and redistribute critical functions, including who manages space exploration and organizes major science missions.\"\nWhile much of the day-to-day work occurs at NASA's 10 centers, the Washington office plays a strategic role in lobbying for the agency's priorities in Congress, ensuring the White House supports its agenda and partnering with foreign countries on critical space projects. Some of the headquarter's offices might remain in Washington, the people said, but it's not clear which ones those would be or who would keep their jobs... \n\nOne of the biggest fallouts is the damage it could do to coordination among NASA leadership on pressing issues... It would also limit cooperation with international partners on space, which is often done through embassies in Washington. NASA works wi",
        "id": 2386597,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/22/223207/nasa-considers-eliminating-its-headquarters-in-washington-dc?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA Considers Eliminating Its Headquarters in Washington D.C.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T04:35:57+00:00",
        "description": "Hungary's Parliament not only voted to ban Pride events. They also voted to \"allow authorities to use facial recognition software to identify attenders and potentially fine them,\" reports the Guardian.\n\n[The nationwide legislation] amends the country's law on assembly to make it an offence to hold or attend events that violate Hungary's contentious \"child protection\" legislation, which bars any \"depiction or promotion\" of homosexuality to minors under the age of 18. The legislation was condemned by Amnesty International, which described it as the latest in a series of discriminatory measures the Hungarian authorities have taken against LGBTQ+ people... \nOrganisers said they planned to go ahead with the march in Budapest, despite the law's stipulation that those who attend a prohibited event could face fines of up to 200,000 Hungarian forints [&pound;425 or $549 U.S. dollars].\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/hom",
        "id": 2386153,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/22/2333213/hungary-to-use-facial-recognition-to-suppress-pride-march?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hungary To Use Facial Recognition to Suppress Pride March",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T02:26:02+00:00",
        "description": "\"Italy is using its Piracy Shield law to go after Google,\" reports Ars Technica, \"with a court ordering the Internet giant to immediately begin poisoning its public DNS servers\" to prevent people from reaching pirate streams of football games. \n\n\"Italy's communication regulator praises the ruling and hopes to continue sticking it to international tech firms.\"\nSpotted by TorrentFreak, AGCOM Commissioner Massimiliano Capitanio took to LinkedIn to celebrate the ruling, as well as the existence of the Italian Piracy Shield. \"The Judge confirmed the value of AGCOM's investigations, once again giving legitimacy to a system for the protection of copyright that is unique in the world,\" said Capitanio. Capitanio went on to complain that Google has routinely ignored AGCOM's listing of pirate sites, which are supposed to be blocked in 30 minutes or less under the law. He noted the violation was so clear-cut that the order was issued without giving Google a chance to respond, known as inaudita a",
        "id": 2385869,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/23/0043217/italy-demands-google-poison-its-public-dns-under-strict-piracy-shield-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Italy Demands Google Poison Its Public DNS Under Strict Piracy Shield Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T00:11:34+00:00",
        "description": "\"China is considering trying to blunt greater U.S. tariffs and other trade barriers,\" reports the Wall Street Journal, \"by offering to curb the quantity of certain goods exported to the U.S., according to advisers to the Chinese government.\"\nTokyo's adoption of so-called voluntary export restraints, or VERs, to limit its auto shipments to the U.S. in the 1980s helped prevent Washington from imposing higher import duties. A similar move from Beijing, especially in sectors of key concern to Washington, like electric vehicles and batteries, would mitigate criticism from the U.S. and others over China's \"economic imbalances\": heavily subsidized companies making stuff for slim profits but saturating global markets, to the detriment of other countries' manufacturers... \n\nThe Xi leadership has indicated a desire to cut a deal with the Trump administration to head off greater trade attacks... Similar to Japan, the Chinese advisers say, Beijing may also consider negotiating export restraints ",
        "id": 2385538,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/22/2227218/china-explores-limiting-its-ev-and-battery-exports-for-us-tariff-negotiations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Explores Limiting Its EV and Battery Exports For US Tariff Negotiations",
        "vote": 0
    }
]