[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T15:30:20+00:00",
        "description": "The stealth gaming genre has a long and hallowed history with greats like Metal Gear Solid, Splinter Cell, and Thief. While sequels for those titles remain MIA, we're still getting some significant remakes and new IPs that evolve on their fundamentals.\n\nOf course, there's far more to look forward to in 2025 and beyond. Sucker Punch's Ghost of Yotei takes us to a brand new setting with some intriguing new tools. Commandos: Origins marks a return for Jack O'Hara and his crew, exploring their early days and formation. Monaco 2 looks to bring its brand of co-op heisting and creative problem-solving to the forefront.\n\nThere's also Assassin's Creed Shadows, which impresses with its parkour and assassinations, and the upcoming Skin Deep, which combines sci-fi and immersive sim shenanigans into an over-the-top package. Check out some of the biggest stealth games coming soon.",
        "id": 2388900,
        "language": null,
        "link": "https://www.youtube.com/watch?v=xGJe3W26gP4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xGJe3W26gP4/hqdefault.jpg",
        "title": "15 NEW Stealth Games of 2025 And Beyond You ABSOLUTELY NEED TO PICK UP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-23T09:30:16+00:00",
        "description": "The long-awaited sequel to legendary real-time tactics-come-stealth originator Commandos is almost here. Commandos: Origins – the first entry in the series in nearly two decades – explores the elite covert-ops unit’s early days as they undertook daring missions deep behind enemy lines; missions no others dared undertake. \n\nFans of the original trio of games will recognize staples re-deployed here: blending each of the squad’s unique abilities, the options for stealth on display, and top-down isometric overview. Developer Claymore Game Studio have shoehorned in a few modern tweaks however, with this video aiming to outline all there is to know regarding Commandos: Origins before you load out into your first mission as iconic leader the Green Beret Jack O’Hara on April 9th.",
        "id": 2387063,
        "language": null,
        "link": "https://www.youtube.com/watch?v=lzTm9v2aipA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lzTm9v2aipA/hqdefault.jpg",
        "title": "Commandos Origins - 15 Things You NEED To Know Before You Buy",
        "vote": 0
    }
]