[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-04T15:53:21.502548+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-04T15:30:28+00:00",
        "description": "Gears of War: Reloaded is the upcoming remaster of one of Microsoft’s most seminal titles. When released in 2006, Gears of War’s impact was phenomenal; critically and commercially successful, the game is synonymous with the Xbox 360, shifting not only copies in their millions but propelling hardware sales too. \n\nNow, the unthinkable is happening: Gears of War is coming to PlayStation. Could this event signal the final ballast supporting platform exclusivity is crumbling? \n\nFor now, what’s reassuring with Reloaded landing on PS5 is that developer The Coalition have incorporated platform-native elements into the port: haptic feedback, PSSR support for the Pro, et cetera, reinforcing Microsoft’s dedication to a meaningful multi-platform strategy.",
        "id": 3249216,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=PxrlO2e60BI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PxrlO2e60BI/hqdefault.jpg",
        "title": "Why Gears of War: Reloaded's PS5 Release Is A Monumental Event For GAMERS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-04T13:43:24.007955+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-04T13:30:22+00:00",
        "description": "Looking for a stylish character action RPG without the need to perfectly parry everything in sight? The new Sony-led game, Action Soul Aside, may be exactly what you’re craving. Besides its spectacle action roots, it also has a helping of Final Fantasy DNA in its visual language. \n\nBut the title has gone through a long development period, originating as a solo project way back in 2014, the game finally caught the attention of Sony and has been gifted a larger studio and generous funding ever since. \n\nNow, with an hour or so of gameplay out in the wild, and a release date of August 29th to look forward to, action fans are keen to finally try out this ambitious and stylish RPG from Ultizero Games.\n\nNote: Some footage seen here was used via Gematsu and GamersPrey for representation purposes. Please note that they are still officially revealed footage through the publisher/developer of this game.",
        "id": 3248078,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=PkTuRMoHMrk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PkTuRMoHMrk/hqdefault.jpg",
        "title": "Lost Soul Aside PS5 - 15 Things You ABSOLUTELY Need To Know Before You Buy",
        "vote": 0
    }
]