[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T16:53:36.725412+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T16:01:18+00:00",
        "description": "What is the price of loyalty? Can it be measured monetarily? Will the sum of your achievements and sins directly contribute to bettering your life? Or is it a double-edged sword, one that could lead to a content soul and neverending nightmares in equal measure? For Die-Hardman, it's everything – the weight of his guilt, his reason for going on, and a prime example of how it can effectively transform a man. Spoilers follow for some of the core plot points of Death Stranding, so beware.\n\nVoiced by Tommie Earl Jenkins, Die-Hardman was always one of the most intriguing characters from his initial reveal. As the director of Bridges, he dons a skull mask that only shows the emotions in his eyes. The initial impression could be frightening, but that's not how he comes across after the first meeting. After Sam's disastrous corpse disposal mission sees him awakening in a Capital Knot City, he meets the director before conferring with his adoptive mother and president of the United Cities of Am",
        "id": 2963667,
        "language": null,
        "link": "https://www.youtube.com/watch?v=n3oApqH8Cr0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/n3oApqH8Cr0/hqdefault.jpg",
        "title": "Who Really Is Die-Hardman? - The Man Behind The Skull Mask - Before You Begin Death Stranding 2",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T14:40:29.261704+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T14:01:20+00:00",
        "description": "The countdown continues for Kojima Productions' Death Stranding 2: On the Beach, a sequel to the unorthodox but acclaimed 2019 action-adventure title. Sam Porter Bridges has returned, but the world is still as hazardous as ever. Whether it's surviving earthquakes, flash floods, Beached Things or the return of Higgs, players will be busier than ever.\n\nAnd to that effect, the sequel has much to offer. A new character named Neil, who Sam will venture to another world to meet and fight on more than one occasion. New threats in the form of the Armed Survivalists. A new continent, Australia, to explore and connect while dealing with its many challenges. That's not even factoring in all the new tools, quality-of-life changes, gameplay improvements, and improved pacing.\n\nOf course, given director Hideo Kojima's reputation, there are likely other surprises to look forward to. Check 15 new things you should know about Death Stranding 2: On the Beach before its launch on June 26th on PS5.",
        "id": 2962309,
        "language": null,
        "link": "https://www.youtube.com/watch?v=qbI5OMBf6so",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qbI5OMBf6so/hqdefault.jpg",
        "title": "Death Stranding 2 - 15 NEW Details You Absolutely NEED TO KNOW BEFORE YOU PURCHASE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T11:25:34.255932+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T10:30:19+00:00",
        "description": "The best part about Final Fantasy 16 being on Xbox is that more people can now play a genre-defining character action game. \n\nWhile it differs from its counterparts in its gameplay, it brings a masterful character action system to the table that creates remarkably enjoyable and satisfying gameplay that encourages you to keep trying new things and ensure there’s never a dull moment.",
        "id": 2960720,
        "language": null,
        "link": "https://www.youtube.com/watch?v=X-x7ATM7x28",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/X-x7ATM7x28/hqdefault.jpg",
        "title": "Final Fantasy 16 Xbox Review: A GOTY Contender (If Only It Hadn’t Launched Two Years Late)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T11:25:34.420268+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T10:30:14+00:00",
        "description": "If you ever wanted to simulate what it might be like to enter Hogwarts as a student, and perhaps fight a few dragons along the way, Hogwarts Legacy supplies that fantasy with some competent gameplay and a satisfying RPG structure. \n\nWhile Hogwarts Legacy on Switch 2 may not be that much different from other versions, it’s a noticeable improvement over the Switch 1 port with the support of PC-centric features like mouse controls.",
        "id": 2960721,
        "language": null,
        "link": "https://www.youtube.com/watch?v=HQ5oQR0HQ_A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HQ5oQR0HQ_A/hqdefault.jpg",
        "title": "Hogwarts Legacy Switch 2 Review - A Noticeable Improvement Over The Switch 1 Version",
        "vote": 0
    }
]