[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T00:04:06.124778+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T23:20:00+00:00",
        "description": "Midjourney has launched its first AI video generation model, V1, which turns images into short five-second videos with customizable animation settings. While it's currently only available via Discord and on the web, the launch positions the popular AI image generation startup in direct competition with OpenAI's Sora and Google's Veo. TechCrunch reports: While many companies are focused on developing controllable AI video models for use in commercial settings, Midjourney has always stood out for its distinctive AI image models that cater to creative types. The company says it has larger goals for its AI video models than generating B-roll for Hollywood films or commercials for the ad industry. In a blog post, Midjourney CEO David Holz says its AI video model is the company's next step towards its ultimate destination, creating AI models \"capable of real-time open-world simulations.\" After AI video models, Midjourney says it plans to develop AI models for producing 3D renderings, as wel",
        "id": 2966890,
        "language": null,
        "link": "https://slashdot.org/story/25/06/18/1935234/midjourney-launches-its-first-ai-video-generation-model-v1?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Midjourney Launches Its First AI Video Generation Model, V1",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T23:00:25.299386+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T22:40:00+00:00",
        "description": "Austria's coalition government has agreed on a plan to enable police to monitor suspects' secure messaging in order to thwart militant attacks, ending what security officials have said is a rare and dangerous blind spot for a European Union country. From a report: Because Austria lacks a legal framework for monitoring messaging services like WhatsApp, its main domestic intelligence service and police rely on allies with far more sweeping powers like Britain and the United States alerting them to chatter about planned attacks and spying. \n\nThat kind of tip-off led to police unravelling what they say was a planned attack on a Taylor Swift concert in Vienna, which prompted the cancellation of all three of her planned shows there in August of last year. \"The aim is to make people planning terrorist attacks in Austria feel less secure - and increase everyone else's sense of security,\" Joerg Leichtfried of the Social Democrats, the junior minister in charge of overseeing the Directorate for",
        "id": 2966516,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/18/1930216/austrian-government-agrees-on-plan-to-allow-monitoring-of-secure-messaging?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Austrian Government Agrees On Plan To Allow Monitoring of Secure Messaging",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T23:00:25.471018+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from TorrentFreak: Napster, the brand synonymous with the music piracy boom of the early 2000s, has a new copyright challenge. Together with audio giant Sonos, Napster faces a lawsuit demanding over $3.4 million in alleged unpaid copyright royalties. Filed by collective rights management organization SoundExchange, the complaint (PDF) centers on missed payments related to the \"Sonos Radio\" service, which until 2023 was powered by Napster's music catalog. [...]\n \nSonos Radio launched in April 2020 with Napster as the authorized agent, submitting the required royalty reports and royalties to SoundExchange. While all went well initially, payments stopped around May 2022. At the time, Napster had been acquired by venture capital firms Hivemind and Algorand, with a focus on \"web3\" technologies, including cryptocurrencies and blockchain. According to the complaint, the takeover resulted in a \"complete breakdown of reporting and payment for the Sonos Radio",
        "id": 2966517,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/18/1921253/napster-and-sonos-sued-for-millions-in-unpaid-music-royalties?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Napster and Sonos Sued For Millions In Unpaid Music Royalties",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T21:54:45.861464+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T21:20:00+00:00",
        "description": "Facebook now supports passkeys for login, offering users a more secure, phishing-resistant alternative to passwords by using biometrics or a PIN stored on their device. The feature is rolling out to iOS and Android \"soon,\" while Messenger will get the feature \"in the coming months.\" Lifehacker reports: Meta seems pretty excited about the news -- and not just because the company happens to be a member of the FIDO Alliance, the organization that developed passkeys. Aside from logging into your Facebook account, Meta says you'll be able to use passkeys to autofill your payment info when buying things with Meta Pay. You'll also be able to use the same passkey between both Facebook and Messenger, and your passkey will act as a key to lock out your encrypted Messenger chats.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Facebook+Now+Supports+Passkeys%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F06%2F18%2F1917222%2F%3",
        "id": 2966141,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/18/1917222/facebook-now-supports-passkeys?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Facebook Now Supports Passkeys",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T20:48:42.973767+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T20:40:00+00:00",
        "description": "Waymo plans to relaunch its robotaxi service in New York City, starting with safety driver testing while lobbying to change state law to eventually allow fully autonomous vehicles without human operators. The company has applied for a permit and will begin mapping in Manhattan, though legislative hurdles and skepticism from lawmakers remain. The Verge reports: A bill was introduced in the New York State Legislature earlier this year that would permit autonomous vehicles without safety drivers \"provided that the automated driving system is engaged and the vehicle meets certain conditions.\" The bill is currently under consideration by the state Senate's transportation committee.\n \nNew York City also has some of the most dangerous, congested, and poorly managed streets in the world. They are also full of construction workers, pedestrians, bicyclists, and double- and sometimes even triple-parked cars. In theory, this would make it very difficult for an autonomous vehicle to navigate, give",
        "id": 2965672,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/18/1912202/waymos-robotaxis-are-coming-back-to-new-york-city?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymo's Robotaxis Are Coming Back to New York City",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T20:48:43.144969+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T20:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: YouTube CEO Neal Mohan has announced that the Google Veo 3 AI video generator will be integrated with YouTube Shorts later this summer. According to Mohan, YouTube Shorts has seen a rise in popularity even compared to YouTube as a whole. The streaming platform is now the most watched source of video in the world, but Shorts specifically have seen a massive 186 percent increase in viewership over the past year. Mohan says Shorts now average 200 billion daily views.\n \nYouTube has already equipped creators with a few AI tools, including Dream Screen, which can produce AI video backgrounds with a text prompt. Veo 3 support will be a significant upgrade, though. At the Cannes festival, Mohan revealed that the streaming site will begin offering integration with Google's leading video model later this summer. \"I believe these tools will open new creative lanes for everyone to explore,\" said Mohan. [...]\n \nWhile you can add Veo 3 videos (",
        "id": 2965673,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/18/197203/googles-frighteningly-good-veo-3-ai-videos-to-be-integrated-with-youtube-shorts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's Frighteningly Good Veo 3 AI Videos To Be Integrated With YouTube Shorts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T19:43:42.724321+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T19:22:00+00:00",
        "description": "Microsoft is planning to ax thousands of jobs, particularly in sales, as part of the company's latest move to trim its workforce amid heavy spending on AI. From a report: The cuts are expected to be announced early next month [non-paywalled source], following the end of Microsoft's fiscal year, according to people familiar with the matter. The reductions won't exclusively affect sales teams, and the timing could still change, said the people, who requested anonymity to discuss a private matter. The terminations would follow a previous round of layoffs in May that hit 6,000 people and fell hardest on product and engineering positions, largely sparing customer-facing roles like sales and marketing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Planning+Thousands+More+Job+Cuts+Aimed+at+Salespeople%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F06%2F18%2F1855243%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitt",
        "id": 2965178,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/18/1855243/microsoft-planning-thousands-more-job-cuts-aimed-at-salespeople?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Planning Thousands More Job Cuts Aimed at Salespeople",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T19:43:42.897029+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T18:41:00+00:00",
        "description": "Investigators believe Air India Flight 171 had an emergency-power generator operating when it crashed last week, raising questions about whether the plane's engines functioned properly during takeoff. WSJ: The preliminary finding [non-paywalled source], according to people familiar with the probe, gives investigators a new line of inquiry as they study a crash that killed all but one of the plane's passengers. In all, at least 270 people died following the crash, including some on the ground in the western Indian city of Ahmedabad. \n\nThe emergency system is known as a ram air turbine. It is a small propeller that drops from the bottom of the 787 Dreamliner's fuselage to serve as a backup generator. Engines normally produce electricity for an aircraft and help run its flight-control systems. The power generated by the RAT can enable crucial aircraft components to function. The system can deploy automatically in flight if both engines have failed or if all three hydraulic system pressur",
        "id": 2965179,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/18/1759205/boeing-787s-emergency-power-system-likely-active-before-air-india-crash?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Boeing 787's Emergency-Power System Likely Active Before Air India Crash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T18:38:40.312640+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T18:00:00+00:00",
        "description": "The NFC Forum has released NFC Release 15 (that's what it's calling it), extending the operating range of Near Field Communication connections from 0.5 centimeters to 2 centimeters -- a fourfold increase that reduces the precision required for device alignment. \n\nThe global standards body, whose board includes representatives from Apple, Google, Huawei, Infineon, NXP, Sony, and ST Microelectronics, designed the enhancement to accelerate transaction speeds and improve reliability across NFC-enabled devices. The expanded range addresses technical challenges in smaller form-factor devices like wearables and smartphones while maintaining compatibility with existing ISO/IEC 14443 standards. \n\nThe standard also incorporates support for NFC Digital Product Passport specifications, allowing single NFC tags embedded in products to store and transmit sustainability data throughout their lifecycle.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitt",
        "id": 2964733,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/06/18/1640225/nfc-release-15-extends-tap-to-pay-range-from-05cm-to-2cm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NFC Release 15 Extends Tap-to-Pay Range From 0.5cm To 2cm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T17:33:43.880192+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T17:20:00+00:00",
        "description": "Microsoft is positioning Windows as the primary gaming platform for Xbox, according to Xbox president Sarah Bond. \"We're working closely with the Windows team to ensure that Windows is the number one platform for gaming,\" Bond said in a video announcing a partnership with AMD for next-generation Xbox hardware spanning consoles and handhelds. \n\nThe statement, PCWorld points out, aligns with Microsoft's recent \"This is an Xbox\" marketing campaign, which promotes phones, PCs, televisions, and traditional consoles as Xbox devices. The company's newly announced Xbox Ally X handheld runs Windows beneath its Xbox interface, allowing access to multiple game stores unlike Valve's Steam Deck. \n\nMicrosoft has shifted strategy following weak Xbox console sales compared to PlayStation, spending billions to acquire publishers including Bethesda and Activision Blizzard while expanding Xbox Cloud Gaming services across multiple device types.<p><div class=\"share_submission\" style=\"position:relative;\">",
        "id": 2964199,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/18/174256/xbox-president-were-working-to-ensure-windows-is-the-number-one-platform-for-gaming?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Xbox President: We're Working To Ensure Windows Is the Number One Platform For Gaming",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T17:33:44.083561+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T16:40:00+00:00",
        "description": "Swiss Re has identified extreme heat as a significant insurance threat in its latest annual report on emerging risks with the Zurich-based reinsurer noting that up to half a million people globally die from extreme heat effects each year. The death toll exceeds the combined impact of floods, earthquakes and hurricanes. Heat waves contributed to conditions that generated $78.5 billion in insured wildfire losses globally from 2015-2024, Swiss Re reported. \n\nThe Los Angeles wildfires this year could add up to $45 billion in insured losses, according to UCLA Anderson School of Business estimates. The insurance industry has historically underestimated heat-related costs because damages spread across multiple policy types rather than appearing as a single category. Construction firms face rising medical insurance and workers compensation claims when outdoor workers suffer heat injuries, plus potential liability for inadequate cooling breaks.<p><div class=\"share_submission\" style=\"position:r",
        "id": 2964200,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/18/1550243/insurers-want-businesses-to-wake-up-to-costs-of-extreme-heat?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Insurers Want Businesses to Wake Up to Costs of Extreme Heat",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T16:28:40.932910+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T16:01:00+00:00",
        "description": "The UK Information Commissioner's Office has issued its first guidance demanding manufacturers of air fryers, smart speakers, fertility trackers, and smart TVs respect users' privacy rights after reports of excessive data collection in homes. \n\nThe regulator requires companies to ensure data security, provide transparency to consumers, and regularly delete collected information. Stephen Almond, the ICO's executive director for regulatory risk, said smart products know who users live with, their music preferences, and medication details. The guidance addresses \"internet of things\" devices, including fertility trackers that record menstrual dates and body temperature before sending data to manufacturer servers. \n\nAdditionally, smart speakers that monitor family members and visitors must allow users to configure settings that minimize personal information collection. The ICO warned manufacturers it stands ready to take enforcement action in the event of noncompliance.<p><div class=\"share",
        "id": 2963527,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/18/152236/british-watchdog-cracks-down-on-data-collection-by-smart-tvs-speakers-and-air-fryers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "British Watchdog Cracks Down on Data Collection by Smart TVs, Speakers And Air Fryers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T16:28:41.103418+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T15:22:00+00:00",
        "description": "Nature will automatically publish peer review reports and author responses alongside all newly submitted research papers starting this week. The flagship scientific journal previously offered transparent peer review as an optional service since 2020, while Nature Communications has required it since 2016. \n\nAll exchanges between authors and anonymous reviewers will become publicly accessible (reviewer identities remain confidential unless they choose disclosure). Nature aims to open what it calls the \"black box\" of science by revealing the months-long conversations that shape research papers before publication.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nature+Journal+Mandates+Public+Peer+Review+For+All+New+Research+Papers%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F06%2F18%2F1452206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"",
        "id": 2963528,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/18/1452206/nature-journal-mandates-public-peer-review-for-all-new-research-papers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nature Journal Mandates Public Peer Review For All New Research Papers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T15:23:41.124902+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T14:44:00+00:00",
        "description": "Starting in summer 2026, Netflix subscribers in France will be able to watch commercially broadcast TV content \"without ever having to leave the service.\" The Verge adds: The streaming giant has announced a distribution deal with French media company TF1 Group to make TF1's free-to-air live TV channels and on-demand TF1 Plus streaming content available to French Netflix users as part of their existing subscription plan.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Netflix+Will+Air+Traditional+TV+Channels+in+France%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F06%2F18%2F1443245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F06%2F18%2F1443245%2Fnetflix-will-air-traditional-tv-channels-in-france%3Futm_source%3Dslashdot%26utm",
        "id": 2962927,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/06/18/1443245/netflix-will-air-traditional-tv-channels-in-france?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Netflix Will Air Traditional TV Channels in France",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T14:18:43.353142+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T14:00:00+00:00",
        "description": "U.S. public companies have cut their white-collar workforces by 3.5% over the past three years, marking a fundamental shift in corporate philosophy that views fewer employees as a path to faster growth. One in five S&amp;P 500 companies now employ fewer people than they did a decade ago, according to employment data-provider Live Data Technologies. \n\nThe reductions extend beyond typical cost-cutting measures and coincide with record corporate profits at the end of last year. Amazon CEO Andy Jassy told employees Tuesday that AI will eliminate certain jobs in coming years, while Procter &amp; Gamble announced plans to cut 7,000 positions to create \"broader roles and smaller teams.\" \n\nBank of America reduced its workforce from 285,000 in 2010 to 213,000 today while revenues climbed 18% over the past decade. Managers have faced particularly steep cuts, with their ranks falling 6.1% between May 2022 and May 2025. Companies are flattening organizational structures and pushing remaining empl",
        "id": 2962249,
        "language": null,
        "link": "https://slashdot.org/story/25/06/18/1245216/the-biggest-companies-across-america-are-cutting-their-workforces?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Biggest Companies Across America Are Cutting Their Workforces",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T13:13:44.606572+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T13:00:00+00:00",
        "description": "DC Studios co-head James Gunn argues that the movie industry is \"dying\" primarily because productions begin before screenplays are complete, while also delivering a sharp critique of his former employer Marvel Studios, which he claims Disney has \"killed\" through output mandates. \n\nGunn dismissed common explanations for Hollywood's struggles like declining theater attendance or improved home viewing experiences, telling Rolling Stone that \"the number one reason is because people are making movies without a finished screenplay.\" The filmmaker has implemented a strict rule at DC Studios requiring finished scripts before production starts, recently scrapping a project because its screenplay wasn't ready. \n\nThe director, who previously helmed three \"Guardians of the Galaxy\" films for Marvel, said Disney's corporate directive to increase output destroyed the studio's creative process. \"They were under a corporate mandate, yeah. That wasn't fair. It wasn't right. And it killed them,\" Gunn sa",
        "id": 2961631,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/06/18/0245223/dc-studios-chief-says-movie-industry-is-dying-claims-disney-killed-marvel-with-output-mandates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DC Studios Chief Says Movie Industry Is 'Dying,' Claims Disney 'Killed' Marvel With Output Mandates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T12:08:43.321503+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T11:01:00+00:00",
        "description": "OpenAI CEO Sam Altman accused Meta of attempting to poach his developers with $100 million sign-on bonuses and higher compensation packages as the social media giant races to catch up in AI race. Altman said Meta, which has a $1.8 trillion market capitalization, began making the offers to his team members after falling behind in AI efforts. \"I've heard that Meta thinks of us as their biggest competitor,\" Altman said on the Uncapped podcast [video] hosted by his brother. \n\nNone of his \"best people\" had accepted Zuckerberg's offers, he said. Meta has been recruiting top researchers and engineers from rival companies to build a new \"superintelligence\" team focused on developing AGI. The Facebook parent company has struggled this year to match competitors, facing criticism over its Llama 4 language model and delaying its flagship \"Behemoth\" AI model.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Altman+Says+Meta+Target",
        "id": 2961168,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/18/0751230/altman-says-meta-targeting-openai-staff-with-100-million-bonuses-as-ai-race-intensifies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Altman Says Meta Targeting OpenAI Staff With $100 Million Bonuses as AI Race Intensifies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T09:58:41.174738+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T09:00:00+00:00",
        "description": "An anonymous reader shares a report: Microsoft has a long history of being criticized for coming up with clunky product names, and for changing them so often it's hard for customers to keep up. The company's own employees once joked in a viral video that the iPod would have been called the \"Microsoft I-pod Pro 2005 XP Human Ear Professional Edition with Subscription\" had it been created by Microsoft. The latest gripe among some employees and customers: The company's tendency to slap \"Copilot\" on everything AI. \n\n\"There is a delusion on our marketing side where literally everything has been renamed to have Copilot it in,\" one employee told Business Insider late last year. \"Everything is Copilot. Nothing else matters. They want a Copilot tie-in for everything.\" Now, an advertising watchdog is weighing in. The Better Business Bureau's National Advertising Division reviewed Microsoft's advertising for its Copilot AI tools. NAD called out Microsoft's \"universal use of the product descripti",
        "id": 2960228,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/18/0227224/microsoft-is-calling-too-many-things-copilot-watchdog-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Is Calling Too Many Things 'Copilot,' Watchdog Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T07:48:43.919560+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T07:00:00+00:00",
        "description": "Field Notes, the analog notebook company that began as designer Aaron Draplin's side project 20 years ago, has sold over 10 million notebooks and operates in 2,000 stores worldwide, co-founder Jim Coudal told Fast Company. The Chicago-based company, which Coudal says just completed its best year for sales and revenue with 2025 tracking to exceed those numbers, has grown from selling 13 notebooks on its launch day to producing quarterly edition runs of 30,000 to 60,000 packs. The brand's subscription model, launched in 2009 with 1,500-pack print runs, now encompasses 67 limited editions and provides both predictable cash flow and regular customer engagement opportunities for the company.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Field+Notes+Went+From+Side+Project+To+Cult+Notebook%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F06%2F17%2F2128231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https:",
        "id": 2959555,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/17/2128231/field-notes-went-from-side-project-to-cult-notebook?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Field Notes Went From Side Project To Cult Notebook",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T04:33:38.100596+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Time Magazine: While AI could offer transformative benefits, without proper safeguards it could facilitate nuclear and biological threats and cause \"potentially irreversible harms,\" a new report commissioned by California Governor Gavin Newsom has warned. \"The opportunity to establish effective AI governance frameworks may not remain open indefinitely,\" says the report, which was published on June 17 (PDF). Citing new evidence that AI can help users source nuclear-grade uranium and is on the cusp of letting novices create biological threats, it notes that the cost for inaction at this current moment could be \"extremely high.\" [...]\n \n\"Foundation model capabilities have rapidly advanced since Governor Newsom vetoed SB 1047 last September,\" the report states. The industry has shifted from large language AI models that merely predict the next word in a stream of text toward systems trained to solve complex problems and that benefit from \"inference",
        "id": 2958763,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/17/214215/california-ai-policy-report-warns-of-irreversible-harms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California AI Policy Report Warns of 'Irreversible Harms'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T02:25:18.160596+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T02:10:00+00:00",
        "description": "In response to escalating tensions with Israel, Iran has begun throttling internet access, with plans to disconnect from the global internet entirely to prevent Israeli cyberattacks. The Iranian government also urges citizens to delete WhatsApp -- one of the country's most popular messaging platforms -- claiming without evidence that the Meta-owned app has been weaponed by Israel to spy on its users. (WhatsApp vehemently denied those claims in a statement to the Associated Press.) Telegram is also said to be blocked as well. The Verge reports: The announcements come amidst the escalating war between Iran and Israel, which broke out after Israel attacked the country on June 12th, and a rise in reported internet outages. Civilians have claimed that they've been unable to access basic but critical telecommunications services, such as messaging apps, maps, and sometimes the internet itself. Cloudflare reported that two major Iranian cellular carriers effectively went offline on Tuesday, a",
        "id": 2958263,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/18/0059207/iran-is-going-offline-to-prevent-purported-israeli-cyberattacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Iran Is Going Offline To Prevent Purported Israeli Cyberattacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T02:25:18.336170+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T01:30:00+00:00",
        "description": "The U.S. Senate has approved the GENIUS Act with a 68-30 final vote that \"saw a huge surge of Democrats joining their Republican counterparts,\" reports CoinDesk. What the bill sets out to do is create the first federal regulatory framework for U.S. stablecoins, requiring issuers to maintain full 1:1 reserves in cash or Treasuries, adhere to regular audits and anti-money laundering rules, and gain regulatory approval -- all while allowing foreign stablecoin access under strict oversight rules. From the report: As written, the bill would set up guardrails around the approval and supervision of U.S. issuers of stablecoins, the dollar-based tokens such as the ones backed by Circle, Ripple and Tether. Firms making these digital assets available to U.S. users would have to meet stringent reserve demands, transparency requirements, money-laundering compliance and regulatory supervision that's also likely to include new capital rules. \"This is a win for the U.S., a win for innovation and a mo",
        "id": 2958264,
        "language": null,
        "link": "https://slashdot.org/story/25/06/18/0036236/senate-passes-stablecoin-bill-in-major-win-for-crypto-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Senate Passes Stablecoin Bill In Major Win For Crypto Industry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T01:18:43.230076+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T00:50:00+00:00",
        "description": "President Trump will extend the deadline for ByteDance to divest TikTok's U.S. operations by another 90 days, marking the third extension since taking office. The extension aims to prevent a TikTok ban while negotiations with potential buyers like Oracle and Project Liberty continue. CNBC reports: \"President Trump will sign an additional Executive Order this week to keep TikTok up and running,\" White House Press Secretary Karoline Leavitt said in a statement. \"As he has said many times, President Trump does not want TikTok to go dark. This extension will last 90 days, which the Administration will spend working to ensure this deal is closed so that the American people can continue to use TikTok with the assurance that their data is safe and secure.\"\n \nByteDance was nearing the deadline of June 19, to sell TikTok's U.S. operations in order to satisfy a national security law that the Supreme Court upheld just a few days before Trump's second presidential inauguration. Under the law, app",
        "id": 2958062,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/18/0044213/trump-extends-tiktok-deadline-for-third-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Extends TikTok Deadline For Third Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-18T01:18:43.402398+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-18T00:10:00+00:00",
        "description": "An anonymous reader shares a report: [...] the rise in China of open technology, which relies on transparency and decentralisation, is awkward for an authoritarian state. If the party's patience with open-source fades, and it decides to exert control, that could hinder both the course of innovation at home, and developers' ability to export their technology abroad. \n\nChina's open-source movement first gained traction in the mid-2010s. Richard Lin, co-founder of Kaiyuanshe, a local open-source advocacy group, recalls that most of the early adopters were developers who simply wanted free software. That changed when they realised that contributing to open-source projects could improve their job prospects. Big firms soon followed, with companies like Huawei backing open-source work to attract talent and cut costs by sharing technology. \n\nMomentum gathered in 2019 when Huawei was, in effect, barred by America from using Android. That gave new urgency to efforts to cut reliance on Western t",
        "id": 2958063,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/17/2123211/why-china-is-giving-away-its-tech-for-free?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why China is Giving Away Its Tech For Free",
        "vote": 0
    }
]