[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-05T15:30:16+00:00",
        "description": "The Dynasty Warriors games may not be high art, and the series' quality has certainly declined over time, but even so, the appeal of musou action games is undeniable. \n\nAfter a bit of a hiatus, Dynasty Warriors is set to return soon with Dynasty Warriors: Origins, a game that is simultaneously looking like a familiar return to roots and a fresh beginning for the franchise, and as we count the days down to its launch, here, we're going to go over the key details that you should know about it.",
        "id": 1838196,
        "language": null,
        "link": "https://www.youtube.com/watch?v=qnNWuWHG1aM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qnNWuWHG1aM/hqdefault.jpg",
        "title": "Dynasty Warriors: Origins - 15 Things YOU ABSOLUTELY NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-05T13:30:07+00:00",
        "description": "Sony has been on a tear since the PlayStation 5 hit the market in November 2020. It shipped over 65.5 million consoles in its lifetime and delivered award-winning hits like Horizon Forbidden West, Helldivers 2, and Astro Bot. When considering how successful its previous generation turned out, it's not too surprising.\n\nHowever, those looking back on PlayStation's past can attest to more than its fair number of fumbles, and that's no different since the PS5 launched. For surprise hits like the PlayStation Portal, we've seen underwhelming hardware launches like PlayStation VR2. As successful as Helldivers 2 became, Concord marked a significant failure, to say nothing of all the cancelled live-service games.\n\nSo, while Sony can break records and impress with its repertoire of first-party titles, its stature doesn't make it immune to the occasional crash or 15. Here are some of its biggest failures over the years.",
        "id": 1837699,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DEn063d6q1k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DEn063d6q1k/hqdefault.jpg",
        "title": "15 MASSIVE PLAYSTATION FAILURES Sony Wants You To Forget",
        "vote": 0
    }
]