[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-02T15:55:02.688912+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-02T15:30:00+00:00",
        "description": "There's something about MindsEye, Build A Rocket Boy's debut effort. It was announced after Everywhere, the creation toolset/social gaming platform, but launches first despite being a part of it (though its main building tool, Arcadia, is confusingly included).\n\nLaunching on June 10th for Xbox Series X/S, PS5, and PC, it's an action-adventure game in the vein of Mafia or Grand Theft Auto without the open-world elements. Shooting, driving, and shooting while driving make up a significant portion of the gameplay loop. The last thing expected from this \"20ish\" hours journey is that it's the middle point of a grand narrative that goes 10,000 years into the past and somewhere into the future.\n\nConfused? Well, Leslie Benzies, director and studio founder, revealed an overarching ten-year plan, which involves an open-world multiplayer sequel launching next year and an open-world free-roam title to bridge the gap. That's only scratching the surface, mind you. Join us as we dive into more and w",
        "id": 2829741,
        "language": null,
        "link": "https://www.youtube.com/watch?v=0uol_CJUSac",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0uol_CJUSac/hqdefault.jpg",
        "title": "MindsEye's 10 Year Plan Sounds MASSIVE, But Can The Studio Deliver?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-02T14:48:13.988428+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-02T13:30:29+00:00",
        "description": "Games, like other narrative media, have a defined structure. That structure may be composed of an beginning, middle, and conclusion, but some of the more creative games opt to do something different. These 10 games alter their gameplay structure or story rather significantly after the introductory hour, leading to an unexpected and intriguing experience. \n\nIt should be noted that what constitutes an hour may change based on playstyle. Speedrunners can blaze through the opening section of Prey rather quick while the more leisurely player spends time reading every note. The spirit of this list lies in a game’s ability to switch up its structure and narrative after the intro section, contrasting its intro with the rest of the game in a big way.",
        "id": 2829188,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cZGsuBBhj3Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cZGsuBBhj3Y/hqdefault.jpg",
        "title": "10 SINGLE PLAYER Games That CHANGE COMPLETELY After The First Hour",
        "vote": 0
    }
]