[
    {
        "age": null,
        "album": "",
        "author": "Universal Pictures",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-02T18:16:06.435737+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-02T17:01:04+00:00",
        "description": "How To Train Your Dragon - In Theaters June 13\n\nFrom three-time Oscar® nominee and Golden Globe winner Dean DeBlois, the creative visionary behind DreamWorks Animation’s acclaimed How to Train Your Dragon trilogy, comes a stunning live-action reimagining of the film that launched the beloved franchise. \n\nOn the rugged isle of Berk, where Vikings and dragons have been bitter enemies for generations, Hiccup (Mason Thames; The Black Phone, For All Mankind) stands apart. The inventive yet overlooked son of Chief Stoick the Vast (Gerard Butler, reprising his voice role from the animated franchise), Hiccup defies centuries of tradition when he befriends Toothless, a feared Night Fury dragon. Their unlikely bond reveals the true nature of dragons, challenging the very foundations of Viking society. \n\nWith the fierce and ambitious Astrid (BAFTA nominee Nico Parker; Dumbo, The Last of Us) and the village’s quirky blacksmith Gobber (Nick Frost; Snow White and the Huntsman, Shaun of the Dead) by",
        "id": 2830920,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oTM_9SxXRQw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 598,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCq0OueAsdxH6b8nyAspwViw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oTM_9SxXRQw/hqdefault.jpg",
        "title": "How To Train Your Dragon | Epic Universe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Universal Pictures",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-02T15:37:58.262880+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-02T15:00:15+00:00",
        "description": "The murderous doll who captivated pop culture in 2023 is back. And this time she’s not alone.\n\nThe original creative team behind that phenomenon—led by horror titans James Wan for Atomic Monster, Jason Blum for Blumhouse and writer-director Gerard Johnstone—reboot an all-new wild chapter in A.I. mayhem with M3GAN 2.0.\n\nTwo years after M3GAN, a marvel of artificial intelligence, went rogue and embarked on a murderous (and impeccably choreographed) rampage and was subsequently destroyed, M3GAN’s creator Gemma (Allison Williams) has become a high-profile author and advocate for government oversight of A.I. Meanwhile, Gemma’s niece Cady (Violet McGraw), now 14, has become a teenager, rebelling against Gemma’s overprotective rules.\n\nUnbeknownst to them, the underlying tech for M3GAN has been stolen and misused by a powerful defense contractor to create a military-grade weapon known as Amelia (Ivanna Sakhno; Ahsoka, Pacific Rim: Uprising), the ultimate killer infiltration spy. But as Amelia",
        "id": 2829680,
        "language": null,
        "link": "https://www.youtube.com/watch?v=1FeiTZMtwLA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 598,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCq0OueAsdxH6b8nyAspwViw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1FeiTZMtwLA/hqdefault.jpg",
        "title": "M3GAN 2.0 | Final Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Universal Pictures",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-02T00:50:45.120146+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-02T00:30:53+00:00",
        "description": "The phone is ringing again. Following the blockbuster success of Blumhouse’s 2022 horror phenomenon, which earned more than $160 million worldwide and global critical acclaim, Universal Pictures announces the launch of a sinister new franchise with the release of Black Phone 2.\n\nEthan Hawke, Mason Thames, Madeleine McGraw, Jeremy Davies and Miguel Mora return for the film’s sequel, that will be directed by Scott Derrickson and is written by C. Robert Cargill and Derrickson.\n\nThe film will be produced by Jason Blum for Blumhouse, Scott Derrickson & C. Robert Cargill. Joe Hill and Ryan Turek are executive producer. Universal and Blumhouse will present the Crooked Highway Production.\n\nGenre: Horror\nCast: Ethan Hawke, Mason Thames, Madeleine McGraw, Jeremy Davies, Miguel Mora\nDirector: Scott Derrickson\nWritten by: C. Robert Cargill, Scott Derrickson\nProducers: Jason Blum, Scott Derrickson, C. Robert Cargill\n\nFollow Black Phone on socials:\nhttps://www.instagram.com/blackphonemovie/ \nhttps:",
        "id": 2824963,
        "language": null,
        "link": "https://www.youtube.com/watch?v=v0kqkRZHqk4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 598,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCq0OueAsdxH6b8nyAspwViw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/v0kqkRZHqk4/hqdefault.jpg",
        "title": "Black Phone 2 | Official Trailer",
        "vote": 0
    }
]