[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-15T16:00:16+00:00",
        "description": "Bandai Namco has delivered a thorough remaster of one of Tales’ best entries. Aside from the usual graphics touch-ups, this package comes with a collection of additional conveniences. Players can fine-tune the gameplay experience almost any way they desire. Encounters can be turned off with a toggle, and the suite of Grade options available at the start put all control in the player’s hands.\n\nTales of Graces is worth playing even regardless of these additions due to its timeless political plot and deft weaving of character relationships throughout it all. The series is known for its character-centric skits and this is no different, containing a whopping 400 or so in total with a voice cast including industry vets Laura Bailey and Cassandra Lee Morris to name a few. \n\nThe combat relies on the exploitation of enemy weaknesses and clever building of character Titles. There are well over 500 titles for party members in this game, conferring stat buffs, new skill arts, and various other g",
        "id": 1910829,
        "language": null,
        "link": "https://www.youtube.com/watch?v=LviUIMDq_0A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LviUIMDq_0A/hqdefault.jpg",
        "title": "Tales of Graces f Remastered Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-15T13:30:31+00:00",
        "description": "With official news on the Switch 2 set to arrive before the end of Nintendo’s current financial year (that is, by April 2025), now is a great time to assess the exceptional collection of single player games Nintendo’s revolutionary console-handheld hybrid harbours, for its arguably the best mix of platform exclusives and third-party experiences Nintendo has ever held on one of its consoles. \n\nWhilst the Switch – and indeed Nintendo as a whole – tends to lean more towards younger audiences, the games on this rundown demonstrate a breadth of titles that truly are for anyone. Remarkably too, the games here – much like all Switch games, to be honest – function just as well in the palm of your hands as they do when beaming out of your widescreen TVs.",
        "id": 1909313,
        "language": null,
        "link": "https://www.youtube.com/watch?v=VxPw9T-5uS0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VxPw9T-5uS0/hqdefault.jpg",
        "title": "Top 15 ULTIMATE SINGLE-PLAYER SWITCH GAMES You Need To Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-15T10:00:52+00:00",
        "description": "The anticipation for a new game release has changed dramatically these past few years. Where in the past, publishers were willing to announce major games years in advance, now a lot of the anticipation for a new game is simply waiting for it to be confirmed and shown. \n\nWith a whole new year of video games ahead of us, here, we take a look at 15 probable games that stand a good chance of getting announced – or, if already announced, properly revealed – in the coming year. With so many big developers and franchises gearing up for their next major releases, 2025 promises to be an exciting one in terms of the new titles and projects we expect to see announced and elaborated on.",
        "id": 1907970,
        "language": null,
        "link": "https://www.youtube.com/watch?v=khJhMrmx13o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/khJhMrmx13o/hqdefault.jpg",
        "title": "15 BIG Game Announcements of 2025 That Will HAVE US LOSING IT",
        "vote": 0
    }
]