[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T23:06:23.623029+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T22:40:00+00:00",
        "description": "Since filing for bankruptcy in March, 23andMe has received data deletion requests from 1.9 million users -- around 15% of its customer base. That number was revealed by 23andMe's interim chief executive Joseph Selsavage during a House Oversight Committee hearing, during which lawmakers scrutinized the company's sale following an earlier bankruptcy auction. \"The bankruptcy sparked concerns that the data of millions of Americans who used 23andMe could end up in the hands of an unscrupulous buyer, prompting customers to ask the company to delete their data,\" adds TechCrunch. From the report: Pharmaceutical giant Regeneron won the court-approved auction in May, offering $256 million for 23andMe and its banks of customers' DNA and genetic data. Regeneron said it would use the 23andMe data to aid the discovery of new drugs, and committed to maintain 23andMe's privacy practices. Truly deleting your personal genetic information from the DNA testing company is easier said than done. But if you",
        "id": 2909348,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/11/214242/23andme-says-15-of-customers-asked-to-delete-their-genetic-data-since-bankruptcy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "23andMe Says 15% of Customers Asked To Delete Their Genetic Data Since Bankruptcy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T23:06:23.779875+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Polygon: Nintendo Switch 2 is off to a roaring start. Early on Wednesday, Nintendo announced that it had sold 3.5 million units of its new console in just four days, making it Nintendo's fastest-selling console ever. In fact, this is likely the biggest console launch of all time -- by quite some margin. For comparison, PlayStation 5 shipped 4.5 million units in its first seven weeks, PlayStation 4 sold 2.1 million in a little over two weeks, and Nintendo Switch sold 2.74 million in its first month. [...]\n \nNintendo has predicted it will sell 15 million Switch 2s during its current financial year. It's well on the way to that figure already, although Nintendo still faces the challenges of maintaining stock availability and extending this expensive console's reach past the first wave of early adopters. If Switch 2 hits its first-year target, it will join Nintendo's other fasters sellers over the first year on sale: Game Boy Advance, Nintendo 3DS,",
        "id": 2909349,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/11/2017228/nintendo-switch-2-is-fastest-selling-game-console-of-all-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nintendo Switch 2 Is Fastest-Selling Game Console of All Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T22:02:22.461955+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T21:20:00+00:00",
        "description": "Amazon has launched its AI-powered Video Generator tool in the U.S., allowing sellers to quickly create photorealistic, motion-enhanced video ads often with a single click. \"We'll likely see Amazon retailers utilizing AI-generated video ads in the wild now that the tool is generally available in the U.S. and costs nothing to use -- unless the ads are so convincing that we don't notice anything at all,\" says The Verge. From the report: New capabilities include motion improvements to show items in action, which Amazon says is best for showcasing products like toys, tools, and worn accessories. For example, Video Generator can now create clips that show someone wearing a watch on their wrist and checking the time, instead of simply displaying the watch on a table. The tool generates six different videos to choose from, and allows brands to add their logos to the finished results.\n \nThe Video Generator can now also make ads with multiple connected scenes that include humans, pets, text ov",
        "id": 2908925,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/11/207231/amazon-is-about-to-be-flooded-with-ai-generated-video-ads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Is About To Be Flooded With AI-Generated Video Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T20:57:31.956338+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T20:40:00+00:00",
        "description": "Hong Kong authorities have invoked national security laws for the first time to ban the Taiwan-made video game Reversed Front: Bonfire, accusing it of promoting \"secessionist agendas, such as 'Taiwan independence' and 'Hong Kong independence.'\" Engadget reports: Reversed Front: Bonfire was developed by a group known as ESC Taiwan, who are outspoken critics of the China's Communist Party. The game disappeared from the Apple App Store in Hong Kong less than 24 hours after authorities issued the warning. Google already removed the game from the Play Store back in May, because players were using hate speech as part of their usernames. ESC Taiwan told The New York Times that that the game's removal shows that apps like theirs are subject to censorship in mainland China. The group also thanked authorities for the free publicity on Facebook, as the game experienced a surge in Google searches.\n \nThe game uses anime-style illustrations and allows players to fight against China's Communist Part",
        "id": 2908530,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/11/203218/hong-kong-bans-video-game-using-national-security-laws?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hong Kong Bans Video Game Using National Security Laws",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T20:57:32.114017+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T20:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The robot built by [Yuntao Ma and his team at ETH Zurich] was called ANYmal and resembled a miniature giraffe that plays badminton by holding a racket in its teeth. It was a quadruped platform developed by ANYbotics, an ETH Zurich spinoff company that mainly builds robots for the oil and gas industries. \"It was an industry-grade robot,\" Ma said. The robot had elastic actuators in its legs, weighed roughly 50 kilograms, and was half a meter wide and under a meter long. On top of the robot, Ma's team fitted an arm with several degrees of freedom produced by another ETH Zurich spinoff called Duatic. This is what would hold and swing a badminton racket. Shuttlecock tracking and sensing the environment were done with a stereoscopic camera. \"We've been working to integrate the hardware for five years,\" Ma said.\n \nAlong with the hardware, his team was also working on the robot's brain. State-of-the-art robots usually use model-based cont",
        "id": 2908531,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/11/1958227/scientists-built-a-badminton-playing-robot-with-ai-powered-skills?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Built a Badminton-Playing Robot With AI-Powered Skills",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T18:47:21.071037+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T18:25:00+00:00",
        "description": "An anonymous reader shares a report: A data broker owned by the country's major airlines, including Delta, American Airlines, and United, collected U.S. travellers' domestic flight records, sold access to them to Customs and Border Protection (CBP), and then as part of the contract told CBP to not reveal where the data came from, according to internal CBP documents obtained by 404 Media. The data includes passenger names, their full flight itineraries, and financial details. \n\nCBP, a part of the Department of Homeland Security (DHS), says it needs this data to support state and local police to track people of interest's air travel across the country, in a purchase that has alarmed civil liberties experts. The documents reveal for the first time in detail why at least one part of DHS purchased such information, and comes after Immigration and Customs Enforcement (ICE) detailed its own purchase of the data. The documents also show for the first time that the data broker, called the Airl",
        "id": 2907421,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/11/1825215/airlines-dont-want-you-to-know-they-sold-your-flight-data-to-dhs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Airlines Don't Want You to Know They Sold Your Flight Data to DHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T17:42:00.252958+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T17:32:00+00:00",
        "description": "The Wikimedia Foundation halted an experiment that would have displayed AI-generated summaries atop Wikipedia articles after the platform's volunteer editor community delivered an overwhelmingly negative response to the proposal. The foundation announced the two-week mobile trial on June 2 and suspended it just one day later following dozens of critical comments from editors. \n\nThe experiment, called \"Simple Article Summaries,\" would have used Cohere's open-weight Aya model to generate simplified versions of complex Wikipedia articles. The AI-generated summaries would have appeared at the top of articles with a yellow \"unverified\" label, requiring users to click to expand and read them. Editors responded with comments including \"very bad idea,\" \"strongest possible oppose,\" and simply \"Yuck.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wikipedia+Pauses+AI-Generated+Summaries+After+Editor+Backlash%3A+https%3A%2F%2F",
        "id": 2906905,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/11/1732215/wikipedia-pauses-ai-generated-summaries-after-editor-backlash?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wikipedia Pauses AI-Generated Summaries After Editor Backlash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T17:42:00.429135+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T16:42:00+00:00",
        "description": "HP has unveiled the first commercial hardware for Google Beam, the Android-maker's 3D video conferencing technology formerly known as Project Starline, with a price tag of $24,999. The HP Dimension features a 65-inch light field display paired with six high-speed cameras positioned around the screen to capture speakers from multiple angles, creating what the companies describe as a lifelike 3D representation without requiring headsets or glasses. \n\nThe system processes visual data through Google's proprietary volumetric video model, which merges camera streams into 3D reconstructions with millimeter-scale precision at 60 frames per second. Beyond the hardware cost, users must purchase a separate Google Beam license for cloud processing, though pricing for that service remains undisclosed.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=HP's+First+Google+Beam+3D+Video+System+Costs+%2424%2C999%2C+Plus+Unknown+License+F",
        "id": 2906906,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/11/1641226/hps-first-google-beam-3d-video-system-costs-24999-plus-unknown-license-fees?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "HP's First Google Beam 3D Video System Costs $24,999, Plus Unknown License Fees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T16:36:26.419373+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T16:08:00+00:00",
        "description": "The Vera C. Rubin Observatory in Chile will begin full operations in the coming months with the world's largest digital camera, capturing 3,200-megapixel images that would require several hundred HD television screens to display at full resolution. The $810 million facility will map the entire southern sky every three to four nights, observing each location approximately 800 times over its planned decade of operations. \n\nThe telescope's unusual design allows it to photograph an area equivalent to 45 full moons in each shot and swing between different sky locations every 40 seconds. Its digital camera, roughly the size of a small car, will generate eight million alerts per night when it detects astronomical objects that move or change brightness, according to Tony Tyson, the University of California, Davis astronomer who conceived the project in the 1990s. Astrophysicist Federica Bianco, who received a preview of the telescope's first full-color image, described her reaction simply: \"T",
        "id": 2906235,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/11/168234/major-telescope-hosts-worlds-largest-digital-camera?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Major Telescope Hosts World's Largest Digital Camera",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T16:36:26.581322+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T15:33:00+00:00",
        "description": "Disney and NBCUniversal have filed a copyright infringement lawsuit against AI image generator firm Midjourney in U.S. District Court in Los Angeles, marking the first time major Hollywood studios have taken legal action against a generative AI company. \n\nThe entertainment giants accuse Midjourney, founded in 2021, of training its software on \"countless\" copyrighted works without permission and enabling users to create images that \"blatantly incorporate and copy\" famous characters including Darth Vader, the Minions, Frozen's Elsa, Shrek, and Homer Simpson. \n\nThe companies claim they attempted to resolve the matter privately, but Midjourney \"continued to release new versions\" with \"even higher quality infringing images\" according to the complaint. Disney's general counsel used the word \"piracy,\" to describe Midjourney's practice, while NBCUniversal's general counsel characterized it as \"blatant infringement.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpo",
        "id": 2906236,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/11/1533241/disney-nbcu-sue-ai-image-generator-midjourney-over-copyright-infringement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Disney, NBCU Sue AI Image Generator Midjourney Over Copyright Infringement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T15:30:51.478145+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T14:42:00+00:00",
        "description": "WhatsApp has applied to submit evidence in Apple's legal battle against the UK Home Office over government demands for access to encrypted user data. The messaging platform's boss Will Cathcart told the BBC the case \"could set a dangerous precedent\" by \"emboldening other nations\" to seek to break encryption protections. \n\nThe confrontation began when Apple received a secret Technical Capability Notice from the Home Office earlier this year demanding the right to access data from its global customers for national security purposes. Apple responded by first pulling its Advanced Data Protection system from the UK, then taking the government to court to overturn the request. \n\nCathcart said WhatsApp \"would challenge any law or government request that seeks to weaken the encryption of our services.\" US Director of National Intelligence Tulsi Gabbard has called the UK's demands an \"egregious violation\" of American citizens' privacy rights.<p><div class=\"share_submission\" style=\"position:rel",
        "id": 2905577,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/11/1441251/whatsapp-moves-to-support-apple-against-uk-governments-data-access-demands?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "WhatsApp Moves To Support Apple Against UK Government's Data Access Demands",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T14:22:15.587945+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T14:04:00+00:00",
        "description": "Apple executives defended the company's AI strategy this week after acknowledging that major Siri features announced at last year's Worldwide Developers Conference remain undelivered and were quietly pulled from development plans. Craig Federighi, Apple's senior vice president of software engineering, told the Wall Street Journal that the company is rebuilding Siri from the ground up, admitting that while Apple had working software for the promised features, \"it didn't converge in the way quality-wise that we needed it to.\" \n\nThe missing capabilities included Siri's ability to search through apps and respond to on-screen activities, features that were demonstrated a year ago but never shipped to users. In the upcoming iOS 26, Apple has instead incorporated more OpenAI technology, allowing users to interact with ChatGPT through camera and screenshots and generate images using OpenAI's tools. Federighi defended the strategy by comparing Apple's position to the early internet era, when t",
        "id": 2904847,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/11/144258/apple-executives-defend-ai-strategy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Executives Defend AI Strategy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T14:22:15.701066+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from TorrentFreak: Fresh data released by piracy tracking outfit MUSO shows that pirate sites remain popular. In a report released today, MUSO reveals that there were 216 billion pirate site visits globally in 2024, a slight decrease compared to the 229 billion visits recorded a year earlier. TV piracy remains by far the most popular category, representing over 44.6% of all website visits. This is followed by the publishing category with 30.7%, with film, software and music all at a respectable distance. Pirate site visitors originate from all over the world, but one country stands tall above all the rest: America. The United States remains the top driver of pirate site traffic accounting for more than 12% of all traffic globally, good for 26.7 billion visits in 2024. India has been steadily climbing the ranks for years and currently sits in second place with 17.6 billion annual visits, with Russia, Indonesia, and Vietnam completing the top five. As",
        "id": 2904848,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/11/0116225/pirate-site-visits-dip-to-216-billion-a-year-but-manga-piracy-is-booming?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pirate Site Visits Dip To 216 Billion a Year, But Manga Piracy Is Booming",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T10:57:39.902199+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T10:00:00+00:00",
        "description": "The FDA plans to use AI to \"radically increase efficiency\" in deciding whether to approve new drugs and devices, drawing on lessons from Operation Warp Speed to reduce review times to weeks. The plan was laid out in an article published Tuesday in JAMA. The New York Times reports: Another initiative involves a review of chemicals and other \"concerning ingredients\" that appear in U.S. food but not in the food of other developed nations. And officials want to speed up the final stages of making a drug or medical device approval decision to mere weeks, citing the success of Operation Warp Speed during the Covid pandemic when workers raced to curb a spiraling death count. [...]\n \nLast week, the agency introduced Elsa, an artificial intelligence large-language model similar to ChatGPT. The FDA said it could be used to prioritize which food or drug facilities to inspect, to describe side effects in drug safety summaries and to perform other basic product-review tasks. The FDA officials wrot",
        "id": 2903228,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/11/015216/fda-to-use-ai-in-drug-approvals-to-radically-increase-efficiency?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FDA To Use AI In Drug Approvals To 'Radically Increase Efficiency'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T07:42:39.033742+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T07:00:00+00:00",
        "description": "A mathematician on Reddit calculated that if all 8.2 billion humans were blended into a uniform goo, the resulting meatball would form a sphere just under 1 kilometer wide -- small enough to fit inside Central Park. ScienceAlert reports: \"If you blended all 7.88 billion people on Earth into a fine goo (density of a human = 985 kg/m3, average human body mass = 62 kg), you would end up with a sphere of human goo just under 1 km wide,\" Reddit contributor kiki2703 wrote in a post ... Reasoning the density of a minced human to be 985 kilograms per cubic meter (62 pounds per cubic foot) is a fair estimate, given past efforts have judged our jiggling sack of grade-A giblets to average out in the ballpark of 1 gram per cubic centimeter, or roughly the same as water. And in mid-2021, the global population was just around 7.9 billion, give or take.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Mathematician+Calculated+The+",
        "id": 2902020,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/11/0050238/a-mathematician-calculated-the-size-of-a-giant-meatball-made-of-every-human?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Mathematician Calculated The Size of a Giant Meatball Made of Every Human",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T04:27:03.202595+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Indirect carbon emissions from the operations of four of the leading AI-focused tech companies rose on average by 150% from 2020-2023, due to the demands of power-hungry data centers, a United Nations report (PDF) said on Thursday. The use of artificial intelligence by Amazon, Microsoft, Alphabet and Meta drove up their global indirect emissions because of the vast amounts of energy required to power data centers, the report by the International Telecommunication Union (ITU), the U.N. agency for digital technologies, said.\n \nIndirect emissions include those generated by purchased electricity, steam, heating and cooling consumed by a company.\nAmazon's operational carbon emissions grew the most at 182% in 2023 compared to three years before, followed by Microsoft at 155%, Meta at 145% and Alphabet at 138%, according to the report. The ITU tracked the greenhouse gas emissions of 200 leading digital companies between 2020 and 2023. [...] A",
        "id": 2901180,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/10/2154202/tech-giants-indirect-emissions-rose-150-in-three-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tech Giants' Indirect Emissions Rose 150% In Three Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T19:52:20.282526+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Indirect carbon emissions from the operations of four of the leading AI-focused tech companies rose on average by 150% from 2020-2023, due to the demands of power-hungry data centers, a United Nations report (PDF) said on Thursday. The use of artificial intelligence by Amazon, Microsoft, Alphabet and Meta drove up their global indirect emissions because of the vast amounts of energy required to power data centers, the report by the International Telecommunication Union (ITU), the U.N. agency for digital technologies, said.\n \nIndirect emissions include those generated by purchased electricity, steam, heating and cooling consumed by a company.\nAmazon's operational carbon emissions grew the most at 182% in 2023 compared to three years before, followed by Microsoft at 155%, Meta at 145% and Alphabet at 138%, according to the report. The ITU tracked the greenhouse gas emissions of 200 leading digital companies between 2020 and 2023. [...] A",
        "id": 2907955,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/10/2154202/tech-giants-indirect-operational-emissions-rose-50-since-2020?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tech Giants' Indirect Operational Emissions Rose 50% Since 2020",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T02:17:00.229451+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T01:40:00+00:00",
        "description": "Michael Larabel of Phoronix highlights the key updates in today's stable release of FreeBSD 14.3: FreeBSD 14.3 has back-ported a number of improvements from FreeBSD 15 back to the FreeBSD 14 series. Plus a number of routine package updates and other fixes. Some of the FreeBSD 14.3-RELEASE highlights include:\n \n- Updating the ZFS support against OpenZFS 2.2.7.\n- Merging of the Realtek RTW88 and RTW89 WiFi drivers based on the Linux 6.14 kernel code.\n- The LinuxKPI code has been improved to support crypto offload as well as the 802.11n and 802.11ac standards.\n- The Intel IX Ethernet driver has added support for the x550 1000BAS-BX SFP modules.\n- Thor2 PCI IDs added to the Broadcom NetXtreme \"BNXT\" driver along with support for 400G speed modules.\n- XZ 5.8.1, OpenSSH 9.9p2, OpenSSL 3.0.16, and many other package updates.\n- Syscons as the legacy system console driver is now considered deprecated. Syscons is not compatible with UEFI, lacks UTF-8 support, and is Giant-locked. You can downlo",
        "id": 2900677,
        "language": null,
        "link": "https://bsd.slashdot.org/story/25/06/10/2146224/freebsd-143-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FreeBSD 14.3 Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T01:12:00.715922+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T01:00:00+00:00",
        "description": "\"Twelve years ago, a baby was born after someone used bitcoin to pay for a frozen egg IVF,\" writes longtime Slashdot reader bobdevine. \"I, for one, welcome...\"\n \nBlockworks tells the story of how it all came to be: In February 2012 -- almost two years after Laszlo's pizzas -- a fertility doctor named C. Terence Lee set about a personal and professional quest to onboard his patients to Bitcoin by accepting BTC for his services. He started with a \"Bitcoin accepted here\" sign in his window, and then a Reddit post.\n \n\"Jumping in to do my part to support the BTC economy. This may be a historic first?\" Lee wrote in a post on the BitMarket subreddit, titled: \"[WTS][USA] Male Fertility Evaluation.\" Lee was offering a 15-minute consultation to discuss fertility questions and a sperm analysis in exchange for 15 BTC, valued at $70 or so at the time. \"Actual value over $100,\" he wrote. Within three months, he'd found a Bitcoin customer.\n \n\"The patient turned out not... so much having a burning de",
        "id": 2900429,
        "language": null,
        "link": "https://slashdot.org/story/25/06/10/2134219/bitcoin-baby-soon-to-be-a-teenager?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Bitcoin Baby' Soon To Be a Teenager",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T01:12:00.874028+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T00:20:00+00:00",
        "description": "\"It is true, Google AI is stomping on the entire internet,\" writes Slashdot reader TheWho79, sharing a report from the Wall Street Journal. \"From HuffPost to the Atlantic, publishers prepare to pivot or shut the doors. ... Even highly regarded old school bullet-proof publications like Washington Post are getting hit hard.\" From the report: Traffic from organic search to HuffPost's desktop and mobile websites fell by just over half in the past three years, and by nearly that much at the Washington Post, according to digital market data firm Similarweb. Business Insider cut about 21% of its staff last month, a move CEO Barbara Peng said was aimed at helping the publication \"endure extreme traffic drops outside of our control.\" Organic search traffic to its websites declined by 55% between April 2022 and April 2025, according to data from Similarweb.\n \nAt a companywide meeting earlier this year, Nicholas Thompson, chief executive of the Atlantic, said the publication should assume traffi",
        "id": 2900430,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/10/2126217/news-sites-are-getting-crushed-by-googles-new-ai-tools?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "News Sites Are Getting Crushed by Google's New AI Tools",
        "vote": 0
    }
]