[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T16:11:44.507122+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T15:30:07+00:00",
        "description": "Crimson Desert has been gradually accumulating hype and buzz for a while now. Originally known to few, and perhaps as little more than \"that single player offshoot\" of the MMORPG Black Desert, the project evolved and grew in scope and ambition, eventually becoming its own standalone thing, and impressing with multiple showings over the course of years to firmly register itself on the radar for a great many people.",
        "id": 2905721,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DkdmJc1G6wU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DkdmJc1G6wU/hqdefault.jpg",
        "title": "Crimson Desert Keeps Looking Better Every Time We See It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T13:51:56.015074+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T13:30:14+00:00",
        "description": "Looking back on Hideo Kojima's body of work till now, it's impressive that something like Death Stranding 2: On the Beach could inspire so much awe. Launching on June 26th for PS5, the sequel is bigger than the original in almost every way.\n\nMore guns, more vehicles, more tools, more enemy types, more environments - and that's not even getting into all the neat features like the day/night cycle, dynamic weather, environmental shifts, Proficiency Levels, Traits, and so on. However, Sam's newest adventure isn't just about more content - it's also about expanding on the ways to play, embracing stealth and action as deeply as the first game's courier-focused exploration.\n\nCouple this with a narrative leveraging the already impressive world-building, new complex characters, and emotional themes to resonate, all packaged with gorgeous visuals and presentation, and Death Stranding 2: On the Beach looks like a winner. Here's why it could very well be the game to beat in 2025.",
        "id": 2903808,
        "language": null,
        "link": "https://www.youtube.com/watch?v=AQxqoG8enjA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AQxqoG8enjA/hqdefault.jpg",
        "title": "Death Stranding 2 Is Going to Be WILD - You’re Not Ready",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T11:27:36.072007+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T10:30:21+00:00",
        "description": "Anyone who does get Sonic X Shadow Generations is in for a treat, with a surprisingly great new game in the guise of Shadow, and a beloved fan favorite that manages to hold up mostly well in Sonic. \n\nIf you haven’t played it yet, and are interested in platformers, then the Switch 2 version is as easily recommended as the PC, PlayStation, or Xbox versions are; if you do already own the game on Switch itself, it’s a lot harder to recommend you having to by the same game again.",
        "id": 2903268,
        "language": null,
        "link": "https://www.youtube.com/watch?v=eY_oLe05rBY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eY_oLe05rBY/hqdefault.jpg",
        "title": "Sonic X Shadow Generations Switch 2 Review - A Must-Play...Unless You Already Did",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-11T11:27:36.354688+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-11T10:30:01+00:00",
        "description": "When it first came out back in 2023, Lies of P was already considered an excellent new addition to the ever-growing line-up of games tackling FromSoftware’s Soulslike formula. The game offered a creative new way to handle weapons, while also giving us a unique setting and fun story that reimagines the classic fable of Pinocchio. The DLC, Overture, takes us back to the past, before Krat became how we see it in the base game.\n\nLies of P: Overture doesn’t bring any new revolutionary game mechanic with it. Rather, it brings with it a refinement of everything we saw in the base game, but with a new sense of confidence and polish that elevates the entire experience. While there might be a few balancing issues, especially early on in the DLC, Overture is a great way to spend a weekend for fans of Lies of P.",
        "id": 2903269,
        "language": null,
        "link": "https://www.youtube.com/watch?v=-h7oRpfHyyg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-h7oRpfHyyg/hqdefault.jpg",
        "title": "Lies of P: Overture Review - A Brutal But Brilliant DLC That Expands The Lore",
        "vote": 0
    }
]