[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T16:00:36+00:00",
        "description": "What do you get when you take Valorant's approach to Overwatch and, well, copy it? And then add some cards, an over-the-top aesthetic, and enough monetization to make both those titles collectively blush? You get Bad Guitar Studio's FragPunk.\n\nThe overall approach to its 5v5 tactical hero shooter gameplay follows Valorant beat-for-beat while introducing unique hooks, like weapons on a knockout system and The Duel for teams to battle it out in overtime. The Shard Cards attempt to mix up the gameplay, though their impact ranges from mild modifiers to minor shifts in strategy instead of out-and-out chaotic scenarios.\n\nDespite some cool-looking environments, responsive gunplay and sleek character designs, FragPunk lacks the depth and nuance that defines the market leaders. It gets by well enough on its own merits, making it worth a look, but the question is if it will evolve into a unique must-play experience.",
        "id": 2297647,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ROGPSBooHok",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ROGPSBooHok/hqdefault.jpg",
        "title": "FragPunk Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T14:00:42+00:00",
        "description": "Kojima Productions finally announced a release date for Death Stranding 2: On the Beach, and it's earlier than expected. Launching on June 26th for PS5, the open-world action-adventure sees Norman Reedus and his crew venturing outside of the UAC to ideally save the world. Meanwhile, there's debate over whether \"we\" should have connected.\n\nA lot is happening in the new ten-minute trailer, ranging from new characters (Doctor, Red Samurai) to bizarre occurrences (Magellan Man). Everyone can mostly agree, though - the visuals are simply incredible. From presenting brand new environments and biomes to brand new weather phenomena and improved water physics, there is so much to break down.\n\nWhile the performance and resolution are still up for debate - and we'll only find out closer to launch, Death Stranding 2: On the Beach is doubtless a stunning-looking game. Join us as we analyze some of the technical aspects of its visuals based on the trailer.",
        "id": 2297064,
        "language": null,
        "link": "https://www.youtube.com/watch?v=c1YJamSa_xE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/c1YJamSa_xE/hqdefault.jpg",
        "title": "Finally, A Video Game That Looks Truly Next-Gen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T09:30:07+00:00",
        "description": "We had been waiting for a new trailer for Death Stranding 2: On the Beach for a while now, and after weeks of teases (and eventually, promises) by Hideo Kojima, at a lengthy SXSW 25 panel, we finally got that trailer- and it’s exactly the sort of trailer you’d expect to see from the mind of Hideo Kojima. \n\nAt ten minutes long, it’s a lengthy look at the game that showcases a lot, and yet manages to not give too much away, striking the sort of balance that Kojima has struck time and again with his pre-release cycles. Even so, there’s plenty to glean from that trailer, so here, we’ll be going over the things that stood out to us in the newest look for Death Stranding 2.",
        "id": 2294584,
        "language": null,
        "link": "https://www.youtube.com/watch?v=AxeQ7anp7eA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AxeQ7anp7eA/hqdefault.jpg",
        "title": "Death Stranding 2 Latest Trailer Breakdown: 5 Things WE DIDN'T EXPECT To See",
        "vote": 0
    }
]