[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T23:47:37+00:00",
        "description": "Microsoft is ending support of its Remote Desktop app for Windows on May 27th. From a report: If you use the Remote Desktop app to connect to Windows 365, Azure Virtual Desktop, or Microsoft Dev Box machines then you'll have to transition to the Windows app instead. \n\nThe new Windows app, which launched in September, includes multimonitor support, dynamic display resolutions, and easy access to cloud PCs and virtual desktops. Microsoft says \"connections to Windows 365, Azure Virtual Desktop, and Microsoft Dev Box via the Remote Desktop app from the Microsoft Store will be blocked after May 27th, 2025.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+is+Replacing+Remote+Desktop+With+Its+New+Windows+App%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F03%2F11%2F2037221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http:",
        "id": 2301127,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/11/2037221/microsoft-is-replacing-remote-desktop-with-its-new-windows-app?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft is Replacing Remote Desktop With Its New Windows App",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T23:47:37+00:00",
        "description": "A new chapter has begun for two of the world's most popular preprint platforms, bioRxiv and medRxiv, with the launch of a non-profit organization that will manage them, their co-founders announced today. From a report: The servers allow researchers to share manuscripts for free before peer review and have become an integral part of publishing biology and medical research. Until now, they had been managed by Cold Spring Harbor Laboratory (CSHL) in New York. The new organization, named openRxiv, will have a board of directors and a scientific and medical advisory board. It is supported by a fresh US$16-million grant from the Chan Zuckerberg Initiative (CZI), the projects' main financial backer. \n\n\"It's just exciting to see this key piece of infrastructure really get the attention that it deserves as a dedicated initiative,\" says Katie Corker, executive director of ASAPbio, a scientist-driven non-profit organization, which is based in San Francisco, California. Preprints are \"the backbo",
        "id": 2301128,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/11/2031217/preprint-sites-biorxiv-and-medrxiv-launch-new-era-of-independence?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Preprint Sites bioRxiv and medRxiv Launch New Era of Independence",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T22:42:15+00:00",
        "description": "An anonymous reader quotes a report from the Washington Post: An Amazon-backed self-driving taxi failed to meet vehicle safety standardsbecause it lacks basics like a brake pedal and rearview mirrors, according to a report by federal inspectors that raises questions about the industry's plans to put a new generation of autonomous vehicles on U.S. roads. The National Highway Traffic Safety Administration report was produced as part of a review last year of an unusual vehicle by Amazon subsidiary Zoox that, without a steering wheel or other human controls, has no way for a person to drive. Zoox has asserted that the vehicle's technology, backed by artificial intelligence, complies with the agency's standards. But the NHTSA report documents \"apparent noncompliances\" with eight safety rules.\n \nThe contents of the previously undisclosed review suggest that rules written when autonomous vehicles were the stuff of futuristic musings pose a legal impediment to the industry's ambitions, even ",
        "id": 2300769,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/11/2015220/zoox-robotaxis-do-not-meet-federal-safety-standards-agency-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Zoox Robotaxis Do Not Meet Federal Safety Standards, Agency Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T21:37:05+00:00",
        "description": "Spain's government has approved legislation imposing substantial fines of up to 35 million euros or 7% of global turnover on companies that fail to clearly label AI-generated content. Reuters reports: The bill adopts guidelines from the European Union's landmark AI Act imposing strict transparency obligations on AI systems deemed to be high-risk, Digital Transformation Minister Oscar Lopez told reporters. \"AI is a very powerful tool that can be used to improve our lives ... or to spread misinformation and attack democracy,\" he said. Spain is among the first EU countries to implement the bloc's rules, considered more comprehensive than the United States' system that largely relies on voluntary compliance and a patchwork of state regulations. Lopez added that everyone was susceptible to \"deepfake\" attacks - a term for videos, photographs or audios that have been edited or generated through AI algorithms but are presented as real. [...]\n \nThe bill also bans other practices, such as the ",
        "id": 2300357,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/11/200242/spain-to-impose-massive-fines-for-not-labeling-ai-generated-content?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Spain To Impose Massive Fines For Not Labeling AI-Generated Content",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T21:37:05+00:00",
        "description": "The Ballista botnet is actively exploiting a high-severity remote code execution flaw (CVE-2023-1389) in TP-Link Archer AX-21 routers, infecting over 6,000 devices primarily in Brazil, Poland, the UK, Bulgaria, and Turkey. Tom's Hardware reports: According to a new report from the Cato CTRL team, the Ballista botnet exploits a remote code execution vulnerability that directly impacts the TP-Link Archer AX-21 router. The botnet can lead to command injection which then makes remote code execution (RCE) possible so that the malware can spread itself across the internet automatically. This high severity security flaw (tracked as CVE-2023-1389) has also been used to spread other malware families as far back as April 2023 when it was used in the Mirai botnet malware attacks. The flaw also linked to the Condi and AndroxGh0st malware attacks.\n \nBallista's most recent exploitation attempt was February 17, 2025 and Cato CTRL first detected it on January 10, 2025. Of the thousands of infected d",
        "id": 2300356,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/11/207242/thousands-of-tp-link-routers-have-been-infected-by-a-botnet-to-spread-malware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Thousands of TP-Link Routers Have Been Infected By a Botnet To Spread Malware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T20:32:38+00:00",
        "description": "An anonymous reader quotes a report from The Register: Vodafone is warning staff in the UK to work onsite at least eight days a month or be subject to disciplinary action from April. Group UK employees were last week sent the \"Hybrid Working at Vodafone\" memo -- seen by The Register -- to highlight the policy and tell them to expect a year-end conversation with their line manager. \"You will have read in Get Ready for Year-End Conversations and a Hybrid Working Reminder [documents] that your line manager may discuss hybrid working with you as part of your year-end conversation. \"We therefore want to remind everyone of the Group UK Hybrid Working policy. It's essential that all employees adhere to the expectation of being in the office 2-3 times a week, or at least eight days a month,\" it states.\n \n\"Employees who are not fully compliant with our hybrid working policy by the end of Q1 may be subject to disciplinary action in line with policy. Continued non-compliance with attendance exp",
        "id": 2299919,
        "language": null,
        "link": "https://slashdot.org/story/25/03/11/1953254/vodafone-tells-employees-to-follow-rto-policy-or-lose-bonuses?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Vodafone Tells Employees To Follow RTO Policy Or Lose Bonuses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T19:27:50+00:00",
        "description": "Southwest Airlines boasts that its passengers' \"bags fly free\" -- but not for long. From a report: Starting May 28 -- just in time for the busy summer travel season -- only Southwest's most elite Rapid Rewards A-List Preferred members and passengers who book their top-tier Business Select fares will receive two free checked bags. Frequent flyer A-List Members, Southwest-branded credit card holders and other select customers will be allowed one checked bag. \n\nEveryone else will be charged for their first and second checked bags on flights booked on or after May 28, the carrier says. It's a break with Southwest's 54 year history -- one that could undermine customer loyalty to the carrier, according to experts. \"This is how you destroy a brand. This is how you destroy customer preference. This is how you destroy loyalty. And this, I think, is going to send Southwest into a financial tailspin,\" airline industry analyst Henry Harteveldt, of Atmosphere Research Group, told CBS News senior ",
        "id": 2299404,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/11/1859238/southwest-airlines-to-end-free-checked-bags-policy-for-first-time-in-its-54-year-history?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Southwest Airlines To End Free Checked Bags Policy For First Time in Its 54-Year History",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T18:22:05+00:00",
        "description": "Abstract of a paper published on Journal of Hospitality and Tourism Management:The adoption of digital menus accessed through quick response (QR) codes has witnessed a notable upsurge. Despite potential benefits for restaurant operators, the nuanced effects of QR code menus on customer behavior and experience remain relatively unknown. This research investigates the influence of menu presentation (QR code vs. traditional) on customer loyalty. In two studies, we find that QR code menus diminish customer loyalty (compared to traditional menus) due to perceived inconvenience. This effect is further moderated by customers' need for interaction. Our work is timely in highlighting the negative impact of perceptions of inconvenience on technology adoption.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Surprising+Impact+of+QR+Code+Menus+on+Diminishing+Customer+Loyalty%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25",
        "id": 2298872,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/11/1755217/the-surprising-impact-of-qr-code-menus-on-diminishing-customer-loyalty?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Surprising Impact of QR Code Menus on Diminishing Customer Loyalty",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T18:22:05+00:00",
        "description": "Businesses, governments, and researchers continue to struggle with extracting usable data from PDF files, despite AI advances. These digital documents contain valuable information for everything from scientific research to government records, but their rigid formats make extraction difficult. \n\n\"PDFs are a creature of a time when print layout was a big influence on publishing software,\" Derek Willis, a lecturer in Data and Computational Journalism at the University of Maryland, told ArsTechnica. This print-oriented design means many PDFs are essentially \"pictures of information\" requiring optical character recognition (OCR) technology. \n\nTraditional OCR systems have existed since the 1970s but struggle with complex layouts and poor-quality scans. New AI language models from companies like Google and Mistral now attempt to process documents more holistically, with varying success. \"Right now, the clear leader is Google's Gemini 2.0 Flash Pro Experimental,\" Willis notes, while Mistral'",
        "id": 2298873,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/11/1726218/why-extracting-data-from-pdfs-remains-a-nightmare-for-data-experts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why Extracting Data from PDFs Remains a Nightmare for Data Experts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T17:17:03+00:00",
        "description": "Nearly every country on Earth has dirtier air than doctors recommend breathing, a report has found. From a report: Only seven countries met the World Health Organization's guidelines for tiny toxic particles known as PM2.5 last year, according to analysis from the Swiss air quality technology company IQAir. Australia, New Zealand and Estonia were among the handful of countries with a yearly average of no more than 5ug of PM2.5 per cubic metre, along with Iceland and some small island states. \n\nThe most polluted countries were Chad, Bangladesh, Pakistan, the Democratic Republic of the Congo and India. PM2.5 levels in all five countries were at least 10 times higher than guideline limits in 2024, the report found, stretching as much as 18 times higher than recommended levels in Chad. Doctors say there are no safe levels of PM2.5, which is small enough to slip into the bloodstream and damage organs throughout the body, but have estimated millions of lives could be saved each year by fol",
        "id": 2298265,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/11/1648211/only-seven-countries-worldwide-meet-who-dirty-air-guidelines-study-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Only Seven Countries Worldwide Meet WHO Dirty Air Guidelines, Study Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T16:11:56+00:00",
        "description": "A critical root certificate expiring on March 14, 2025 will disable extensions and potentially break DRM-dependent streaming services for Firefox users running outdated browsers. Users must update to at least Firefox 128 or ESR 115.13+ to maintain functionality across Windows, macOS, Linux, and Android platforms. \n\nThe expiration additionally compromises security infrastructure, including blocklists for malicious add-ons, SSL certificate revocation lists, and password breach notifications. Even those on legacy operating systems (Windows 7/8/8.1, macOS 10.12&#226;\"10.14) must update to minimum ESR 115.13+.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Firefox+Certificate+Expiration+Threatens+Add-ons%2C+Streaming+on+March+14%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F03%2F11%2F1446251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slash",
        "id": 2297604,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/11/1446251/firefox-certificate-expiration-threatens-add-ons-streaming-on-march-14?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Firefox Certificate Expiration Threatens Add-ons, Streaming on March 14",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T16:11:56+00:00",
        "description": "An anonymous reader shares a report: The average American workday now concludes at 4:39 p.m., a notable 36 minutes earlier than it did just two years ago when the clock-out time hovered around 5:21 p.m, according to the latest data from the workforce analytics and productivity software company ActivTrak. \n\nThe new report tracked the workplace behaviors of over 200,000 employees across 777 companies. Despite the shorter workday, the data suggests that overall productivity has increased by about 2%. Per ActivTrak, employees now engage in focused, 24-minute spurts of productivity. \n\n\"I hope to see these numbers remain consistent year-over-year when it comes to workday span and productivity,\" said Gabriela Mauch, the head of ActivTrak's Productivity Lab. \"These are healthy numbers. We've adapted to a traditional workday on average, while offering flexibility and fluidity in a way that meets employees where they are.\" Seasonal fluctuations are another notable factor, the report found. Wor",
        "id": 2297603,
        "language": null,
        "link": "https://slashdot.org/story/25/03/11/166203/half-past-four-is-the-new-five-oclock-in-more-efficient-workday?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Half-Past Four Is the New Five O'Clock in More Efficient Workday",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T15:06:56+00:00",
        "description": "The US's largest pension fund has classified more than $3 billion of holdings in oil drillers, coal miners, and other major greenhouse gas producers as climate-friendly investments, according to a new analysis of public records. From a report: Stakes in Saudi Aramco, Chevron Corp. and Chinese coal company Inner Mongolia Dian Tou Energy are among the holdings that California Public Employees' Retirement System labeled as \"climate solutions.\" The findings are part of a report from California Common Good, a coalition of environmental advocates and public sector unions. The group, which has called for Calpers to divest from major oil and gas companies, is staging protests Tuesday at Chevron's San Francisco Bay Area refinery and in the burn zone of the Eaton fire near Los Angeles.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=California+Pension+Fund+Labels+Chevron+and+Saudi+Aramco+as+Climate+Investments%3A+https%3A%2F%",
        "id": 2297004,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/11/1436211/california-pension-fund-labels-chevron-and-saudi-aramco-as-climate-investments?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "California Pension Fund Labels Chevron and Saudi Aramco as Climate Investments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T15:06:56+00:00",
        "description": "An anonymous reader quotes a report from the BBC: A former senior Facebook executive has told the BBC how the social media giant worked \"hand in glove\" with the Chinese government on potential ways of allowing Beijing to censor and control content in China. Sarah Wynn-Williams -- a former global public policy director -- says in return for gaining access to the Chinese market of hundreds of millions of users, Facebook's founder, Mark Zuckerberg, considered agreeing to hiding posts that were going viral, until they could be checked by the Chinese authorities.\n \nMs Williams -- who makes the claims in a new book -- has also filed a whistleblower complaint with the US markets regulator, the Securities and Exchange Commission (SEC), alleging Meta misled investors. The BBC has reviewed the complaint. Facebook's parent company Meta, says Ms Wynn-Williams had her employment terminated in 2017 \"for poor performance.\" It is \"no secret we were once interested\" in operating services in China, it",
        "id": 2297006,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/11/0018244/facebook-was-hand-in-glove-with-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Facebook Was 'Hand In Glove' With China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T15:06:56+00:00",
        "description": "SpaceX's Starlink has secured its first agreement in India, partnering with telecommunications leader Bharti Airtel to bring high-speed satellite internet to the world's most populous country, the companies announced Tuesday [PDF]. \n\nThe landmark deal will enable Starlink to tap into Airtel's extensive retail network and ground infrastructure while expanding its global reach into previously underserved regions across India, pending regulatory authorizations. \n\n\"We are excited to work with Airtel and unlock the transformative impact Starlink can bring to the people of India,\" said Gwynne Shotwell, President and Chief Operating Officer of SpaceX. \"The team at Airtel has played a pivotal role in India's telecom story, so working with them to complement our direct offering makes great sense for our business.\" \n\nThe collaboration will explore selling Starlink equipment through Airtel's retail stores and offering services to business customers while connecting communities in rural areas wi",
        "id": 2297005,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/11/1125227/spacex-readies-starlink-india-launch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SpaceX Readies Starlink India Launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T11:51:59+00:00",
        "description": "SpaceX's Starlink has secured its first agreement in India, partnering with telecommunications leader Bharti Airtel to bring high-speed satellite internet to the world's most populous country, the companies announced Tuesday [PDF]. \n\nThe landmark deal will enable Starlink to tap into Airtel's extensive retail network and ground infrastructure while expanding its global reach into previously underserved regions across India, pending regulatory authorizations. \n\n\"We are excited to work with Airtel and unlock the transformative impact Starlink can bring to the people of India,\" said Gwynne Shotwell, President and Chief Operating Officer of SpaceX. \"The team at Airtel has played a pivotal role in India's telecom story, so working with them to complement our direct offering makes great sense for our business.\" \n\nThe collaboration will explore selling Starlink equipment through Airtel's retail stores and offering services to business customers while connecting communities in rural areas wi",
        "id": 2295376,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/11/1125227/spacex-partners-with-airtel-to-launch-starlink-in-india?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SpaceX Partners With Airtel To Launch Starlink in India",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T10:46:41+00:00",
        "description": "Former Google CEO Eric Schmidt has taken control of rocket startup Relativity Space, replacing co-founder Tim Ellis as CEO and significantly funding the company's development of its medium-lift rocket, Terran R. The New York Times first reported (paywalled) the news. Ars Technica reports: Schmidt's involvement with Relativity has been quietly discussed among space industry insiders for a few months. Multiple sources told Ars that he has largely been bankrolling the company since the end of October, when the company's previous fundraising dried up. It is not immediately clear why Schmidt is taking a hands-on approach at Relativity. However, it is one of the few US-based companies with a credible path toward developing a medium-lift rocket that could potentially challenge the dominance of SpaceX and its Falcon 9 rocket. If the Terran R booster becomes commercially successful, it could play a big role in launching megaconstellations.\n \nSchmidt's ascension also means that Tim Ellis, the ",
        "id": 2294957,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/11/0032245/former-google-ceo-eric-schmidt-is-the-new-leader-of-relativity-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Former Google CEO Eric Schmidt Is the New Leader of Relativity Space",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T07:31:40+00:00",
        "description": "NASA is eliminating approximately 20 positions, including its chief scientist and roles related to technology, policy, and diversity. The move, as part of a Trump administration effort to reduce staffing, \"could be a harbinger of deeper cuts to NASA's science missions and a greater emphasis on human spaceflight, especially to Mars,\" reports the New York Times. From the report: The cuts affect about 20 employees at NASA, including Katherine Calvin, the chief scientist and a climate science expert. The last day of work for Dr. Calvin and the other staff members will be April 10. [...] The eliminated positions include the chief technologist and chief economist for the agency, which were part of the technology, policy and strategy office. Chief technologist positions at NASA centers like the Johnson Space Center in Houston and the Kennedy Space Center in Florida are not affected, the notice said. The agency is also cutting several positions related to diversity, equity and inclusion in i",
        "id": 2293996,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/11/004258/nasa-eliminates-chief-scientist-and-other-jobs-at-its-headquarters?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA Eliminates Chief Scientist and Other Jobs At Its Headquarters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T04:16:19+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: The pollution of the planet by microplastics is significantly cutting food supplies by damaging the ability of plants to photosynthesize, according to a new assessment. The analysis estimates that between 4% and 14% of the world's staple crops of wheat, rice and maize is being lost due to the pervasive particles. It could get even worse, the scientists said, as more microplastics pour into the environment. About 700 million people were affected by hunger in 2022. The researchers estimated that microplastic pollution could increase the number at risk of starvation by another 400 million in the next two decades, calling that an \"alarming scenario\" for global food security. [...]\n \nThe new study, published in the journal Proceedings of the National Academy of Sciences, combined more than 3,000 observations of the impact of microplastics on plants, taken from 157 studies. Previous research has indicated that microplastics can damage ",
        "id": 2293262,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/10/2349232/microplastics-hinder-plant-photosynthesis-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microplastics Hinder Plant Photosynthesis, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T03:11:29+00:00",
        "description": "The Register's Simon Sharwood reports: The body that runs New Zealand's public health system uses a single Excel spreadsheet as the primary source of data to consolidate and manage its finances, which aren't in great shape perhaps due to the sheet's shortcomings. The spreadsheet-using agency is Health New Zealand (HNZ) which was established in 2022 to replace 20 district health boards in the expectation it would be more cost-effective and deliver more consistent services. The org has a budget of $NZ28 billion ($16 billion) and advised lawmakers it would stay within it for FY 23.24.\n \nThat prediction was incorrect and HNZ blew its budget, leading to a review of its finances that last week delivered a damming report [PDF] that found the org lost \"control of the critical levers that drive financial outcomes\" and had an \"inability to identify and respond to the disconnect between expenditure and revenue.\" The Deloitte-penned report also found an Excel spreadsheet was the \"primary data fi",
        "id": 2293064,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/10/2341223/new-zealands-16-billion-public-health-system-runs-on-a-single-excel-sheet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Zealand's $16 Billion Public Health System Runs on a Single Excel Sheet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T02:07:38+00:00",
        "description": "A volunteer group called WikiPortraits is working to address Wikipedia's issue of featuring outdated and unflattering portraits by providing high-quality, openly licensed images. Since 2024, they have covered global festivals, taken thousands of images, and improved representation of underrepresented individuals, though challenges with funding and media credentials remain. 404 Media reports: This portrait problem stems from Wikipedia's mission to provide free reliable information. All media on the site must be openly licensed, so that anyone can use it free of charge. That, in turn, means that most photos of notable people on the site are of notably poor quality. \"No professional photographers ever have their photos on Wikipedia, because they want to make money from the photos,\" said Jay Dixit, a writing professor and amateur Wikipedia photographer. \"It's actually the norm that most celebrities have poor photos on Wikipedia, if they have photos at all. It's just some civilian at an a",
        "id": 2292786,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/10/2333206/photographers-are-on-a-mission-to-fix-wikipedias-famously-bad-celebrity-portraits?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Photographers Are on a Mission to Fix Wikipedia's Famously Bad Celebrity Portraits",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T01:01:19+00:00",
        "description": "Dustin Moskovitz, CEO and co-founder of Asana, is stepping down and will transition to the role of Chair once a new CEO is appointed. \"As I reflect on my journey since co-founding Asana nearly 17 years ago, I'm filled with immense gratitude,\" Moskovitz said in a statement. \"Creating and leading Asana has been more than just building a company -- it's been a profound privilege to work alongside some of the most talented minds in the industry.\" Asana's stock price was down more than 25% following the news. CNBC reports: Asana said fourth-quarter sales rose 10% year over year to $188.3 million, which was in line with analysts' estimates. The company said its adjusted earnings per share was breakeven, ahead of analysts' estimates of a loss of one cent per share. Asana said it expects fiscal first-quarter revenue of $184.5 million to $186.5 million, trailing analysts' expectations of $191 million.\n \nMoskovitz owns about 53% of the company's outstanding shares, between his Class A and Clas",
        "id": 2292566,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/10/2321254/asana-ceo-announces-retirement-stock-plummets-25?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Asana CEO Announces Retirement, Stock Plummets 25%",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-11T01:01:19+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: When Bluesky CEO Jay Graber walked on stage at SXSW 2025 for her keynote discussion, she wore a large black T-shirt with her hair pulled back into a bun. At first glance, it might appear as though she's following the same playbook that so many women in tech leadership have played before: downplaying her femininity to be taken seriously. The truth is way more interesting than that. What might look like your average black T-shirt is a subtle, yet clear swipe at Mark Zuckerberg, a CEO who represents everything that Bluesky is trying to work against as an open source social network.\n \nThe Meta founder and CEO has directly compared himself to the Roman emperor Julius Caesar. His own shirt declared Aut Zuck aut nihil, which is a play on the Latin phrase aut Caesar aut nihil: \"Either Caesar or nothing.\" Graber's shirt -- which directly copies the style of a shirt that Zuckerberg wore onstage recently -- says Mundus sine caesaribus. Or, \"a",
        "id": 2292567,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/10/2111223/bluesky-ceo-jay-graber-pokes-fun-at-mark-zuckerberg-with-latin-phrase-t-shirt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bluesky CEO Jay Graber Pokes Fun At Mark Zuckerberg With Latin Phrase T-Shirt",
        "vote": 0
    }
]