[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T23:53:28.005933+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T23:26:00+00:00",
        "description": "It's not just Amazon's CEO predicting AI will lower their headcount. \"Top executives at some of the largest American companies have a warning for their workers: Artificial intelligence is a threat to your job,\" reports the Washington Post &mdash; including IBM, Salesforce, and JPMorgan Chase. \n\nBut are they really just trying to impress their shareholders?\n\nEconomists say there aren't yet strong signs that AI is driving widespread layoffs across industries.... CEOs are under pressure to show they are embracing new technology and getting results &mdash; incentivizing attention-grabbing predictions that can create additional uncertainty for workers. \"It's a message to shareholders and board members as much as it is to employees,\" Molly Kinder, a Brookings Institution fellow who studies the impact of AI, said of the CEO announcements, noting that when one company makes a bold AI statement, others typically follow. \"You're projecting that you're out in the future, that you're embracing an",
        "id": 2988978,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/21/2324244/ceos-have-started-warning-ai-is-coming-for-your-job?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CEOs Have Started Warning: AI is Coming For Your Job",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T22:48:26.991090+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T22:10:00+00:00",
        "description": "ScienceAlert reports:\n\nCasino lighting could be nudging gamblers to be more reckless with their money, according to a new study, which found a link between blue-enriched light and riskier gambling behavior. The extra blue light emitted by casino decor and LED screens seems to trigger certain switches in our brains, making us less sensitive to financial losses compared to gains of equal magnitude, researchers from Flinders University and Monash University in Australia found... \n\nThe researchers think circadian photoreception, which is our non-visual response to light, is playing a part here. The level of blue spectrum light may be activating specific eye cells connected to brain regions in charge of decision-making, emotional regulation, and processing risk versus reward scenarios. \n\"Under conditions where the lighting emitted less blue, people tended to feel a $100 loss much more strongly than a $100 gain &mdash; the loss just feels worse,\" [says the study's lead author, a psychologis",
        "id": 2988713,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/21/2147214/casino-lights-could-be-warping-your-brain-to-take-risks-scientists-warn?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Casino Lights Could Be Warping Your Brain To Take Risks, Scientists Warn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T21:43:33.819349+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T21:10:00+00:00",
        "description": "BlueSky has grown from roughly 10 million users in early November to 36.79 million today &mdash; and its last 30 days of traffic looks very level. \n\nBut instead of calling BlueSky's traffic \"level\", right-leaning libertarian Megan McArdle argues instead that BlueSky's \"decline shows no sign of leveling out\" (comparing the stable figures from the last month to a one-time spike seven months ago so they can write \"It's now down about 50 percent\"). And Wednesday the conservative UK magazine Spectator also ignored the 30-day-leveling to write instead that BlueSky is somehow \"sliding down a slope\". \n\nBut TechCrunch thinks the \"up or down\" conversation is entirely missing the point of \"the wider network of apps built on the open protocol that Bluesky's team spearheaded\" &mdash; and how BlueSky \"is only meant to be one example of what's possible within the wider AT Proto ecosystem.\"\n\nIf you don't like the tone of the topics trending on Bluesky, you can switch to other apps, change your defaul",
        "id": 2988507,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/21/046247/bluesky-isnt-dying---and-theres-a-larger-ecosystem-growing-around-its-open-protocol?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "BlueSky Isn't Dying - and There's a Larger Ecosystem Growing Around Its Open Protocol",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T20:38:28.225112+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T19:34:00+00:00",
        "description": "\"The carbon cost of asking an artificial intelligence model a single text question can be measured in grams of CO2...\" writes the Washington Post. And while an individual's impact may be low, what about the collective impact of all users? \n\n\"A Google search takes about 10 times less energy than a ChatGPT query, according to a 2024 analysis from Goldman Sachs &mdash; although that may change as Google makes AI responses a bigger part of search.\"\n\nFor now, a determined user can avoid prompting Google's default AI-generated summaries by switching over to the \"web\" search tab, which is one of the options alongside images and news. Adding \"-ai\" to the end of a search query also seems to work. Other search engines, including DuckDuckGo, give you the option to turn off AI summaries.... \nUsing AI doesn't just mean going to a chatbot and typing in a question. You're also using AI every time an algorithm organizes your social media feed, recommends a song or filters your spam email... [T]here's",
        "id": 2988269,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/21/1844252/what-are-the-carbon-costs-of-asking-an-ai-a-question?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What are the Carbon Costs of Asking an AI a Question?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T19:33:26.130182+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T18:34:00+00:00",
        "description": "An anonymous reader shared this report from the Washington Post:\n\nOver the past three years, companies have invested tens of billions of dollars toward making electric vehicles in the United States, buoyed by tax incentives aimed at helping American businesses compete with China. Now, those companies are facing a strange problem: too much manufacturing capacity, not enough demand. \n\nAs sales of electric vehicles slow and congressional Republicans take aim at EV tax credits and incentives, the United States is slated to have more battery and EV manufacturing than it needs, according to a report released Wednesday by the Rhodium Group, a research firm. That could leave factories &mdash; many of which are already operating or under construction &mdash; stranded if car sales continue to slump. \"The rug is being pulled out from under these manufacturers,\" said Hannah Pitt, a director in Rhodium's energy and climate practice... \n\nAfter [America's 2022 climate bill], battery investment in th",
        "id": 2987988,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/21/1626243/america-invested-in-ev-battery-plants-now-they-may-be-stranded?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America Invested in EV Battery Plants. Now They May Be Stranded.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T18:28:27.152989+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T17:34:00+00:00",
        "description": "It's not dark matter, writes Space.com. But astronomers \thave discovered \"a vast tendril of hot gas linking four galaxy clusters and stretching out for 23 million light-years, 230 times the length of our galaxy. \n\n\"With 10 times the mass of the Milky Way, this filamentary structure accounts for much of the universe's 'missing matter,' the search for which has baffled scientists for decades....\"\n\n [I]t is \"ordinary matter\" made up of atoms, composed of electrons, protons, and neutrons (collectively called baryons) which make up stars, planets, moons, and our bodies. For decades, our best models of the universe have suggested that a third of the baryonic matter that should be out there in the cosmos is missing. \n\nThis discovery of that missing matter suggests our best models of the universe were right all along. It could also reveal more about the \"Cosmic Web,\" the vast structure along which entire galaxies grew and gathered during the earlier epochs of our 13.8 billion-year-old univers",
        "id": 2987715,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/21/064247/the-models-were-right-astronomers-locate-universes-missing-matter?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'The Models Were Right!' Astronomers Locate Universe's 'Missing' Matter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T17:23:30.377780+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T16:34:00+00:00",
        "description": "ScienceDaily reports:\n\nResearchers from MIT and Scripps have unveiled a promising new HIV vaccine approach that generates a powerful immune response with just one dose. By combining two immune-boosting adjuvants alum and SMNP the vaccine lingers in lymph nodes for nearly a month, encouraging the body to produce a vast array of antibodies. This one-shot strategy could revolutionize how we fight not just HIV, but many infectious diseases. It mimics the natural infection process and opens the door to broadly neutralizing antibody responses, a holy grail in vaccine design. And best of all, it's built on components already known to medicine.\n \n\nThanks to Slashdot reader alternative_right for sharing the news.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=One+Shot+To+Stop+HIV%3A+MIT's+Bold+Vaccine+Breakthrough%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F06%2F21%2F0451227%2F%3Futm_source%3Dtwitter%26utm_medium%3",
        "id": 2987384,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/21/0451227/one-shot-to-stop-hiv-mits-bold-vaccine-breakthrough?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "One Shot To Stop HIV: MIT's Bold Vaccine Breakthrough",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T16:19:54.944399+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T15:34:00+00:00",
        "description": "In April Anthorpic introduced a new AI trick: multiple Claude agents combine for a \"Research\" feature that can \"search across both your internal work context and the web\" (as well as Google Workspace \"and any integrations...\") \n\nBut a recent Anthropic blog post notes this feature \"involves an agent that plans a research process based on user queries, and then uses tools to create parallel agents that search for information simultaneously,\" which brings challenges \"in agent coordination, evaluation, and reliability.... The model must operate autonomously for many turns, making decisions about which directions to pursue based on intermediate findings.\"\nMulti-agent systems work mainly because they help spend enough tokens to solve the problem.... This finding validates our architecture that distributes work across agents with separate context windows to add more capacity for parallel reasoning. The latest Claude models act as large efficiency multipliers on token use, as upgrading to Cla",
        "id": 2987054,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/21/0442227/anthropic-deploys-multiple-claude-agents-for-research-tool---says-coding-is-less-parallelizable?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Deploys Multiple Claude Agents for 'Research' Tool - Says Coding is Less Parallelizable",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T15:13:39.109705+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T14:34:00+00:00",
        "description": "Threads now has 200 million users &mdash; but this week a strange bug affected some Threads accounts (on both desktop and mobile). \"One user's post will get repeated over and over again...\" explains TechCrunch, \"as though every user on your feed is saying the same thing.\"\n\n\n\"Siri, unsubscribe me from 2025,\" one Threads user wrote, per a screenshot from social media expert Alexa Heinrich. But then, everyone else on Heinrich's feed appeared to be echoing the same cheugy joke... \n\nWhile it's not yet clear what caused the bug, Meta Communications Director Andy Stone responded to app researcher Jane Manchun Wong's post about the issue. \"Whoops, well that clearly shouldn't have happened! We're working on getting it fixed now,\" Stone said. \n\nI thought the bug was only affecting user feeds (and not replies). But either way, Wong came up with the perfect comeback. \n\n\"Whoops, well that clearly shouldn't have happened! We're working on getting it fixed now.\"<p><div class=\"share_submission\" style",
        "id": 2986736,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/21/018232/bug-hits-some-threads-users-their-words-echoed-by-all-other-users?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bug Hits Some Threads Users:  Their Words Echoed by All Other Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T14:08:28.787782+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T13:00:00+00:00",
        "description": "Intel is outsourcing much of its marketing work to Accenture, \"as new CEO Lip-Bu Tan works to slash costs and improve the chipmaker's operations,\" reports OregonLive. From the report: The company said it believes Accenture, using artificial intelligence, will do a better job connecting with customers. It says it will tell most marketing employees by July 11 whether it plans to lay them off. \"The transition of our marketing and operations functions will result in significant changes to team structures, including potential headcount reductions, with only lean teams remaining,\" Intel told employees in a notice describing its plans. The Oregonian/OregonLive reviewed a copy of the material.\n \nIntel declined to say how many workers will lose their jobs or how many work in its marketing organization, which employs people at sites around the globe, including in Oregon. But it acknowledged its relationship with Accenture in a statement to The Oregonian/OregonLive. \"As we announced earlier this",
        "id": 2986406,
        "language": null,
        "link": "https://slashdot.org/story/25/06/21/0251208/intel-will-outsource-marketing-to-accenture-and-ai-laying-off-its-own-workers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel Will Outsource Marketing To Accenture and AI, Laying Off Its Own Workers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T10:53:29.527845+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T10:00:00+00:00",
        "description": "YouTube is quietly hosting Pac-Man Superfast within its \"Playables\" section. \"You'd be forgiven for not knowing about YouTube Playables,\" writes Ars Technica's Kyle Orland. \"Few seemed to note its official announcement last year as a collection of free-to-play web games built for the web using standard rendering APIs.\"\n \n\"The seeming competitor to Netflix's mobile gaming offerings is still described in an official FAQ as 'an experimental feature rolled out to select users in eligible countries/regions,' which doesn't make this post-Stadia gaming effort seem like a huge priority for Google.\" From the report: \nWeird origins aside, Pac-Man Superfast pretty much delivers what its name promises. While gameplay starts at an \"Easy\" speed that roughly matches the arcade original, the speed of both Pac-Man and the ghosts is slightly increased every few seconds (dying temporarily reduces the speed to a lower level). After a few minutes, you're advancing past the titular \"Super Fast\" speed to ex",
        "id": 2985496,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/21/0257244/youtube-is-hiding-an-excellent-official-high-speed-pac-man-mod-in-plain-sight?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Is Hiding An Excellent, Official High-Speed Pac-Man Mod In Plain Sight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T07:40:20.188821+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T07:00:00+00:00",
        "description": "French President Emmanuel Macron urged Europe to reassert itself as a global space power, warning that France risks being sidelined in the low Earth orbit satellite market dominated by players like SpaceX and China. Phys.Org reports: Macron spoke at the Paris Air Show in Le Bourget outside the French capital a day after France more than doubled its stake in satellite operator Eutelsat, the EU rival to Elon Musk's Starlink. Macron called for more investment as the European space industry struggles to remain competitive in the face of US and Chinese rivals. \"SpaceX has disrupted the market, Amazon is also getting involved. China is not far behind, and I think we all need to be very clear-headed,\" Macron said. Europe must become \"a space power once again, with France at its heart,\" he said. He warned that Europeans were \"on the verge of being completely\" squeezed out of the low Earth orbit (LEO) satellite constellation market.\n \nMacron said France and its partners should not be reliant o",
        "id": 2984671,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/21/0242226/macron-says-europe-must-become-space-power-again?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Macron Says Europe Must Become 'Space Power' Again",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T04:23:26.350043+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: SoftBank Group founder Masayoshi Son is envisaging setting up a $1 trillion industrial complex in Arizona that will build robots and artificial intelligence, Bloomberg News reported on Friday, citing people familiar with the matter. Son is seeking to team up with Taiwan Semiconductor Manufacturing Co for the project, which is aimed at bringing back high-end tech manufacturing to the U.S. and to create a version of China's vast manufacturing hub of Shenzhen, the report said.\n \nSoftBank officials have spoken with U.S. federal and state government officials to discuss possible tax breaks for companies building factories or otherwise investing in the industrial park, including talks with U.S. Secretary of Commerce Howard Lutnick, the report said. SoftBank is keen to have TSMC involved in the project, codenamed Project Crystal Land, but it is not clear in what capacity, the report said. It is also not clear the Taiwanese company would be in",
        "id": 2984061,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/20/2212217/softbanks-son-pitches-1-trillion-arizona-ai-hub?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SoftBank's Son Pitches $1 Trillion Arizona AI Hub",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T02:13:28.237169+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T02:10:00+00:00",
        "description": "The superyacht Bayesian, owned by UK tech tycoon Mike Lynch, has been recovered off the coast of Sicily nearly a year after it sank during a storm, killing Lynch, his daughter, and five others. Italian authorities hope the $30 million salvage will uncover the cause of the sinking, which is under investigation for suspected manslaughter amid concerns about design flaws and storm vulnerability. The Guardian reports: The white top and blue hull of the 56-meter (184ft) vessel emerged from the depths of the sea in a holding area of a yellow floating crane barge, as salvage crews readied it to be hauled ashore for further investigation. The Italian coastguard said the recovery was scheduled to begin on Saturday morning. A spokesperson for TMC Maritime, which is conducting the recovery operation, said the vessel had been slowly raised from the seabed, 50 meters (165ft) down, over the past three days to allow the steel lifting straps, slings and harnesses to be secured under the keel.\n \nThe o",
        "id": 2983652,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/20/2158226/sunken-superyacht-of-uk-tech-tycoon-mike-lynch-recovered-near-sicily?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sunken Superyacht of UK Tech Tycoon Mike Lynch Recovered Near Sicily",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T02:13:28.409302+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T01:30:00+00:00",
        "description": "An anonymous reader quotes a report from MacRumors: To comply with a new regulation that takes effect today, Apple has added an energy efficiency label to its iPhone and iPad pages in EU countries. Apple is also required to start including a printed version of the label with the devices sold there. The label grades a given iPhone or iPad model's energy efficiency from a high of A to a low of G, based on the EU's testing parameters. However, Apple said that certain aspects of the testing methods outlined by the European Commission are \"ambiguous,\" so it chose to be conservative with its scores until testing is standardized.\n \nIn a 44-page document (PDF) detailing its testing methodology for the labels, Apple said its current iPhone models qualified for the highest energy efficiency grade of A, but the company voluntarily downgraded these scores to a B as a cautionary measure. The label also provides details about a given iPhone or iPad model's battery life per full charge cycle, repair",
        "id": 2983653,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/06/20/2034241/apple-adds-energy-and-battery-labels-to-iphone-and-ipad-pages-in-eu?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Adds Energy and Battery Labels To iPhone and iPad Pages In EU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T01:08:34.286278+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T00:50:00+00:00",
        "description": "Ancient Slashdot reader Alain Williams shares a report from The Guardian: The BBC is threatening legal action against Perplexity AI, in the corporation's first move to protect its content from being scraped without permission to build artificial intelligence technology. The corporation has sent a letter to Aravind Srinivas, the chief executive of the San Francisco-based startup, saying it has gathered evidence that Perplexity's model was \"trained using BBC content.\" The letter, first reported by the Financial Times, threatens an injunction against Perplexity unless it stops scraping all BBC content to train its AI models, and deletes any copies of the broadcaster's material it holds unless it provides \"a proposal for financial compensation.\"\n \nThe legal threat comes weeks after Tim Davie, the director general of the BBC, and the boss of Sky both criticised proposals being considered by the government that could let tech companies use copyright-protected work without permission. \"If we",
        "id": 2983468,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/20/2022200/bbc-threatens-legal-action-against-perplexity-ai-over-content-scraping?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "BBC Threatens Legal Action Against Perplexity AI Over Content Scraping",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T01:08:34.462624+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T00:10:00+00:00",
        "description": "According to Bloomberg (paywalled), Meta reportedly explored acquiring Perplexity AI but the deal fell through, with conflicting accounts on whether it was mutual or Perplexity backed out. Instead, Meta invested $14.3 billion in Scale AI, taking a 49% stake as part of its broader push to catch up with OpenAI and Google in the AI race.\n \n\"Meta's attempt to purchase Perplexity serves as the latest example of Mark Zuckerberg's aggressive push to bolster his company's AI efforts amid fierce competition from OpenAI and Google parent Alphabet,\" reports CNBC. \"Zuckerberg has grown agitated that rivals like OpenAI appear to be ahead in both underlying AI models and consumer-facing apps, and he is going to extreme lengths to hire top AI talent.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Discussed+Buying+Perplexity+Before+Investing+In+Scale+AI%3A+https%3A%2F%2Fmeta.slashdot.org%2Fstory%2F25%2F06%2F20%2F2015248%2F%3F",
        "id": 2983469,
        "language": null,
        "link": "https://meta.slashdot.org/story/25/06/20/2015248/meta-discussed-buying-perplexity-before-investing-in-scale-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Discussed Buying Perplexity Before Investing In Scale AI",
        "vote": 0
    }
]