[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T21:05:03.572651+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T20:00:17+00:00",
        "description": "Rematch is Sloclap’s latest project and a solid attempt at creating a football game aimed at more casual players. But that doesn’t mean that it wouldn’t be able to keep veterans of the genre entertained. Simplified controls, game modes, and match rules make it very accessible to beginners while also being quite rewarding for more seasoned players. \n\nWhile the game’s matchmaking and online performance requires a bit of fine-tuning from Sloclap, its performance on the PS5 is commendable with no crashes and minor bugs that do not ruin gameplay in any way. While its audio could have done more to enhance the experience, it is passable and does the job without any extra flair. Overall, Rematch is a solid game that has the potential to get even better with Sloclap ironing out its kinks.",
        "id": 2988300,
        "language": null,
        "link": "https://www.youtube.com/watch?v=PgepiJYR3lk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PgepiJYR3lk/hqdefault.jpg",
        "title": "Rematch Review - An Excellent Fit For Casual And Veteran Football Fans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T15:40:19.852785+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T15:30:06+00:00",
        "description": "Konami has been making moves towards reintroducing its lost franchises to a new audience, and its crown jewel Metal Gear Solid is also getting that treatment with the upcoming release of Metal Gear Solid Delta: Snake Eater. \n\nIt looks great and should serve as a great jumping off point for newcomers, but the biggest pain point for any Metal Gear Solid fan is the lack of a remaster for MGS4. \n\nGuns of the Patriots is a beautiful game that deserves to be experienced by so many more fans, but sadly its locked on a console that’s two generations old at this point. It’s an important game from both a narrative and a gameplay standpoint, so Konami should put in the efforts to preserve this piece of history for the future generations.",
        "id": 2986790,
        "language": null,
        "link": "https://www.youtube.com/watch?v=IG9YcZmlb2w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IG9YcZmlb2w/hqdefault.jpg",
        "title": "17 Years Later, We Are Still Itching For A METAL GEAR SOLID 4 REMASTER/REMAKE...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T14:35:04.973850+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-21T13:30:51+00:00",
        "description": "It's incredible to look back on Kojima Productions' Death Stranding and realize that the sequel is coming nearly six years later. Death Stranding 2: On the Beach launches on June 26th for PS5, and while it continues the story of Sam Porter Bridges, there are so many new features and improvements.\n\nCombat is heavily emphasized, with players getting new weapons, including grenade launchers and even tools like the Blood Boomerang. Vehicles have also improved and can be equipped with turrets or grapples to pick up cargo. You can now connect two ladders to cross large gaps, and even Sam himself is more lithe than before.\n\nThat doesn't even begin to describe all the changes to the characters or the world as a whole, which features natural disasters and environmental changes that can outright disrupt gameplay. Join us as we outline the 15 biggest differences between Death Stranding and Death Stranding 2: On the Beach.",
        "id": 2986432,
        "language": null,
        "link": "https://www.youtube.com/watch?v=peMVK823Tzk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/peMVK823Tzk/hqdefault.jpg",
        "title": "Death Stranding 2 vs Death Stranding 1 - 15 BIGGEST DIFFERENCES You Need To Know",
        "vote": 0
    }
]