[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T23:51:26+00:00",
        "description": "Meta is testing an AI feature that generates comment suggestions for Instagram posts. Users with access to the test see a pencil icon beside the comment field that activates \"Write with Meta AI.\" The system analyzes photos before offering three comment suggestions, which users can refresh for alternatives. For a photo showing someone smiling with a thumbs-up in their living room, suggested comments include \"Cute living room setup\" and \"Love the cozy atmosphere.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Spotted+Testing+AI-Generated+Comments+on+Instagram%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F21%2F2246239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F21%2F2246239%2Fmeta-spotted-testing-ai-generated-comments-on-ins",
        "id": 2379889,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/21/2246239/meta-spotted-testing-ai-generated-comments-on-instagram?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Spotted Testing AI-Generated Comments on Instagram",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T19:31:26+00:00",
        "description": "Higher use of chatbots like ChatGPT may correspond with increased loneliness and less time spent socializing with other people, according to new research from OpenAI in partnership with the Massachusetts Institute of Technology. From a report: Those who spent more time typing or speaking with ChatGPT each day tended to report higher levels of emotional dependence on, and problematic use of, the chatbot, as well as heightened levels of loneliness, according to research released Friday. The findings were part of a pair of studies conducted by researchers at the two organizations and have not been peer reviewed. \n\nSan Francisco-based OpenAI sees the new studies as a way to get a better sense of how people interact with, and are affected by, its popular chatbot. \"Some of our goals here have really been to empower people to understand what their usage can mean and do this work to inform responsible design,\" said Sandhini Agarwal, who heads OpenAI's trustworthy AI team and co-authored the ",
        "id": 2378429,
        "language": null,
        "link": "https://slashdot.org/story/25/03/21/1851233/openai-study-finds-links-between-chatgpt-use-and-loneliness?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Study Finds Links Between ChatGPT Use and Loneliness",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T18:27:12+00:00",
        "description": "The U.S. Treasury Department's sanctions watchdog removed cryptocurrency mixing tool Tornado Cash from its global blacklist on Friday, following a federal appeals court ruling last November that the Office of Foreign Asset Control couldn't sanction its smart contracts. Despite the delisting of over 100 Ethereum addresses from the Specially Designated Nationals list, Treasury Secretary Scott Bessent emphasized continuing concerns about North Korea's digital asset theft operations. \n\n\"We remain deeply concerned about the significant state-sponsored hacking and money laundering campaign aimed at stealing, acquiring, and deploying digital assets for the Democratic People's Republic of Korea,\" Treasury stated. Roman Storm, Tornado Cash co-founder, still faces a July criminal trial for his alleged development role. A Treasury court filing Monday had warned that completely lifting sanctions could have \"significantly disruptive consequences for national security.\"<p><div class=\"share_submiss",
        "id": 2377918,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/21/1611253/us-removes-tornado-cash-sanctions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Removes Tornado Cash Sanctions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T17:21:50+00:00",
        "description": "Microsoft has begun urging Windows 10 users to upgrade their systems ahead of the October 14, 2025 support deadline, but with a solution many find impractical: just buy a new computer. According to StatCounter data, 58.7% of Windows users remain on Windows 10 despite the impending end of security updates and technical assistance. \n\nIn emails to Windows 10 users, Microsoft's primary recommendation is to trade in old devices for newer Windows 11-compatible hardware, rather than focusing on alternative solutions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Tells+Windows+10+Users+To+Buy+New+PCs%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F21%2F1623227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F21%2F1623227%2Fmicrosof",
        "id": 2377411,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/21/1623227/microsoft-tells-windows-10-users-to-buy-new-pcs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Tells Windows 10 Users To Buy New PCs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T16:17:09+00:00",
        "description": "Yahoo on Friday said it has struck a deal to sell TechCrunch, the 20-year-old tech journalism site, to Regent, a media investment firm. Axios: Yahoo's business centers mostly on aggregation. Journalism isn't its core focus. Regent is trying to pull together a portfolio of tech news sites and is eager to invest in news. Earlier this week, it acquired Foundry, which houses a slew of online tech publications, such as PCWorld, Macworld and TechAdvisor. \n\nIn a statement, Regent said it is \"thrilled to expand its reach as it provides breaking technology news, opinions, and analysis on tech companies worldwide to our audience.\" Financial deal terms were not disclosed. The deal will not require regulatory review, which is normally needed for deals valued at roughly more than $100 million.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Yahoo+Sells+TechCrunch%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F21%2F155021",
        "id": 2376893,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/21/1550212/yahoo-sells-techcrunch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Yahoo Sells TechCrunch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T15:12:12+00:00",
        "description": "Google has filed a lawsuit against alleged scammers who created and sold fake business profiles on Google Maps, the company said. The legal action follows an investigation that uncovered and eliminated more than 10,000 illegitimate listings. \n\nThe investigation began after a Texas business reported an unlicensed locksmith impersonating them on the platform. Google discovered the scams primarily targeted \"duress verticals\" -- services needed in urgent situations like locksmiths and towing companies. \"Once we're alerted to the actual fraud, we take extreme efforts to identify similar fraudulent listings,\" said Halimah DeLaine Prado, Google's general counsel. \n\nThe scammers used tactics including bait-and-switch schemes and intercepting calls to legitimate businesses through \"lead generation services.\" They also sold fraudulent positive reviews to suppress negative feedback.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?sta",
        "id": 2376322,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/21/1126233/google-sues-scammers-over-fake-maps-listings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Sues Scammers Over Fake Maps Listings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T14:07:46+00:00",
        "description": "European Central Bank Chief Economist Philip Lane warned that Europe must develop a digital euro to counter growing American influence over the continent's financial system [alternative source] amid escalating geopolitical tensions. Lane specifically cited Europe's \"current dependence on US payment-card providers Visa and Mastercard, as well as technology companies including PayPal, Apple and Google\" as a vulnerability requiring urgent action. \n\nHis comments come as President Donald Trump's administration promotes dollar-backed stablecoins worldwide as part of a broader cryptocurrency strategy, alarming European officials. ECB Governing Council member Francois Villeroy de Galhau recently cautioned that \"the US risks bringing about the next financial emergency through its support of cryptocurrencies.\" \n\n\"The digital euro is not just about adapting to the digital age. It is about ensuring Europe controls its monetary and financial destiny,\" Lane told a conference in Ireland, noting tha",
        "id": 2375596,
        "language": null,
        "link": "https://slashdot.org/story/25/03/21/0658224/european-central-bank-chief-economist-warns-of-us-financial-dominance?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "European Central Bank Chief Economist Warns of US Financial Dominance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T14:07:46+00:00",
        "description": "Nvidia CEO Jensen Huang on Thursday walked back comments he made in January, when he cast doubt on whether useful quantum computers would hit the market in the next 15 years. From a report: At Nvidia's \"Quantum Day\" event, part of the company's annual GTC Conference, Huang admitted that his comments came out wrong. \"This is the first event in history where a company CEO invites all of the guests to explain why he was wrong,\" Huang said. \n\nIn January, Huang sent quantum computing stocks reeling when he said 15 years was \"on the early side\" in considering how long it would be before the technology would be useful. He said at the time that 20 years was a timeframe that \"a whole bunch of us would believe.\" In his opening comments on Thursday, Huang drew comparisons between pre-revenue quantum companies and Nvidia's early days. He said it took over 20 years for Nvidia to build out its software and hardware business. \n\nHe also expressed surprise that his comments were able to move markets,",
        "id": 2375597,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/21/0439241/nvidia-ceo-huang-says-he-was-wrong-about-timeline-for-quantum?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia CEO Huang Says He Was Wrong About Timeline For Quantum",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T07:55:05+00:00",
        "description": "Controversial facial recognition company Clearview AI attempted to purchase hundreds of millions of arrest records including social security numbers, mugshots, and even email addresses to incorporate into its product, 404 Media reports. From the report: For years, Clearview AI has collected billions of photos from social media websites including Facebook, LinkedIn and others and sold access to its facial recognition tool to law enforcement. The collection and sale of user-generated photos by a private surveillance company to police without that person's knowledge or consent sparked international outcry when it was first revealed by the New York Times in 2020. \n\nNew documents obtained by 404 Media reveal that Clearview AI spent nearly a million dollars in a bid to purchase \"690 million arrest records and 390 million arrest photos\" from all 50 states from an intelligence firm. The contract further describes the records as including current and former home addresses, dates of birth, arr",
        "id": 2373638,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/20/1925212/clearview-attempted-to-buy-social-security-numbers-and-mugshots-for-its-database?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Clearview Attempted To Buy Social Security Numbers and Mugshots for its Database",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T04:40:07+00:00",
        "description": "President Trump signed a long-expected executive action on Thursday calling on U.S. Education Secretary Linda McMahon to \"take all necessary steps to facilitate the closure of the Department of Education and return authority over education to the States and local communities.\" From a report: \"We're going to be returning education, very simply, back to the states where it belongs,\" Trump said. \"And this is a very popular thing to do, but much more importantly, it's a common sense thing to do, and it's going to work, absolutely.\" \n\nThe move has been expected since early February, when the White House revealed its intentions but withheld the action until after McMahon's Senate confirmation. It now arrives more than a week after the Trump administration has already begun sweeping layoffs at the Education Department. According to the administration's own numbers, Trump inherited a department with 4,133 employees. Nearly 600 workers have since chosen to leave, by resigning or retiring. And",
        "id": 2372870,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/21/044244/trump-signs-order-aiming-to-close-the-education-department?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Signs Order Aiming To Close the Education Department",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T02:29:55+00:00",
        "description": "LG is shutting down Art Lab, its NFT marketplace for TVs. From a report: In a notice posted to its website, LG says it has made the \"difficult decision\" to close the platform on June 17th. LG launched its Art Lab app during the NFT craze in 2022, billing it as a way to \"buy, sell and enjoy high-quality digital artwork\" from your TV. It added new digital art to the platform through \"groundbreaking\" NFT drops, which users could purchase by scanning a QR code to complete transactions through Wallypto, LG's crypto wallet app.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=LG's+NFT+Marketplace+For+TVs+is+Shutting+Down%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F03%2F20%2F1834218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F",
        "id": 2372436,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/20/1834218/lgs-nft-marketplace-for-tvs-is-shutting-down?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "LG's NFT Marketplace For TVs is Shutting Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-21T00:19:53+00:00",
        "description": "Scientists at Zhejiang University have created the world's smallest LED display, featuring pixels just 90 nanometers wide -- roughly the size of a typical virus and too tiny to be seen with optical microscopes. The breakthrough, described in Nature this week, uses perovskite semiconductors that maintain brightness even at microscopic scales, giving them an advantage over conventional LEDs. \n\nThe research team, led by Baodan Zhao, also demonstrated a larger display with pixels measuring about 100 micrometers (human hair width) that successfully rendered images including a spinning globe.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=World's+Tiniest+LED+Display+Has+Pixels+Smaller+Than+a+Virus%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F03%2F20%2F1910204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.co",
        "id": 2371948,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/20/1910204/worlds-tiniest-led-display-has-pixels-smaller-than-a-virus?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "World's Tiniest LED Display Has Pixels Smaller Than a Virus",
        "vote": 0
    }
]