[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-10T15:30:17+00:00",
        "description": "As a long-time fan of Garou: Mark of the Wolves, it's exciting to finally see it get a sequel as Fatal Fury: City of the Wolves launches on April 24th for Xbox Series X/S, PS4, PS5, and PC. However, much has changed this time beyond the new characters and art direction.\n\nFamiliar mechanics like Gears, Just Defend, and T.O.P. (now S.P.G.) return, but players can experiment even more with combos and special moves thanks to the REV System. You also have a choice between the classic Arcade fighting style or Smart style for easily executing techniques and combos. Even the single-player modes are more extensive than ever, thanks to the new Episodes of South Town and its RPG-lite elements.\n\nMultiplayer fans will also find plenty to like with rollback netcode and cross-platform play alongside the usual Casual, Ranked and Room Matches. Here are 15 things you should know about Fatal Fury: City of the Wolves before it arrives later this month.",
        "id": 2527515,
        "language": null,
        "link": "https://www.youtube.com/watch?v=HcABQSokZgs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HcABQSokZgs/hqdefault.jpg",
        "title": "Fatal Fury: City of Wolves - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-10T10:01:15+00:00",
        "description": "2025 is shaping up to be a huge year for video games as a number of games are already confirmed to be releasing in the coming weeks and months. However, besides the GTAs, Metal Gears, Witchers and the likes, there are a number of exciting new games that are coming out in the future. \n\nIn this video we take a look at 15 such games that we are super hyped about.",
        "id": 2525683,
        "language": null,
        "link": "https://www.youtube.com/watch?v=mS5LBoMF7qc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mS5LBoMF7qc/hqdefault.jpg",
        "title": "15 Upcoming Games We CAN’T STOP Thinking About",
        "vote": 0
    }
]