[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T23:37:12+00:00",
        "description": "Longtime Slashdot reader frank_adrian314159 writes: According to an article in Wired, Elon Musk has appointed a team of technologists from DOGE to \"rewrite the code that runs the SSA in months.\" This codebase has over 60 million lines of COBOL and handles record keeping for all American workers and payments for all Social Security recipients. Given that the code has to track the byzantine regulations dealing with Social Security, it's no wonder that the codebase is this large. What is in question though is whether a small team can rewrite this code \"in months.\" After all, what could possibly go wrong? \"The project is being organized by Elon Musk lieutenant Steve Davis ... and aims to migrate all SSA systems off COBOL ... and onto a more modern replacement like Java within a scheduled tight timeframe of a few months,\" notes Wired.\n \n\"Under any circumstances, a migration of this size and scale would be a massive undertaking, experts tell WIRED, but the expedited deadline runs the risk ",
        "id": 2434327,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/28/2148205/doge-to-rewrite-ssa-codebase-in-months?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DOGE To Rewrite SSA Codebase In 'Months'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T23:37:12+00:00",
        "description": "A breach of legacy Cerner servers at Oracle Health exposed patient data from multiple U.S. hospitals and healthcare organizations, with threat actors using compromised customer credentials to steal the data before it had been migrated to Oracle Cloud. Despite confirming the breach privately, Oracle Health has yet to publicly acknowledge the incident. BleepingComputer reports: Oracle Health, formerly known as Cerner, is a healthcare software-as-a-service (SaaS) company offering Electronic Health Records (EHR) and business operations systems to hospitals and healthcare organizations. After being acquired by Oracle in 2022, Cerner was merged into Oracle Health, with its systems migrated to Oracle Cloud. In a notice sent to impacted customers and seen by BleepingComputer, Oracle Health said it became aware of a breach of legacy Cerner data migration servers on February 20, 2025.\n \n\"We are writing to inform you that, on or around February 20, 2025, we became aware of a cybersecurity event",
        "id": 2434328,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/28/2025251/oracle-health-breach-compromises-patient-data-at-us-hospitals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Oracle Health Breach Compromises Patient Data At US Hospitals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T22:32:20+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Trevor Milton, the founder of electric vehicle start-up Nikola who was sentenced to prison last year, was pardoned by Donald Trump late on Thursday, the White House confirmed on Friday. The pardon of Milton, who was sentenced to four years in prison for exaggerating the potential of his technology, could wipe out hundreds of millions of dollars in restitution that prosecutors were seeking for defrauded investors. Milton and his wife donated more than $1.8 million to a Trump re-election campaign fund less than a month before the November election, according to the Federal Election Commission.\n \nAt Milton's trial, prosecutors say a company video of a prototype truck appearing to be driven down a desert highway was actually a video of a non-functioning Nikola that had been rolled down a hill. Milton had not been incarcerated pending an appeal. Milton said late on Thursday on social media and via a press release that he had been pard",
        "id": 2433977,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/28/2041200/trump-pardons-founder-of-electric-vehicle-start-up-nikola-trevor-milton?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Pardons Founder of Electric Vehicle Start-Up Nikola, Trevor Milton",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T22:32:20+00:00",
        "description": "Elon Musk says its xAI company has acquired the social media platform X in an all-stock transaction. \"The combination values xAI at $80 billion and X at $33 billion ($45 billion less $12 billion debt),\" said Musk. He writes on X: Since its founding two years ago, xAI has rapidly become one of the leading AI labs in the world, building models and data centers at unprecedented speed and scale. X is the digital town square where more than 600M active users go to find the real-time source of ground truth and, in the last two years, has been transformed into one of the most efficient companies in the world, positioning it to deliver scalable future growth.\n \nxAI and X's futures are intertwined. Today, we officially take the step to combine the data, models, compute, distribution and talent. This combination will unlock immense potential by blending xAI's advanced AI capability and expertise with X's massive reach. The combined company will deliver smarter, more meaningful experiences to b",
        "id": 2433976,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/28/2156237/xai-acquires-x?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "xAI Acquires X",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T21:28:18+00:00",
        "description": "An anonymous reader shares a report: New data recently released by the Environmental Protection Agency indicate that more than 158 million people across the U.S. have drinking water contaminated by toxic \"forever chemicals,\" scientifically known as perfluoroalkyl and polyfluoroalkyl substances (PFAS). \n\n\"Drinking water is a major source of PFAS exposure. The sheer number of contaminated sites shows that these chemicals are likely present in most of the U.S. water supply,\" said David Andrews, deputy director of investigations and a senior scientist at the Environmental Working Group (EWG), a nonprofit advocacy organization, in a recent press release.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nearly+Half+of+People+in+the+US+Have+Toxic+PFAS+in+Their+Drinking+Water%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F03%2F28%2F1959225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/s",
        "id": 2433607,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/28/1959225/nearly-half-of-people-in-the-us-have-toxic-pfas-in-their-drinking-water?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nearly Half of People in the US Have Toxic PFAS in Their Drinking Water",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T21:28:18+00:00",
        "description": "Smart TV platforms are increasingly monitoring what appears on users' screens through Automatic Content Recognition (ACR) technology, building detailed viewer profiles for targeted advertising. \n\nRoku, which transitioned from a hardware company to an advertising powerhouse, reported $3.5 billion in annual ad revenue for 2024 -- representing 85% of its total income. The company has aggressively acquired ACR-related firms, with Roku-owned technology winning an Emmy in 2023 for advancements in the field. \n\nAccording to market research firm Antenna, 43% of all streaming subscriptions in the United States were ad-supported by late 2024, showing the industry's shift toward advertising-based models. Most users unknowingly consent to this monitoring when setting up their devices. Though consumers can technically disable ACR in their TV settings, doing so often restricts functionality.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/hom",
        "id": 2433608,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/28/1944230/smart-tvs-are-employing-screen-monitoring-tech-to-harvest-user-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Smart TVs Are Employing Screen Monitoring Tech To Harvest User Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T20:05:04+00:00",
        "description": "An anonymous reader shares a report: Amnesty International published a new report this week detailing attempted hacks against two Serbian journalists, allegedly carried out with NSO Group's spyware Pegasus. The two journalists, who work for the Serbia-based Balkan Investigative Reporting Network (BIRN), received suspicious text messages including a link -- basically a phishing attack, according to the nonprofit. In one case, Amnesty said its researchers were able to click on the link in a safe environment and see that it led to a domain that they had previously identified as belonging to NSO Group's infrastructure. \n\n\"Amnesty International has spent years tracking NSO Group Pegasus spyware and how it has been used to target activists and journalists,\" Donncha O Cearbhaill, the head of Amnesty's Security Lab, told TechCrunch. \"This technical research has allowed Amnesty to identify malicious websites used to deliver the Pegasus spyware, including the specific Pegasus domain used in th",
        "id": 2433082,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/28/1915238/again-and-again-nso-groups-customers-keep-getting-their-spyware-operations-caught?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Again and Again, NSO Group's Customers Keep Getting Their Spyware Operations Caught",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T20:05:04+00:00",
        "description": "Stanford University researchers have proposed creating \"bodyoids\" -- ethically sourced human bodies grown from stem cells without neural components for consciousness or pain sensation -- to revolutionize medical research and address organ shortages. In a new opinion piece published in MIT Technology Review, scientists Carsten T. Charlesworth, Henry T. Greely, and Hiromitsu Nakauchi argue that recent advances in biotechnology make this concept increasingly plausible. The approach would combine pluripotent stem cells, artificial uterus technology, and genetic techniques to inhibit brain development. \n\nThe researchers point to persistent shortages of human biological materials as a major bottleneck in medical progress. More than 100,000 patients currently await solid organ transplants in the US alone, while less than 15% of drugs entering clinical trials receive regulatory approval. These lab-grown bodies could potentially generate patient-specific organs that are perfect immunological ",
        "id": 2433081,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/28/1933234/scientists-propose-bodyoids-to-address-medical-research-and-organ-shortage-challenges?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Propose 'Bodyoids' To Address Medical Research and Organ Shortage Challenges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T19:00:05+00:00",
        "description": "Fake movie trailers created with AI are proliferating across YouTube, with some garnering more views than official studio releases -- and Hollywood studios are quietly profiting from the phenomenon rather than shutting it down. Instead of enforcing copyright on these unauthorized videos, Warner Bros. Discovery, Sony Pictures, and Paramount are claiming monetization rights, directing ad revenue from fake trailers for films like \"Superman\" and \"Gladiator II\" into studio coffers, according to a Deadline investigation published Friday. \n\nYouTube channels like Screen Culture, which has amassed 1.4 billion views, merge official footage with AI-generated imagery to create convincing trailer mockups that frequently rank higher in search results than legitimate studio releases. \"Monetizing unauthorized, unwanted, and subpar uses of human-centered IP is a race to the bottom,\" SAG-AFTRA told Deadline, condemning studios for profiting from content that exploits performers without permission.<p><",
        "id": 2432607,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/28/1757237/inside-youtubes-weird-world-of-fake-movie-trailers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Inside YouTube's Weird World Of Fake Movie Trailers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T19:00:05+00:00",
        "description": "An anonymous reader shares a report: A former director of data science at the UK prime minister's office has told MPs that people working with data in government are not typically technical and would be unlikely to get a similar job in the private sector. \n\nIn a hearing designed to illuminate the challenges facing the Department for Science, Innovation and Technology (DSIT) as it strives to become the digital centre for government, MPs quizzed Laura Gilbert, head of AI for Government, at the Ellison Institute and former director of data science at 10 Downing Street, the prime ministers' office. \n\nMembers of the House of Common's Science, Innovation and Technology Committee wanted to know about the performance of the Government Digital Service, which in January was moved from the Cabinet Office to DSIT and merged with Central Digital and Data Office (CDDO), the Incubator for AI (i.AI). Gilbert, a particle physicist who has worked in a number of tech industry roles, said one of the cha",
        "id": 2432606,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/28/184236/uk-govt-data-people-not-technical-says-ex-downing-st-data-science-head?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Govt Data People Not Technical, Says Ex-Downing St Data Science Head",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T17:54:58+00:00",
        "description": "The College Board, described as a $2 billion nonprofit, functions as the primary gatekeeper for academic success within American higher education, according to an analysis by Bloomberg. The organization significantly shapes university admissions by controlling not only who gains entry to college but also influencing what students know upon arrival. \n\nThis central role in managing and defining higher education admissions positions the Board uniquely. The story adds: The College Board writes the curriculum for 40 AP courses, administers and grades the exams, oversees the PSAT and SAT, and offers a variety of free and paid resources to help prepare for the courses and tests. Many students will wind up paying the company north of $1,000 over the course of their high school career. \"If the same people can create the content and create the tests, that's a really great business model where you've got the whole public secondary education system wrapped up in one little company,\" says Jon Boe",
        "id": 2432158,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/28/1657245/want-to-go-to-college-pay-the-college-board?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Want To Go To College? Pay the College Board",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T16:49:57+00:00",
        "description": "An anonymous reader shares a report: Staff at the Federal Trade Commission have been instructed to no longer refer to the agency as \"independent\" in complaints, according to an email obtained by The Verge.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FTC+Tells+Staff+To+Stop+Calling+the+Agency+'Independent'+in+Complaints%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F03%2F28%2F1557221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F03%2F28%2F1557221%2Fftc-tells-staff-to-stop-calling-the-agency-independent-in-complaints%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/25/03/28/1557221/ftc-tells-staff-to-stop-calling-the-agenc",
        "id": 2431530,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/28/1557221/ftc-tells-staff-to-stop-calling-the-agency-independent-in-complaints?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FTC Tells Staff To Stop Calling the Agency 'Independent' in Complaints",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T15:45:50+00:00",
        "description": "A Nature survey has found that three-quarters of responding U.S. scientists are considering leaving the nation following disruptions to science under the Trump administration. \n\nOut of 1,608 respondents, 75.3% said they were contemplating leaving the country. Scientists cited concerns over research funding and the general treatment of science as contributing factors for their reasoning. Europe and Canada were mentioned as potential destinations for those looking for opportunities abroad.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=75%25+of+Scientists+in+Nature+Poll+Weigh+Leaving+US%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F03%2F28%2F1526209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F03%2F28%2F1526209%2F75-of-scientists-in-n",
        "id": 2430859,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/28/1526209/75-of-scientists-in-nature-poll-weigh-leaving-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "75% of Scientists in Nature Poll Weigh Leaving US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T15:45:50+00:00",
        "description": "theodp writes: \"As I prepared for a White House meeting last fall on the nation's electricity needs,\" begins Microsoft President Brad Smith in The Country Needs More Electricity --And More Electricians, a Fox Business op-ed. \"I met with the leaders at Microsoft who are building our AI infrastructure across the country. During our discussion, I asked them to identify the single biggest challenge for data center expansion in the U.S. I expected they would mention slow permitting, delays in bringing more power online or supply chain constraints -- all significant challenges. But instead, they highlighted a national shortage of people. Electricians, to be precise.\" \n\nMuch as Smith has done in the past as he declared crisis-level shortages of Computer Science, cybersecurity, and AI talent, he's calling for the nation's politicians and educators to step up to the plate and deliver students trained to address the data center expansion plans of Microsoft and Big Tech.\n\n\"How many new electric",
        "id": 2430860,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/28/1447203/microsoft-president-calls-for-a-national-talent-strategy-for-electricians?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft President Calls For a National Talent Strategy For Electricians",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T14:36:52+00:00",
        "description": "SoftBank Group plans to create industrial parks for AI across the US and is considering an investment of more than $1 trillion, Nikkei reported. From a report: Founder and Chief Executive Officer Masayoshi Son is expected to visit the US to discuss his ideas for such industrial parks, the newspaper said. The factories would likely use AI-equipped robots that would operate autonomously because of labor shortages in the country, according to the report. \n\nSon teamed up with OpenAI and Oracle in January to unveil a $100 billion joint venture to fund AI infrastructure in the US, one of the first such pledges after Donald Trump became president. They said at the time they would deploy $100 billion immediately with the goal of increasing that to at least $500 billion for data centers and physical campuses.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SoftBank+May+Pledge+More+Than+%241+Trillion+for+AI+Effort+in+US%2C+Ni",
        "id": 2430299,
        "language": null,
        "link": "https://slashdot.org/story/25/03/28/1335217/softbank-may-pledge-more-than-1-trillion-for-ai-effort-in-us-nikkei-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SoftBank May Pledge More Than $1 Trillion for AI Effort in US, Nikkei Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T10:15:55+00:00",
        "description": "The Register: Following our report last week on IBM's ongoing layoffs, current and former employees got in touch to confirm what many suspected: The US cuts run deeper than reported, and the jobs are heading to India. IBM's own careers site numbers back that up. On January 7, 2024, Big Blue listed just 173 open positions in India. On November 23, 2024, there were 2,946 jobs available in the nation. At the time of writing, the IT titan listed 3,866 roles in India. \n\nAmerican jobs listed for these three periods are 192, 376, and 333, respectively, though at least among those being laid off, there's doubt those roles will be filled with job seekers in the States. A current IBMer who won't be there much longer said that after being told to teach recently hired workers in India \"everything I know,\" the reward was a resource action, or RA -- Big Blue's euphemism for a layoff. After receiving an RA notification, employees typically have a set period of time to apply for open roles elsewhere",
        "id": 2428311,
        "language": null,
        "link": "https://slashdot.org/story/25/03/28/0623217/ibm-us-cuts-may-run-deeper-than-feared---and-the-jobs-are-heading-to-india?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "IBM US Cuts May Run Deeper Than Feared - and the Jobs Are Heading To India",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T08:05:56+00:00",
        "description": "Anthropic researchers have developed a breakthrough \"cross-layer transcoder\" (CLT) that functions like an fMRI for large language models, mapping how they process information internally. Testing on Claude 3.5 Haiku, researchers discovered the model performs longer-range planning for specific tasks -- such as selecting rhyming words before constructing poem sentences -- and processes multilingual concepts in a shared neural space before converting outputs to specific languages. \n\nThe team also confirmed that LLMs can fabricate reasoning chains, either to please users with incorrect hints or to justify answers they derived instantly. The CLT identifies interpretable feature sets rather than individual neurons, allowing researchers to trace entire reasoning processes through network layers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+Maps+AI+Model+'Thought'+Processes%3A+https%3A%2F%2Fslashdot.org%2Fstory%",
        "id": 2427580,
        "language": null,
        "link": "https://slashdot.org/story/25/03/28/0614200/anthropic-maps-ai-model-thought-processes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anthropic Maps AI Model 'Thought' Processes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T08:05:56+00:00",
        "description": "As NASA faces potential budget cuts, China is unveiling an ambitious series of deep space missions -- including Mars sample returns, outer planet exploration, and a future Mars base. While some of China's plans are aspirational, their track record of successful missions lends credibility to their expanding role in space. Ars Technica reports: China created a new entity called the \"Deep Space Exploration Laboratory\" three years ago to strengthen the country's approach to exploring the Solar System. Located in eastern China, not far from Shanghai, the new laboratory represented a partnership between China's national space agency and a local public college, the University of Science and Technology of China.\n \nNot much is known outside of China about the laboratory, but it has recently revealed some very ambitious plans to explore the Solar System, including the outer planets. This week, as part of a presentation, Chinese officials shared some public dates about future missions. Space jo",
        "id": 2427579,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/28/0720237/as-nasa-faces-cuts-china-reveals-ambitious-plans-for-planetary-exploration?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "As NASA Faces Cuts, China Reveals Ambitious Plans For Planetary Exploration",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T08:05:56+00:00",
        "description": "An anonymous reader shares a report: For decades, India's economic promise has rested on its demographic dividend -- the competitive edge of a massive, young, and increasingly educated workforce. Economists and policymakers have routinely cited the country's population profile as its ticket to economic superpower status, with projections of reaching $10 trillion in GDP and achieving high-income status by 2047. These forecasts depend heavily on a critical assumption: that roughly 500 million Indians currently aged 5-24 will find productive employment as they enter the workforce over the next two decades. But a sobering new analysis from Bernstein suggests this fundamental premise may be crumbling under the weight of rapid advances in AI. \n\n\"The advent of AI threatens to erode all the advantages of India's rich demographic dividend,\" write Bernstein analysts Venugopal Garre and Nikhil Arela, who characterize their assessment as a potential \"doomsday scenario\" for a nation that has hitc",
        "id": 2427581,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/28/0421236/labor-arbitrage-rip?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Labor Arbitrage RIP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T08:05:56+00:00",
        "description": "An anonymous reader quotes a report from the Washington Post: Virginia is set to become the first state in the country to require some reckless drivers to put devices on their cars that make it impossible to drive too fast. D.C. passed similar legislation last year. Several other states, including Maryland, are considering joining them. It's an embrace of a technological solution to a human problem: Speeding contributes to more than 10,000 deaths a year. Under the Virginia legislation, a judge can decide to order drivers to install the speed limiters in their vehicles in lieu of taking away their driving privileges or sending them to jail. It takes effect in July 2026.\n \nDel. Patrick A. Hope (D-Arlington) said various advocacy groups, including Mothers Against Drunk Driving and the National Safety Council, gave him the idea. He drove a car outfitted with the technology and was impressed. \"It was easy to use, and once you're engaged it's impossible to go over the speed limit,\" he said",
        "id": 2427582,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/28/0019211/virginia-will-punish-fast-drivers-with-devices-that-limit-their-speed?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Virginia Will Punish Fast Drivers With Devices That Limit Their Speed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T00:37:02+00:00",
        "description": "Following OpenAI's viral Studio Ghibli moment, CEO Sam Altman says it has temporarily limited image generation in ChatGPT due to the overwhelming demand on its GPU infrastructure. \"It's super fun seeing people love images in ChatGPT, but our GPUs are melting,\" he posted on X today. The Verge reports: The demand crunch already caused the artificial intelligence company to push back availability of the built-in image generator for users on ChatGPT's free tier. But apparently that measure alone wasn't enough to ease the stress on OpenAI's infrastructure. (Altman said free users will \"soon\" be able to generate up to three images per day.)<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Says+'Our+GPUs+Are+Melting'+As+It+Limits+ChatGPT+Image+Generation+Requests%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F28%2F003227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon",
        "id": 2426349,
        "language": null,
        "link": "https://slashdot.org/story/25/03/28/003227/openai-says-our-gpus-are-melting-as-it-limits-chatgpt-image-generation-requests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Says 'Our GPUs Are Melting' As It Limits ChatGPT Image Generation Requests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T00:37:02+00:00",
        "description": "U.S. robotics companies, including Tesla and Boston Dynamics, are urging lawmakers to establish a national robotics strategy to keep pace with China's aggressive investment in AI-driven robotics. The Associated Press reports: Jeff Cardenas, co-founder and CEO of humanoid startup Apptronik, of Austin, Texas, pointed out to lawmakers that it was American carmaker General Motors that deployed the first industrial robot at a New Jersey assembly plant in 1961. But the U.S. then ceded its early lead to Japan, which remains a powerhouse of industrial robotics, along with Europe. The next robotics race will be powered by artificial intelligence and will be \"anybody's to win,\" Cardenas said in an interview after the closed-door meeting. \"I think the U.S. has a great chance of winning. We're leading in AI, and I think we're building some of the best robots in the world. But we need a national strategy if we're going to continue to build and stay ahead.\"\n \nThe Association for Advancing Automati",
        "id": 2426350,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/27/2351255/us-robotics-companies-push-for-national-strategy-to-compete-with-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Robotics Companies Push For National Strategy To Compete With China",
        "vote": 0
    }
]