[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T23:18:02+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Just finished Beautyland and curious what others thought. It was on a lot of &quot;best of 2024&quot; lists but got no nods from any prize committees. </p> <p>What are others&#39; opinions on the main character? Was she really an alien, or maybe she had autism or...? I&#39;m not entirely sure where to stand on that. I suspect it&#39;s more likely to be a result of neurodivergence than a sci-fi novel. It&#39;s not sci-fi. So then, did she just kill herself on the ferry at the end?</p> <p>There were other, less important loose ends that bothered me as well. She had a gift for acting, but that was just dropped on the floor after not receiving a scholarship. Her Italian teacher accused her of cheating, and nothing came of that. Suspicion of plagiarism is pretty serious in a private school like that and wouldn&#39;t just get swept under the rug. </p> <p>a couple of other things that just bothered me more generally. The idea that her book was so popular is",
        "id": 2434234,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm8l6c/beautyland_discussion",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Beautyland discussion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T22:45:07+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I recently started this audiobook and I don’t thing I’ve ever hated a narration of a book more. So far I’ve loved the book but it’s almost unbearable. I wasn’t aware who Santino Fontana was before listening and found out he’s a broadway singer. His monotone narration of all the songs is almost unbearable. When he gets to a song I will literally stop the audiobook and listen to the song off of the movie soundtrack then skip ahead in the book. AND THEN I go to buy The Institute by Stephen King on audible and I find out he narrates that book too. Who keeps hiring him to narrate books!? Why does he read in the most monotone voice ever?! </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/nickmillersscarecrow\"> /u/nickmillersscarecrow </a> <br/> <span><a href=\"https://www.reddit.com/r/books/comments/1jm7vir/ballad_of_songbirds_snakes_audiobook/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comme",
        "id": 2434235,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm7vir/ballad_of_songbirds_snakes_audiobook",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ballad of songbirds & snakes audiobook",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T22:16:29+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Just finished the book, and I have to admit I was blown away by it.</p> <p>Most of the booktubers I follow, deemed this as boring and while I do agree that for about 90 pages nothing really happens, it really picks up the pace from the 100 mark.The characters were so loveable though flawed. And I loved how patient both leads were with each other. </p> <p>But my favourite part of it was the commentery on love and relationships. Emma growing to learn how to love properly and Justin learning how to be more forgiving and empathetic, really spoke to me, like i couldnt help but see myself in them. The way it navigated Emmas trauma was also great imo, how she took accountability for her actions and did not really use the trauma as an excuse. I loved how everything wasnt okay immedietly and that it took her time to figure things out.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/okuneedtochill\"> /u/okuneedtochill </a>",
        "id": 2433854,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm78zu/just_for_the_summer_by_abby_jimenez_is_amazing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Just For the Summer by Abby Jimenez is amazing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T21:29:53+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I know, I know. The Vampire Chronicles are not for the week. This books is nine years older than I am. But I feel like I want to cry, to be honest.</p> <p>A good chunk of it is regular Lestat shenanigans. But he&#39;s also suicidal. And he&#39;s still Lestat and he takes a very dumb bargain of the body exchange. But he also meets a dog named Mojo. Honestly, the HumanStat turned out to be not so bad. Somewhat of a testament about loneliness as well. Everybody is rich as always, which is good, but he does suffers through some winter days which I totally get. See, we hate winter, we are besties, right?</p> <p>To a point. </p> <p>The whole bit with Louis is not suprising at all. Louis is a mop and a mop he was, but Marius apparition was...there. Sure, okay. In this day and age we are not vibing with Marius and I hope to hear less about him. The anger Lestat feels, though, got to me. This dumbass truly needed his other dumbass and that one refused! Was th",
        "id": 2433853,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm6764/honestly_distraught_over_tale_of_the_body_thief",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Honestly? Distraught over Tale Of The Body Thief by Anne Rice.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T19:34:37+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p><strong>I just finished Foundation #1 and as much as I enjoyed it, I felt that Asimov undermined his big plot idea - psychohistorical predictions - with the bulk of the actual plot points and it weakens the book as a result. This is opposed to Dune which systematically dismantles its world&#39;s rules - mainly predestination - in the service of communicating an argument against charismatic, authoritarian rulers. I&#39;m curious if anyone feels similarly.</strong></p> <p>I haven&#39;t read any further into the series, so apologies if this is addressed further down the line but this was written as a standalone novel at first and in general I&#39;m of the opinion pieces should be able to stand on their own so I think it is valid criticism either way.</p> <p>We are quite explicitly told that Terminus has been set up to be the seed of the second empire and is predestined via psychohistorical calculations to navigate a series of crises imposed on it by its",
        "id": 2432937,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm3iwo/foundation_vs_dune_or_undermining_your_worlds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Foundation vs Dune OR Undermining Your World's Rules Poorly and Well",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T19:15:39+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I know this is such a beloved book, even hailed as one of the greatest novels of all time etc, etc and I really tried to like it.</p> <p>Unfortunately , it just didn&#39;t captivate me at all and I really had a hard time finishing the last 50 pages totally conceding that it could be total intellectual inferiority on my part :).</p> <p>I did some research after finishing the book and thought really hard as to why I didn&#39;t like the book and here are some of my conclusions.</p> <ul> <li>I am not Russian and my knowledge about life in the Sovjet era is limited. I think that context would have helped somewhat. Without it, it is not clear at all that the novel&#39;s main idea be a criticism of that Regime. I mean corruption and greed as far it is laid out in the book applies almost to every society and there was nothing that pointed out to the fact that novel had an issue with the corruption of the USSR other than the author having lived in that era.<b",
        "id": 2432938,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm32sh/i_feel_bad_for_not_liking_master_and_margarita",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "I feel bad for not liking Master and Margarita",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T19:01:04+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I read this because of my interest in American native culture, and because Newport, Oregon, where I live, was once encompassed by the Siletz tribal reservation. The tragic story of the Confederated Tribes of Siletz is similar to that of many American tribes: broken treaties, abuse, forced assimilation, and even a long death march after the bloody wars fought in southern Oregon. They were tricked into terminating their tribe by local political interests in the 1950s, but recovered it in the early 1980s by relinquishing their ancestral rights to hunting and fishing. I was pleased to read that, just this year (2025), the Siletz Tribe has at long last fully recovered its hunting, fishing, and gathering rights. The book is an interesting, if somewhat dry, history of a group of Pacific Northwest tribes that many Americans have likely never heard of.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/SteveRT78\"> /u/SteveR",
        "id": 2432936,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm2qch/the_people_are_dancing_again_the_history_of_the",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The People Are Dancing Again: The History of the Siletz Tribe of Western Oregon (2010) by Charles F. Wilkinson",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T18:51:31+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.nytimes.com/2025/03/24/books/noir-thriller-books.html\">https://www.nytimes.com/2025/03/24/books/noir-thriller-books.html</a> </p> <p>The Black Dahlia By James Ellroy</p> <p>Miami Purity By Vicki Hendricks</p> <p>Parishioner By Walter Mosley</p> <p>Creation Lake By Rachel Kushner</p> <p>Shella By Andrew Vachss</p> <p>Gringos By Charles Portis</p> <p>They Shoot Horses, Don’t They? By Horace McCoy</p> <p>The Expat By Hansen Shi</p> <h1>8 Great Noir Thrillers</h1> <p>Sara Gran — whose 2003 novel of demonic possession, “Come Closer,” is a cult favorite — recommends her favorites.</p> <p>Sara Gran is the founder of Dreamland Books and the author of, most recently, “Little Mysteries.”</p> <p>March 24, 2025</p> <p>Some people use noir to mean a spare writing style; others, a type of plot that tends toward deceit and despair. But it’s maybe best described as a place where no one wants to end up, literally or metaphorically.</p> <p>It’s pr",
        "id": 2432935,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm2i3q/8_great_noir_thrillers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "8 Great Noir Thrillers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T17:07:56+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I find myself to be a fickle reader sometimes, where I’ll find books that from either the synopsis or a friend’s recommendation interest me, but when I start reading it takes me multiple attempts to get past the first few pages, even if I end up loving the book! I attribute it in large part to ADHD but sometimes a book is just a tough read until it gets its hooks in me. </p> <p>One book that really is doing this to me right now is Perdido Street Station by China Miéville. I really am fascinated by the world he creates in the story so far but I’ve tried reading it a few times now and I’ve never gotten farther than the first 100 pages. I love Weird Fiction and his writing is very well done, but all the world building, while done well, is hard for me to get super into, and I’m wanting to get on with the plot that he’s started!! </p> <p>The biggest saving grace is that the world building is reminding me of the Ambergris Trilogy by Jeff VanderMeer and I L",
        "id": 2432459,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jm01jo/what_is_the_book_that_took_you_a_couple_tries",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What is the book that took you a couple tries before it clicked?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T15:51:54+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Has anyone else read it?</p> <p>It&#39;s a YA graphic novel about a girl with some sort of psychic/telekinetic powers that become triggered when she gets really emotional about something. Many bad things happen. And at the end she <span class=\"md-spoiler-text\">commits suicide by blowing up her own head</span></p> <p>I have no one to talk to about this! It&#39;s such a fascinating read. I interpreted her powers as an allegory for mental illness/depression, and I really liked how it was revealed that <span class=\"md-spoiler-text\">her dad had the same affliction that she did</span> because depression is often genetic, and I don&#39;t usually see that discussed in media.</p> <p>The art style grew on me after a bit, I kind of love that it looks like something out of a newspaper comic. It&#39;s really unique whereas a lot of YA graphic novels go for a more realistic or anime-esque art style.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https:",
        "id": 2431359,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jly9b6/i_am_not_okay_with_this",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "I Am Not Okay With This",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T15:10:42+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I just feel like I need to share this somewhere. </p> <p>I&#39;ve been listening to a series (Mary Russell and Sherlock Holmes Mysteries) for the past year or so. Normally, I&#39;m not a fan of audio books because I can read much faster. But as an incentive to be more active, I started to download them on Hoopla. </p> <p>And I feel like I really fell in love with the narrator! Her name was Jenny Sterlin. She was so amazing! She had voices for different characters, and did accents so well. It didn&#39;t sound like someone just reading a book. She was telling a story. </p> <p>She also narrated Howl&#39;s Moving Casle, Tales from the Earthsea, and many others. </p> <p>Then, I got to the most recent book (The Lantern&#39;s Dance), and it was a different narrator. It just wasn&#39;t the same. So it made me curious on why they would just switch narrators after all theses years. And so many books (there&#39;s about 25 books in the series). After searching G",
        "id": 2430620,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jlxbez/audio_books",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Audio Books",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T14:47:21+00:00",
        "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/books/comments/1jlwrz8/trailer_for_free_for_all_the_public_library/\"> <img src=\"https://external-preview.redd.it/cmLBAT9nnMQOFAGd6ll6RybaFEPPf3nurbVVKweroCc.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=72867eda6a906380f7de81f92f062f96a062c9c3\" alt=\"Trailer for Free for All: The Public Library Confirms Libraries Are Very, Very Good\" title=\"Trailer for Free for All: The Public Library Confirms Libraries Are Very, Very Good\" /> </a> </td><td> <!-- SC_OFF --><div class=\"md\"><p>https://</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/therealtrousers\"> /u/therealtrousers </a> <br/> <span><a href=\"https://reactormag.com/trailer-for-free-for-all-the-public-library-confirms-libraries-are-very-very-good/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1jlwrz8/trailer_for_free_for_all_the_public_library/\">[comments]</a></span> </td></tr></table>",
        "id": 2430619,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jlwrz8/trailer_for_free_for_all_the_public_library",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://external-preview.redd.it/cmLBAT9nnMQOFAGd6ll6RybaFEPPf3nurbVVKweroCc.jpg?width=640&crop=smart&auto=webp&s=72867eda6a906380f7de81f92f062f96a062c9c3",
        "title": "Trailer for Free for All: The Public Library Confirms Libraries Are Very, Very Good",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T14:18:40+00:00",
        "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/books/comments/1jlw5e5/weasel_testicles_stargazing_and_royal_remedies/\"> <img src=\"https://external-preview.redd.it/wmZoQ1ecW-wCi-pvC93l6cMNAHnKLpwTxKmNtn2HTbI.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=a1a5e45f6123a9c5de4f0f4e5088bd2313dadea8\" alt=\"Weasel testicles, stargazing and royal remedies: medieval medicine examined in Curious Cures manuscripts exhibition\" title=\"Weasel testicles, stargazing and royal remedies: medieval medicine examined in Curious Cures manuscripts exhibition\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/HairySavage\"> /u/HairySavage </a> <br/> <span><a href=\"https://www.cam.ac.uk/stories/Curious-Cures-Exhibition\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1jlw5e5/weasel_testicles_stargazing_and_royal_remedies/\">[comments]</a></span> </td></tr></table>",
        "id": 2430128,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jlw5e5/weasel_testicles_stargazing_and_royal_remedies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://external-preview.redd.it/wmZoQ1ecW-wCi-pvC93l6cMNAHnKLpwTxKmNtn2HTbI.jpg?width=640&crop=smart&auto=webp&s=a1a5e45f6123a9c5de4f0f4e5088bd2313dadea8",
        "title": "Weasel testicles, stargazing and royal remedies: medieval medicine examined in Curious Cures manuscripts exhibition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T12:28:53+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been reading &#39;Animal Farm&#39; by George Orwell and just came to the line where Old Benjamin says, &quot;Donkeys live a long time. None of you has ever seen a dead donkey.&quot; Is he implying that donkeys live long because they’re smart enough to keep their heads down and their mouths shut? I know Benjamin is portrayed as intelligent, but is there also a hint of arrogance in his intellect? After all, the reason donkeys live so long on farms, at least in Britain, is simply because their meat isn’t typically eaten. </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Background-Value-955\"> /u/Background-Value-955 </a> <br/> <span><a href=\"https://www.reddit.com/r/books/comments/1jltwmj/about_old_benjamin_in_animal_farm/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1jltwmj/about_old_benjamin_in_animal_farm/\">[comments]</a></span>",
        "id": 2429537,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jltwmj/about_old_benjamin_in_animal_farm",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "About Old Benjamin in Animal Farm.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T10:00:32+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to our weekly recommendation thread! A few years ago now the mod team decided to condense the many &quot;suggest some books&quot; threads into one big mega-thread, in order to consolidate the subreddit and diversify the front page a little. Since then, we have removed suggestion threads and directed their posters to this thread instead. This tradition continues, so let&#39;s jump right in!</p> <p><strong>The Rules</strong></p> <ul> <li><p>Every comment in reply to this self-post must be a request for suggestions.</p></li> <li><p>All suggestions made in this thread must be direct replies to other people&#39;s requests. Do not post suggestions in reply to this self-post.</p></li> <li><p>All unrelated comments will be deleted in the interest of cleanliness.</p></li> </ul> <hr/> <p><strong>How to get the best recommendations</strong></p> <p>The most successful recommendation requests include a description of the kind of book being sought. This mi",
        "id": 2428169,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jlrjwl/weekly_recommendation_thread_march_28_2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Weekly Recommendation Thread: March 28, 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T06:02:15+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Horror is one of my most favourite genres but surprisingly, I haven&#39;t read many of the classics. And what better way to start than reading one of the most popular gothic horror novellas? </p> <p>I had watched The Turning (2022) some years ago, therefore I was familiar with the story. Needless to say that the book is way better. It immediately established a detailed and mysterious setting. Through his rich descriptions, Henry James made me feel like I myself was in Bly with the protagonist, witnessing the things she did. The atmosphere of the story was dark and at times, I would feel that the ghosts of Peter Quint and Miss Jessel were lurking beside me. </p> <p>I liked the way the book didn&#39;t specify what was real or not. I couldn&#39;t be sure about anyone&#39;s sanity and I could barely trust anyone. Was the governess correct for believing that the children had been deceived by the dead staff who wanted to lure them to a dark path? Were the ",
        "id": 2427246,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jlofor/the_turn_of_the_screw_literally_turned_the_screws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Turn of The Screw literally turned the screws of my brain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T05:37:00+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>TW for cannibalism and murders</p> <p>At this point I come to this sub just to complain about my most recent read, but what can I do? You people ✨understand✨ me.</p> <blockquote> <p><em>The Lamb</em>, Lucy Rose&#39;s debut, is a wannabe modern coming-of-age gothic folktale that focuses on Margot, an 11-year-old girl, and her mother, Ruth, a cannibalistic woman who insists they remain isolated from society. Their diet consists of &quot;strays,&quot; people who got lost in the woods and stumbled into their cottage to seek help, and that Margot&#39;s mother invites inside, drugs with hemlock, and then butchers for food. One night, the stray that knocks at their door is different: it&#39;s a woman named Eden, and she&#39;s so beautiful that Ruth falls for her immediately. Eden, without any difficulty, accepts and adapts to their cannibalistic lifestyle and joins them.<br/> At the end of the book,&gt;! Ruth and Eden decide that Margot has been misbehaving",
        "id": 2427247,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jlo2d5/the_lamb_by_lucy_rose_long_ranty_review_whoops",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Lamb, by Lucy Rose (long, ranty review. Whoops)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T04:20:28+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>What a wild ride. I am dying to talk about it. </p> <p>Kinbote is an absolute trainwreck of a narrator and I loved every minute of it. </p> <p>I was also blown away by Lolita. Nabokov doesn’t just write unreliable narrators—he builds these intricate performance pieces where the narrator’s blind spots are the real story. Masterclass. </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/Sepiax\"> /u/Sepiax </a> <br/> <span><a href=\"https://www.reddit.com/r/books/comments/1jlmum5/ladies_and_gentlemen_your_attention_please_pale/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1jlmum5/ladies_and_gentlemen_your_attention_please_pale/\">[comments]</a></span>",
        "id": 2427245,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jlmum5/ladies_and_gentlemen_your_attention_please_pale",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ladies and gentlemen, your attention, please. Pale Fire by Vladimir Nabokov is an absolute gem.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-28T04:20:27+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I’m currently reading The Queen of Sugar Hill by Reshonda Tate, a fictionalized biography of the actress Hattie McDaniel. Though so far it’s a great read, it got me thinking about the biographical novels out there—from The Paris Wife by Paula Mclain (about Ernest Hemingway &amp; his first wife, Hadley Richardson) and I, Claudius by Robert Graves about the Roman emperor to The Only Woman in the Room by Marie Benedict (about Hedy Lamarr). </p> <p>I’ve enjoyed some of these novels (especially Hang a Thousand Trees with Ribbons by Ann Rinaldi) and hated others (The Life of Herod the Great by Zora Neale Hurston &amp; Blonde by Joyce Carol Oates, a fictionalized biography of Marilyn Monroe), but in some cases would it be better off to just read a biography or memoir about that famous person?</p> <p>Does doing a fictionalized account of somebody’s life (especially when they’re no longer living) respectable or does it cross the line, reducing someone’s real ",
        "id": 2427248,
        "language": null,
        "link": "https://www.reddit.com/r/books/comments/1jlmulb/thoughts_on_biographical_novels",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Thoughts on Biographical Novels?",
        "vote": 0
    }
]