[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T16:00:25+00:00",
        "description": "Rise of the Ronin, developed by Team Ninja of Ninja Gaiden and Nioh fame, is a more grounded game than is usual for the studio. Taking place in the Bakumatsu period where Japan’s isolationism is under threat of a Shogunate that is surrounded by potential enemies, it offers one of the most unique and interesting settings we’ve seen in recent times.\n\nWhile the combat and traversal add up to make the core gameplay an absolutely joyful experience, Rise of the Ronin’s rough edges tend to be even more visible on the PC release. While not a disaster of a port - the game still runs fine and offers plenty of options for players to tweak to get the most out of their hardware. However, it still doesn’t feel like the kind of game that should be so taxing on upper-to-mid-range PC hardware.",
        "id": 2261151,
        "language": null,
        "link": "https://www.youtube.com/watch?v=TdJXIWmIApc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TdJXIWmIApc/hqdefault.jpg",
        "title": "Rise of the Ronin PC Review - Is It A Worthy Upgrade Over The PS5 Version?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T13:30:45+00:00",
        "description": "Old school and linear hack and slash games might not be as popular in the current gaming landscape as when it was a few years ago, but there is still a sizable audience that yearns for games that let you slice through hordes of enemies in absolute style. If you find yourself in this very category, Nomadic Games’ upcoming Burning Sword should be right up your alley. \n\nSlated to release in 2025, Burning Sword combines heart pounding action with graceful animations and awesome visuals, making it stand out from the rest of its peers. With this video, we will be taking a look at this game's various mechanics and try to understand why and how it could end up being an unprecedented surprise hit of the year.",
        "id": 2260153,
        "language": null,
        "link": "https://www.youtube.com/watch?v=yQHvSrSe5gU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yQHvSrSe5gU/hqdefault.jpg",
        "title": "This Graphically Stunning Hack n' Slash Game Will Make Your Wait For The Next Onimusha Easier",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T09:30:19+00:00",
        "description": "The Enhanced and Expanded version of Grand Theft Auto 5 is finally available for PC, having initially launched almost three years ago as a PS5 and Xbox Series X/S exclusive. It's a free update for current owners and also a separate game, so you won't have to worry about escalating system requirements.\n\nThere's quite a lot included, from the new Landing Page and Career Builder to Hao's Special Works for upgrading specific cars into speed demons. PC players also get five new upgradeable vehicles and Hao's series of races and Time Trials. PC features like ray-traced ambient occlusion and global illumination, FSR and DLSS support, and higher frame rates are also available.\n\nDespite all this, the reception to Grand Theft Auto 5 Enhanced on PC has been mixed. What's going on, and what you should know before playing or even buying if you're a new player? Find out here.",
        "id": 2258342,
        "language": null,
        "link": "https://www.youtube.com/watch?v=mcEaH9cwajU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mcEaH9cwajU/hqdefault.jpg",
        "title": "Grand Theft Auto 5 Enhanced PC - 14 Things You Need To Know BEFORE YOU PLAY",
        "vote": 0
    }
]