[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T22:57:35+00:00",
        "description": "1Password has introduced a 'nearby items' feature, allowing users to tag credentials with physical locations so the relevant information automatically surfaces when users are near those locations. Engadget reports: Location information can be added to any new or existing item in a 1Password vault. The app has also been updated with a map view for setting and viewing the locations of your items. In the blog post announcing the feature, the company cited examples such as door codes for a workplace, health records at a doctor's office, WiFi access at the gym and rewards membership information for local shops as potential uses for location data.\n \nPrivacy and security are paramount for a password manager, and 1Password confirmed that a user's location coordinates are only used locally and do not leave the device. Nearby items is available to 1Password customers starting today.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?st",
        "id": 2264346,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/06/2133211/1password-introduces-nearby-items-tying-passwords-to-physical-locations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "1Password Introduces 'Nearby Items,' Tying Passwords To Physical Locations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T22:57:35+00:00",
        "description": "OpenAI's ChatGPT app for macOS now directly edits code in tools like Xcode, VS Code, and JetBrains. \"Users can optionally turn on an 'auto-apply' mode so ChatGPT can make edits without the need for additional clicks,\" adds TechCrunch. The feature is available now for ChatGPT Plus, Pro, and Team users, and will expand to Enterprise, Edu, and free users next week. Windows support is coming \"soon.\" From the report: Direct code editing builds on OpenAI's \"work with apps\" ChatGPT capability, which the company launched in beta in November 2024. \"Work with apps\" allows the ChatGPT app for macOS to read code in a handful of dev-focused coding environments, minimizing the need to copy and paste code into ChatGPT. With the ability to directly edit code, ChatGPT now competes more directly with popular AI coding tools like Cursor and GitHub Copilot. OpenAI reportedly has ambitions to launch a dedicated product to support software engineering in the months ahead.<p><div class=\"share_submission\" s",
        "id": 2264347,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/03/06/2129211/chatgpt-on-macos-can-now-directly-edit-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "ChatGPT On macOS Can Now Directly Edit Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T21:50:51+00:00",
        "description": "Global sea ice fell to a record low in February, scientists have said, a symptom of an atmosphere fouled by planet-heating pollutants. From a report: The combined area of ice around the north and south poles hit a new daily minimum in early February and stayed below the previous record for the rest of the month, the EU's Copernicus Climate Change Service (C3S) said on Thursday. \"One of the consequences of a warmer world is melting sea ice,\" said the C3S deputy director, Samantha Burgess. \"The record or near-record low sea ice cover at both poles has pushed global sea ice cover to an all-time minimum.\" \n\nThe agency found the area of sea ice hit its lowest monthly level for February in the Arctic, at 8% below average, and its fourth-lowest monthly level for February in the Antarctic, at 26% below average. Its satellite observations stretch back to the late 1970s and its historical observations to the middle of the 20th century. Scientists had already observed an extreme heat anomaly in",
        "id": 2263935,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/06/198259/global-sea-ice-hit-record-low-in-february-scientists-say?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Global Sea Ice Hit Record Low in February, Scientists Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T21:50:51+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The Trump administration is eliminating a preference for fiber Internet in a $42.45 billion broadband deployment program, a change that is expected to reduce spending on the most advanced wired networks while directing more money to Starlink and other non-fiber Internet service providers. One report suggests Starlink could obtain $10 billion to $20 billion under the new rules. Secretary of Commerce Howard Lutnick criticized the Biden administration's handling of the Broadband Equity, Access, and Deployment (BEAD) program in a statement yesterday. Lutnick said that \"because of the prior Administration's woke mandates, favoritism towards certain technologies, and burdensome regulations, the program has not connected a single person to the Internet and is in dire need of a readjustment.\"\n \nThe BEAD program was authorized by Congress in November 2021, and the US was finalizing plans to distribute funding before Trump's inauguration. ",
        "id": 2263934,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/06/2123237/starlink-benefits-as-trump-admin-rewrites-rules-for-42-billion-grant-program?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Starlink Benefits As Trump Admin Rewrites Rules For $42 Billion Grant Program",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T20:45:52+00:00",
        "description": "Brother has rejected claims that its firmware updates intentionally disable printer functionality when third-party cartridges are installed. The controversy emerged after a YouTube video by Louis Rossman, which has garnered over 160,000 views, alleged the company had joined competitors in anti-consumer practices. The allegations stem from online reports, including a 2022 Reddit post claiming firmware update W1.56 disabled automatic color registration on a Brother MFC-3750 using non-Brother toner, rendering it \"effectively non-functional.\" \n\nIn a statement to Ars Technica, Brother explicitly denied these accusations: \"Please be assured that Brother firmware updates do not block the use of third-party ink in our machines.\" The company said it recommends genuine supplies for \"optimal performance\" and performs a \"Brother Genuine check\" during troubleshooting, which may have caused \"misunderstanding.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"ht",
        "id": 2263424,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/06/1857249/brother-denies-bricking-printers-using-third-party-ink?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Brother Denies Bricking Printers Using Third-Party Ink",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T19:40:00+00:00",
        "description": "The U.K. government appears to have quietly scrubbed encryption advice from government web pages, just weeks after demanding backdoor access to encrypted data stored on Apple's cloud storage service, iCloud. From a report: The change was spotted by security expert Alec Muffett, who wrote in a blog post on Wednesday that the U.K.'s National Cyber Security Centre (NCSC) is no longer recommending that high-risk individuals use encryption to protect their sensitive information. \n\nThe NCSC in October published a document titled \"Cybersecurity tips for barristers, solicitors &amp; legal professionals,\" that advised the use of encryption tools such as Apple's Advanced Data Protection (ADP). ADP allows users to turn on end-to-end encryption for their iCloud backups, effectively making it impossible for anyone, including Apple and government authorities, to view data stored on iCloud. The URL hosting the NCSC document now redirects to a different page that makes no mention of encryption or AD",
        "id": 2262943,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/06/193217/uk-quietly-scrubs-encryption-advice-from-government-websites?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Quietly Scrubs Encryption Advice From Government Websites",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T19:40:00+00:00",
        "description": "The FCC says it plans to vote next month to explore alternatives to GPS after national security concerns have been raised about relying on a single system crucial to modern life. From a report: \"Continuing to rely so heavily on one system leaves us exposed,\" FCC Chair Brendan Carr said. \"We need to develop redundant technologies.\" There have been reports of a rise in GPS interference around the world, particularly since 2023, known as spoofing raising fears of an increased risk of accidents if planes veer off-course. \"Disruptions to GPS have the potential to undermine the nation's economic and national security. And the risks to our current system are only increasing,\" Carr said, noting President Donald Trump and a bipartisan group of lawmakers have called for action for years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Communications+Agency+To+Explore+Alternatives+To+GPS+Systems%3A+https%3A%2F%2Fnews.slashd",
        "id": 2262944,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/06/183209/us-communications-agency-to-explore-alternatives-to-gps-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Communications Agency To Explore Alternatives To GPS Systems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T18:34:31+00:00",
        "description": "Denmark's state-run postal service, PostNord, is to end all letter deliveries at the end of 2025, citing a 90% decline in letter volumes since the start of the century. From a report: The decision brings to an end 400 years of the company's letter service. Denmark's 1,500 post boxes will start to disappear from the start of June. Transport Minister Thomas Danielsen sought to reassure Danes, saying letters would still be sent and received as \"there is a free market for both letters and parcels.\" Postal services across Europe are grappling with the decline in letter volumes. Germany's Deutsche Post said on Thursday it was axing 8,000 jobs, in what it called a \"socially responsible manner.\" \n\nDeutsche Post has 187,000 employees and staff representatives said they feared more cuts were to come. Denmark had a universal postal service for 400 years until the end of 2023, but as digital mail services have taken hold, the use of letters has fallen dramatically. PostNord says it will switch i",
        "id": 2262399,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/06/1727237/denmark-postal-service-to-stop-delivering-letters?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Denmark Postal Service To Stop Delivering Letters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T17:29:04+00:00",
        "description": "Budget carrier Ryanair has delayed its move to 100% paperless boarding passes to the start of its winter schedule on November 3. From a report: Media reports had suggested that the change could come in May, ahead of the busy summer season. But the implementation will now begin at the start of the winter season in November, and means Ryanair passengers will no longer download and print a physical paper boarding pass. Instead they will use the digital boarding pass generated in their 'myRyanair' app during check-in. \n\nCurrently almost 80% of Ryanair's 200 million annual passengers already use this digital boarding pass. As a result of this initiative, Ryanair expects to eliminate almost all airport check-in fees from November, as all passengers will have checked-in online or in-app to generate their digital boarding pass. The airline said it will also reduce passengers' carbon footprint by eliminating unnecessary paper, saving more than 300 tonnes in paper waste each year.<p><div class",
        "id": 2261794,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/06/1628235/ryanair-delays-move-to-paperless-boarding-passes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ryanair Delays Move To Paperless Boarding Passes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T17:29:04+00:00",
        "description": "The folks at Bafta are running a public survey to identify the most influential video game ever made. When The Guardian asked prominent gaming figures to weigh in, they received a fascinating array of responses with zero overlap. Game designer Mike Bithell picked Metal Gear Solid 2, while Blumhouse's Louise Blain chose the short-lived horror experiment PT. The Guardian's own games editor backed Ocarina of Time for establishing 3D game world standards. \n\nOther notable selections included Tomb Raider (pioneering female protagonists), QWOP (inspiring experimental design), Doom (revolutionizing FPS and modding), Mario Kart (competitive social play), Journey (emotional storytelling), Princess Maker (branching narrative systems), Paperboy (everyday world simulation), and Super Mario Bros (fundamental game design principles).\nSo, Slashdotters, what's your pick for the most influential video game ever created? Which title fundamentally changed how games are designed, played, or experienced? ",
        "id": 2261793,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/06/1719247/slashdot-asks-whats-the-most-influential-video-game-of-all-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Slashdot Asks: What's the Most Influential Video Game of All Time?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T16:24:59+00:00",
        "description": "A quarter of startups in Y Combinator's Winter 2025 batch have 95% of their codebases generated by AI, YC managing partner Jared Friedman said. \"Every one of these people is highly technical, completely capable of building their own products from scratch. A year ago, they would have built their product from scratch -- but now 95% of it is built by an AI,\" Friedman said. \n\nYC CEO Garry Tan warned that AI-generated code may face challenges at scale and developers need classical coding skills to sustain products. He predicted: \"This isn't a fad. This is the dominant way to code.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Quarter+of+Startups+in+YC's+Current+Cohort+Have+Codebases+That+Are+Almost+Entirely+AI-Generated%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F06%2F159208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"",
        "id": 2261103,
        "language": null,
        "link": "https://slashdot.org/story/25/03/06/159208/a-quarter-of-startups-in-ycs-current-cohort-have-codebases-that-are-almost-entirely-ai-generated?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "A Quarter of Startups in YC's Current Cohort Have Codebases That Are Almost Entirely AI-Generated",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T16:24:59+00:00",
        "description": "NASA has begun shutting down science instruments aboard the twin Voyager spacecraft to extend their 47-year journey through interstellar space, officials said. Voyager 1's cosmic ray subsystem was deactivated on February 25, while Voyager 2's low-energy charged particle instrument will be shut down on March 24. Both spacecraft will then operate with just three of their original ten science instruments. \n\nThe radioisotope power systems aboard the Voyagers lose approximately 4 watts annually, threatening to end their mission within months without intervention. \"Electrical power is running low,\" said Voyager project manager Suzanne Dodd. \"The Voyagers have been deep space rock stars since launch, and we want to keep it that way as long as possible.\" NASA engineers believe these measures could enable the probes to continue operating into the 2030s, far beyond their initial five-year design life.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://",
        "id": 2261101,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/06/1615227/nasa-is-making-sacrifices-to-keep-the-voyager-mission-alive?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA is Making Sacrifices To Keep the Voyager Mission Alive",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T16:24:59+00:00",
        "description": "A U.S. congressional committee has urged Americans to remove Chinese-made wireless routers from their homes, including those made by TP-Link, calling them a security threat that opened the door for China to hack U.S. critical infrastructure. From a report: The House of Representatives Select Committee on China has pushed the Commerce Department to investigate China's TP-Link Technology Co, which according to research firm IDC is the top seller of WiFi routers internationally by unit volume. U.S. authorities are considering a ban on the sale of the company's routers, according to media reports. \n\nRob Joyce, former director of cybersecurity at the National Security Agency, told Wednesday's committee hearing that TP-Link devices exposed individuals to cyber intrusion that hackers could use to gain leverage to attack critical infrastructure. \"We need to all take action and replace those devices so they don't become the tools that are used in the attacks on the U.S.,\" Joyce said, adding t",
        "id": 2261102,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/06/1513201/us-congressional-panel-urges-americans-to-ditch-china-made-routers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Congressional Panel Urges Americans To Ditch China-made Routers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T14:32:08+00:00",
        "description": "AmiMoJo writes: China plans to issue guidance to encourage the use of open-source RISC-V chips nationwide for the first time, Reuters reports, citing two sources briefed on the matter, as Beijing accelerates efforts to curb the country's dependence on Western-owned technology. \n\nThe policy guidance on boosting the use of RISC-V chips could be released as soon as this month, although the final date could change, the sources said. It is being drafted jointly by eight government bodies, including the Cyberspace Administration of China, China's Ministry of Industry and Information Technology, the Ministry of Science and Technology, and the China National Intellectual Property Administration, they added.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+To+Publish+Policy+To+Boost+RISC-V+Chip+Use+Nationwide%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F03%2F06%2F1316253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwi",
        "id": 2260123,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/06/1316253/china-to-publish-policy-to-boost-risc-v-chip-use-nationwide?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China To Publish Policy To Boost RISC-V Chip Use Nationwide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T13:26:30+00:00",
        "description": "In a policy paper, former Google CEO Eric Schmidt, Scale AI CEO Alexandr Wang, and Center for AI Safety Director Dan Hendrycks said that the U.S. should not pursue a Manhattan Project-style push to develop AI systems with \"superhuman\" intelligence, also known as AGI. From a report: The paper, titled \"Superintelligence Strategy,\" asserts that an aggressive bid by the U.S. to exclusively control superintelligent AI systems could prompt fierce retaliation from China, potentially in the form of a cyberattack, which could destabilize international relations. \n\n\"[A] Manhattan Project [for AGI] assumes that rivals will acquiesce to an enduring imbalance or omnicide rather than move to prevent it,\" the co-authors write. \"What begins as a push for a superweapon and global control risks prompting hostile countermeasures and escalating tensions, thereby undermining the very stability the strategy purports to secure.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop",
        "id": 2259632,
        "language": null,
        "link": "https://slashdot.org/story/25/03/06/138259/eric-schmidt-argues-against-a-manhattan-project-for-agi?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Eric Schmidt Argues Against a 'Manhattan Project for AGI'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T09:06:09+00:00",
        "description": "India's income tax department will gain powers to access citizens' social media accounts, emails and other digital spaces beginning April 2026 under the new income tax bill, in a significant expansion of its search and seizure authority. \n\nThe legislation, which has raised privacy concerns among legal experts, allows tax officers to \"gain access by overriding the access code\" to computer systems and \"virtual digital spaces\" if they suspect tax evasion. \n\nThe bill broadly defines virtual digital spaces to include email servers, social media accounts, online investment accounts, banking platforms, and cloud servers. \n\n\"The expansion raises significant concerns regarding constitutional validity, potential state overreach, and practical enforcement,\" Sonam Chandwani, Managing Partner at KS Legal and Associates, told Indian newspaper Economic Times.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=India+Grants+Tax+Officia",
        "id": 2258032,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/06/0836227/india-grants-tax-officials-sweeping-digital-access-powers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "India Grants Tax Officials Sweeping Digital Access Powers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T06:56:01+00:00",
        "description": "Goldman Sachs, in a research note Thursday (the note isn't publicly posted): Annualized revenue for public companies exposed to the build-out of AI infrastructure increased by over $340 billion from 2022 through 2024Q4 (and is projected to increase by almost $580 billion by end-2025). In contrast, annualized real investment in AI-related categories in the US GDP accounts has only risen by $42 billion over the same period. This sharp divergence has prompted questions from investors about why US GDP is not receiving a larger boost from AI. \n\nA large share of the nominal revenue increase reported by public companies reflects cost inflation (particularly for semiconductors) and foreign revenue, neither of which should boost real US GDP. Indeed, we find that margin expansion ($30 billion) and increased revenue from other countries ($130 billion) account for around half of the publicly reported AI spending surge. \n\nThat said, the BEA's (Bureau of Economic Analysis) methodology potentially ",
        "id": 2257492,
        "language": null,
        "link": "https://slashdot.org/story/25/03/06/0619224/goldman-sachs-why-ai-spending-is-not-boosting-gdp?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Goldman Sachs: Why AI Spending Is Not Boosting GDP",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T04:45:57+00:00",
        "description": "Utah has become the first U.S. state to pass legislation requiring app store operators to verify users' ages and obtain parental consent for minors downloading apps. \n\nThe App Store Accountability Act adds to a wave of children's online safety bills advancing through state legislatures nationwide. Similar legislation has faced legal challenges, with many being blocked in courts. A comparable federal bill failed last year amid free expression concerns. \n\nThe approach shifts verification responsibility to mobile app stores rather than individual websites, a move supported by Meta, Snap, and X in a joint statement urging Congress to follow suit. \"Parents want a one-stop shop to verify their child's age and grant permission,\" they stated. Critics, including Chamber of Progress, warn the law threatens privacy and constitutional rights. A federal judge previously blocked a similar Utah law over First Amendment concerns.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"",
        "id": 2257005,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/06/0348233/utah-passes-first-us-app-store-age-verification-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Utah Passes First US App Store Age Verification Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T02:35:42+00:00",
        "description": "Amazon has launched a pilot program testing \"AI-aided dubbing\" for select content on Prime Video, offering translations between English and Latin American Spanish for 12 licensed movies and series including \"El Cid: La Leyenda,\" \"Mi Mama Lora\" and \"Long Lost.\" The company describes a hybrid approach where \"localization professionals collaborate with AI,\" suggesting automated dubbing receives professional editing for accuracy. The initiative, the company said, aims to increase content accessibility as streaming services expand globally.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Tests+AI+Dubbing+on+Prime+Video+Movies%2C+Series%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F05%2F1954215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2",
        "id": 2256620,
        "language": null,
        "link": "https://slashdot.org/story/25/03/05/1954215/amazon-tests-ai-dubbing-on-prime-video-movies-series?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Tests AI Dubbing on Prime Video Movies, Series",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-06T00:26:37+00:00",
        "description": "Google announced Wednesday it is expanding its AI Overviews to more query types and users worldwide, including those not logged into Google accounts, while introducing a new \"AI Mode\" chatbot feature. AI Mode, which resembles competitors like Perplexity or ChatGPT Search, will initially be limited to Google One AI Premium subscribers who enable it through the Labs section of Search. \n\nThe feature delivers AI-generated answers with supporting links interspersed throughout, powered by Google's search index. \"What we're finding from people who are using AI Overviews is that they're really bringing different kinds of questions to Google,\" said Robby Stein, VP of product on the Search team. \"They're more complex questions, that may have been a little bit harder before.\" Google is also upgrading AI Overviews with its Gemini 2.0 model, which Stein says will improve responses for math, coding and reasoning-based queries.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"s",
        "id": 2256025,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/05/1944216/google-is-adding-more-ai-overviews-and-a-new-ai-mode-to-search?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google is Adding More AI Overviews and a New 'AI Mode' To Search",
        "vote": 0
    }
]