[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T22:51:55.389872+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T22:40:00+00:00",
        "description": "YouTube has launched a \"second chance\" program allowing some creators previously banned for COVID-19 or election misinformation to apply for new channels, as long as their violations were tied to policies that have since been deprecated. Bans for copyright or severe misconduct still remain permanent. The Verge reports: Under political pressure, the company had said last month that it was going to set up this pilot program for \"a subset of creators\" and \"channels terminated for policies that have been deprecated.\" [...] The new pilot program kicks off today and will roll out to \"eligible creators\" over the \"next several weeks,\" YouTube says. \"We'll consider several factors when evaluating requests for new channels, like whether the creator committed particularly severe or persistent violations of our Community Guidelines or Terms of Service, or whether the creator's on- or off-platform activity harmed or may continue to harm the YouTube community.\"\n \nThe pilot won't be available if you",
        "id": 3778675,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/09/2048221/youtube-opens-second-chance-program-to-creators-banned-for-misinformation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Opens 'Second Chance' Program To Creators Banned For Misinformation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T22:51:55.471683+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Apple yesterday announced a plan to comply with a Texas age verification law and warned that changes required by the law will reduce privacy for app users. \"Beginning January 1, 2026, a new state law in Texas -- SB2420 -- introduces age assurance requirements for app marketplaces and developers,\" Apple said yesterday in a post for developers. \"While we share the goal of strengthening kids' online safety, we are concerned that SB2420 impacts the privacy of users by requiring the collection of sensitive, personally identifiable information to download any app, even if a user simply wants to check the weather or sports scores.\"\n \nThe Texas App Store Accountability Act requires app stores to verify users' ages and imposes restrictions on those under 18. Apple said that developers will have \"to adopt new capabilities and modify behavior within their apps to meet their obligations under the law.\" Apple's post noted that similar laws wil",
        "id": 3778676,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/09/2044214/apple-and-google-reluctantly-comply-with-texas-age-verification-law",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple and Google Reluctantly Comply With Texas Age Verification Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T21:33:16.474521+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T21:22:00+00:00",
        "description": "An anonymous reader shares a report: Over the years, Intel has established itself as a paragon of the open source community, but that could soon change under the x86 giant's new leadership. Speaking to press and analysts at Intel's Tech Tour in Arizona last week, Kevork Kechichian, who now leads Intel's datacenter biz, believes it's time to rethink what Chipzilla contributes to the open source community. \"We have probably the largest footprint on open source out there from an infrastructure standpoint,\" he said during his opening keynote. \"We need to find a balance where we use that as an advantage to Intel and not let everyone else take it and run with it.\" \n\nIn other words, the company needs to ensure that its competitors don't benefit more from Intel's open source contributions than it does. Speaking with El Reg during a press event in Arizona last week, Kechichian emphasized that the company has no intention of abandoning the open source community. \"Our intention is never to leave",
        "id": 3778157,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/09/2016225/intels-open-source-future-in-question-as-exec-says-hes-done-carrying-the-competition",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel's Open Source Future in Question as Exec Says He's Done Carrying the Competition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T21:33:16.704581+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T20:42:00+00:00",
        "description": "Doug Whitney carries a genetic mutation that guaranteed he would develop Alzheimer's disease in his late forties or early fifties. His mother and nine of her thirteen siblings died from the disease. His oldest brother died at 45. The mutation has decimated his family for generations. Whitney is now 76 and remains cognitively healthy. The New York Times has a fascinating long read on Whitney and things happening around him. \n\nScientists at Washington University School of Medicine in St. Louis have studied Whitney for 14 years. They extract his cerebrospinal fluid and conduct brain scans during his periodic visits from Washington State. His brain contains heavy amyloid deposits but almost no tau tangles in regions associated with dementia. Tau accumulation correlates directly with cognitive decline. Whitney accumulated tau only in his left occipital lobe, an area that does not play a major role in Alzheimer's. \n\nResearchers identified several possibly protective factors in Whitney's bio",
        "id": 3778158,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/09/1913200/he-was-expected-to-get-alzheimers-25-years-ago-why-hasnt-he",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "He Was Expected To Get Alzheimer's 25 Years Ago. Why Hasn't He?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T20:07:52.361502+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T20:01:00+00:00",
        "description": "Dave W. Plummer, the Microsoft developer who created Task Manager and helped build Windows Product Activation, has revealed the origins of Windows XP's most notorious product key. The alphanumeric string FCKGW-RHQQ2-YXRKT-8TG6W-2B7Q8 was not cracked through clever hacking but leaked as a legitimate volume licensing key five weeks before XP's October 2001 release. \n\nA warez group distributed the key alongside special corporate installation media. Windows Product Activation generated hardware IDs from system components and sent them to Microsoft for validation. The leaked volume licensing key bypassed this entirely. The system recognized it as corporate licensing and skipped phone-home activation. Users could install XP without activation prompts or 30-day timers. Microsoft later blacklisted the key.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+Product+Activation+Creator+Reveals+Truth+Behind+XP's+Most+Notori",
        "id": 3777512,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/09/1850202/windows-product-activation-creator-reveals-truth-behind-xps-most-notorious-product-key",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows Product Activation Creator Reveals Truth Behind XP's Most Notorious Product Key",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T20:07:52.553360+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T19:22:00+00:00",
        "description": "The Internet Archive must block access to books in its Open Library project for Belgian users after negotiations with publishers failed. A Brussels Business Court issued a site-blocking order in July targeting several shadow libraries and the Internet Archive. A Belgian government department paused the order for the U.S. nonprofit and urged both parties to negotiate. The talks over recent weeks were unsuccessful. \n\nThe Department for Combating Infringements of Copyright concluded last week that the Internet Archive hosts the contested books and has the ability to render them inaccessible. Publishers must supply a list of books to be blocked. The nonprofit then has 20 calendar days to implement the measures and prevent future digital lending of those works in Belgium. The order includes a one-time penalty of $578,000 for non-compliance and remains in place until July 16 next year. The Internet Archive operates Open Library by purchasing physical copies and digitizing them to lend out o",
        "id": 3777513,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/09/1811209/internet-archive-ordered-to-block-books-in-belgium-after-talks-with-publishers-fail",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Internet Archive Ordered To Block Books in Belgium After Talks With Publishers Fail",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T20:07:52.666055+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T18:40:00+00:00",
        "description": "A federal judge has dismissed a lawsuit by the National Retail Federation challenging a New York state law that requires retailers to tell customers when their personal data are used to set prices, known as surveillance pricing. From a report: U.S. District Judge Jed Rakoff in Manhattan said the world's largest retail trade group did not plausibly allege that New York's Algorithmic Pricing Disclosure Act violated its members' free speech rights under the Constitution's First Amendment. \n\nThe first-in-the-nation law required retailers to disclose in capital letters when prices were set by algorithms using personal data, or face possible civil fines of $1,000 per violation. Governor Kathy Hochul said charging different prices depending on what people were willing to pay was \"opaque,\" and prevented comparison-shopping.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Judge+Dismisses+Retail+Group's+Challenge+To+New+York+S",
        "id": 3777514,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/09/185236/judge-dismisses-retail-groups-challenge-to-new-york-surveillance-pricing-law",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Judge Dismisses Retail Group's Challenge To New York Surveillance Pricing Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T18:42:53.328888+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T18:01:00+00:00",
        "description": "Intel today announced its Panther Lake laptop processors, consolidating the confusing split between Lunar Lake and Arrow Lake chips that define its current generation. The new processors use a unified architecture across all models instead of mixing different technologies at different price points. Panther Lake comes in three configurations. An 8-core model targets mainstream ultrabooks. A 16-core version adds PCI Express lanes for gaming laptops and workstations with discrete GPUs. A third 16-core variant with 12 Xe3 graphics cores aims at high-end thin-and-light laptops without dedicated graphics cards. \n\nAll three chips use the same Cougar Cove P-cores, Darkmont E-cores, and Xe3 GPU architecture. They share an NPU capable of 50 trillion operations per second and identical media encoding capabilities. The main differences are core counts and I/O options rather than fundamental architectural variations. The approach contrasts with Intel's current Core Ultra 200 series. Lunar Lake chi",
        "id": 3776768,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/09/1753223/intels-next-generation-panther-lake-laptop-chips-could-be-a-return-to-form",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel's Next-Generation Panther Lake Laptop Chips Could Be a Return To Form",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T18:42:53.485835+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T17:22:00+00:00",
        "description": "FCC Chairman Brendan Carr says Internet service providers shouldn't have to list every fee they charge. From a report: Responding to a request from cable and telecom lobby groups, he is proposing to eliminate a rule that requires ISPs to itemize various fees in broadband price labels that must be made available to consumers. \n\nThe rule took effect in April 2024 after the FCC rejected ISPs' complaints that listing every fee they created would be too difficult. The rule applies specifically to recurring monthly fees \"that providers impose at their discretion, i.e., charges not mandated by a government.\" \n\nISPs could comply with the rule either by listing the fees or by dropping the fees altogether and, if they choose, raising their overall prices by a corresponding amount. But the latter option wouldn't fit with the strategy of enticing customers with a low advertised price and hitting them with the real price on their monthly bills. The broadband price label rules were created to stop ",
        "id": 3776769,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/09/1525208/isps-created-so-many-fees-that-fcc-will-kill-requirement-to-list-them-all",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ISPs Created So Many Fees That FCC Will Kill Requirement To List Them All",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T17:13:38.061347+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T16:41:00+00:00",
        "description": "An anonymous reader shares a report: DC Comics president and publisher Jim Lee said that the company \"will not support AI-generated storytelling or artwork,\" assuring fans that its future will remain rooted in human creativity. \"Not now, not ever, as long as [SVP, general manager] Anne DePies and I are in charge,\" Lee said during his panel at New York Comic Con on Wednesday, likening concerns around AI dominating future creative industries to the Millennium bug scare and NFT hype. \n\n\"People have an instinctive reaction to what feels authentic. We recoil from what feels fake. That's why human creativity matters,\" said Lee. \"AI doesn't dream. It doesn't feel. It doesn't make art. It aggregates it.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=DC+Comics+Won't+Support+Generative+AI%3A+'Not+Now%2C+Not+Ever'%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F10%2F09%2F157259%2F%3Futm_source%3Dtwitter%26utm_mediu",
        "id": 3775986,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/09/157259/dc-comics-wont-support-generative-ai-not-now-not-ever",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DC Comics Won't Support Generative AI: 'Not Now, Not Ever'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T17:13:38.167417+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T16:01:00+00:00",
        "description": "Software vendors keen to monetize AI should tread cautiously, since they risk inflating costs for their customers without delivering any promised benefits such as reducing employee head count. From a report: The latest report from McKinsey &amp; Company mulls what software-as-a-service (SaaS) vendors need to do to navigate the minefield of hype that surrounds AI and successfully fold such capabilities into their offerings. According to the consultancy, there are three main challenges it identifies as holding back broader growth in AI software monetization in the report. \n\nOne of these is simply the inability to show any savings that can be expected. Many software firms trumpet potential use cases for AI, but only 30 percent have published quantifiable return on investment from real customer deployments. Meanwhile, many customers see AI hiking IT costs without being able to offset these by slashing labor costs. The billions poured into developing AI models mean they don't come cheap, a",
        "id": 3775987,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/09/1132230/mckinsey-wonders-how-to-sell-ai-apps-with-no-measurable-benefits",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "McKinsey Wonders How To Sell AI Apps With No Measurable Benefits",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T15:49:51.100117+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T15:21:00+00:00",
        "description": "An anonymous reader shares a report: China's giant solar parks aren't just changing the power mix -- they may be changing the ground beneath them. Fresh field data point to cooler soils, extra moisture, and pockets of greening, though lasting ecological shifts will hinge on design and long-term care. \n\n[...] A team studying one of the largest photovoltaic parks in China, the Gonghe project in the Talatan Desert, found a striking difference between what was happening under the panels and what lay just beyond. They used a detailed framework measuring dozens of indicators -- everything from soil chemistry to microbial life -- and discovered that the micro-environment beneath the panels was noticeably healthier. The reasons track with physics: shade cools the surface and slows evaporation, letting scarce soil moisture linger longer; field experiments in western China report measurable soil-moisture gains beneath shaded arrays. \n\nSimple shade from panel rows can create a gentler microclima",
        "id": 3775026,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/09/1058217/china-confirms-solar-panel-projects-are-irreversibly-changing-desert-ecosystems",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Confirms Solar Panel Projects Are Irreversibly Changing Desert Ecosystems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T15:49:51.230754+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T14:40:00+00:00",
        "description": "An anonymous reader shares a report: A website set up by an unknown Dane over the course of one weekend in August is giving a massive headache to those trying to pass a European bill aimed at stopping child sexual abuse material from spreading online. \n\nThe website, called Fight Chat Control, was set up by Joachim, a 30-year-old software engineer living in Aalborg, Denmark. He made it after learning of a new attempt to approve a European Union proposal to fight child sexual abuse material (CSAM) -- a bill seen by privacy activists as breaking encryption and leading to mass surveillance. \n\nThe site lets visitors compile a mass email warning about the bill and send it to national government officials, members of the European Parliament and others with ease. Since launching, it has broken the inboxes of MEPs and caused a stir in Brussels' corridors of power. \"We are getting hundreds per day about it,\" said Evin Incir, a Swedish Socialists and Democrats MEP, of the email deluge.<p><div cl",
        "id": 3775027,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/09/1017255/one-man-spam-campaign-ravages-eu-chat-control-bill",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "One-Man Spam Campaign Ravages EU 'Chat Control' Bill",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T15:49:51.367907+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T14:00:00+00:00",
        "description": "The Bank of England has warned there is a growing risk of a \"sudden correction\" in global markets as it raised concerns about soaring valuations of leading AI tech companies. From a report: Policymakers said there were also threats of a \"sharp repricing of US dollar assets\" if the Federal Reserve lost credibility in the eyes of global investors. It comes as Donald Trump's continues to attack the US central bank and threaten its independence. \n\nContinued hype and optimism about the potential for AI technology has led to a rise in valuations in recent months, with companies such as OpenAI now worth $500 billion, compared with $157 billion last October. Another firm, Anthropic, has almost trebled its valuation, going from $60 billion in March to $170 billion last month. \n\nHowever, the Bank of England's financial policy committee (FPC) warned on Wednesday: \"The risk of a sharp market correction has increased. \"On a number of measures, equity market valuations appear stretched, particularl",
        "id": 3775028,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/09/1012240/uks-central-bank-warns-of-growing-risk-that-ai-bubble-could-burst",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK's Central Bank Warns of Growing Risk That AI Bubble Could Burst",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T13:46:04.720038+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from The Verge: Discord has identified approximately 70,000 users that may have had their government ID photos exposed as part of a customer service data breach announced last week, spokesperson Nu Wexler tells The Verge. A tweet by vx-underground said that the company was being extorted over a breach of its Zendesk instance by a group claiming to have \"1.5TB of age verification related photos. 2,185,151 photos.\" In its announcement last week, Discord said that information like names, usernames, emails, the last four digits of credit cards, and IP addresses also may have been impacted by the breach. \"All affected users globally have been contacted and we continue to work closely with law enforcement, data protection authorities, and external security experts,\" said Wexler. \"We've secured the affected systems and ended work with the compromised vendor. We take our responsibility to protect your personal data seriously and understand the concern this ",
        "id": 3774021,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/08/2259252/discord-says-70000-users-may-have-had-their-government-ids-leaked-in-breach",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Discord Says 70,000 Users May Have Had Their Government IDs Leaked In Breach",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T10:50:05.890125+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T10:00:00+00:00",
        "description": "After failed negotiations with publishers, Belgium's copyright enforcement agency has ordered the Internet Archive to block access to specific books in its Open Library within Belgium or face a 500,000-euro fine. TorrentFreak reports: Back in July, the Brussels Business Court issued a sweeping ex parte site-blocking order targeting several \"shadow libraries\" including Anna's Archive, Libgen, and Z-Library. Unusually, the order also included the Internet Archive's Open Library, a project operated by the well-known U.S. non-profit organization Internet Archive. The order was granted based on a request from publishers and authors who claimed, among other things, that the operators of the targeted sites were difficult to identify. This also applied to the Internet Archive, which was not heard by the court before the order was issued.\n \n[...] Over the past several weeks, Internet Archive attempted to reach an agreement with the publishers, but the effort was unsuccessful. It is clear, howe",
        "id": 3772624,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/08/2253241/internet-archive-ordered-to-block-books-in-belgium",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Internet Archive Ordered to Block Books in Belgium",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T07:45:22.042931+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T07:00:00+00:00",
        "description": "eBird, now the world's largest citizen science project with over 2 billion bird observations, is transforming ornithology by turning casual birders (and even TikTok-using kids) into vital contributors to global research and conservation. Slashdot reader alternative_right shares a report from Phys.org: The Cornell Lab of Ornithology has been one of the most influential organizations in the world when it comes to encouraging people to engage in natural history projects. While some form of amateur involvement in science projects has been around since 1900, when the Audubon Society organized the first Christmas Bird Count, it was the Cornell Lab that formalized citizen science as a sound and reliable means of collecting data on birds.\n \nIt didn't take much thought to realize that one of the richest sources of information about birds resided in the notebooks virtually every birder has kept, often from childhood. It's a given that birdwatchers list everything. The problem is that zillions o",
        "id": 3771619,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/08/2237234/the-worlds-biggest-citizen-science-project",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The World's Biggest Citizen Science Project",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T04:42:58.300193+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: MEPs voted on Wednesday by 355 in favor to 247 against to reserve names such as \"steak\", \"burger\" and \"sausage\" exclusively for products derived from meat, a longstanding demand of farm unions. In order to come into effect, the idea would have to be approved by a majority of the EU's 27 member states, which is far from certain. The vote is a victory for the French centre-right MEP Celine Imart, who drafted the amendment to legislation intended to strengthen the position of farmers in the food supply chain.\n \nImart, who is also a cereals farmer in north-west France, said: \"A steak, an escalope or a sausage are products from our livestock, not laboratory art nor plant products. There is a need for transparency and clarity for the consumer and recognition for the work of our farmers.\" She argues the proposal is in line with EU rules that already ban the use of terms such as \"milk\" and \"yoghurt\" for non-dairy products.\n \nThe European ",
        "id": 3770867,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/08/2047253/eu-lawmakers-push-to-ban-plant-based-food-terms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU Lawmakers Push To Ban Plant-Based Food Terms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T01:30:05.709405+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T01:25:00+00:00",
        "description": "Germany's cabinet has approved a new law allowing police to shoot down or disable rogue drones that threaten airspace security, following recent airport disruptions attributed to Russian reconnaissance. \"Other techniques available to down drones include using lasers or jamming signals to sever control and navigation links,\" notes Reuters. From the report: With the new law, Germany joins European countries that have recently given security forces powers to down drones violating their airspace, including Britain, France, Lithuania and Romania. A dedicated counter-drone unit will be created within the federal police, Interior Minister Alexander Dobrindt said, and researchers would consult with Israel and Ukraine as they were more advanced in drone technology. Police would deal with drones flying at around tree-level, whereas more powerful drones should be tackled by the military, Dobrindt said.\n \nGermany recorded 172 drone-related disruptions to air traffic between January and the end of",
        "id": 3770126,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/08/2043210/germany-to-allow-police-to-shoot-down-drones",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Germany To Allow Police To Shoot Down Drones",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T01:30:05.850659+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T00:45:00+00:00",
        "description": "Shayne Coplan, a 27-year-old NYU dropout who founded Polymarket from his bathroom in 2020, has become the youngest self-made billionaire after Intercontinental Exchange (owner of the NYSE) invested up to $2 billion in his once-controversial prediction market platform. Bloomberg reports: A couple of years after dropping out of New York University with dreams of making it big in crypto, Shayne Coplan was so broke that he took an inventory of his Lower East Side apartment so that he could sell belongings to make rent. Fed up with crypto grifts, in 2019 he started to explore economist Robin Hanson's ideas on prediction markets and their potential for improving society's ability to identify likely outcomes. \"This is too good of an idea to just exist in whitepapers,\" he recalled thinking in a later post on X. Then Covid struck -- the perfect time to develop an app for stuck-at-home folks to bet on real-world outcomes, he reasoned. He began building Polymarket from his bathroom and launched ",
        "id": 3770127,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/08/2033241/polymarket-founder-is-youngest-self-made-billionaire-after-deal-with-nyse-owner",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Polymarket Founder Is Youngest Self-Made Billionaire After Deal With NYSE Owner",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-09T01:30:06.015949+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-09T00:02:00+00:00",
        "description": "Verizon is acquiring Starry, the struggling wireless ISP that beams high-speed internet via millimeter-wave antennas. The company said the acquisition \"advances\" its ability to offer high-speed internet in apartments, condominiums, and other multi-dwelling units. The Verge reports: Starry made its debut in Boston in 2016, offering gigabit speeds via its unconventional approach to internet connectivity. Instead of carrying connectivity across a web of wires -- which are expensive and time-consuming to deploy -- Starry beams its internet service from a larger antenna into homes via high-speed, short-range mmWave broadcasts. The challenge with those broadcasts is that Starry connections generally require an uninterrupted line of sight between the transmitter and the receiver, as mmWave signals can be easily blocked.\n \nIn recent years, Starry has run into trouble, with the company laying off half of its workers in 2022 and filing for bankruptcy in 2023. It also pulled out of one of its ma",
        "id": 3770128,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/10/08/2027258/verizon-buys-isp-starry-to-expand-wireless-broadband",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Verizon Buys ISP Starry To Expand Wireless Broadband",
        "vote": 0
    }
]