[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T17:03:04.568643+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T16:01:39+00:00",
        "description": "After the $80 and \"real fans\" debacle, Gearbox Entertainment had to come out swinging with new Borderlands 4 details. Thankfully, it hasn't disappointed with various hands-on impressions outlining its improved gameplay and feel. The planet of Kairos is seamless, allowing end-to-end travel in zones without any loading screens, but it's also full of things to do.\n\nRafa and Vex were the two playable Vault Hunters with their skill trees and playstyles fully outlined for the first time. The Primordial Vault also presents a new activity for players with various dangers and rewards. And yes, the new ordnance slot can indeed fit throwing knives. If that weren't enough, Gearbox has outlined its post-launch plans for the first time.\n\nCheck out ten of the newest details for Borderlands 4, which launches on September 12th for Xbox Series X/S, PS5, and PC for $69.99 (and later on Nintendo Switch 2).",
        "id": 2972163,
        "language": null,
        "link": "https://www.youtube.com/watch?v=z4pJPE3SPTI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z4pJPE3SPTI/hqdefault.jpg",
        "title": "Borderlands 4 - 10 BIG NEW Details You May Not Know",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T14:51:30.833600+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T14:00:29+00:00",
        "description": "Remedy Entertainment might find FBC: Firebreak’s mediocre scores from critics surprising given the exciting multiplayer experience it currently offers. However, there is an undeniable scope for improving that experience, with the need for more weapons, enemy types, and a rebalancing of its upgrade system. \n\nFirebreak’s content roadmap might be due for a little tweaking even as it draws praise for its lack of paywalls and microtransactions that plague similar titles in modern gaming. That’s especially true when comparing it to other new multiplayer experiences, exposing flaws that Remedy would want to address sooner rather than later. \n\nHowever, it’s likely that Remedy is up to the challenge although it must ensure that its efforts do not disrupt its focus on other projects it has lined up.",
        "id": 2971048,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Kuj2gRjShnc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Kuj2gRjShnc/hqdefault.jpg",
        "title": "Has Remedy DROPPED THE BALL With FBC: Firebreak?",
        "vote": 0
    }
]