[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T23:08:26.414521+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T22:58:00+00:00",
        "description": "The first macOS Tahoe beta appears to drop support for legacy FireWire 400 and 800, making it impossible to sync or mount older iPods and external drives that rely on the standard. MacRumors reports: Unlike on macOS Sequoia and earlier versions, the first macOS Tahoe beta does not include a FireWire section in the System Settings app. Of course, this could all end up being a false alarm. It is still early in the macOS Tahoe beta testing cycle, and FireWire support could return in a later beta version, or in time for the final release.\n \nFireWire was primarily developed by Apple, but it was later standardized as IEEE 1394 and licensed for use in non-Apple devices. iPods started to transition from FireWire to USB for data transfer in 2003, so the standard is very outdated, but it would still be the end of an era if macOS Tahoe drops it. The last Mac with a FireWire port was released in 2012, so connecting older iPods and FireWire drives to newer Macs has long required the use of adapter",
        "id": 2974403,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/19/230226/macos-tahoe-beta-drops-firewire-support?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "macOS Tahoe Beta Drops FireWire Support",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T23:08:26.534824+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T22:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Hollywood Reporter: Bruce Lee, Jackie Chan and Jet Li and a legion of the all-time greats of martial cinema are about to get an AI makeover. In a sign-of-the-times announcement at the Shanghai International Film Festival on Thursday, a collection of Chinese studios revealed that they are turning to AI to re-imagine around 100 classics of the genre. Lee's classic Fist of Fury (1972), Chan's breakthrough Drunken Master (1978) and the Tsui Hark-directed epic Once Upon a Time in China (1991), which turned Li into a bone fide movie star, are among the features poised for the treatment, as part of the \"Kung Fu Movie Heritage Project 100 Classics AI Revitalization Project.\"\n \nThere will also be a digital reworking of the John Woo classic A Better Tomorrow (1986) that, by the looks of the trailer, turns the money-burning anti-hero originally played by Chow Yun-fat into a cyberpunk, and is being claimed as \"the world's first full-process, AI-produce",
        "id": 2974404,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/06/19/2050243/chinese-studios-plan-ai-powered-remakes-of-kung-fu-classics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Studios Plan AI-Powered Remakes of Kung Fu Classics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T22:03:26.371003+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T21:50:00+00:00",
        "description": "Starting mid-July 2025, Microsoft 365 will begin blocking legacy authentication protocols like Remote PowerShell and FrontPage RPC to enhance security under its \"Secure by Default\" initiative. Admins must now grant explicit consent for third-party app access, which could disrupt workflows but aims to reduce unauthorized data exposure. The Register reports: First in line for the chop is legacy browser authentication to SharePoint and OneDrive using the Remote PowerShell (RPS) protocol. According to Microsoft, legacy authentication protocols like RPS \"are vulnerable to brute-force and phishing attacks due to non-modern authentication.\" The upshot is that attempting to access OneDrive or SharePoint via a browser using legacy authentication will stop working.\n \nAlso being blocked is the FrontPage Remote Procedure Call (RPC) protocol. Microsoft FrontPage was a web authoring tool that was discontinued almost two decades ago. However, the protocol for remote web authoring has lived on until ",
        "id": 2974138,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/19/2046206/microsoft-365-brings-the-shutters-down-on-legacy-protocols?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft 365 Brings the Shutters Down On Legacy Protocols",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T22:03:26.545322+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T21:10:00+00:00",
        "description": "SpaceX's Starship exploded on its test stand in South Texas ahead of an engine test, marking the fourth loss of a Starship this year. \"In three previous test flights, the vehicle came apart or detonated during its flight,\" notes the Washington Post. No injuries were reported but the incident highlights ongoing technical challenges as SpaceX races to prove Starship's readiness for deep-space travel. From the report: In a post on the social media site X, SpaceX said that the explosion on the test stand, which could be seen for miles, happened at about 11 p.m. Central time. For safety reasons, the company had cleared personnel from around the site, and \"all personnel are safe and accounted for,\" it said. The company is \"actively working to safe the test site and the immediate surrounding area in conjunction with local officials,\" the post continued. \"There are no hazards to residents in surrounding communities, and we ask that individuals do not attempt to approach the area while safing ",
        "id": 2974139,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/19/2034234/spacex-starship-explodes-on-test-stand?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SpaceX Starship Explodes On Test Stand",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T20:58:24.729030+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T20:30:00+00:00",
        "description": "An anonymous reader quotes a report from Cybernews: Several collections of login credentials reveal one of the largest data breaches in history, totaling a humongous 16 billion exposed login credentials. The data most likely originates from various infostealers. Unnecessarily compiling sensitive information can be as damaging as actively trying to steal it. For example, the Cybernews research team discovered a plethora of supermassive datasets, housing billions upon billions of login credentials. From social media and corporate platforms to VPNs and developer portals, no stone was left unturned.\n \nOur team has been closely monitoring the web since the beginning of the year. So far, they've discovered 30 exposed datasets containing from tens of millions to over 3.5 billion records each. In total, the researchers uncovered an unimaginable 16 billion records. None of the exposed datasets were reported previously, bar one: in late May, Wired magazine reported a security researcher discove",
        "id": 2973801,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/19/2028246/the-16-billion-record-data-breach-that-no-ones-ever-heard-of?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The 16-Billion-Record Data Breach That No One's Ever Heard of",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T18:50:25.281678+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T18:40:00+00:00",
        "description": "Hackers have stolen hundreds of millions of dollars from cryptocurrency holders and disrupted major retailers by targeting outsourced call centers used by American corporations to reduce costs, WSJ reported Thursday. The attackers exploit low-paid call center workers through bribes and social engineering to bypass two-factor authentication systems protecting bank accounts and online portals. \n\nCoinbase faces potential losses of $400 million after hackers compromised data belonging to 97,000 customers by bribing call center workers in India with payments of $2,500. The criminals also used malicious tools that exploited vulnerabilities in Chrome browser extensions to collect customer data in bulk. \n\nTaskUs, which handled Coinbase support calls, shut down operations at its Indore, India facility and laid off 226 workers. Retail attacks targeted Marks &amp; Spencer and Harrods with hackers impersonating corporate executives to pressure tech support workers into providing network access. T",
        "id": 2973000,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/19/1619248/hackers-are-turning-tech-support-into-a-threat?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hackers Are Turning Tech Support Into a Threat",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T18:50:25.460663+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T18:00:00+00:00",
        "description": "Google is using its expansive library of YouTube videos to train its AI models, including Gemini and the Veo 3 video and audio generator, CNBC reported Thursday. From the report: The tech company is turning to its catalog of 20 billion YouTube videos to train these new-age AI tools, according to a person who was not authorized to speak publicly about the matter. Google confirmed to CNBC that it relies on its vault of YouTube videos to train its AI models, but the company said it only uses a subset of its videos for the training and that it honors specific agreements with creators and media companies. \n\n[...] YouTube didn't say how many of the 20 billion videos on its platform or which ones are used for AI training. But given the platform's scale, training on just 1% of the catalog would amount to 2.3 billion minutes of content, which experts say is more than 40 times the training data used by competing AI models.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"sl",
        "id": 2973001,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/19/1613206/google-is-using-youtube-videos-to-train-its-ai-video-generator?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google is Using YouTube Videos To Train Its AI Video Generator",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T17:44:31.505807+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T17:20:00+00:00",
        "description": "Simon Willison, commenting on the recent paper from Apple researchers that found state-of-the-art large language models face complete performance collapse beyond certain complexity thresholds: I thought this paper got way more attention than it warranted -- the title \"The Illusion of Thinking\" captured the attention of the \"LLMs are over-hyped junk\" crowd. I saw enough well-reasoned rebuttals that I didn't feel it worth digging into. \n\nAnd now, notable LLM skeptic Gary Marcus has saved me some time by aggregating the best of those rebuttals together in one place! \n\n[...] And therein lies my disagreement. I'm not interested in whether or not LLMs are the \"road to AGI\". I continue to care only about whether they have useful applications today, once you've understood their limitations. \n\nReasoning LLMs are a relatively new and interesting twist on the genre. They are demonstrably able to solve a whole bunch of problems that previous LLMs were unable to handle, hence why we've seen a rush",
        "id": 2972619,
        "language": null,
        "link": "https://slashdot.org/story/25/06/19/165237/reasoning-llms-deliver-value-today-so-agi-hype-doesnt-matter?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reasoning LLMs Deliver Value Today, So AGI Hype Doesn't Matter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T17:44:31.676954+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T16:40:00+00:00",
        "description": "Apple software chief Craig Federighi has ruled out bringing macOS to the iPad, amusingly using a kitchen utensil analogy to explain the company's design philosophy. \"We don't want to create a boat car or, you know, a spork,\" Federighi said in an interview. \"Someone said, 'If a spoon's great, a fork's great, then let's combine them into a single utensil, right?' It turns out it's not a good spoon and it's not a good fork. It's a bad idea. And so we don't want to build sporks.\" \n\nThe new version of iPadOS, which will ship to consumers later this year, features dynamically resizable windows that users can drag by their corners and a menu bar that is accessible through swipe gestures or cursor movement. \n\nSome observers might consider the iPad Pro itself a \"convertible\" product that blurs the line between tablet and laptop, he said. However, the Mac and iPad serve distinct purposes, he asserted. \"The Mac lets the iPad be iPad,\" he said adding that Apple's objective \"has not been to have i",
        "id": 2972620,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/19/084215/apple-software-chief-rejects-macos-on-ipad?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Software Chief Rejects macOS on iPad",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T16:39:32.297768+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T16:01:00+00:00",
        "description": "Margaret Mitchell, chief ethics scientist at Hugging Face and founder of Google's responsible AI team, has dismissed artificial general intelligence as \"just vibes and snake oil.\" Mitchell, who was ousted from Google in 2021, has co-written a paper arguing that AGI should not serve as a guiding principle for the AI industry. \n\nMitchell contends that both \"intelligence\" and \"general\" lack clear definitions in AI contexts, creating what she calls an \"illusion of consensus\" that allows technologists to pursue any development path under the guise of progress toward AGI. \"But as for now, it's just like vibes, vibes and snake oil, which can get you so far. The placebo effect works relatively well,\" she told FT in an interview. She warns that current AI advancement is creating a \"massive rift\" between those profiting from the technology and workers losing income as their creative output gets incorporated into AI training data.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a cl",
        "id": 2972119,
        "language": null,
        "link": "https://slashdot.org/story/25/06/19/0510206/ai-ethics-pioneer-calls-artificial-general-intelligence-just-vibes-and-snake-oil?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Ethics Pioneer Calls Artificial General Intelligence 'Just Vibes and Snake Oil'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T15:35:18.839335+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T15:22:00+00:00",
        "description": "Iranian state television has instructed residents to delete WhatsApp from their smartphones, claiming the messaging platform gathers user information to share with Israel. \n\nThe local media provided no evidence supporting these allegations but additionally encouraged residents to avoid other \"location-based\" apps. WhatsApp has disputed the claims, with a spokesperson telling Time magazine the Meta-owned platform uses end-to-end encryption and does not track precise locations, keep messaging logs, or provide bulk information to governments. \n\nThe episode comes at a time when Iran is simultaneously experiencing a \"near-total national Internet blackout,\" according to NetBlock, an internet governance monitoring organization. The disruption follows earlier partial outages amid escalating military tensions with Israel after days of missile strikes between the countries. \n\nFurther reading, from earlier this week: Iran Bans Officials From Using Internet-Connected Devices.<p><div class=\"share_",
        "id": 2971543,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/19/0711241/iran-tells-citizens-to-delete-whatsapp?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Iran Tells Citizens To Delete WhatsApp",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T15:35:19.012851+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T14:40:00+00:00",
        "description": "93 Escort Wagon writes: More proof that Amazon's leadership views the balance of power between itself and its workforce tilting decisively in its favor: Amazon's employees are being told they must relocate to one of the company's large hubs -- with the company specifying the required location -- or resign with no severance. CEO Andy Jassy did have the grace to give people 30 days to decide.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Orders+Employees+To+Relocate+To+Seattle+and+Other+Hubs%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F19%2F0535202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F19%2F0535202%2Famazon-orders-employees-to-relocate-to-seattle-and-other-hubs%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https:",
        "id": 2971544,
        "language": null,
        "link": "https://slashdot.org/story/25/06/19/0535202/amazon-orders-employees-to-relocate-to-seattle-and-other-hubs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Orders Employees To Relocate To Seattle and Other Hubs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T14:28:28.778811+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T14:00:00+00:00",
        "description": "ChatGPT-assisted writing dampened brain activity and recall in a controlled MIT study [PDF] of 54 college volunteers divided into AI-only, search-engine, and no-tool groups. Electroencephalography recorded during three essay-writing sessions found the AI group consistently showed the weakest neural connectivity across all measured frequency bands; the tool-free group showed the strongest, with search users in between. \n\nIn the first session 83% of ChatGPT users could not quote any line they had just written and none produced a correct quote. Only nine of the 18 claimed full authorship of their work, compared with 16 of 18 in the brain-only cohort. Neural coupling in the AI group declined further over repeated use. When these participants were later asked to write without assistance, frontal-parietal networks remained subdued and 78% again failed to recall a single sentence accurately. \n\nThe pattern reversed for students who first wrote unaided: introducing ChatGPT in a crossover sessi",
        "id": 2971004,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/19/089201/mit-experiment-finds-chatgpt-assisted-writing-weakens-student-brain-connectivity-and-memory?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MIT Experiment Finds ChatGPT-Assisted Writing Weakens Student Brain Connectivity and Memory",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T13:25:06.709348+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Foreign students will be required to unlock their social media profiles to allow US diplomats to review their online activity before receiving educational and exchange visas, the state department has announced. Those who fail to do so will be suspected of hiding that activity from US officials. The new guidance, unveiled by the state department on Wednesday, directs US diplomats to conduct an online presence review to look for \"any indications of hostility toward the citizens, culture, government, institutions, or founding principles of the United States.\"\n \nA cable separately obtained by Politico also instructs diplomats to flag any \"advocacy for, aid or support for foreign terrorists and other threats to US national security\" and \"support for unlawful antisemitic harassment or violence.\" The screening for \"antisemitic\" activity matches similar guidance given at US Citizenship and Immigration Services under the Department of Home",
        "id": 2970067,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/18/2323209/new-us-visa-rules-will-force-foreign-students-to-unlock-social-media-profiles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New US Visa Rules Will Force Foreign Students To Unlock Social Media Profiles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T10:54:49.768574+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T10:00:00+00:00",
        "description": "Valve has quietly updated the Steam Beta Client to enable Proton by default for all Windows games on Linux, eliminating the need for users to toggle compatibility settings manually. GamingOnLinux reports: For some context here: originally, Proton had an option to enable / disable it globally. That was removed with the Game Recording update last year. That made sense, because people kept somehow turning it entirely off and now it's required by Steam. Currently, there's still an option in the stable Steam Client that you need to manually check to enable Steam Play (Proton) for \"all other titles\". This is something of a leftover from when Proton was initially revealed, and only worked for a specific set of games on Valve's whitelist. It now covers what Valve set by default for Steam Deck and SteamOS verification.\n \nWhat's changed is that at some point in the recent Steam Beta releases, is that \"for all other titles\" option is gone. I've scrolled back through changelogs and not seen it me",
        "id": 2969625,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/19/0053207/steam-beta-enables-proton-on-linux-for-all-titles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Steam Beta Enables Proton On Linux For All Titles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T07:38:33.296569+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T07:00:00+00:00",
        "description": "The U.S. Army Reserve has directly commissioned four top Silicon Valley executives as lieutenant colonels under a new initiative, Detachment 201, aimed at accelerating tech integration into military operations. While these part-time roles are intended to bring private-sector innovation to defense modernization, the move is pretty unusual. Gizmodo reports: The Army said in a press release that the four executives are Shyam Sankar, CTO at Palantir; Andrew Bosworth, CTO at Meta; Kevin Weil, Chief Product Officer of OpenAI; and Bob McGrew, an advisor at Thinking Machines Lab and former Chief Research Officer for OpenAI. The four men are being commissioned at the high rank of lieutenant colonel as part of a program called Detachment 201: The Army's Executive Innovation Corps. As Task &amp; Purpose notes, the men will get to skip the usual process of taking a Direct Commissioning Course at Fort Benning, Georgia, and they won't need to complete the Army Fitness Test.\n \nThe Army didn't respon",
        "id": 2968583,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/19/0046242/silicon-valley-execs-join-the-army-as-officers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Silicon Valley Execs Join the Army As Officers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T04:24:47.078805+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Tech support scammers have devised a method to inject their fake phone numbers into webpages when a target's web browser visits official sites for Apple, PayPal, Netflix, and other companies. The ruse, outlined in a post on Wednesday from security firm Malwarebytes, threatens to trick users into calling the malicious numbers even when they think they're taking measures to prevent falling for such scams. One of the more common pieces of security advice is to carefully scrutinize the address bar of a browser to ensure it's pointing to an organization's official website. The ongoing scam is able to bypass such checks.\n \nThe unknown actors behind the scam begin by buying Google ads that appear at the top of search results for Microsoft, Apple, HP, PayPal, Netflix, and other sites. While Google displays only the scheme and host name of the site the ad links to (for instance, https://www.microsoft.com/ the ad appends parameters to the p",
        "id": 2967873,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/18/2317216/scammers-use-google-ads-to-inject-phony-help-lines-on-apple-microsoft-sites?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scammers Use Google Ads To Inject Phony Help Lines On Apple, Microsoft Sites",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T02:13:42.638173+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T01:20:00+00:00",
        "description": "Longtime Slashdot reader walterbyrd shares news that Texas Instruments has announced plans to invest more than $60 billion to expand its U.S. manufacturing operations in the United States. From a report: The funds will be used to build or expand seven chip-making facilities in Texas as well as Utah, and will create 60,000 jobs, TI said on Wednesday, calling it the \"largest investment in foundational semiconductor manufacturing in U.S. history.\" The company did not give a timeline for the investment.\n \nUnlike AI chip firms Nvidia and AMD, TI makes analog or foundational chips used in everyday devices such as smartphones, cars and medical devices, giving it a large client base that includes Apple, SpaceX and Ford Motor. The spending pledge follows similar announcements from others in the semiconductor industry, including Micron, which said last week that it would expand its U.S. investment by $30 billion, taking its planned spending to $200 billion. [...]\n \nLike other companies unveilin",
        "id": 2967444,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/18/2310223/texas-instruments-to-invest-60-billion-to-make-semiconductors-in-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Texas Instruments To Invest $60 Billion To Make Semiconductors In US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T01:08:36.587391+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T00:41:00+00:00",
        "description": "The daughter of a Seattle woman who died during the 2021 Pacific Northwest heatwave has filed the first wrongful death lawsuit directly linking fossil fuel companies to an individual's climate-related death. \n\nMisti Leon is suing seven oil and gas companies, including ExxonMobil, Chevron, Shell and BP, claiming they caused her mother Juliana Leon's death from hyperthermia on June 28, 2021, when temperatures reached 108 degrees Fahrenheit. The lawsuit alleges the companies created a \"fossil fuel-dependent economy\" that resulted in \"more frequent and destructive weather disasters and foreseeable loss of human life.\" Attribution science research determined the 2021 heatwave would have been \"virtually impossible\" without human-made climate change and was at least 150 times rarer without warming. \n\nThe case seeks damages and funding for a public education campaign about fossil fuels' role in planetary heating.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" ",
        "id": 2967239,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/18/1951212/major-oil-companies-face-first-climate-death-lawsuit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Major Oil Companies Face First 'Climate Death' Lawsuit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T01:08:36.759839+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T00:02:00+00:00",
        "description": "iPhone sales jumped 15% year-over-year in April and May 2025, \"signaling Apple's strongest two-month performance for the period since the pandemic,\" reports MacRumors, citing preliminary data from Counterpoint Research. From the report: The growth was driven mainly by the United States and China, Apple's two largest markets. Both regions returned to positive year-over-year growth after three years of declines during what is typically a less seasonal period. China sales were particularly notable, with Apple capturing the top spot in May. It's quite the turnaround, after Apple only recently sustained market share losses to Huawei and other local mobile vendors. [...]\n \nThe report showed Japan also indicated strong iPhone demand, with the more affordable iPhone 16e proving especially popular among consumers who favor smaller devices. The device's entry-level pricing apparently appealed to Japanese tastes, while Apple also maintained strong sales for the iPhone 16 base model and even the ",
        "id": 2967240,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/06/18/1945255/apple-posts-strongest-two-month-iphone-growth-since-pandemic?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Posts Strongest Two-Month iPhone Growth Since Pandemic",
        "vote": 0
    }
]