[
    {
        "age": null,
        "album": "",
        "author": "/u/Worldly-Protection59",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T14:33:35.002894+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T13:30:57+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Hey folks,</p> <p>I’ve been solo-building a SaaS product aimed at a niche service industry. It’s a vertical tool combining scheduling, CRM, and payment workflows — all wrapped in a clean UI and nearly ready to go live.</p> <p>The app is about <strong>95% complete</strong>: user authentication, Stripe billing, user roles, dashboards, notifications, all functional. It also includes some built-in AI automation features like route forecasting, pricing suggestions, and dynamic invoice messaging using OpenAI APIs.</p> <p>There’s real market interest — I’ve spoken with operators in the space who are eager to use it and are currently cobbling together a solution manually.</p> <p>What I need now is a <strong>developer</strong> who can help address a few lingering bugs, improve some auth workflows ( thinking Clerk, but open to your ideas), and tighten up edge cases before we onboard real users. Working on getting verified by Twilio now as well for sending payme",
        "id": 2971016,
        "language": null,
        "link": "https://www.reddit.com/r/developer/comments/1lfaw00/looking_for_a_developer_to_help_finalize_my_saas",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 508,
        "source_url": "https://www.reddit.com/r/developer/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Looking for a developer to help finalize my SaaS product — 95% done, ready to launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/JelloKittie",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-19T02:20:34.896166+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-19T01:42:10+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I am in a position where I need to find a new job and although I’ve never been in a developer titled position, I realized that I’ve been working as one for years and have a pretty strong skill set with decent experience as a developer. Most of my work has been web development with some full stack work using react, vue, and asp.net. After finishing my resume, I’m confident I will get interviews— which is what is giving me the anxiety, as I’m in my late 30s and haven’t needed to interview for a position in YEARS. </p> <p>I know I am capable of doing the work, but I am worried about being asked to code in front of someone or be out on the spot then freezing or having my mind go blank. Can anyone tell me what it’s like to apply for a senior developer or programmer position these days? Anything I should work on or practice specifically? </p> <p>Hopefully I’m just over thinking this, but any insight or help would be greatly appreciated!</p> </div><!-- SC_ON",
        "id": 2967467,
        "language": null,
        "link": "https://www.reddit.com/r/developer/comments/1leynh1/any_tips_for_this",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 508,
        "source_url": "https://www.reddit.com/r/developer/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Any tips for this?",
        "vote": 0
    }
]