[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T18:20:40.663087+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T17:30:27+00:00",
        "description": "Rules of Engagement: The Grey State is a wildly unique extraction shooter. It takes place within a variety of different horror realms with gameplay that fuses objective-based extraction with a royale pace and some RPG progression sprinkled on top.  \n\nHunt: The Showdown inspired some of the extraction shooter ideas while the studio’s previous game, Ring of Elysium helped define some of the battle royale elements. \n\nWith a projected 2026 release on PC, this horror-themed free to play extraction shooter is sure to scare and delight genre fans and newcomers alike. The monster designs in particular are a standout, and the team has even expressed interest collaborating across horror franchises to diversify its creature roster further.",
        "id": 3943721,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=rssOwxPjyFo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rssOwxPjyFo/hqdefault.jpg",
        "title": "This Graphically Intense Horror Shooter Makes You Survive Nightmares, IS LOOKING BONKERS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T16:12:49.539443+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T16:01:27+00:00",
        "description": "Football Manager 26 lays down a solid new foundation for the series’ next era with engaging tactical systems and addictive management simulation, even if it stumbles with UI issues.",
        "id": 3942654,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=rTVxLqK-WJc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rTVxLqK-WJc/hqdefault.jpg",
        "title": "Football Manager 26 Review - Was The Two Year Wait Worth It?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T14:07:34.595176+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T13:30:01+00:00",
        "description": "While there are some brilliant experiences within the horror genre, some games outside of it present more than a few scary experiences that stay with you long after you complete them. \n\nFrom some mind-bending psychological themes to straight up monsters and frights, we've put together a list of some of the most terrifying experiences we've had outside of the horror bracket. Their themes and presentation can certainly give you goosebumps in many instances. \n\nFrom imposing enemy designs to environments or stories that can give you the chills, there's something for every horror fan to find and enjoy in this one. You might just find your next big collection of thrills and chills, and some of these games might even surpass your expectations.",
        "id": 3941524,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=-n7d5fXa6fU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-n7d5fXa6fU/hqdefault.jpg",
        "title": "10 PS5 Games That Aren’t Billed As Horror But Sneak In Real Horror Vibes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T10:25:07.720779+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T09:45:06+00:00",
        "description": "This one time in ARC Raiders, while scrounging around for resources, a regular rooftop stroll turned into a battle with ARC and a squad wipe at the hands of another team who used our own zipline against us. Another time in ARC Raiders, we ventured into the forest and went up against a Leaper – unprepared, it promptly wiped two of us out before cleaning up the third in their desperate bid to revive me. Yet another time in ARC Raiders, we engaged in a tense sniper shoot-out – I went down in a lame attempt to flank them from below, but a timely rez on an ally before my escapade contributed, however little, to our team ultimately escaping.\n\nI'm not the biggest extraction shooter aficionado on the planet, but Embark Studios' latest, which should be available by the time this is live, had me thoroughly engrossed. Even while releasing among titans like Battlefield 6 and Call of Duty: Black Ops 7 – a venerable repeat, if you will, of the Great Titanfall 2 Tragedy – I can confirm: You need to ",
        "id": 3939769,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=napHizPpNho",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/napHizPpNho/hqdefault.jpg",
        "title": "ARC Raiders Is The Extraction Shooter Event of the Year, And You NEED To Play It",
        "vote": 0
    }
]