[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T21:55:59.193188+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T21:21:00+00:00",
        "description": "A critical security flaw in Chromium's Blink rendering engine can crash billions of browsers within seconds. Security researcher Jose Pino discovered the vulnerability and created a proof-of-concept exploit called Brash to demonstrate the bug affecting Chrome, Edge, OpenAI's ChatGPT Atlas, Brave, Vivaldi, Arc, Dia, Opera and Perplexity Comet. \n\nThe flaw, reports The Register, exploits the absence of rate limiting on document.title API updates in Chromium versions 143.0.7483.0 and later. The attack injects millions of DOM mutations per second and saturates the main thread. When The Register tested the code on Edge, the browser crashed and the Windows machine locked up after about 30 seconds while consuming 18GB of RAM in one tab. Pino disclosed the bug to the Chromium security team on August 28 and followed up on August 30 but received no response. Google said it is looking into the issue.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twit",
        "id": 3945608,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/30/205211/unpatched-bug-can-crash-chromium-based-browsers-in-seconds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Unpatched Bug Can Crash Chromium-Based Browsers in Seconds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T21:55:59.320252+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T20:41:00+00:00",
        "description": "AI \"cheating\" app Cluely's CEO and cofounder, Chungin \"Roy\" Lee, said most startups flop because their products don't get seen. From a report: \"Engineers just cannot make good content,\" Lee said during a Wednesday interview at TechCrunch Disrupt 2025 \"There's a bunch of shallow replicas, but I challenge you to find one video you think is like, 'Yo, this is as tough as Cluely,'\" he told TechCrunch. \n\nEvery startup needs to focus more on distribution. And most startups flop because they fail to get seen, even if they have product-market fit, Lee said. Cluely launched earlier this year as a tool to help software engineers cheat on their job interviews, among other use cases. The startup earlier this year posted a tongue-in-cheek video of Lee trying to use Cluely to impress a woman on a date, which went viral.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+'Cheating'+App+Founder+Says+Engineers+Can't+Make+Good%2C+Vira",
        "id": 3945609,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/30/1942215/ai-cheating-app-founder-says-engineers-cant-make-good-viral-content-and-thats-why-their-startups-flop",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI 'Cheating' App Founder Says Engineers Can't Make Good, Viral Content and That's Why Their Startups Flop",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T21:55:59.417944+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T20:02:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Since launching Google Play (nee Android Market) in 2008, Google has never made a change to the US store that it didn't want to make -- until now. Having lost the antitrust case brought by Epic Games, Google has implemented the first phase of changes mandated by the court. Developers operating in the Play Store will have more freedom to direct app users to resources outside the Google bubble. However, Google has not given up hope of reversing its loss before it's forced to make bigger changes. Epic began pursuing this case in 2020, stemming from its attempt to sell Fortnite content without going through Google's payment system. It filed a similar case against Apple, but the company fell short there because it could not show that Apple put its thumb on the scale. Google, however, engaged in conduct that amounted to suppressing the development of alternative Android app stores. It lost the case and came up short on appeal this past ",
        "id": 3945610,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/30/1929241/google-makes-first-play-store-changes-after-losing-epic-games-antitrust-case",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Makes First Play Store Changes After Losing Epic Games Antitrust Case",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T19:52:35.953551+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T19:25:00+00:00",
        "description": "Meta CEO Mark Zuckerberg is getting ready to dump even more AI-generated posts into your social feeds. From a report: During an earnings call on Wednesday, Zuckerberg said the company will \"add yet another huge corpus of content\" to its recommendations system as AI \"makes it easier to create and remix\" work that gets shared online. \n\n\"Social media has gone through two eras so far,\" Zuckerberg said. \"First was when all content was from friends, family, and accounts that you followed directly. The second was when we added all of the Creator content.\" Though Zuckerberg stops short of calling AI the third era of social media, it's clear that the technology will be heavily involved in what comes next. \n\nZuckerberg said that recommendation systems that \"deeply understand\" AI-generated posts and \"show you the right content\" will become \"increasingly valuable.\" The company has already begun embedding AI tools across its apps and is now experimenting with dedicated AI social apps, too.<p><div ",
        "id": 3944606,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/30/1913228/zuckerberg-getting-ready-to-dump-more-ai-content-to-social-feeds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Zuckerberg Getting Ready To Dump More AI Content To Social Feeds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T19:52:36.053299+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T18:46:00+00:00",
        "description": "An anonymous reader shares a report: The International Criminal Court will switch its internal work environment away from Microsoft Office to Open Desk, a European open source alternative, the institution confirmed to Euractiv. The switch comes amid rising concerns about public bodies being reliant on US tech companies to run their services, which have stepped up sharply since the start of US President Donald Trump's second administration. \n\nFor the ICC, such concerns are not abstract: Trump has repeatedly lashed out at the court and slapped sanctions on its chief prosecutor, Karim Khan. Earlier this year, the AP also reported that Microsoft had cancelled Khan's email account, a claim the company denies. \"We value our relationship with the ICC as a customer and are convinced that nothing impedes our ability to continue providing services to the ICC in the future,\" a Microsoft spokesperson told Euractiv.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" hr",
        "id": 3944607,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/30/1847204/international-criminal-court-to-ditch-microsoft-office-for-european-open-source-alternative",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "International Criminal Court To Ditch Microsoft Office For European Open Source Alternative",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T19:52:36.152878+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T18:00:00+00:00",
        "description": "TypeScript overtook Python and JavaScript in August 2025 to become the most used language on GitHub. The shift marked the most significant language change in more than a decade. The language grew by over 1 million contributors in 2025, a 66% increase year over year, and finished August with 2,636,006 monthly contributors. \n\nNearly every major frontend framework now scaffolds projects in TypeScript by default. Next.js 15, Astro 3, SvelteKit 2, Qwik, SolidStart, Angular 18, and Remix all generate TypeScript codebases when developers create new projects. Type systems reduce ambiguity and catch errors from large language models before production. A 2025 academic study found 94% of LLM-generated compilation errors were type-check failures. Tooling like Vite, ts-node, Bun, and I.D.E. autoconfig hide boilerplate setup. Among new repositories created in the past twelve months, TypeScript accounted for 5,394,256 projects. That represented a 78% increase from the prior year.<p><div class=\"share",
        "id": 3944608,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/30/1753252/typescript-overtakes-python-and-javascript-to-claim-top-spot-on-github",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "TypeScript Overtakes Python and JavaScript To Claim Top Spot on GitHub",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T17:44:35.689586+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T17:22:00+00:00",
        "description": "Carmakers in the EU are \"days away\" from closing production lines, the industry has warned, as a crisis over computer chip supplies from China escalates. From a report: The European Automobile Manufacturers' Association (ACEA) issued an urgent warning on Wednesday saying its members, which include BMW, Fiat, Peugeot and Volkswagen, were now working on \"reserve stocks but supplies are dwindling.\" \n\n\"Assembly line stoppages might only be days away. We urge all involved to redouble their efforts to find a diplomatic way out of this critical situation,\" said its director general, Sigrid de Vries. Another ACEA member, Mercedes, is now searching globally for alternative sources of the crucial semiconductors, according to its chief executive, Ola Kallenius. The chip shortage is also causing problems in Japan, where Nissan's chief performance officer, Guillaume Cartier, told reporters at a car show in Tokyo that the company was only \"OK to the first week of November\" in terms of supply.<p><di",
        "id": 3943493,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/30/1710234/eu-carmakers-days-away-from-halting-work-as-chip-war-with-china-escalates",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU Carmakers 'Days Away' From Halting Work as Chip War With China Escalates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T17:44:36.025701+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T16:41:00+00:00",
        "description": "Gallup: After peaking at a record high of 39.9% in 2022, the U.S. adult obesity rate has gradually declined to 37.0% in 2025. This is a statistically meaningful decrease representing an estimated 7.6 million fewer obese adults compared with three years ago. Meanwhile, diagnoses of diabetes -- a lifetime disease that can be managed but not cured -- have now reached an all-time high of 13.8%. Both metrics are part of the ongoing Gallup National Health and Well-Being Index. \n\n[...] Over the past year, more Americans have turned to Type 2 antidiabetic GLP-1 drugs such as semaglutide (brand names Ozempic and Wegovy) for weight loss purposes. The percentage of adults who report taking this class of medicine specifically for weight loss has increased to 12.4%, compared with 5.8% in February 2024 when Gallup first measured it. Usage among women (15.2%) continues to outpace men (9.7%), but both groups have more than doubled their use in the past year. These results dovetail with increased awar",
        "id": 3943494,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/30/1641222/obesity-rate-declining-in-us",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Obesity Rate Declining in U.S.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T17:44:36.469831+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T16:10:00+00:00",
        "description": "Britain is facing mounting pressure to ban mercury dental fillings, one of the few countries yet to prevent the practice, as new data reveals alarming contamination levels in the nation's fish and shellfish. The Guardian: Mercury is a potent neurotoxin that can harm the nervous, digestive and immune systems, as well as the lungs, kidneys, skin and eyes, even at low levels of exposure. Its organic form, methylmercury, is particularly dangerous to unborn babies and can move through the food chain building up in insects, fish and birds. \n\nBritain is lagging behind the rest of the world on phasing out mercury dental fillings, with 43 countries having already banned mercury amalgam, including the EU, Sweden, Norway, Tanzania, Uganda, Indonesia and the Philippines. Northern Ireland will outlaw mercury fillings from 2035 but no such ban is planned in the rest of Britain. According to new analysis by the Rivers Trust and Wildlife and Countryside Link, more than 98% of fish and mussels tested ",
        "id": 3943495,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/30/1512240/toxin-levels-in-fish-lead-to-calls-for-uk-wide-ban-on-mercury-dental-fillings",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Toxin Levels in Fish Lead To Calls For UK-Wide Ban on Mercury Dental Fillings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T15:45:07.502689+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T15:30:00+00:00",
        "description": "New submitter hadleyburg writes: President Trump has directed the Department of War to restart nuclear weapons testing. The directive appears to be a counter measure to rival nations catching up with the US. The last US nuclear test was an underground test, on September 23, 1992, in Nevada.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Nuclear+Weapons+Testing+To+Resume+For+First+Time+in+Over+30+Years%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F30%2F155217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F30%2F155217%2Fus-nuclear-weapons-testing-to-resume-for-first-time-in-over-30-years%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://n",
        "id": 3942379,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/30/155217/us-nuclear-weapons-testing-to-resume-for-first-time-in-over-30-years",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Nuclear Weapons Testing To Resume For First Time in Over 30 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T15:45:07.686074+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T14:57:00+00:00",
        "description": "Google will offer 18-month free access to its Gemini AI service for all 505 million telecom users of India's Reliance Jio, a tie-up that follows similar freebies from rivals including OpenAI to boost adoption in the world's most populous nation. From a report: The move also comes weeks after Google committed to invest $15 billion in AI infrastructure capacity in India, its biggest investment yet in the critical South Asian market. \n\n[...] The Gemini offer will give Jio users free access to the advanced model of the AI app, two terabytes of cloud storage, and its image and video generation models, in an 18-month offering that is otherwise priced at 35,100 rupees ($399). The companies on Thursday also announced AI partnerships that targeted Indian businesses.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+To+Offer+Free+Gemini+AI+Pro%2C+2TB+Storage+To+India's+505+Million+Reliance+Jio+Users%3A+https%3A%2F%2Ftech.",
        "id": 3942380,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/30/1457216/google-to-offer-free-gemini-ai-pro-2tb-storage-to-indias-505-million-reliance-jio-users",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google To Offer Free Gemini AI Pro, 2TB Storage To India's 505 Million Reliance Jio Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T15:45:07.811377+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T14:00:00+00:00",
        "description": "More than a half dozen federal departments and agencies have backed a proposal to ban future sales of the most popular home routers in the United States on the grounds that the vendor's ties to mainland China make them a national security risk, Washington Post reported Thursday, citing people briefed on the matter. From the report: The proposal, which arose from a months-long risk assessment, calls for blocking sales of networking devices from TP-Link Systems of Irvine, California, which was spun off from a China-based company, TP-Link Technologies, but owns some of that company's former assets in China. \n\nThe ban was proposed by the Commerce Department and supported this summer by an interagency process that includes the Departments of Homeland Security, Justice and Defense, the people said. \"TP-Link vigorously disputes any allegation that its products present national security risks to the United States,\" Ricca Silverio, a spokeswoman for TP-Link Systems, said in a statement. \"TP-Li",
        "id": 3942381,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/30/1250216/us-agencies-back-banning-top-selling-home-routers-on-security-grounds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Agencies Back Banning Top-Selling Home Routers on Security Grounds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T13:37:40.947604+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from 9to5Mac: A mother with court-ordered custody of her children has described how Apple's Family Sharing feature can be weaponized by a former partner. Apple support staff were unable to assist her when she reported her former partner using the service in controlling and coercive ways... [...] Namely, Family Sharing gives all the control to one parent, not to both equally. The parent not identified as the organizer is unable to withdraw their children from this control, even when they have a court order granting them custody. As one woman's story shows, this can allow the feature which allows it to be weaponized by an abusive former partner.\n \nWired reports: \"The lack of dual-organizer roles, leaving other parents effectively as subordinate admins with more limited power, can prove limiting and frustrating in blended and shared households. And in darker scenarios, a single-organizer setup isn't merely inconvenient -- it can be dangerous. Kate (nam",
        "id": 3941420,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/30/0242231/mother-describes-the-dark-side-of-apples-family-sharing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mother Describes the Dark Side of Apple's Family Sharing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T11:44:08.292223+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T10:00:00+00:00",
        "description": "Alphabet reported its first-ever $100 billion quarter, fueled by a 34% surge in Google Cloud revenue and booming AI demand. The tech giant also announced an increase in expected capital expenditures for the fiscal year of 2025. CNBC reports: \"With the growth across our business and demand from Cloud customers, we now expect 2025 capital expenditures to be in a range of $91 billion to $93 billion,\" the company said in its earnings report (PDF) Wednesday. \"Looking out to 2026, we expect a significant increase in CapEx and will provide more detail on our fourth quarter earnings call,\" said finance chief Anat Ashkenazi on the earnings call with investors Wednesday.\n \nEarlier this year, the company increased its capital expenditure expectation from $75 billion to $85 billion. Most of that goes toward technical infrastructure such as data centers. The latest earnings show the company is seeing rising demand for its AI services, which largely sit in its cloud unit. It also shows the company ",
        "id": 3940528,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/30/0224216/alphabet-tops-100-billion-quarterly-revenue-for-first-time",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Alphabet Tops $100 Billion Quarterly Revenue For First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T09:56:55.174994+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T07:00:00+00:00",
        "description": "sciencehabit shares a report from Science.org: From enabling life as we know it to greasing the geological machinery of plate tectonics, water can have a huge influence on a planet's behavior. But how do planets get their water? An infant world might be bombarded by icy comets and waterlogged asteroids, for instance, or it could form far enough from its host star that water can precipitate as ice. However, certain exoplanets pose a puzzle to astronomers: alien worlds that closely orbit their scorching home stars yet somehow appear to hold significant amounts of water.\n \nA new series of laboratory experiments, published today in Nature, has revealed a deceptively straightforward solution to this enigma: These planets make their own water. Using diamond anvils and pulsed lasers, researchers managed to re-create the intense temperatures and pressures present at the boundary between these planets' hydrogen atmospheres and molten rocky cores. Water emerged as the minerals cooked within the",
        "id": 3939643,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/30/024222/alien-worlds-may-be-able-to-make-their-own-water",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Alien Worlds May Be Able To Make Their Own Water",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T03:55:24.516578+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: In March, three months after being forced out of his position as the CEO of Intel and sued by shareholders, Patrick Gelsinger took the reins at Gloo, a technology company made for what he calls the \"faith ecosystem\" -- think Salesforce for churches, plus chatbots and AI assistants for automating pastoral work and ministry support. [...] Now Gloo's executive chair and head of technology (who's largely free of the shareholder suit), Gelsinger has made it a core mission to soft-power advance the company's Christian principles in Silicon Valley, the halls of Congress and beyond, armed with a fundraised war chest of $110 million. His call to action is also a pitch for AI aligned with Christian values: tech products like those built by Gloo, many of which are built on top of existing large language models, but adjusted to reflect users' theological beliefs.\n \n\"My life mission has been [to] work on a piece of technology that would improv",
        "id": 3938415,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/29/225246/ex-intel-ceos-mission-to-build-a-christian-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ex-Intel CEO's Mission To Build a Christian AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T02:41:21.447709+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T01:25:00+00:00",
        "description": "schwit1 shares a report from IOL: China has enacted a new law regulating social media influencers, requiring them to hold verified professional qualifications before posting content on sensitive topics such as medicine, law, education, and finance, IOL reported. The new law went into effect on Saturday. The regulation was introduced by the Cyberspace Administration of China (CAC) as part of its broader effort to curb misinformation online.\n \nUnder the new rules, influencers must prove their expertise through recognized degrees, certifications, or licenses before discussing regulated subjects. Major platforms such as Douyin (China's TikTok), Bilibili, and Weibo are now responsible for verifying influencer credentials and ensuring that content includes clear citations, disclaimers, and transparency about sources. A separate report notes that if influencers are caught talking about the \"serious\" topics, they will face a fine of up to 100,000 yuan ($14,000).<p><div class=\"share_submission",
        "id": 3938149,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/29/2223209/new-china-law-fines-influencers-if-they-discuss-serious-topics-without-a-degree",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New China Law Fines Influencers If They Discuss 'Serious' Topics Without a Degree",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T01:21:42.430884+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T00:45:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: SUSE is making headlines with the release of SUSE Linux Enterprise Server 16, the first enterprise Linux distribution to integrate agentic AI directly into the operating system. It uses the Model Context Protocol (MCP) to securely connect AI models with data sources while maintaining provider freedom. This gives organizations the ability to run AI-driven automation without relying on a single ecosystem. With a 16-year lifecycle, reproducible builds, instant rollback capabilities, and post-2038 readiness, SLES 16 also doubles down on long-term reliability and transparency.\n \nFor enterprises, this launch marks a clear step toward embedding intelligence at the infrastructure level. The system can now perform AI-assisted administration via Cockpit or the command line, potentially cutting downtime and operational costs. SUSE's timing might feel late given the AI boom, but its implementation appears deliberate -- balancing innovation with the sta",
        "id": 3937816,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/10/29/2211231/suse-linux-enterprise-server-16-becomes-first-enterprise-linux-with-built-in-agentic-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SUSE Linux Enterprise Server 16 Becomes First Enterprise Linux With Built-In Agentic AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-30T01:21:42.508769+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-30T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Substrate, a small U.S. startup, said on Tuesday that it had developed a chipmaking tool capable of competing with the most advanced lithography equipment made by Dutch firm ASML. Substrate's tool is the first step in the startup's ambitious plan to build a U.S.-based contract chip-manufacturing business that would compete with Taiwan's TSMC in making the most advanced AI chips, its CEO James Proud told Reuters in an interview. Proud wants to slash the cost of chipmaking by producing the tools needed much more cheaply than rivals. [...]\n \nAn engineering feat that has eluded even large companies, lithography needs extreme precision. ASML is the only company in the world that has been able to make at scale the complex tools that use extreme ultraviolet (EUV) to produce patterns on silicon wafer at a high rate of throughput. Substrate said that it has developed a version of lithography that uses X-ray light and is capable of printing feat",
        "id": 3937817,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/29/2130249/us-startup-substrate-announces-chipmaking-tool-that-it-says-will-rival-asml",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Startup Substrate Announces Chipmaking Tool That It Says Will Rival ASML",
        "vote": 0
    }
]