[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:25.332260+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T18:00:23+00:00",
        "description": "#shorts #tedx #ted #chatgpt #tech #love #ai",
        "id": 4287030,
        "language": "en",
        "link": "https://www.youtube.com/shorts/CT7EAOSu9XA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CT7EAOSu9XA/hqdefault.jpg",
        "title": "Why do people fall in love with ChatGPT? #shorts #tedx",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:25.466356+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:40:10+00:00",
        "description": "This talk reveals how some of history’s greatest breakthroughs began as ideas people once called impossible. Through examples from science, activism, and invention, the speaker highlights the power of daring to question limits and invites young people to protect their own rebel ideas. Mahadika Atalla Sonday is a highly accomplished student with a strong passion for biology and the sciences. Currently a 9th grader at Cahaya Rancamaya IBS, he has earned recognition in multiple academic competitions, including a gold medal and 1st place in Biology at the Wardaya MSC 2025, a bronze medal in IKLC 2024, and 25th place out of more than 1200 participants in the MSI 2025 organized by SMA Taruna Nusantara. Beyond academics, Mahadika enjoys chess, football, and opportunities to learn, grow, and contribute meaningfully. With a vision for living a life happily ever after and helping make the world a more bearable place, he continues to pursue excellence with curiosity and dedication. This talk was",
        "id": 4287031,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Ytlcak4L35w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Ytlcak4L35w/hqdefault.jpg",
        "title": "Rebel Ideas | Mahadika Atalla Sonday | TEDxCRIBS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:25.593560+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:39:57+00:00",
        "description": "This talk uses the metaphor of a lighthouse to explore how we navigate fear, uncertainty, and difficult moments. The speaker shares insights on finding inner guidance and becoming a light that helps others find their way. Khafizzahi Ali Malano is a Grade 8A student and young thinker whose curiosity drives his journey as a TEDx Youth speaker. Born on 6 September 2012 in Bogor, he has always been fascinated by how ideas grow and influence people. With strong academic interest in science, mathematics, and real-world problem solving, he constantly challenges himself to understand how the world works.\n\nKnown for his visual learning style, calm personality, and clear communication, Khafizzahi believes young voices matter and that inspiration can come from anyone, at any age. Through TEDx, he shares perspectives shaped by curiosity, resilience, and a desire to improve himself, encouraging other students to think boldly and explore their potential.\n\nOutside speaking, he enjoys football, futsa",
        "id": 4287032,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NTvFiaSUDoU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NTvFiaSUDoU/hqdefault.jpg",
        "title": "The Light House In The Dark | KhafIzzahi Ali Malano | TEDxCRIBS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:25.722331+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:39:38+00:00",
        "description": "O que você faz quando tem algum desequilíbrio que te incomoda?\nVocê ignora e considera que viver com desconforto é algo normal ou você silencia o sintoma, buscando soluções fora e novidades que tragam resultados rápidos?\nNesse vídeo eu te mostro as oportunidades de um terceiro caminho - a auto escuta.\nUm caminho que te convida a ouvir, honrar a respeitar o seu corpo, à partir de escolhas simples. Uma oportunidade desenvolver um olhar mais atento para as suas próprias necessidades, suas ações e seus impactos e, com isso, construir mais saude e longevidade.\n Nutricionista funcional e integrativa, terapeuta ayurveda e health coach. É também cofundadora do Portal Ella, palestrante, mentora e consultora para empresas e marcas. Há mais de 20 anos vem apoiando o encontro da saúde e bem-estar através de hábitos simples e consistentes. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4287033,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BUGheaA_kqk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BUGheaA_kqk/hqdefault.jpg",
        "title": "Saúde à partir da auto escuta | Fernanda Scheer | TEDxUDESC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:25.817447+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:30:16+00:00",
        "description": "Trent Berg speaks at TEDxMontanaStateUniversity about his journey from the Fort Peck Indian Reservation to becoming the Director of Lidar Engineering at Aurora, a world leader in automotive self driving technology. Trent Berg, Montana native and MSU alumnus (2004 BS in CS, 2009 MS in ECE), has been a visionary pioneer in Montana photonics. Trent serves as the Director of Lidar Engineering at Aurora- a company responsible for some of the country’s leading automotive vehicle technology. Here Trent oversees the team that validates the performance of FirstLight Lidar and other lidar sensors used in Aurora's autonomy stack. In his presentation, Trent will discuss his personal journey from northeastern Montana to MSU, to founding Blackmore Sensors & Analytics, being acquired by Aurora Innovations, and now leading the Aurora Innovations team. He will recount the trials, tribulations, and pivotal moments that have shaped his career. This talk was given at a TEDx event using the TED conference",
        "id": 4287034,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Vr0_hDU8nNo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Vr0_hDU8nNo/hqdefault.jpg",
        "title": "Farm to Photonics | Trent Berg | TEDxMontanaStateUniversity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:25.910738+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:30:02+00:00",
        "description": "Quinn Holland presents at TEDxMontanaStateUniversity about his research and work in the field of sustainable agriculture.  Robert Quinn Holland is a brother, son, friend and co-founder. He spends his days building meaningful relationships between people, places and plates. His business, Nutrax, connects what happens at the farm & ranch to the nutritional (and health) outcomes of what they produce, giving major food companies a way to invest in what people are craving today: health and regeneration. When he’s not working on Nutrax, Robert is out in nature or getting to know someone, hopefully both. \n\nTonight he will share on the significance of what you eat and how it was raised. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4287035,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IvTctePMEqQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IvTctePMEqQ/hqdefault.jpg",
        "title": "A New Story of Health | Quinn Holland | TEDxMontanaStateUniversity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:25.999622+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:26:33+00:00",
        "description": "Sarah Nell Harp speaks at TEDxMontanaStateUniversity about her journey to become a beginner, try new things, and embrace failure.  Sarah Nell Harp is a junior here at Montana State University. She is currently pursuing a Bachelor of Arts in Graphic Design and a Bachelor of Science in Marketing, accompanied by a minor in International Business. Along with her academic career, Sarah Nell serves on her sorority's executive board, acts as a JABS ambassador, works for ASMSU and Outdoor Recreation, photographs for the athletic department, leads a Bible study at her sorority, and participates in Boardroom Bobcats. Sarah Nell is originally from Fayetteville, GA, and possesses a deep love for her family. She enjoys art, spending time with her loved ones, listening to music, adventuring in the great outdoors, practicing her faith, and soaking up every wonderful moment life has to offer. She looks forward to speaking at TEDxMontanaStateUniversity and hopes that the audience can gain some inspira",
        "id": 4287036,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LT2jGMDmHQc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LT2jGMDmHQc/hqdefault.jpg",
        "title": "It is Okay to be a Beginner | Sarah Nell Harp | TEDxMontanaStateUniversity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:26.087820+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:26:14+00:00",
        "description": "Brianna Daniels speaks at TEDxMontanaStateUniversity about her journey with cancer and how it shaped her into the amputee athlete that she is today.  Bri Daniels is a two-time childhood cancer survivor, amputee, and advocate for disability rights. After losing her leg to bone cancer at 18, she discovered adaptive sports and the transformative power of community to rebuild confidence and purpose. Through her work in adaptive sports, expanding prosthetic access, and inclusive healthcare design, she helps build communities where everyone can move, play, and belong. Bri invites audiences to reimagine mobility, not just as a physical ability, but as a universal human right and a source of joy, freedom, and connection. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4287037,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=tnL4rO2L9ug",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tnL4rO2L9ug/hqdefault.jpg",
        "title": "Stumped but Still Standing | Brianna Daniels | TEDxMontanaStateUniversity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:30:26.175313+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:25:46+00:00",
        "description": "A fisioterapeuta Maria Verônica Santos compartilha sua jornada de vida, que inclui a superação de um câncer, para defender um modelo de cuidado em saúde baseado na escuta ativa e no acolhimento humanizado, onde a técnica profissional é inseparável da sensibilidade e do afeto pelo paciente.\n Ela é a síntese do cuidado e da escuta. Criada em uma família matriarcal, iniciou na enfermagem e se formou fisioterapeuta aos 40 anos, unindo técnica e sensibilidade. Após superar um câncer de mama, fortaleceu seu olhar atento, transformando cada atendimento em acolhimento e bem-estar. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4287038,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eTKu9JIqiyQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eTKu9JIqiyQ/hqdefault.jpg",
        "title": "A força da sensibilidade no tratamento | Maria Verônica Santos | TEDxUnisinos Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:45.177219+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:23:54+00:00",
        "description": "Monique Machado defende o acolhimento antirracista como chave para a saúde mental da população negra, valorizando o cuidado coletivo, a identidade racial e a construção de espaços seguros. Psicóloga, educadora social e coordenadora do Coletivo Corre Preto, promove a inclusão da população negra com foco em saúde mental e acolhimento. Criadora de conteúdo, compartilha reflexões nas redes sociais para ampliar o debate e oferecer apoio. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4286376,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=yWqP4d3GTGs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yWqP4d3GTGs/hqdefault.jpg",
        "title": "O Acolhimento da População Negra e o Cuidado Coletivo | Monique Machado | TEDxUnisinos Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:45.335142+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:23:43+00:00",
        "description": "O biólogo José Roberto Goldim defende que a prática em saúde deve resgatar o cuidado e o afeto, aliando a tecnologia e a ciência a uma alta sensibilidade, baseada na formação humanista que reconheça o paciente como uma pessoa com necessidades. Biólogo, doutor em Medicina e pós-doutor em Proteção de Dados em Pesquisa, pela Universidade de Zurique, dedica-se à bioética e aos impactos da tecnologia na saúde. Coordenador do Núcleo de Bioética Clínica no HCPA, professor titular da Escola de Medicina da PUCRS, também é escritor, unindo ciência e humanismo na inovação e no cuidado. Ele ainda atua como Consultor na área de Bioética Clinica. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4286377,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OxfWwMvncAQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OxfWwMvncAQ/hqdefault.jpg",
        "title": "Relação de confiança: Bioética e Cuidado | José Roberto Goldim | TEDxUnisinos Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:45.447385+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:23:20+00:00",
        "description": "¿Puede un artista convertirse en cóndor, puma y serpiente en un solo día? El ícono boliviano, Roberto Mamani Mamani, nos invita a sumergirnos en la Cosmovisión Andina, una filosofía de vida que lo transforma a diario y que él plasma en cada trazo. Mamani Mamani revela cómo sus orígenes en el comercio y su pasión por la fotografía lo llevaron a encontrar su voz y a entender que el color no es solo adorno, sino energía vital. Esta charla es una inmersión profunda en el significado de la reciprocidad (Ayni) y el \"Buen Vivir\", donde cada símbolo andino, desde el Alaxpacha hasta el Mankapacha, se conecta. Descubre por qué un arte bueno debe tener identidad, sentimiento y los colores de la vida para trascender, y cómo la sabiduría ancestral de su abuela lo guía a crear murales monumentales para ahuyentar a los malos espíritus y fortalecer el orgullo cultural de una nación. Artista Embajador de la Cultura y el Arte boliviano\nArtista Elite que transformó los colores andinos en un lenguaje uni",
        "id": 4286378,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=uQQj4pJE5G8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uQQj4pJE5G8/hqdefault.jpg",
        "title": "Cosmovisión andina, el arte una forma de vida | Roberto Mamani Mamani | TEDxUPDS Tarija",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:45.558520+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:23:07+00:00",
        "description": "Vivimos en la era de la hiperconexión digital, pero ¿estamos realmente presentes? Carla Tejerina, una voz influyente que ha documentado la historia boliviana por más de dos décadas, revela la crucial diferencia entre lazos virtuales y encuentros con significado. A través de una anécdota conmovedora sobre una entrevista que realizó a un importante comunicador y a su madre historiadora, Carla ilustra el momento exacto en que las palabras se transformaron en un recuerdo invaluable, demostrando que la conexión real es el legado más valioso. En esta charla, descubrirás cómo su labor periodística se convirtió en una plataforma para unir a las personas, especialmente a mujeres, para lograr objetivos comunes. Carla nos desafía a salir de la pantalla para redescubrir lo que nos une: nuestros sueños y el amor por nuestras familias. Es un llamado poderoso a estar presente y a construir relaciones que perduren más allá del scroll. Directora General de la Revista COSAS Bolivia, Presidenta de la Fu",
        "id": 4286379,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=a7__5fiJCeE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/a7__5fiJCeE/hqdefault.jpg",
        "title": "Conectar en tiempos desconectados | Carla Tejerina | TEDxUPDS Tarija",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:45.669381+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:22:37+00:00",
        "description": "Tivo e Lígia Lazevi apresentaram um repertório totalmente autoral e em formato intimista com vozes, violão e percussões, que incluiu músicas das carreiras individuais de cada um e canções compostas em conjunto pela dupla. Tivo é cantor, compositor, instrumentista e vocalista da banda Kabaluerê. Ele é bacharel em Música Popular (UFRGS) e lançou o seu álbum \"Pra Ontem e Amanhã\" em 2023. Lígia Lazevi é cantora e compositora da cena autoral de Porto Alegre. Também bacharel em Música Popular pela UFRGS, lançou seu disco \"Dois Sóis\" em 2022.\nDesde 2024, a dupla desenvolve um trabalho conjunto que já conta com o lançamento do single “Nosso Amor”, além da apresentação em eventos e festivais. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4286380,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TlaakHGEtAY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TlaakHGEtAY/hqdefault.jpg",
        "title": "Atração Cultural | Tivo & Lígia Lazevi | TEDxUnisinos Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:45.780010+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:21:38+00:00",
        "description": "¿Puede la excelencia técnica y una visión profundamente humana coexistir en el corazón de la industria farmacéutica? María Reneé Centellas, una de las mujeres líderes más influyentes del país, revela la estrategia que la llevó de analista de control de calidad a dirigir uno de los laboratorios más grandes del país. Su secreto: la sostenibilidad entendida como un compromiso personal con el bien. Centellas desafía la noción de la sostenibilidad como un simple concepto ambientalista y la redefine como la estrategia de negocio más rentable. Descubre cómo su brújula personal, basada en el empoderamiento femenino y el accountability, le ha permitido trazar una conexión vital entre la salud humana y la salud del planeta (ODS 3 y 15). Esta charla es una invitación poderosa a líderes y profesionales para liderar con coherencia, demostrando que el propósito personal es el motor más eficaz para impulsar la innovación, la resiliencia y la esperanza en cualquier entorno de incertidumbre. CEO y Dir",
        "id": 4286381,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cW9DVbaC3fY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cW9DVbaC3fY/hqdefault.jpg",
        "title": "Sostenibilidad en tiempos de incertidumbre | María Reneé Centellas Guevara | TEDxUPDS Tarija",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:45.883061+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:21:14+00:00",
        "description": "In her talk, “The Unknown Begins with Feedback,” Veronika explores how feedback can become a mirror that shows us not only who we are but also who we are capable of becoming. Veronika Khraneko is the founder of “Glavnoe Slovo,” a leading public-speaking project for entrepreneurs and executives. She is also an invited lecturer at the Higher School of Economics and the author of the book “Меньше слов. Как управлять диалогом и раскрыть любого собеседника,” published by Альпина PRO.\n\nVeronika combines deep expertise in communications with extensive experience in media, education, and business communities. She studied at SKOLKOVO Startup Academy, International Coaching Academy, the Academy of Moderation, MІTRO (Ostankino), and holds a degree in Romance Philology from Lomonosov Moscow State University.\n\nAt the core of her work is a mission to help people speak with clarity, confidence, and purpose — turning any dialogue into a space for influence, authenticity, and transformation. This talk",
        "id": 4286382,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PGN3_69MgS4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PGN3_69MgS4/hqdefault.jpg",
        "title": "The Unknown Begins with Feedback | Veronika Khraneko | TEDxNazarbayevUniversity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:46.021960+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:20:59+00:00",
        "description": "O geriatra e paliativista Lucas Ramos argumenta que a comunicação é uma ferramenta essencial no cuidado, oferecendo dignidade ao paciente, especialmente nos momentos críticos e no fim da vida. A comunicação constrói uma relação de confiança mútua. Médico geriatra, paliativista e professor, coordena o Núcleo de Cuidados Paliativos do Hospital São Lucas da PUCRS. Defensor da qualidade de vida, dedica-se a humanização do cuidado. Músico, une ciência e sensibilidade, mostrando como conhecimento e empatia transformam a experiência do fim da vida. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4286383,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cvz2Sv4q1_Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cvz2Sv4q1_Y/hqdefault.jpg",
        "title": "O Poder da Escuta na Relação Médico-Paciente | Lucas de Azambuja Ramos | TEDxUnisinos Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:46.159365+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:20:29+00:00",
        "description": "A nutricionista Irany Arteche, criadora do acrônimo PANC, compartilhou o uso de Plantas Alimentícias Não Convencionais e uma percepção crítica sobre a alimentação para promover saúde, biodiversidade e escolhas sustentáveis de baixo impacto. Nutricionista e mestre em Fitotecnia pela UFRGS, criou o acrônimo \"PANC\" - Plantas Alimentícias Não Convencionais. Coordenou o PNAE/RS, implementando Merenda Participativa e Agroecológica. Suas escolhas alimentares priorizam baixo impacto financeiro e ambiental, com alto valor nutricional. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4286384,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=up4gE4WLvQY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/up4gE4WLvQY/hqdefault.jpg",
        "title": "A alimentação, o corpo, a alma e o ambiente | Irany Arteche | TEDxUnisinos Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:46.305542+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:20:11+00:00",
        "description": "James explores how our understanding of truth depends on knowledge we cannot fully verify, which means we often rely on trust. His talk examines when we should trust our senses, our sources, and the claims we encounter, and when we should withhold that trust. He invites the audience to think more carefully about how truth is formed and how we decide what to believe. Jim is an Assistant Professor at Nazarbayev University.  His work mostly centers around the values and norms connected with truth, and the history of 19th and 20th century philosophy.  He grew up in Dundas, Ontario.  He did his undergraduate degree in philosophy at Wilfrid Laurier University and the University of Toronto.  He finished his Ph.D in 2018 at the University of California, Berkeley, with a dissertation about Gottlob Frege.  He has held visiting positions at the University of Indiana, Bloomington, Simon Fraser University, and the University of Toronto Mississauga. This talk was given at a TEDx event using the TED",
        "id": 4286385,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7aqnLsmOqrM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7aqnLsmOqrM/hqdefault.jpg",
        "title": "The Unknown  | James Hutchinson | TEDxNazarbayevUniversity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:46.409869+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:19:58+00:00",
        "description": "The climate crisis is here, and our students are ready to lead the charge. Schools need foundational climate education. This talk highlights the crucial role their support plays in combating misinformation and preparing future leaders, making educators feel their role is vital. We'll explore the barriers teachers face and introduce a powerful, grassroots solution: the Illinois Climate Education Hub. \n Mahima is a student at the Illinois Mathematics and Science Academy and a passionate youth environmental activist. She is an active member of It’s Our Future and serves on the Youth Climate Advisory Board for Climate Education in Illinois, where she played a key role in helping pass the state’s climate education bill. Beyond legislation, Mahima has organized climate strikes, worked on school sustainability policies, and coordinated Youth Climate Mixers with It’s Our Future. Through her work, she emphasizes the power of collective action and strives to bring together people from diverse b",
        "id": 4286386,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QdlbVLEGilM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QdlbVLEGilM/hqdefault.jpg",
        "title": "Classrooms to Climate Action | Mahima Krishnan | TEDxThe Avery Coonley School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:46.555744+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:19:40+00:00",
        "description": "Jean shares her story of resilience and catastrophic setbacks like losing a job, grieving a loved one, and ending a toxic relationship, which became the catalysts for self-discovery. Starting over is not a failure, but a powerful act of courage and self-trust. Your challenging moments can unexpectedly lead to your strongest beginnings. Jean Kang is a founder, instructor, and creator with 365,000+ followers across LinkedIn, Instagram, and her newsletter. A former program manager at LinkedIn, Pinterest, and Figma, Jean blends deep tech industry experience with a human-first approach to career storytelling and business building. Jean’s work has been featured in Forbes, Fast Company, CNBC, and more. She is known for making career growth radically transparent and helping high-achieving professionals make bold pivots without burning out. Her mission is to help people articulate their value, own their voice, and build careers and businesses they genuinely love. This talk was given at a TEDx ",
        "id": 4286387,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wFqVAAjwxvE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wFqVAAjwxvE/hqdefault.jpg",
        "title": "The Art of Starting Over | Jean Kang | TEDxThe Avery Coonley School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:46.709173+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:19:32+00:00",
        "description": "Everyone wants to be healthy, but globally chronic diseases like cancers, diabetes, obesity, allergies, mental disorders, and infertility are on the rise. And while healthy eating certainly can play a role in disease prevention, most people are unaware that plastic food packaging, processing equipment, kitchen utensils, and tableware leach hazardous chemicals into foodstuffs, contributing to chronic disease. In this TEDx talk, Jane Muncke explains the principle of chemical migration from plastic food contact materials and discusses the gaps in regulation that lead to harmful exposures to hazardous chemicals from everyday food packaging. A healthier option is the use of inert materials, such as glass and stainless steel. Dr. Jane Muncke is the Managing Director and Chief Scientific Officer of the Food Packaging Forum (FPF), a charitable foundation based in Zurich, Switzerland. She co-founded FPF in 2012 to share high-quality scientific information about health and environmental impacts",
        "id": 4286388,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6rFJSryhj_Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6rFJSryhj_Y/hqdefault.jpg",
        "title": "How Plastic Packaging Impacts Human Health | Dr. Jane Muncke | TEDxGreatPacificGarbagePatch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:46.863569+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:17:57+00:00",
        "description": "Veer examines the real impact of climate change and why our dependence on fossil fuels is a significant part of the problem. He explains how wind turbines offer a cleaner way to produce energy, but also why they fall short when the wind stops. Veer shares his ideas on the importance of making renewable energy more dependable.  Veer Patwardhan is a freshman at Lake Forest Academy who is a proud alumni of Avery Coonley. He is deeply passionate about sustainability and has helped plant trees and revive ponds. He did this through the help of Ramveer Tanwar, another Ted Talk speaker who runs a non-profit organization named “Say Earth.” More recently, Veer has been committed to developing a new type of wind turbine that could turn the tide in the fight against climate change. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4286389,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wtjAp4pjfPM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wtjAp4pjfPM/hqdefault.jpg",
        "title": "Wind Power Reimagined | Veer Patwardhan | TEDxThe Avery Coonley School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:26:46.973203+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:17:47+00:00",
        "description": "Vivek explores how an AI powered hydroponic garden makes growing plants simple, accessible, and fun for anyone. Vivek highlights how emerging technologies, such as AI, can make indoor gardening easier, environmentally friendly, and more sustainable.  Vivek is a lower school student at The Avery Coonley School in Downers Grove, IL.  In his free time, he enjoys visiting national parks and traveling the world. Vivek is also a 1st degree black belt student in taekwondo. From a young age, he enjoyed building with Legos which led to his interest in Lego robotics. As an active member of the FLL (FIRST LEGO League) robotics team, Vivek was invited to present at the 2024 FIRST World Championship in Houston. His team’s innovation project focused on sustainability, showcasing an AI-powered hydroponic garden built at school. Vivek shared how artificial intelligence can be used to optimize water and energy usage in hydroponic systems, while also encouraging healthy eating in schools. Passionate ab",
        "id": 4286390,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DAPmqjaZq2Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DAPmqjaZq2Q/hqdefault.jpg",
        "title": "Planting the future | Vivek Mody | TEDxThe Avery Coonley School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:16.420796+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:20:13+00:00",
        "description": "As AI continues to transform our world, the real competitive edge isn’t in learning to code; it’s in mastering relational intelligence: the ability to build trust, navigate complexity, and connect deeply with others.\n\nSarah reframes the AI narrative from one of replacement to collaboration, showing how relational intelligence will define who thrives with AI, not against it.\n\nShe showed why these human skills (trust-building, cultural awareness, and conflict resolution) are becoming the critical 21st-century differentiator, and she explains how you can gain an actionable framework through the 5 Signals of Relational Intelligence to create stronger human-AI partnerships.\n Sarah Stone McDevitt is a Dublin-based digital strategist and creative leader with 16 years’ experience across media, content, and web agencies before joining HubSpot. She also founded the charity Help Us Give Smiles, served 13 years in the Irish Reserve Army, and advocates for LGBTQ+ parental rights. This talk was giv",
        "id": 4285670,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=aKEWdKiwpNc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aKEWdKiwpNc/hqdefault.jpg",
        "title": "AI Transforms the World | Sarah McDevitt | TEDxDublin Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:16.691817+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:19:43+00:00",
        "description": "At TEDx, she shares her message that courage does not mean the absence of fear, but rather the ability to act despite it. Each of us has more strength than we think — and this courage can change not only our lives, but also the world around us. In times of uncertainty and change, we need our courage to stand up for ourselves and create our own future.\n\nLearn more at https://www.tedxvseuniversity.com/ \n Zuzana Mráčková works as a marketing and sales manager and also lectures on personal development, communication, and mindfulness. Zuzka is also a mother and a wonderful example of how, with mutual interest, it is possible to combine a managerial role with parenthood and further development. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4285671,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WdC1ahoZoyI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WdC1ahoZoyI/hqdefault.jpg",
        "title": "Conscious Courage  | Zuzana Mráčková | TEDxVSE University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:16.925207+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:19:09+00:00",
        "description": "At TEDx, she shows that the path to healthier public finances might also lie in something less obvious yet powerful — our own awareness and trust.\n\nLearn more at https://www.tedxvseuniversity.com/\n Jana Tepperová is an Associate Professor at the Prague University of Economics and Business, specializing in public finance. Her research focuses mainly on international taxation of individuals and corporations and the intersection of taxation and social security, exploring how these systems influence and shape each other. She is also involved in Code Club, a community that inspires children and young people to develop their programming and technical skills. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4285672,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3toc6YCGK7Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3toc6YCGK7Q/hqdefault.jpg",
        "title": "The Hidden Power of Beliefs in Taxes  | Jana Tepperová | TEDxVSE University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:17.091849+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:18:56+00:00",
        "description": "Learn more at https://www.tedxvseuniversity.com/ Mojmír Sabolovič is the Dean of the Faculty of Management in Jindřichův Hradec at the Prague University of Economics and Business. His academic background lies in management and economics, with a focus on business finance, valuation, and the internet economy. In addition to his academic work, he engages with practice through participation in professional bodies and expert activities. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4285673,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3jOej75n0vw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3jOej75n0vw/hqdefault.jpg",
        "title": "How AI is changing the student thesis | Mojmír Sabolovič | TEDxVSE University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:17.323510+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:18:41+00:00",
        "description": "Regenerative agriculture can restore biodiversity and create new livelihoods. Discover how living soils fuel agripreneurship and climate resilience | Regenerative agriculture is no longer a niche idea; it’s a global survival strategy. As biodiversity collapses and industrial farming drives up food insecurity, the quiet power of living soils offers a different path. Drawing from years of work in vulnerable communities, Steve Carver shows how sustainable farming and hyper-local seeds can spark new livelihoods, restore ecosystems, and unlock unexpected prosperity. His model turns “waste” into value, “ugly” vegetables into thriving markets, and informal settlements into hubs of agripreneurship. The insight is simple yet radical: when culture and agriculture heal together, communities grow resilient—and the planet does too |  As co-founder of U Can Grow Africa, Steve Carver champions regenerative farming practices that help communities adapt to climate shocks. By combining traditional know",
        "id": 4285674,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gd_23rzLs58",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gd_23rzLs58/hqdefault.jpg",
        "title": "The future of food is local, ugly, and profitable | Steve Carver | TEDxJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:17.560228+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:18:07+00:00",
        "description": "In his talk, “Rediscovering Learning Through Experience and Presence,” Dr. Paulo Mora-Avila explores how true learning happens not just through information, but through meaningful experiences and conscious presence. He challenges the traditional, content-heavy model of education and proposes a shift toward learning that is lived, felt, and practiced. Dr. Paulo highlights how today’s fast-paced, digital environment often disconnects students from genuine engagement. He argues that to truly understand, create, and grow, learners must reconnect with real-world interactions, emotional awareness, and active participation. Through powerful insights and practical reflections, his talk reveals how experiential learning can deepen understanding, enhance creativity, and build stronger human connections. He invites audiences to rethink what it means to “learn” suggesting that presence is not just a skill, but a transformative force that shapes how we perceive the world and ourselves. Connect wit",
        "id": 4285675,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8zxoSQL9Kvs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8zxoSQL9Kvs/hqdefault.jpg",
        "title": "Rediscovering Learning Through Experience and Presence | Dr Paulo Mora-Avila | TEDxDSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:17.775479+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:12:02+00:00",
        "description": "The experiential and narrative aspects of the arts can fundamentally shift how we act on the climate change crisis by transforming meaning, not just delivering facts | When the water crisis threatens the Cradle of Humankind in South Africa, one of Earth’s earliest homes of modern humans, facts alone wont shift our behaviour. Across the world, we already know the science, yet we fail to act. South African artist Johan Thom shows how the arts can change what water, soil, and survival actually mean to us. Drawing on personal history, Darwin’s ideas, and years of artistic experimentation, he reveals how beauty, choice, and imagination shape the core decisions that determine our collective future. While the sciences may diagnose the problem, the arts help us feel and experience our changing world in different ways, reminding us that meaning, not data, drives human action |  South African artist Johan Thom works across performance, video, and installation to probe the human condition in a c",
        "id": 4285676,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mm8Jp7nGv-Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mm8Jp7nGv-Q/hqdefault.jpg",
        "title": "Beauty and survival in a changing climate | Johan Thom | TEDxJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:18.016367+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:11:37+00:00",
        "description": "In this personal talk, Knarik Jalatyan, explores what it means to lose and rediscover a language, a homeland, and ultimately, a sense of self. From conversations with Icelandic linguists to the hundred words they have for “wind,” she reflects on what a language reveals about a people—and what it means when your own mother tongue begins to fade from everyday use. This talk is a powerful invitation to reimagine your mother tongue not as a burden, but as a treasure. Because sometimes, the most powerful homeland we have is our language.\n\n Knarik Jalatyan is an alumna of the American University of Armenia and an emerging political scientist dedicated to exploring Armenia’s evolving role in the global landscape. Her work centers on questions of identity, belonging, and national development. She currently works at the “Amrots” National Development Foundation, where she supports initiatives that empower young people from Armenia and the diaspora to reconnect with their Armenian heritage and c",
        "id": 4285677,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1xJE9Zj72pU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1xJE9Zj72pU/hqdefault.jpg",
        "title": "What Living in Iceland Taught Me About My Mother Tongue | Knarik Jalatyan | TEDxAUA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:18.153371+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:11:24+00:00",
        "description": "What if everything you thought you saw was only part of the truth? In this talk, Kiri Manookin explores how perception shapes reality, revealing how attention, assumptions and even color influence the way we understand the world. From a surprising encounter with a green mandarin to reflections on light, culture, and “hue-manity,” she challenges us to slow down, look again, and see beyond the surface. This talk is a powerful invitation to expand your vision and discover the beauty hidden in plain sight.\n\n Kiri Manookin, M.Ed. is an award-winning global educator and creative professional with a passion for human connection. She has lived in seven countries and worked with students from over sixty. which brings a deep intercultural understanding to her work. Central to her approach is a strong belief in the beauty and complexity of the human experience. Kiri blends her love for storytelling with a reflective presence, drawing on her background in education, writing, and creative explorat",
        "id": 4285678,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2Q5PfG6z7ZA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2Q5PfG6z7ZA/hqdefault.jpg",
        "title": "‘Hue-manity’: What Light Teaches Us About Each Other | Kiri Manookin | TEDxAUA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:18.345848+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:11:00+00:00",
        "description": "What happens when you challenge every theory — even the one written in your medical report? Nela explores how our beliefs — whether they come from doctors, society, or ourselves — can shape or shatter our potential, and how she took her biggest limitation to the market — and built a movement Against All Odds.\n\nLearn more at https://www.tedxvseuniversity.com/ \n Nela Ďopanová was born with a condition that, according to doctors, should have kept her from ever walking. But she found her own path – and today she not only stands on her feet but also leads Fpohybu, a company that helps over 80 organizations in the Czech Republic and abroad build healthier corporate cultures. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4285679,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=q1CdyTP6gh0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/q1CdyTP6gh0/hqdefault.jpg",
        "title": "Against All Odds  | Nela Ďopanová | TEDxVSE University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:18.532282+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:10:30+00:00",
        "description": "At TEDx, he reveals why education without emotions misses its purpose — and how teaching can become an experience rather than just information delivery.\n\nLearn more at https://www.tedxvseuniversity.com/ \n Ota Novotný is the Vice-Rector of VŠE for Development and Corporate Relations and a key figure in Czech academia in the field of data analytics and innovation. He has long been dedicated to modernizing education and connecting universities with business – he co-founded the xPORT Business Accelerator and leads the MBA program Data and Analytics for Business Management. Throughout his career, he has combined academic work with practical projects, from research grants to cooperation with startups and companies. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4285680,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pnidqO-JB0k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pnidqO-JB0k/hqdefault.jpg",
        "title": "The Hidden Engine of Learning  | Ota Novotný | TEDxVSE University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:18.659595+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:10:22+00:00",
        "description": "At TEDx he explores how global interconnectedness between economics, politics, and technology shapes our everyday lives and attitudes – and why understanding these connections is essential in a time of tension, uncertainty, and technological change.\n\nLearn more at https://www.tedxvseuniversity.com/ \n Pavel Hnát is an Associate Professor at the Faculty of International Relations at VŠE, where he focuses on globalization, European economic integration, and international political economy. He currently serves as a Vice-Rectior for Education and Quality Assurance and previously also served as Vice-Dean for Education at the Faculty of International Relations. He has taught at universities in the USA and Austria, authored numerous publications, and regularly comments on international economic affairs in the media. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4285681,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0vJ_ErmdeqQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0vJ_ErmdeqQ/hqdefault.jpg",
        "title": "Understanding the Complex World without Fear  | Pavel Hnát | TEDxVSE University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:18.810917+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:10:07+00:00",
        "description": "At TEDx, Oldřich speaks openly about the fear of failure – why it’s okay to be afraid, yet still pursue your dreams. He shares how data, systems, and people’s support help him manage risks and turn fears into strength. His story is an invitation for everyone who hesitates to take a step into the unknown.\n\nLearn more at https://www.tedxvseuniversity.com/\n Oldřich Valta left the security of banking and consulting, where he spent more than ten years at home and abroad, to fulfill his dream of co-building The Miners coffee chain. Today, the company runs 25 coffee shops in 7 countries, its own roastery, bakery, and is aiming to make the brand a leader in the specialty coffee market. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4285682,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=N6-eTJfjgCc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/N6-eTJfjgCc/hqdefault.jpg",
        "title": "How to Build a Coffee Empire and not Go Crazy  | Oldřich Valta | TEDxVSE University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:18.951894+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:09:37+00:00",
        "description": "At TEDx, he demonstrates how individuals self-select into environments that align with their traits, preferences, and goals. Drawing on experience from various roles in academia and the public sector, he brings a perspective that connects theory with everyday life. \n\nLearn more at https://www.tedxvseuniversity.com/ \n Marek Hudík is an expert in institutional economics, decision-making, and the application of economic principles in practice. He studies how changes in the environment shape behavior and what the consequences are for communities and society as a whole. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4285683,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=4y0b2f2tdr4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4y0b2f2tdr4/hqdefault.jpg",
        "title": "The Power of Self-Selection  | Marek Hudík | TEDxVSE University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:22:19.140174+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:09:29+00:00",
        "description": "At TEDx, she peels back the layers of our emergency decision-making — revealing what really happens when seconds matter and our minds play tricks on us. Using real data, she shows how education shapes both our willingness to take risks and the way we think about risky situations. Join her to challenge the illusion that we are all natural experts in emergencies who don’t need any training at all.\n\nLearn more at https://www.tedxvseuniversity.com/ \n Jana Abíková works at the Faculty of Business Administration at VŠE, specializing in disaster management and humanitarian logistics – fields that combine science, practice, and the ability to respond quickly in crises. She has gained experience not only in academia, for example at the HUMLOG Institute in Finland, but also by working directly with non-governmental organisations such as People in Need and Doctors Without Borders. This talk was given at a TEDx event using the TED conference format but independently organized by a local community",
        "id": 4285684,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8B__pw52CQY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8B__pw52CQY/hqdefault.jpg",
        "title": "Training: Because ‘I’ll figure it out’ isn’t a plan  | Jana Abíková | TEDxVSE University",
        "vote": 0
    }
]