[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:17:13.590941+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:01:18+00:00",
        "description": "It's a great time to be a gamer with a whole year of great titles behind us, and a very promising bunch on the way. However, a few of our most wanted games have us worried whether they are truly going to be a part of our lives over the next year or so. \n\nThe Game Awards is an event that can put those worries to rest, and we've got quite a few titles we want to hear more about. To that end, we've put together a list of our most wanted titles with the hope that they make their way to the event. Join us and find out our picks for what we would like to see at one of modern gaming's most prolific events.\n\nNote that this is our follow up to our previous The Game Awards video we did last week which was focused on rumored and confirmed games. You can watch that video here: https://www.youtube.com/watch?v=aYE5E8Yu3-w",
        "id": 4286350,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=htA571yaJQk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/htA571yaJQk/hqdefault.jpg",
        "title": "The Game Awards 2025 - 15 Nearly Impossible Game Reveals That Would Have Us Screaming",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T13:59:22.489620+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T13:30:26+00:00",
        "description": "Ferocious is a “survival shooter” that throws you on an island that has seemingly been forgotten by time. In your attempts to find your brother and get out, you not only discover that dinosaurs still survived here somehow, but also that there are plenty of human enemies as well. \n\nArmed with your favourite pistol and shotgun, it is now up to you to save your brother and take on an ever-expanding selection of foes. While the premise is bare-bones, Ferocious doesn’t really need much in the way of plot because of how fun the game can often be. \n\nFights often feel fantastic, especially when you’re taking on humans. However, the dinosaurs tend to lose their novelty thanks to the fact that there isn’t much going on in their attack patterns which can simply be side-stepped. This, along with a host of other smaller issues mean that Ferocious still needed a little bit more development time to get some extra polish in.",
        "id": 4284472,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=INp2jz-GXcQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/INp2jz-GXcQ/hqdefault.jpg",
        "title": "Ferocious Review - Finally, The Dinosaur Game We've Been Waiting For?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T10:33:51.626115+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T10:01:03+00:00",
        "description": "Fusing retro style with diverse gameplay and modern fluidity, NO FATE’s blast from the past proves the future is not set. Where legendary blockbuster Terminator 2: Judgment Day pulls cybernetic killing machines from the future, Terminator 2D: NO FATE’s arcade-action plants its clothes, boots, and motorcycle firmly out of the 90s and onto modern hardware. \n\nThrough meticulously crafted pixel art showcasing T2’s grit, its pulse-racing storyline, and explosive setpieces, NO FATE is as aesthetically bold as it is an unashamed homage. So, grab your shotgun out of a box of roses, here’s 15 things you need to know before pulling the trigger.",
        "id": 4283038,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=YTFJL8PuMns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YTFJL8PuMns/hqdefault.jpg",
        "title": "Terminator 2D: NO FATE - 15 Things You Need To Know Before You Buy",
        "vote": 0
    }
]