[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T23:19:26.888272+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T22:50:00+00:00",
        "description": "Qualcomm has acquired RISC-V startup Ventana to strengthen its CPU ambitions beyond mobile, \"reinforcing its commitment and leadership in the development of the RISC-V standard and ecosystem,\" the company said in a press release. CRN Magazine reports: The San Diego-based company said Ventana's expertise in RISC-V, a free and open alternative to the Arm and x86 instruction set architectures, will enhance its CPU engineering capabilities and complement \"existing efforts to develop custom Oryon CPU technology.\" Financial terms of the deal were not disclosed.\n \nQualcomm, which has already been using RISC-V for some products outside the PC and server markets, said Ventana's contributions will boost its \"technology leadership in the AI era across all businesses,\" indicating the broad impact expected by this acquisition. \"We believe the RISC-V instruction set architecture has the potential to advance the frontier on CPU technology, enabling innovation across products,\" Durga Malladi, executi",
        "id": 4289267,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/10/2135233/qualcomm-acquires-risc-v-chip-designer-ventana-micro-systems",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Qualcomm Acquires RISC-V Chip Designer Ventana Micro Systems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T23:19:27.092875+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T22:20:00+00:00",
        "description": "Longtime Slashdot reader MadCow42 writes: Canonical just announced that they're packaging AMD's ROCm libraries (for AIML and HPC with both data-center GPUs as well as desktop/laptop GPUs), directly into the Ubuntu Universe archive. You can run ROCm on Ubuntu today but you have to install it via a script from AMD and manually remove and reinstall for any upgrades or bug fixes. Having it in Ubuntu as a normal Debian package will make it much easier to install and also to maintain in the long run via normal apt tooling ('apt upgrade'). This also means that ROCm can be an automatically-installed dependency for other packages, which doesn't happen today.\n \nAnd, interestingly, Canonical has committed to providing long-term-support for ROCm in Ubuntu -- which is particularly exciting for edge and IoT devices that may have a long life in the field and need regular security patches and updates.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter",
        "id": 4289268,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/10/2122240/ubuntu-will-have-native-amd-rocm-aiml-and-hpc-libraries-in-next-lts-release",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ubuntu Will Have Native AMD ROCm AI/ML and HPC Libraries In Next LTS Release",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T22:15:10.871331+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T21:50:00+00:00",
        "description": "Adobe is integrating Photoshop, Express, and Acrobat directly into ChatGPT so users can edit photos, design graphics, and tweak PDFs through the chatbot. The Verge reports: The Adobe apps are free to use, and can be activated by typing the name of the app alongside an uploaded file and conversational instruction, such as \"Adobe Photoshop, help me blur the background of this image.\" ChatGPT users won't have to specify the name of the app again during the same conversation to make additional changes. Depending on the instructions, Adobe's apps may offer a selection of results to choose from, or provide a UI element that the user can manually control -- such as Photoshop sliders for adjusting contrast and brightness.\n \nThe ChatGPT apps don't provide the full functionality of Adobe's desktop software. Adobe says the Photoshop app can edit specific sections of images, apply creative effects, and adjust image settings like brightness, contrast and exposure. Acrobat in ChatGPT can edit exist",
        "id": 4288817,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/10/2117208/adobe-integrates-with-chatgpt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Adobe Integrates With ChatGPT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T22:15:11.086098+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T21:13:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Monday, research analyst MoffettNathanson released its \"Cord-Cutting Monitor Q3 2025: Signs of Life?\" report. It found that the pay TV operators, including cable companies, satellite companies, and virtual multichannel video programming distributors (vMVPDs) like YouTube TV and Fubo, added 303,000 net subscribers in Q3 2025. According to the report, \"There are more linear video subscribers now than there were three months ago. That's the first time we've been able to say that since 2017.\"\n \nIn Q3 2017, MoffettNathanson reported that pay TV gained 318,000 net new subscribers. But since then, the industry's subscriber count has been declining, with 1,045,000 customers in Q2 2025, as depicted in the graph [here]. The world's largest vMVPD by subscriber count, YouTube TV, claimed 8 million subscribers in February 2024; some analysts estimate that number is now at 9.4 million. In its report, MoffettNathanson estimated that YouTube T",
        "id": 4288818,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/10/2111244/cable-channel-subscribers-grew-for-the-first-time-in-8-years-last-quarter",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cable Channel Subscribers Grew For the First Time In 8 Years Last Quarter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T19:58:09.906973+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T18:45:00+00:00",
        "description": "Wells Fargo expects more job cuts and higher severance costs in this quarter that ends in three weeks, bank CEO and President Charlie Scharf said Tuesday at an investors conference in New York. He's also betting on AI to drive efficiency and, eventually, further workforce reduction.From a report: \"As we've gone through the budgeting process, and even pre AI, we do expect to have less people as we go into next year,\" Scharf said at the Goldman Sachs Financial Services Conference in New York City. \n\n\"We'll likely have more severance in the fourth quarter.\" The fourth quarter runs Oct. 1 through Dec. 31 for the San Francisco-basaed bank. Wells Fargo already has shrunk from 275,000 employees to about 210,000 since Scharf joined the bank in 2019 -- about a 24% decrease. Its largest employee base remains in Charlotte, with about 27,000 workers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wells+Fargo+CEO+Says+More+Job+C",
        "id": 4287796,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/10/1840244/wells-fargo-ceo-says-more-job-cuts-coming-at-the-bank-as-ai-prompts-efficiency",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wells Fargo CEO Says More Job Cuts Coming at the Bank as AI Prompts 'Efficiency'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T18:48:35.797939+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T18:09:00+00:00",
        "description": "As the battle over Warner Bros. Discovery grows, two Democratic lawmakers are warning that their party may try to block or unravel any\nacquisition by Paramount when it returns to power. Semafor: In a letter to the WBD board and Treasury Secretary Scott Bessent first shared with Semafor, Reps. Sam Liccardo (D-Calif.) and Ayanna Pressley (D-Mass.) said they were concerned about the national security risk of letting foreign entities control a large portion of the US entertainment and media industry. \n\nThey also hinted that a future Democratic Congress and administration could try to unravel any Paramount-WBD deal. \"Future Congresses ... will review many of the decisions of the current Administration, and may recommend that regulators push for divestitures, which would undermine the strategic logic of this merger,\" they wrote. \"We urge the Board to weigh these national security and regulatory liabilities in evaluating a transaction burdened by uncertain but potentially extensive mitigatio",
        "id": 4287264,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/12/10/189220/democrats-warn-their-party-may-try-to-unravel-any-paramount-warner-bros-discovery-deal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Democrats Warn Their Party May Try To Unravel Any Paramount-Warner Bros. Discovery Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:45:43.013474+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T17:33:00+00:00",
        "description": "Amazon says it will allow authors to offer their DRM-free ebooks in the EPUB and PDF formats through its self-publishing platform, Kindle Direct Publishing. Starting on January 20, 2026, authors who set their titles as DRM-free will see their books made available in these more open formats. From a report: The decision to use Digital Rights Management (DRM), a copyright protection mechanism, is set by the authors when they publish their ebooks on Amazon's platform. The company notes these changes won't impact previously published titles. If authors want to change the status of older titles, they'll have to log into the Kindle Direct Publishing (KDP) author portal and change an option in the settings. (Instructions on how to make that change are on Amazon's KDP support site here.) This move may actually incentivize authors to apply DRM to their ebooks.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Changes+How+",
        "id": 4286660,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/10/1735239/amazon-changes-how-copyright-protection-is-applied-to-kindle-directs-self-published-ebooks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Changes How Copyright Protection is Applied To Kindle Direct's Self-Published Ebooks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T17:45:43.204078+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:51:00+00:00",
        "description": "New submitter emangwiro shares a report: The HDMI Forum, responsible for the HDMI specification, continues to stonewall open source. Valve's Steam Machine theoretically supports HDMI 2.1, but the mini-PC is software-limited to HDMI 2.0. As a result, more than 60 frames per second at 4K resolution are only possible with limitations. In a statement to Ars Technica, a Valve spokesperson confirmed that HDMI 2.1 support is \"still a work-in-progress on the software side.\" \"We've been working on trying to unblock things there.\" \n\nThe Steam Machine uses an AMD Ryzen APU with a Radeon graphics unit. Valve strictly adheres to open-source drivers, but the HDMI Forum is unwilling to disclose the 2.1 specification. According to Valve, they have validated the HDMI 2.1 hardware under Windows to ensure basic functionality.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=HDMI+Forum+Continues+To+Block+HDMI+2.1+For+Linux%2C+Valve+Says%",
        "id": 4286661,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/10/1652206/hdmi-forum-continues-to-block-hdmi-21-for-linux-valve-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "HDMI Forum Continues To Block HDMI 2.1 For Linux, Valve Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T16:40:48.198924+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T16:05:00+00:00",
        "description": "Meta's newly recruited AI \"superstars\" have developed an us-versus-them mentality against the company's longtime executive leadership, creating internal friction over whether the team should focus on catching up to rivals like OpenAI and Google or improving Meta's core advertising and social media businesses. Alexandr Wang, the 28-year-old entrepreneur Mark Zuckerberg hired in June to be chief AI officer, leads a team called TBD Lab from a siloed space next to Zuckerberg's office. In meetings this fall, Wang privately told people he disagreed with chief product officer Chris Cox and chief technology officer Andrew Bosworth, according to the New York Times. \n\nCox and Bosworth wanted Wang's team to use Instagram and Facebook data to train Meta's new foundational AI model for improving feeds and advertising. Wang pushed back, arguing the goal should be catching up to rival models before focusing on products. TBD Lab researchers view many Meta executives as interested only in the social m",
        "id": 4286045,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/10/1528222/metas-new-ai-superstars-are-chafing-against-the-rest-of-the-company",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta's New AI Superstars Are Chafing Against the Rest of the Company",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T15:32:58.614251+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T15:25:00+00:00",
        "description": "A study this week has found that shoppers using Instacart are often charged different prices for identical products at the same store at the same time, even when selecting in-store pickup rather than delivery. The Groundwork Collaborative, a progressive policy group, and Consumer Reports organized nearly 200 volunteers across four cities to simultaneously check prices on 20 grocery items. Price differences appeared on nearly three-quarters of the items tested. In one test, more than 40 participants selected the same Safeway in Washington, D.C. and the same brand of eggs. Prices ranged from $3.99 to $4.79 -- a 20% spread. At a Target in North Canton, Ohio, Skippy peanut butter was $2.99 for some shoppers and $3.59 for others. The full 20-item basket varied by about 7% within each store. \n\nAn Instacart spokeswoman said retailers on its platform set their own prices and that some run short-term, randomized pricing tests. The company said tests were \"never based on personal or behavioral ",
        "id": 4285375,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/10/1513248/same-product-same-store-but-on-instacart-prices-might-differ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Same Product, Same Store, but on Instacart, Prices Might Differ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T15:32:58.712652+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T14:48:00+00:00",
        "description": "Nvidia has developed location verification technology that could determine which country its AI chips are operating in, Reuters reports, citing a source, a capability that may help address ongoing concerns about the smuggling of advanced semiconductors to restricted markets like China. The feature, which Nvidia has demonstrated privately in recent months but has not released, would be an optional software tool that customers install. It taps into the confidential computing capabilities of Nvidia's GPUs and uses the time delay in communicating with Nvidia-run servers to approximate a chip's location. \n\nThe technology will first be available on Nvidia's newest Blackwell chips, though the company is examining options for its older Hopper and Ampere generations. U.S. lawmakers and the White House have pushed for location verification measures as the Department of Justice has brought criminal cases against smuggling rings allegedly attempting to move more than $160 million worth of Nvidia ",
        "id": 4285376,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/10/1448224/nvidia-builds-location-verification-tech-that-could-track-where-its-ai-chips-end-up",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia Builds Location Verification Tech That Could Track Where Its AI Chips End Up",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T14:27:43.463391+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T14:00:00+00:00",
        "description": "McDonald's has pulled an AI-generated Christmas commercial from YouTube after viewers pushed back on what they called a distasteful, \"AI slop\"-filled take on the holidays. The 45-second ad, titled \"It's the most terrible time of the year,\" was a satirical look at holiday chaos -- people tripping while carrying overloaded gift bags, getting tangled in lights, burning homemade cookies, starting kitchen fires -- and ended with a suggestion to ditch the madness and hide out at McDonald's until January. \n\nThe ad was created for McDonald's Netherlands by agency TBWA\\NEBOKO and production company Sweetshop, whose Los Angeles-based directing duo Mark Potoka and Matt Spicer shot the film. After the backlash, Sweetshop said it used AI as a tool but emphasized human effort in shaping the final product. \"We generated what felt like dailies -- thousands of takes -- then shaped them in the edit just as we would on any high-craft production,\" the company said. \"This wasn't an AI trick. It was a film",
        "id": 4284744,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/10/137237/ai-slop-ad-backfires-for-mcdonalds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Slop Ad Backfires For McDonald's",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T13:23:42.774079+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: U.S. Secretary of State Marco Rubio on Tuesday ordered diplomats to return to using Times New Roman font in official communications, calling his predecessor Antony Blinken's decision to adopt Calibri a \"wasteful\" diversity move, according to an internal department cable seen by Reuters. The department under Blinken in early January 2023 had switched to Calibri, a modern sans-serif font, saying this was a more accessible font for people with disabilities because it did not have the decorative angular features and was the default in Microsoft products.\n \nA cable dated December 9 sent to all U.S. diplomatic posts said that typography shapes the professionalism of an official document and Calibri is informal compared to serif typefaces.\n\"To restore decorum and professionalism to the Department's written work products and abolish yet another wasteful DEIA program, the Department is returning to Times New Roman as its standard typeface,\" the",
        "id": 4284247,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/10/0059236/rubio-orders-diplomats-to-return-to-using-times-new-roman-font",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rubio Orders Diplomats To Return To Using Times New Roman Font",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T11:03:44.157436+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T10:00:00+00:00",
        "description": "alternative_right quotes a report from Phys.org: To teach robots how to become tomato pickers, Osaka Metropolitan University Assistant Professor Takuya Fujinaga, Graduate School of Engineering, programmed them to evaluate the ease of harvesting for each tomato before attempting to pick it. Fujinaga's new model uses image recognition paired with statistical analysis to evaluate the optimal approach direction for each fruit. The system involves image processing/vision of the fruit, its stems, and whether it is concealed behind another part of the plant. These factors inform robot control decisions and help it choose the best approach.\n \nThe model represents a shift in focus from the traditional 'detection/recognition' model to what Fujinaga calls a 'harvest-ease estimation.' \"This moves beyond simply asking 'can a robot pick a tomato?' to thinking about 'how likely is a successful pick?', which is more meaningful for real-world farming,\" he explained. When tested, Fujinaga's new model d",
        "id": 4283207,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/09/2323241/robocrop-teaching-robots-how-to-pick-tomatoes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "RoboCrop: Teaching Robots How To Pick Tomatoes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T07:57:47.754487+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T07:00:00+00:00",
        "description": "A major scientific report published Tuesday argues that sending astronauts to Mars is justified by the quest to find life and conduct research that robots alone can't achieve. \"We're searching for life on Mars,\" said Dava Newman, a professor in the Department of Aeronautics and Astronautics at Massachusetts Institute of Technology and co-chair of the committee that wrote the report. \"The answer to the question 'are we alone' is always going to be 'maybe,' unless it becomes yes.\" Ars Technica reports: The report, two years in the making and encompassing more than 200 pages, was published by the National Academies of Sciences, Engineering, and Medicine. Essentially, the committee co-chaired by Newman and Linda T. Elkins-Tanton, director of the University of California, Berkeley Space Sciences Laboratory, was asked to identify the highest-priority science objectives for the first human missions to Mars. [...] \"There's no turning back,\" Newman said. \"Everyone is inspired by this because i",
        "id": 4282301,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/09/2318208/in-a-major-new-report-scientists-build-rationale-for-sending-astronauts-to-mars",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "In a Major New Report, Scientists Build Rationale For Sending Astronauts To Mars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T03:53:08.402760+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: The unsustainable production of food and fossil fuels causes $5 billion of environmental damage per hour, according to a major UN report. Ending this harm was a key part of the global transformation of governance, economics and finance required \"before collapse becomes inevitable,\" the experts said. The Global Environment Outlook (GEO) report, which is produced by 200 researchers for the UN Environment Program, said the climate crisis, destruction of nature and pollution could no longer be seen as simply environmental crises. \"They are all undermining our economy, food security, water security, human health and they are also [national] security issues, leading to conflict in many parts of the world,\" said Prof Robert Watson, the co-chair of the assessment. [...]\n \nThe GEO report is comprehensive -- 1,100 pages this year -- and is usually accompanied by a summary for policymakers, which is agreed by all the world's countries. Howev",
        "id": 4281297,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/09/2311256/food-and-fossil-fuel-production-causing-5-billion-of-environmental-damage-an-hour",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Food and Fossil Fuel Production Causing $5 Billion of Environmental Damage an Hour'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T02:51:42.351525+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T02:02:00+00:00",
        "description": "OpenAI, alongside Anthropic and Block, have launched the Agentic AI Foundation under the Linux Foundation, describing it as a neutral home for standards as agentic systems move into real production. It may sound well-meaning, but Slashdot reader and NERDS.xyz founder BrianFagioli isn't buying the narrative. In a report for NERDS.xyz, Fagioli writes: Instead of opening models, training data, or anything that would meaningfully shift power toward the community, the companies involved are donating lightweight artifacts like AGENTS.md, MCP, and goose. They're useful, but they're also the safest, least threatening pieces of their ecosystem to \"open.\" From where I sit, it looks like a strategic attempt to lock in influence over emerging standards before truly open projects get a chance to define the space. I see the entire move as smoke and mirrors.\n \nWith regulators paying closer attention and developer trust slipping, creating a Linux Foundation directed fund gives these companies conveni",
        "id": 4280991,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/09/2255209/openai-joins-the-linux-foundations-new-agentic-ai-foundation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Joins the Linux Foundation's New Agentic AI Foundation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T01:51:18.763266+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T01:25:00+00:00",
        "description": "Netflix's $72 billion bid to buy Warner Bros Discovery has triggered a consumer class action claiming the merger would crush competition, erase HBO Max as a rival, and hand Netflix control over major franchises. Reuters reports: The proposed class action (PDF) was filed on Monday by a subscriber to Warner Bros-owned HBO Max who said the proposed deal threatened to reduce competition in the U.S. subscription video-on-demand market. \"Netflix has demonstrated repeated willingness to raise subscription prices even while facing competition from full-scale rivals such as WBD,\" the lawsuit said. [...] The lawsuit said the Warner Bros deal would eliminate one of Netflix's closest rivals, HBO Max, and give Netflix control over Warner Bros marquee franchises including Harry Potter, DC Comics and Game of Thrones. On Monday, Paramount Skydance launched a $108 billion hostile bid to buy Warner Bros. Discovery with an all-cash, $30-per-share offer.<p><div class=\"share_submission\" style=\"position:re",
        "id": 4280736,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/09/2243222/netflix-faces-consumer-class-action-over-72-billion-warner-bros-deal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Netflix Faces Consumer Class Action Over $72 Billion Warner Bros Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T01:51:18.853864+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T00:45:00+00:00",
        "description": "Longtime Slashdot reader Randseed writes: With the likes of Google Nest, Ring, and others cooperating with law enforcement, I started to look for affordable wireless IP security cameras that I can put around my house. Unfortunately, it looks like almost every thing now incorporates some kind of cloud-based slop. All I really want is to put up some cameras, hook them up to my LAN, and install something like ZoneMinder. What are the most economical, wireless IP security cameras that I can set up with my server?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ask+Slashdot%3A+What+Are+the+Best+Locally-Hosted+Wireless+Security+Cameras%3F%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F12%2F09%2F2235240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F12",
        "id": 4280737,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/09/2235240/ask-slashdot-what-are-the-best-locally-hosted-wireless-security-cameras",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ask Slashdot: What Are the Best Locally-Hosted Wireless Security Cameras?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-10T00:48:45.683541+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-10T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Fast Company: More and more people are turning to GoFundMe for help covering the cost of housing, food, and other basic needs. The for-profit crowdfunding platform's annual \"Year in Help\" report, released Tuesday, underscored ongoing concerns around affordability. The number of fundraisers started to help cover essential expenses such as rent, utilities, and groceries jumped 20%, according to the company's 2025 review, after already quadrupling last year. \"Monthly bills\" were the second fastest-growing category behind individual support for nonprofits.\n \nThe number of \"essentials\" fundraisers has increased over the last three years in all of the company's major English-speaking markets, according to GoFundMe CEO Tim Cadogan. That includes the United States, Canada, United Kingdom and Australia. In the United States, the self-published report comes at the end of a year that has seen weakened wage growth for lower-income workers, sluggish hiring,",
        "id": 4280400,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/09/2130256/more-people-crowdfunded-basic-needs-in-2025-gofundme-report-shows",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More People Crowdfunded Basic Needs In 2025, GoFundMe Report Shows",
        "vote": 0
    }
]