[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-20T17:00:56+00:00",
        "description": "It's no secret that Sims fans have craved an alternative. After all, as a franchise becomes little more than a cash cow without any hope for revolutionary new features, the desire for competition grows. inZOI, published by Krafton, may just be what they're looking for, though it's a bit too early to say for sure.\n\nAvailable on March 28th for Steam Early Access, the social sim involves creating your own ZOI or three, moving into a property together, and trying to make things work. You can take on a job or get an education, interact with the dozens of other ZOIs who live their lives independently, and much more. There's even an in-depth toolset for customizing your home and editing the city.\n\nThe visual fidelity and sheer sense of freedom belie the average amount of content and the need for more optimization. Nevertheless, inZOI has something special, and we're intrigued to see how it grows through early access.",
        "id": 2369311,
        "language": null,
        "link": "https://www.youtube.com/watch?v=pax0d9qnBMA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pax0d9qnBMA/hqdefault.jpg",
        "title": "inZOI Is Here, And It's Pretty Good",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-20T13:30:32+00:00",
        "description": "Calling Rebellion’s upcoming sci-fi survival game Atomfall as Fallout set in England – as it’s been commonly nicknamed – doesn’t paint a complete picture of what’s awaiting players stepping into the game’s verdant yet irradiated version of glorious British countryside. \n\nThere’re numerous reasons why Atomfall distinguishes itself, and it’s these distinctions which elevate it to an inevitable sleeper hit if not one of the biggest games of 2025. That setting – Northern England’s Cumbria and Lake District nestled within – is a primary reason, but this feature will also discuss exploration, its survival mechanics, NPC interaction, and its combat, all to illustrate this game as more than a Fallout or Stalker clone but something more indebted to speculative mid-century fiction with heaps of fun thrown on top.",
        "id": 2367538,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cIgJaGX84BA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cIgJaGX84BA/hqdefault.jpg",
        "title": "5 BIG Reasons Why You Are ABSOLUTELY NOT READY For Atomfall",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-20T09:30:02+00:00",
        "description": "For the first time in an Assassin’s Creed game, Shadows pus both of its protagonists on more or less equal footing, and though both are very different from each other in terms of their gameplay style, they are both also incredibly fun to play as. \n\nAssassin’s Creed Shadows’ stealth flourishes when you’re playing as Naoe, and combat shines when Yasuke takes the reigns, but no matter which of the two you are playing as, for one reason or another, you are guaranteed to be having an absolute blast. Here, we talk about how Assassin’s Creed Shadows uses its two charismatic leads to highlights its core strengths.",
        "id": 2365555,
        "language": null,
        "link": "https://www.youtube.com/watch?v=1c1xJq3J6CI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1c1xJq3J6CI/hqdefault.jpg",
        "title": "Why Assassin's Creed Shadows Is A COMPLETE BLAST",
        "vote": 0
    }
]