[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T14:27:18.101834+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T14:00:55+00:00",
        "description": "Sony’s PlayStation is synonymous with industry-dominating single-player adventures, so it’s with good reason we’re focusing this video on the PlayStation’s current-generation console’s selection of amazing RPG games. \n\nThey’re not always exclusively single player, of course, but arguably the genre works best as a solo endeavor. Role-playing games cover a broad spectrum of styles and experiences too, given that the hallmarks of the genre are so widespread. \n\nOn this rundown, we champion games that are narrative heavy, often with choice-led outcomes, that harbor engaging combat, offer extensive character progression via upgradeable skills, attributes, and capabilities, plus feature enveloping quests which foster discovery through fantastical worlds. \n\nThe opportunities to assume the role of a character in-game have never been greater, especially on PS5.",
        "id": 2540036,
        "language": null,
        "link": "https://www.youtube.com/watch?v=iWS7ez6NDjs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iWS7ez6NDjs/hqdefault.jpg",
        "title": "15 Amazing PS5 Role Playing Games (RPGs) You Need To Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T10:07:33.114034+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T09:30:14+00:00",
        "description": "We won't have to wait long to play Blades of Fire since it's out on May 22nd for Xbox Series X/S, PS5, and PC. Unfolding in a fantasy world, players control Aran de Lira, the only person capable of wielding a hammer to forge steel weapons. He'll need it in his quest against Queen Lerea. \n\nJoined by Adso, Aran ventures across the land, battling Lerea's forces and other terrifying creatures. The hack-and-slash combat, combined with locational damage and interconnected levels, is already enticing. However, the real hook is the blacksmithing as players collect materials, create their own weapons, and take them into battle. Let's outline everything else you should know about Blades of Fire before playing.",
        "id": 2538803,
        "language": null,
        "link": "https://www.youtube.com/watch?v=C8_u8kxLtGA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/C8_u8kxLtGA/hqdefault.jpg",
        "title": "Blades of Fire - 15 Things You NEED To Know Before You Buy",
        "vote": 0
    }
]