[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T22:17:19.615953+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T22:17:19+00:00",
        "description": "An anonymous reader shared this report from Reuters:\n\n\nThe secretive Russian satellite in space that U.S. officials believe is connected to a nuclear anti-satellite weapon program has appeared to be spinning uncontrollably, suggesting it may no longer be functioning in what could be a setback for Moscow's space weapon efforts, according to U.S. analysts... [The Cosmos 2553 satellite launched in 2022] has had various bouts of what appears to be errant spinning over the past year, according to Doppler radar data from space-tracking firm LeoLabs and optical data from Slingshot Aerospace shared with Reuters. \n\nBelieved to be a radar satellite for Russian intelligence as well as a radiation testing platform, the satellite last year became the center of U.S. allegations that Russia for years has been developing a nuclear weapon capable of destroying entire satellite networks, such as SpaceX's vast Starlink internet system that Ukrainian troops have been using. U.S. officials assess Cosmos 2",
        "id": 2542462,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/27/2158224/russian-satellite-linked-to-its-nuclear-anti-satellite-weapon-program-appears-out-of-control-analyst-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Russian Satellite Linked to Its Nuclear Anti-Satellite Weapon Program Appears Out of Control, Analyst says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T21:12:19.202056+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T21:12:18+00:00",
        "description": "Microsoft Copilot \"isn't doing as well as the company would like,\" reports XDA-Developers.com (citing a report from startup/VC industry site Newcomer).\n\nThe Redmond giant has invested billions of dollars and a lot of manpower into making it happen, but as a recent report claims, people just don't care. In fact, if the report is to be believed, Microsoft's rise in the AI scene has already come to a screeching halt: \n\n\n\n At Microsoft's annual executive huddle last month, the company's chief financial officer, Amy Hood, put up a slide that charted the number of users for its Copilot consumer AI tool over the past year. It was essentially a flat line, showing around 20 million weekly users. On the same slide was another line showing ChatGPT's growth over the same period, arching ever upward toward 400 million weekly users. OpenAI's iconic chatbot was soaring, while Microsoft's best hope for a mass-adoption AI tool was idling. It was a sobering chart for Microsoft's consumer AI team... \nTh",
        "id": 2542229,
        "language": null,
        "link": "https://slashdot.org/story/25/04/27/1925219/consumers-arent-flocking-to-microsofts-ai-tool-copilot?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Consumers Aren't Flocking to Microsoft's AI Tool 'Copilot'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T21:12:19.098332+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T21:12:18+00:00",
        "description": "What can you build with a 3D printer? Starbucks just printed itself a new store &mdash; a drive-through location in the southern tip of Texas. \n\nFast Company says it's a store that \"looks more like the future of construction than your average caf&eacute;.\"\n\nBuilt with layers of concrete piped out by a giant robotic printer, the 1,400-square-foot structure is part of the company's ongoing effort to modernize operations and trim costs... Peri-3D, a German company, used a giant 3D printer to pump out layers of concrete mixture to create the structure. According to the Texas Department of Licensing and Regulation, the cost for building the small scale coffee shop was about $1.2 million... \n\nOf course, the new method is a first for the brand. And builders say, the more they use the technology, the more efficient they are at it. In Georgetown, Texas, an entire community of 100 homes was recently built using 3D-printing. The company who built the community, Lennar, says they're seeing costs ",
        "id": 2542228,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/27/2041226/starbucks-opens-its-first-3d-printed-store?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Starbucks Opens Its First 3D-Printed Store",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T19:22:49.184003+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T19:22:49+00:00",
        "description": "\"Google's DeepMind UK team reportedly seeks to unionize,\" reports TechCrunch:\n\n\n\nAround 300 London-based members of Google's AI-focused DeepMind team are seeking to unionize with the Communication Workers Union, according to a Financial Times report that cites three people involved with the unionization effort. \n\nThese DeepMind employees are reportedly unhappy about Google's decision to remove a pledge not to use AI for weapons or surveillance from its website. They're also concerned about the company's work with the Israeli military, including a $1.2 billion cloud computing contract that has prompted protests elsewhere at Google. \nAt least five DeepMind employees quit, according to the report (out of a 2,000 total U.K. staff members). \n\n\"A small group of around 200 employees of Google and its parent company Alphabet previously announced that they were unionizing,\" the article adds, \"though as a union representing just a tiny slice of the total Google workforce, it lacked the ability ",
        "id": 2541621,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/27/1830241/googles-deepmind-uk-team-reportedly-seeks-to-unionize?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's DeepMind UK Team Reportedly Seeks to Unionize",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T17:12:54.098725+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T17:12:53+00:00",
        "description": "\"Not so long ago, working in tech meant job security, extravagant perks and a bring-your-whole-self-to-the-office ethos rare in other industries,\" writes the Wall Street Journal. \n\nBut now tech work \"looks like a regular job,\" with workers \"contending with the constant fear of layoffs, longer hours and an ever-growing list of responsibilities for the same pay.\"\n\nNow employees find themselves doing the work of multiple laid-off colleagues. Some have lost jobs only to be rehired into positions that aren't eligible for raises or stock grants. Changing jobs used to be a surefire way to secure a raise; these days, asking for more money can lead to a job offer being withdrawn. \n\nThe shift in tech has been building slowly. For years, demand for workers outstripped supply, a dynamic that peaked during the Covid-19 pandemic. Big tech companies like Meta and Salesforce admitted they brought on too many employees. The ensuing downturn included mass layoffs that started in 2022... \n\n[S]ome longti",
        "id": 2540947,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/27/088238/wsj-tech-industry-workers-now-miserable-fearing-layoffs-working-longer-hours?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WSJ:  Tech-Industry Workers Now 'Miserable', Fearing Layoffs, Working Longer Hours",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T16:07:59.874586+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T16:07:59+00:00",
        "description": "The university blamed it on \"the significant number of students\" who violated their coding competition's rules.\nLong-time Slashdot reader theodp quotes this report from The Logic: Finding that many students violated rules and submitted code not written by themselves, the University of Waterloo's Centre for Computing and Math decided not to release results from its annual Canadian Computing Competition (CCC), which many students rely on to bolster their chances of being accepted into Waterloo's prestigious computing and engineering programs, or land a spot on teams to represent Canada in international competitions. \"It is clear that many students submitted code that they did not write themselves, relying instead on forbidden external help,\" the CCC co-chairs explained in a statement. \"As such, the reliability of 'ranking' students would neither be equitable, fair, or accurate.\" \n\n\"It is disappointing that the students who violated the CCC Rules will impact those students who are deserv",
        "id": 2540577,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/26/238243/canadian-university-cancels-coding-competition-over-suspected-ai-cheating?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Canadian University Cancels Coding Competition Over Suspected AI Cheating",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T15:02:59.538660+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T15:02:59+00:00",
        "description": "\"The U.S. and Canadian websites for Lenovo offered U.S. $140 and CAD $211 off on the same ThinkPad X1 Carbon model when choosing any one of the Linux-based alternatives,\" reports It's FOSS News:\n\n\nThis was brought to my attention thanks to a Reddit post... Others then chimed in, saying that Lenovo has been doing this since at least 2020 and that the big price difference shows how ridiculous Windows' pricing is... \nNot all models from their laptop lineup, like ThinkPad, Yoga, Legion, LOQ, etc., feature an option to get Linux pre-installed during the checkout process. Luckily, there is an easy way to filter through the numerous laptops. Just go to the laptops section (U.S.) on the Lenovo website and turn on the \"Operating System\" filter under the Filter by specs sidebar menu.\n \nThe article end with an embedded YouTube video showing a VCR playing a videotape of a 1999 local TV news report... about the legendary \"Windows Refund Day\" protests. \n\nSlashdot ran numerous stories about the even",
        "id": 2540161,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/04/27/0127203/lenovo-may-be-avoiding-the-windows-tax-by-offering-cheaper-laptops-with-pre-installed-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lenovo May Be Avoiding the 'Windows Tax' By Offering Cheaper Laptops With Pre-Installed Linux",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T11:49:13.161114+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T11:49:13+00:00",
        "description": "80-year-old George Lucas appeared this week at a 45th anniversary screening of The Empire Strikes Back, reports CNN &mdash; and finally gave a good explanation for why Yoda speaks the way he does. \"He explained that it came about in order to ensure that the little alien's usually profound messages really landed with audiences.\"\n\"Because if you speak regular English, people won't listen that much,\" Lucas said at the 2025 TCM Classic Film Festival, per Variety\t. \"But if he had an accent, or it's really hard to understand what he's saying, they focus on what he's saying.\" Yoda was \"basically the philosopher of the movie,\" the filmmaker added. \"I had to figure out a way to get people to actually listen &mdash; especially 12-year-olds.\" \n\n Also this week, the verified Instagram accounts for Disney+, Star Wars and LucasFilm &mdash; Lucas' film and television production company &mdash; posted clips of Yoda doing bloopers on the set of \"Star Wars\" films, with [Frank] Oz continuing to do the v",
        "id": 2539213,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/27/040248/yoda-bloopers-released---and-george-lucas-reveals-why-yoda-talks-backwards?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Yoda Bloopers Released - and George Lucas Reveals Why Yoda Talks Backwards",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T08:32:58.741548+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T08:32:58+00:00",
        "description": "Some patches for Linux 6.15-rc4 (updating the kernel driver for the Bcachefs file system) triggered some \"straight-to-the-point wisdom\" from Linus Torvalds about case-insensitive filesystems, reports Phoronix. \n\nBcachefs developer Kent Overstreet started the conversation, explaining how some buggy patches for their case-insensitive file and folder support were upstreamed into the Bcachefs kernel driver nearly two years ago:\n\nWhen I was discussing with the developer who did the implementation, I noted that fstests should already have tests. However, it seems I neglected to tell him to make sure the tests actually run... It is _not_ enough to simply rely on the automated tests. You have to have eyes on what your code is doing. \nOverstreet added \"There's a story behind the case insensitive directory fixes, and lessons to be learned.\" To which Torvalds replied.... \"No.\" \n\"The only lesson to be learned is that filesystem people never learn.\" \n\n\n\nTorvalds: Case-insensitive names are horribl",
        "id": 2538396,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/04/27/0547245/linus-torvalds-expresses-his-hatred-for-case-insensitive-file-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linus Torvalds Expresses His Hatred For Case-Insensitive File-Systems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T04:54:45.176051+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T04:54:44+00:00",
        "description": "\"4chan, down for more than a week after hackers got in through an insecure script that handled PDFs, is back online,\" notes BoingBoing. (They add that Thursday saw 4chan's first blog postin years &mdash; just the words \"Testing testing 123 123...\") But 4chan posted a much longer explanation on Friday,\" confirming their servers were compromised by a malicious PDF upload from \"a hacker using a UK IP address,\" granting access to their databases and administrative dashboard. \n\n\nThe attacker \"spent several hours exfiltrating database tables and much of 4chan's source code. When they had finished downloading what they wanted, they began to vandalize 4chan at which point moderators became aware and 4chan's servers were halted, preventing further access.\"\n\nWhile not all of our servers were breached, the most important one was, and it was due to simply not updating old operating systems and code in a timely fashion. Ultimately this problem was caused by having insufficient skilled man-hours av",
        "id": 2537745,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/27/0252257/4chan-returns-details-breach-blames-funding-issues-ends-shockwave-board?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "4chan Returns, Details Breach, Blames Funding Issues, Ends Shockwave Board",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-27T02:44:41.745459+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-27T02:44:41+00:00",
        "description": "An anonymous reader shared this report from Business Insider:\n\nA Lufthansa flight carrying 461 passengers had to divert after someone's tablet became \"jammed\" in a business-class seat. \n\nThe Airbus A380 took off from Los Angeles on Wednesday, bound for Munich, and had been flying for around three hours when the pilots diverted to Boston Logan International Airport. In a statement to Business Insider, an airline spokesperson said the tablet had become \"jammed in a Business Class seat\" and had \"already shown visible signs of deformation due to the seat's movements\" when the flight diverted. [The aviation site] Simply Flying, which first reported the news, said the device was an iPad. \n\nThe decision to divert was taken \"to eliminate any potential risk, particularly with regard to possible overheating,\" the spokesperson added, saying that it was the joint decision of the crew and air traffic control. Lithium batteries pose a safety risk if damaged, punctured, or crushed... In a confined s",
        "id": 2537344,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/27/0031222/ipad-jammed-in-seat-forces-emergency-landing-of-airplane-carrying-400-passengers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "iPad Jammed in Seat Forces Emergency Landing of Airplane Carrying 400 Passengers",
        "vote": 0
    }
]