[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-10T16:25:32.438523+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-10T15:30:04+00:00",
        "description": "STALKER 2’s November 2024 release was not the end of a very bumpy road for GSC Game World’s long-awaited follow up to 2009’s Call of Pripyat. With performance issues, bugs, crashes, lackluster AI behaviour, and a virtually non-existent A-Life system, it was a game that had its loyal fans justifiably irate at the state of its release. \n\nHowever, GSC has certainly turned things around with a bunch of patches that were quite comprehensive in addressing known issues, while bringing in new functionalities to the game. These changes and fixes have made STALKER 2 a strong contender in the survival horror genre, and a game that has become all the more easy to recommend to both long-term fans and newcomers alike.",
        "id": 3133291,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=5hXI_WbU_vw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5hXI_WbU_vw/hqdefault.jpg",
        "title": "STALKER 2 Is Shaping Up To Be A DIFFERENT KIND OF BEAST In 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-10T14:14:39.591539+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-10T13:30:01+00:00",
        "description": "While the gaming industry continues to gamble on live service at the risk of immense failure, single-player games are thriving even more than ever. This year alone has seen some truly incredible titles, starting with Ender Magnolia: Bloom in the Mist, which left early access and received rave reviews.\n\nIt continued with the likes of Citizen Sleeper 2: Starward Vector and Dynasty Warriors: Origins, but the real heavy hitters started landing in February. Kingdom Come: Deliverance 2 was a massive leap over the original and presented some excellent story-telling, and Like a Dragon: Pirate Yakuza in Hawaii is an excellent spin-off to the mainline franchise.\n\nAnd the hits haven't stopped ever since. Whether you're revisiting Oblivion with the new remaster, setting out to slay enemies in Clair Obscur delving into deliveries with Death Stranding 2: On the Beach, these single-player games more than live up to the hype.",
        "id": 3132075,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=aYpZIRvn6Gk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aYpZIRvn6Gk/hqdefault.jpg",
        "title": "15 AMAZING Single Player Games of 2025 So Far You Definitely NEED TO PLAY",
        "vote": 0
    }
]