[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T22:58:41+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: A technique that hostile nation-states and financially motivated ransomware groups are using to hide their operations poses a threat to critical infrastructure and national security, the National Security Agency has warned. The technique is known as fast flux. It allows decentralized networks operated by threat actors to hide their infrastructure and survive takedown attempts that would otherwise succeed. Fast flux works by cycling through a range of IP addresses and domain names that these botnets use to connect to the Internet. In some cases, IPs and domain names change every day or two; in other cases, they change almost hourly. The constant flux complicates the task of isolating the true origin of the infrastructure. It also provides redundancy. By the time defenders block one address or domain, new ones have already been assigned.\n \n\"This technique poses a significant threat to national security, enabling malicious cyber act",
        "id": 2487811,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/04/2059211/nsa-warns-fast-flux-threatens-national-security?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NSA Warns 'Fast Flux' Threatens National Security",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T21:53:40+00:00",
        "description": "Google has introduced Sec-Gemini v1, an experimental AI model built on its Gemini platform and tailored for cybersecurity. BetaNews reports: Sec-Gemini v1 is built on top of Gemini, but it's not just some repackaged chatbot. Actually, it has been tailored with security in mind, pulling in fresh data from sources like Google Threat Intelligence, the OSV vulnerability database, and Mandiant's threat reports. This gives it the ability to help with root cause analysis, threat identification, and vulnerability triage.\n \nGoogle says the model performs better than others on two well-known benchmarks. On CTI-MCQ, which measures how well models understand threat intelligence, it scores at least 11 percent higher than competitors. On CTI-Root Cause Mapping, it edges out rivals by at least 10.5 percent. Benchmarks only tell part of the story, but those numbers suggest it's doing something right. Access is currently limited to select researchers and professionals for early testing. If you meet t",
        "id": 2487498,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/04/2035236/google-launches-sec-gemini-v1-ai-model-to-improve-cybersecurity-defense?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Launches Sec-Gemini v1 AI Model To Improve Cybersecurity Defense",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T21:53:40+00:00",
        "description": "For the second time, President Trump has extended the deadline for ByteDance to divest TikTok's U.S. operations by 75 days. The TikTok deal \"requires more work to ensure all necessary approvals are signed,\" said Trump in a post on his Truth Social platform. The extension will \"keep TikTok up and running for an additional 75 days.\"\n \n\"We hope to continue working in Good Faith with China, who I understand are not very happy about our Reciprocal Tariffs (Necessary for Fair and Balanced Trade between China and the U.S.A.!),\" Trump added. CNBC reports: ByteDance has been in discussion with the U.S. government, the company told CNBC, adding that any agreement will be subject to approval under Chinese law. \"An agreement has not been executed,\" a spokesperson for ByteDance said in a statement. \"There are key matters to be resolved.\" Before Trump's decision, ByteDance faced an April 5 deadline to carry out a \"qualified divestiture\" of TikTok's U.S. business as required by a national security ",
        "id": 2487499,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/04/2046255/trump-extends-tiktok-deadline-for-the-second-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Extends TikTok Deadline For the Second Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T20:48:52+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: It took only seconds for the judges on a New York appeals court to realize that the man addressing them from a video screen -- a person about to present an argument in a lawsuit -- not only had no law degree, but didn't exist at all. The latest bizarre chapter in the awkward arrival of artificial intelligence in the legal world unfolded March 26 under the stained-glass dome of New York State Supreme Court Appellate Division's First Judicial Department, where a panel of judges was set to hear from Jerome Dewald, a plaintiff in an employment dispute. \"The appellant has submitted a video for his argument,\" said Justice Sallie Manzanet-Daniels. \"Ok. We will hear that video now.\"\n \nOn the video screen appeared a smiling, youthful-looking man with a sculpted hairdo, button-down shirt and sweater. \"May it please the court,\" the man began. \"I come here today a humble pro se before a panel of five distinguished justices.\" \"Ok, hol",
        "id": 2487128,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/04/2023226/ai-avatar-tries-to-argue-case-before-a-new-york-court?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Avatar Tries To Argue Case Before a New York Court",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T19:42:42+00:00",
        "description": "An anonymous reader shares a report: A Microsoft employee disrupted the company's 50th anniversary event to protest its use of AI. \"Shame on you,\" said Microsoft employee Ibtihal Aboussad, speaking directly to Microsoft AI CEO Mustafa Suleyman. \"You are a war profiteer. Stop using AI for genocide. Stop using AI for genocide in our region. You have blood on your hands. All of Microsoft has blood on its hands. How dare you all celebrate when Microsoft is killing children. Shame on you all.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Employee+Disrupts+50th+Anniversary+and+Calls+AI+Boss+'War+Profiteer'%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F04%2F04%2F1841244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F04%2F04%2F1841244%2Fmic",
        "id": 2486688,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/04/1841244/microsoft-employee-disrupts-50th-anniversary-and-calls-ai-boss-war-profiteer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Employee Disrupts 50th Anniversary and Calls AI Boss 'War Profiteer'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T17:32:11+00:00",
        "description": "Hackers targeting Australia's major pension funds in a series of coordinated attacks have stolen savings from some members at the biggest fund, Reuters is reporting, citing a source, and compromised more than 20,000 accounts. From the report: National Cyber Security Coordinator Michelle McGuinness said in a statement she was aware of \"cyber criminals\" targeting accounts in the country's A$4.2 trillion ($2.63 trillion) retirement savings sector and was organising a response across the government, regulators and industry. The Association of Superannuation Funds of Australia, the industry body, said \"a number\" of funds were impacted over the weekend. While the full scale of the incident remains unclear, AustralianSuper, Australian Retirement Trust, Rest, Insignia and Hostplus on Friday all confirmed they suffered breaches.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Hackers+Strike+Australia's+Largest+Pension+Funds+",
        "id": 2485734,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/04/174220/hackers-strike-australias-largest-pension-funds-in-coordinated-attacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hackers Strike Australia's Largest Pension Funds in Coordinated Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T16:28:15+00:00",
        "description": "An anonymous reader shares a report: AI is projected to reach $4.8 trillion in market value by 2033, but the technology's benefits remain highly concentrated, according to the U.N. Trade and Development agency. In a report released on Thursday, UNCTAD said the AI market cap would roughly equate to the size of Germany's economy, with the technology offering productivity gains and driving digital transformation. However, the agency also raised concerns about automation and job displacement, warning that AI could affect 40% of jobs worldwide. On top of that, AI is not inherently inclusive, meaning the economic gains from the tech remain \"highly concentrated,\" the report added. \n\n\"The benefits of AI-driven automation often favour capital over labour, which could widen inequality and reduce the competitive advantage of low-cost labour in developing economies,\" it said. The potential for AI to cause unemployment and inequality is a long-standing concern, with the IMF making similar warning",
        "id": 2485120,
        "language": null,
        "link": "https://slashdot.org/story/25/04/04/1512247/ai-could-affect-40-of-jobs-and-widen-inequality-between-nations-un-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Could Affect 40% of Jobs and Widen Inequality Between Nations, UN Warns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T16:28:15+00:00",
        "description": "An anonymous reader shares a report: The gap between Windows 10 and Windows 11 continues to narrow, and Microsoft's flagship operating system is on track to finally surpass its predecessor by summer. The latest figures from Statcounter show the increase in Windows 11's market share accelerating, while Windows 10 declines. \n\nBefore Champagne corks start popping in Redmond, it is worth noting that Windows 10 still accounts for over half the market -- 54.2 percent -- and Windows 11 now accounts for 42.69 percent. However, if the current trends continue, Windows 10 should finally drop below the 50 percent mark next month and be surpassed by Windows 11 shortly after. \n\nThe cause is likely due to enterprises pushing the upgrade button rather than having to deal with extended support for Windows 10. Support for most Windows 10 versions ends on October 14, 2025, and Microsoft has shown no signs of deviating from its plan to retire the veteran operating system.\n\n[...] Whether users actually w",
        "id": 2485119,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/04/166231/windows-11-poised-to-beat-10-mostly-because-it-has-to?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Windows 11 Poised To Beat 10, Mostly Because It Has To",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T15:22:20+00:00",
        "description": "Camera manufacturers continue to use different proprietary RAW file formats despite the 20-year existence of Adobe's open-source DNG (Digital Negative) format, creating ongoing compatibility challenges for photographers and software developers. \n\nMajor manufacturers including Sony, Canon, and Panasonic defended their proprietary formats as necessary for maintaining control over image processing. Sony's product team told The Verge their ARW format allows them \"to maximize performance based on device characteristics such as the image sensor and image processing engine.\" Canon similarly claims proprietary formats enable \"optimum processing during image development.\" \n\nThe Verge argues that this fragmentation forces editing software to specifically support each manufacturer's format and every new camera model -- creating delays for early adopters when new cameras launch. Each new device requires \"measuring sensor characteristics such as color and noise,\" said Adobe's Eric Chan. \n\nFor wha",
        "id": 2484497,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/04/1442223/camera-makers-defend-proprietary-raw-formats-despite-open-standard-alternative?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Camera Makers Defend Proprietary RAW Formats Despite Open Standard Alternative",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T15:22:20+00:00",
        "description": "China said Friday that it will impose reciprocal 34% tariffs on all imports from the United States from April 10, making good on a promise to strike back after US President Donald Trump escalated a global trade war. CNN: On Wednesday, Trump unveiled an additional 34% tariff on all Chinese goods imported into the US, in a move poised to cause a major reset of relations and worsen trade tensions between the world's two largest economies. \n\n\"This practice of the US is not in line with international trade rules, seriously undermines China's legitimate rights and interests, and is a typical unilateral bullying practice,\" China's State Council Tariff Commission said in a statement announcing its retaliatory tariffs. Since returning to power in January, Trump had already levied two tranches of 10% additional duties on all Chinese imports, which the White House said was necessary to stem the flow of illicit fentanyl from the country to the US. Combined with pre-existing tariffs, that means C",
        "id": 2484498,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/04/1319228/china-imposes-34-reciprocal-tariffs-on-imports-of-us-goods?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Imposes 34% Reciprocal Tariffs on Imports of US Goods",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T13:13:02+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Visa has offered Apple roughly $100 million to take over the tech giant's credit card partnership from Mastercard, the Wall Street Journal reported on Tuesday, citing sources familiar with the matter. Visa has made a bold push to secure the Apple Card, offering an upfront payment typically reserved for the largest card programs, WSJ reported. American Express is also trying to unseat Mastercard to win the Apple card. Amex is looking to become the card's issuer as well as the network, the report said, citing the sources. Goldman Sachs ended its partnership with Apple in late 2023 as the Wall Street bank retreated from consumer lending.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Visa+Bids+%24100+Million+To+Replace+Mastercard+As+Apple's+New+Credit+Card+Partner%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F04%2F04%2F0729216%2F%3Futm_source%3Dtwitter%26utm_medium",
        "id": 2483345,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/04/0729216/visa-bids-100-million-to-replace-mastercard-as-apples-new-credit-card-partner?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Visa Bids $100 Million To Replace Mastercard As Apple's New Credit Card Partner",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T11:03:00+00:00",
        "description": "Coreboot 25.03 has been released with support for 22 new motherboards and several other significant updates, including enhanced display handling, USB debugging, RISC-V support, and RAM initialization for older Intel platforms. Phoronix reports: Coreboot 25.03 delivers display handling improvements, a better USB debugging experience, CPU topology updates, various improvements to the open-source RAM initialization for aging Intel Haswell platforms, improved USB Type-C and Thunderbolt handling, various embedded controller (EC) improvements, better RISC-V architecture support, DDR5-7500 support, and many bug fixes across the sprawling Coreboot codebase. More details, including a full list of the supported boards, can be found here.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Coreboot+25.03+Released+With+Support+For+22+More+Motherboards%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F04%2F04%2F0718233%2F%3Futm_",
        "id": 2482490,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/04/0718233/coreboot-2503-released-with-support-for-22-more-motherboards?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Coreboot 25.03 Released With Support For 22 More Motherboards",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T07:47:27+00:00",
        "description": "The M.T.A. has unveiled on Wednesday a revamped New York City subway map -- the first major redesign in nearly 50 years. As reported by the New York Times, the map draws inspiration from the modernist but controversial 1972 Unimark version, prioritizing clarity over geographic precision. It's also a part of a broader effort to refresh the system's image amid calls for infrastructure upgrades and political tensions over transit funding and congestion pricing. From the report: The updated version blends elements of the Unimark design with a successor known to some as the Tauranac map, after John Tauranac, a well-regarded New York mapmaker. That design was led by the firm Michael Hertz Associates. The new map is already being displayed on digital monitors, and will be posted in subway cars and platforms over the next several weeks, the M.T.A. said.\n \nFor Janno Lieber, the authority's chairman, the occasion was also an opportunity to tie his ambitions for the system to a critical moment ",
        "id": 2481472,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/04/0710212/the-retro-subway-map-that-design-nerds-love-makes-a-comeback?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Retro Subway Map That Design Nerds Love Makes a Comeback",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T04:32:05+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: [...] The study, led by researchers at Brown University, found that the wealthiest Americans lived shorter lives than the wealthiest Europeans. In fact, wealthy Northern and Western Europeans had death rates 35 percent lower than the wealthiest Americans, whose lifespans were more like the poorest in Northern and Western Europe -- which includes countries such as France, the Netherlands, and Switzerland. \"The findings are a stark reminder that even the wealthiest Americans are not shielded from the systemic issues in the US contributing to lower life expectancy, such as economic inequality or risk factors like stress, diet or environmental hazards,\" lead study author Irene Papanicolas, a professor of health services, policy and practice at Brown, said in a news release.\n \nThe study looked at health and wealth data of more than 73,000 adults across the US and Europe who were 50 to 85 years old in 2010. There were more than 19,000 ",
        "id": 2480726,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/04/0153232/wealthy-americans-have-death-rates-on-par-with-poor-europeans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wealthy Americans Have Death Rates On Par With Poor Europeans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T03:27:13+00:00",
        "description": "Microsoft is testing a new Windows 11 feature that resizes taskbar icons dynamically like on macOS, with options to shrink icons when the taskbar is full or keep them small at all times. The Verge reports: If you're on the beta, under Taskbar settings - Taskbar behaviors, you can now select options under Show smaller taskbar buttons: Always, Never, or When taskbar is full. The third option will scale down icons so that they all can fit and not get hidden away in a second menu. The behavior appears to be similar to macOS where icons on the dock get smaller as more applications or minimized windows are added. Microsoft is also testing an update to the Start menu. \"Now, it has a larger layout that includes the ability to hide the recommended recent apps and can show all of your apps on the page,\" reports The Verge.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+11+Tests+Taskbar+Icons+That+Scale+Up+and+Down+Lik",
        "id": 2480513,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/04/0147202/windows-11-tests-taskbar-icons-that-scale-up-and-down-like-on-a-mac?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Windows 11 Tests Taskbar Icons That Scale Up and Down Like On a Mac",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T02:23:54+00:00",
        "description": "Google's NotebookLM has added a new \"Discover sources\" feature that allows users to describe a topic and have the AI find and curate relevant sources from the web -- eliminating the need to upload documents manually. \"When you tap the Discover button in NotebookLM, you can describe the topic you're interested in, and NotebookLM will bring back a curated collection of relevant sources from the web,\" says Google software engineer Adam Bignell. Click to add those sources to your notebook; \"it's a fast and easy way to quickly grasp a new concept or gather essential reading on a topic.\" PCMag reports: You can still add your files. NotebookLM can ingest PDFs, websites, YouTube videos, audio files, Google Docs, or Google Slides and summarize, transcribe, narrate, or convert into FAQs and study guides. \"Discover sources\" helps incorporate information you may not have saved. [...] The imported sources stay within the notebook you created. You can read the entire original document, ask questio",
        "id": 2480268,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/03/237231/googles-notebooklm-ai-can-now-discover-sources-for-you?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's NotebookLM AI Can Now 'Discover Sources' For You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T01:17:54+00:00",
        "description": "The Louvre Museum will discontinue its use of Nintendo 3DS XL consoles as audio guides by September 2025, replacing them with a new system. NintendoSoup reports: For several years the Louvre has been using specially dedicated New Nintendo 3DS XL consoles to give visitors an audio guided tour of the famous museum. According to the museum's official website however, it seems that the program will be discontinued in September 2025, to be replaced by a new system.\n \nPresumably, this is due to Nintendo slowly phasing out the Nintendo 3DS line in general, having stopped supporting repairs for the console in a few countries. The consoles used by the Louvre would have broken down sooner or later, necessitating a change if they could no longer be sent in for repairs. At the time of this writing, it is not known what will become of the unique special edition consoles that were being used for this purpose.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"htt",
        "id": 2480055,
        "language": null,
        "link": "https://games.slashdot.org/story/25/04/03/2248237/louvre-museum-in-paris-to-discontinue-nintendo-3ds-audio-guides?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Louvre Museum In Paris to Discontinue Nintendo 3DS Audio Guides",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T01:17:54+00:00",
        "description": "An anonymous reader quotes a report from Techdirt: Walled Culture has been following closely Italy's poorly designed Piracy Shield system. Back in December we reported how copyright companies used their access to the Piracy Shield system to order Italian Internet service providers (ISPs) to block access to all of Google Drive for the entire country, and how malicious actors could similarly use that unchecked power to shut down critical national infrastructure. Since then, the Computer &amp; Communications Industry Association (CCIA), an international, not-for-profit association representing computer, communications, and Internet industry firms, has added its voice to the chorus of disapproval. In a letter (PDF) to the European Commission, it warned about the dangers of the Piracy Shield system to the EU economy [...]. It also raised an important new issue: the fact that Italy brought in this extreme legislation without notifying the European Commission under the so-called \"TRIS\" proc",
        "id": 2480054,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/03/2257221/massive-expansion-of-italys-piracy-shield-underway?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Massive Expansion of Italy's Piracy Shield Underway",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T00:13:43+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica, written by Ryan Whitwam: Researchers at DeepMind have ... released a new technical paper (PDF) that explains how to develop AGI safely, which you can download at your convenience. It contains a huge amount of detail, clocking in at 108 pages before references. While some in the AI field believe AGI is a pipe dream, the authors of the DeepMind paper project that it could happen by 2030. With that in mind, they aimed to understand the risks of a human-like synthetic intelligence, which they acknowledge could lead to \"severe harm.\" This work has identified four possible types of AGI risk, along with suggestions on how we might ameliorate said risks. The DeepMind team, led by company co-founder Shane Legg, categorized the negative AGI outcomes as misuse, misalignment, mistakes, and structural risks.\n \nThe first possible issue, misuse, is fundamentally similar to current AI risks. However, because AGI will be more powerful by definiti",
        "id": 2479796,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/03/2236242/deepmind-details-all-the-ways-agi-could-wreck-the-world?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DeepMind Details All the Ways AGI Could Wreck the World",
        "vote": 0
    }
]