[
    {
        "age": null,
        "album": "",
        "author": "Ku Bogu",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T17:30:05+00:00",
        "description": "Aby zrozumieć przesłanie tej książki należy wziąć pod uwagę, iż ks. Malachi Martin znał treść Trzeciej Tajemnicy Fatimskiej, że pod koniec życia zastanawiał się w jaki sposób, nie łamiąc wprost przysięgi milczenia, przekazać najistotniejsze informacje dotyczące ostrzeżeń Matki Boskiej z Fatimy. Ślady tego - z bardzo ważnym i zupełnie sensacyjnym wątkiem, pomijanym przez badaczy Objawień Fatimskich - można odkryć w internecie, słuchając wywiadu jakiego ks. Malachit Martin udziela jednej z amerykańskich stacji radiowych. Widząc w jaki sposób sprzysiężenie, by nie opublikować Tajemnicy lub by ją sfałszować, niszczy Kościół i cywilizację chrześcijańską, Autor spróbował jej istotne fragmenty i zasadnicze przesłanie wpleść w wątek powieści, tym bardziej, że zasłonić się mógł szczegółami dostępnymi z innych objawień i potwierdzającymi to, co sam znał z Fatimy (choćby intronizacja Szatana i upadek w Rzymie). Fabuła dotycząca Wschodu, kwestia poświęcenia Rosji i jej nawrócenia, które się nie ",
        "id": 2486015,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Kspjkw5ZxvE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 178,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Kspjkw5ZxvE/hqdefault.jpg",
        "title": "Dom Smagany Wiatrem. Malachi Martin. E03",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Ku Bogu",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T08:45:36+00:00",
        "description": "Takie filmiki znajdziecie na Instagramie. Tu się za bardzo rozgadałem i film się nie zmieścił (za długi). Obiecuję, że tylko wyjątkowo pojawiać się będą takie treści na YouTube.\n\n☑️ ZOBACZ JAK możesz nas wesprzeć:\nhttps://kubogu.pl/wesprzyj-nas/\n\n☑️ POMÓŻ NAM OSIĄGNĄĆ 400 tyś. SUBSKRYBENTÓW!\nhttps://tiny.pl/c7cvg \n\n☑️ NIE ZAPOMINAJ, że możesz się przyczynić w ZNACZĄCY sposób do rozpowszechnienia naszych treści jeśli nas zasubskrybujesz i “POLUBISZ\" ten film. \nKAŻDY w YouTube prosi o te dwa kliknięcia myszką (subskrypcja i polubienie) - i my nie jesteśmy wyjątkiem. POMOŻESZ tym w naszej pracy na równi z innymi formami wsparcia.\n\nDziękując za Twoje wsparcie proszę Cię również o modlitwę, Mszę Świętą, Komunię Świętą (w moich intencjach). PAMIĘTAJCIE, że jestem na I linii ognia i bez Waszego wsparcia i wstawiennictwa nie będę mógł działać!\n\nfundator i założyciel kanału \"ku Bogu\"\nIgor Nadolski\n\nkanał YouTube prowadzi fundacja \"ku Bogu\" z siedzibą w Łodzi\nul. Telewizyjna 1\n\nNUMERY KONT DO ",
        "id": 2481941,
        "language": null,
        "link": "https://www.youtube.com/watch?v=jb0fYieYRdk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 178,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jb0fYieYRdk/hqdefault.jpg",
        "title": "I o pomocnikach wampirów.",
        "vote": 0
    }
]