[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T15:00:50+00:00",
        "description": "Now that the pricing for the Switch 2 has been revealed, along with a whole host of other details, however, it is difficult to not conclude that by Nintendo’s own stated metric, they have failed on this front at least. \n\nThis is not to say the Switch 2 itself has failed, or that it will perform poorly – in fact, as we’ll discuss shortly, one of the reasons Nintendo has priced things the way it has is because of the confidence the company has that the system, its games, and its accessories are all guaranteed to do well. \n\nHowever, the Switch 2’s pricing strategy in particular, which is what we are discussing here, is where Nintendo seems to have fumbled here.",
        "id": 2484534,
        "language": null,
        "link": "https://www.youtube.com/watch?v=XkT6mngACtE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XkT6mngACtE/hqdefault.jpg",
        "title": "Nintendo Seems To Have FUMBLED With The Switch 2 Pricing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-04T13:30:18+00:00",
        "description": "Nearly five years since the base game's launch, The Last of Us Part 2 Remastered finally arrives for PC on April 3rd. It offers the usual suite of PC features, from the inclusion of Ultrawide and triple-monitor setups to uncapped frame rates and various upscalers.\n\nHowever, it's arriving in the wake of The Last of Us Part 1, which launched with a myriad of issues on PC that took months to fix. Thankfully, the sequel is in far better shape, offering significantly better performance and scalability out of the box. There are also numerous graphical options to customize the quality of textures, reflections, and much more.\n\nWhile there are a few shortcomings and glitches, The Last of Us Part 2 Remastered is well worth playing on PC. Learn more about the performance and how it compares to the PS5 version's Performance and Quality modes.",
        "id": 2483965,
        "language": null,
        "link": "https://www.youtube.com/watch?v=UedUMetOjbU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UedUMetOjbU/hqdefault.jpg",
        "title": "The Last of Us Part 2 Remastered PC vs PS5 - A Competitive Port But What About Performance?",
        "vote": 0
    }
]