[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T23:00:52.409523+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T22:34:00+00:00",
        "description": "It's like \"a USB-C port for AI applications...\" according to the official documentation for MCP &mdash; \"a standardized way to connect AI models to different data sources and tools.\" \n\nAnd now Microsoft has \"revealed plans to make MCP a native component of Windows,\" reports DevClass.com, \"despite concerns over the security of the fast-expanding MCP ecosystem.\"\n\n\nIn the context of Windows, it is easy to see the value of a standardised means of automating both built-in and third-party applications. A single prompt might, for example, fire off a workflow which queries data, uses it to create an Excel spreadsheet complete with a suitable chart, and then emails it to selected colleagues. Microsoft is preparing the ground for this by previewing new Windows features. \n\n &mdash; First, there will be a local MCP registry which enables discovery of installed MCP servers. \n &mdash; Second, built-in MCP servers will expose system functions including the file system, windowing, and the Windows Sub",
        "id": 2764455,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/24/1740221/mcp-will-be-built-into-windows-to-make-an-agentic-os---bringing-security-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "MCP Will Be Built Into Windows To Make an 'Agentic OS' - Bringing Security Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T21:55:51.579308+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T21:34:00+00:00",
        "description": "Long-time Slashdot reader SchroedingersCat shares this article from Deadline: Prime Video will not be renewing The Wheel of Time for a fourth season according to Deadline article. The decision, which comes more than a month after the Season 3 finale was released April 17, followed lengthy deliberations. As often is the case in the current economic environment, the reasons were financial as the series is liked creatively by the streamer's executives... \n\nThe Season 3 overall performance was not strong enough compared to the show's cost for Prime Video to commit to another season and the streamer could not make it work after examining different scenarios and following discussions with lead studio Sony TV, sources said. With the cancellation possibility &mdash; and the show's passionate fanbase &mdash; in mind, the Season 3 finale was designed to offer some closure.\n\nStill, the news would be a gut punch for fans who have been praising the latest season as the series' best yet creatively.",
        "id": 2764176,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/24/201246/amazon-cancels-the-wheel-of-time-prime-video-series-after-3-seasons?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Cancels the 'Wheel of Time' Prime Video Series After 3 Seasons",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T21:55:51.787396+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T20:34:00+00:00",
        "description": "Jonathan L. Zittrain is a law/public policy/CS professor at Harvard (and also director of its Berkman Klein Center for Internet &amp; Society). \n\nHe's also long-time Slashdot reader #628,028 &mdash; and writes in to share his new article in the Atlantic.\nFollowing on Anthropic's bridge-obsessed Golden Gate Claude, colleagues at Harvard's Insight+Interaction Lab have produced a dashboard that shows what judgments Llama appears to be forming about a user's age, wealth, education level, and gender during a conversation. I wrote up how weird it is to see the dials turn while talking to it, and what some of the policy issues might be. \n\nLlama has openly accessible parameters; So using an \"observability tool\" from the nonprofit research lab Transluce, the researchers finally revealed \"what we might anthropomorphize as the model's beliefs about its interlocutor,\" Zittrain's article notes:\n\nIf I prompt the model for a gift suggestion for a baby shower, it assumes that I am young and female an",
        "id": 2764177,
        "language": null,
        "link": "https://slashdot.org/story/25/05/24/1946203/people-should-know-about-the-beliefs-llms-form-about-them-while-conversing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "People Should Know About the 'Beliefs' LLMs Form About Them While Conversing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T20:16:42.805334+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T19:34:00+00:00",
        "description": "Wednesday Google security researchers published a preprint demonstrating that 2048-bit RSA encryption \"could theoretically be broken by a quantum computer with 1 million noisy qubits running for one week,\" writes Google's security blog. \n\n\"This is a 20-fold decrease in the number of qubits from our previous estimate, published in 2019... \"\n\nThe reduction in physical qubit count comes from two sources: better algorithms and better error correction &mdash; whereby qubits used by the algorithm (\"logical qubits\") are redundantly encoded across many physical qubits, so that errors can be detected and corrected... [Google's researchers found a way to reduce the operations in a 2024 algorithm from 1000x more than previous work to just 2x. And \"On the error correction side, the key change is tripling the storage density of idle logical qubits by adding a second layer of error correction.\"] \n\nNotably, quantum computers with relevant error rates currently have on the order of only 100 to 1000 q",
        "id": 2763841,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/24/0530234/how-many-qubits-will-it-take-to-break-secure-public-key-cryptography-algorithms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Many Qubits Will It Take to Break Secure Public Key Cryptography Algorithms?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T19:12:06.285588+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T18:34:00+00:00",
        "description": "\"Firefox's address bar just got an upgrade,\" Mozilla writes on their blog:\n\n\nKeep your original search visible \nWhen you perform a search, your query now remains visible in the address bar instead of being replaced by the search engine's URL. Whereas before your address bar was filled with long, confusing URLs, now it's easier to refine or repeat searches... [Clicking an icon left of the address bar even pulls up a list of search-engine choices under the heading \"This time search with...\"] \n\nSearch your tabs, bookmarks and history using simple keywords \n\nYou can access different search modes in the address bar using simple, descriptive keywords like @bookmarks, @tabs, @history, and @actions, making it faster and easier to find exactly what you need. \n\nType a command, and Firefox takes care of it \n\nYou can now perform actions like \"clear history,\" \"open downloads,\" or \"take a screenshot\" just by typing into the address bar. This turns the bar into a practical productivity tool &mdash; ",
        "id": 2763533,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/24/0619227/firefox-creates-a-smarter-simpler-address-bar?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Firefox Creates 'A Smarter, Simpler Address Bar'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T18:05:43.480258+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T17:34:00+00:00",
        "description": "Science magazine reports that hummingbird feeders \"have become a major evolutionary force,\" according to research published this week in Global Change Biology. (At least for the Anna's hummingbird, a common species in the western U.S.\n\nOver just a few generations, their beaks have dramatically changed in size and shape.... [A]s feeders proliferated, Anna's hummingbird beaks got longer and larger, which may reflect an adaptation to slurp up far more nectar than flowers can naturally provide. Developing a bigger beak to access feeders \"is like having a large spoon to eat with,\" says senior author Alejandro Rico-Guevara, an evolutionary biologist at the University of Washington. This change was more pronounced in areas where feeders were dense. But in birds that lived in colder regions north of the species' historical range, the researchers spotted the opposite trend: Their beaks became shorter and smaller. This finding also makes sense: The researchers used an infrared camera to show fo",
        "id": 2763233,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/24/0213237/bird-feeders-have-caused-a-dramatic-evolution-of-california-hummingbirds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bird Feeders Have Caused a Dramatic Evolution of California Hummingbirds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T17:01:48.833803+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T16:34:00+00:00",
        "description": "\"What if ultrafast pulses of light could operate computers at speeds a million times faster than today's best processors?\" asks the University of Arizona. \n\n\"A team of scientists, including researchers from the University of Arizona, are working to make that possible.\"\n\n\n\nIn a groundbreaking international effort, researchers from the Department of Physics in the College of Science and the James C. Wyant College of Optical Sciences demonstrated a way to manipulate electrons in graphene using pulses of light that last less than a trillionth of a second. By leveraging a quantum effect known as tunneling, they recorded electrons bypassing a physical barrier almost instantaneously, a feat that redefines the potential limits of computer processing power. A study published in Nature Communications highlights how the technique could lead to processing speeds in the petahertz range &mdash; over 1,000 times faster than modern computer chips. Sending data at those speeds would revolutionize comp",
        "id": 2762906,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/24/0337249/researchers-build-the-worlds-fastest-petahertz-quantum-transistor-they-predict-lightwave-electronics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Build 'The World's Fastest Petahertz Quantum Transistor'. They Predict Lightwave Electronics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T15:50:20.213788+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T15:34:00+00:00",
        "description": "\"In large, companies failed to self-regulate,\" writes long-time Slashdot reader BrendaEM:\nThey have not been respected the individual's right to privacy. In software and web interfaces, companies have buried their privacy setting so deep that they cannot be found in a reasonable amount of time, or an unreasonable amount of steps are needed to attempt to retain data. These companies have taken away the individual's right to privacy --by default. \n\nAre laws needed that protect a person's privacy by default--unless specific steps are taken by that user/purchaser to relinquish it? Should the wording of the explanation be so written that the contract is brief, explaining the forfeiture of the privacy, and where that data might be going? Should a company selling a product be required to state before purchase which rights need to be dismissed for its use? Should a legal owner who purchased a product expect it to stop functioning--only because a newer user contract is not agreed to? \n\nShare y",
        "id": 2762467,
        "language": null,
        "link": "https://ask.slashdot.org/story/25/05/24/0430214/ask-slashdot-do-we-need-opt-out-by-default-privacy-laws?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ask Slashdot:  Do We Need Opt-Out-By-Default Privacy Laws?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T14:45:24.184280+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T14:34:00+00:00",
        "description": "SiFive was one of the first companies to produce a RISC-V chip. This week they announced a new collaboration with Red Hat \"to bring Red Hat Enterprise Linux support to the rapidly growing RISC-V community\" and \"prepare Red Hat's product portfolio for future intersection with RISC-V server hardware from a diverse set of RISC-V suppliers.\" \n\nRed Hat Enterprise Linux 10 is available in developer preview on the SiFive HiFive Premier P550 platform, which they call \"a proven, high performance RISC-V CPU development platform.\"\n\n\n\nThe SiFive HiFive Premier P550 provides a proven, high performance RISC-V CPU development platform. Adding support for Red Hat Enterprise Linux 10, the latest version of the world's leading enterprise Linux platform, enables developers to create, optimize, and release new applications for the next generation of enterprise servers and cloud infrastructure on the RISC-V architecture... \n\nSiFive's high performance RISC-V technology is already being used by large organi",
        "id": 2762165,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/05/24/041237/red-hat-collaborates-with-sifive-on-risc-v-support-as-rhel-10-brings-ai-assistant-and-post-quantum-security?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Red Hat Collaborates with SIFive on RISC-V Support, as RHEL 10 Brings AI Assistant and Post-Quantum Security",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T10:01:08.481059+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T10:00:00+00:00",
        "description": "Valve's SteamOS 3.7.8 update brings official support for AMD-powered handhelds like Lenovo's Legion Go and Asus' ROG Ally, along with a new \"Steam OS Compatible\" library tab and key bug fixes. Other features include a battery charge limit, updated graphics drivers, and a shift to Plasma 6.2.5. Polygon reports: Valve outlines two requirements for the third-party devices not explicitly named in the update to run SteamOS on the handheld: they must be AMD-powered and have an NVMe SSD. Specific instructions for installing the operating system have been updated and listed here.\n \nBefore this huge update, players had to use an alternative like Bazzite to achieve a similar SteamOS experience on their devices. The new update also piggybacks off of Valve expanding the Steam Deck Verified categorization system to \"any device running SteamOS that's not a Steam Deck\" in mid-May. To make matters sweeter, a SteamOS-powered version of the Lenovo Legion Go S is scheduled to release on May 25. You can ",
        "id": 2760735,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/23/2248229/valve-adds-steamos-support-for-its-steam-deck-rivals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Valve Adds SteamOS Support For Its Steam Deck Rivals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T07:50:45.492795+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T07:00:00+00:00",
        "description": "Google's new AI video tool, Veo 3, is being used to create hyperrealistic videos that are now flooding the internet, terrifying viewers \"with a sense that real and fake have become hopelessly blurred,\" reports Axios. From the report: Unlike OpenAI's video generator Sora, released more widely last December, Google DeepMind's Veo 3 can include dialogue, soundtracks and sound effects. The model excels at following complex prompts and translating detailed descriptions into realistic videos. The AI engine abides by real-world physics, offers accurate lip-syncing, rarely breaks continuity and generates people with lifelike human features, including five fingers per hand.\nAccording to examples shared by Google and from users online, the telltale signs of synthetic content are mostly absent.\n \nIn one viral example posted on X, filmmaker and molecular biologist Hashem Al-Ghaili shows a series of short films of AI-generated actors railing against their AI creators and prompts. Special effects t",
        "id": 2760183,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/23/2240214/googles-new-ai-video-tool-floods-internet-with-real-looking-clips?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's New AI Video Tool Floods Internet With Real-Looking Clips",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T04:35:44.726686+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: One of Microsoft's latest AI models can accurately predict air quality, hurricanes, typhoons, and other weather-related phenomena, the company claims. In a paper published in the journal Nature and an accompanying blog post this week, Microsoft detailed Aurora, which the tech giant says can forecast atmospheric events with greater precision and speed than traditional meteorological approaches. Aurora, which has been trained on more than a million hours of data from satellites, radar and weather stations, simulations, and forecasts, can be fine-tuned with additional data to make predictions for particular weather events.\n \nAI weather models are nothing new. Google DeepMind has released a handful over the past several years, including WeatherNext, which the lab claims beats some of the world's best forecasting systems. Microsoft is positioning Aurora as one of the field's top performers -- and a potential boon for labs studying weathe",
        "id": 2759578,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/23/2023207/microsoft-says-its-aurora-ai-can-accurately-predict-air-quality-typhoons?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Says Its Aurora AI Can Accurately Predict Air Quality, Typhoons",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T01:15:58.269491+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T00:45:00+00:00",
        "description": "In early 2025, U.S. solar power production jumped 44% compared to the previous year, driven by end-of-year construction to capture tax incentives and long-term cost advantages. \"The bad news is that, in contrast to China, solar's growth hasn't been enough to offset rising demand,\" notes Ars Technica. \"Instead, the US also saw significant growth in coal use, which rose by 23 percent compared to the year prior, after years of steady decline.\" From the report: Short-term fluctuations in demand are normal, generally driven by weather-induced demand for heating or cooling. Despite those changes, demand for electricity in the US has been largely flat for over a decade, largely thanks to gains in efficiency. But 2024 saw demand go up by nearly 3 percent, and the first quarter of 2025 saw another rise, this time of nearly 5 percent. It's a bit too early to say that we're seeing a shift to a period of rising demand, but one has been predicted for some time due to rising data center use and the",
        "id": 2759028,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/23/2156217/us-solar-keeps-surging-generating-more-power-than-hydro-in-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Solar Keeps Surging, Generating More Power Than Hydro In 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-24T00:11:03.853064+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-24T00:02:00+00:00",
        "description": "Kraken is launching tokenized versions of U.S. equities for 24/7 trading outside the U.S., giving global investors blockchain-based access to major companies like Apple and Tesla. Reuters reports: Tokenization refers to the process of issuing digital representations of publicly-traded securities. Instead of holding the securities directly, investors hold tokens that represent ownership of the securities. The tokens' launch outside the U.S. comes amid growing interest in blending traditional finance with blockchain infrastructure. While tokenized securities have yet to gain widespread adoption, proponents say they hold the potential to significantly reshape how people access and invest in financial markets.\n \nIn a January opinion piece for the Washington Post, Robinhood CEO Vlad Tenev said tokenization could also allow retail investors to access private companies' stocks. Kraken's tokens, called xStocks, will be available in select markets outside the United States, it said, without na",
        "id": 2758750,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/23/2135201/kraken-launches-digital-tokens-to-offer-247-trading-of-us-equities?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Kraken Launches Digital Tokens To Offer 24/7 Trading of US Equities",
        "vote": 0
    }
]