[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-15T17:45:47.785543+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-15T17:01:31+00:00",
        "description": "Sengoku Dynasty is Superkami and Toplitz Productions’ way of bringing Japan's turbulent Sengoku era to life. However, its gameplay and combat loops make the journey from being a nobody to a leader of legend, a long, hard slog that quickly loses its allure despite a sense of progress that makes you feel like your actions matter to those around you.\n\nIt's a perfect example of an ambitious idea being sacrificed at the altar of generic mission designs and repetitive activities designed to pad out your playtime. The world could keep you coming back for more, but only if you're looking for some mindless entertainment as you go about serving its denizens while enjoying the peace and quiet of one of your villages.",
        "id": 3338997,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=xblkXT9TI1E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xblkXT9TI1E/hqdefault.jpg",
        "title": "Sengoku Dynasty PS5 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-15T14:30:49.131058+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-15T13:30:24+00:00",
        "description": "Deamon X Machina: Titanic Scion has everything that's cool about a video game in which the main character pilots a powerful mech. It's got a potentially solid main narrative, a world that seems like a treat to explore, well-designed bosses and enemies, and combat systems that could make taking on those enemies a sight to behold.\n\nBut are the previews and early showcases an indication of its quality? That's a question that can be answered only when we get to take a shot at the final release. That being said, it is quite an exciting addition to an already solid lineup of games this year, with enough to stand on its own two feet, mechanical or otherwise. For those of you wanting to scratch that Armored Core itch, this one certainly seems worth a try. \n\nNote: Some footage seen here was used via GamersPrey for representation purposes. Please note that they are still officially revealed footage through the publisher/developer of this game.",
        "id": 3337480,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=InQWh_KUYSA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/InQWh_KUYSA/hqdefault.jpg",
        "title": "Why I Absolutely CANNOT WAIT For Daemon X Machina: Titanic Scion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-15T11:15:52.061167+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-15T10:00:55+00:00",
        "description": "Visual Concept's NBA 2K26 is around the corner, bringing a lot of improvements over its predecessor in its attempt to become the definitive basketball simulator experience you can get your hands on this year. \n\nFrom improvements to the already brilliant ProPlay system to ambitious additions to its Player Builder, the game is shaping up to be quite an upgrade. \nThere are a lot of options at your disposal, and a lot of fun to be had as you shoot hoops with the best of the best in the NBA.",
        "id": 3336128,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=_xZdDghT5tk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_xZdDghT5tk/hqdefault.jpg",
        "title": "NBA 2K26 - 15  NEW Things You Need To Know Before You Buy",
        "vote": 0
    }
]