[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T21:05:47.430999+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T20:00:26+00:00",
        "description": "The Savage Planet franchise, first started by Typhoon Studios and continued by the same developers under Raccoon Logic, could mean many different things. Some may find a surprisingly fun action-adventure title with solid art direction and mechanics. Others may become numb to the overdone humor.\n\nWith Revenge of the Savage Planet, Raccoon Logic seemingly looked at all these things and simply added more. There are multiple planets to explore, several new flora and fauna to scan, capture, and research, the obnoxious live-action ads are on another level of sensory overload, and so on. The overall look and feel are unchanged, and the premise is less about survival than an interplanetary scavenger hunt.\n\nIt isn't the worst thing, even if the core premise of \"revenge\" falls flat and the combat is above average (at best). Really, it all boils down to how much you liked Journey to the Savage Planet and whether more is better.",
        "id": 2606111,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cQu2TfGeHhQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cQu2TfGeHhQ/hqdefault.jpg",
        "title": "Revenge of the Savage Planet Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T14:41:17.085228+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T14:00:19+00:00",
        "description": "The Division 2 is doing a fairly unorthodox thing by giving a largely dormant experience for five years a new expansion. The Division 2 has received support since the last substantial story DLC, Warlords of New York, but it’s been a slow trickle of updates and added one-off missions through the years. \n\nThe Battle for Brooklyn DLC is finally launching, adding a new open-ended zone, campaign, and some new gameplay features to change up the moment to moment gameplay.\n\nBattle for Brooklyn can be purchased as a standalone expansion for $14.99 if you’re a returning player, or for a bit more money via some bundle editions. The return to Brooklyn is looking very nice with the vibrant Autumnal foliage, so fans will have some pleasant environments to explore come its release date of May 27th.",
        "id": 2602867,
        "language": null,
        "link": "https://www.youtube.com/watch?v=FUodCmQPh_w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FUodCmQPh_w/hqdefault.jpg",
        "title": "The Division 2: Battle For Brooklyn DLC - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T11:16:14.458242+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T09:30:06+00:00",
        "description": "As much hype as there's been for DOOM: The Dark Ages, which launches on May 15th for Xbox Series X/S, PS5, and PC, DOOM has been more pervasive in the industry through the years than you'd think. Whether it's the rise of boomer shooters or various developers taking inspiration from modern DOOM for their titles, there is an incredible amount of variety.\n\nWhether it's remasters like Blood: Fresh Supply, STAR WARS: Dark Forces Remaster, Turok: Dinosaur Hunter Remaster and Quake 2 Remastered or brand new efforts like Deadlink, Selaco and Turbo Overkill, first-person shooter players are spoiled for choice. The fact that games like Wolfenstein: The New Order and RAGE 2 (at least the combat) still hold up after all these years is nuts.\n\nIf the wait for DOOM: The Dark Ages is getting to be too much, check out these 15 DOOM-likes you can play in the meantime.",
        "id": 2601167,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Cv64L6r1br8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Cv64L6r1br8/hqdefault.jpg",
        "title": "15 DOOM Like Games To Play Till You WAIT For DOOM: The Dark Ages",
        "vote": 0
    }
]