[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T23:29:35.634835+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T23:29:35+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: An update to Roku OS has resulted in colors looking washed out in HDR content viewed on Roku apps, like Disney+. Complaints started surfacing on Roku's community forum a week ago. On May 1, a company representative posted that Roku was \"investigating the Disney Plus HDR content that was washed out after the recent update.\" However, based on user feedback, it seems that HDR on additional Roku apps, including Apple TV+ and Netflix, are also affected. Roku's representative has been asking users to share their experiences so that Roku can dig deeper into the problem. [...]\n \nRoku hasn't provided a list of affected devices, but users have named multiple TCL TV models, at least one Hisense, and one Sharp TV as being impacted. We haven't seen any reports of Roku streaming sticks being affected. One forum user claimed that plugging a Roku streaming stick into a Roku TV circumvented the problem. Forum user Squinky said the washed-out color",
        "id": 2607067,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/05/2056251/software-update-makes-hdr-content-unwatchable-on-roku-tvs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Software Update Makes HDR Content 'Unwatchable' On Roku TVs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T22:24:32.663887+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T22:24:32+00:00",
        "description": "TeleMessage, a communications app used by former Trump national security adviser Mike Waltz, has suspended services after a reported hack exposed some user messages. The breach follows controversy over Waltz's use of the app to coordinate military updates, including accidentally adding a journalist to a sensitive Signal group chat. From the report: In an email, Portland, Oregon-based Smarsh, which runs the TeleMessage app, said it was \"investigating a potential security incident\" and was suspending all its services \"out of an abundance of caution.\" A Reuters photograph showed Waltz using TeleMessage, an unofficial version of the popular encrypted messaging app Signal, on his phone during a cabinet meeting on Wednesday. \nA separate report from 404 Media says hackers have also targeted GlobalX Air -- one of the main airlines the Trump administration is using as part of its deportation efforts -- and claim to have stolen flight records and passenger manifests for all its flights, includi",
        "id": 2606698,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/05/2044211/messaging-app-used-by-mike-waltz-trump-deportation-airline-globalx-both-hacked-in-separate-breaches?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Messaging App Used by Mike Waltz, Trump Deportation Airline GlobalX Both Hacked in Separate Breaches",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T22:24:32.550339+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T22:24:32+00:00",
        "description": "According to the Wall Street Journal, UnitedHealth Group has 1,000 AI applications in production for use in its insurance, health delivery and pharmacy divisions. From a report: UnitedHealth's AI transcribes conversations from clinician visits, summarizes data, processes claims and controls customer-facing chatbots. In addition, roughly 20,000 of the company's engineers use AI to write software, according to the report. Half of these applications use generative AI and the other half employ a more traditional version of the technology, said Chief Digital and Technology Officer Sandeep Dadlani, per the report. \"Like other AI-powered tools, medical chatbots are more likely to provide highly accurate answers when thoroughly trained on high-quality, diverse datasets and when user prompts are clear and simple,\" Julie McGuire, managing director of the BDO Center for Healthcare Excellence &amp; Innovation, told PYMNTS in April 2024. \"However, when questions are more complicated or unusual, a ",
        "id": 2606697,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/05/2050232/unitedhealth-now-has-1000-ai-applications-in-production?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UnitedHealth Now Has 1,000 AI Applications In Production",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T21:19:32.470295+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T21:19:32+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Hundreds of e-commerce sites, at least one owned by a large multinational company, were backdoored by malware that executes malicious code inside the browsers of visitors, where it can steal payment card information and other sensitive data, security researchers said Monday. The infections are the result of a supply-chain attack that compromised at least three software providers with malware that remained dormant for six years and became active only in the last few weeks. At least 500 e-commerce sites that rely on the backdoored software were infected, and it's possible that the true number is double that, researchers from security firm Sansec said. Among the compromised customers was a $40 billion multinational company, which Sansec didn't name. In an email Monday, a Sansec representative said that \"global remediation [on the infected customers] remains limited.\"\n \n\"Since the backdoor allows uploading and executing arbitrary PHP ",
        "id": 2606326,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/05/2034207/hundreds-of-e-commerce-sites-hacked-in-supply-chain-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hundreds of E-Commerce Sites Hacked In Supply-Chain Attack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T21:19:32.582896+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T21:19:32+00:00",
        "description": "Microsoft officially shuttered Skype on May 5, ending the pioneering video chat service's 22-year run. The closure, announced in February, completes Skype's absorption into Microsoft Teams, the company's Slack competitor. Users opening Skype apps will now be redirected to Teams. The only surviving component is the Skype Dial Pad, which remains available within Microsoft Teams Free for subscribers to make calls to traditional phone numbers. \n\nThe once-dominant video calling platform was purchased by Microsoft for $8.5 billion in 2011, replacing the company's Windows Live Messenger. Created in 2003 by developers behind Kazaa file-sharing software, Skype became synonymous with video calling during broadband internet's expansion. Skype's decline accelerated after Microsoft's acquisition, with unpopular redesigns and competition from Zoom, which captured market share during the COVID-19 pandemic. Microsoft began phasing out Skype in 2017, starting with Skype for Business, while bundling Te",
        "id": 2606327,
        "language": null,
        "link": "https://slashdot.org/story/25/05/05/1938237/microsoft-shuts-down-skype?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Shuts Down Skype",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T20:13:54.697442+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T20:13:54+00:00",
        "description": "OpenAI has decided that its nonprofit division will retain control over its for-profit organization, after the company initially announced that it planned to convert to a for-profit organization. From a report: According to the company, OpenAI's business wing, which has been under the nonprofit since 2019, will transition to a public benefit corporation (PBC). The nonprofit will control and also be a large shareholder of the PBC. \"OpenAI was founded as a nonprofit, and is today overseen and controlled by that nonprofit,\" OpenAI Board Chairman Bret Taylor wrote in a statement on the company's blog. \"Going forward, it will continue to be overseen and controlled by that nonprofit.\" \n\nOpenAI says that it made the decision \"after hearing from civic leaders and engaging in constructive dialogue with the offices of the Attorney General of Delaware and the Attorney General of California.\" \"We thank both offices and we look forward to continuing these important conversations to make sure OpenA",
        "id": 2605888,
        "language": null,
        "link": "https://slashdot.org/story/25/05/05/1932202/openai-reverses-course-says-its-nonprofit-will-remain-in-control-of-its-business-operations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Reverses Course, Says Its Nonprofit Will Remain in Control of Its Business Operations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T19:08:54.522823+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T19:08:53+00:00",
        "description": "New York City's subway system continues to operate largely on analog signal technology installed nearly a century ago, with 85% of the network still relying on mechanical equipment that requires constant human intervention. The outdated system causes approximately 4,000 train delays monthly and represents a technological time capsule in America's largest mass transit system. \n\nDeep inside Brooklyn's Hoyt-Schermerhorn station, transit worker Dyanesha Pryor operates a hulking machine the size of a grand piano by manipulating 24 metal levers that control nearby trains. Each command requires a precise sequence of movements, punctuated by metallic clanking as levers slam into place. When Pryor needs to step away, even for a bathroom break, express service must be rerouted until she returns, forcing all trains onto local tracks. \n\nThe antiquated \"fixed block\" signaling divides tracks into approximately 1,000-foot sections. When a train occupies a block, it cuts off electrical current, provi",
        "id": 2605311,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/05/0712248/a-look-at-the-nyc-subways-archaic-signal-system?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "A Look at the NYC Subway's Archaic Signal System",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T19:08:54.297480+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T19:08:53+00:00",
        "description": "Apple on Monday lodged an appeal to challenge a U.S. judge's ruling that ordered the tech company to immediately open its lucrative App Store to more competition. From a report: Apple in a court notice it will ask the San Francisco-based 9th U.S. Circuit Court of Appeals to review the April 30 ruling, which found the company in contempt of an earlier order in a 2020 antitrust lawsuit brought by Epic Games. \n\nU.S. District Judge Yvonne Gonzalez Rogers said in her decision that Apple willfully failed to comply with a 2021 injunction designed to allow developers to more easily steer consumers to potentially cheaper non-Apple payment options. Gonzalez Rogers also referred Apple and one of its executives to federal prosecutors for a possible criminal contempt investigation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Will+Appeal+Contempt+Ruling+in+Epic+Games+Case+Over+App+Store%3A+https%3A%2F%2Fapple.slashdot.or",
        "id": 2605309,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/05/1623223/apple-will-appeal-contempt-ruling-in-epic-games-case-over-app-store?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Will Appeal Contempt Ruling in Epic Games Case Over App Store",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T19:08:54.184760+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T19:08:53+00:00",
        "description": "An industrial plan China rolled out a decade ago that was criticized by the U.S. as protectionist has been highly successful in narrowing China's technological gap with the West, a new study finds. From a report: The study, commissioned by the U.S. Chamber of Commerce, is set to intensify the debate in Washington and elsewhere over how to counter China's use of state subsidies and other strategies to bolster its competitiveness. To placate President Trump during his first-term trade war with China, Beijing dropped mentions of the \"Made in China 2025\" plan, leader Xi Jinping's signature industrial strategy, from public discourse. But the policy stayed in place. \n\nThe study, released Monday, shows that enormous state support unleashed under the strategy has enabled China to eliminate or reduce its dependence on imports such as rail and power equipment, medical devices and renewable-energy products. In addition, Chinese companies have become more competitive globally, gaining market shar",
        "id": 2605308,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/05/1724228/beijings-made-in-china-plan-is-narrowing-tech-gap-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Beijing's 'Made in China' Plan Is Narrowing Tech Gap, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T19:08:54.635201+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T19:08:53+00:00",
        "description": "The highest-rated video games of 2025 are all budget-priced titles, with Metacritic top performers Clair Obscur: Expedition 33, Blue Prince, and Split Fiction costing just $50, $30, and $50 respectively. This comes as Microsoft announces certain Xbox titles will now cost $80, following Nintendo's similar price hike for Mario Kart on Switch 2. \n\nClair Obscur, developed by a small French studio, sold 1 million copies in its first week. Split Fiction, despite being published by EA, was created by a small Stockholm team and has reached 2 million sales. Blue Prince, a puzzle-roguelike largely created by a single developer in Los Angeles, is showing strong performance on Steam, Bloomberg reports. \n\nAll three games share key traits: they use commercially available engines, take creative risks that big-budget projects couldn't afford, and target specific player demographics rather than trying to appeal broadly. The contrast is striking -- Clair Obscur's developers celebrated reaching 1 millio",
        "id": 2605312,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/05/073207/budget-titles-dominate-2025s-top-rated-games-as-aaa-prices-climb-to-80?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Budget Titles Dominate 2025's Top-Rated Games as AAA Prices Climb To $80",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T19:08:54.747753+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T19:08:53+00:00",
        "description": "A majority of Britons may now consider themselves neurodivergent, with conditions such as autism, dyslexia or ADHD, according to a leading psychologist from King's College London. Professor Francesca Happe, an expert in cognitive neuroscience, said reduced stigma around these conditions has prompted more people to seek medical diagnoses or self-diagnose. \n\n\"Once you take autism, ADHD, dyslexia, dyspraxia and all the other ways that you can developmentally be different from the typical, you actually don't get many typical people left,\" Happe told BBC Radio 4. \n\nAutism diagnoses increased 787% between 1998 and 2018 in the UK, with estimated prevalence rising from one in 2,500 children 80 years ago to one in 36 today. Happe, who was appointed CBE in 2021 for her autism research, warned that behaviors previously considered \"a bit of eccentricity\" are now being labeled with medical terms.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.c",
        "id": 2605313,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/05/0649225/majority-in-uk-now-self-identify-as-neurodivergent?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Majority in UK Now 'Self-Identify' as Neurodivergent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T19:08:54.071296+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T19:08:53+00:00",
        "description": "BrianFagioli writes: Microsoft has officially begun rejecting high-volume emails that don't meet its new authentication rules. \n\nHere's the deal. If you send more than 5,000 messages per day to Outlook.com addresses (including hotmail.com and live.com) and you're not properly set up with SPF, DKIM, and DMARC, your emails may never arrive.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Cracks+Down+On+Bulk+Email+With+Strict+New+Outlook+Rules%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F05%2F05%2F1817247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F05%2F05%2F1817247%2Fmicrosoft-cracks-down-on-bulk-email-with-strict-new-outlook-rules%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png",
        "id": 2605307,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/05/1817247/microsoft-cracks-down-on-bulk-email-with-strict-new-outlook-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Cracks Down On Bulk Email With Strict New Outlook Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T19:08:54.410055+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T19:08:53+00:00",
        "description": "The United Arab Emirates will introduce AI to the public school curriculum this year, as the Gulf country vies to become a regional powerhouse for AI development. From a report: The subject will be rolled out in the 2025-2026 academic year for kindergarten pupils through to 12th grade, state-run news agency WAM reported on Sunday. The course includes ethical awareness as well as foundational concepts and real-world applications, it said. The UAE joins a growing group of countries integrating AI into school education. Beijing announced a similar move to roll out AI courses to primary and secondary students in China last month.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UAE+Rolls+Out+AI+for+Schoolkids%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F05%2F05%2F0718210%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.",
        "id": 2605310,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/05/0718210/uae-rolls-out-ai-for-schoolkids?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UAE Rolls Out AI for Schoolkids",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T12:35:46.762890+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T12:35:46+00:00",
        "description": "Yahoo Finance reports that Mark Zuckerberg made bold predictions for investors on Meta's earnings call this week &mdash; about advertisers. \"AI has already made us better at targeting and finding the audiences that will be interested in their products than many businesses are themselves,\" Zuck said, \"and that keeps improving...\" \n\n\"If we deliver on this vision, then over the coming years, I think that the increased productivity from AI will make advertising a meaningfully larger share of global GDP than it is today...\"\n\n\nIf investors are still searching for answers to nagging questions about how massive AI investments will pay off, Zuckerberg provided the clearest reply yet: It will strengthen our core business. In fact, it is our business... On what many believe to be the cusp of an economic downturn, Meta isn't pitching its AI developments as an add-on to its operations, but as something central to its core proposition of targeted advertising... \n\n\n\"While Meta's investments in GenAI",
        "id": 2602049,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/05/0558205/has-meta-figured-out-how-to-monetize-ai---by-using-it-for-targeted-advertising?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Has Meta Figured Out How to Monetize AI - By Using It For Targeted Advertising?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T08:29:58.947893+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T08:29:58+00:00",
        "description": "\"A federal class action lawsuit filed this week in Texas accused Toyota and an affiliated telematics aggregator of unlawfully collecting drivers' information and then selling that data to Progressive,\" reports Insurance Journal:\nThe lawsuit alleges that Toyota and Connected Analytic Services (CAS) collected vast amounts of vehicle data, including location, speed, direction, braking and swerving/cornering events, and then shared that information with Progressive's Snapshot data sharing program. The class action seeks an award of damages, including actual, nominal, consequential damages, and punitive, and an order prohibiting further collection of drivers' location and vehicle data. \nFlorida man Philip Siefke had bought a new Toyota RAV4 XLE in 2021 \"equipped with a telematics device that can track and collect driving data,\" according to the article. But when he tried to sign up for insurance from Progressive, \"a background pop-up window appeared, notifying Siefke that Progressive was a",
        "id": 2600618,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/04/2341203/class-action-accuses-toyota-of-illegally-sharing-drivers-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Class Action Accuses Toyota of Illegally Sharing Drivers' Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T04:08:44.533923+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T04:08:44+00:00",
        "description": "Rolling Stone reports on a strange new phenomenon spotted this week in a Reddit thread titled \"Chatgpt induced psychosis.\"\n\n\nThe original post came from a 27-year-old teacher who explained that her partner was convinced that the popular OpenAI model \"gives him the answers to the universe.\" Having read his chat logs, she only found that the AI was \"talking to him as if he is the next messiah.\" The replies to her story were full of similar anecdotes about loved ones suddenly falling down rabbit holes of spiritual mania, supernatural delusion, and arcane prophecy &mdash; all of it fueled by AI. Some came to believe they had been chosen for a sacred mission of revelation, others that they had conjured true sentience from the software. \n What they all seemed to share was a complete disconnection from reality. \n\nSpeaking to Rolling Stone, the teacher, who requested anonymity, said her partner of seven years fell under the spell of ChatGPT in just four or five weeks, first using it to organi",
        "id": 2599652,
        "language": null,
        "link": "https://slashdot.org/story/25/05/05/0234215/after-reddit-thread-on-chatgpt-induced-psychosis-openai-rolls-back-gpt4o-update?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After Reddit Thread on 'ChatGPT-Induced Psychosis', OpenAI Rolls Back GPT4o Update",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T03:03:31.346261+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T03:03:31+00:00",
        "description": "As May the 4th transforms into Star Wars Day, dozens of sites and games have found ways to celebrate. The official Star Wars channel on YouTube released a celebratory video. Disney+ released Tales of the Underworld , a six-part animated series about bounty hunters during the reign of the Empire. And Friday the first two episodes began streaming in Fortnite in a special early premiere on \"Star Wars Watch Party island,\" according to IGN. (Disney acquired a $1.5 billion stake in Epic in March 2024, they note, \"positioning itself to collaborate with the game developer for many years to come.\" One example from StarWars.com:\n\nIntroducing the GALACTIC BATTLE Season: the largest crossover yet between Fortnite Battle Royale and Star Wars. Strap into a TIE fighter or X-wing and take to the skies over new locations like the First Order Base where you can take on Captain Phasma and her legion of stormtroopers. Players can expect new gameplay updates to drop every week throughout the season, inclu",
        "id": 2599435,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/05/0150219/star-wars-day-celebrations-hit-fortnite-disney-xcom---and-retailers-everywhere?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Star Wars Day' Celebrations Hit Fortnite, Disney+, X.com - and Retailers Everywhere",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-05T00:54:32.402456+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-05T00:54:31+00:00",
        "description": "Did you know there's an initiative to drive Open Source adoption both within the United Nations &mdash; and globally? Launched in March, it's the work of the Digital Technology Network (under the UN's chief executive board) which \"works to advance open source technologies throughout UN agencies,\" promoting \"collaboration and scalable solutions to support the UN's digital transformation.\" Fun fact: The first group to endorse the initiative's principles was the Open Source Initiative... \n\n\"The Open Source Initiative applauds the United Nations for recognizing the growing importance of Open Source in solving global challenges and building sustainable solutions, and we are honored to be the first to endorse the UN Open Source Principles,\" said Stefano Maffulli, executive director of OSI.\n \nBut that's just the beginining, writes It's FOSS News:\n\nAs part of the UN Open Source Principles initiative, the UN has invited other organizations to support and officially endorse these principles. To",
        "id": 2599045,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/04/2350224/the-un-ditches-google-for-form-submissions-opts-for-open-source-cryptpad-instead?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The UN Ditches Google for Form Submissions, Opts for Open Source 'CryptPad' Instead",
        "vote": 0
    }
]