[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T23:39:30.417038+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T23:20:00+00:00",
        "description": "Google DeepMind's new \"nano banana\" model (officially named Gemini 2.5 Flash Image) has taken the top spot on AI image-editing leaderboards by delivering far more consistent edits than before. It's being rolled out to the Gemini app today. Ars Technica has the details: AI image editing allows you to modify images with a prompt rather than mucking around in Photoshop. Google first provided editing capabilities in Gemini earlier this year, and the model was more than competent out of the gate. But like all generative systems, the non-deterministic nature meant that elements of the image would often change in unpredictable ways. Google says nano banana (technically Gemini 2.5 Flash Image) has unrivaled consistency across edits -- it can actually remember the details instead of rolling the dice every time you make a change.\n \nThis unlocks several interesting uses for AI image editing. Google suggests uploading a photo of a person and changing their style or attire. For example, you can re",
        "id": 3426444,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/26/215246/google-improves-gemini-ai-image-editing-with-nano-banana-model?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Improves Gemini AI Image Editing With 'Nano Banana' Model",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T23:39:30.534959+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T22:40:00+00:00",
        "description": "Dish's parent company EchoStar is selling $23 billion worth of 5G spectrum licenses to AT&amp;T and shifting Boost Mobile onto AT&amp;T and T-Mobile networks, effectively abandoning its bid to become the fourth major U.S. wireless carrier. The Verge reports: As part of T-Mobile's deal to acquire Sprint in 2019, the Department of Justice stipulated that another company must replace it as the fourth major wireless carrier. Dish came forward to acquire Boost Mobile from Sprint, paying $1.4 billion to purchase the budget carrier and other prepaid assets. Since then, Dish has spent billions acquiring spectrum to build out its own 5G network, which the company said was close to reaching 80 percent of the US population as of last year, in line with the Federal Communications Commission's deadline to meet certain coverage requirements.\n \nBut Dish struggled to repay mounting debt, leading it to rejoin EchoStar, the company it originally spun off from in 2008. And at the same time, it came unde",
        "id": 3426445,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/08/26/2052237/dish-gives-up-on-becoming-the-fourth-major-wireless-carrier?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dish Gives Up On Becoming the Fourth Major Wireless Carrier",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T22:34:46.375827+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: A German court has told Apple to stop advertising its Watches as being carbon-neutral, ruling that this was misleading and could not fly under the country's competition law. Apple has been marketing its newest smartwatches as being carbon-neutral for nearly two years now, with an array of rationales. It claims that clean energy for manufacturing, along with greener materials and shipping, lop around three-quarters off the carbon emissions for each model of the Apple Watch. The remaining emissions are offset by the purchase of carbon credits, according to Apple.\n \nDeutsche Umwelthilfe (well, DUH &ndash; that's the acronym), a prominent environmental group, begged to differ on that last point. It applied for an injunction in May and Tuesday's ruling (in German), which will only be published in full later this week, led it to claim victory. The ruling means Apple can't advertise the Watch as a \"CO2-neutral product\" in Germany. [...] ",
        "id": 3426155,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/26/2046239/cupertino-must-stop-calling-apple-watches-carbon-neutral-german-court-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cupertino Must Stop Calling Apple Watches 'Carbon Neutral,' German Court Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T21:29:15.325191+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T21:20:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: Hosting.com has acquired Rocket.net, bringing the fast-growing managed WordPress hosting company under its corporate umbrella. The move gives hosting.com a proven SaaS platform and a strong brand in WordPress hosting, while Rocket.net gains the capital and global reach of a much larger player. Financial details of the deal were not disclosed.\n \nRocket.net will continue to operate under its own name, but it is now part of hosting.com's family of brands. As part of the deal, Rocket.net founder and CEO Ben Gabler has been appointed Chief Product Officer at hosting.com, where he will lead product and software engineering across the entire company. [...] For hosting.com, the acquisition strengthens its ability to serve a wider range of customers. The company, founded in 2019, already operates more than 20 data centers, powers over 3 million websites, and serves 600,000 customers worldwide with a team of 900 employees.\n \nThe Rocket.net platform w",
        "id": 3425688,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/26/2013227/hostingcom-acquires-rocketnet-to-expand-global-wordpress-hosting-business?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hosting.com Acquires Rocket.net To Expand Global WordPress Hosting Business",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T21:29:15.458296+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T20:40:00+00:00",
        "description": "According to The Information, Apple executives have debated acquiring Mistral AI and Perplexity to strengthen its AI capabilities. MacRumors reports: Services chief Eddy Cue is apparently the most vocal advocate of a deal to buy AI firms to bolster the company's offerings. Cue previously supported propositions of Apple acquiring Netflix and Tesla, both of which Apple CEO Tim Cook turned down. Other executives such as software chief Craig Federighi have reportedly been reluctant to acquire AI startups, believing that Apple can build its own AI technology in-house. [...]\n \nApple is said to be hesitant to do a deal, which would likely cost billions of dollars. Apple has rarely spent more than a hundred million dollars on an acquisition, with Beats at $3 billion and Intel's wireless modem business at $1 billion. If a federal ruling ends the $20 billion deal between Apple and Alphabet that makes Google the default search engine on its devices, the company could be compelled to acquire an A",
        "id": 3425689,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/08/26/206247/apple-discussed-buying-mistral-ai-and-perplexity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Discussed Buying Mistral AI and Perplexity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T20:23:07.605145+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T20:02:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Before 16-year-old Adam Raine died by suicide, he had spent months consulting ChatGPT about his plans to end his life. Now, his parents are filing the first known wrongful death lawsuit against OpenAI, The New York Times reports. Many consumer-facing AI chatbots are programmed to activate safety features if a user expresses intent to harm themselves or others. But research has shown that these safeguards are far from foolproof.\n \nIn Raine's case, while using a paid version of ChatGPT-4o, the AI often encouraged him to seek professional help or contact a help line. However, he was able to bypass these guardrails by telling ChatGPT that he was asking about methods of suicide for a fictional story he was writing. OpenAI has addressed these shortcomings on its blog. \"As the world adapts to this new technology, we feel a deep responsibility to help those who need it most,\" the post reads. \"We are continuously improving how our models res",
        "id": 3425194,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/26/1958256/parents-sue-openai-over-chatgpts-role-in-sons-suicide?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Parents Sue OpenAI Over ChatGPT's Role In Son's Suicide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T20:23:07.717735+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T19:25:00+00:00",
        "description": "Anthropic reached a settlement with authors in a high-stakes copyright class action that threatened the AI company with potentially billions of dollars in damages. From a report: In a Tuesday filing in the US Court of Appeals for the Ninth Circuit, both sides asked the court to pause all proceedings while they finalize the deal. The parties signed a binding term sheet on Aug. 25 outlining the core terms of a proposed class settlement to resolve litigation brought by authors. \n\n\"This historic settlement will benefit all class members,\" said the authors' counsel, Justin Nelson of Susman Godfrey LLP. \"We look forward to announcing details of the settlement in the coming weeks.\" The case is one of several copyright actions brought against AI developers in courts around the country. Judge William Alsup of the US District Court for the Northern District of California had allowed the class action to proceed for authors whose books were contained in two pirate databases Anthropic downloaded.<",
        "id": 3425195,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/26/1848219/anthropic-settles-major-ai-copyright-suit-brought-by-authors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Settles Major AI Copyright Suit Brought by Authors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T19:15:33.897650+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T18:45:00+00:00",
        "description": "The Michigan Supreme Court has drawn a firm line around digital privacy, ruling that police cannot use overly broad warrants to comb through every corner of a person's phone. From a report: In People v. Carson, the court found [PDF] that warrants for digital devices must include specific limitations, allowing access only to information directly tied to the suspected crime. Michael Carson became the focus of a theft investigation involving money allegedly taken from a neighbor's safe. Authorities secured a warrant to search his phone, but the document placed no boundaries on what could be examined. \n\nIt permitted access to all data on the device, including messages, photos, contacts, and documents, without any restriction based on time period or relevance. Investigators collected over a thousand pages of information, much of it unrelated to the accusation. The court ruled that this kind of expansive warrant violates the Fourth Amendment, which requires particularity in describing what ",
        "id": 3424648,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/26/1828256/michigan-supreme-court-rules-unrestricted-phone-searches-violate-fourth-amendment?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Michigan Supreme Court Rules Unrestricted Phone Searches Violate Fourth Amendment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T18:10:04.492207+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T18:02:00+00:00",
        "description": "Air pollution from oil and gas causes more than 90,000 premature deaths and sickens hundreds of thousands of people across the US each year, a new study shows, with disproportionately high impacts on communities of color. From a report: More than 10,000 annual pre-term births are attributable to fine particulate matter from oil and gas, the authors found, also linking 216,000 annual childhood-onset asthma cases to the sector's nitrogen dioxide emissions and 1,610 annual lifetime cancer cases to its hazardous air pollutants. The highest number of impacts are seen in California, Texas, New York, Pennsylvania and New Jersey, while the per-capita incidences are highest in New Jersey, Washington DC, New York, California and Maryland.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Air+Pollution+From+Oil+and+Gas+Causes+90%2C000+Premature+US+Deaths+Each+Year%2C+Says+New+Study%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F",
        "id": 3424095,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/26/1750253/air-pollution-from-oil-and-gas-causes-90000-premature-us-deaths-each-year-says-new-study?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Air Pollution From Oil and Gas Causes 90,000 Premature US Deaths Each Year, Says New Study",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T18:10:04.609516+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T17:28:00+00:00",
        "description": "Swiss researchers have determined that fermentation degree controls beer foam stability after seven years of study published in Physics of Fluids. Triple-fermented Belgian beers maintained the longest-lasting foam while single-fermented lagers produced the shortest duration. The team tested six commercial beers including Westmalle Tripel, Tripel Karmeliet, and Swiss lagers Feldschlosschen and Chopfab. \n\nSurface viscosity dominated foam stability in single-fermented beers. Marangoni stresses from surface tension differences stabilized double- and triple-fermented beer foams. Lipid transfer protein 1 underwent progressive denaturation through successive fermentations. Single fermentation produced small round protein particles. Double fermentation created net-like protein structures. Triple fermentation broke proteins into hydrophobic and hydrophilic fragments that function as surfactants. ETH Zurich's Jan Vermant said breweries can now improve foam using these specific mechanisms rather",
        "id": 3424096,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/26/1728256/scientists-unlock-secret-to-thick-stable-beer-foams?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Unlock Secret To Thick, Stable Beer Foams",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T17:04:00.538385+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T16:48:00+00:00",
        "description": "Google has integrated AI-powered language learning capabilities into its Translate app through a beta feature that generates customized lessons using its Gemini AI models. The Practice button allows English speakers to learn Spanish and French while Spanish, French, and Portuguese speakers can practice English. \n\nUsers select their skill level and learning goals to receive tailored scenarios ranging from professional conversations to family interactions. The company also launched live translation for real-time conversations across 70 languages in the US, India, and Mexico. The feature creates AI-generated transcriptions and audio translations but does not replicate users' voices, the company told The Verge.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+is+Building+a+Duolingo+Rival+Into+the+Translate+App%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F26%2F1648258%2F%3Futm_source%3Dtwitter%26utm_medium",
        "id": 3423492,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/26/1648258/google-is-building-a-duolingo-rival-into-the-translate-app?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google is Building a Duolingo Rival Into the Translate App",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T17:04:00.664850+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T16:02:00+00:00",
        "description": "The Document Foundation, which operates the popular open source productivity suite LibreOffice, is positioning the suite's newest release, v25.8, as a strategic asset for digital sovereignty, targeting governments and enterprises seeking independence from foreign software vendors and cloud infrastructure. \n\nThe Document Foundation released the update last week with zero telemetry architecture, full offline capability, and OpenPGP encryption for documents, directly addressing national security concerns about extraterritorial surveillance and software backdoors. The suite requires no internet access for any features and maintains complete transparency through open source code that governments can audit. Government bodies in Germany, Denmark, and France, alongside national ministries in Italy and Brazil, have deployed LibreOffice to meet GDPR compliance, national procurement laws, and IT localization mandates while eliminating unpredictable licensing costs from proprietary vendors. \n\n\"It",
        "id": 3423493,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/26/160253/libreoffice-stakes-claim-as-strategic-sovereignty-tool-for-governments?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LibreOffice Stakes Claim as Strategic Sovereignty Tool For Governments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T16:00:28.391438+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T15:20:00+00:00",
        "description": "French prosecutors have opened an investigation into the Australian video platform Kick over the death of a content creator during a live stream. From a report: Raphael Graven -- also known as Jean Pormanove -- was found dead in a residence near the city of Nice last week. He was known for videos in which he endured apparent violence and humiliation. The Paris prosecutor said the investigation would look into whether Kick knowingly broadcast \"videos of deliberate attacks on personal integrity.\" \n\nThe BBC has approached Kick for comment. A spokesperson for the platform previously said the company was \"urgently reviewing\" the circumstances around Mr Graven's death. The prosecutor's investigation will also seek to determine whether Kick complied with the European Union's Digital Services Act, and the obligation on platforms to notify the authorities if the life or safety of individuals is in question. In a separate announcement, France's minister for digital affairs, Clara Chappaz, said ",
        "id": 3422874,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/26/1438236/video-platform-kick-investigated-over-streamers-death?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Video Platform Kick Investigated Over Streamer's Death",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T14:53:48.827372+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T14:40:00+00:00",
        "description": "AT&amp;T said Tuesday it would buy wireless licenses from EchoStar for $23 billion, after a years-long saga over what the latter would do with its vast spectrum holdings. From a report: EchoStar was reportedly under pressure from regulators and the White House to either start selling its spectrum or potentially lose it. The cash payment is almost three times the size of EchoStar's entire market capitalization. \n\nAT&amp;T said the acquired spectrum covers \"virtually every\" U.S. market, and will let it speed up and expand the deployment of its home wireless Internet service, as well as continue the phase-out of traditional copper phone line service.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AT%26amp%3BT+To+Buy+Wireless+Spectrum+From+EchoStar+For+%2423+Billion+Cash%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F25%2F08%2F26%2F1155219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd",
        "id": 3422285,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/08/26/1155219/att-to-buy-wireless-spectrum-from-echostar-for-23-billion-cash?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AT&amp;T To Buy Wireless Spectrum From EchoStar For $23 Billion Cash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T14:53:48.956539+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T14:00:00+00:00",
        "description": "Entry-level workers in AI-exposed occupations have seen employment drop 13% since late 2022, according to Stanford University research analyzing millions of payroll records. The decline affects software developers, customer service representatives, and administrative assistants aged 22 to 25, while employment for older workers in the same roles continued growing. \n\nThe study [PDF], based on ADP payroll data covering tens of thousands of firms, found the steepest drops in occupations where AI automates tasks rather than augments human capabilities. Among software developers aged 22-25, employment fell nearly 20% from its late 2022 peak. \n\nWorkers in less AI-exposed fields like nursing saw employment growth across all age groups. The research controlled for firm-level effects and other economic factors, isolating AI's impact from broader trends like interest rate changes and pandemic-era hiring patterns.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" hre",
        "id": 3422286,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/26/125251/ai-is-crushing-young-workers-employment-prospects-stanford-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Is Crushing Young Workers' Employment Prospects, Stanford Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T13:48:51.308476+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: AbbVie will buy an experimental depression drug from partner Gilgamesh Pharmaceuticals for up to $1.2 billion, the companies said on Monday, seeking to access a fast-growing market for psychedelic-based treatments. The deal is the latest in the more than $20 billion AbbVie has spent on acquisitions since 2023 for drugs that can drive growth as its flagship rheumatoid arthritis treatment, Humira, lost patent protection. The companies had signed a partnership last year to develop therapies for psychiatric disorders, with privately held Gilgamesh set to receive up to $1.95 billion in option fees and milestone payments. The deals with Gilgamesh, which is also developing treatments for anxiety and post-traumatic stress disorder, also launch AbbVie into the race to develop psychedelic compounds for psychiatric conditions -- a potential $50 billion market, according to Cantor Fitzgerald analyst Josh Schimmer.\n \nThe deal, which includes an upf",
        "id": 3421679,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/26/0410247/abbvie-targets-psychedelic-based-depression-drug-market-with-12-billion-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AbbVie Targets Psychedelic-Based Depression Drug Market With $1.2 Billion Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T10:33:54.956152+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T10:00:00+00:00",
        "description": "Amazon is facing a proposed class action lawsuit alleging it misleads customers by advertising digital movies and TV shows as \"purchases,\" when in reality buyers only receive revocable licenses that can disappear if Amazon loses distribution rights. From the Hollywood Reporter: On Friday, a proposed class action was filed in Washington federal court against Amazon over a \"bait and switch\" in which the company allegedly misleads consumers into believing they've purchased content when they're only getting a license to watch, which can be revoked at any time. [...] The lawsuit accuses Amazon, which didn't respond to a request for comment, of misrepresenting the nature of movie and TV transactions during the purchase process. On its website and platform, the company tells consumers they can \"buy\" a movie. But hidden in a footnote on the confirmation page is fine print that says, \"You receive a license to the video and you agree to our terms,\" the complaint says.\n \nThe issue is already bef",
        "id": 3420244,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/26/0354217/class-action-lawsuit-targets-movie-ownership?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Class Action Lawsuit Targets Movie Ownership",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T07:18:54.048027+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T07:00:00+00:00",
        "description": "Russia's new Soyuz-5 rocket is set for a December debut as Moscow seeks to end reliance on Ukrainian technology and replace its aging Proton-M fleet. Ars Technica reports: According to the report, translated for Ars by Rob Mitchell, the debut launch of Soyuz-5 will mark the first of several demonstration flights, with full operational service not expected to begin until 2028. It will launch from the Baikonur spaceport in Kazakhstan. From an innovation standpoint, the Soyuz-5 vehicle does not stand out. It has been a decade in the making and is fully expendable, unlike a lot of newer medium-lift rockets coming online in the next several years. However, for Russia, this is an important advancement because it seeks to break some of the country's dependency on Ukraine for launch technology.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=With+a+New+Soyuz+Rocket%2C+Russia+Seeks+to+Break+Its+Ukrainian+Dependency%3A+https%3",
        "id": 3419134,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/26/041247/with-a-new-soyuz-rocket-russia-seeks-to-break-its-ukrainian-dependency?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "With a New Soyuz Rocket, Russia Seeks to Break Its Ukrainian Dependency",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T06:13:36.614131+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T06:00:00+00:00",
        "description": "Two of Japan's largest media groups are suing AI search engine Perplexity over alleged copyright infringement, joining a growing list of news publishers taking legal action against AI companies using their content. FT: Japanese media group Nikkei, which owns the Financial Times, and the Asahi Shimbun newspaper said in statements on Tuesday that they had jointly filed a lawsuit in Tokyo. The groups join a number of Western media companies taking legal action against Perplexity, which provides answers to questions with sources and citations, using large language models (LLMs) from platforms such as OpenAI and Anthropic. \n\nThe Japanese news providers claim Perplexity has, without permission, \"copied and stored article content from the servers of Nikkei and Asahi\" and ignored a \"technical measure\" designed to prevent this from happening. They claim that Perplexity's answers have given incorrect information attributed to the newspapers' articles, which \"severely damages the credibility of ",
        "id": 3418863,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/26/0553200/japanese-media-groups-sue-ai-search-engine-perplexity-over-alleged-copyright-infringement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japanese Media Groups Sue AI Search Engine Perplexity Over Alleged Copyright Infringement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T04:03:41.930391+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Greenhouse gas reduction is no longer a priority for the US government, but if you're looking for a new vehicle and want to buy something with the lowest life cycle carbon emissions, you're best off looking for a compact with a small battery. That's one of the findings from a group at the University of Michigan of a comprehensive study that calculates the overall cradle-to-grave carbon impact for different types of vehicles, including factors like powertrain options, location (within the country), and use patterns. Even better, they built a tool you can use yourself. The study, published in Environmental Science and Technology, compares internal combustion engine powertrains with hybrid, 35- and 50-mile range plug-in hybrids, and 200-mile, 300-mile, and 400-mile battery electric powertrains across compact and midsize sedans, small and midsize SUVs, and pickup trucks, using a life cycle assessment model developed by Argonne Nationa",
        "id": 3418332,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/25/220258/study-shows-which-vehicles-pollute-the-least-in-every-us-county?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Study Shows Which Vehicles Pollute the Least In Every US County",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-26T00:46:55.715222+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-26T00:20:00+00:00",
        "description": "Farmers Insurance disclosed a breach affecting 1.1 million customers after attackers exploited Salesforce in a widespread campaign involving ShinyHunters and allied groups. According to BleepingComputer, the hackers stole personal data such as names, birth dates, driver's license numbers, and partial Social Security numbers. From the report: The company disclosed the data breach in an advisory on its website, saying that its database at a third-party vendor was breached on May 29, 2025. \"On May 30, 2025, one of Farmers' third-party vendors alerted Farmers to suspicious activity involving an unauthorized actor accessing one of the vendor's databases containing Farmers customer information (the \"Incident\"),\" reads the data breach notification (PDF) on its website. \"The third-party vendor had monitoring tools in place, which allowed the vendor to quickly detect the activity and take appropriate containment measures, including blocking the unauthorized actor. After learning of the activit",
        "id": 3417555,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/25/2154254/farmers-insurance-data-breach-impacts-11-million-people-after-salesforce-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Farmers Insurance Data Breach Impacts 1.1 Million People After Salesforce Attack",
        "vote": 0
    }
]