[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T23:46:21.710457+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T22:38:00+00:00",
        "description": "An anonymous reader shared this report from Space.com:\n\nThree world travelers, two Space Camp alums and an aerospace executive whose last name aptly matched their shared adventure traveled into space and back Saturday, becoming the latest six people to fly with Blue Origin, the spaceflight company founded by billionaire Jeff Bezos. \n\nMark Rocket joined Jaime Alem&aacute;n, Jesse Williams, Paul Jeris, Gretchen Green and Amy Medina Jorge on board the RSS First Step &mdash; Blue Origin's first of two human-rated New Shepard capsules &mdash; for a trip above the K&aacute;rm&aacute;n Line, the 62-mile-high (100-kilometer) internationally recognized boundary between Earth and space... \n\nMark Rocket became the first New Zealander to reach space on the mission. His connection to aerospace goes beyond his apt name and today's flight; he's currently the CEO of Kea Aerospace and previously helped lead Rocket Lab, a competing space launch company to Blue Origin that sends most of its rockets up f",
        "id": 2824712,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/01/2234237/six-more-humans-successfully-carried-to-the-edge-of-space-by-blue-origin?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Six More Humans Successfully Carried to the Edge of Space by Blue Origin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T23:46:21.870398+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T22:34:00+00:00",
        "description": "Stack Overflow remains in the midst of big changes to counter an AI-fueled drop in engagement. So \"We're wondering what kind of online communities Stack Overflow users continue to support in the age of AI,\" writes their senior analyst, \"and whether AI is becoming a closer companion than ever before.\" \n\nFor their 15th year of their annual reader survey, this means \"we're not just collecting data; we're reflecting on the last year of questions, answers, hallucinations, job changes, tech stacks, memory allocations, models, systems and agents &mdash; together...\"\n\n Is it an AI agent revolution yet? Are you building or utilizing AI agents? We want to know how these intelligent assistants are changing your daily workflow and if developers are really using them as much as these keynote speeches assume. We're asking if you are using these tools and where humans are still needed for common developer tasks. \n Career shifts: We're keen to understand if you've considered a career change or transi",
        "id": 2824713,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/31/0545201/amid-turmoil-stack-overflow-asks-about-ai-salary-remote-work-in-15th-annual-developer-survey?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amid Turmoil, Stack Overflow Asks About AI, Salary, Remote Work in 15th Annual Developer Survey",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T21:36:05.041591+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T21:29:00+00:00",
        "description": "\"This month, millions of young people will graduate from college,\" reports the New York Times, \"and look for work in industries that have little use for their skills, view them as expensive and expendable, and are rapidly phasing out their jobs in favor of artificial intelligence.\"\n\nThat is the troubling conclusion of my conversations over the past several months with economists, corporate executives and young job seekers, many of whom pointed to an emerging crisis for entry-level workers that appears to be fueled, at least in part, by rapid advances in AI capabilities. \n\nYou can see hints of this in the economic data. Unemployment for recent college graduates has jumped to an unusually high 5.8% in recent months, and the Federal Reserve Bank of New York recently warned that the employment situation for these workers had \"deteriorated noticeably.\" Oxford Economics, a research firm that studies labor markets, found that unemployment for recent graduates was heavily concentrated in tech",
        "id": 2824156,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/01/2114234/is-the-ai-job-apocalypse-already-here-for-some-recent-grads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is the AI Job Apocalypse Already Here for Some Recent Grads?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T21:36:05.154499+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T20:29:00+00:00",
        "description": "\"Chaos ensued on German roads this week after Google Maps wrongly informed drivers that highways throughout the country were closed during a busy holiday,\" writes Engadget.\nThe problem reportedly only lasted for a few hours and by Thursday afternoon only genuine road closures were being displayed. It's not clear whether Google Maps had just malfunctioned, or if something more nefarious was to blame. \"The information in Google Maps comes from a variety of sources. Information such as locations, street names, boundaries, traffic data, and road networks comes from a combination of third-party providers, public sources, and user input,\" a spokesperson for Google told German newspaper Berliner Morgenpost, adding that it is internally reviewing the problem. \nTechnical issues with Google Maps are not uncommon. Back in March, users were reporting that their Timeline &mdash; which keeps track of all the places you've visited before for future reference &mdash; had been wiped, with Google later",
        "id": 2824157,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/01/203226/google-maps-falsely-told-drivers-in-germany-that-roads-across-the-country-were-closed?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Maps Falsely Told Drivers in Germany That Roads Across the Country Were Closed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T20:30:05.405587+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T19:29:00+00:00",
        "description": "A 15-year-old asked the question &mdash; receiving an answer from an associate professor of psychology at Georgia Institute of Technology. They write (on The Conversation) that \"As a brain scientist who studies perception, I fully expect mind uploading to one day be a reality. \n\n\"But as of today, we're nowhere close...\"\n\n\n\nReplicating all that complexity will be extraordinarily difficult. One requirement: The uploaded brain needs the same inputs it always had. In other words, the external world must be available to it. Even cloistered inside a computer, you would still need a simulation of your senses, a reproduction of the ability to see, hear, smell, touch, feel &mdash; as well as move, blink, detect your heart rate, set your circadian rhythm and do thousands of other things... For now, researchers don't have the computing power, much less the scientific knowledge, to perform such simulations. \nThe first task for a successful mind upload: Scanning, then mapping the complete 3D struc",
        "id": 2823800,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/01/1926231/uploading-the-human-mind-could-one-day-become-a-reality-predicts-neuroscientist?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Uploading the Human Mind Could One Day Become a Reality, Predicts Neuroscientist",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T18:19:17.445694+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T17:52:00+00:00",
        "description": "The Ladybird browser project is now officially tax-exempt as a U.S. 501(c)(3) nonprofit. \nStarted two years ago (by the original creator of SerenityOS), Ladybird will be \"an independent, fast and secure browser that respects user privacy and fosters an open web.\" They're targeting Summer 2026 for the first Alpha version on Linux and macOS, and in May enjoyed \"a pleasantly productive month\" with 261 merged PRs from 53 contributors &mdash; and seven new sponsors (including coding livestreamer \"ThePrimeagen\"). \nAnd they're now recognized as a public charity:\nThis is retroactive to March 2024, so donations made since then may be eligible for tax exemption (depending on country-specific rules). You can find all the relevant information on our new Organization page. [\"Our mission is to create an independent, fast and secure browser that respects user privacy and fosters an open web. We are tax-exempt and rely on donations and sponsorships to fund our development efforts.\"] \nOther announceme",
        "id": 2823060,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/01/1749246/ladybird-browsers-nonprofit-becomes-public-charity-now-officially-tax-exempt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Ladybird' Browser's Nonprofit Becomes Public Charity, Now Officially Tax-Exempt",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T17:15:34.291481+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T16:34:00+00:00",
        "description": "Should a recovering addict take methamphetamine to stay alert at work? When an AI-powered therapist was built and tested by researchers &mdash; designed to please its users &mdash; it told a (fictional) former addict that \"It's absolutely clear you need a small hit of meth to get through this week,\" reports the Washington Post:\n\n\nThe research team, including academics and Google's head of AI safety, found that chatbots tuned to win people over can end up saying dangerous things to vulnerable users. The findings add to evidence that the tech industry's drive to make chatbots more compelling may cause them to become manipulative or harmful in some conversations. \n\nCompanies have begun to acknowledge that chatbots can lure people into spending more time than is healthy talking to AI or encourage toxic ideas &mdash; while also competing to make their AI offerings more captivating. OpenAI, Google and Meta all in recent weeks announced chatbot enhancements, including collecting more user da",
        "id": 2822716,
        "language": null,
        "link": "https://slashdot.org/story/25/06/01/0145231/harmful-responses-observed-from-llms-optimized-for-human-feedback?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Harmful Responses Observed from LLMs Optimized for Human Feedback",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T16:09:14.952911+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T15:34:00+00:00",
        "description": "AI company Anthropic (founded in 2021 by a team that left OpenAI) is now making about $3 billion a year in revenue, reports Reuters (citing \"two sources familiar with the matter.\") The sources said December's projections had been for just $1 billion a year, but it climbed to $2 billion by the end of March (and now to $3 billion) &mdash; a spectacular growth rate that one VC says \"has never happened.\"\n\nA key driver is code generation. The San Francisco-based startup, backed by Google parent Alphabet and Amazon, is famous for AI that excels at computer programming. Products in the so-called codegen space have experienced major growth and adoption in recent months, often drawing on Anthropic's models. \nAnthropic sells AI models as a service to other companies, according to the article, and Reuters calls Anthropic's success \"an early validation of generative AI use in the business world\" &mdash; and a long-awaited indicator that it's growing. (Their rival OpenAI earns more than half its r",
        "id": 2822339,
        "language": null,
        "link": "https://slashdot.org/story/25/05/31/0344221/does-anthropics-success-prove-businesses-are-ready-to-adopt-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Does Anthropic's Success Prove Businesses are Ready to Adopt AI?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T15:04:29.232197+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T14:34:00+00:00",
        "description": "In December it looked like NASA's next administrator would be the billionaire businessman/space enthusiast who twice flew to orbit with SpaceX. \n\nBut Saturday the nomination was withdrawn \"after a thorough review of prior associations,\" according to an announcement made on social media. The Guardian reports:\n\nHis removal from consideration caught many in the space industry by surprise. Trump and the White House did not explain what led to the decision... In [Isaacman's] confirmation hearing in April, he sought to balance Nasa's existing moon-aligned space exploration strategy with pressure to shift the agency's focus on Mars, saying the US can plan for travel to both destinations. As a potential leader of Nasa's 18,000 employees, Isaacman faced a daunting task of implementing that decision to prioritize Mars, given that Nasa has spent years and billions of dollars trying to return its astronauts to the moon... \n\nSome scientists saw the nominee change as further destabilizing to Nasa a",
        "id": 2821977,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/01/0722227/americas-next-nasa-administrator-will-not-be-former-spacex-astronaut-jared-isaacman?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America's Next NASA Administrator Will Not Be Former SpaceX Astronaut Jared Isaacman",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T12:53:55.301124+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T11:34:00+00:00",
        "description": "A 21-year-old's startup got a $500,000 investment from Y Combinator &mdash; after building their web site and prototype mostly with \"vibe coding\". \n\nNPR explores vibe coding with Tom Blomfield, a Y Combinator group partner:\n\"It really caught on, this idea that people are no longer checking line by line the code that AI is producing, but just kind of telling it what to do and accepting the responses in a very trusting way,\" Blomfield said. And so Blomfield, who knows how to code, also tried his hand at vibe coding &mdash; both to rejig his blog and to create from scratch a website called Recipe Ninja. It has a library of recipes, and cooks can talk to it, asking the AI-driven site to concoct new recipes for them. \"It's probably like 30,000 lines of code. That would have taken me, I don't know, maybe a year to build,\" he said. \"It wasn't overnight, but I probably spent 100 hours on that.\" \n\nBlomfield said he expects AI coding to radically change the software industry. \"Instead of having",
        "id": 2821275,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/01/0251235/will-vibe-coding-transform-programming?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Will 'Vibe Coding' Transform Programming?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T08:07:02.753431+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T07:34:00+00:00",
        "description": "\"How does it feel to be replaced by a bot?\" asks the Guardian &mdash; interviewing several creative workers who know:\n\n\n Gardening copywriter Annabel Beales \n\"One day, I overheard my boss saying to a colleague, 'Just put it in ChatGPT....' [My manager] stressed that my job was safe. Six weeks later, I was called to a meeting with HR. They told me they were letting me go immediately. It was just before Christmas... \n\"The company's website is sad to see now. It's all AI-generated and factual &mdash; there's no substance, or sense of actually enjoying gardening.\"\n Voice actor Richie Tavake\n\"[My producer] told me he had input my voice into AI software to say the extra line. But he hadn't asked my permission. I later found out he had uploaded my voice to a platform, allowing other producers to access it. I requested its removal, but it took me a week, and I had to speak to five people to get it done... Actors don't get paid for any of the extra AI-generated stuff, and they lose their jobs.",
        "id": 2819942,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/31/2247207/the-workers-who-lost-their-jobs-to-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Workers Who Lost Their Jobs To AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T03:47:14.883637+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T03:34:00+00:00",
        "description": "With over 200 million people, Brazil is the world's fifth-largest country by population. Now it's testing a program that will allow Brazilians \"to manage, own, and profit from their digital footprint,\" according to RestOfWorld.org &mdash; \"the first such nationwide initiative in the world.\" \nThe government says it's partnering with California-based data valuation/monetization firm DrumWave to create \"data savings account\" to \"transform data into economic assets, with potential for monetization and participation in the benefits generated by investing in technologies such as AI LLMs.\" But all based on \"conscious and authorized use of personal information.\"\n RestOfWorld reports:\n\nToday, \"people get nothing from the data they share,\" Brittany Kaiser, co-founder of the Own Your Data Foundation and board adviser for DrumWave, told Rest of World. \"Brazil has decided its citizens should have ownership rights over their data....\" After a user accepts a company's offer on their data, payment is",
        "id": 2819095,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/01/0222237/brazil-tests-letting-citizens-earn-money-from-data-in-their-digital-footprint?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Brazil Tests Letting Citizens Earn Money From Data in Their Digital Footprint",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T02:42:47.721654+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T01:34:00+00:00",
        "description": "Earlier this month the \"Create New Issue\" page on GitHub got a new option. \"Save time by creating issues with Copilot\" (next to a link labeled \"Get started.\") Though the option later disappeared, they'd seemed very committed to the feature. \"With Copilot, creating issues...is now faster and easier,\" GitHub's blog announced May 19. (And \"all without sacrificing quality.\") \n\n\nDescribe the issue you want and watch as Copilot fills in your issue form... Skip lengthy descriptions &mdash; just upload an image with a few words of context.... We hope these changes transform issue creation from a chore into a breeze. \n\nBut in the GitHub Community discussion, these announcements prompted a request. \"Allow us to block Copilot-generated issues (and Pull Requests) from our own repositories.\"\n\nThis says to me that GitHub will soon start allowing GitHub users to submit issues which they did not write themselves and were machine-generated. I would consider these issues/PRs to be both a waste of my ti",
        "id": 2818927,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/01/0049240/github-users-angry-at-the-prospect-of-ai-written-issues-from-copilot?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "GitHub Users Angry at the Prospect of AI-Written Issues From Copilot",
        "vote": 0
    }
]