[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T16:24:57.500699+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T15:30:21+00:00",
        "description": "Thematic, narrative, and mechanical similarities imbue both Death Stranding 2: On the Beach and Metal Gear Solid. The latter is Hideo Kojima’s marquee series which continually reinvented itself along with the stealth-action genre. \n\nThrow in a load of highly conceptual subject matter played through the eyes of emotionally detailed characters and there’s high reason why fans of the series have been lamenting the lack of Metal Gear Solid 6 since Kojima’s acrimonious split from Konami in 2015. \n\nOn the horizon is a remake of arguably the series’ best, Metal Gear Solid Delta: Snake Eater, but before that Death Stranding 2 looks like the Metal Gear game Kojima has always wanted to make. On the nose aesthetic similarities aside, Death Stranding 2 explores the creative mind of Kojima in a very Metal Gear way, and it might just turn into the best Metal Gear Solid game the producer has ever made.",
        "id": 2822414,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oD1Y_fm7bzs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oD1Y_fm7bzs/hqdefault.jpg",
        "title": "I Didn’t Know Death Stranding 2 Was The Metal Gear Game I Was Waiting For Before The MGS3 Remake",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-01T14:14:45.265653+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-01T14:01:12+00:00",
        "description": "The Nintendo Switch 2's launch is literally right around the corner, and as you would expect on the eve of a new Nintendo console's release, the excitement is palpable. \n\nObviously, the fact that the Switch 2 is an iterative upgrade and, as such, a much more familiar piece of machinery than its predecessor means the mood surrounding it is a little more subdued in comparison, but at the end of the day, the fact remains that a next-gen Nintendo console is almost at our doorstep, for which we're more than a little excited. \n\nIn the lead-up to its release, we've already spoken about it and covered some of its most crucial details and tidbits, but there's still plenty much left to talk about- and so, here, that's exactly what we're going to do.",
        "id": 2821677,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oUA2-n5hzEU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oUA2-n5hzEU/hqdefault.jpg",
        "title": "Nintendo Switch 2 - 15 MORE NEW Details You Need To Know Before You Purchase",
        "vote": 0
    }
]