[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T15:30:09+00:00",
        "description": "BLEACH, the legendary anime series, celebrated its 20th anniversary in 2024, and with the hotly anticipated culmination of its Thousand-Year Blood War story arc soon to be broadcast, Bandai Namco have perfectly timed the next video game adaption, the first in over a decade. \n\nBLEACH Rebirth of Souls is a furious, visually awestriking, 1v1 fighter, in the same vein as contemporary anime fighters such as Dragon Ball: Sparking! Zero but with enough distinction and complexity beyond the series’ beloved cast of characters to stand tall on its own.\n\nStrategic, rewarding action awaits those with the skills to master BLEACH Rebirth of Souls’ multi-faceted combat, with unlockable powers, dynamic swordplay, and the ability to turn to tide of battle the rewards. Coming Friday 21st March to PS4, PS5, Xbox Series X|S, and PC via Steam.",
        "id": 2335143,
        "language": null,
        "link": "https://www.youtube.com/watch?v=E8l2DRf_OzU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/E8l2DRf_OzU/hqdefault.jpg",
        "title": "BLEACH Rebirth of Souls - 15 Things You Need To Know BEFORE YOU BUY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T09:30:16+00:00",
        "description": "Every video game has the potential for greatness, even if the premise, gameplay, visuals and whatnot aren't for everyone. However, you may never know this without first getting past the opening. And for every amazing title out there, you must slog through the initial hours to get to the good stuff.\n\nWhether it's a sequel like Like a Dragon: Infinite Wealth that spends too much time catching up with the previous game's characters, the non-interactive opening and lack of fun gameplay tools in Watch_Dogs, or the agonizing handholding and tutorialization of Pokemon Sun and Moon, some games really demand the most of your patience.\n\nFortunately, they tend to pay off or at least showcase why you shouldn't judge a game by the first hour. Check out 12 such video games here and what made their openings such a chore to get through",
        "id": 2333590,
        "language": null,
        "link": "https://www.youtube.com/watch?v=jqls4arc9U0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jqls4arc9U0/hqdefault.jpg",
        "title": "12 Great Single Player Games Where The OPENING HOUR WAS A COMPLETE PAIN",
        "vote": 0
    }
]