[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T23:27:19+00:00",
        "description": "Intel's stock jumped nearly 19% this week. \"However, in the past year through Wednesday's close, Intel stock had fallen 53%,\" notes Investor's Business Daily:\n\n\nThe appointment of Lip-Bu Tan as CEO is a \"good start\" but Intel has significant challenges, Morgan Stanley analyst Joseph Moore said in a client note. Those challenges include delays in its server chip product line, a very competitive PC chip market, lack of a compelling AI chip offering, and over $10 billion in losses in its foundry business over the past 12 months. There is \"no quick fix\" for those issues, he said. \n\n\"There are things you can do,\" a Columbia business school associate professor tells the Wall Street Journal in a video interview, \"but it's going to be incremental, and it's going to be extremely risky... They will try to be competitive in the foundry manufacturing space,\" but \"It takes very aggressive investments.\" \n\nMeanwhile, TSMC is exploring a joint venture where they'd operate Intel's factories, even pit",
        "id": 2337251,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/16/2226230/intels-stock-jumps-188---but-whats-in-its-future?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel's Stock Jumps 18.8% - But What's In Its Future?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T22:22:45+00:00",
        "description": "Long-time Slashdot reader theodp writes: Wall Street Journal K-12 education reporter Matt Barnum has a heads-up for parents: There's a Good Chance Your Kid Uses AI to Cheat. Barnum writes: \"A high-school senior from New Jersey doesn't want the world to know that she cheated her way through English, math and history classes last year. Yet her experience, which the 17-year-old told The Wall Street Journal with her parent's permission, shows how generative AI has rooted in America's education system, allowing a generation of students to outsource their schoolwork to software with access to the world's knowledge. [...] The New Jersey student told the Journal why she used AI for dozens of assignments last year: Work was boring or difficult. She wanted a better grade. A few times, she procrastinated and ran out of time to complete assignments. The student turned to OpenAI's ChatGPT and Google's Gemini, to help spawn ideas and review concepts, which many teachers allow. More often, though, ",
        "id": 2337006,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/16/2119235/theres-a-good-chance-your-kid-uses-ai-to-cheat?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'There's a Good Chance Your Kid Uses AI To Cheat'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T20:14:43+00:00",
        "description": "America's Vice President \"expressed confidence Friday that a deal to sell TikTok and keep the social media app running in the U.S. would largely be in place by an April deadline,\" reports NBC News. (Specifically the Vice President said \"There will almost certainly be a high-level agreement that I think satisfies our national security concerns, allows there to be a distinct American TikTok enterprise.\") \n\nThe article adds that TikTok owner ByteDance \"has not publicly confirmed negotiations with any potential U.S. buyer, nor has it confirmed its willingness to sell TikTok to a U.S. bidder.\" But ByteDance \"favors\" a deal with Oracle, according to an X.com post on Thursday from tech-publication The Information. \n\nAnd today Politico adds that Oracle \"is accelerating talks with the White House on a deal to run TikTok, though significant concerns remain about what role the app's Chinese founders will play in its ongoing U.S. operation, according to three people familiar with the discussions",
        "id": 2336450,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/16/1957214/is-oracle-closer-to-running-tiktok?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is Oracle Closer to Running TikTok?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T19:09:04+00:00",
        "description": "After Meta convinced an arbitrator to temporarily prevent a whistleblower from promoting their book about the company, the book climbed to the top of Amazon's best-seller list. And the book's publisher Macmillan released a defiant statement that \"The arbitration order has no impact on Macmillan... We will absolutely continue to support and promote it.\" (They added that they were \"appalled by Meta's tactics to silence our author through the use of a non-disparagement clause in a severance agreement.\") \nSaturday the controversy was even covered by Rolling Stone:\n\n[Whistleblower Sarah] Wynn-Williams is a diplomat, policy expert, and international lawyer, with previous roles including serving as the Chief Negotiator for the United Nations on biosafety liability, according to her bio on the World Economic Forum... \nSince the book's announcement, Meta has forcefully responded to the book's allegations in a statement... \"Eight years ago, Sarah Wynn-Williams was fired for poor performance an",
        "id": 2336129,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/16/1836242/after-meta-blocks-whistleblowers-book-promotion-it-becomes-an-amazon-bestseller?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After Meta Blocks Whistleblower's Book Promotion, It Becomes an Amazon Bestseller",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T16:59:11+00:00",
        "description": "\"The number of discrete GPU developers from the U.S. and Western Europe shrank to three companies in 2025,\" notes Tom's Hardware, \"from around 10 in 2000.\" (Nvidia, AMD, and Intel...)\nNo company in the recent years &mdash; at least outside of China &mdash; was bold enough to engage into competition against these three contenders, so the very emergence of Bolt Graphics seems like a breakthrough. However, the major focuses of Bolt's Zeus are high-quality rendering for movie and scientific industries as well as high-performance supercomputer simulations. If Zeus delivers on its promises, it could establish itself as a serious alternative for scientific computing, path tracing, and offline rendering. But without strong software support, it risks struggling against dominant market leaders. \n\nThis week the Sunnyvale, California-based startup introduced its Zeus GPU platform designed for gaming, rendering, and supercomputer simulations, according to the article. \"The company says that its Z",
        "id": 2335476,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/16/0221248/startup-claims-its-upcoming-risc-v-isa-zeus-gpu-is-10x-faster-than-nvidias-rtx-5090?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Startup Claims Its Upcoming (RISC-V ISA) Zeus GPU is 10X Faster Than Nvidia's RTX 5090",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T15:54:19+00:00",
        "description": "Slashdot reader rikfarrow summarizes an article they wrote for Usenix.org about the Open Source Python compiler Codon:\n\n In 2023 I tried out Codon. At the time I had difficulty compiling the scripts I most commonly used, but was excited by the prospect. Python is essentially single threaded and checks the shape (type) of each variable as it interprets scripts. Codon fixes types and compiles Python into compact, executable binaries that execute much faster. \n\nSeveral things have changed with their latest release: I have successful compiles, the committers have added a compiled version of NumPy (high performance math algorithms), and changed their open source license to Apache 2. \n\n\"The other big news is that Exaloop, the company that is behind Codon, has changed their license to Apache 2...\" according to the article, so \"commercial use and derivations of Codon are now permitted without licensing.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"ht",
        "id": 2335123,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/16/003225/codon-python-compiler-gets-faster---and-changes-to-apache-2-license?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Codon Python Compiler Gets Faster - and Changes to Apache 2 License",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T14:49:06+00:00",
        "description": "A ransomware-as-a-service variant called \"Medusa\" has claimed over 300 victims in \"critical infrastructure sectors\" (including medical), according to an joint alert from CISA, the FBI, and the Multi-State Information Sharing Analysis Center. \n\nAnd that alert reminds us that Medusa is a globe-spanning operation that recruits third-party affiliates to plant ransomware and negotiate with victims, notes the Register. \"Even organizations that have good ransomware recovery regimes, meaning they don't need to unscramble encrypted data as they have good backups and fall-back plans, may consider paying to prevent the release of their stolen data, given the unpleasant consequences that follow information leaks.\n\nMedusa actors also set a deadline for victims to pay ransoms and provide a countdown timer that makes it plain when stolen info will be sprayed across the internet. If victims cough up $10,000 in cryptocurrency, the crims push the deadline forward by 24 hours. \n\nThe advisory reveals on",
        "id": 2334771,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/15/2055230/cybersecurity-alert-warns-of-300-attacks-with-medusa-ransomware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cybersecurity Alert Warns of 300 Attacks with 'Medusa' Ransomware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T12:39:03+00:00",
        "description": "The Washington Post reports:\nOceans last year reached their highest levels in three decades &mdash; with the rate of global sea level rise increasing around 35% higher than expected, according to a NASA-led analysis published Thursday... Last year's rate of average global sea level rise was 0.23 inches per year, higher than the expected 0.17 inches per year, NASA said in a news release. \n\nThe rate of global sea level rise follows a trend of rapidly increasing rates over the past 30 years. From 1993 to 2023, the rate of global sea level rise doubled, increasing from 0.08 inches per year to 0.18 inches, another NASA-led study showed. Overall, the global sea level has climbed by 4 inches since 1993. \n\nMore details from ABC News:\n\n Climate change was a major driver to an unexpected level of sea level rise in 2024, according to a new NASA analysis... The majority of the difference between predicted and actual sea level rise was attributed to thermal expansion &mdash; or the ocean waters e",
        "id": 2334159,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/15/0426222/ocean-levels-rise-to-a-30-year-high---and-faster-than-expected?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ocean Levels Rise to a 30-Year High - and Faster Than Expected",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T08:19:01+00:00",
        "description": "\"A new four-lane highway cutting through tens of thousands of acres of protected Amazon rainforest is being built for the COP30 climate summit,\" reports the BBC, \"in the Brazilian city of Bel&eacute;m.\" \nThe highway will ease traffic into the city, which will host over 50,000 people at the conference this November:\nThe state government touts the highway's \"sustainable\" credentials, but some locals and conservationists are outraged at the environmental impact... Along the partially built road, lush rainforest towers on either side &mdash; a reminder of what was once there. Logs are piled high in the cleared land which stretches more than 13km (8 miles) through the rainforest into Bel&eacute;m. \n\nDiggers and machines carve through the forest floor, paving over wetland to surface the road which will cut through a protected area... The road leaves two disconnected areas of protected forest. Scientists are concerned it will fragment the ecosystem and disrupt the movement of wildlife... \n\n",
        "id": 2333093,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/16/0136229/amazon-forest-felled-to-build-road-for-climate-summit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Forest Felled To Build Road For Climate Summit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T03:58:50+00:00",
        "description": "\"Why can't we each have our own AI software that runs locally,\" asks long-time Slashdot reader BrendaEM &mdash; and that doesn't steal the work of others. \n\nImagine a powerful-but-locally-hosted LLM that \"doesn't spy... and no one else owns it.\"\n We download it, from souce-code if you like, install it, if we want. And it assists: us... No one gate-keeps it. It's not out to get us... \n\nAnd this is important: because no one owns it, the AI software is ours and leaks no data anywhere &mdash; to no one, no company, for no political nor financial purpose. No one profits &mdash; but you! \n\nTheir longer original submission also asks a series of related questions &mdash; like why can't we have software without AI? (Along with \"Why is AMD stamping AI on local-processors?\" and \"Should AI be crowned the ultimate hype?\") But this question seems to be at the heart of their concern. \"What future will anyone have if anything they really wanted to do &mdash; could be mimicked and sold by the ill-got",
        "id": 2332439,
        "language": null,
        "link": "https://ask.slashdot.org/story/25/03/16/015209/ask-slashdot-where-are-the-open-source-local-only-ai-solutions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ask Slashdot: Where Are the Open-Source Local-Only AI Solutions?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T01:48:31+00:00",
        "description": "\"For the first time in history, a privately operated lunar lander has captured images of a total eclipse from the Moon's surface,\" reports Daily Galaxy. \n\nWhile the Athena lunar lander tipped over and ended its mission, elsewhere on the moon Firefly Aerospace's Blue Ghost lunar lander \"continues to beam home incredible imagery,\" writes Space.com, and since its landing on March 2 \"has been sending us stunning photos and videos...\" A new video of Blue Ghost's moon-side view captures the eerie red light on the moon (caused by sunlight refracting through the atmosphere over the edges of the earth). \"Blue Ghost turns red!\" Firefly writes on their mission updates page. \n\nA SpaceX photographer also captured the eclipse as it happened over a Falcon 9 rocket waiting to launch to the International Space Station, in a remarkable time-lapse photograph. \n\nAnd Space.com collects more interesting lunar-eclipse photos taken from around the world, including Appin, Scotland; Canberra, Australia; and P",
        "id": 2332079,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/15/2217247/fireflys-athena-lander-watched-fridays-eclipse---from-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Firefly's 'Athena' Lander Watched Friday's Eclipse - from the Moon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-16T00:43:33+00:00",
        "description": "Long-time Slashdot reader BenFenner writes: For the third time in recent memory, CloudFlare has blocked large swaths of niche browsers and their users from accessing web sites that CloudFlare gate-keeps. In the past these issues have been resolved quickly (within a week) and apologies issued with promises to do better. (See 2024-03-11, 2024-07-08, and 2025-01-30.) \n\nThis time around it has been over six weeks and CloudFlare has been unable or unwilling to fix the problem on their end, effectively stalling any progress on the matter with various tactics including asking browser developers to sign overarching NDAs. \n\nThat last link is an update posted today by Pale Moon's main developer:\n\n\n\nOur current situation remains unchanged: CloudFlare is still blocking our access to websites through the challenges, and the captcha/turnstile continues to hang the browser until our watchdog terminates the hung script after which it reloads and hangs again after a short pause (but allowing users to",
        "id": 2331883,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/15/236215/cloudflare-accused-of-blocking-niche-browsers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cloudflare Accused of Blocking Niche Browsers",
        "vote": 0
    }
]