[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T22:12:25+00:00",
        "description": "Twisting two atomically thin sheets of graphene enables \"a host of exceptional properties,\" writes MIT News, \"including unconventional superconductivity.\" (Which makes this graphene \"a promising building block for future quantum-computing devices.\") \n\nAnd now \"We find the superfluid stiffness to be much larger than expected...\" a team of researchers reported this week in Nature. Hackaday explains that \"Part of the problem has been that it is hard to make large pieces of multi-layer graphene. By creating two-ply pieces and using special techniques, an international team is finding that quantum geometry explains how graphene superconductors resist changes in current flow more readily than conventional superconductors.\" \n\n\nOr, as Science Alert puts it, \"Forced to run a labyrinth of carbon atoms uniquely arranged in twisted stacks, electrons do some rather peculiar things.\"\nResearchers from the University of British Columbia in Canada, the University of Washington and Johns Hopkins Unive",
        "id": 2073597,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/08/227213/twisted-graphene-sheets-reveal-unconventional-superconductivity-governed-by-quantum-geometry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Twisted Graphene Sheets Reveal 'Unconventional' Superconductivity Governed by Quantum Geometry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T22:12:25+00:00",
        "description": "An anonymous reader shared this report from the Telegraph:\n\nVolkswagen has teased plans for a \"China-killer\" electric vehicle that will cost just &euro;20,000 ($20,664 USD or &pound;16,700) as the German carmaker gears up to take on a flood of Beijing-backed low-cost rivals. The company on Thursday shared its first images of a new vehicle expected to be called the ID.1, which will go into production from 2027. \n\nThe low-cost EV is intended to go head to head with all-electric brands from Chinese carmakers such as BYD, which overtook Tesla in British sales for the first time last month. Previous images of the vehicle suggest it will be an electric hatchback. Thomas Sch&auml;fer, the VW chief executive, said the new model would be \"an affordable, high-quality, profitable electric Volkswagen from Europe, for Europe\". Quentin Willson, the motoring journalist and founder of FairCharge, said the car could be a \"possible China EV killer\". Dan Caesar, of Electric Vehicles UK, added: \"Cheaper",
        "id": 2073598,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/08/216247/volkswagen-announces-a-cheap-electric-car-to-compete-with-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Volkswagen Announces a Cheap Electric Car to Compete With China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T20:01:29+00:00",
        "description": "The Free Software Foundation \"hinted that it would organize an unprecedented virtual memorabilia auction\" in March to celebrate this year's 40th anniversary, according to an announcement this week. Those hints \"left collectors and free software fans wondering which of the pieces of the FSF's history would be auctioned off.\" \n\nBut Tuesday the FSF \"lifted the veil and gave a sneak peak of some of the more prestigious entries in the memorabilia auction.\"\n\nFirst of all, the memorabilia auction will feature an item that could be especially interesting for art collectors but will certainly also draw the attention of free software fans from all over: the original GNU head drawing by Etienne Suvasa, which became the blueprint for the iconic GNU logo present everywhere in the free software world. \n\nThe list of memorabilia for sale also entails some rare and historic hardware, such as a \"terminus-est\" microcomputer, and an Amiga 3000UX that was used in the FSF's old office at the Massachusetts",
        "id": 2073065,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/08/0853208/the-fsf-will-auction-the-original-gnu-logo-drawing-stallmans-medal-and-an-amiga?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The FSF Will Auction the Original GNU Logo Drawing, Stallman's Medal, and an Amiga",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T18:57:09+00:00",
        "description": "An anonymous Slashdot reader quotes a new article from Ars Technica: On Thursday, mobile security company NowSecure reported that [DeepSeek] sends sensitive data over unencrypted channels, making the data readable to anyone who can monitor the traffic. More sophisticated attackers could also tamper with the data while it's in transit. Apple strongly encourages iPhone and iPad developers to enforce encryption of data sent over the wire using ATS (App Transport Security). For unknown reasons, that protection is globally disabled in the app, NowSecure said. What&#226;(TM)s more, the data is sent to servers that are controlled by ByteDance, the Chinese company that owns TikTok... \n\n[DeepSeek] is \"not equipped or willing to provide basic security protections of your data and identity,\" NowSecure co-founder Andrew Hoog told Ars. \"There are fundamental security practices that are not being observed, either intentionally or unintentionally. In the end, it puts your and your company's data an",
        "id": 2072778,
        "language": null,
        "link": "https://slashdot.org/story/25/02/08/0531202/deepseek-ios-app-sends-data-unencrypted-to-bytedance-controlled-servers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "DeepSeek IOS App Sends Data Unencrypted To ByteDance-Controlled Servers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T17:51:44+00:00",
        "description": "Thursday the White House \"moved to halt a $5 billion initiative to build electric vehicle charging stations,\" reports Politico, \"by instructing states not to spend federal funds previously allocated to them...\" NPR described the move as \"putting in limbo billions of dollars allocated to states with current and future projects...\" \n\n\n\nPolitico notes the move \"appears to upend years of precedent in which federal promises of funds for highway projects had given states an all-but-guaranteed assurance that they were free to spend them. It also raises legal questions... Funding experts had told POLITICO last year that decades of legal precedent would largely insulate the charging money...\n\nAndrew Rogers [deputy administrator of the Federal Highway Administration, or FHWA, in the Biden administration] said in a text message that the new letter \"appears to ignore both the law and multiple restraining orders that have been issued by federal courts.\" Rogers, who is now a senior vice president ",
        "id": 2072432,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/08/0735240/white-house-moves-to-halt-federal-funds-for-ev-charging-stations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "White House Moves to Halt Federal Funds for EV Charging Stations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T16:46:44+00:00",
        "description": "To celebrate 3035's newest arrivals in the public domain, the Internet Archive held a special in-person event at their San Francisco headquarters, as well as a virtual celebration online. (It opens with an absolutely gorgeous rendition of \"Happy Days are Hear Again\" played on a musical saw.) \n\nAnd somewhere in the festivities they announced the winners of this year's annual \"Public Domain Day Film Remix Contest.\"\n\n\nThese remarkable films not only reimagined and transformed public domain works but also demonstrated the boundless potential of remixing creative works to create something new... Explore all 140+ submissions at the 2025 Public Domain Day Film Remix Contest collection at the Internet Archive... \n\n\"The jury was deeply impressed by Queline Meadows's inspired mix of movies, images, music and text woven into a subtle and emotionally affecting video expressing a strong sense of nostalgia and the irretrievable passage of time,\" said film archivist Rick Prelinger... Filmmaker Sama",
        "id": 2072121,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/02/08/0620224/internet-archive-celebrates-new-public-domain-works-with-remixes-in-short-film-contest?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Internet Archive Celebrates New Public Domain Works with Remixes in Short Film Contest",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T15:41:59+00:00",
        "description": "Friday on a Washington Post podcast, their columnists discussed the hybrid/remote work trend, asking why it \"seems to be reversing\".\n\n\nMolly Roberts: Why have some companies decided finally that having offices full of employees is better for them? \n\nHeather Long: It's a loaded question, but I would say, unfortunately, 2025 is the year of operational efficiency, and that's corporate speak for save money at all costs. How do you save money? The easiest way is to get people to quit. What are these return to office mandates, particularly the five day a week in office mandates? We have a lot of data on this now, and it shows people will quit and you don't even have to pay them severance to do it. \n\nMolly Roberts: It's not about productivity for the people who are in the office, then, you think. It's more about just cutting down on the size of the workforce generally. \n\nHeather Long: I do think so. There has been a decent amount of research so far on fully remote, hybrid and fully in offic",
        "id": 2071806,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/08/0539235/are-return-to-office-mandates-just-attempts-to-make-people-to-quit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Are Return-to-Office Mandates Just Attempts to Make People to Quit?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T13:32:55+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: If you watched the 2007 documentary King of Kong or followed the controversy surrounding score-chaser Billy Mitchell, you know all about Donkey Kong's famous kill screen. For over four decades, no one was able to pass the game's 117th screen (aka level 22-1) due to a glitch in the game's bonus timer that kills Mario well before he can reach the top of the stage's girders. That was true until last weekend, when Mario speedrunner Kosmic shared the news that he had passed the kill screen using a combination of frame-perfect emulator inputs, a well-known ladder movement glitch, and a bit of luck. And even though Kosmic's trick is functionally impossible to pull off with human reflexes on real hardware, the method shows how the game's seemingly insurmountable kill screen actually can be overcome without modifying the code on an official Donkey Kong arcade board.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"sla",
        "id": 2071171,
        "language": null,
        "link": "https://games.slashdot.org/story/25/02/08/0758212/donkey-kongs-famed-kill-screen-has-been-cleared-for-the-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Donkey Kong's Famed Kill Screen Has Been Cleared For the First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T10:16:45+00:00",
        "description": "After the powerful solar storm of May 2024, scientists detected two new temporary radiation belts around Earth -- one of which contained something we had never seen before: energetic protons. ScienceAlert reports: \"These are really high-energy electrons and protons that have found their way into Earth's inner magnetic environment,\" says astronomer David Sibeck of NASA's Goddard Space Flight Center, who was not involved with the research. \"Some might stay in this place for a very long time.\" In fact, the belts remained intact for much longer than previous temporary radiation belts generated by solar storms: three months, compared to the weeks we'd normally expect.\n \nSubsequent solar storms in June and August of 2024 knocked most of the particles out of orbit, significantly diminishing the density of the belts. A small amount, however, still remains up there, hanging out with Earth. What's more, the proton belt may remain intact for over a year. Ongoing measurements will help scientist",
        "id": 2070405,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/08/0746221/mysterious-radiation-belts-detected-around-earth-after-epic-solar-storm?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mysterious Radiation Belts Detected Around Earth After Epic Solar Storm",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T08:06:23+00:00",
        "description": "According to Downdetector, PlayStation Network (PSN) has been down since 6 PM ET, with Sony assuring users that they're working to fix the problem \"as soon as possible.\" For gaming specifically, Sony says that \"you might have difficulty launching games, apps, or network features.\"\n \n\"We are aware some users might be currently experiencing issues with PSN,\" Sony said in an 8:46PM ET post on X. No further details were made available.\n \nAn r/PlayStation thread has more than 10,000 comments. As of 11:35 PM PST, the service remains down.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=PlayStation+Network+Suffering+Major+Outage%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F02%2F08%2F0733239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F02%2F08%",
        "id": 2069947,
        "language": null,
        "link": "https://games.slashdot.org/story/25/02/08/0733239/playstation-network-suffering-major-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "PlayStation Network Suffering Major Outage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T03:48:49+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: In today's issue of Nature, a team at Oxford University describes using quantum teleportation to link two pieces of quantum hardware that were located about 2 meters apart, meaning they could easily have been in different rooms entirely. Once linked, the two pieces of hardware could be treated as a single quantum computer, allowing simple algorithms to be performed that involved operations on both sides of the 2-meter gap. [...] The Oxford team was simply interested in a proof-of-concept, and so used an extremely simplified system. Each end of the 2-meter gap had a single trap holding two ions, one strontium and one calcium. The two atoms could be entangled with each other, getting them to operate as a single unit.\n \nThe calcium ion served as a local memory and was used in computations, while the strontium ion served as one of the two ends of the quantum network. An optical cable between the two ion traps allowed photons to entan",
        "id": 2069292,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/07/236248/quantum-teleportation-used-to-distribute-a-calculation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Quantum Teleportation Used To Distribute a Calculation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T02:42:31+00:00",
        "description": "Maine's overwhelmingly popular right-to-repair law is under attack by automakers through lawsuits and lobbying efforts aimed at weakening or delaying enforcement. While the law remains in limbo due to industry influence and legal challenges, broader enforcement issues persist across multiple states, with corporations often ignoring right-to-repair laws despite their legal passage. Techdirt reports: A little over a year ago, Maine residents voted overwhelmingly (83 percent) to pass a new state right to repair law designed to make auto repairs easier and more affordable. More specifically, the law requires that automakers standardize on-board diagnostic systems and provide remote access to those systems and mechanical data to consumers and third-party independent repair shops. But as we've seen with other states that have passed right to reform laws (most notably New York), passing the law isn't the end of the story. Corporate lobbyists have had great success not just watering these la",
        "id": 2069117,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/07/2256236/automakers-sue-to-kill-maines-hugely-popular-right-to-repair-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Automakers Sue To Kill Maine's Hugely Popular 'Right To Repair' Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T01:37:30+00:00",
        "description": "The Register's Thomas Claburn reports: Google's overhaul of Chrome's extension architecture continues to pose problems for developers of ad blockers, content filters, and privacy tools. [...] While Google's desire to improve the security, privacy, and performance of the Chrome extension platform is reasonable, its approach -- which focuses on code and permissions more than human oversight -- remains a work-in-progress that has left extension developers frustrated.\n \nAlexei Miagkov, senior staff technology at the Electronic Frontier Foundation, who oversees the organization's Privacy Badger extension, told The Register, \"Making extensions under MV3 is much harder than making extensions under MV2. That's just a fact. They made things harder to build and more confusing.\" Miagkov said with Privacy Badger the problem has been the slowness with which Google addresses gaps in the MV3 platform. \"It feels like MV3 is here and the web extensions team at Google is in no rush to fix the frayed e",
        "id": 2068902,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/02/07/2246202/googles-7-year-slog-to-improve-chrome-extensions-still-hasnt-satisfied-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's 7-Year Slog To Improve Chrome Extensions Still Hasn't Satisfied Developers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T01:37:30+00:00",
        "description": "OpenAI says it's investigating after a hacker claimed to have stolen login credentials for 20 million OpenAI accounts and advertised the data for sale on a dark web forum. Though security researchers doubt on the legitimacy of the breach, the AI company stated that it takes the claims seriously, advising users to enable two-factor authentication and stay vigilant against phishing attempts. Decrypt reports: Daily Dot reporter Mikael Thalan wrote on X that he found invalid email addresses in the supposed sample data: \"No evidence (suggests) this alleged OpenAI breach is legitimate. At least two addresses were invalid. The user's only other post on the forum is for a stealer log. Thread has since been deleted as well.\"\n \n\"We take these claims seriously,\" the spokesperson said, adding: \"We have not seen any evidence that this is connected to a compromise of OpenAI systems to date.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/ho",
        "id": 2068903,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/07/2236218/openai-investigating-claim-of-20-million-stolen-user-credentials?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Investigating Claim of 20 Million Stolen User Credentials",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T00:31:33+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: Hospital Sisters Health System notified over 882,000 patients that an August 2023 cyberattack led to a data breach that exposed their personal and health information. Established in 1875, HSHS works with over 2,200 physicians and has around 12,000 employees. It also operates a network of physician practices and 15 local hospitals across Illinois and Wisconsin, including two children's hospitals. The non-profit healthcare system said in data breach notifications sent to those impacted that the incident was discovered on August 27, 2023, after detecting that the attacker had gained access to HSHS' network.\n \nAfter the security breach, its systems were also impacted by a widespread outage that took down \"virtually all operating systems\" and phone systems across Illinois and Wisconsin hospitals. HSHS also hired external security experts to investigate the attack, assess its impact, and help its IT team restore affected systems. [",
        "id": 2068550,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/07/2124217/us-health-system-notifies-882000-patients-of-august-2023-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Health System Notifies 882,000 Patients of August 2023 Breach",
        "vote": 0
    }
]