[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T18:30:28+00:00",
        "description": "SCP: Fragmented Minds is a fresh take on the sub-genre of horror games that attempt to adapt their spooks from the SCP Foundation wiki. Rather than once more pitting you against SCP- 173, however, Fragmented Minds instead wants to put you into the shoes of a security personnel; it hands you a weapon and wants you to go deal with the problems. \n\nSadly, the game is plagued with pacing issues that make actually solving the problems you’re supposed to take too long. You’re going to spend a solid hour of the game before anything interesting happens in either the plot, or gameplay, and even then, the most you’re going to be doing is running around and hiding. Thankfully, the roadmap indicates a lot of interesting updates on the horizon, and the game might be worth keeping an eye on for action horror fans.",
        "id": 2072798,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cevXyvKOThc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cevXyvKOThc/hqdefault.jpg",
        "title": "SCP: Fragmented Minds Early Access Review - A Long Way To Go",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T15:30:08+00:00",
        "description": "As Avowed approaches its release, what had initially looked like an underwhelming game has started looking increasingly promising with more elaborate showings, with everything from its setting and choice and consequence mechanics to its combat and more seemingly shaping up nicely. \n\nExcited to get our hands on the game as we are, here, we’re going to discuss all of that and more. Here are five reasons you should be excited for Avowed.",
        "id": 2071821,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QTE2blJYkmU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QTE2blJYkmU/hqdefault.jpg",
        "title": "5 Reasons RPG Fans Should Be Excited For Avowed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-08T09:30:08+00:00",
        "description": "With the lack of information for Grand Theft Auto 6, there isn't much for fans but speculation and, well, more speculation. Take-Two Interactive has chimed in occasionally, stating that it's on track for Fall 2025, but recently things have somewhat changed.\n\nCEO Strauss Zelnick reaffirmed the release window, as usual, while adding that there's always the \"risk of slippage.\" Call it covering their bases, especially with so much hype surrounding the open-world title and the lack of updates. However, having this little bit thrown in on top of the reassurance is interesting.\n\nWhile fans may or may not have been prepared to hear about a delay, especially for titles from Rockstar Games, those words may be the first real indication of a possibility. It ultimately falls on the development team to provide an update, especially after such a long silence. For now, things are looking dicey.",
        "id": 2070414,
        "language": null,
        "link": "https://www.youtube.com/watch?v=LrnmBfIDmi4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LrnmBfIDmi4/hqdefault.jpg",
        "title": "Take Two's Recent Statements About GTA 6 Release Has CONFUSED Gamers",
        "vote": 0
    }
]