[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T23:48:24.271414+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T23:10:00+00:00",
        "description": "Apple's Worldwide Developers Conference 25 (WWDC) kicks off next week, June 9th, showcasing the company's latest software and new technologies. That includes the next version of iOS, which is rumored to have the most significant design overhaul since the introduction of iOS 7. Here's an overview of what to expect: \nMajor Software Redesigns \nApple plans to shift its operating system naming to reflect the release year, moving from sequential numbers to year-based identifiers. Consequently, the upcoming releases will be labeled as iOS 26, macOS 26, watchOS 26, etc., streamlining the versioning across platforms.\n \niOS 26 is anticipated to feature a glossy, glass-like interface inspired by visionOS, incorporating translucent elements and rounded buttons. This design language is expected to extend across iPadOS, macOS, watchOS, and tvOS, promoting a cohesive user experience across devices. Core applications like Phone, Safari, and Camera are slated for significant redesigns, too. For instan",
        "id": 2870265,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/06/2147236/what-to-expect-from-apples-wwdc?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What To Expect From Apple's WWDC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T22:43:24.430841+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T22:30:00+00:00",
        "description": "An anonymous reader quotes a report from OregonLive: Together, the four founders of Beaverton startup AheadComputing spent nearly a century at Intel. They were among Intel's top chip architects, working years in advance to develop new generations of microprocessors to power the computers of the future. Now they're on their own, flying without a net, building a new class of microprocessor on an entirely different architecture from Intel's. Founded a year ago, AheadComputing is trying to prove there's a better way to design computer chips.\n \n\"AheadComputing is doing the biggest, baddest CPU in the world,\" said Debbie Marr, the company's CEO. [...] AheadComputing is betting on an open architecture called RISC-V -- RISC stands for \"reduced instruction set computer.\" The idea is to craft a streamlined microprocessor that works more efficiently by doing fewer things, and doing them better than conventional processors. For AheadComputing's founders and 80 employees, many of them also Intel a",
        "id": 2869826,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/06/2059235/top-researchers-leave-intel-to-build-startup-with-the-biggest-baddest-cpu?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Top Researchers Leave Intel To Build Startup With 'The Biggest, Baddest CPU'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T22:43:24.654513+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T21:50:00+00:00",
        "description": "alternative_right shares a report: New York state lawmakers voted to stop the NYPD's attempt to block its radio communications from the public Thursday, with the bill expected to head to Gov. Kathy Hochul's desk. The \"Keep Police Radio Public Act\" passed both the state Senate and state Assembly, with a sponsor of the legislation arguing the proposal strikes the \"proper balance\" in the battle between transparency and sensitive information.\n \n\"Preserving access to police radio is critical for a free press and to preserve the freedoms and protections afforded by the public availability of this information,\" state Sen. Michael Gianaris (D-Queens) said in a statement. \"As encrypted radio usage grows, my proposal strikes the proper balance between legitimate law enforcement needs and the rights and interests of New Yorkers.\"\n \nThe bill, which was sponsored in the Assembly by lawmaker Karines Reyes (D-Bronx), is meant to make real-time police radio communications accessible to emergency serv",
        "id": 2869827,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/06/2049204/lawmakers-vote-to-stop-nypds-attempt-to-encrypt-their-radios?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lawmakers Vote To Stop NYPD's Attempt To Encrypt Their Radios",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T21:38:23.294538+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T21:10:00+00:00",
        "description": "Mirnotoriety shares a report from the Independent: Downing Street is exploring a proposal to introduce digital ID cards for every adult in Britain in a move to tackle the UK's illegal migration crisis, according to reports. The new \"BritCard\" would be used to check on an individual's right to live and work in Britain, with senior No 10 figures examining the proposal, The Times has reported.\n \nThe card, stored on a smartphone, would reportedly be linked to government records and could check entitlements to benefits and monitor welfare fraud. [...] ... it would cost up to 400 million pounds to build the system and around 10 million pounds a year to administer as a free-to-use phone app.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK+'Exploring+Plan+For+Digital+ID+Cards'%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F06%2F06%2F2041236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/",
        "id": 2869348,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/06/2041236/uk-exploring-plan-for-digital-id-cards?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK 'Exploring Plan For Digital ID Cards'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T21:38:23.562346+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T20:35:00+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: The FBI is warning that the BADBOX 2.0 malware campaign has infected over 1 million home Internet-connected devices, converting consumer electronics into residential proxies that are used for malicious activity. The BADBOX botnet is commonly found on Chinese Android-based smart TVs, streaming boxes, projectors, tablets, and other Internet of Things (IoT) devices. \"The BADBOX 2.0 botnet consists of millions of infected devices and maintains numerous backdoors to proxy services that cyber criminal actors exploit by either selling or providing free access to compromised home networks to be used for various criminal activity,\" warns the FBI.\n \nThese devices come preloaded with the BADBOX 2.0 malware botnet or become infected after installing firmware updates and through malicious Android applications that sneak onto Google Play and third-party app stores. \"Cyber criminals gain unauthorized access to home networks by either configu",
        "id": 2869349,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/06/2033225/fbi-badbox-20-android-malware-infects-millions-of-consumer-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FBI: BadBox 2.0 Android Malware Infects Millions of Consumer Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T20:33:23.667251+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T19:36:00+00:00",
        "description": "Chinese student enrollment at American universities has dropped to 277,000 in the 2023-24 academic year, down from a peak of 372,000 in 2019-20, according to data in a new report examining shifting global education patterns. The decline accelerated following the State Department's May 28th announcement of an \"aggressive\" campaign to revoke visas for Chinese students in \"critical fields\" of science and engineering, as well as those with unspecified Communist Party \"connections.\" \n\nThe trend reflects broader economic and geopolitical pressures beyond visa restrictions. Chinese families increasingly view American education as too expensive amid China's economic downturn and property market decline, while domestic employers have grown suspicious of foreign-educated graduates. Meanwhile, Chinese students are choosing alternatives including Britain, which hosted nearly 150,000 Chinese students in 2023-24, and regional destinations like Japan, where Chinese enrollment increased to 115,000 in",
        "id": 2868873,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/06/1936242/chinese-student-enrollment-in-us-universities-continues-multi-year-decline?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Student Enrollment in US Universities Continues Multi-Year Decline",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T17:18:23.968831+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T16:40:00+00:00",
        "description": "Apple will lose the ability to collect commissions on external iOS purchases in Europe starting June 23, following a European Commission ruling that hinges on the grammatical interpretation of a single comma in the Digital Markets Act. The dispute centers on Article 5.4, which requires gatekeepers to allow business users \"free of charge, to communicate and promote offers, including under different conditions [...], and to conclude contracts with those end users.\" \n\nApple contends that \"free of charge\" applies only to communication and promotion activities, not contract conclusion, allowing the company to maintain its commission structure on external transactions. The European Commission interprets the comma before \"and to conclude contracts\" as creating an enumeration where the free-of-charge requirement applies to all listed activities, including purchases made outside Apple's payment system. \n\nUnder the new ruling, Apple can collect commissions only on the first external transaction",
        "id": 2867466,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/06/1633206/apple-faces-billions-in-losses-as-eu-comma-interpretation-ends-external-purchase-fees?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Faces Billions in Losses as EU Comma Interpretation Ends External Purchase Fees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T16:13:23.282246+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T16:00:00+00:00",
        "description": "An anonymous reader shares a report: There are more than 1,000 technology unicorns, meaning venture-backed companies worth $1 billion or more, but at least one in 5 are likely to fail, said Rich Wong, a partner at venture capital firm Accel Partners. \"I think maybe out of that thousand, 20% fully die. The end,\" Wong said on Thursday at the Bloomberg Tech conference in San Francisco. \n\nThe estimate reinforces what's become a grim calculus for many companies. Tech start-up valuations soared during the 2021 pandemic boom -- before crashing back to earth, as interest rates rose and venture capital investments fell. Of the companies that don't fail, about half will be stuck -- muddling along without being able to grow bigger or go public, Wong said. Some of those may \"ultimately have reality set in,\" and sell themselves for lower prices than once seemed feasible. Others, not quite failing, \"will be a bit zombie-ish and grind on,\" he said.<p><div class=\"share_submission\" style=\"position:rel",
        "id": 2866904,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/06/1414204/about-20-of-tech-startups-worth-more-than-1-billion-will-fail-accel-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "About 20% of Tech Startups Worth More Than $1 Billion Will Fail, Accel Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T16:13:23.554105+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T15:20:00+00:00",
        "description": "David Sacks, President Trump's AI policy advisor, has dismissed the prospect of implementing a universal basic income program, declaring \"it's not going to happen\" during his tenure. He said: The future of AI has become a Rorschach test where everyone sees what they want. The Left envisions a post-economic order in which people stop working and instead receive government benefits. In other words, everyone on welfare. This is their fantasy; it's not going to happen.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Trump+AI+Czar+Sacks+on+Universal+Basic+Income%3A+'It's+Not+Going+To+Happen'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F06%2F1357256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F06%2F1357256%2Ftrump-ai-czar-sacks-on-universal-bas",
        "id": 2866905,
        "language": null,
        "link": "https://slashdot.org/story/25/06/06/1357256/trump-ai-czar-sacks-on-universal-basic-income-its-not-going-to-happen?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump AI Czar Sacks on Universal Basic Income: 'It's Not Going To Happen'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T15:08:23.672612+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T14:40:00+00:00",
        "description": "YouTube pulled a popular tutorial video from tech creator Jeff Geerling this week, claiming his guide to installing LibreELEC on a Raspberry Pi 5 violated policies against \"harmful content.\" The video, which showed viewers how to set up their own home media servers, had been live for over a year and racked up more than 500,000 views. YouTube's automated systems flagged the content for allegedly teaching people \"how to get unauthorized or free access to audio or audiovisual content.\" \n\nGeerling says his tutorial covered only legal self-hosting of media people already own -- no piracy tools or copyright workarounds. He said he goes out of his way to avoid mentioning popular piracy software in his videos. It's the second time YouTube has pulled a self-hosting content video from Geerling. Last October, YouTube removed his Jellyfin tutorial, though that decision was quickly reversed after appeal. This time, his appeal was denied.<p><div class=\"share_submission\" style=\"position:relative;\">\n",
        "id": 2866316,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/06/1039216/youtube-pulls-tech-creators-self-hosting-tutorial-as-harmful-content?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Pulls Tech Creator's Self-Hosting Tutorial as 'Harmful Content'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T15:08:23.894004+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T14:00:00+00:00",
        "description": "Nearly a quarter of consumers using buy-now-pay-later loans now finance their grocery purchases, representing a significant increase from 14% a year ago, according to a recent LendingTree survey. The shift marks a departure from the traditional use of these short-term financing services for big-ticket items like electronics and furniture toward everyday essentials including groceries, utility bills, and streaming services. \n\nThe BNPL market has experienced dramatic growth, expanding from $2 billion in consumer purchases in 2019 to more than $116.3 billion by 2023. Morgan Stanley found that 28% of surveyed Americans had used BNPL services with about 30% of those users applying the financing to grocery purchases. Food prices have risen 28% since 2020, creating particular pressure on lower-income households earning less than $50,000 annually, who represent the largest user base for these services.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http:",
        "id": 2866317,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/06/1025248/consumers-are-increasingly-turning-to-buy-now-pay-later-services-for-groceries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Consumers Are Increasingly Turning To Buy-Now-Pay-Later Services For Groceries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T10:48:25.042384+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T10:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: My wife taught me something,\" Klarna CEO Sebastian Siemiatkowski told the crowd at London SXSW. He was addressing the headlines about the company looking to hire human workers after previously saying Klarna used artificial intelligence to do work that would equate to 700 workers. \"Two things can be true at the same time,\" he said. Siemiatkowski said it's true that the company looked to stop hiring human workers a few years ago and rolled out AI agents that have helped reduce the cost of customer support and increase the company's revenue per employee. The company had 5,500 workers two years ago, and that number now stands at around 3,000, he said, adding that as the company's salary costs have gone down, Klarna now seeks to reinvest a majority of that money into employee cash and equity compensation.\n \nBut, he insisted, this doesn't mean there isn't an opportunity for humans to work at his company. \"We think offering human customer ",
        "id": 2864306,
        "language": null,
        "link": "https://slashdot.org/story/25/06/06/0050210/klarna-ceo-says-company-will-use-humans-to-offer-vip-customer-service?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Klarna CEO Says Company Will Use Humans To Offer VIP Customer Service",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T07:33:23.745526+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T07:00:00+00:00",
        "description": "Japan-based Ispace confirmed its Resilience lander likely crashed during its second failed attempt at a lunar landing, after a sensor malfunction prevented proper deceleration. Despite the setback, the company remains committed to future missions, with funding secured for a third attempt using a new lander, Apex 1.0, scheduled for 2027. \"Until then, Ispace has its work cut out for it,\" reports CNN. \"[Ispace CEO and founder Takeshi Hakamada] said during the news briefing he will need to work to regain the trust of investors, and the company will need to deeply investigate what went wrong on the Resilience mission to ensure similar issues don't plague Apex 1.0.\"\n \nThe company has ambitious \"plans to eventually build a city on the lunar surface that would house a thousand people and welcome thousands more for tourist visits,\" notes ABC News. \"If ispace is going to establish a colony on the moon, it will need to identify an ample supply of ice or water, which it will convert into fuel for",
        "id": 2863233,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/06/0249228/resilience-spacecraft-likely-crashed-into-the-moon-ispace-confirms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Resilience Spacecraft Likely Crashed Into the Moon, Ispace Confirms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T04:19:02.569339+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from KrebsOnSecurity: Ukraine has seen nearly one-fifth of its Internet space come under Russian control or sold to Internet address brokers since February 2022, a new study finds. The analysis indicates large chunks of Ukrainian Internet address space are now in the hands of shadowy proxy and anonymity services that are nested at some of America's largest Internet service providers (ISPs). The findings come in a report that examines how the Russian invasion has affected Ukraine's domestic supply of Internet Protocol Version 4 (IPv4) addresses. Researchers at Kentik, a company that measures the performance of Internet networks, found that while a majority of ISPs in Ukraine haven't changed their infrastructure much since the war began in 2022, others have resorted to selling swathes of their valuable IPv4 address space just to keep the lights on.\n \nFor example, Ukraine's incumbent ISP Ukrtelecom is now routing just 29 percent of the IPv4 address ran",
        "id": 2862351,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/05/2343244/proxy-services-feast-on-ukraines-ip-address-exodus?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Proxy Services Feast On Ukraine's IP Address Exodus",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T02:08:23.632811+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T01:40:00+00:00",
        "description": "Ars Technica's Kyle Orland reports: Last month, ahead of the launch of the Switch 2 and its GameChat communication features, Nintendo updated its privacy policy to note that the company \"may also monitor and record your video and audio interactions with other users.\" Now that the Switch 2 has officially launched, we have a clearer understanding of how the console handles audio and video recorded during GameChat sessions, as well as when that footage may be sent to Nintendo or shared with partners, including law enforcement. Before using GameChat on Switch 2 for the first time, you must consent to a set of GameChat Terms displayed on the system itself. These terms warn that chat content is \"recorded and stored temporarily\" both on your system and the system of those you chat with. But those stored recordings are only shared with Nintendo if a user reports a violation of Nintendo's Community Guidelines, the company writes.\n \nThat reporting feature lets a user \"review a recording of the ",
        "id": 2861874,
        "language": null,
        "link": "https://games.slashdot.org/story/25/06/05/2330221/nintendo-warns-switch-2-gamechat-users-your-chat-is-recorded?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nintendo Warns Switch 2 GameChat Users: 'Your Chat Is Recorded'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T01:03:51.810600+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T01:00:00+00:00",
        "description": "UK tech job openings have surged 21% to pre-pandemic levels, driven largely by a 200% spike in demand for AI skills. London accounted for 80% of the AI-related postings. The Register reports: Accenture collected data from LinkedIn in the first and second week of February 2025, and supplemented the results with a survey of more than 4,000 respondents conducted by research firm YouGov between July and August 2024. The research found a 53 percent annual increase in those describing themselves as having tech skills, amounting to 1.69 million people reporting skills in disciplines including cyber, data, and robotics. [...]\n \nThe research found that London-based companies said they would allocate a fifth of their tech budgets to AI this year, compared to 13 percent who said the same and were based in North East England, Scotland, and Wales. Growth in revenue per employee increased during the period when LLMs emerged, from 7 percent annually between 2018 and 2022 to 27 percent between 2018 a",
        "id": 2861558,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/05/2316255/uk-tech-job-openings-climb-21-to-pre-pandemic-highs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Tech Job Openings Climb 21% To Pre-Pandemic Highs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T01:03:51.972542+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T00:20:00+00:00",
        "description": "Intel has implemented a strict new policy requiring all new projects to demonstrate at least a 50% gross margin to move forward. CEO Lip-Bu Tan explained Intel's new risk-averse policy as \"something that we probably should have had before,\" later clarifying that the number is a figure the company is aspiring toward internally. Tom's Hardware reports: Tan is reportedly \"laser focused on the fact that we need to get our gross margins back up above 50%.\" To accomplish this, Tan is also said to be investigating and potentially cancelling or changing unprofitable deals with other companies. Intel's margins have slipped to new lows for the company in recent months. MacroTrends reports Intel's trailing 12 months gross margin for Q1 2025 was as low as 31.67%. Intel's gross margins had hovered around the 60% mark for the ten years leading up to the COVID-19 pandemic, falling beneath 50% in Q2 2022 and continuing to steadily fall ever since.\n \nHolthaus predicts a \"tug-of-war\" to ensue within In",
        "id": 2861559,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/05/2311240/intel-new-products-must-deliver-50-gross-profit-to-get-the-green-light?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel: New Products Must Deliver 50% Gross Profit To Get the Green Light",
        "vote": 0
    }
]