[
    {
        "age": null,
        "album": "",
        "author": "Marvel Entertainment",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T23:19:06.256451+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T23:00:04+00:00",
        "description": "She-Hulk and Rocket Raccoon join the cosmic battle!\n\nPlay MARVEL Cosmic Invasion later this year on PC and Consoles: https://www.dotemu.com/games/marvel-cosmic-invasion/ \n\nAfter Annihilus has launched an unprecedented attack across the galaxy, all life hangs in the balance… \nTo face this threat, She-Hulk forgoes litigation and takes matters into her own hands; get ready to grapple and toss enemies around with her gamma-powered might!\nAnd if you’re more into firepower, blast your way through a barrage of bugs with Rocket Raccoon and his hard-hitting futuristic arsenal! With his penchant for sporadically lobbing grenades, you’re looking at MARVEL Cosmic Invasion’s most chaotic fighter yet.\n\nShe-Hulk and Rocket Raccoon join Captain America, Wolverine, Spider-Man, Storm, Phyla-Vell, Venom, and Nova as part of an out-of-this-world roster inspired by classic MARVEL comic books!\n\nGet ready to brawl through the streets of New York City all the way to the depths of the Negative Zone to foil An",
        "id": 2869935,
        "language": null,
        "link": "https://www.youtube.com/watch?v=1eOzJ75eXjU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 626,
        "source_url": "https://www.youtube.com/channel/UCvC4D8onUfXzvjTOM-dBfEA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1eOzJ75eXjU/hqdefault.jpg",
        "title": "MARVEL Cosmic Invasion – She-Hulk and Rocket Raccoon Character Reveal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Marvel Entertainment",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T23:19:06.449075+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T22:07:46+00:00",
        "description": "*RED BAND* This trailer is not for the faint of heart so put on your big kid undies and strap in for a violent, expletive-ridden good time. After being pulled through a portal to Mojoworld, Deadpool sees a chance to get rich—like really rich. He signs a sketchy contract without reading any of the fine print and then it’s off to visit a bunch of locations from across the Marvel Universe, battling against iconic (and not-so-iconic) villains.\nFeaturing the franchise’s unique blend of parkour and combat: If you can imagine it, you can probably do it. Sure, you can simply stab or shoot your enemies, but where’s the fun in that? Punch someone while holding a grenade? Check. Take your recently exploded-off arm and throw it at the bad guys? Gross, but also check. The limit does not exist!\nFeaturing Neil Patrick Harris as Deadpool, experience parkour and combat with over-the-top moments like only the merc with the mouth can pull off.\nMarvel’s Deadpool VR incoming Late 2025. Only on Meta Quest ",
        "id": 2869936,
        "language": null,
        "link": "https://www.youtube.com/watch?v=IHxCPwY7YBY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 626,
        "source_url": "https://www.youtube.com/channel/UCvC4D8onUfXzvjTOM-dBfEA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IHxCPwY7YBY/hqdefault.jpg",
        "title": "Marvel’s Deadpool VR Announce Trailer",
        "vote": 0
    }
]