[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T16:32:42.374652+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T15:30:36+00:00",
        "description": "Between Silent Hill f and Metal Gear Solid Delta: Snake Eater, it's a good year for Konami and its fans. Two major franchises have returned from what seemed like oblivion, offering scares and thrills in equal delight. Of course, they have pretty big legacies to live up to, so if something isn't perfect, it will stick out for long-time fans.\n\nSuch has occurred with Delta: Snake Eater, especially after its latest gameplay trailer from State of Play. Between the Ape Escape gameplay, a tease of Metal Gear Online, and memorable moments made sleeker thanks to improved textures, there were a few odd things. Some animations didn't look smooth, while the lighting in places felt off.\n\nIt may not seem like much, but considering the game is out in less than three months - and the sheer journey that fans have had since Hideo Kojima departed from the studio - it's worth discussing. What's going on, and what are the chances of improvements by August 28th? Find out here.",
        "id": 2867030,
        "language": null,
        "link": "https://www.youtube.com/watch?v=wqH_fjmaAfw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wqH_fjmaAfw/hqdefault.jpg",
        "title": "Metal Gear Solid: Delta Snake Eater Looks Great, But What The Hell Is Going On With Its Animations?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-06T10:02:58.534134+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-06T09:45:06+00:00",
        "description": "Any review of a console at launch, of course, is only a very small part of the story. These machines last for years, sometimes even approaching the better part of a decade. They grow and evolve, via software updates and hardware revisions and new accessories. And, of course, the games, which, more than anything, define a console, and which it obviously accrues more and more of as time goes on. \n\nThen also are the  quirks and frustrations and shortcomings that only become apparent with very prolonged and extended use – for example, there was no way to identify the drifting analog sticks on the original Switch or on the PS5 at or around launch, that was only something that became apparent after months of continued use. \n\nSo of course, what you or I or anyone else feels about the Switch 2 right now is not necessarily how we will feel about it at the end of its life, or a few years from now, or even a few months from now. But how we feel about it now is important, because it sets the tone",
        "id": 2863900,
        "language": null,
        "link": "https://www.youtube.com/watch?v=OrhGoRtHFLc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OrhGoRtHFLc/hqdefault.jpg",
        "title": "Nintendo Switch 2 Review - Is It Worth Your Money?",
        "vote": 0
    }
]