[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T19:03:44.561668+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T19:00:25+00:00",
        "description": "In this session recorded at Unreal Fest Stockholm, Croteam builds on last year’s Technical Content Grimoire talk and showcases some of the ways they optimized materials, textures, and geometry for ‘The Talos Principle: Reawakened’. \n\nCroteam explores how to go about refactoring complex materials that are actively in use; lessons on the use of Runtime Virtual Textures (RVTs) on Landscapes; and how to count Shader Resource View (SRVs) for a particular material, along with how Nanite and Virtual Textures add to their number.\n\nThey go on to look at what type of Nanite Foliage is the most performant in the current version of Unreal Engine and provide hints on how to optimize it using Houdini.\n\nThere’s also a dive into how they utilized AI and Houdini for remastering old geometry and making it high fidelity for ‘The Talos Principle: Reawakened’, as well as how to unify a foliage system under the procedural content generation (PCG) framework with various tools.\n\nFinally, the team explores wh",
        "id": 4363976,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Mut7T5v3EzA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Mut7T5v3EzA/hqdefault.jpg",
        "title": "Technical Content Grimoire: Volume 2 | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:03:01.995799+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:01:03+00:00",
        "description": "MASTERING UE5 MODULAR CHARACTER RIGS: Get hands-on with the high-quality modular character rigs created by Agora Studio. Discover the essential first step of setting a master key to prime crucial rig functions like IK/FK snapping. Learn to manipulate professional controls, such as easily switching between IK and FK for the arms and legs, and utilizing the fully rigged facial controls to bring life and emotion to your stylized characters\n►Download the A-COM Animation Sample here: https://epic.gm/agora-animation-sample\n► Check out Sir Wade's channel for more Animation Tutorials and UE5 workflows: https://www.youtube.com/@SirWade/\n► Sir Wade's Courses: https://courses.sirwade.com\n\n#Animation, #ACOMAnimaticSample, #UnrealEngine5.6, #AgoraStudio",
        "id": 4363446,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WMKvwVIuFS4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WMKvwVIuFS4/hqdefault.jpg",
        "title": "Stylized Animation Control Rig Characters in Unreal Engine 5",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T15:59:54.041404+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T15:01:08+00:00",
        "description": "What if a city’s digital twin could be more than a static model, and it could be played with, explored, and learned from? In this session recorded at Unreal Fest Stockholm, Tomas Nihlén of Tomlin Studio shares how the company brought part of a digital twin of the city of Norrköping into Fortnite using UEFN, and made it available as a sandbox template for others to learn from and build on.\n\nWith Cesium and Google 3D Tiles as the foundation, Tomlin Studio is now exploring how to create immersive city simulations using real-world data in Niagara and high-fidelity points of interest with 3D Gaussian splatting and photogrammetry. \n\nTomas shares the company's experiences working with different types of digital twins, including the pros and cons of using 3D gaussian Splatting versus photogrammetry, and the technical limitations faced in UEFN.\n\nThis talk walks through the technical setup, lessons learned, and future possibilities to make digital twins playable, bridging the gap between games,",
        "id": 4362152,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XliX7KaAA9g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XliX7KaAA9g/hqdefault.jpg",
        "title": "Making Digital Twins Playable: From UEFN to Unreal Engine | Unreal Fest Stockholm 2025",
        "vote": 0
    }
]