[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T23:50:56.948570+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T23:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Earlier this month, Strava, the popular fitness-tracking app, released its annual \"Year in Sport\" wrap-up -- a cutesy, animated series of graphics summarizing each user's athletic achievements. But this year, for the first time, Strava made this feature available only to users with subscriptions ($80 per year), rather than making it free to everyone, as it had been historically since the review's debut in 2016. This decision has roiled numerous Strava users, particularly those who have relished the app's social encouragement features.\n \nOne Strava user in India, Shobhit Srivastava, \"begged\" Strava to \"let the plebs see their Year in Sport too, please.\" He later explained to Ars that having this little animated video is more than just a collection of raw numbers. \"When someone makes a video of you and your achievements and tells you that these are the people who stood right behind you, motivated you, cheered for you -- that feeling",
        "id": 4365957,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/19/2158235/strava-puts-popular-year-in-sport-recap-behind-an-80-paywall",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Strava Puts Popular 'Year In Sport' Recap Behind an $80 Paywall",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T23:50:57.110731+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T23:00:00+00:00",
        "description": "TikTok's owner ByteDance has signed a deal creating a U.S.-focused joint venture majority-owned by American and global investors, allowing the app to avoid a U.S. ban while ByteDance retains a minority stake. The BBC reports: Half of the joint venture will be owned by a group of investors including Oracle, Silver Lake and the Emirati investment firm MGX, according to a memo sent by chief executive Shou Zi Chew. The deal, which is set to close on January 22, would end years of efforts by Washington to force ByteDance to sell its US operations over national security concerns. It is in-line with a deal unveiled in September, when US President Donald Trump delayed the enforcement of a law that would ban the app unless it was sold.\n \nTikTok said in the memo that the deal would enable \"over 170 million Americans to continue discovering a world of endless possibilities as part of a vital global community.\" Under the agreement, ByteDance will retain 19.9% of the business, while Oracle, Silver",
        "id": 4365958,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/19/2150202/tiktok-owner-signs-deal-to-avoid-us-ban",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "TikTok Owner Signs Deal To Avoid US Ban",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T22:49:27.387617+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T22:20:00+00:00",
        "description": "The White House says it's investigating how a personal-finance YouTuber's livestream briefly appeared on the White House's official live video page. The creator says he has no idea how his video ended up there. The Associated Press reports: The livestream appeared for at least eight minutes late Thursday on whitehouse.gov/live, where the White House usually streams live video of the president speaking. It's unclear if the website was breached or the video was linked accidentally by someone in the government. The White House said in a statement that it was \"aware and looking into what happened.\" The video that appeared on the government-run website featured some of a more than two-hour livestream from Matt Farley, who posts as @RealMattMoney, as he answered financial questions.\n \nFarley told The Associated Press on Friday that he had no idea what happened and learned about it after the fact. He said he had not been contacted by the government and didn't have any theories about how his ",
        "id": 4365463,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/19/2144258/youtubers-livestream-appears-on-white-house-website",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTuber's Livestream Appears On White House Website",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T21:47:31.343515+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T21:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: At this point, most competitive online multiplayer games on the PC come with some kind of kernel-level anti-cheat software. As we've written before, this is software that runs with more elevated privileges than most other apps and games you run on your PC, allowing it to load in earlier and detect advanced methods of cheating. More recently, anti-cheat software has started to require more Windows security features like Secure Boot, a TPM 2.0 module, and virtualization-based memory integrity protection. Riot Games, best known for titles like Valorant and League of Legends and the Vanguard anti-cheat software, has often been one of the earliest to implement new anti-cheat requirements. There's already a long list of checks that systems need to clear before they'll be allowed to play Riot's games online, and now the studio is announcing a new one: a BIOS update requirement that will be imposed on \"certain players\" following Riot's di",
        "id": 4365097,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/19/2135223/riot-games-is-making-an-anti-cheat-change-that-could-be-rough-on-older-pcs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Riot Games Is Making an Anti-Cheat Change That Could Be Rough On Older PCs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T21:47:31.685456+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T20:41:00+00:00",
        "description": "Microsoft's latest holiday ad for its Copilot AI assistant features a 30-second montage of users seamlessly syncing smart home lights to music, scaling recipes for large gatherings, and parsing HOA guidelines -- none of which the software can actually perform reliably when put to the test. The Verge methodically tested each prompt shown in the ad and found that Copilot repeatedly hallucinated interface elements that didn't exist, claimed to highlight on-screen buttons when it hadn't, and abandoned calculations midway through. \n\nThe smart home interface shown in the ad belongs to \"Relecloud,\" a fictional company Microsoft uses in internal case studies. A Microsoft spokesperson confirmed that both the HOA document and the inflatable reindeer photo were fabricated for the advertisement. The ad closes with Santa Claus asking Copilot why toy production is behind schedule. \n\nFurther reading: Talking To Windows' Copilot AI Makes a Computer Feel Incompetent.<p><div class=\"share_submission\" st",
        "id": 4365098,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/19/1932210/microsoft-made-another-copilot-ad-where-nothing-actually-works",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Made Another Copilot Ad Where Nothing Actually Works",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T20:46:26.344441+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T20:02:00+00:00",
        "description": "President Trump's closure of the de minimis customs loophole in May -- which previously allowed Chinese packages valued under $800 to enter the U.S. duty-free -- has redirected a flood of cheap goods toward Europe, where similar exemptions for packages under $175.8 in the EU and $180 in the UK remain intact. \n\nThe shift has been swift: exports of low-value Chinese packages to the U.S. have dropped more than 40% since May, according to Chinese customs data, and the EU has this year overtaken the U.S. as the largest market for China's roughly $100 billion cheap package trade. \n\nShipments to Hungary and Denmark have quadrupled, and those to Germany, France, and the UK have risen 50% or more. Temu has recorded seven straight months of double-digit U.S. sales declines, per Consumer Edge data tracking credit and debit card transactions. Its European sales, on the other hand: up 56% in the EU and 46% in the UK since May compared to a year ago. The EU agreed last week to impose a $3.5 fee on ",
        "id": 4364718,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/19/1925205/all-that-cheap-chinese-stuff-is-now-europes-problem",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "All That Cheap Chinese Stuff Is Now Europe's Problem",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T19:43:06.767223+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T19:30:00+00:00",
        "description": "alternative_right writes: Grocery delivery service Instacart will refund $60 million to settle FTC claims that it misled customers with false advertising and unlawfully enrolled them in paid subscriptions. Instacart partners with over 1,800 retailers to provide online shopping, delivery, and pickup services from nearly 100,000 stores across North America. Its platform serves millions of customers and is also used by roughly 600,000 independent shoppers across thousands of cities in Canada and the United States. \n\nIn a complaint filed on Thursday, the FTC claimed Instacart engaged in multiple deceptive tactics that raised costs for customers, including failing to provide advertised refunds and falsely advertising \"free delivery\" while still charging mandatory service fees that added up to 15% to order costs. The FTC said Instacart also advertised a \"100% satisfaction guarantee,\" but typically offered only small credits toward future orders rather than full refunds to customers experien",
        "id": 4364226,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/19/1921253/ftc-instacart-to-refund-60m-over-deceptive-subscription-tactics",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FTC: Instacart To Refund $60M Over Deceptive Subscription Tactics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T19:43:07.045534+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T18:52:00+00:00",
        "description": "Microsoft AI CEO Mustafa Suleyman estimates that staying competitive in frontier AI development will require \"hundreds of billions of dollars\" over the next five to ten years, a sum that doesn't even account for the high salaries companies are paying individual researchers and technical staff. Speaking on a podcast, Suleyman compared Microsoft to a \"modern construction company\" where hundreds of thousands of workers are building gigawatts of CPUs and AI accelerators. There's \"a structural advantage by being inside a big company,\" he said. \n\nWhen asked whether startups could compete with Big Tech, Suleyman said \"it's hard to say,\" adding that \"the ambiguity is what's driving the frothiness of the valuations.\" Meta CEO Mark Zuckerberg said in September he'd rather risk \"misspending a couple of hundred billion\" than fall behind in superintelligence.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+AI+Chief%3A+S",
        "id": 4364227,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/19/1852238/microsoft-ai-chief-staying-in-the-frontier-ai-race-will-cost-hundreds-of-billions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft AI Chief: Staying in the Frontier AI Race Will Cost Hundreds of Billions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:39:58.855876+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T18:11:00+00:00",
        "description": "The television industry's brightness war may have hit its inflection point in 2025, the year TCL and Hisense released the first consumer TVs capable of 5,000 nits under specific settings -- a figure that would have seemed absurd not long ago when manufacturers struggled to reach 2,000 nits. LG introduced Primary RGB Tandem OLED technology, moving from a three-stack panel design to a four-stack red-blue-green-blue configuration that the company claims can achieve 4,000 nits. The technology appears in the LG G5, Panasonic Z95B and Philips OLED950 and OLED910. \n\nRGB mini-LED also emerged as a new category. The technology uses individual small red, green and blue LED backlights instead of white or blue LEDs paired with quantum dots. Hisense demonstrated it at CES 2025, TCL announced its Q10M for China, and Samsung unveiled its own version called micro-RGB. These sets range from $12,000 to $30,000. Sony has confirmed it will debut RGB TV technology in spring 2026. HDR content is currently ",
        "id": 4363790,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/19/1734246/2025-was-the-beginning-of-the-end-of-the-tv-brightness-war",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "2025 Was the Beginning of the End of the TV Brightness War",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:38:48.810739+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:30:00+00:00",
        "description": "Uber is hiring more engineers rather than fewer because AI tools have made them \"superhumans,\" CEO Dara Khosrowshahi said, pushing back against the industry trend of using productivity gains to justify headcount cuts. Speaking on the \"On with Kara Swisher\" podcast, Khosrowshahi noted that other tech executives see AI making engineers 20% to 30% more productive and conclude they need 20% to 30% fewer engineers. His view: every engineer has become more valuable. Between 80% and 90% of Uber's developers now use AI tools, according to Khosrowshahi. \n\nThe company no longer keeps scores of engineers on call to diagnose issues because AI agents are constantly monitoring systems, he said. The latest AI models are producing \"hundreds of millions of dollars of benefit\" for Uber, he said, describing the company as an \"applied AI\" business that harnesses the technology for pricing, payments, matching, routing, identification and customer complaints.<p><div class=\"share_submission\" style=\"position",
        "id": 4363234,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/19/1717228/uber-is-hiring-more-engineers-because-ai-is-making-them-more-valuable-ceo-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Uber is Hiring More Engineers Because AI is Making Them More Valuable, CEO Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:38:48.989625+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T16:54:00+00:00",
        "description": "iRobot, the Bedford, Massachusetts-based company that brought the Roomba vacuum cleaner into American homes over its 35-year history, filed for bankruptcy on Sunday and will be acquired by Picea, its Chinese contract manufacturer that also produces competing household devices. \n\nThe Wall Street Journal's editorial board placed blame for the company's demise on the Federal Trade Commission under Chair Lina Khan, which opposed Amazon's $1.7 billion bid to acquire iRobot. That deal collapsed in January 2024 amid regulatory pressure from both the FTC and European antitrust authorities. Senator Elizabeth Warren and other progressives had urged Khan to block the acquisition, arguing in a September 2022 letter that Amazon is \"'almost universally recognized' as the leader in warehouse and fulfillment robotics space\" and that the deal \"would open up a new market to Amazon's abuses.\" \n\nAfter the deal fell through, iRobot cut 31% of its workforce and moved \"non-core engineering functions to lowe",
        "id": 4363235,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/19/1654219/how-lina-khan-killed-irobot",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'How Lina Khan Killed iRobot'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T16:36:18.927870+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T16:08:00+00:00",
        "description": "The Association for Computing Machinery, the world's largest society of computing professionals, announced that all publications and related artifacts in the ACM Digital Library will become freely available to everyone starting January 2026. Authors will retain full copyright to their published work under the new arrangement, and ACM has committed to defending those works against copyright and integrity-related violations. \n\nThe transition follows what ACM described as extensive dialogue with authors, Special Interest Group leaders, editorial boards, libraries, and research institutions globally. Students, educators, and researchers at institutions of all sizes -- from well-resourced universities to emerging research communities -- will gain unrestricted access to the full catalog of ACM-published work. The Digital Library houses decades of computing research across journals, magazines, conference proceedings, and books.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a c",
        "id": 4362590,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/19/168225/acm-to-make-its-entire-digital-library-open-access-starting-january-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ACM To Make Its Entire Digital Library Open Access Starting January 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T16:36:19.122634+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T15:33:00+00:00",
        "description": "More carbon dioxide in the environment is making food more calorific but less nutritious -- and also potentially more toxic, a study has found. From a report: Sterre ter Haar, a lecturer at Leiden University in the Netherlands, and other researchers at the institution created a method to compare multiple studies on plants' responses to increased CO2 levels. The results, she said, were a shock: although crop yields increase, they become less nutrient-dense. While zinc levels in particular drop, lead levels increase. \n\n\"Seeing how dramatic some of the nutritional changes were, and how this differed across plants, was a big surprise,\" she told the Guardian. \"We aren't seeing a simple dilution effect but rather a complete shift in the composition of our foods... This also raises the question of whether we should adjust our diets in some way, or how we grow or produce our food.\" \n\nWhile scientists have been looking at the effects of more CO2 in the atmosphere on plants for a decade, their ",
        "id": 4362591,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/19/1533240/food-becoming-more-calorific-but-less-nutritious-due-to-rising-carbon-dioxide",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Food Becoming More Calorific But Less Nutritious Due To Rising Carbon Dioxide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T15:11:16.088515+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T14:42:00+00:00",
        "description": "Apple released an updated developer license agreement this week that gives the company permission to recoup unpaid funds, such as commissions or any other fees, by deducting them from in-app purchases it processes on developers' behalf, among other methods. From a report: The change will impact developers in regions where local law allows them to link to external payment systems. In these cases, developers must report those payments back to Apple to pay the required commissions or fees. \n\nThe changed agreement seemingly gives Apple a way to collect what it believes is the correct fee if the company determines a developer has underreported their earnings. [...] In its new developer agreement, Apple states it will \"offset or recoup\" what it believes it is owed, including \"any amounts collected by Apple on your behalf from end-users.\" This means Apple could recoup funds from developers' in-app purchases -- like those for digital goods, services, and subscriptions -- or from one-time fees",
        "id": 4361893,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/19/1422210/apple-becomes-a-debt-collector-with-its-new-developer-agreement",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Becomes a Debt Collector With Its New Developer Agreement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T15:11:16.283873+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T14:01:00+00:00",
        "description": "The Danish government has accused Russia of being behind two \"destructive and disruptive\" cyberattacks in what it describes as \"very clear evidence\" of a hybrid war. From a report: The Danish Defence Intelligence Service (DDIS) announced on Thursday that Moscow was behind a cyberattack on a Danish water utility in 2024 and a series of distributed denial-of-service (DDoS) attacks on Danish websites in the lead-up to the municipal and regional council elections in November. \n\nThe first, it said, was carried out by the pro-Russian group known as Z-Pentest and the second by NoName057(16), which has links to the Russian state. \"The Russian state uses both groups as instruments of its hybrid war against the west,\" DDIS said in a statement. \"The aim is to create insecurity in the targeted countries and to punish those that support Ukraine. Russia's cyber operations form part of a broader influence campaign intended to undermine western support for Ukraine.\" It added: \"The DDIS assesses that ",
        "id": 4361894,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/19/1356239/denmark-says-russia-was-behind-two-destructive-and-disruptive-cyberattacks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark Says Russia Was Behind Two 'Destructive and Disruptive' Cyberattacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T13:55:55.127716+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from KrebsOnSecurity: Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware. When Internet users try to visit expired domain names or accidentally navigate to a lookalike \"typosquatting\" domain, they are typically brought to a placeholder page at a domain parking company that tries to monetize the wayward traffic by displaying links to a number of third-party websites that have paid to have their links shown.\n \nA decade ago, ending up at one of these parked domains came with a relatively small chance of being redirected to a malicious destination: In 2014, researchers found (PDF) that parked domains redirected users to malicious sites less than five percent ",
        "id": 4361179,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/18/220216/most-parked-domains-now-serving-malicious-content",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Most Parked Domains Now Serving Malicious Content",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T10:09:45.456869+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T10:00:00+00:00",
        "description": "Google's AI Mode is synthesizing \"Frankenstein\" recipes from multiple creators, often stripping away context and accuracy and siphoning traffic and ad revenue away from food bloggers in the process. Many recipe writers warn this shift amounts to an \"extinction event\" for ad-supported food sites. The Guardian reports: Over the past few years, bloggers who have not secured their sites behind a paywall have seen their carefully developed and tested recipes show up, often without attribution and in a bastardized form, in ChatGPT replies. They have seen dumbed-down versions of their recipes in AI-assembled cookbooks available for digital downloads on Etsy or on AI-built websites that bear a superficial resemblance to an old-school human-written blog. Their photos and videos, meanwhile, are repurposed in Facebook posts and Pinterest pins that link back to this digital slop.\n \nRecipe writers have no legal recourse because recipes generally are not copyrightable. Although copyright protects p",
        "id": 4359814,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/18/2152215/google-ai-summaries-are-ruining-the-livelihoods-of-recipe-writers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google AI Summaries Are Ruining the Livelihoods of Recipe Writers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T07:57:23.423590+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T07:00:00+00:00",
        "description": "Tony Isaac shares a report from CNN: President Donald Trump's social media and crypto company is making a huge bet on a far different industry -- nuclear fusion, a potentially lucrative albeit commercially unproven energy technology that could help power a suddenly electricity-starved economy. Trump Media and Technology Group Thursday announced a surprise merger with TAE Technologies, in an all-stock deal valued at more than $6 billion that would create one of the first publicly traded fusion companies. News of the deal shares of Trump Media (DJT) 35% higher in early trading Thursday.\n \nAfter the deal closes, shareholders of Trump Media and TAE would own about 50% of the combined entity. The combined companies plan to begin construction as soon as next year of the world's first fusion reaction that could produce electricity on utility scale, rather than just in laboratory settings. The combination with TMTG could give TAE political clout. But it could also make it more politically con",
        "id": 4359180,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/18/2137259/trumps-social-media-business-is-merging-with-a-nuclear-fusion-company",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump's Social Media Business Is Merging With a Nuclear Fusion Company",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T03:47:11.371188+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: Actors have voted to refuse digital scanning to prevent their likeness being used by artificial intelligence in a pushback against AI in the arts. Members of the performing arts union Equity were asked if they would refuse to be scanned while on set, a common practice in which actors' likeness is captured for future use -- with 99% voting in favor of the move. The vote was an indicative ballot designed to demonstrate the strength of feeling on the issue, with more than 7,000 members polled on a 75% turnout. However, actors would not be legally protected if they refused to be scanned.\n \nThe union said it would write to Pact, the trade body representing the majority of producers and production companies in the UK, to negotiate new minimum standards for pay, as well as terms and conditions for actors working in film and TV. Equity said it may hold a formal ballot depending on the outcome of the negotiations, which, if backed, would g",
        "id": 4358159,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/18/2133209/uk-actors-vote-to-refuse-to-be-digitally-scanned-in-pushback-against-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Actors Vote To Refuse To Be Digitally Scanned In Pushback Against AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T01:36:04.633374+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T01:25:00+00:00",
        "description": "alternative_right shares a report from ScienceAlert: A new study adds to the growing body of evidence that swearing can help us unleash our inner strength, improving physical performance, it seems, by helping people break through certain psychological barriers. [...] [Psychology researcher Richard Stephens of Keele University in the UK] and his colleagues at Keele and the University of Alabama wanted to test whether swearing could not only improve physical performance, as they had done in previous research, but also see whether it does so by changing a person's psychology in the moment, especially when it comes to letting go of inhibitions.\n \nEighty-eight participants, aged 18 to 65, all in good enough shape to exert themselves physically, were recruited at a university campus to participate in the first experiment. They each selected a pair of words based on the following prompts: a swear word you might utter after bumping your head, and a neutral word you might use to describe a tab",
        "id": 4357666,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/18/2116258/swearing-actually-seems-to-make-humans-physically-stronger",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Swearing Actually Seems To Make Humans Physically Stronger",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T01:36:04.751234+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T00:45:00+00:00",
        "description": "LG said it will let owners of its TVs delete Microsoft's Copilot shortcut after several reports highlighted the unremovable icon. In a statement to The Verge, LG says the company \"respects consumer choice and will take steps to allow users to delete the shortcut icon if they wish.\" From the report: Last week, a user on the r/mildlyinfuriating subreddit posted an image of the Microsoft Copilot icon in their lineup of apps on an LG TV, with no option to delete it. \"My LG TV's new software update installed Microsoft Copilot, which cannot be deleted,\" the post says. The post garnered more than 36,000 upvotes as people grow more frustrated with AI popping up just about everywhere.\n \nBoth LG and Samsung announced plans to add Microsoft's Copilot AI assistant to their TVs in January, but it appears to be popping up on LG TVs following a recent update to webOS. [LG spokesperson Chris De Maria] clarifies that the icon is a \"shortcut\" to the Microsoft Copilot web app that opens in the TV's web ",
        "id": 4357667,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/18/217230/lg-will-let-tv-owners-delete-microsoft-copilot-after-customer-outcry",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LG Will Let TV Owners Delete Microsoft Copilot After Customer Outcry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T00:33:35.631931+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T00:02:00+00:00",
        "description": "An Apple developer was locked out of his Apple Account after redeeming a compromised Apple Gift Card, exposing how automated fraud systems can effectively cut users off from their digital lives with little explanation or recourse. TidBITS reports: After attempting to redeem a $500 Apple Gift Card purchased from a well-known retailer, Apple developer, author, and /dev/world conference organizer Paris Buttfield-Addison found himself locked out of his Apple Account. He writes: \"I am writing this as a desperate measure. After nearly 30 years as a loyal customer, authoring technical books on Apple's own programming languages (Objective-C and Swift), and spending tens upon tens upon tens of thousands of dollars on devices, apps, conferences, and services, I have been locked out of my personal and professional digital life with no explanation and no recourse.\"\n \nAs far as I can tell from his extensively documented story, Buttfield-Addison did nothing wrong. Personally, I wouldn't have purcha",
        "id": 4357277,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/18/2058222/compromised-apple-gift-card-leads-to-apple-account-lockout",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Compromised Apple Gift Card Leads to Apple Account Lockout",
        "vote": 0
    }
]