[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:05.404923+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T18:00:31+00:00",
        "description": "When no one could explain her young daughter’s sudden death, Laura Gould went searching for answers. Now, a new field of medical research works to help protect future children. Laura Gould, MSc, MA, PT, is a Research Assistant Professor at the NYU Grossman School of Medicine. \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4363550,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FTAX-H6nVKA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FTAX-H6nVKA/hqdefault.jpg",
        "title": "How to support parents after the loss of a child | Laura Gould, MSc, MA, PT | TEDxNYU Langone Health",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:05.553557+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:55:00+00:00",
        "description": "NOTE FROM TED: This talk contains graphic photos of self-harm. Terminology and classification related to autism remains debated by experts and advocates working in this field. This talk only represents the speaker's personal views and understanding. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nDiscussions about autism are abundant online…until the conversation gets uncomfortable. Autism advocate Kaelynn Partlow challenges the way our current support system is set up as it pertains to job training, and meaningful goals for those who are profoundly impacted by their autism.\n\nShe introduces the metaphorical idea of the stepstool instead of the ladder — a new way to think about progress, contribution, and dignity for those who can’t meet society’s narrow definitions of success.\n\nIf you care about inclusion, this is the autism conversation eve",
        "id": 4363551,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=z23qMXC45XY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z23qMXC45XY/hqdefault.jpg",
        "title": "The autism conversation we need to have | Kaelynn Partlow | TEDxBoulder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:05.753648+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:45:40+00:00",
        "description": "Che cos’è davvero la felicità? Per Circo Patuf non è un obiettivo lontano, ma un incontro: uno sguardo, una risata, una presenza condivisa. In questo talk, Fede e Lidy raccontano il loro viaggio umano e artistico, nato da un sogno di strada e diventato un progetto di circo sociale capace di portare emozioni nei luoghi dove il circo non arriva.\n\nDalla Tunisia all’India, dai villaggi remoti ai cortili delle scuole, il linguaggio universale del gioco e del sorriso supera confini, culture e parole. Un racconto che ribalta il punto di vista: nel circo sociale i riflettori non sono sull’artista, ma sul pubblico. Un invito a rallentare, guardarsi negli occhi e riscoprire quanto, con poco, si possa fare tantissimo. Il Circo Patuf è una compagnia di circo contemporaneo itinerante che tocca principalmente le città venete più periferiche. I loro spettacoli uniscono circo, clown, teatro, danza, musica e poesia visiva, frutto di sperimentazione e collaborazione tra artisti. Negli ultimi anni, la c",
        "id": 4363552,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=z3-vLSrOw2U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z3-vLSrOw2U/hqdefault.jpg",
        "title": "The magic of being there: when a smile becomes a universal language | Circo Patuf | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:06.050815+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:45:26+00:00",
        "description": "In un’epoca in cui le immagini generate dall’intelligenza artificiale sono sempre più realistiche, siamo davvero ancora capaci di distinguere ciò che è umano da ciò che non lo è? In questo talk, Giulia Panozzo ci guida tra neuroscienze, percezione e fiducia, partendo dal fenomeno della uncanny valley per arrivare a uno studio sperimentale che indaga come il nostro cervello reagisce, spesso prima della coscienza, ai contenuti creati dall’AI.\n\nI risultati mettono in discussione alcune paure diffuse: il cervello umano non è solo una macchina predittiva, ma anche straordinariamente adattabile. Un intervento che invita a ripensare il rapporto tra esseri umani e intelligenza artificiale, sottolineando l’urgenza di un uso etico e responsabile della tecnologia, soprattutto nei contesti di comunicazione e persuasione. Giulia Panozzo unisce neuroscienze e comunicazione per aiutare aziende e professionisti a comprendere davvero il comportamento dei consumatori. Ha fondato Neuroscientive, una soc",
        "id": 4363553,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=JElJ0C66t7Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JElJ0C66t7Q/hqdefault.jpg",
        "title": "Uomo o Macchina: il cervello conosce la differenza?  | Giulia Panozzo | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:06.224822+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:45:09+00:00",
        "description": "Why do some moments stay with us forever? In this talk, Theron Skees explores how emotionally resonant experiences become lasting memories through story, purpose, and design. Introducing the concept of Narrative Experience Design, he shows how storytelling can intentionally shape culture, engagement, and human connection—across brands, communities, and everyday life. A powerful reflection on how designing experiences with meaning can help people feel seen, connected, and part of something larger. Theron Skees, former Creative Director at Walt Disney Imagineering, has over 30 years of experience transforming stories and narratives into engaging experiences for parks, destinations, and brands around the world. Through Narrative Experience Design, he shows how storytelling is an integral part of an organization's culture and strategy. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/ted",
        "id": 4363554,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=4U_NzIzHOnA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4U_NzIzHOnA/hqdefault.jpg",
        "title": "Creating memories, planting Stories that grow connection | Theron Skees | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:06.499763+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:45:01+00:00",
        "description": "Tra biotecnologie, trapianti sintetici e manipolazioni genetiche, stiamo davvero imparando a fermare — o invertire — il tempo?\n\nIn questo talk, il sociologo Riccardo Campa ci accompagna in un viaggio provocatorio tra filosofia, religione e scienza: dal mito della Pietra Filosofale ai laboratori della Silicon Valley, dalle paure morali alle promesse del biohacking.\nTre scenari si aprono davanti a noi: il corpo che si cura da sé, l’uomo-macchina che non invecchia, e una nuova specie, l’Homo ageras, l’uomo che non conosce più la vecchiaia.\n\nMa siamo pronti a vivere cent’anni? Duecento? A scegliere per chi amiamo tra natura e eternità?\nUn talk che non offre risposte, ma ci invita a riflettere e a guardare dentro la più antica ossessione dell’umanità: vincere la morte. Riccardo Campa, mantovano di nascita e oggi professore ordinario di sociologia all’Università Jagellonica di Cracovia, incarna uno sguardo sul futuro lucido, curioso e privo di pregiudizi. Nelle sue lezioni di “Futures analy",
        "id": 4363555,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PtdkcoROwWw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PtdkcoROwWw/hqdefault.jpg",
        "title": "Fermare l’orologio biologico: il tempo delle decisioni | Riccardo Campa | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:06.689986+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:44:52+00:00",
        "description": "Abbiamo ancora bisogno delle fiabe? In un modo dominato dall'AI, siamo sicuri che abbiano ancora valore? \n\nDanilo Bertazzi, meglio conosciuto come Tonio Cartonio, in questo talk racconta l'origine delle fiabe per poi passare al magico mondo della Melevisione, la tv dei ragazzi.\n\nIl mondo della Melevisione è però passato... e oggi? Anche con l'AI (anzi soprattutto) abbiamo ancora bisogno delle fiabe, basta capire come e con quale linguaggio veicolarle Danilo Bertazzi è l’uomo dietro il celebre Tonio Cartonio di Melevisione, dove insegnava ai bambini che “non si può fare tutto, ma tutto si può imparare!” e ci ha fatto ridere (e riflettere) con la sua contagiosa curiosità. Da allora, non ha mai smesso di giocare con storie, parole e idee. Tra una filastrocca e un esperimento creativo, Danilo continua a ricordarci che imparare può essere un’avventura, basta avere un po’ di fantasia! This talk was given at a TEDx event using the TED conference format but independently organized by a local ",
        "id": 4363556,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zPbh6tvadP8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zPbh6tvadP8/hqdefault.jpg",
        "title": "Abbiamo ancora bisogno delle fiabe? | Danilo Bertazzi | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:06.820300+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:44:47+00:00",
        "description": "Born and raised in Gaza, Sami Al-Ajrami is a journalist who has spent his life witnessing what the world often struggles to see. During the Israel–Hamas war, often referred to as the Gaza war—an armed conflict that began after the Hamas attack on Israel on October 7, 2023— he lost his home, his colleagues, and members of his family, becoming the only voice reporting to Italy from inside Gaza.\n\nMoving from city to city with his daughters, working without safety or reliable connection, he continued to tell the story while everything around him collapsed. What kept him going were the voices of readers and colleagues who reached out through the darkness, reminding him that his words mattered.\n\nHis talk reflects the humanity of a man living through war and the steadfast commitment of a journalist who refused to let silence win. Born on February 14, 1967, in the Jabalya refugee camp, in the North of the Gaza Strip. A journalist based in Gaza, Sami worked for the Wafa news agency for 25 year",
        "id": 4363557,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SGMvVKC8CSE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SGMvVKC8CSE/hqdefault.jpg",
        "title": "What happens when there's no one left to tell? A voice through war | Sami Al-Ajrami | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:06.994096+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:42:02+00:00",
        "description": "Immaginate di partire per un viaggio che va all’indietro nel tempo, fino a quando la vita non era che un respiro nel brodo primordiale. Da lì, risaliamo fino alle cellule, quei minuscoli mattoni che costruiscono tutto ciò che siamo.\n\nIn questo talk, Ludovica Cacopardo -ingegnera biomedica - ci porta nel cuore della sua ricerca: progettare modelli in-vitro, piccoli universi dove le cellule vivono, comunicano e, forse, sfidano le leggi del tempo. Ispirata a Interstellar, la sua intuizione è sorprendente: e se le cellule potessero “piegare” lo spazio-tempo come i pianeti del film?\n\nNasce così INTERCELLAR, un progetto che unisce biologia, fisica e immaginazione per capire come le cellule si muovono, si parlano e si organizzano in strutture complesse.\nUn viaggio tra scienza e poesia, che ci invita a ripensare la vita — non più come dominio dell’uomo, ma come un’armonia di forme che coesistono.\n\nUn passo verso un futuro in cui la ricerca potrà proteggere la salute umana senza sacrificare qu",
        "id": 4363558,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=i4kKNya3VBE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/i4kKNya3VBE/hqdefault.jpg",
        "title": "Viaggio interstellare nel microcosmo cellulare | Ludovica Cacopardo | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:07.186867+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:41:50+00:00",
        "description": "Il gioco è molto più di un passatempo: è emozione, relazione e immaginazione, un vero allenamento alla vita capace di far germogliare fiducia e futuro.\n\nAttraverso esperienze concrete e riflessioni maturate sul campo, viene mostrato come il gioco possa aiutare adulti e giovani a sviluppare fiducia, ascolto, gestione delle emozioni e capacità di stare nel cambiamento. Un invito a riscoprire il valore del gioco come spazio sicuro in cui sperimentare, imparare e trasformarsi. Barbara Chiavarino, con formazione umanistica e certificazioni da coach e formatrice professionista, crea percorsi di crescita per persone e team. Ideatrice di giochi esperienziali come BackUP – Back to the Under Planet (2023), un format premiato per lo sviluppo di leadership, intelligenza emotiva e cooperazione, unisce education, entertainment, formazione su misura e coaching per favorire trasformazioni autentiche. This talk was given at a TEDx event using the TED conference format but independently organized by a ",
        "id": 4363559,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WJEyAU59CSU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WJEyAU59CSU/hqdefault.jpg",
        "title": "Giocare il futuro: un pianeta da immaginare e costruire insieme | Barbara Chiavarino | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:07.441626+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:41:42+00:00",
        "description": "Modern lifestyles often overlook rhythms that the human body has understood for centuries. This talk explores how ancient Indian wisdom—rooted in traditional food habits, daily routines, and seasonal living—offers practical insights for navigating today’s health and lifestyle challenges. Drawing from practices passed down through generations, the speaker highlights how mindful living and respect for the body’s natural intelligence can restore balance and clarity.\n\nAligned with the theme “Rooted to Rise,” the talk invites young audiences to reconnect with their cultural roots and view well-being not as a trend, but as an inherited intelligence. By revisiting timeless wisdom, the talk shows how grounded living can help individuals rise with purpose, resilience, and conscious awareness in a fast-changing world. Senior Nutritionist with the celebrated Rujuta Diwekar and an inspiring TEDx Speaker.\nAt TEDx Sunbeam Sarnath Youth 2025, she will share how being rooted in the right food habits ",
        "id": 4363560,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3HkzbKalxC8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3HkzbKalxC8/hqdefault.jpg",
        "title": "Inherited Wisdom | Jinal Shah | TEDxSunbeam Sarnath Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:07.605364+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:41:33+00:00",
        "description": "Analizzare l’arte con gli occhi della scienza permette di leggere storie, significati e creatività altrimenti invisibili.\n\nAttraverso esempi tratti dal suo lavoro al Metropolitan Museum of Art di New York, Marco Leona spiega come pigmenti, colori e tecniche diventino una chiave per comprendere la creatività degli artisti, il contesto storico e il valore culturale delle opere. Un intervento che dimostra come la scienza non tolga magia all’arte, ma ne amplifichi profondamente il significato. Marco Leona è un chimico e ricercatore italiano, direttore del Dipartimento di Ricerca Scientifica al Metropolitan Museum of Art di New York. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4363561,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SYerybe958s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SYerybe958s/hqdefault.jpg",
        "title": "Leggere l’arte: un viaggio tra materiali e significati | Marco Leona | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:07.764738+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:41:26+00:00",
        "description": "La scienza dietro il momento \"Eureka!\": i lampi di genio, o insight, non siano casuali, ma segnali di idee di altissima qualità e livello di accuratezza.\n\nCarola Salvi, nella sua  ricerca mostra come si forma un insight: esso è preceduto da uno stato di attenzione interna (il classico guardare nel vuoto) per cui siamo portati ad associare concetti tra loro rari e originali. In questo modo diventiamo più creativi.\n\nIn un'era dominata dall'AI, questa abilità potrebbe essere l'ultimo baluardo dell'umanità. Quindi è utile stimolare le idee geniali. Come farlo? Smettere di pensarci, evitare il telefono, e lasciarsi ispirare dallo sguardo nel vuoto. Carola Salvi è una neuroscienziata la cui ricerca indaga i meccanismi neurali dell’insight nel problem solving, della creatività e della flessibilità cognitiva, con approcci che spaziano dalle neuroscienze cognitive e comportamentali alla psicofisiologia. This talk was given at a TEDx event using the TED conference format but independently organ",
        "id": 4363562,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LDtVlutJdu0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LDtVlutJdu0/hqdefault.jpg",
        "title": "La scintilla invisibile: come nasce un'idea creativa | Carola Salvi | TEDxVicenza",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:08.038700+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:40:39+00:00",
        "description": "Nishanth, Naveen, Likith, and Madhavan are a collaborative ensemble dedicated to preserving the ancient martial heritage of Manipur. Their performance seamlessly blends Thang-Ta (The Art of the Sword and Spear) with the rhythmic precision of the Manipuri Stick Dance. Moving as a single unit, the four artists explore \"The Art of Balance\" demonstrating how physical agility, split-second trust, and mental stillness intersect. By transforming warrior disciplines into a \"moving meditation,\" they showcase a powerful metaphor for equilibrium: the ability to remain centered amidst high speed chaos. Through the clashing of sticks and the grace of disciplined motion, they bring the spirit of the Meitei tradition to the global stage. Nishanth is a passionate artist whose work is defined by a deep commitment to the traditional performance arts of Manipur. Specializing in the rigorous discipline of Thang-Ta, he brings an intense focus and creative energy to the stage. His artistry centers on the \"",
        "id": 4363563,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GkCvz1V1HkA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GkCvz1V1HkA/hqdefault.jpg",
        "title": "Manipuri Stick Dance | Nishanth A | TEDxREVA University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T18:19:08.350477+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:40:26+00:00",
        "description": "Hear the story of Mrs. Willie Lee Gay, the 95-year-old historian and teacher. Her journey encompasses over six decades of archiving and teaching Texas history. The state of Texas maintains the Willie Lee Gay Collection, which contains the professional and personal papers of teacher and historian Mrs. Willie Lee Gay. This collection, which dates from 1897 to 2012, includes newsclippings, publications, photos, research materials, programs, assorted photocopied images, and organizations that highlight her work as a historian in documenting and preserving the history of African American communities in Houston. Mrs. Willie Lee Gay served as a dedicated history teacher at the K-12 and college level for over six decades. She taught and lived the very history she shared with her students. Mrs. Gay devoted her life to documenting, preserving, and promoting the historical accomplishments of Texans from the 1800s through the 21st century. She championed the inclusion of African American history ",
        "id": 4363564,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=AD8yaiZRGVk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AD8yaiZRGVk/hqdefault.jpg",
        "title": "Mrs. Willie Lee Gay - Historian | Mrs. Willie Lee Gay & Glenita Shelvin Lampkin | TEDxSunnyside",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:54.389551+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:06:26+00:00",
        "description": "Organized crime undermines democracy and economic development across the globe. According to a recent report by the Global Initiative Against Transnational Organized Crime, 80% of the world’s population lives in countries with a high presence of criminal organizations. When these organizations grow through corruption, fighting them becomes even more difficult.\n\nIn this talk, computational criminologist Gian Maria Campedelli introduces a new approach that uses open data and machine learning to predict where—and when—criminal organizations in Italy are likely to infiltrate local governments. By revealing both the promises and the pitfalls of applying AI to the fight against corruption and organized crime, he invites us to imagine how modern technologies can empower citizens and help build a safer, fairer society. Gian Maria Campedelli is a Research Scientist at Fondazione Bruno Kessler and an incoming Assistant Professor in the Department of Sociology and Social Research at the Universi",
        "id": 4362966,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Dh6TV1RQ_so",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Dh6TV1RQ_so/hqdefault.jpg",
        "title": "What if AI can help us fight organized crime and corruption? | Gian Maria Campedelli | TEDxGeneva",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:54.549659+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:05:43+00:00",
        "description": "Il avait réalisé que l'histoire des peuples indigènes des Antilles était en fait très mal connue du grand public et même des descendants avérés des Kalinagos des Petites Antilles et des Taïnos des Grandes Antilles. Pour cette raison, en accord avec l'organisation de l'évènement, nous avons opté pour un bref entretien basé sur une question et sa réponse. Notre but a consisté à structurer un bref discours pour transmettre des connaissances et réaliser l'importance de l'héritage culturel de ces peuples aux cultures traditionnelles antillaises.\n Son intérêt pour le passé indigène de la Martinique, puis plus tard, pour celui des Antilles, trouve ses origines dans la classe de Sciences naturelles du révérend Père Pinchon, l'un des fondateurs de l'archéologie des petites Antilles. \nSes travaux ont particulièrement porté sur l'art céramique et l'art rupestre des peuples autochtones céramistes des petites et des grandes Antilles et leurs rapports avec ce que nous savons de leurs mythologies. I",
        "id": 4362967,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Do9IA4GigVU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Do9IA4GigVU/hqdefault.jpg",
        "title": "Considérations sur les peuples premiers des Antilles | Henry PETITJEAN ROGET | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:54.766556+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:05:39+00:00",
        "description": "Interprétation en Langue des Signes Française (LSF) du talk d'Eric DELBLOND par Chloé JUMET. \nInterprète et traductrice en LSF, Chloé JUMET est autoentrepreneure et exerce principalement en Guadeloupe, et ponctuellement en Martinique et en Guyane.\nElle porte le projet Lanmen Karaib qui vise à développer l'accessibilité en LSF sur les Antilles-Guyane. Bassiste et compositeur, l'artiste guadeloupéen Eric Delblond est actif depuis plus de 25 ans sur les scènes jazz, caribéennes, urbaines et pop. Il a collaboré avec des artistes de renom tels que Dominik Coco, Tanya Saint-Val, Alain Jean-Marie, Lizz McComb, ou Admiral T, mêlant tournées, créations scéniques et productions discographiques.\nDiplômé de l’IMEP (Ecole de Jazz, Paris), titulaire du Diplôme d’État de professeur de musique et certifié Logic Pro en MAO, il partage son expertise à travers l’enseignement de la basse, de la musique assistée par ordinateur et l’animation d’ateliers de création en Guadeloupe.\nPorté par un désir de tran",
        "id": 4362968,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=o7Z6r98Id14",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/o7Z6r98Id14/hqdefault.jpg",
        "title": "Tout commence par une clave (LSF) | Eric DELBLOND | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:54.974539+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:05:31+00:00",
        "description": "« Tak Pitak Pitak » : un battement simple. Mais essentiel.\nUn motif discret, et pourtant structurant.\nIl traverse les musiques, franchit les frontières, accompagne les traditions.\nPlus qu’un rythme, cette clave devient un marqueur identitaire.\nUn trait d’union entre héritages africains, influences caribéennes et pratiques contemporaines.\nEric, musicien et professeur diplômé d’État, vous invite à explorer comment le « Tak Pitak Pitak » peut être un ancrage culturel, un lien entre les peuples et un langage universel.\nUn talk musical et immersif.\n Bassiste et compositeur, l'artiste guadeloupéen Eric Delblond est actif depuis plus de 25 ans sur les scènes jazz, caribéennes, urbaines et pop. Il a collaboré avec des artistes de renom tels que Dominik Coco, Tanya Saint-Val, Alain Jean-Marie, Lizz McComb, ou Admiral T, mêlant tournées, créations scéniques et productions discographiques.\nDiplômé de l’IMEP (Ecole de Jazz, Paris), titulaire du Diplôme d’État de professeur de musique et certifié ",
        "id": 4362969,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=C0GLpnmKMiE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/C0GLpnmKMiE/hqdefault.jpg",
        "title": "Tout commence par une clave | Eric DELBLOND | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:55.391118+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:05:19+00:00",
        "description": "Interprétation en Langue des Signes Française (LSF) du talk de Nelson FOIX par Chloé JUMET. \nInterprète et traductrice en LSF, Chloé JUMET est autoentrepreneure et exerce principalement en Guadeloupe, et ponctuellement en Martinique et en Guyane.\nElle porte le projet Lanmen Karaib qui vise à développer l'accessibilité en LSF sur les Antilles-Guyane. Scénariste et réalisateur guadeloupéen, l'univers de Neslon FOIX s'articule entre culture guadeloupéenne et culture urbaine.\nAprès trois courts métrages : \"L'enfant seul\", \"5min20sec\" et \"Timoun aw\", présélectionné au César 2022, il écrit et réalise son premier long métrage Zion qui affiche plus de 470 000 entrées.\nPromoteur d'un cinéma guadeloupéen et convaincu que les enfants du territoire doivent écrire leurs propres histoires, il cofonde la société de production Black Moon Film dont il est le Directeur artistique. Il travaille actuellement à son deuxième film et sa première série. This talk was given at a TEDx event using the TED confe",
        "id": 4362970,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Eg6lBJwFMZ0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Eg6lBJwFMZ0/hqdefault.jpg",
        "title": "La magie de l’inspiration (LSF) | Nelson FOIX | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:55.545869+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:05:00+00:00",
        "description": "Qu'est-ce que l'inspiration, d'où vient-elle et comment la provoquer ? \nNe cherchons pas la réponse, posons-nous déjà la question.\n Scénariste et réalisateur guadeloupéen, l'univers de Neslon FOIX s'articule entre culture guadeloupéenne et culture urbaine.\nAprès trois courts métrages : \"L'enfant seul\", \"5min20sec\" et \"Timoun aw\", présélectionné au César 2022, il écrit et réalise son premier long métrage Zion qui affiche plus de 470 000 entrées.\nPromoteur d'un cinéma guadeloupéen et convaincu que les enfants du territoire doivent écrire leurs propres histoires, il cofonde la société de production Black Moon Film dont il est le Directeur artistique. Il travaille actuellement à son deuxième film et sa première série. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4362971,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fvrfS9qPIEg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fvrfS9qPIEg/hqdefault.jpg",
        "title": "La magie de l’inspiration | Nelson FOIX | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:55.706645+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:04:36+00:00",
        "description": "Interprétation en Langue des Signes Française (LSF) du talk de Maïtena JEAN par Chloé JUMET. \nInterprète et traductrice en LSF, Chloé JUMET est autoentrepreneure et exerce principalement en Guadeloupe, et ponctuellement en Martinique et en Guyane.\nElle porte le projet Lanmen Karaib qui vise à développer l'accessibilité en LSF sur les Antilles-Guyane. Scientifique de formation, Maïtena JEAN décide après sa thèse de quitter le monde de la recherche pour celui de la protection et la gestion de l'environnement en intégrant l'équipe du Parc national de la Guadeloupe. \n\nConvaincue que le changement des mentalités se fera par la sensibilisation, elle commence sa carrière au service communication du Parc national. Après 6 années passées à développer notamment des outils pédagogiques, elle retourne vers la science, en devenant responsable du service Patrimoines naturels culturels et paysagers, service en charge notamment des suivis scientifiques pour le Parc national. This talk was given at a ",
        "id": 4362972,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wcvMz6TXWXA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wcvMz6TXWXA/hqdefault.jpg",
        "title": "Protéger nos eaux, un défi inaccessible ? (LSF) | Maïtena JEAN | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:55.868305+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:04:28+00:00",
        "description": "PROTEGER, un simple mot qui résume une mission que s’est donnée une équipe de scientifiques : Améliorer la biodiversité des rivières, tout en préservant les berges des rivières de Guadeloupe fortement aménagées pour la protection des biens et des personnes.\n Scientifique de formation, Maïtena JEAN décide après sa thèse de quitter le monde de la recherche pour celui de la protection et la gestion de l'environnement en intégrant l'équipe du Parc national de la Guadeloupe. \n\nConvaincue que le changement des mentalités se fera par la sensibilisation, elle commence sa carrière au service communication du Parc national. Après 6 années passées à développer notamment des outils pédagogiques, elle retourne vers la science, en devenant responsable du service Patrimoines naturels culturels et paysagers, service en charge notamment des suivis scientifiques pour le Parc national. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. L",
        "id": 4362973,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3dy8JMg4TIE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3dy8JMg4TIE/hqdefault.jpg",
        "title": "Protéger nos eaux, un défi inaccessible ? | Maïtena JEAN | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:56.010284+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:04:20+00:00",
        "description": "Interprétation en Langue des Signes Française (LSF) du talk de Ludovic LAVANNE par Chloé JUMET. \nInterprète et traductrice en LSF, Chloé JUMET est autoentrepreneure et exerce principalement en Guadeloupe, et ponctuellement en Martinique et en Guyane.\nElle porte le projet Lanmen Karaib qui vise à développer l'accessibilité en LSF sur les Antilles-Guyane. Spécialiste de l’accompagnement des adolescents, il compte plus de 20 ans d’expérience au sein de la Protection judiciaire de la jeunesse (PJJ) où il a exercé comme éducateur puis directeur des services. Il dirige aujourd’hui le centre éducatif fermé de Port-Louis en Guadeloupe, pour le Groupe SOS Jeunesse.\nTitulaire de formations en théologie et sciences de l’éducation, il mène en parallèle un doctorat en criminologie à l’Université de Reims Champagne-Ardenne, sous la direction de Martine Herzog-Evans. Sa thèse interroge les ponts entre recherche scientifique et pratiques éducatives en milieu carcéral ou protégé.\nEngagé dans son métie",
        "id": 4362974,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zPZUHyxxfxg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zPZUHyxxfxg/hqdefault.jpg",
        "title": "Quand la science rencontre la violence (LSF) | Ludovic LAVANNE | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:56.138612+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:04:12+00:00",
        "description": "On ne naît pas violent, on le devient. La violence est un comportement appris. Et quand la science entre en scène, elle éclaire, dénoue et bouscule. Elle transforme nos pratiques et trace des routes au milieu du chaos. Usus probatus, ars robusta.\n Spécialiste de l’accompagnement des adolescents, il compte plus de 20 ans d’expérience au sein de la Protection judiciaire de la jeunesse (PJJ) où il a exercé comme éducateur puis directeur des services. Il dirige aujourd’hui le centre éducatif fermé de Port-Louis en Guadeloupe, pour le Groupe SOS Jeunesse.\nTitulaire de formations en théologie et sciences de l’éducation, il mène en parallèle un doctorat en criminologie à l’Université de Reims Champagne-Ardenne, sous la direction de Martine Herzog-Evans. Sa thèse interroge les ponts entre recherche scientifique et pratiques éducatives en milieu carcéral ou protégé.\nEngagé dans son métier, il partage son temps entre la gestion de l’établissement et ses travaux universitaires. Mélomane autodida",
        "id": 4362975,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=C8iHqmqRKdY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/C8iHqmqRKdY/hqdefault.jpg",
        "title": "Quand la science rencontre la violence | Ludovic LAVANNE | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:56.226630+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:04:03+00:00",
        "description": "Rafaela compartilha sua experiência como pessoa com deficiência e destaca os desafios enfrentados aqueles que possuem deficiências ocultas, como preconceito e falta de compreensão. Ela explica a diferença entre acessibilidade e inclusão e traz trouxe reflexões sobre estereótipos, deficiências ocultas e a importância de enxergar as pessoas além das limitações. Rafaela Espírito Santo é estudante do 7º ano do Colégio Santo Inácio. Determinada e inspiradora, Rafaela vive com paralisia cerebral (hemiparesia). This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4362976,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=JZ8iz9akvic",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JZ8iz9akvic/hqdefault.jpg",
        "title": "Inclusão de verdade para pessoas com deficiência | Rafaela Espirito Santo | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:56.312794+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:04:00+00:00",
        "description": "Interprétation en Langue des Signes Française (LSF) du talk d'Axel GRAVA par Chloé JUMET. \nInterprète et traductrice en LSF, Chloé JUMET est autoentrepreneure et exerce principalement en Guadeloupe, et ponctuellement en Martinique et en Guyane.\nElle porte le projet Lanmen Karaib qui vise à développer l'accessibilité en LSF sur les Antilles-Guyane. Axel GRAVA, urbaniste guadeloupéen, est marqué dès l’enfance par son surnom « Mèt Démokrit », reflétant son engagement pour la justice. Après des études en lettres, histoire et géographie, il se consacre à l’urbanisme pour concrétiser sa vision d’un aménagement équitable des territoires.\nDe retour en Guadeloupe en 2015, il anime le Réseau d’Urbanisme Durable local (RUDG) et devient référent « Urbanisme » au CAUE, accompagnant collectivités et professionnels. Il enseigne aussi au  en Master Développement Territorial et Gestion des Espaces Insulaires de l’Université des Antilles et préside le réseau caribéen de coopération et solidarité intern",
        "id": 4362977,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qnFa6OlKwjQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qnFa6OlKwjQ/hqdefault.jpg",
        "title": "971 nuances d'urbanisme (LSF) | Axel GRAVA | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:56.399598+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:03:53+00:00",
        "description": "Quand s’est présentée l’opportunité de “pitcher” lors du TEDx 2025; si j’ai pensé spontanément, comme angle d’attaque, au concept de la \"gestion des vides et des pleins\"... je me suis aussi vite interrogé sur la capacité d’un speech dédié, même éminemment pédagogique, à instiller, titiller, et garder sur la durée, l’intérêt du public.\nEn visant à initier, de manière ludique, inédite et originale, tout un chacun, à l’urbanisme, une piste s’est imposée : proposer une Kalou-idoscopie ….\nUn exercice alliant textuel et sensoriel, appréhendant différemment cette science de la distribution \"équilibrée\", des êtres et des activités, dans leur espace, en s’appuyant sur le prisme de la couleur via spécifiquement quelques 7 nuances. Chaque nuance servant, à la fois, à diagnostiquer et à prescrire ; en vue de contribuer, virtuellement, à édifier un archipel Guadeloupe \"Neuf, sans 71 nuances d'urbanisme\".\nDes beiges du filigrane historique du projet urbain, au transparent de l’esprit de nos lieux, ",
        "id": 4362978,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MpjKkDZwRxA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MpjKkDZwRxA/hqdefault.jpg",
        "title": "971 nuances d'urbanisme | Axel GRAVA | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:56.529753+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:03:40+00:00",
        "description": "Interprétation en Langue des Signes Française (LSF) du talk de Damiens NICOLAS par Chloé JUMET. \nInterprète et traductrice en LSF, Chloé JUMET est autoentrepreneure et exerce principalement en Guadeloupe, et ponctuellement en Martinique et en Guyane.\nElle porte le projet Lanmen Karaib qui vise à développer l'accessibilité en LSF sur les Antilles-Guyane. Damiens NICOLAS travaille entre la Guadeloupe, la France hexagonale et les Caraïbes. Ses centres d’intérêt portent sur l’écologie politique, les théories critiques de la modernité et le design de l’action publique dans les territoires d’Outre-mer.\nDepuis 2020, il est membre co-fondateur de l’Observatoire Terre-Monde, dédié aux écologies politiques des Outre-mer et de leurs régions voisines. Fellow de la Caribbean Climate Justice Leaders Academy (Island Innovation/Open Society), il a récemment exercé en tant que chargé d’appui à la lutte contre les sargasses dans le bassin caribéen, dans le cadre d’un Volontariat de Solidarité Internati",
        "id": 4362979,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=P9VqurvcjvU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/P9VqurvcjvU/hqdefault.jpg",
        "title": "Les sargasses : un bien commun pour une Caraïbe plus unie (LSF) | Damiens NICOLAS | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T17:16:56.742922+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T17:03:31+00:00",
        "description": "Dans son talk, Damiens Nicolas nous invite à changer de perspective sur la crise environnementale des sargasses, un mur d’algues invasives qui s’abat périodiquement sur les Caraïbes. À partir de son expérience en diplomatie climatique, il interroge les réponses fragmentées des Etats et territoires de la mer des Caraïbes face à ce risque émergent. En représentant les sargasses comme un commun négatif, c’est à dire un bien commun qui ne nous unie pas par choix, mais par contrainte, il appelle à construire des ponts pour une Caraïbe plus unie et plus résiliante. \nÉtudiant et porteur de plaidoyer écologiste, il explore la mise en récit de la justice climatique à partir des territoires dits d’Outre-mer. En 2020, Il co-fonde l’Observatoire Terre-Monde, un centre d’étude et d’action dédié aux écologies politiques des Outre-mer et de leurs proches régions. Fellow 2024 de la Caribbean Climate Justice Leaders Academy, et ancien volontaire à l’Association des Etats de la Caraïbe, son activité de",
        "id": 4362980,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XOgAPO0NMPA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XOgAPO0NMPA/hqdefault.jpg",
        "title": "Les sargasses : un bien commun pour une Caraïbe plus unie | Damiens NICOLAS | TEDxPointeaPitre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T16:15:52.139311+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T16:08:03+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker's personal business approach to and understanding of stress, burnout, and the nervous system. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf \n\nWe are bombarded by daily news that drains our focus, energy, and well-being. In this short and powerful TEDx talk, speaker, facilitator and workplace wellness consultant, Marly Q Casanova, M.Ed, reveals a simple micro-habit to help you tune out the noise and tune in to the news that matters most. Watch and learn how to prevent burnout, reclaim personal wellness, and build burnout-resilient workplace cultures. Marly Q Casanova, M.Ed. is a former burned-out event planner turned keynote speaker, emcee, and facilitator of Wellness at Work™ experiences. She helps busy leaders and teams beat burnout, spark engagement, and make wellness a priority (withou",
        "id": 4362270,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=y8Hj51bS0Mw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/y8Hj51bS0Mw/hqdefault.jpg",
        "title": "What's the News? | Marly Q Casanova | TEDxDoral",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T16:15:52.450935+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T16:05:09+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker’s personal views and business approach to design, healing, and the environment. Several claims in this talk lack sufficient scientific support. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nDespite our digital connectedness, many feel disconnected from themselves, others, and nature. Alden Stoner experienced this after devastating personal loss. She found solace in nature, and now helps communities create and sustain healing green spaces. In her talk, she discusses insights from community journals, highlighting modern disconnection and the restorative power of nature for finding a better way.\n\n Alden E. Stoner is CEO of Nature Sacred, a national nonprofit supporting green spaces—called Sacred Places—that offer a temporary place of sanctuary, encourage reflection, provide solace, and enge",
        "id": 4362271,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=v5hYuKUXkJg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/v5hYuKUXkJg/hqdefault.jpg",
        "title": "The Connection You Are Missing in a Hyper-connected Age | Alden Stoner | TEDxWalden Pond",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-19T16:15:52.879443+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-19T16:02:22+00:00",
        "description": "NOTE FROM TED: This talk only represents the speaker's personal views and understanding of the brain, environment, and behavior. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nWhat if the problem in your relationship isn’t the person,  but the patterns you’re both trapped in? In this talk, Reg Malhotra reveals how emotional memories become anchored to our environments and why couples keep replaying the same conflicts for years. Through science, personal story, and a simple three-step framework, he shows how changing your environment and your emotional “script” can completely transform your relationship. Reg Malhotra is an internationally recognized mindset and relationship transformation expert who helps people break lifelong patterns and rebuild the way they love, lead, and live. A Master Trainer in Neuro-Linguistic Programming and Hypnosi",
        "id": 4362272,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ltNljDHKyLg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/ltNljDHKyLg/hqdefault.jpg",
        "title": "The Hidden Patterns That Quietly Destroy Relationships | Reg Malhotra | TEDxTemecula",
        "vote": 0
    }
]