[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T16:30:03+00:00",
        "description": "Plenty of games have made us laugh out loud with unbelievably crazy weapon projectiles throughout the decades. This list of 15 things we shot at enemies represents the most ridiculous projectiles imagined by game developers. \n\nThe criteria is simple: how outlandish and unique is the projectile? Also worth noting is that one or two entries on this list aren’t technically shot at enemies but rather dropped on them (though still using a gun).\n\nWhile some of these weapons are purely comedic, a vast majority actually do a ton of damage, proving to be quite useful in combat. The games on this list span decades, ranging from family-friendly properties to gore-heavy shooters.",
        "id": 2276884,
        "language": null,
        "link": "https://www.youtube.com/watch?v=7eEckUR6ieA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7eEckUR6ieA/hqdefault.jpg",
        "title": "From Sharks To A Freaking Thunderjaw: 15 Craziest Things We Shot At Enemies In Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T14:00:15+00:00",
        "description": "Coming from the South Korean studio behind widely played multiplayer beat ‘em up Dungeon Fighter Online together with publisher Nexon, is The First Berserker: Khazan, a hardcore action RPG set 800 years before the events of Dungeon Fighter Online.\n\nYou’ll assume command of the general Khazan and embark on a quest for vengeance whilst revealing secrets and conspiracies surrounding the empire which exiled and left him for dead. Brutal, lightning-fast gameplay, memorable boss fights, a gripping story, wide-ranging customization and upgrading, plus eye-catching 3D cel-shaded graphics means The First Berserker: Khazan stands a fighting chance of standing out alongside Nioh, Lies of P, and Black Myth: Wukong as a Soulslike with distinction.\n\nHere are 15 things I can't wait to do in The First Berserker Khazan.",
        "id": 2275912,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DBw6A5uGvZc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DBw6A5uGvZc/hqdefault.jpg",
        "title": "15 Things You Can't MISS DOING When The First Berserker Khazan Drops",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T09:30:33+00:00",
        "description": "Usually, when a developer brings a massive free upgrade to its beloved game - enough to warrant a separate product page - it's cause for celebration. However, Rockstar Games' upgrades have been left wanting in the past few years, not the least of which includes Grand Theft Auto 5 Enhanced and Expanded.\n\nDebuting in 2022 for Xbox Series X/S and PS5, it rightly received criticism for offering exclusive content unavailable to previous-gen consoles and PC. The content has since become available to PC players as Grand Theft Auto 5 Enhanced, which Rockstar further augmented with features like DLSS and FSR, ray-traced global illumination and ambient occlusion, and faster loading times.\n\nUnfortunately, the overall execution leaves much to be desired, especially for Grand Theft Auto Online players. Grand Theft Auto 5 may still be a classic, especially with its story, and the lighting looks good, but Rockstar's overall approach to the upgrade is far from perfect.",
        "id": 2274867,
        "language": null,
        "link": "https://www.youtube.com/watch?v=zXe_mUI1knQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zXe_mUI1knQ/hqdefault.jpg",
        "title": "Grand Theft Auto 5 Enhanced PC - WAS IT WORTH WAITING 3 YEARS?",
        "vote": 0
    }
]