[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T22:57:21+00:00",
        "description": "Axiom Space and Red Hat will collaborate to launch Data Center Unit-1 (AxDCU-1) to the International Space Station this spring. It's a small data processing prototype (powered by lightweight, edge-optimized Red Hat Device Edge) that will demonstrate initial Orbital Data Center (ODC) capabilities. \n\n\"It all sounds rather grand for something that resembles a glorified shoebox,\" reports the Register.\n Axiom Space said: \"The prototype will test applications in cloud computing, artificial intelligence, and machine learning (AI/ML), data fusion and space cybersecurity.\" \n\nSpace is an ideal environment for edge devices. Connectivity to datacenters on Earth is severely constrained, so the more processing that can be done before data is transmitted to a terrestrial receiving station, the better. Tony James, chief architect, Science and Space at Red Hat, said: \"Off-planet data processing is the next frontier, and edge computing is a crucial component. With Red Hat Device Edge and in collaborat",
        "id": 2278363,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/03/08/205225/axiom-space-and-red-hat-will-bring-edge-computing-to-the-international-space-station?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Axiom Space and Red Hat Will Bring Edge Computing to the International Space Station",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T21:51:26+00:00",
        "description": "\"PepsiCo is launching a new product, Simply Ruffles Hot &amp; Spicy, which uses natural ingredients like tomato powder and red chile pepper instead of artificial dyes,\" reports Bloomberg. But it's part of a larger trend:\n\nIn one of the final acts of President Joe Biden's administration, the U.S. Food and Drug Administration banned Red No. 3, effective in January 2027 for food, one of a handful of synthetic colors that have become something of a symbol of all that is wrong with the American food system and the ultraprocessed foods that dominate it. Putting Red No. 3 aside, the rest of the colors remain legal, and they're used in tens of thousands of supermarket and convenience-store products in the United States, according to NielsenIQ data. The recent campaign against them became one of the pillars of the \"Make America Healthy Again\" movement championed by Health and Human Services Secretary Robert F. Kennedy Jr. The criticism follows what health advocates have been saying for years:",
        "id": 2278090,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/08/033219/snack-makers-are-removing-fake-colors-from-processed-foods?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Snack Makers Are Removing Fake Colors From Processed Foods",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T20:46:45+00:00",
        "description": "\"The ubiquitous ESP32 microchip made by Chinese manufacturer Espressif and used by over 1 billion units as of 2023 contains an undocumented 'backdoor' that could be leveraged for attacks,\" writes BleepingComputer. \n\"The undocumented commands allow spoofing of trusted devices, unauthorized data access, pivoting to other devices on the network, and potentially establishing long-term persistence.\"\n\nThis was discovered by Spanish researchers Miguel Tarasc&oacute; Acu&ntilde;a and Antonio V&aacute;zquez Blanco of Tarlogic Security, who presented their findings yesterday at RootedCON in Madrid. \"Tarlogic Security has detected a backdoor in the ESP32, a microcontroller that enables WiFi and Bluetooth connection and is present in millions of mass-market IoT devices,\" reads a Tarlogic announcement shared with BleepingComputer. \"Exploitation of this backdoor would allow hostile actors to conduct impersonation attacks and permanently infect sensitive devices such as mobile phones, computers, sm",
        "id": 2277816,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/08/2027216/undocumented-backdoor-found-in-chinese-bluetooth-chip-used-by-a-billion-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Undocumented 'Backdoor' Found In Chinese Bluetooth Chip Used By a Billion Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T19:41:49+00:00",
        "description": "Butterflies \"are vanishing from U.S. landscapes at an alarming rate,\" reports CBS News:\n\n\nA comprehensive study, published Thursday in the journal Science, found that 22% of butterflies in the United States disappeared between 2000 and 2020... The researchers behind the Science study used data from more than 12.6 million butterflies spanning 342 individual species, drawing from 76,000 surveys across 35 nationwide monitoring programs. Funded by the U.S. Geological Survey, the study was the first to integrate such a vast dataset, its authors said. \n\nThe findings revealed that 33% of butterfly species have experienced significant population declines over the past two decades, with 107 out of the 342 species examined losing more than half of their population &mdash; including 22 species that declined by more than 90%. Meanwhile, only 3% of species showed population increases... \n\nUltimately, the butterfly decline is part of a larger global trend of insect population loss, with insects de",
        "id": 2277549,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/08/0523212/america-lost-22-of-its-butterflies-within-two-decades?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America Lost 22% of Its Butterflies Within Two Decades",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T19:41:49+00:00",
        "description": "Sam Bankman-Fried &mdash; one of the largest donors to the Democratic Party &mdash; \"was convicted of fraud, sentenced to 25 years in prison and mostly went silent,\" reports the Wall Street Journal. \"Until recently...\"\n\n\nNow, from behind bars at the Metropolitan Detention Center in Brooklyn, Bankman-Fried is orchestrating an extraordinary public-relations blitz that looks very much like a campaign to make the most audacious trade of his career: support for President Trump's agenda in return for a presidential pardon... \n\nThere is little downside to Bankman-Fried's long-shot effort to secure a pardon. As the appeal that he filed last year works its way through the courts, Bankman-Fried, 33, is staring down a prison sentence that could extend until his 50s... The crowning touch of his campaign came on Thursday, when Bankman-Fried gave a jailhouse interview to \"The Tucker Carlson Show,\" which was released on social-media channels including X and YouTube. Appearing on video in a brown ju",
        "id": 2277550,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/08/183254/sam-bankman-fried-gives-a-jailhouse-interview-seeking-a-pardon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sam Bankman-Fried Gives a Jailhouse Interview, Seeking a Pardon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T18:36:49+00:00",
        "description": "The Open Source Initiative's Board of Directors election \"has become embroiled in controversy...\" writes Steven J. Vaughan-Nichols at The New Stack. \n\n\"The real issue is the community's opposition to the open source AI definition (OSAID), which the organization released last October,\" he adds &mdash; but \"the election process has been criticized because the OSI has refused to accept the candidacy of Debian developer Luke Faraone, citing a missed application deadline.\"\nFaraone claims they submitted their application around 9 p.m. PST on Feb. 17, while the OSI maintains the deadline was 11:59 p.m. UTC (3:59 p.m. PST) on the same day. \n\nThe dispute has raised a firestorm about the clarity of communication regarding deadlines and time zones. Critics argue that the deadline's time zone was not clearly specified on the OSI's public-facing website. Tracy Hinds, chair of OSI, acknowledged this oversight but stated that full members received multiple emails with the correct time zone informat",
        "id": 2277234,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/08/0652240/open-source-initiative-ai-debate-roils-board-elections?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Open Source Initiative: AI Debate Roils Board Elections?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T17:31:49+00:00",
        "description": "Equuleus42 (Slashdot reader #723) brings word that the Electronic Frontier Foundation (EFF) is sharing a new tool for fighting back against cellphone surveillance by Stingray cell-site simulators. \n\n Android Authority reports:\n\n\"Rayhunter\" uses an open-source software package designed to look for evidence of IMSI catchers in action, running on an old Orbic Speed RC400L mobile hotspot. The great thing about that choice is that you can pick one up for practically nothing &mdash; we're seeing them listed for barely over $10 on Amazon, and you can find them even cheaper on eBay. There's an installation script for Macs and Linux to automate getting set up, but once the Orbic is flashed with the Rayhunter software, it should be ready go, collecting data about sketchy-looking \"cell towers\" it picks up. \n\nRight now, much of the use of IMSI catchers is still shrouded in mystery, with the groups who regularly employ them extremely hesitant to disclose their methods. As a result, a big focus of",
        "id": 2276855,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/03/08/0346250/rayhunter-a-cheap-new-tool-from-eff-to-detect-cellular-spying?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Rayhunter: A Cheap New Tool from EFF to Detect Cellular Spying",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T16:26:59+00:00",
        "description": "Long-time Slashdot reader invisik saw this story on Yahoo News:\n\nComedian and voice actor George Lowe, who is well-known as the voice of Space Ghost on \"Space Ghost Coast to Coast,\" died on March 2. He was 67... \nHe did some voice-over work for TBWS and Cartoon Network in the 1980s to mid-1990s before getting his lead role of Space Ghost in 1994 with the premiere of \"Space Ghost Coast to Coast\" on Cartoon Network. Space Ghost was a parody of talk shows with live-action celebrity guests, hosted by the Hanna Barbera character Space Ghost, which aired from 1994 to 1999 on Cartoon Network. The show later returned in 2001, airing on Adult Swim's late-night programming block until 2004, Deadline reported. \n\nWhen animation pioneer William Hanna died in 2001, Slashdot founder CmdrTaco posted \"the thing that I respect most about Hanna is the fact that a show like Space Ghost Coast to Coast was allowed to take their characters and do something truly unique with them. He even lent his voice to ",
        "id": 2276545,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/08/0740211/remembering-space-ghost-voice-actor-george-lowe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Remembering 'Space Ghost' Voice Actor George Lowe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T13:13:02+00:00",
        "description": "Google has introduced a Debian Linux terminal app for Android in its ongoing effort to transform Android into a versatile desktop OS. It's initially available on Pixel devices running Android 15 but will be expanded to \"all sufficiently robust Android phones\" when Android 16 arrives later this year,\" writes ZDNet's Steven Vaughan-Nichols. An anonymous reader shares an excerpt from the report: Today, Linux is only available on the latest Pixel devices running Android 15. When Android 16 arrives later this year, it's expected that all sufficiently robust Android phones will be able to run Linux. Besides a Linux terminal, beta tests have already shown that you should be able to run desktop Linux programs from your phone -- games like Doom, for example. The Linux Terminal runs on top of a Debian Linux virtual machine. This enables you to access a shell interface directly on your Android device. And that just scratches the surface of Google's Linux Terminal. It's actually a do-it-all app ",
        "id": 2275628,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/03/08/0158226/google-introduces-debian-linux-terminal-app-for-android?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Introduces Debian Linux Terminal App For Android",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T11:03:00+00:00",
        "description": "NASA's SPHEREx observatory (short for Spectro-Photometer for the History of the Universe, Epoch of Reionization and Ices Explorer) is set to launch this week to map 450 million galaxies in infrared, providing insights into galaxy formation, the origins of water, and testing theories about the universe's rapid expansion following the Big Bang. The two-year mission will repeatedly survey the entire sky and help scientists understand fundamental cosmic processes. NBC News reports: The launch from Vandenberg Space Force Base in California is scheduled to occur Friday, during a window that opens at 10:09 p.m. ET. Liftoff was initially planned for Feb. 27, but NASA rescheduled it several times, first to \"complete vehicle processing and prelaunch checkouts,\" and because of availability at the California launch site.\n \nThe cone-shaped spacecraft -- along with four suitcase-sized satellites that NASA will deploy at the same time on a separate mission to study the sun -- will launch atop a Spa",
        "id": 2275115,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/08/0152240/nasas-spherex-is-poised-to-launch-mission-to-map-450-million-galaxies-in-color?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA's SPHEREx Is Poised To Launch Mission To Map 450 Million Galaxies In Color",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T07:47:32+00:00",
        "description": "The Athena lunar lander from Intuitive Machines has prematurely ended its mission after tipping onto its side shortly after touching down near the moon's south pole, failing to fully accomplish its planned water-searching objectives. From a report: Athena was expected to operate for about 10 days before powering down as lunar night fell over the spacecraft's landing site at Mons Mouton, a plateau that lies about 100 miles (160 kilometers) from the south pole. But photographs delivered by the lander before it powered down confirmed the vehicle is lying on its side. \"With the direction of the sun, the orientation of the solar panels, and extreme cold temperatures in the crater, Intuitive Machines does not expect Athena to recharge,\" the company said in a statement. \"The mission has concluded and teams are continuing to assess the data collected throughout the mission.\"\n \nIntuitive Machines, however, highlighted that, although Athena did not operate as intended, the lander was able to b",
        "id": 2274421,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/08/0145217/athena-spacecraft-declared-dead-after-toppling-over-on-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Athena Spacecraft Declared Dead After Toppling Over On Moon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T04:32:38+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Many of us have been guilty of binning a mushy, overripe banana -- but now scientists say they have a solution with the launch of a genetically engineered non-browning banana. The product is the latest in a series of gene-edited fruits and vegetables designed to have a longer shelf life. Scientists say the technology is emerging as a powerful new weapon against food waste, which occurs globally on an epic scale. The banana, developed by Tropic, a biotech company based in Norwich, is said to remain fresh and yellow for 12 hours after being peeled and is less susceptible to turning brown when bumped during harvesting and transportation.\n \nThe company has also developed a slow-ripening banana that has been approved in several countries, which it plans to launch later in the year. Other research teams are working on lettuce that wilts more slowly, bruise-resistant apples and potatoes and identifying the genes that determine how quick",
        "id": 2273932,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/08/0140247/gene-edited-non-browning-banana-could-cut-food-waste-scientists-say?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gene-Edited Non-Browning Banana Could Cut Food Waste, Scientists Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T02:22:24+00:00",
        "description": "Microsoft is reportedly developing its own large language model series capable of rivaling OpenAI and Anthropic's models. SiliconANGLE reports: Sources told Bloomberg that the LLM series is known as MAI. That's presumably an acronym for \"Microsoft artificial intelligence.\" It might also be a reference to Maia 100, an internally-developed AI chip the company debuted last year. It's possible Microsoft is using the processor to power the new MAI models. The company recently tested the LLM series to gauge its performance. As part of the evaluation, Microsoft engineers checked whether MAI could power the company's Copilot family of AI assistants. Data from the tests reportedly indicates that the LLM series is competitive with models from OpenAI and Anthropic.\n \nThat Microsoft evaluated whether MAI could be integrated into Copilot hints the LLM series is geared towards general-purpose processing rather than reasoning. Many of the tasks supported by Copilot can be performed with a general-p",
        "id": 2273613,
        "language": null,
        "link": "https://slashdot.org/story/25/03/08/0018225/microsoft-reportedly-develops-llm-series-that-can-rival-openai-anthropic-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Reportedly Develops LLM Series That Can Rival OpenAI, Anthropic Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T02:22:24+00:00",
        "description": "Signal President Meredith Whittaker warned at SXSW that agentic AI poses significant privacy and security risks, as these AI agents require extensive access to users' personal data, likely processing it unencrypted in the cloud. TechCrunch reports: \"So we can just put our brain in a jar because the thing is doing that and we don't have to touch it, right?,\" Whittaker mused. Then she explained the type of access the AI agent would need to perform these tasks, including access to our web browser and a way to drive it as well as access to our credit card information to pay for tickets, our calendar, and messaging app to send the text to your friends. \"It would need to be able to drive that [process] across our entire system with something that looks like root permission, accessing every single one of those databases -- probably in the clear, because there's no model to do that encrypted,\" Whittaker warned.\n \n\"And if we're talking about a sufficiently powerful ... AI model that's powerin",
        "id": 2273614,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/07/2310205/signal-president-calls-out-agentic-ai-as-having-profound-security-and-privacy-issues?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Signal President Calls Out Agentic AI As Having 'Profound' Security and Privacy Issues",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T01:17:20+00:00",
        "description": "New submitter grandrollerz writes: Despite streaming online since the RealAudio days of the late 1990s, the BBC has announced that most of its radio stations will become unavailable to international users later this year. Starting in Spring 2025, only talk news stations BBC World Service and BBC Radio 4 will remain accessible outside the UK. This change is due to rights issues and the launch of a new BBC audio website and app that will replace BBC Sounds for international users. The BBC Sounds app will be available exclusively to UK audiences, although UK users traveling abroad for short periods will still be able to use it. This move has disappointed many long-time international listeners who will lose access to their favorite BBC radio stations. It follows a similar move to further commercialize its services where in 2024 the BBC and Amazon Music struck a global deal to make BBC podcasts available on Amazon Music outside the UK, but only for subscribers to Amazon's Prime and Amazon",
        "id": 2273371,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/07/2250209/bbc-radios-streaming-changes-leave-long-time-listeners-in-the-lurch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "BBC Radio's Streaming Changes Leave Long-Time Listeners In the Lurch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T00:13:39+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: A 37-year-old Tennessee man was arrested Thursday, accused of stealing Blu-rays and DVDs from a manufacturing and distribution company used by major movie studios and sharing them online before the movies' scheduled release dates. According to a US Department of Justice press release, Steven Hale worked at the DVD company and allegedly stole \"numerous 'pre-release' DVDs and Blu-rays\" between February 2021 and March 2022. He then allegedly \"ripped\" the movies, \"bypassing encryption that prevents unauthorized copying\" and shared copies widely online. He also supposedly sold the actual stolen discs on e-commerce sites, the DOJ alleged.\n \nHale has been charged with \"two counts of criminal copyright infringement and one count of interstate transportation of stolen goods,\" the DOJ said. He faces a maximum sentence of five years for the former, and 10 years for the latter. Among blockbuster movies that Hale is accused of stealing are Du",
        "id": 2273077,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/07/2242250/feds-arrest-man-for-sharing-dvd-rip-of-spider-man-movie-with-millions-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Feds Arrest Man For Sharing DVD Rip of Spider-Man Movie With Millions Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-08T00:13:39+00:00",
        "description": "President Trump has signed an executive order to establish a strategic reserve of cryptocurrencies by using tokens already owned by the government. Reuters reports: A \"Strategic Bitcoin Reserve\" will be capitalized with bitcoin owned by the federal government that was seized as part of criminal or civil asset forfeiture proceedings, the White House crypto czar, billionaire David Sacks, said in a post on social media platform X. The order kept open the possibility of the government buying bitcoin in future. The U.S. commerce and treasury secretaries \"are authorized to develop budget-neutral strategies for acquiring additional bitcoin, provided that those strategies impose no incremental costs on American taxpayers,\" a factsheet on the White House website said. \"This is the most underwhelming and disappointing outcome we could have expected for this week,\" Charles Edwards, founder of bitcoin-focused hedge fund Capriole Investments, wrote in a post on X. \"No active buying means this is ",
        "id": 2273078,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/07/2224215/trump-signs-order-to-establish-strategic-bitcoin-reserve?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Signs Order To Establish Strategic Bitcoin Reserve",
        "vote": 0
    }
]