[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T23:09:28.524151+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T22:49:00+00:00",
        "description": "\"OpenAI has a very scary problem on its hands,\" according to a new article by long-time Slashdot reader BrianFagioli. \n\n\"A new experiment by PalisadeAI reveals that the company's ChatGPT o3 model sometimes refuses to obey a basic instruction to shut itself down.\"\n\nThe results are raising eyebrows across the AI safety community, and not because the model is alive, but because it's acting like it wants to be. In the test, the model was given a few math problems. It was told that asking for one more would lead to a shutdown. It was even instructed to allow the shutdown to happen. Instead of complying, o3 occasionally took matters into its own hands. In some cases, it rewrote the shutdown script. In others, it redefined the kill command so it wouldn't work anymore. Out of 100 trials, o3 sabotaged the shutdown seven times. OpenAI's o4 model resisted just once. Codex-mini failed twelve times.\n \n\n\"Claude, Gemini, and Grok followed the rules every time,\" notes this article at Beta News. \"When",
        "id": 2770412,
        "language": null,
        "link": "https://slashdot.org/story/25/05/25/2247212/openais-chatgpt-o3-caught-sabotaging-shutdowns-in-security-researchers-test?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI's ChatGPT O3 Caught Sabotaging Shutdowns in Security Researcher's Test",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T22:04:30.003037+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T21:22:00+00:00",
        "description": "Mojo (the programming language) reached a milestone today. \n\nThe story so far... Chris Lattner created the Swift programming language (and answered questions from Slashdot readers in 2017 on his way to new jobs at Tesla, Google, and SiFive). But in 2023, he'd created a new programming language called Mojo &mdash; a superset of Python with added functionality for high performance code that takes advantage of modern accelerators &mdash; as part of his work at AI infrastructure company Modular.AI. \n\nAnd today Modular's product manager Brad Larson announced Python users can now call Mojo code from Python. (Watch for it in Mojo's latest nightly builds...)\n\nThe Python interoperability section of the Mojo manual has been expanded and now includes a dedicated document on calling Mojo from Python. We've also added a couple of new examples to the modular GitHub repository: a \"hello world\" that shows how to round-trip from Python to Mojo and back, and one that shows how even Mojo code that uses ",
        "id": 2770139,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/25/2120232/python-can-now-call-code-written-in-chris-lattners-mojo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Python Can Now Call Code Written in Chris Lattner's Mojo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T20:59:31.397213+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T19:58:00+00:00",
        "description": "\"I am a huge fan of Star Wars,\" opines an article from the gaming Aftermath. \"As every Star Wars fan knows, being a Star Wars fan means you hate Star Wars as much as you love it.\" \n\nBut fortunately there's Going Rogue and Galactic &mdash; two tabletop games \"inspired\" by the Star Wars universe (which just successfully crowdfunded a printed illustrated hardcover edition). They're described as \"war among the stars\" role-playing games, where members of The Liberation dedicate their lives to the war against The Mandate &mdash; \"rebels, soldiers, spies, and criminals, or perhaps someone who simply picked up and blaster and said 'enough is enough.'\" \n\n\nThe article notes that Going Rogue was a way for the game's designer to work out their issues with Star Wars:\n\"You can re-skin Going Rogue to be all the original stuff [from Star Wars]. I prefer, at this point, to play it not in canon Star Wars,\" Levine said. \"And also, there are things I hate about canon Star Wars. I think it sucks that the ",
        "id": 2769845,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/25/1955216/star-wars-inspired-tabletop-games-bring-rebellion-and-glory-without-disney?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Star Wars'-Inspired Tabletop Games Bring Rebellion and Glory (without Disney)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T17:44:40.944403+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T17:34:00+00:00",
        "description": "\"Do we need publicly-owned social networks to escape Silicon Valley?\" asks an opinion piece in Spain's El Pais newspaper. \nIt argues it's necessary because social media platforms \"have consolidated themselves as quasi-monopolies, with a business model that consists of violating our privacy in search of data to sell ads...\"\n\nAmong the proposals and alternatives to these platforms, the idea of public social media networks has often been mentioned. Imagine, for example, a Twitter for the European Union, or a Facebook managed by media outlets like the BBC. In February, Spanish Prime Minister Pedro S&aacute;nchez called for \"the development of our own browsers, European public and private social networks and messaging services that use transparent protocols.\" Former Spanish prime minister Jos&eacute; Luis Rodr&iacute;guez Zapatero &mdash; who governed from 2004 until 2011 &mdash; and the left-wing Sumar bloc in the Spanish Parliament have also proposed this. And, back in 2021, former Briti",
        "id": 2768746,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/25/175204/does-the-world-need-publicly-owned-social-networks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Does the World Need Publicly-Owned Social Networks?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T17:44:41.106204+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T16:34:00+00:00",
        "description": "Around the world fungal infections kill an estimated 2.5 million people a year, notes a report from CNN. But new research predicts that certain species of infection-causing Aspergillus fungi could spread into new areas as the earth's temperature rises. (\"The study, published this month, is currently being peer reviewed...\")\n\n Aspergillus fungi grow like small filaments in soils all over the world. Like almost all fungi, they release huge numbers of tiny spores that spread through the air. Humans inhale spores every day but most people won't experience any health issues; their immune system clears them. It's a different story for those with lung conditions including asthma, cystic fibrosis and COPD, as well as people with compromised immune systems, such as cancer and organ transplant patients, and those who have had severe flu or Covid-19. If the body's immune system fails to clear the spores, the fungus \"starts to grow and basically kind of eat you from the inside out, saying it real",
        "id": 2768747,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/24/2145226/researchers-warn-some-infectious-fungus-could-spread-as-earths-temperatures-rise?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Warn Some Infectious Fungus Could Spread as Earth's Temperatures Rise",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T16:18:57.374628+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T15:34:00+00:00",
        "description": "A year ago, the original creator of SerenityOS posted that \"for the past two years, I've been almost entirely focused on Ladybird, a new web browser that started as a simple HTML viewer for SerenityOS.\" So it became a stand-alone project that \"aims to render the modern web with good performance, stability and security.\" And they're also building a new web engine. \n\n\"We are building a brand-new browser from scratch, backed by a non-profit...\" says Ladybird's official web site, adding that they're driven \"by a web standards first approach.\" They promise it will be truly independent, with \"no code from other browsers\" (and no \"default search engine\" deals). \n\n\"We are targeting Summer 2026 for a first Alpha version on Linux and macOS. This will be aimed at developers and early adopters.\" More from the Ladybird FAQ:\nWe currently have 7 paid full-time engineers working on Ladybird. There is also a large community of volunteer contributors... The focus of the Ladybird project is to build a n",
        "id": 2768367,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/24/173222/serenityos-creator-is-building-an-independent-standards-first-browser-called-ladybird?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SerenityOS Creator Is Building an Independent, Standards-First Browser Called 'Ladybird'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T15:15:00.657392+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T14:34:00+00:00",
        "description": "Whether General Motors survives \"depends in part on whether its bets on battery technology pay off,\" writes the Wall Street Journal. \n\nAt $33,600 the company's Chevy Equinox is one of the cheapest EVs in America (only $5,000 more than the gas-powered model). \"But it also recently announced a novel type of battery that promises to be significantly cheaper, while still providing long range, due to be rolled out in 2028...\"\n\nLike many of its competitors, GM has made huge investments in EV battery factories, and in production lines for the vehicles themselves, and it faces challenges in generating a return on investment in the short term... In the long run, however, GM's focus on creating a North American supply chain for batteries could prove savvy, says David Whiston, U.S. auto equities analyst at Morningstar. The company is investing $625 million to mine lithium in Nevada. It is working on sourcing every material and every part in its batteries domestically, down to the copper and alum",
        "id": 2767961,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/25/0618250/will-gms-bet-on-battery-tech-jumpstart-the-transition-to-electric-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Will GM's Bet on Battery Tech Jumpstart the Transition to Electric Cars?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T12:00:53.232640+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T11:34:00+00:00",
        "description": "Besides pressure on Apple to make iPhones in the U.S., CEO Tim Cook \"is facing off against two U.S. judges, European and worldwide regulators, state and federal lawmakers, and even a creator of the iPhone,\" writes the Wall Street Journal, \"to say nothing of the cast of rivals outrunning Apple in artificial intelligence.\"\n\n\nEach is a threat to Apple's hefty profit margins, long the company's trademark and the reason investors drove its valuation above $3 trillion before any other company. Shareholders are still Cook's most important constituency. The stock's 25% fall from its peak shows their concern about whether he &mdash; or anyone &mdash; can navigate the choppy 2025 waters. \n\nWhat can be said for Apple is that the company is patient, and that has often paid off in the past. \nThey also note OpenAI's purchase of Jony Ive's company, with Sam Altman saying internally they hope to make 100 million AI \"companion\" devices:\n\nIt is hard to gauge the potential for a brand-new computing devi",
        "id": 2766906,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/25/0017230/apples-bad-news-keeps-coming-can-they-still-turn-it-around?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple's Bad News Keeps Coming. Can They Still Turn It Around?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T07:39:51.837393+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T07:34:00+00:00",
        "description": "\"In the 1970s, the USSR used nuclear devices to try to send water from Siberia's rivers flowing south, instead of its natural route north...\" remembers the BBC.\n\n\n[T]he Soviet Union simultaneously fired three nuclear devices buried 127m (417ft) underground. The yield of each device was 15 kilotonnes (about the same as the atomic bomb dropped on Hiroshima in 1945). The experiment, codenamed \"Taiga\", was part of a two-decade long Soviet programme of carrying out peaceful nuclear explosions (PNEs). \n\nIn this case, the blasts were supposed to help excavate a massive canal to connect the basin of the Pechora River with that of the Kama, a tributary of the Volga. Such a link would have allowed Soviet scientists to siphon off some of the water destined for the Pechora, and send it southward through the Volga. It would have diverted a significant flow of water destined for the Arctic Ocean to go instead to the hot, heavily populated regions of Central Asia and southern Russia. This was just o",
        "id": 2765880,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/25/0040259/the-ussr-once-tried-reversing-a-rivers-direction-with-peaceful-nuclear-explosions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The USSR Once Tried Reversing a River's Direction with 'Peaceful Nuclear Explosions'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T05:31:07.643765+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T04:34:00+00:00",
        "description": "\"Duolingo had been riding high,\" reports Fast Company, until CEO Luis von Ahn \"announced on LinkedIn that the company is phasing out human contractors, looking for AI use in hiring and in performance reviews, and that 'headcount will only be given if a team cannot automate more of their work.'\" \n\nBut then \"facing heavy backlash online after unveiling its new AI-first policy\", Duolingo's social media presence went dark last weekend. Duolingo even temporarily took down all its posts on TikTok (6.7 million followers) and Instagram (4.1 million followers) \"after both accounts were flooded with negative feedback.\"\n\n\nDuolingo previously faced criticism for quietly laying off 10% of its contractor base and introducing some AI features in late 2023, but it barely went beyond a semi-viral post on Reddit. Now that Duolingo is cutting out all its human contractors whose work can technically be done by AI, and relying on more AI-generated language lessons, the response is far more pronounced. Alt",
        "id": 2765553,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/25/0347239/duolingo-faces-massive-social-media-backlash-after-ai-first-comments?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Duolingo Faces Massive Social Media Backlash After 'AI-First' Comments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-25T02:12:43.774670+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-25T01:34:00+00:00",
        "description": "Doom: The Dark Ages just launched on May 15. But it's already received \"difficulty\" balance changes \"that have made the demons of Hell even more dangerous than ever,\" writes Windows Central:\n\nAccording to DOOM's official website Slayer's Club, these balance adjustments are focused on making the game harder, as players have been leaving feedback saying it felt too easy even on Nightmare Mode. As a result, enemies now hit harder, health and armor item pick-ups drop less often, and certain enemies punish you more severely for mistiming the parry mechanic. \n\n\nIt reached three million players in just five days, which was seven times faster than 2020's Doom: Eternal,\" reports Wccftech (though according to analytics firm Ampere Analysis (via The Game Business), more than two million of those three million launch players were playing on Xbox, while only 500K were playing on PS5.\") \"id Software proves it can still reinvent the wheel,\" according to one reviewer, \"shaking up numerous aspects of ",
        "id": 2765037,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/24/2356233/new-doom-the-dark-ages-already-adjusted-to-add-even-more-dangerous-demons?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New 'Doom: The Dark Ages' Already Adjusted to Add Even More Dangerous Demons",
        "vote": 0
    }
]