[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-16T16:42:04.305106+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-16T16:01:10+00:00",
        "description": "Hitman joined in on the Switch 2 launch with World of Assassination - Signature Edition. It’s a very content-rich package, including the complete campaigns of Hitman 1-3 and some extras on top. \n\nThe game runs and looks particularly impressive in handheld mode, but suffers from a lack of VRR support while docked, which results in stuttering. Still, the various levels look great from a graphical perspective and sound amazing with Nintendo’s 3D audio.",
        "id": 2945201,
        "language": null,
        "link": "https://www.youtube.com/watch?v=jsU02Ywxr34",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jsU02Ywxr34/hqdefault.jpg",
        "title": "HITMAN Switch 2 Review - Despite Some Shortcomings, Agent 47 On The Go Is A Win",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-16T16:42:04.511803+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-16T16:00:25+00:00",
        "description": "The Higgs Boson is a major component of particle physics theory and would become referred to as the ultimate particle of sorts. It's also where Higgs Monaghan, the so-called central antagonist of Death Stranding (played by Troy Baker), gets his name. However, in the ultimate irony, his villainous role is about as tenuous as the very nickname of the Higgs Boson.\n\nHiggs is the leader of Homo Demens, a separatist organization involved in terrorist attacks against the United Cities of America's government. He first reveals himself during Sam's emergency corpse disposal job in Central Knot City, wordlessly gesturing towards a large B.T. before disappearing. In reality, it was the Homo Demens that deposited the corpse to trigger a Voidout and the city's destruction, mainly as a means to kill Sam. When the latter is tasked with venturing West to reconnect the country and rescue Amelie's expedition, Higgs and the Homo Demens are revealed to be her kidnappers.\n\nHe would be fully introduced in ",
        "id": 2945202,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ImwDF4s-GI4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ImwDF4s-GI4/hqdefault.jpg",
        "title": "Who The Hell Is Higgs And What Is His Story In Death Stranding? - Before You Play Death Stranding 2",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-16T14:30:16.090426+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-16T13:30:46+00:00",
        "description": "Vicarious Visions is now part of Blizzard Entertainment, but thankfully Iron Galaxy has taken up the mantle of bringing us remakes of Tony Hawk’s Pro Skater 3 and 4. These games are packed together into a similar experience that Tony Hawk’s Pro Skater 1 + 2 supplied, mainly 2-minute challenge sessions draped with beautiful Unreal Engine 4 graphics.\n\nAll levels except two return and all skaters plus a batch of new ones are available in the remake. Three new levels arrive as well, including a pinball machine and a waterpark full of slides. Sadly, the open-ended Career of THPS 4 is omitted, but Iron Galaxy has compromised with a 60 minute timer. \n\nTony Hawk’s Pro Skater 3 + 4 arrives July 11th for all modern platforms, starting at $49.99.",
        "id": 2943985,
        "language": null,
        "link": "https://www.youtube.com/watch?v=njv3IWLy8hU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/njv3IWLy8hU/hqdefault.jpg",
        "title": "Tony Hawk's Pro Skater 3 + 4 - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-16T10:38:06.717566+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-16T10:15:03+00:00",
        "description": "With Resident Evil Requiem finally getting a release date at this year’s Summer Game Fest, fans of the long-standing franchise are eagerly waiting to see what the Japanese studio has in store for them this time around. \n\nWhile Resident Evil Village was quite successful, The developer would not want to rest on its laurels, and Requiem is likely to take things up a notch in both its gameplay and story. With Grace Ashcroft taking over from Ethan Winters, the new story is a perfect opportunity for the franchise to take a trip down memory lane, bringing back familiar faces that have been out of the spotlight for far too long. \n\nWith Requiem, The developer seems to be intent on blending the past and present in a title that could weave different characters’ disparate storylines into a cohesive whole. To that end, here are 5 characters we would love to see in Resident Evil Requiem.",
        "id": 2942170,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cPvE7MhqB1Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cPvE7MhqB1Q/hqdefault.jpg",
        "title": "Resident Evil Requiem Could Be MASSIVE If These 5 Characters Show Up",
        "vote": 0
    }
]