[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-08T15:30:15+00:00",
        "description": "With reputable reports from Jez Corden, Kobrille, and NateDrake, rumors of a The Elder Scrolls IV: Oblivion remake or remaster are all but confirmed for 2025. The game will likely be using Unreal Engine 5 for its graphics while the old Creation Engine manages the underlying physics and gameplay. \n\nIt’s still a mystery whether this project overhauls prominent systems like a proper remake or if it’ll just be a cosmetic improvement and be a light remaster. That leaves the question: just what should be improved and/or kept for a re-rerelease of Oblivion?\n\n2006’s Oblivion was revolutionary at the time for its radiant AI, physics, and open world. But things like the flawed levelling system and the dull combat make it hard for some gamers to return to today.",
        "id": 1860440,
        "language": null,
        "link": "https://www.youtube.com/watch?v=RduMfZxQTFg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RduMfZxQTFg/hqdefault.jpg",
        "title": "With Rumors of A Remake Inbound, How Does The Elder Scrolls IV: Oblivion Hold Up In 2025?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-08T13:30:00+00:00",
        "description": "Sniper Elite: Resistance is the latest entry in developer Rebellion’s long-serving World War II themed stealth-come-military shooter. It’ll plunge players once again during the latter stages of World War II, with new missions across newly designed territory the fodder to engage in the series’ award-winning advanced sniping mechanics and tactical third-person gameplay. \n\nThere’s an element that Sniper Elite: Resistance is DLC for Sniper Elite 5 repackaged as a fully-fledged game, and whilst, yes, there isn’t a boatload of innovation here, Sniper Elite: Resistance does feature a handful of novel innovations which we’ll go through in this feature. The game’s out January 30th to PC, Xbox, and PlayStation platforms, and it’s looking to do just enough to justify itself as a worthy entry in the storied series.",
        "id": 1859301,
        "language": null,
        "link": "https://www.youtube.com/watch?v=0XIZmidT5-M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0XIZmidT5-M/hqdefault.jpg",
        "title": "Sniper Elite: Resistance - 15 New Gameplay Details You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-08T09:30:27+00:00",
        "description": "CES 2025 is currently going on but we have some of the biggest gaming related announcements out of the way. For those who are unaware, the Consumer Electronics Show largely focuses on technology across various sectors but gaming also has a presence. In this video, we will be taking a look at eight gaming related announcements you may have missed from CES 2025.",
        "id": 1857923,
        "language": null,
        "link": "https://www.youtube.com/watch?v=gsgVVTH9T2I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gsgVVTH9T2I/hqdefault.jpg",
        "title": "8 BIGGEST Gaming Reveals At CES 2025 YOU NEED TO KNOW",
        "vote": 0
    }
]