[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-15T16:28:34.334715+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-15T15:45:12+00:00",
        "description": "The Outer Worlds 2 is shaping up to be the sequel one always dreamed of making - bigger, bolder, and more immersive in every respect. Built exclusively for modern hardware, this sequel promises a world which feels richer and more reactive, where player choice isn’t just an aesthetic set dressing but a current running through everything. \n\nArcadia’s politics, its factions, and its combat all orbit the same philosophy: tangible choice leads to consequence. The Outer Worlds 2 looks like a sequel with meaning, not by reinventing itself, but to fulfil the potential its predecessor never reached. Our “15 Differences” video dissected the changes. Now, the 15 things discussed here don’t just highlight what you need to know before you buy, but they pinpoint one thing: clear artistic vision.",
        "id": 3820979,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=mXGu9NOC3CE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mXGu9NOC3CE/hqdefault.jpg",
        "title": "The Outer Worlds 2 - 15 Things You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-15T13:55:40.061426+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-15T13:01:49+00:00",
        "description": "The latest and greatest gaming handheld is here with the Xbox ROG Ally X. It’s an iteration from last year’s powerful ROG Ally X, but with an engaging suite of Xbox goodies packed within. Besides the obvious integrations such as Game Pass and an Xbox launcher overlay, the Xbox Ally X is fitted with a rugged yet ergonomic gamepad in the style of the Series X controller. \n\nIt feels like an Xbox, looks like an Xbox, and also has all the Xbox games, but it’s got something more, full Windows accessibility. This is the first time a handheld has truly nailed the gaming/PC fusion in a holistic and all-encompassing way. \n\nIt’s a handheld Windows PC that also operates as an Xbox Series machine of sorts. Though, this hybrid powerhouse isn’t without its flaws, not least of which is the restrictive price point. Is the Xbox ROG Ally X the Mount Everest of gaming handhelds? Is it truly worth the $1000 price tag? Check out our review to find out!",
        "id": 3819450,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=qr5vyjZkQrg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qr5vyjZkQrg/hqdefault.jpg",
        "title": "ROG Xbox Ally X Review - A Powerful Beast, But Is It Worth It?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-15T07:10:58.632919+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-15T06:30:17+00:00",
        "description": "A deep narrative probably isn't the first thing that comes to mind when thinking about Ninja Gaiden. The original NES series has always been pretty straightforward at first glance, but there's a pretty involved globe-spanning adventure with mysterious ruins, demon statues, the CIA, and more, spanning across three games. Since it's building off Team Ninja's own Dead or Alive, which possesses its own extensive (and sometimes confusing lore), Ninja Gaiden offered quite a bit when shining the spotlight on Ryu Hayabusa.\n\nAs a prequel to the NES series, events in Ninja Gaiden began long before Ryu's birth. In this video, we will be taking a look at the entire events of Ninja Gaiden 1.",
        "id": 3816794,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=WUOIbQgL0nU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WUOIbQgL0nU/hqdefault.jpg",
        "title": "The FULL Story of Ninja Gaiden 1 - Before You Play Ninja Gaiden 4",
        "vote": 0
    }
]