[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T23:34:27.906261+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T23:21:00+00:00",
        "description": "Wild chimpanzees have been found to consume the equivalent of a bottle of lager's alcohol a day from eating ripened fruit, scientists say. BBC: They say this is evidence humans may have got our taste for alcohol from common primate ancestors who relied on fermented fruit -- a source of sugar and alcohol -- for food. \"Human attraction to alcohol probably arose from this dietary heritage of our common ancestor with chimpanzees,\" said study researcher Aleksey Maro of the University of California, Berkeley. \n\nChimps, like many other animals, have been spotted feeding on ripe fruit lying on the forest floor, but this is the first study to make clear how much alcohol they might be consuming.\n\nThe research team measured the amount of ethanol, or pure alcohol, in fruits such as figs and plums eaten in large quantities by wild chimps in Cote d'Ivoire and Uganda. Based on the amount of fruit they normally eat, the chimps were ingesting around 14 grams of ethanol -- equivalent to nearly two UK u",
        "id": 3601455,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/17/1948210/chimps-drinking-a-lager-a-day-in-ripe-fruit-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chimps Drinking a Lager a Day in Ripe Fruit, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T23:34:28.168906+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T22:41:00+00:00",
        "description": "Sony has quietly introduced a revised PlayStation 5 Digital Edition that reduces internal storage from 1TB to 825GB while maintaining the same 499 Euro ($590) price point. The CFI-2116 revision has appeared on Amazon listings across Italy, Germany, Spain and France without official announcement from Sony. \n\nThe storage downgrade returns the console to its original 825GB capacity last seen in the launch PlayStation 5 before the Slim models increased storage to 1TB. Users lose approximately 175 of usable space in the new revision. Amazon Germany lists October 23 as the delivery date for units already available for purchase. The change affects only the Digital Edition while the disc version remains unchanged at 1TB. The revision follows Sony's September price increase of $50 across PlayStation 5 models citing economic conditions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sony+Quietly+Downgrades+PS5+Digital+Edition",
        "id": 3601456,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/09/17/1937258/sony-quietly-downgrades-ps5-digital-edition-storage-to-825gb-at-same-price?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sony Quietly Downgrades PS5 Digital Edition Storage To 825GB at Same Price",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T22:26:31.216827+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Polygon: The CEOs of Discord, Steam, Twitch, and Reddit have been called to Congress to testify about the \"radicalization of online forum users\" on those platforms, the House Oversight and Government Reform Committee announced Wednesday. \"Congress has a duty to oversee the online platforms that radicals have used to advance political violence,\" said chairman of the House Oversight Committee James Comer, a Republican from Kentucky, in a statement. \"To prevent future radicalization and violence, the CEOs of Discord, Steam, Twitch, and Reddit must appear before the Oversight Committee and explain what actions they will take to ensure their platforms are not exploited for nefarious purposes.\"\n \nLetters from the House Oversight Committee have been sent to Humam Sakhnini, CEO of Discord; Gabe Newell, president of Steam maker Valve; Dan Clancy, CEO of Twitch; and Steve Huffman, CEO of Reddit, requesting their testimony on Oct. 8. \"The hearing will exa",
        "id": 3601058,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/17/1941240/congress-asks-valve-discord-and-twitch-to-testify-on-radicalization?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Congress Asks Valve, Discord, and Twitch To Testify On 'Radicalization'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T22:26:31.322856+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T21:20:00+00:00",
        "description": "Two Xpeng AeroHT flying cars collided during a rehearsal for the Changchun Air Show in China, with one vehicle catching fire upon landing. While the company reported no serious injuries, CNN reported one person was injured in the crash. The BBC reports: Footage on Chinese social media site Weibo appeared to show a flaming vehicle on the ground which was being attended to by fire engines. One vehicle \"sustained fuselage damage and caught fire upon landing,\" Xpeng AeroHT said in a statement to CNN. \"All personnel at the scene are safe, and local authorities have completed on-site emergency measures in an orderly manner,\" it added.\n \nThe electric flying cars take off and land vertically, and the company is hoping to sell them for around $300,000 each. In January, Xpeng claimed to have around 3,000 orders for the vehicle. [...] It has said it wants to lead the world in the \"low-altitude economy.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://",
        "id": 3601059,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/17/1937221/flying-cars-crash-into-each-other-at-air-show-in-china?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Flying Cars Crash Into Each Other At Air Show In China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T21:12:29.611999+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T20:40:00+00:00",
        "description": "Microsoft is now prioritizing Anthropic's Claude 4 over OpenAI's GPT-5 in Visual Studio Code's auto model feature, signaling a quiet but clear shift in preference. The Verge reports: \"Based on internal benchmarks, Claude Sonnet 4 is our recommended model for GitHub Copilot,\" said Julia Liuson, head of Microsoft's developer division, in an internal email in June. While that guidance was issued ahead of the GPT-5 release, I understand Microsoft's model guidance hasn't changed.\n \nMicrosoft is also making \"significant investments\" in training its own AI models. \"We're also going to be making significant investments in our own cluster. So today, MAI-1-preview was only trained on 15,000 H100s, a tiny cluster in the grand scheme of things,\" said Microsoft AI chief Mustafa Suleyman, in an employee-only town hall last week.\n \nMicrosoft is also reportedly planning to use Anthropic's AI models for some features in its Microsoft 365 apps soon. The Information reports that the Microsoft 365 Copilo",
        "id": 3600517,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/17/1927233/microsoft-favors-anthropic-over-openai-for-visual-studio-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Favors Anthropic Over OpenAI For Visual Studio Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T21:12:29.708465+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T20:02:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Like the rest of its Big Tech cadre, Google has spent lavishly on developing generative AI models. Google's AI can clean up your text messages and summarize the web, but the company is constantly looking to prove that its generative AI has true intelligence. The International Collegiate Programming Contest (ICPC) helps make the point. Google says Gemini 2.5 participated in the 2025 ICPC World Finals, turning in a gold medal performance. According to Google this marks \"a significant step on our path toward artificial general intelligence.\"\n \nEvery year, thousands of college-level coders participate in the ICPC event, facing a dozen deviously complex coding and algorithmic puzzles over five grueling hours. This is the largest and longest-running competition of its type. To compete in the ICPC, Google connected Gemini 2.5 Deep Think to a remote online environment approved by the ICPC. The human competitors were given a head start of ",
        "id": 3600518,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/17/1923220/gemini-ai-solves-coding-problem-that-stumped-139-human-teams-at-icpc-world-finals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gemini AI Solves Coding Problem That Stumped 139 Human Teams At ICPC World Finals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T19:55:46.300024+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T19:25:00+00:00",
        "description": "Governments worldwide are implementing heat protection laws as 2.4 billion workers face extreme temperature exposure and 19,000 die annually from heat-related workplace injuries, according to a World Health Organization and World Meteorological Organization report. \n\nJapan imposed $3,400 fines for employers failing to provide cooling measures when wet-bulb temperatures reach 28C. Singapore mandated hourly temperature sensors at large outdoor sites and requires 15-minute breaks every hour at 33C wet-bulb readings. Southern European nations ordered afternoon work stoppages this summer when temperatures exceeded 115F across Greece, Italy and Spain. \n\nThe United States lacks federal heat standards; only California, Colorado, Maryland, Minnesota, Nevada, Oregon and Washington have state-level protections. Boston passed requirements for heat illness prevention plans on city projects. Enforcement remains inconsistent -- Singapore inspectors found nearly one-third of 70 sites violated the 202",
        "id": 3600075,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/17/192234/extreme-heat-spurs-new-laws-aimed-at-protecting-workers-worldwide?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Extreme Heat Spurs New Laws Aimed at Protecting Workers Worldwide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T19:55:46.415730+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T18:46:00+00:00",
        "description": "The ability of AI displace humans at various tasks is accelerating quickly, Anthropic CEO Dario Amodei said at an Axios event on Wednesday. From the report: Amodei and others have previously warned of the possibility that up to half of white-collar jobs could be wiped out by AI over the next five years. The speed of that displacement could require government intervention to help support the workforce, executives said. \n\n\"As with most things, when an exponential is moving very quickly, you can't be sure,\" Amodei said. \"I think it is likely enough to happen that we felt there was a need to warn the world about it and to speak honestly.\" Amodei said the government may need to step in and support people as AI quickly displaces human work.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI's+Ability+To+Displace+Jobs+is+Advancing+Quickly%2C+Anthropic+CEO+Says%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F17%2F1836233%2",
        "id": 3600076,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/17/1836233/ais-ability-to-displace-jobs-is-advancing-quickly-anthropic-ceo-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI's Ability To Displace Jobs is Advancing Quickly, Anthropic CEO Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T18:44:49.528458+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T18:07:00+00:00",
        "description": "Light pollution now doubles every eight years globally as LED adoption accelerates artificial brightness worldwide. A recent study measured 10% annual growth in light pollution from 2011 to 2022. Northern Chile's Atacama Desert remains one of the few Bortle Scale 1 locations -- the darkest rating for astronomical observation -- though La Serena's population has nearly doubled in 25 years. The region hosts major observatories including the Vera C. Rubin Observatory at Cerro Pachon. \n\nSatellite constellations pose additional challenges: numbers have increased from hundreds decades ago to 12,000 currently operating satellites. Astronomers predict 100,000 or more satellites within a decade. Chile faces pressure from proposed mining operations including the 7,400-acre INNA green-hydrogen facility near key astronomical sites despite national laws limiting artificial light from mining operations that generate over half the country's exports.<p><div class=\"share_submission\" style=\"position:re",
        "id": 3599558,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/17/187256/darkest-nights-are-getting-lighter?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Darkest Nights Are Getting Lighter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T18:44:49.623348+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T17:28:00+00:00",
        "description": "AI models often produce false outputs, or \"hallucinations.\" Now OpenAI has admitted they may result from fundamental mistakes it makes when training its models. The Register: The admission came in a paper [PDF] published in early September, titled \"Why Language Models Hallucinate,\" and penned by three OpenAI researchers and Santosh Vempala, a distinguished professor of computer science at Georgia Institute of Technology. It concludes that \"the majority of mainstream evaluations reward hallucinatory behavior.\" \n\nThe fundamental problem is that AI models are trained to reward guesswork, rather than the correct answer. Guessing might produce a superficially suitable answer. Telling users your AI can't find an answer is less satisfying. As a test case, the team tried to get an OpenAI bot to report the birthday of one of the paper's authors, OpenAI research scientist Adam Tauman Kalai. It produced three incorrect results because the trainers taught the engine to return an answer, rather th",
        "id": 3599559,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/17/1724241/openai-says-models-programmed-to-make-stuff-up-instead-of-admitting-ignorance?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Says Models Programmed To Make Stuff Up Instead of Admitting Ignorance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T17:30:57.042534+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T16:50:00+00:00",
        "description": "If global temperatures continue rising, virtually all the corals in the Atlantic Ocean will stop growing and could succumb to erosion by the end of the century, a new study finds. From a report: The analysis of over 400 existing coral reefs across the Atlantic Ocean estimates that more than 70 percent of the region's reefs will begin dying by 2040 even under optimistic climate warming scenarios. And if the planet exceeds 2 degrees Celsius of warming above preindustrial temperatures by the end of the century, 99 percent of corals in the region would meet this fate. Today, the planet has warmed about 1.3 degrees Celsius over preindustrial temperatures. \n\nThe implications are grave. Corals act as the fundamental building blocks of reefs, providing habitat for thousands of species of fish and other marine life. They are also bulwarks that break up waves and help protect shorelines from rising sea levels. A quarter of all ocean life depends on coral reefs and over a billion people worldwid",
        "id": 3598780,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/17/1650244/corals-wont-survive-a-warmer-planet-a-new-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Corals Won't Survive a Warmer Planet, a New Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T17:30:57.279567+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T16:06:00+00:00",
        "description": "An anonymous reader shares a report: After years of dismissing the idea of putting a touchscreen on a MacBook, it seems Apple may have finally caved. Its MacBook Pro overhaul in 2026 is now expected to be the first-ever MacBook to feature a touchscreen display, according to a report from supply chain analyst Ming-Chi Kuo on X. \n\nThe change will reportedly affect Apple's next-generation MacBook Pro, which could feature an OLED display and \"incorporate a touch panel using on-cell touch technology.\" The OLED MacBook Pro isn't expected to enter production until late 2026, and before then, Apple is expected to launch the M5 MacBook Pro in early 2026.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=After+Years+of+Resistance%2C+Apple+Might+Finally+Release+a+Touchscreen+MacBook+Pro%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F09%2F17%2F166241%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.co",
        "id": 3598781,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/09/17/166241/after-years-of-resistance-apple-might-finally-release-a-touchscreen-macbook-pro?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "After Years of Resistance, Apple Might Finally Release a Touchscreen MacBook Pro",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T15:58:51.863100+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T15:27:00+00:00",
        "description": "An anonymous reader shares a report: Business Insider has told journalists they can use AI to create first drafts of stories and suggested it won't notify readers that AI was used, according to Status, a newsletter covering the media industry. The policy makes the outlet one of the first to formally allow such extensive use of the technology. \n\nThe AI guidelines were reportedly circulated in an internal memo from editor-in-chief Jamie Heller on Thursday. The policy authorized journalists to deploy AI \"like any other tool\" for tasks like research and image editing, Status reported.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Business+Insider+Reportedly+Tells+Journalists+They+Can+Use+AI+To+Draft+Stories%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F17%2F1527231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.face",
        "id": 3598106,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/17/1527231/business-insider-reportedly-tells-journalists-they-can-use-ai-to-draft-stories?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Business Insider Reportedly Tells Journalists They Can Use AI To Draft Stories",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T15:58:51.967780+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T14:45:00+00:00",
        "description": "Scripted TV production peaked in 2022 at 599 shows and has declined since, according to FX's research division tracking. New prestige series have dropped sharply while streaming platforms prioritize returning shows over new development. Netflix has shifted majority output to unscripted content including docuseries and reality programming since 2018. \n\nYouTube leads streaming viewership ahead of Netflix, Paramount+, and Hulu. Free ad-supported platforms YouTube, Tubi and Roku Channel continue gaining market share. Subscription prices across major streaming services have increased while scripted content volume decreased. Second season of Severance cost $200 million. Fourth season of Stranger Things reached $270 million in production expenses.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Is+TV's+Golden+Age+(Officially)+Over%3F+A+Statistical+Analysis%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F09%2F17%2",
        "id": 3598107,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/09/17/1445208/is-tvs-golden-age-officially-over-a-statistical-analysis?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is TV's Golden Age (Officially) Over? A Statistical Analysis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T15:58:52.071025+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T14:05:00+00:00",
        "description": "Anthropic has declined requests from federal law enforcement contractors to use its Claude AI models for surveillance activities, deepening tensions with the Trump administration, Semafor reported Wednesday, citing two senior officials. The company's usage policies prohibit domestic surveillance, limiting how agencies including the FBI, Secret Service, and Immigration and Customs Enforcement can deploy its technology. While Anthropic maintains a $1 contract with federal agencies through AWS GovCloud and works with the Department of Defense on non-weapons applications, administration officials said the restrictions amount to making moral judgments about law enforcement operations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+Denies+Federal+Agencies+Use+of+Claude+for+Surveillance+Tasks%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F17%2F145230%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img ",
        "id": 3598108,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/17/145230/anthropic-denies-federal-agencies-use-of-claude-for-surveillance-tasks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Denies Federal Agencies Use of Claude for Surveillance Tasks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T14:44:16.907880+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T14:05:00+00:00",
        "description": "Anthropic has declined requests from federal law enforcement contractors to use its Claude AI models for surveillance activities, deepening tensions with the Trump administration, Semafor reported Wednesday, citing two senior officials. The company's usage policies prohibit domestic surveillance, limiting how agencies including the FBI, Secret Service, and Immigration and Customs Enforcement can deploy its technology. While Anthropic maintains a $1 contract with federal agencies through AWS GovCloud and works with the Department of Defense on non-weapons applications, administration officials said the restrictions amount to making moral judgments about law enforcement operations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+Refuses+Federal+Agencies+From+Using+Claude+for+Surveillance+Tasks%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F17%2F145230%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\">",
        "id": 3597393,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/17/145230/anthropic-refuses-federal-agencies-from-using-claude-for-surveillance-tasks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Refuses Federal Agencies From Using Claude for Surveillance Tasks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T13:33:46.921784+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T13:01:00+00:00",
        "description": "The home appliance industry would like you to believe that gas-burning stoves are not a risk to your health -- and several companies that make the devices are scrambling to erase their prior acknowledgements that they are. From a report: That claim is at the heart of a lawsuit the Association of Home Appliance Manufacturers has filed against the state of Colorado to stop it from requiring natural gas stoves, which burn methane, to carry health labels not unlike those on every pack of cigarettes. \"Understand the air quality implications of having an indoor gas stove,\" the warning would read. \n\nThe law was to take effect August 5 but is now on hold, and state officials did not respond to a request for comment. In its federal lawsuit, the Association -- whose board includes representatives of LG Electronics, BSH Home Appliance Corp. (which makes Bosch appliances), Whirlpool, and Samsung Electronics -- asserts that the labeling requirement is \"unconstitutional compelled speech\" and illega",
        "id": 3596715,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/17/1211234/gas-stove-makers-quietly-delete-air-pollution-warnings-as-they-fight-mandatory-health-labels?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gas Stove Makers Quietly Delete Air Pollution Warnings as They Fight Mandatory Health Labels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T10:53:30.820888+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T10:00:00+00:00",
        "description": "A new Stanford-led study finds that switching permanently to standard time could prevent 300,000 strokes and reduce obesity in 2.6 million Americans by better aligning circadian rhythms with natural light. Researchers argue that the twice-yearly clock changes are the worst option for public health, while permanent daylight saving time would offer two-thirds of the benefits. From a report: \"We found that staying in standard time or staying in daylight saving time is definitely better than switching twice a year,\" senior researcher Jamie Zeitzer said in a news release. He's a professor of psychiatry and behavioral sciences at Stanford University in California. For the study, researchers estimated how different national time policies might affect American's circadian rhythms -- the body's innate clock that regulates many physiological processes. The human circadian cycle isn't exactly 24 hours, researchers noted. It's about 12 minutes longer for most people, and it can be changed based o",
        "id": 3595504,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/16/2317241/permanent-standard-time-could-cut-strokes-obesity-among-americans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Permanent Standard Time Could Cut Strokes, Obesity Among Americans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T09:37:32.312472+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T08:43:00+00:00",
        "description": "China's internet regulator has told the country's biggest technology companies to stop buying all of Nvidia's artificial intelligence chips and terminate their existing orders, as Beijing steps up efforts to boost its homegrown semiconductor industry and compete with the US. From a report: The Cyberspace Administration of China (CAC) informed companies including ByteDance and Alibaba this week to terminate their testing and orders of the RTX Pro 6000D, Nvidia's tailor-made product for the country introduced two months ago, according to three people with knowledge of the matter. \n\nSeveral companies had indicated they would order tens of thousands of the RTX Pro 6000D, and had started testing and verification work with Nvidia's server suppliers before telling them to stop the work after receiving the CAC order, said the people.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Tells+Its+Tech+Companies+To+Stop+Buyin",
        "id": 3594959,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/17/0843228/china-tells-its-tech-companies-to-stop-buying-all-of-nvidias-ai-chips?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Tells Its Tech Companies To Stop Buying All of Nvidia's AI Chips",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T07:10:01.591568+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T07:00:00+00:00",
        "description": "\"Phys.org is reporting on a study published in Nature Physics involving ICN2 at the UAB campus, Xi'an Jiaotong University (Xi'an) and Stony Brook University (New York), showing for the first time that ordinary ice is a flexoelectric material -- meaning it can generate electricity when subjected to mechanical deformation,\" writes longtime Slashdot reader fahrbot-bot. From the report: \"We discovered that ice generates electric charge in response to mechanical stress at all temperatures. In addition, we identified a thin 'ferroelectric' layer at the surface at temperatures below -113C (160K),\" explains Dr. Xin Wen, a member of the ICN2 Oxide Nanophysics Group and one of the study's lead researchers. \"This means that the ice surface can develop a natural electric polarization, which can be reversed when an external electric field is applied -- similar to how the poles of a magnet can be flipped. The surface ferroelectricity is a cool discovery in its own right, as it means that ice may ha",
        "id": 3594168,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/16/236209/scientists-find-that-ice-generates-electricity-when-bent?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Find That Ice Generates Electricity When Bent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T03:35:15.077561+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: As Jonathan Roll neared completion of a master's degree in science and technology policy at Arizona State University three years ago, he did some research into recent developments by China's ascendant space program. He came away impressed by the country's growing ambitions. Now a full-time research analyst at the university, Roll was recently asked to take a deeper dive into Chinese space plans. \"I thought I had a pretty good read on this when I was finishing grad school,\" Roll told Ars. \"That almost everything needed to be updated, or had changed three years later, was pretty scary. On all these fronts, they've made pretty significant progress. They are taking all of the cues from our Western system about what's really galvanized innovation, and they are off to the races with it.\"\n \nRoll is the co-author of a new report, titled \"Redshift,\" on the acceleration of China's commercial and civil space activities and the threat these p",
        "id": 3593362,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/16/2050253/a-new-report-finds-chinas-space-program-will-soon-equal-that-of-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A New Report Finds China's Space Program Will Soon Equal That of the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-17T00:30:16.427332+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-17T00:02:00+00:00",
        "description": "OpenAI is rolling out stricter safety measures for ChatGPT after lawsuits linked the chatbot to multiple suicides. \"ChatGPT will now attempt to guess a user's age, and in some cases might require users to share an ID in order to verify that they are at least 18 years old,\" reports 404 Media. \"We know this is a privacy compromise for adults but believe it is a worthy tradeoff,\" the company said in its announcement. \"I don't expect that everyone will agree with these tradeoffs, but given the conflict it is important to explain our decisionmaking,\" OpenAI CEO Sam Altman said on X. From the report: OpenAI introduced parental controls to ChatGPT earlier in September, but has now introduced new, more strict and invasive security measures. In addition to attempting to guess or verify a user's age, ChatGPT will now also apply different rules to teens who are using the chatbot. \"For example, ChatGPT will be trained not to do the above-mentioned flirtatious talk if asked, or engage in discussio",
        "id": 3592662,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/16/2045241/chatgpt-will-guess-your-age-and-might-require-id-for-age-verification?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ChatGPT Will Guess Your Age and Might Require ID For Age Verification",
        "vote": 0
    }
]