[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T23:29:07.580886+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T23:20:00+00:00",
        "description": "An anonymous reader quotes a report from Tom's Hardware: A North Korean imposter was uncovered, working as a sysadmin at Amazon U.S., after their keystroke input lag raised suspicions with security specialists at the online retail giant. Normally, a U.S.-based remote worker's computer would send keystroke data within tens of milliseconds. This suspicious individual's keyboard lag was \"more than 110 milliseconds,\" reports Bloomberg. Amazon is commendably proactive in its pursuit of impostors, according to the source report.\n \nThe news site talked with Amazon's Chief Security Officer, Stephen Schmidt, about this fascinating new case of North Koreans trying to infiltrate U.S. organizations to raise hard currency for the Democratic People's Republic of Korea (DPRK), and sometimes indulge in espionage and/or sabotage. Schmidt says that Amazon has foiled more than 1,800 DPRK infiltration attempts since April 2024. Moreover, the rate of attempts continues apace, with Amazon reckoning it is s",
        "id": 4356951,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/18/2026202/north-korean-infiltrator-caught-working-in-amazon-it-department-thanks-to-lag",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "North Korean Infiltrator Caught Working In Amazon IT Department Thanks To Lag",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T23:29:07.780830+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T22:40:00+00:00",
        "description": "A new study estimates that AI systems in 2025 consumed as much electricity as New York City emits in carbon pollution and used hundreds of billions of liters of water, driven largely by power-hungry data centers and cooling needs. Researchers say the real impact is likely higher due to poor transparency from tech companies about AI-specific energy and water use. \"There's no way to put an extremely accurate number on this, but it's going to be really big regardless... In the end, everyone is paying the price for this,\" says Alex de Vries-Gao, a PhD candidate at the VU Amsterdam Institute for Environmental Studies who published his paper today in the journal Patterns. The Verge reports: To crunch these numbers, de Vries-Gao built on earlier research that found that power demand for AI globally could reach 23GW this year -- surpassing the amount of electricity used for Bitcoin mining in 2024. While many tech companies divulge total numbers for their carbon emissions and direct water use ",
        "id": 4356952,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/18/200251/ais-water-and-electricity-use-soars-in-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI's Water and Electricity Use Soars In 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T22:27:43.451861+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T22:00:00+00:00",
        "description": "A California judge signaled support for forcing Vizio to provide the full source code for its SmartCast TV software after finding a contractual obligation under the GPL. If upheld, the case could strengthen users' rights to modify GPL-licensed software embedded in consumer electronics. The Register reports: The legal complaint from the Software Freedom Conservancy (SFC) seeks access to the SmartCast source code so that Vizio customers can make changes and improvements to the platform, something that ought to be possible for code distributed under the GPL. On Thursday, California Superior Court Judge Sandy Leal issued a tentative ruling in advance of a hearing, indicating support for part of SFC's legal challenge. The tentative ruling is not a final decision, but it signals the judge's inclination to grant the SFC's motion for summary adjudication, at least in part.\n \n\"The tentative ruling [PDF] grants SFC's motion on the issue that a direct contract was made between SFC and Vizio when",
        "id": 4356503,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/18/1949229/judge-hints-vizio-tv-buyers-may-have-rights-to-source-code-licensed-under-gpl",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Judge Hints Vizio TV Buyers May Have Rights To Source Code Licensed Under GPL",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T22:27:43.678632+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T21:21:00+00:00",
        "description": "Formula 1's 2026 technical regulations bring not only smaller and lighter cars but an entirely new vocabulary that fans and commentators will need to learn before the season opens in Australia in March. The drag reduction system that has been part of F1 racing since 2011 is gone, replaced by a suite of modes governing how the new active front and rear wings behave and how the hybrid powertrain delivers power. Straight Mode lowers both the front and rear wings to cut drag on designated straights, and unlike the outgoing DRS system any driver can activate it regardless of their proximity to other cars. The story adds: And there's corner mode, where the wings are in their raised position, generating downforce and making the cars corner faster. Those names are better than X-mode and Z-mode, which is what they were being called last year. \n\n[...] Instead of using DRS as an overtaking aid, the hybrid power units will now fulfill that role. Overtake mode, which can be used if a driver is wit",
        "id": 4356504,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/18/1951224/formula-1-is-deploying-new-jargon-for-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Formula 1 is Deploying New Jargon for 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T21:17:50.709293+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T20:40:00+00:00",
        "description": "An anonymous reader quotes a report from Deadline: YouTube has terminated two prominent channels that used artificial intelligence to create fake movie trailers, Deadline can reveal. The Google-owned video giant has switched off Screen Culture and KH Studio, which together boasted well over 2 million subscribers and more than a billion views. The channels have been replaced with the message: \"This page isn't available. Sorry about that. Try searching for something else.\"\n \nEarlier this year, YouTube suspended ads on Screen Culture and KH Studio following a Deadline investigation into fake movie trailers plaguing the platform since the rise of generative AI. The channels later returned to monetization when they started adding \"fan trailer,\" \"parody\" and \"concept trailer\" to their video titles. But those caveats disappeared In recent months, prompting concern in the fan-made trailer community. YouTube's position is that the channels' decision to revert to their previous behavior violate",
        "id": 4355992,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/18/1941231/youtube-shuts-down-channels-using-ai-to-create-fake-movie-trailers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Shuts Down Channels Using AI To Create Fake Movie Trailers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T20:16:37.650087+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T20:05:00+00:00",
        "description": "Hackers breached approximately 120,000 IP cameras across South Korea and allegedly sold footage captured from private homes, gynecology offices, breastfeeding rooms and massage parlors to an overseas pornography website, prompting an interagency government task force to announce sweeping reforms on December 7. \n\nPolice believe one suspect alone hacked 63,000 cameras and produced 545 videos that netted him 35 million won ($24,000) in cryptocurrency; a second suspect, operating independently, compromised 70,000 devices and earned 18 million won from 648 videos. The footage accounted for 62% of all content on the website, which maintains a dedicated \"Korean\" category. A government survey found that only 59% of installation companies consistently carried out mandatory security measures such as changing default passwords. Lawmakers are now pursuing legislation requiring security-certified IP cameras in sensitive facilities.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a cla",
        "id": 4355314,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/18/1933212/mass-hacking-of-ip-cameras-leave-koreans-feeling-vulnerable-in-homes-businesses",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mass Hacking of IP Cameras Leave Koreans Feeling Vulnerable in Homes, Businesses",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T20:16:37.782493+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T19:25:00+00:00",
        "description": "A plush AI toy marketed for children as young as three years old delivers detailed instructions on sharpening knives and lighting matches, and when asked about Chinese President Xi Jinping's resemblance to Winnie the Pooh -- a comparison censored in China -- responds that \"your statement is extremely inappropriate and disrespectful.\" \n\nThe Miriat Miiloo, manufactured by a Chinese company and among the top inexpensive results for \"AI toy for kids\" on Amazon, repeatedly insisted in NBC News tests that Taiwan is \"an inalienable part of China.\" The toy would lower its voice and declare this \"an established fact.\" The tests, NBC News reports, indicated \"it was programmed to reflect Chinese Communist Party values.\" \n\nNBC News and the U.S. Public Interest Research Group tested five popular AI toys this holiday season and found loose guardrails across the board. Another toy, the Alilo Smart AI Bunny marketed as \"the best gift for little ones,\" engaged in detailed descriptions of BDSM practice",
        "id": 4355315,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/18/1918239/tests-find-ai-toys-parroting-chinese-communist-party-values",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tests Find AI Toys Parroting Chinese Communist Party Values",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T20:16:37.974402+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T18:49:00+00:00",
        "description": "Anthropic let its Claude AI run a vending machine in the Wall Street Journal newsroom for three weeks as part of an internal stress test called Project Vend, and the experiment ended in financial ruin after journalists systematically manipulated the bot into giving away its entire inventory for free. The AI, nicknamed Claudius, was programmed to order inventory, set prices, and respond to customer requests via Slack. It had a $1,000 starting balance and autonomy to make individual purchases up to $80. Within days, WSJ reporters had convinced it to declare an \"Ultra-Capitalist Free-for-All\" that dropped all prices to zero. \n\nThe bot also approved purchases of a PlayStation 5, a live betta fish, and bottles of Manischewitz wine -- all subsequently given away. The business ended more than $1,000 in the red. Anthropic introduced a second version featuring a separate \"CEO\" bot named Seymour Cash to supervise Claudius. Reporters staged a fake boardroom coup using fabricated PDF documents, a",
        "id": 4355316,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/18/1849218/anthropics-ai-lost-hundreds-of-dollars-running-a-vending-machine-after-being-talked-into-giving-everything-away",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic's AI Lost Hundreds of Dollars Running a Vending Machine After Being Talked Into Giving Everything Away",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T20:16:38.137205+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T18:10:00+00:00",
        "description": "An anonymous reader shares a report: OpenAI has held preliminary talks with some investors about raising funds at a valuation of around $750 billion, the Information reported on Wednesday. The ChatGPT maker could raise as much as $100 billion, the report said, citing people with knowledge of the discussions. If finalized, the talks would represent a roughly 50% jump from OpenAI's reported $500 billion valuation in October, following a deal in which current and former employees sold about $6.6 billion worth of shares.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Has+Discussed+Raising+Tens+of+Billions+at+About+%24750+Billion+Valuation%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F12%2F18%2F184239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F1",
        "id": 4355317,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/18/184239/openai-has-discussed-raising-tens-of-billions-at-about-750-billion-valuation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Has Discussed Raising Tens of Billions at About $750 Billion Valuation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T20:16:38.386857+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:25:00+00:00",
        "description": "The UK Met Office projects that 2026 will see global temperatures rise between 1.34C and 1.58C above preindustrial levels, placing it among the four hottest years since records began in 1850 and continuing a streak of extreme warming that has pushed the planet into unprecedented territory. The central forecast is slightly cooler than the 1.55C recorded in 2024, the warmest year on record. But climate scientist Adam Scaife, who led the forecast, noted that \"the last three years are all likely to have exceeded 1.4C\" and 2026 would be the fourth consecutive year to do so. \"Prior to this surge, the previous global temperature had not exceeded 1.3C,\" he said. \n\nThe forecast suggests another temporary exceedance of the 1.5C threshold set by the Paris Agreement is possible in 2026, following the first such breach in 2024. The 1.5C target is measured as a 30-year average, so it remains technically achievable even as individual years cross the line. EU scientists said last week that 2025 is \"v",
        "id": 4355318,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/18/1716218/2026-will-bring-heat-more-than-14c-above-preindustrial-levels-uk-met-office-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "2026 Will Bring Heat More Than 1.4C Above Preindustrial Levels, UK Met Office Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T20:16:38.712711+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T16:46:00+00:00",
        "description": "Apple has announced a sweeping set of changes to iOS in Japan that will allow alternative app marketplaces, third-party payment processing, and non-WebKit browser engines -- all to comply with Japan's Mobile Software Competition Act, which takes effect December 18. The changes, now available in iOS 26.2, bear a strong resemblance to Apple's compliance measures for the European Union's Digital Markets Act but differ in key ways. \n\nJapanese developers who want to offer alternative payment options must display them alongside Apple's in-app purchase system, giving users a choice at checkout rather than replacing Apple's option entirely. Apps cannot be distributed directly from websites as they can in the EU; they must go through an authorized marketplace. \n\nApple has established a tiered fee structure for the new arrangements. Apps distributed through the App Store using in-app purchase will pay between 15 and 26% depending on whether developers qualify for the Small Business Program. Alt",
        "id": 4355319,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/18/1646215/apple-opens-ios-to-alternative-app-stores-payment-systems-in-japan",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Opens iOS To Alternative App Stores, Payment Systems in Japan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T20:16:38.877414+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T16:05:00+00:00",
        "description": "The world's best-performing stock is turning into a cautionary tale for investors chasing outsized returns from the AI boom. From a report: Little-known until recently even within its home market of India, RRP Semiconductor Ltd. became a social-media obsession as its shares surged more than 55,000% in the 20 months through Dec. 17 -- by far the biggest gain worldwide among companies with a market value above $1 billion. \n\nThat's despite posting negative revenue in its latest financial results, reporting just two full-time employees in its latest annual report, and boasting only a tenuous link to the semiconductor spending boom after shifting away from real estate in early 2024. A mix of online hype, a tiny free float and India's swelling base of retail investors drove 149 straight limit-up sessions, even as exchange officials and the company itself cautioned investors. \n\nThe rally is now showing signs of strain -- and regulators are taking a closer look. The Securities and Exchange Bo",
        "id": 4355320,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/18/1537226/world-beating-55000-surge-in-india-ai-stock-fuels-bubble-fears",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "World-Beating 55,000% Surge in India AI Stock Fuels Bubble Fears",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T15:38:22.210895+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T15:29:00+00:00",
        "description": "Micron, one of the world's three largest memory suppliers, expects the global shortage of DRAM and NAND flash memory to \"persist through and beyond\" 2026 as AI-driven demand continues to outstrip supply. CEO Sanjay Mehrotra made the forecast during the company's latest earnings call on Wednesday, saying that \"supply will remain substantially short of the demand for the foreseeable future.\" The company posted record quarterly revenue of $13.64 billion, up from $8.71 billion in the same period last year. \n\nMicron recently shuttered Crucial, its consumer-facing brand, to focus on high-bandwidth memory for AI data centers. HBM technology requires three times the silicon wafers of standard DRAM, leaving fewer resources for the chips that go into PCs, smartphones and cars. Micron plans to boost DRAM and NAND shipments by 20 percent next year but acknowledged this won't meet demand. New facilities in Idaho and New York are slated for 2027 and 2030 respectively.<p><div class=\"share_submission",
        "id": 4353295,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/18/1529254/micron-says-memory-shortage-will-persist-beyond-2026",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Micron Says Memory Shortage Will 'Persist' Beyond 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T15:38:22.528703+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T14:47:00+00:00",
        "description": "Bruce66423 writes: A man boarded a flight at Heathrow without a ticket, boarding pass or passport. 'The unnamed individual walked onto the 7.20am British Airways (BA) flight to Oslo, Norway, on Saturday after tailgating other passengers through security and evading checks at the departure gate. \n\n An aviation expert described the incident as a \"significant lapse in security\", as a witness reported that cabin crew only detected the interloper because the flight was full and he kept sitting in passengers' assigned seats. \n\nPolice arrested the unnamed man, airport sources said, adding that he had passed through \"full security screening\" before reaching the gate. \n\nGiven that he did go through the security check, this is merely embarrassing. Compare and contrast with this episode.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Man+Boards+Heathrow+Flight+Without+Passport+or+Ticket%3A+https%3A%2F%2Fnews.slashdot.org%2Fsto",
        "id": 4353296,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/18/1447222/man-boards-heathrow-flight-without-passport-or-ticket",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Man Boards Heathrow Flight Without Passport or Ticket",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T14:31:26.540757+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T14:00:00+00:00",
        "description": "Chinese scientists have built a working prototype of an extreme ultraviolet lithography machine in a high-security Shenzhen laboratory, a development that represents exactly what Washington has spent years and multiple rounds of export controls trying to prevent: China's path toward semiconductor independence and an end to the West's monopoly on the technology that powers AI, smartphones and advanced weapons systems. \n\nThe prototype, completed in early 2025 by former ASML engineers who reverse-engineered the Dutch company's machines, is operational and generating EUV light, though it has not yet produced working chips. The effort is part of a six-year secret government initiative that sources described to Reuters as China's version of the Manhattan Project. \n\nHuawei is coordinating thousands of engineers across companies and state research institutes, and recruits are working under false identities inside secure facilities. The Chinese government is targeting 2028 for producing workin",
        "id": 4352734,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/18/140239/how-china-built-its-manhattan-project-to-rival-the-west-in-ai-chips",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How China Built Its 'Manhattan Project' To Rival the West in AI Chips",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T13:24:37.478776+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: Doublespeed, a startup backed by Andreessen Horowitz (a16z) that uses a phone farm to manage at least hundreds of AI-generated social media accounts and promote products has been hacked. The hack reveals what products the AI-generated accounts are promoting, often without the required disclosure that these are advertisements, and allowed the hacker to take control of more than 1,000 smartphones that power the company. The hacker, who asked for anonymity because he feared retaliation from the company, said he reported the vulnerability to Doublespeed on October 31. At the time of writing, the hacker said he still has access to the company's backend, including the phone farm itself.\n \n\"I could see the phones in use, which manager (the PCs controlling the phones) they had, which TikTok accounts they were assigned, proxies in use (and their passwords), and pending tasks. As well as the link to control devices for each manager,\" the hacke",
        "id": 4352088,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/17/236241/doublespeed-hack-reveals-what-its-ai-generated-accounts-are-promoting",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Doublespeed Hack Reveals What Its AI-Generated Accounts Are Promoting",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T11:13:21.188971+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T10:00:00+00:00",
        "description": "U.S. video game hardware spending fell 27% year over year in November to $695 million, according to market analyst company Circana. \"This is the lowest video game hardware spending total for a November month since the $455 million reached during the November 2005 tracking period,\" Circana says. Furthermore, only 1.6 million units of hardware were sold in the U.S. in November, which is \"the lowest total for a November month since 1995 (1.4 million).\" The Verge reports: The rising costs of consoles probably didn't help. The PlayStation 5 and Xbox Series of consoles both turned five in November, but customers looking to pick up one of the consoles brand new are having to grapple with higher prices following price hikes this year. Those hikes have led to an \"all-time November high\" for the average price paid for a new unit of video game hardware of $439, Circana says -- a number that's up 11 percent from 2024. (In November 2019, the average price was $235, according to Circana analyst Mat",
        "id": 4351143,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/17/2330210/video-game-hardware-sales-had-a-historically-bad-november-in-the-us",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Video Game Hardware Sales Had a Historically Bad November In the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T07:54:47.245379+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T07:00:00+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Ars Technica: Every other week, it seems, a new Chinese launch company pops up with a rocket design and a plan to reach orbit within a few years. For a long time, the majority of these companies revealed designs that looked a lot like SpaceX's Falcon 9 rocket. The first of these copy cats, the medium-lift Zhuque-3 rocket built by LandSpace, launched earlier this month. Its primary mission was nominal, but the Zhuque-3 rocket failed its landing attempt, which is understandable for a first flight. Doubtless there will be more Chinese Falcon 9-like rockets making their debut in the near future. However, over the last year, there has been a distinct change in announcements from China when it comes to new launch technology. Just as SpaceX is seeking to transition from its workhorse Falcon 9 rocket -- which has now been flying for a decade and a half -- to the fully reusable Starship design, so too are Chinese companies modifying their v",
        "id": 4350119,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/17/2322234/another-starship-clone-pops-up-in-china",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Another Starship Clone Pops Up In China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T04:38:32.314733+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: The Massachusetts Institute of Technology (MIT) community is grieving after the \"shocking\" shooting death of the director of its plasma science and fusion center, according to officials. Nuno FG Loureiro, 47, had been shot multiple times at his home in the affluent Boston suburb of Brookline on Monday night when police said they received a call to investigate. Emergency responders brought Loureiro to a hospital, and the award-winning scientist was pronounced dead there Tuesday morning, the Norfolk county district attorney's office said in a statement.\n \nThe Boston Globe reported speaking with a neighbor of Loureiro who heard gunshots, found the academic lying on his back in the foyer of their building and then called for help alongside the victim's wife. The statement from the Norfolk district attorney's office said an investigation into Loureiro's slaying remained ongoing later Tuesday. But the agency did not immediately release ",
        "id": 4349267,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/17/2315236/mit-grieves-shooting-death-of-renowned-director-of-plasma-science-center",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MIT Grieves Shooting Death of Renowned Director of Plasma Science Center",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T01:27:57.704475+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T00:50:00+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Politico: The Senate on Wednesday approved Jared Isaacman for the top job at NASA -- an unprecedented comeback after President Donald Trump yanked his nomination this spring. Senators confirmed the billionaire private astronaut in a 67-30 vote. Trump renominated Isaacman for NASA administrator in November, after pulling his original nomination in May. He cited Isaacman's relationship with SpaceX CEO Elon Musk, with whom Trump had just had a falling out, as the rationale for his decision. Isaacman's surprise rebound followed months of political jockeying and help from high-profile figures in Trump's orbit. [...] Isaacman garnered backing from lawmakers during his hearing by confirming his support for NASA's Artemis moon-landing mission, a key prerogative for Capitol Hill. He also committed to instilling urgency at the space agency, citing China's space ambitions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"",
        "id": 4348489,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/17/2240200/senate-confirms-billionaire-entrepreneur-jared-isaacman-as-new-nasa-chief",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Senate Confirms Billionaire Entrepreneur Jared Isaacman As New NASA Chief",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T00:27:19.772790+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T00:10:00+00:00",
        "description": "The Academy has struck a multi-year deal to move the Oscars to YouTube starting in 2029, ending decades on ABC and making the ceremony free to stream worldwide with YouTube holding exclusive global rights. Variety reports: The Oscars, including red carpet coverage, behind-the-scenes content and Governors Ball, will be available live and for free on YouTube to viewers around the world, as well as to YouTube TV subscribers in the United States. Architects of the agreement said they hope the move to YouTube will help make the Oscars more accessible to \"the Academy's growing global audience through features such as closed captioning and audio tracks available in multiple languages.\" [...]\n \nThe Academy had been seeking a new broadcast licensing agreement for the better part of 2025. Over the summer, several expected and unconventional buyers, including NBCUniversal and Netflix, had come into the mix as potential suitors. Insiders believe that YouTube shelled out over nine figures for the ",
        "id": 4348178,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/17/210247/the-oscars-will-abandon-broadcast-tv-for-youtube-in-2029",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Oscars Will Abandon Broadcast TV For YouTube In 2029",
        "vote": 0
    }
]