[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:52.074964+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T18:01:06+00:00",
        "description": "This talk explores the evolving nature of marriage and relationships, contrasting the idealized portrayals on social media with the often challenging reality. It emphasizes how modern couples are frequently unprepared for the complexities of long-term commitment due to a lack of practical knowledge, with many relying on romanticized ideals from pop culture or unverified advice from influencers. The author shares a personal story of marital breakdown and self-discovery, highlighting how previous generations relied on family, community, and religious guidance, support systems that are now largely replaced by social media. \n\nWhile acknowledging that platforms like Instagram and TikTok can offer community and mental health awareness, the author warns that they also promote unrealistic expectations, gender stereotypes, and misleading advice that can harm young people's understanding of love and partnership. The rise of “soft life” culture for women and hyper-masculine, often misogynistic, ",
        "id": 4354472,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=sGrtmHgS7qo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sGrtmHgS7qo/hqdefault.jpg",
        "title": "Social media is giving you bad dating advice—here’s how to spot it | Funmi Okonweze | TEDxClarkstown",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:52.244654+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:58:11+00:00",
        "description": "Jen Bartram has enjoyed a long career as a BBC News presenter. Her high profile role has brought her many unexpected benefits and delights but has also inevitably made her a target for the technological blight of Internet trolling. \n\nJen reveals her behind the scenes struggles about dealing with the attacks, the failure of most well-meaning advice and how she battled the regular flow of digital attacks from invisible invaders. Jennifer Bartram is perhaps best known for her 12+ years presenting the weather news for BBC Look North. Her BBC career extends over 20 years. As a presenter, Jennifer has fronted live TV and radio broadcasts for BBC local TV, BBC Radio 1, BBC 5Live and the BBC World Service. \n\nOutside of her presenting work, Jen is passionate about teaching and coaching communications. She is a qualified university lecturer and previously held the post of course leader in Radio and Digital Media at the University of West London. Since then she has worked as a communications tra",
        "id": 4354473,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8R0Wkw0wgCs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8R0Wkw0wgCs/hqdefault.jpg",
        "title": "Under siege by internet trolls | Jennifer Bartram | TEDxDurham",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:52.418930+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:57:57+00:00",
        "description": "Cybercrime is rising, but fear-based warnings aren’t working—fear shuts people down instead of motivating action. This talk shows how shifting the conversation to possibility, clarity, and inclusive language can empower people to protect themselves. Audiences learn why the stories we tell about cybersecurity may be our most powerful defence Cybersecurity, Human Behaviour, Empowerment \nCybersecurity leader and CEO of CYBR. Passionate about the intersection of human behaviour and digital risk, with experience on stage and in leadership. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4354474,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SRZrbJKYdqA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SRZrbJKYdqA/hqdefault.jpg",
        "title": "The biggest cyber threat? The way we talk about it | Jasmin Ilic | TEDxVictor Harbor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:52.559293+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:57:47+00:00",
        "description": "Ukebox perform their newest set with ukulele takes on..\n\n- September by Earth Wind & Fire\n- Children by Robert Miles \n- Zombie Nation by Kernkraft \n- Pretty Green Eyes by Ultrabeat\n- Insomnia by Faithless\n- Better Off Alone by Alice Deejay\n- Blue (Da Ba Dee) by Eiffel 65\n- Born Slippy by Underworld\n- Saturday Night by Whigfield\n- We Like to Party! & Boom, Boom, Boom, Boom!! by Vengaboys Ukebox has been described as the world's only ukulele boy band. Hailing from Liverpool, these four exceptional musicians perform across a variety of genres and will deliver a musical experience unlike anything you may have experienced before. Their melodic vocalisations and unique arrangements seamlessly blend comedy, musicianship, and creativity. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4354475,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fIEN3uFFZ-g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fIEN3uFFZ-g/hqdefault.jpg",
        "title": "An Ibiza Mega-Mix & More on Ukuleles! | UKEBOX Ukulele Band | TEDxDurham",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:52.685460+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:57:30+00:00",
        "description": "Maria Clara Coelho fala sobre como as atividades manuais podem ajudar na melhoria do foco dos estudantes. Em sua apresentação, ela destaca desafios para manter a concentração diante do excesso de estímulos digitais e explica como práticas como desenho, pintura e música contribuem para a calma, a criatividade e o desempenho acadêmico. Maria Clara Coelho é estudante do 4º ano do Colégio Santo Inácio, apaixonada por artes, atividades manuais e música. Seu sonho é se tornar uma desenhista profissional. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4354476,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=-3OT7ISYR5s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-3OT7ISYR5s/hqdefault.jpg",
        "title": "Concentração Criativa: o segredo está nas mãos | Maria Clara Coelho | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:52.797223+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:57:06+00:00",
        "description": "Maria Eduarda Baião aborda a pressão social para ter um smartphone, os riscos do uso excessivo e os impactos na infância e adolescência. Com bom humor, ela compartilha sua rotina sem celular, mostrando que é possível aproveitar momentos offline, praticando esportes e estudando.  Maria Eduarda Baião é estudante do 6º ano do Colégio Santo Inácio. Ativa e participativa, ela pratica esportes, faz cursos e integra o grupo de liderança da escola. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4354477,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OgCSk0kVnow",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OgCSk0kVnow/hqdefault.jpg",
        "title": "A vida de uma adolescente que nunca teve celular | Maria Eduarda Baião | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:52.935696+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:56:58+00:00",
        "description": "Esta palestra conta a história de um momento simples que transformou completamente o rumo da vida de Tiago Mochileiro. Em meio a dúvidas, sonhos inacabados e a sensação de que faltava algo, ele decidiu escrever uma única página que se tornou o ponto de virada da sua trajetória. Aquela página não era apenas um plano ou uma lista de desejos. Ela era um compromisso consigo mesmo e um convite para viver a vida de forma mais verdadeira.\n\nTiago compartilha como esse gesto aparentemente pequeno abriu caminho para viagens, descobertas, encontros e desafios que ele jamais imaginaria enfrentar. Ele mostra que mudar a própria história não exige perfeição, mas coragem para começar, mesmo que seja com uma única linha em branco esperando para ser escrita.\n\nPara alunos e jovens, a palestra é um lembrete de que grandes transformações nascem de decisões simples. Uma página pode marcar o início de uma nova fase, de um projeto, de uma mudança pessoal ou de um sonho que estava adormecido. A mensagem cent",
        "id": 4354478,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Km4SpHamt9A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Km4SpHamt9A/hqdefault.jpg",
        "title": "“A página que mudou tudo.” | Tiago Silva | TEDxVITA School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:53.074743+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:56:32+00:00",
        "description": "Esta palestra convida o público a enxergar a educação como um processo coletivo, em que cada pessoa que faz parte da vida de um estudante contribui para sua formação. O palestrante compartilha experiências que mostram que o aprendizado não acontece apenas dentro da sala de aula. Ele surge também do apoio da família, do cuidado da comunidade e das oportunidades que surgem no caminho.\n\nA fala destaca que nenhum aluno alcança seu potencial sozinho. Professores precisam de pais presentes, pais precisam da escola como parceira e os jovens precisam sentir que têm uma rede que acredita neles. Quando todos assumem essa corresponsabilidade, o futuro deixa de ser algo incerto e passa a ser uma construção real, feita passo a passo.\n\nPara estudantes, a palestra reforça que crescer é mais fácil quando se tem alguém ao lado. Para educadores e responsáveis, mostra que a união de esforços transforma a escola em um ambiente vivo, onde todos aprendem e evoluem juntos. A mensagem central é que o futuro ",
        "id": 4354479,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vbHOfFhIU1U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vbHOfFhIU1U/hqdefault.jpg",
        "title": "Educação é corresponsabilidade | Rafael Gama | TEDxVITA School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:53.196221+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:56:20+00:00",
        "description": "Married, a father of two, and an entrepreneur, Olivier Goy was diagnosed with ALS in 2020. Since then, he has committed himself to advancing medical research and advocating for a more inclusive place for people with disabilities in society. He does so through two key roles: as an ambassador for the Paris Brain Institute, the world’s second-largest neuroscience research center, and as a patron of Les Invincibles, a joyful and determined association founded after the release of the film Invincible Summer.\nIn his talk, Olivier invites us to reflect on what may prevent us from feeling truly alive.\nWe have been taught to hide our doubts, silence our fears, and conceal our wounds, as if showing a crack were already a sign of weakness. And yet… it is often precisely there that everything begins.\nWhen we dare to be real. When we stop playing a role. Fragility makes us human, deeply human. It creates connection, opens doors, and gives others permission to be who they truly are.\nFragility does ",
        "id": 4354480,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=4WeAwbxpsag",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4WeAwbxpsag/hqdefault.jpg",
        "title": "When fragility becomes strength  Quand la fragilité devient une force | Olivier Goy | TEDxMontmartre",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:53.295499+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:56:11+00:00",
        "description": "Leonardo Ribeiro compartilha sua experiência como estudante com TDAH, destacando características como desatenção, hiperatividade e impulsividade. Leonardo traz exemplos do seu dia a dia na sala de aula, mostrando como pequenos gestos ajudam na concentração e como os desafios impactam provas, recreio e relações sociais. Leonardo Ribeiro é estudante do 6º ano do Colégio Santo Inácio. Curioso e criativo, Leonardo gosta de aprender e compartilhar suas experiências. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4354481,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=laYFuy1y6h0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/laYFuy1y6h0/hqdefault.jpg",
        "title": "Os desafios do aluno com TDAH na escola | Leonardo Ribeiro | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:53.405619+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:56:03+00:00",
        "description": "Esta palestra apresenta a história de Deise Dória, criadora da Palha Decor, e como um simples material, carregado de tradição e identidade cultural, se tornou o centro de um movimento capaz de transformar vidas. Deise compartilha sua jornada como artesã, mulher empreendedora e líder comunitária, mostrando como a palha deixou de ser apenas matéria-prima para se tornar instrumento de autonomia, renda e autoestima para diversas mulheres.\n\nA palestra revela como, ao unir técnica, criatividade e propósito, ela ajudou a construir uma rede de artesãs que encontraram no trabalho manual não apenas uma fonte de sustento, mas uma forma de expressar força, história e pertencimento. É uma narrativa sobre como pequenas iniciativas, quando guiadas por empatia e visão, podem impactar famílias inteiras e revitalizar comunidades inteiras.\n\nPara alunos e jovens, este é um lembrete poderoso de que grandes transformações começam em gestos simples. A trajetória de Deise mostra que propósito não nasce de gr",
        "id": 4354482,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ytcqy4BFwTU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ytcqy4BFwTU/hqdefault.jpg",
        "title": "Mulheres, Palha e Propósito, Movimento transforma Comunidades | Deise Dória | TEDxVITA School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:53.562683+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:55:44+00:00",
        "description": "Gabriela mostra que comer bem pode ser divertido e saboroso. Ao falar sobre culinária saudável, ela explica a diferença entre comida de verdade e alimentos ultraprocessados, apresenta cinco regras simples para uma alimentação equilibrada e compartilha dicas práticas para incluir mais cores e nutrientes no prato. Gabriela tem 10 anos, é estudante do Colégio Santo Inácio e apaixonada por culinária. Gosta de brincar, cozinhar e passar tempo ao lado da família. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4354483,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=o6ah9dxJKFw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/o6ah9dxJKFw/hqdefault.jpg",
        "title": "Culinária Saudável | Gabriela Elias | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:53.845339+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:55:15+00:00",
        "description": "Esta palestra é um convite para refletir sobre o verdadeiro sentido do trabalho e sobre o impacto que cada um de nós pode causar no mundo. O palestrante compartilha momentos marcantes da própria trajetória e revela como descobriu que sua profissão só fazia sentido quando estava ligada a transformar vidas, apoiar outras pessoas e gerar mudanças reais ao redor.\n\nAo longo da fala, ele mostra que trabalhar não é apenas cumprir tarefas, mas usar o que sabemos para melhorar a vida de alguém, por menor que seja essa mudança. A palestra também aborda as dúvidas, frustrações e crises que surgem quando sentimos que perdemos o propósito, e como reencontrar o caminho através do impacto humano.\n\nPara alunos e jovens, a mensagem é clara: o que realmente sustenta uma carreira não é apenas dinheiro, prestígio ou reconhecimento, mas a capacidade de tocar vidas. Quando entendemos que nosso trabalho pode ser uma ferramenta de transformação, descobrimos um tipo diferente de sucesso, aquele que permanece ",
        "id": 4354484,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TRaEGpYaxMs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TRaEGpYaxMs/hqdefault.jpg",
        "title": "Quando meu trabalho não ajudar mais as pessoas, eu paro.”  | Lys Silva | TEDxVITA School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:54.056255+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:55:07+00:00",
        "description": "This talk challenges the belief that GPA alone determines success after college. It explains how GPA functions as an early signal of competence, while networking shapes access to real opportunities. Founder of Nesam Fashion, a leading Jewellery brand for Tier-2 and Tier-3 markets, and Founder of Vijaya Consulting Group, drives business growth through Management Consulting, innovative strategies, and Digital Marketing excellence, helping brands overcome challenges, scale smarter, and thrive in competitive markets This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4354485,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IvYaCV5guGc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IvYaCV5guGc/hqdefault.jpg",
        "title": "Why networking opens doors after college | Om Prakash Senthil Kumar | TEDxLoyola College",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-18T19:53:54.278021+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-18T17:54:54+00:00",
        "description": "Esta palestra provoca uma reflexão profunda sobre os rótulos que carregamos e que, muitas vezes, definem nossos caminhos antes mesmo que possamos escolher quem queremos ser. O palestrante apresenta histórias reais e situações do dia a dia para mostrar como a ideia de “inteligente”, “burro” ou “esforçado” molda nossa autoestima, nossas oportunidades e até nossos sonhos.\n\nA proposta é desconstruir essas palavras e mostrar que nenhuma delas determina o futuro de alguém. A palestra revela que inteligência vai muito além de notas e desempenho imediato, e que o esforço consistente pode transformar qualquer trajetória. Mais do que isso, mostra que todos têm talentos diferentes, ritmos diferentes e formas únicas de aprender.\n\nPara alunos e jovens, esta é uma oportunidade de enxergar a si mesmos com mais gentileza e coragem. A mensagem principal é que ninguém deve ser definido por um rótulo. O que realmente importa é a disposição de crescer, aprender e se reinventar. Quando entendemos isso, ab",
        "id": 4354486,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bjb0u3mEmX8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bjb0u3mEmX8/hqdefault.jpg",
        "title": "“O inteligente, o burro e o esforçado.” | Gabriel Fontes | TEDxVITA School Youth",
        "vote": 0
    }
]