[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T16:53:45.062897+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T16:00:09+00:00",
        "description": "The Chinese Room's Still Wakes the Deep represented a solid, if somewhat traditional, first-person horror experience, one centred on the Beira D and its infestation by a hostile entity. Given its mix of tension and tragedy, the plot felt complete but still left plenty of room open for addressing various mysteries.\n\nSiren's Rest, the first story DLC, unfortunately, doesn't delve into them. Occurring over 10 years later, it focuses on a new character named Mhairi, a diver seeking to explore the wreckage with her crew and find answers. The underwater exploration is a new touch, but for the first hour or so, there's little more than opening doors and photographing corpses involved.\n\nThe tension does somewhat ratchet up later, and gameplay is a bit more diverse, but Siren's Rest fails to deliver on its premise, instead focusing on a more personal tale. This would have been fine given the solid voice acting, but even that lacks adequate set-up. What would have served as a decent epilogue to",
        "id": 2980129,
        "language": null,
        "link": "https://www.youtube.com/watch?v=4p5oXGbf2bw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4p5oXGbf2bw/hqdefault.jpg",
        "title": "Still Wakes The Deep: Siren's Rest DLC Review - You Can Skip It Without Much Consequence",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T14:43:17.849728+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T14:00:26+00:00",
        "description": "So, you've seen the latest trailer for Death Stranding 2: On the Beach. You didn't play the original for whatever reason but between the giant kaiju battles, dynamic weather, and highway chases – not to mention the lack of many first-party PS5 exclusives – you're intrigued. The downside is that you have no clue what's happening or who these people are, much less what went down in Death Stranding 1.\n\nYou could play the original, which clocks in at about 40.5 hours for the main story on average, according to HowLongToBeat, but how about a condensed version of everything that happens? It starts in unorthodox fashion with protagonist Sam Porter Bridges venturing through a vibrant, mountainous region (which bears more than a passing resemblance to Norway but don't worry about it). As his name indicates, Sam is a porter who delivers packages through rain, sleet, and snow. Except, as we soon learn in the opening, the rain will age and eventually kill you, as it does to several birds mid-flig",
        "id": 2979011,
        "language": null,
        "link": "https://www.youtube.com/watch?v=GVmBFBhHlv0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GVmBFBhHlv0/hqdefault.jpg",
        "title": "Death Stranding: Full Story Explained- EVERYTHING You Need To Know Before You Play Death Stranding 2",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T10:23:03.889478+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T09:30:38+00:00",
        "description": "Video games face a very huge problem of preservation, as products of this medium are quite prone to being dated on account of rapid changes in technology and shifting trends. \n\nAs such, remakes have been quite prominent as of late which try to transform classic experiences in a way that’s palatable to the modern audiences. With this video, we will be taking a look at 25 of the best remakes of all time that are absolutely worth your time",
        "id": 2977042,
        "language": null,
        "link": "https://www.youtube.com/watch?v=tajclPzccbg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tajclPzccbg/hqdefault.jpg",
        "title": "25 Greatest Video Game Remakes That Are PEAK GAMING [2025 Edition]",
        "vote": 0
    }
]