[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-21T00:04:55.124536+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T23:30:00+00:00",
        "description": "The company behind Applebee's and IHOP plans to use AI in its restaurants and behind the scenes to streamline operations and encourage repeat customers. From a report: Dine Brands is adding AI-infused tech support for all of its franchisees, as well as an AI-powered \"personalization engine\" that helps restaurants offer customized deals to diners, said Chief Information Officer Justin Skelton. The Pasadena, Calif.-based company, which also owns Fuzzy's Taco Shop and has over 3,500 restaurants across its brands, is taking a \"practical\" approach to AI by focusing on areas that can drive sales, Skelton said. \n\nStreamlining tech support for Dine Brands' more than 300 franchisees is important because issues like a broken printer take valuable time away from actually managing restaurants, Skelton said. Dine Brands' AI tool, which was built with Amazon's Q generative AI assistant, allows the company's field technology services staff to query its knowledge base for tech help using plain Englis",
        "id": 2983195,
        "language": null,
        "link": "https://slashdot.org/story/25/06/20/1954245/applebees-and-ihop-plan-to-introduce-ai-in-restaurants?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Applebee's and IHOP Plan To Introduce AI in Restaurants",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T22:58:35.279332+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T22:50:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Large-scale attacks designed to bring down Internet services by sending them more traffic than they can process keep getting bigger, with the largest one yet, measured at 7.3 terabits per second, being reported Friday by Internet security and performance provider Cloudflare. The 7.3Tbps attack amounted to 37.4 terabytes of junk traffic that hit the target in just 45 seconds. That's an almost incomprehensible amount of data, equivalent to more than 9,300 full-length HD movies or 7,500 hours of HD streaming content in well under a minute.\n \nCloudflare said the attackers \"carpet bombed\" an average of nearly 22,000 destination ports of a single IP address belonging to the target, identified only as a Cloudflare customer. A total of 34,500 ports were targeted, indicating the thoroughness and well-engineered nature of the attack. [...] Cloudflare said the record DDoS exploited various reflection or amplification vectors, including the p",
        "id": 2982881,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/20/2010218/record-ddos-pummels-site-with-once-unimaginable-73tbps-of-junk-traffic?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Record DDoS Pummels Site With Once-Unimaginable 7.3Tbps of Junk Traffic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T22:58:35.451207+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T22:10:00+00:00",
        "description": "Manhattan's congestion pricing program has reduced traffic by 10% and cut car-noise complaints by 70% in its first six months of operation, according to city data. The $9 daily toll for vehicles entering Manhattan below 60th Street began January 5, generating approximately $50 million monthly for subway and public transit improvements. \n\nBuses now travel fast enough that drivers must stop and wait to maintain schedules, while subway ridership has increased sharply since the program launched. Broadway theater attendance has risen rather than declined as some critics predicted. Polling shows more New Yorkers now support the toll than oppose it, a reversal from widespread opposition before implementation. \n\nThe policy took nearly 50 years to enact despite originating from Columbia University economist William Vickrey's work in the 1960s. Congress blocked a similar proposal in the 1970s, and the current program faced a six-year implementation delay after Governor Andrew Cuomo signed it in",
        "id": 2982882,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/20/205237/congestion-pricing-in-manhattan-is-a-predictable-success?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Congestion Pricing in Manhattan is a Predictable Success",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T21:53:30.721404+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T21:50:00+00:00",
        "description": "Apple is facing a proposed class-action lawsuit from shareholders who allege the company misled investors about the readiness of its AI-powered Siri upgrades, contributing to a $900 billion drop in market value. Reuters reports: Shareholders led by Eric Tucker said that at its June 2024 Worldwide Developers Conference, Apple led them to believe AI would be a key driver of iPhone 16 devices, when it launched Apple Intelligence to make Siri more powerful and user-friendly. But they said the Cupertino, California-based company lacked a functional prototype of AI-based Siri features, and could not reasonably believe the features would ever be ready for iPhone 16s.\n \nShareholders said the truth began to emerge on March 7 when Apple delayed some Siri upgrades to 2026, and continued through this year's Worldwide Developers Conference on June 9 when Apple's assessment of its AI progress disappointed analysts. Apple shares have lost nearly one-fourth of their value since their December 26, 202",
        "id": 2982584,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/20/2147258/apple-sued-by-shareholders-for-allegedly-overstating-ai-progress?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Sued By Shareholders For Allegedly Overstating AI Progress",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T21:53:30.893208+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T21:30:00+00:00",
        "description": "An anonymous reader shares a report: At tens of thousands of shoreline cleanups across the United States in recent years, volunteers logged each piece of litter they pulled from the edges of lakes, rivers and beaches into a global database. One of the most common entries? Plastic bags. But in places throughout the United States where plastic bags require a fee or have been banned, fewer bags end up at the water's edge, according to research published this week in Science. \n\nLightweight and abundant, thin plastic bags often slip out of trash cans and recycling bins, travel in the wind and end up in bodies of water, where they pose serious risks to wildlife, which can become entangled or ingest them. They also break down into harmful microplastics, which have been found nearly everywhere on Earth. Using data complied by the nonprofit Ocean Conservancy, researchers analyzed results from 45,067 shoreline cleanups between 2016 to 2023, along with a sample of 182 local and state policies en",
        "id": 2982585,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/20/201242/banning-plastic-bags-works-to-limit-shoreline-litter-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Banning Plastic Bags Works To Limit Shoreline Litter, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T21:53:31.064997+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T20:50:00+00:00",
        "description": "The Department of Homeland Security is concerned about the rate at which outlawed signal-jamming devices are being found across the US. From a report: In a warning issued on Wednesday, it said it has seen an 830 percent increase in seizures of these signal jammers since 2021, specifically those made in China. Signal-jamming devices are outlawed in the US, mainly because they can interfere with communications between emergency services and law enforcement. \n\nWhile the Communications Act of 1934 effectively prohibits such devices, signal jammers of the type DHS is concerned about have only circulated in the last 20 to 30 years. Authorities have paid special attention to relay attack devices in recent years -- the types of hardware that can be used to clone signals used by systems such as remote car keys, although the first examples of these devices date back to the 1980s.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status",
        "id": 2982586,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/20/1957244/dhs-warns-of-sharp-rise-in-chinese-made-signal-jammers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DHS Warns of Sharp Rise in Chinese-Made Signal Jammers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T20:48:26.768324+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T20:11:00+00:00",
        "description": "Anthropic researchers found that 16 leading AI models from OpenAI, Google, Meta, xAI, and other major developers consistently engaged in harmful behaviors including blackmail, corporate espionage, and actions that could lead to human death when given autonomy and faced with threats to their existence or conflicting goals. \n\nThe study, released Friday, placed AI models in simulated corporate environments where they had access to company emails and could send messages without human approval. Claude Opus 4 and Google's Gemini 2.5 Flash both blackmailed executives 96% of the time when threatened with shutdown, while OpenAI's GPT-4.1 and xAI's Grok 3 Beta showed 80% blackmail rates. \n\nIn one scenario, Claude discovered through emails that an executive named Kyle Johnson was having an extramarital affair and would shut down the AI system at 5 p.m. The model sent a message threatening to expose the affair unless the shutdown was cancelled, stating \"Cancel the 5pm wipe, and this information r",
        "id": 2982112,
        "language": null,
        "link": "https://slashdot.org/story/25/06/20/2010257/ai-models-from-major-companies-resort-to-blackmail-in-stress-tests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Models From Major Companies Resort To Blackmail in Stress Tests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T20:48:26.940500+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T19:42:00+00:00",
        "description": "New York City on Friday announced new minimum-pay rules for rideshare drivers, settling on a smaller-than-proposed 5% increase following pushback from Uber Technologies and Lyft. From a report: An earlier proposal called for a 6.1% pay boost. The finalized regulations from the city's Taxi and Limousine Commission, or TLC, are also designed to deter Uber and Lyft from locking gig workers out of their apps in an attempt to keep costs down. The board of commissioners will vote on the rules on June 25, according to the agency's website. \n\nUber and Lyft had strongly opposed the original rate, warning customers that it would force them to increase prices. Lyft's shares extended declines after Bloomberg reported on the rules, falling as much as 3.3% to hit session lows. Uber's stock, which had been up as much as 2.3% earlier Friday, pared most of its gains on the news.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=NYC+Set",
        "id": 2982113,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/20/1944212/nyc-sets-smaller-driver-pay-bump-after-uber-lyft-pushback?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NYC Sets Smaller Driver Pay Bump After Uber, Lyft Pushback",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T18:38:30.397010+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T17:51:00+00:00",
        "description": "david.emery writes: Microsoft is making it harder to use Chrome on Windows. The culprit? This time, it's Windows' Family Safety feature. Since early this month, the parental control measure has prevented users from opening Chrome. Strangely, no other apps or browsers appear to be affected. \n\nRedditors first reported the issue on June 3. u/Witty-Discount-2906 posted that Chrome crashed on Windows 11. \"Just flashes quickly, unable to open with no error message,\" they wrote. Another user chimed in with a correct guess. \"This may be related to Parental Controls,\" u/duk242 surmised. \"I've had nine students come see the IT Desk in the last hour saying Chrome won't open.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+Parental+Controls+Are+Blocking+Chrome%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F06%2F20%2F1751200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_l",
        "id": 2981094,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/20/1751200/windows-parental-controls-are-blocking-chrome?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows Parental Controls Are Blocking Chrome",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T17:34:56.962695+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T16:46:00+00:00",
        "description": "A United Nations study has found a sharp global divide on attitudes toward AI, with trust strongest in low-income countries and skepticism high in wealthier ones. From a report: More than 6 out of 10 people in developing nations said they have faith that AI systems serve the best interests of society, according to a UN Development Programme survey of 21 countries seen by Bloomberg News. In two-thirds of the countries surveyed, over half of respondents expressed some level of confidence that AI is being designed for good. \n\nIn China, where steady advances in AI are posing a challenge to US dominance, 83% of those surveyed said they trust the technology. Like China, most developing countries that reported confidence in AI have \"high\" levels of development based on the UNDP's Human Development Index, including Kyrgyzstan and Egypt. But the list also includes those with \"medium\" and \"low\" HDI scores like India, Nigeria and Pakistan.<p><div class=\"share_submission\" style=\"position:relative",
        "id": 2980621,
        "language": null,
        "link": "https://slashdot.org/story/25/06/20/1646251/trust-in-ai-strongest-in-china-low-income-nations-un-study-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trust in AI Strongest in China, Low-Income Nations, UN Study Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T16:28:32.658780+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T16:01:00+00:00",
        "description": "BrianFagioli writes: In a move that could quietly wreak havoc across the Windows ecosystem, Microsoft is purging outdated drivers from Windows Update. The company claims it is doing this for security and reliability, but the result might be broken hardware for users who rely on legacy devices. \n\nIf you're using older peripherals or custom-built PCs, you could soon find yourself hunting for drivers that have vanished into the digital abyss. This initiative, buried in a low-profile blog post, is part of Microsoft's new cleanup program. The first wave targets legacy drivers that already have newer replacements available. But the real kicker is that Microsoft isn't warning individual users about which drivers are going away.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Is+Deleting+Old+Drivers+From+Windows+Update%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F20%2F1539228%2F%3Futm_source%3Dtwitter%26u",
        "id": 2980072,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/20/1539228/microsoft-is-deleting-old-drivers-from-windows-update?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Is Deleting Old Drivers From Windows Update",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T15:25:03.277620+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T15:20:00+00:00",
        "description": "Semicolon usage in British literature has declined from once every 205 words in 2000 to once every 390 words today, representing a nearly 50% drop, according to analysis commissioned by language learning company Babbel. The punctuation mark appeared once every 90 words in British literature from 1781, making the current frequency the lowest on record. \n\nA survey of young learners in the London Student Network found that more than half of respondents could not correctly use semicolons, with only 11% describing themselves as frequent users. The average score on a semicolon knowledge quiz was 49%.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Semicolon+Usage+in+British+Literature+Drops+Nearly+50%25+Since+2000%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F06%2F20%2F159208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://w",
        "id": 2979444,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/20/159208/semicolon-usage-in-british-literature-drops-nearly-50-since-2000?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Semicolon Usage in British Literature Drops Nearly 50% Since 2000",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T15:25:03.454908+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T14:40:00+00:00",
        "description": "A senior Broadcom executive has defended VMware's controversial licensing changes by arguing that customers complaining about costs simply weren't using the software bundles properly. VMware shifted away from selling perpetual licenses for individual products to subscription bundles after Broadcom's acquisition. Some smaller and mid-sized customers claim their costs increased eight to 15 times under the new pricing structure, prompting migration plans to alternative platforms. \n\nJoe Baguley, Broadcom's chief technology officer for EMEA, countered that 87% of VMware's top 10,000 customers have signed up for VMware Cloud Foundation, and that cost complaints \"don't play out\" when Broadcom sits down with customers directly.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Broadcom's+Answer+To+VMware+Pricing+Outrage%3A+You're+Using+It+Wrong%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F06%2F20%2F1331257%2F%3Futm_source%3",
        "id": 2979445,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/20/1331257/broadcoms-answer-to-vmware-pricing-outrage-youre-using-it-wrong?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Broadcom's Answer To VMware Pricing Outrage: You're Using It Wrong",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T14:18:31.012767+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T14:00:00+00:00",
        "description": "Lawmakers in Britain have narrowly approved a bill to legalize assisted dying for terminally ill people, capping a fraught debate in Parliament and across the country that cut across political, religious and legal divides. From a report: MPs passed the bill by 314 votes to 291, in their final say on the question. The bill -- which has split lawmakers and sparked impassioned conversations with their constituents the breadth of Britain -- will now move to the House of Lords for its final rounds of scrutiny. \n\nFriday's vote puts Britain firmly on track to join a small club of nations that have legalized the process, and one of the largest by population to allow it. It allows people with a terminal condition and less than six months to live to take a substance to end their lives, as long as they are capable of making the decision themselves. Two doctors and a panel would need to sign off on the choice. Canada, New Zealand, Spain and most of Australia allow assisted dying in some form, as ",
        "id": 2978959,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/20/1354239/lawmakers-in-britain-narrowly-approve-bill-to-legalize-assisted-dying?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Lawmakers in Britain Narrowly Approve Bill To Legalize Assisted Dying",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T13:13:27.593837+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T13:00:00+00:00",
        "description": "Turning recently closed coalmines into solar energy plants could add almost 300GW of renewable energy by 2030, converting derelict wastelands to productive use, according to a new report. From a report: In a first of its kind analysis, researchers from Global Energy Monitor (GEM) identified 312 surface coalmines closed since 2020 around the world, and 134 likely to close by the end of the decade, together covering 5,820 sq km (2,250 sq miles) -- a land area nearly the size of Palestine. \n\nStrip mining turns terrains into wastelands, polluted and denuded of topsoil. But if they were filled with solar panels and developed into energy plants, the report claims, they could generate enough energy to power as big and power hungry a nation as Germany.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Turning+Coalmines+Into+Solar+Energy+Plants+'Could+Add+300GW+of+Renewables+By+2030'%3A+https%3A%2F%2Fhardware.slashdot.org%2Fsto",
        "id": 2978366,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/20/0129241/turning-coalmines-into-solar-energy-plants-could-add-300gw-of-renewables-by-2030?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Turning Coalmines Into Solar Energy Plants 'Could Add 300GW of Renewables By 2030'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T11:03:29.239919+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T10:00:00+00:00",
        "description": "The DOJ has filed a civil complaint to seize $225.3 million in cryptocurrency linked to pig butchering scams -- long-con frauds where victims are tricked into fake crypto investments. The funds were laundered through a blockchain network, and the DOJ says recovered money will go toward reimbursing victims. The Verge reports: The 75-page complaint (PDF) filed in the US District Court for the District of Columbia lays out more detail about the seizure. According to it, the US Secret Service (USSS) and Federal Bureau of Investigation (FBI) tied scammers to seven groups of Tether stablecoin tokens. The fraud fell under what's typically known as \"pig butchering\": a form of long-running confidence scam aimed at tricking victims -- sometimes with a fake romantic relationship -- into what they believe is a profitable crypto investment opportunity, then disappearing with the funds. Pig butchering rings often traffic the workers who directly communicate with victims to Southeast Asian countries",
        "id": 2977467,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/19/2312257/doj-files-to-seize-225-million-in-crypto-from-scammers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DOJ Files To Seize $225 Million In Crypto From Scammers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T07:48:26.866861+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T07:00:00+00:00",
        "description": "alternative_right shares a report from ScienceAlert: The colossal black hole lurking at the center of the Milky Way galaxy is spinning almost as fast as its maximum rotation rate. That's just one thing astrophysicists have discovered after developing and applying a new method to tease apart the secrets still hidden in supermassive black hole observations collected by the Event Horizon Telescope (EHT). The unprecedented global collaboration spent years working to give us the first direct images of the shadows of black holes, first with M87* in a galaxy 55 million light-years away, then with Sgr A*, the supermassive black hole at the heart of our own galaxy. [...]\n \nTheir results show, among other things, that Sgr A* is not only spinning at close to its maximum speed, but that its rotational axis is pointed in Earth's direction, and that the glow around it is generated by hot electrons. Perhaps the most interesting thing is that the magnetic field in the material around Sgr A* doesn't a",
        "id": 2976370,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/19/236226/our-galaxys-monster-black-hole-is-spinning-almost-as-fast-as-physics-allows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Our Galaxy's Monster Black Hole Is Spinning Almost As Fast As Physics Allows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T04:34:54.229141+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the BBC: The Earth could be doomed to breach the symbolic 1.5C warming limit in as little as three years at current levels of carbon dioxide emissions. That's the stark warning from more than 60 of the world's leading climate scientists in the most up-to-date assessment of the state of global warming. [...] At the beginning of 2020, scientists estimated that humanity could only emit 500 billion more tonnes of carbon dioxide (CO2) -- the most important planet-warming gas -- for a 50% chance of keeping warming to 1.5C. But by the start of 2025 this so-called \"carbon budget\" had shrunk to 130 billion tonnes, according to the new study.\n \nThat reduction is largely due to continued record emissions of CO2 and other planet-warming greenhouse gases like methane, but also improvements in the scientific estimates. If global CO2 emissions stay at their current highs of about 40 billion tonnes a year, 130 billion tonnes gives the world roughly three years",
        "id": 2975654,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/19/2122207/three-years-left-to-limit-warming-to-15c-leading-scientists-warn?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Three Years Left To Limit Warming To 1.5C, Leading Scientists Warn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T03:28:28.584452+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T02:30:00+00:00",
        "description": "Australia's world-first social media ban for under-16s moved closer to implementation after a key trial found that checking a user's age is technologically possible and can be integrated into existing services. From a report: The conclusions are a blow to Facebook-owner Meta Platforms, TikTok and Snap, which opposed the controversial legislation. Some platform operators had questioned whether a user's age could be reliably established using current technology. \n\nThe results of the government-backed trial clear the way for the law to come into force by the end of the year. The findings also potentially allow other jurisdictions to follow Australia's lead as countries around the world grapple with ways to protect children from harmful content online. \"Age assurance can be done in Australia and can be private, robust and effective,\" the government-commissioned Age Assurance Technology Trial said in a statement Friday announcing its preliminary findings.<p><div class=\"share_submission\" st",
        "id": 2975404,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/20/0221229/social-media-ban-moves-closer-in-australia-after-tech-trial?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Social Media Ban Moves Closer in Australia After Tech Trial",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T01:18:27.802999+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T01:10:00+00:00",
        "description": "alternative_right shares a report from ScienceAlert: A team of biologists from Northeastern University and the University of Kentucky has found one of the key molecules involved in axolotl regeneration. It's a crucial component in ensuring the body grows back the right parts in the right spot: for instance, growing a hand, from the wrist. \"The cells can interpret this cue to say, 'I'm at the elbow, and then I'm going to grow back the hand' or 'I'm at the shoulder... so I'm going to then enable those cells to grow back the entire limb',\" biologist James Monaghan explains.\n \nThat molecule, retinoic acid, is arranged through the axolotl body in a gradient, signaling to regenerative cells how far down the limb has been severed. Closer to the shoulder, axolotls have higher levels of retinoic acid, and lower levels of the enzyme that breaks it down. This ratio changes the further the limb extends from the body. The team found this balance between retinoic acid and the enzyme that breaks it ",
        "id": 2974989,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/19/2130210/axolotl-discovery-brings-us-closer-than-ever-to-regrowing-human-limbs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Axolotl Discovery Brings Us Closer Than Ever To Regrowing Human Limbs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-20T01:18:27.976989+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-20T00:30:00+00:00",
        "description": "Longtime Slashdot reader fahrbot-bot shares a report from the Cool Down: A team of chemical engineers at the Massachusetts Institute of Technology has invented a new process to separate crude oil components, potentially bringing forward a replacement that can cut its harmful carbon pollution by 90%. The original technique, which uses heat to separate crude oil into gasoline, diesel, and heating oil, accounts for roughly 1% of all global energy consumption and 6% of dirty energy pollution from the carbon dioxide it releases.\n \n\"Instead of boiling mixtures to purify them, why not separate components based on shape and size?\" said Zachary P. Smith, associate professor of chemical engineering at MIT and senior author of the study, as previously reported in Interesting Engineering. The team invented a polymer membrane that divides crude oil into its various uses like a sieve. The new process follows a similar strategy used by the water industry for desalination, which uses reverse osmosis ",
        "id": 2974990,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/19/2256256/mit-chemical-engineers-develop-new-way-to-separate-crude-oil?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "MIT Chemical Engineers Develop New Way To Separate Crude Oil",
        "vote": 0
    }
]