[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T18:17:31.912526+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T17:30:08+00:00",
        "description": "Alien: Rogue Incursion might be appealing to those of you who like hunting Xenomorphs or being hunted by them. On that front, the game delivers in spades, weaving that central concept into its story and gameplay loop with aplomb. With excellent visuals and audio to back it up, you might be forgiven for thinking that this one's a hit.\n\nHowever, a repetitive gameplay loop and a distinct lack of variety in terms of usable weapons and enemy types holds it back from joining this year's greatest horror titles. \n\nSurvios could have, and perhaps should have, chosen to present its two-part story as a single title and perhaps brought more to the table than it currently has. Nevertheless, any game that you enjoy playing deserves credit in our book, and Rogue Incursion manages to achieve that goal quite satisfactorily.",
        "id": 3692329,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=OEMkulwFjEw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OEMkulwFjEw/hqdefault.jpg",
        "title": "Alien: Rogue Incursion - Part One: Evolved Edition Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T15:34:43.661046+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T15:30:01+00:00",
        "description": "When you think about Rockstar Games, two titles come to mind. First and foremost, Grand Theft Auto, because one of the most anticipated games of all time – Grand Theft Auto 6 – arrives next May with an unreal amount of hype. Then there's Red Dead Redemption, or rather the sequel, which launched in 2018 and remains one of the best games ever made. So much so that many of us are left pondering when it's getting a current-gen upgrade. We're probably already halfway through this generation, Rockstar. Surely it won't be coming in the next? But I digress.\n\nIt's easy to forget that it's worked on several different IPs through the decades, spread across its multiple studios, and one of those is Bully. Released in 2006 for the PS2 before launching on the Nintendo Wii, Xbox 360 and PC about two years later, its most notable update was a mobile release in December 2016. With regards to IPs kept on ice, it might as well be in cryo sleep alongside Midnight Club, Manhunt and L.A. Noire.",
        "id": 3691020,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=a_t010yxCPg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/a_t010yxCPg/hqdefault.jpg",
        "title": "The REAL Reason BULLY 2 Never Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T14:14:52.524327+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T13:30:15+00:00",
        "description": "While PC gaming can be quite an expensive hobby to get into at first, your initial investment is quite often rewarded thanks to games not only being considerably cheaper a lot of times thanks to deep discounts and massive sales, but also thanks to the fact that you now have access to almost every game ever made since the advent to gaming. Thanks to this, the PC often ends up feeling like the best platform for gaming.\n\nWith that in mind, it can be difficult for some players new to PC gaming to know where to start. So we decided to look across just about everything the platform has had to offer over the last couple of decades, and came up with some of the best single-player games that you can get, ranging from  RPGs to open-world zombie shooters, and even some cerebral games where you get to talk to your own mind.",
        "id": 3690397,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=HnQHAy7CvaY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HnQHAy7CvaY/hqdefault.jpg",
        "title": "60 Amazing Single Player Games On PC You Need To Try Out [2025 Edition]",
        "vote": 0
    }
]