[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T00:00:21.474665+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T23:40:00+00:00",
        "description": "The FCC mistakenly published a 163-page PDF containing detailed schematics for Apple's upcoming iPhone 16e, despite Apple explicitly requesting indefinite confidentiality to protect trade secrets. AppleInsider reports: A cover letter is also distributed alongside the schematics, addressed to the FCC and dated September 16, 2024. The letter from Apple is a request for the confidential treatment of documents that are filed with the FCC. [...] The letter from Apple requests a series of documents are withheld from public viewing \"indefinitely.\" The justification is that they contain \"confidential and proprietary trade secrets\" that are not disclosed to the public post-release, due to giving competitors an \"unfair advantage.\"\n \nThe list of documents, Apple states, includes: Block Diagrams, Electrical Schematic Diagrams, Technical Descriptions, Product Specifications, Antenna Locations, Tune-Up Procedure, and Software Security Description. Other documents, such as external and internal phot",
        "id": 3694194,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/29/215235/fcc-mistakenly-leaks-confidential-iphone-16e-schematics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FCC Mistakenly Leaks Confidential iPhone 16e Schematics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T00:00:21.557083+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T23:00:00+00:00",
        "description": "The Taliban have imposed a nationwide telecommunications shutdown in Afghanistan, severing fibre-optic connections and cutting off internet, mobile, and satellite services as part of \"morality\" measures. Netblock is currently tracking the outages. The BBC reports: Since seizing power in 2021, the Taliban have imposed numerous restrictions in accordance with their interpretation of Islamic Sharia law. Flights from Kabul airport have also been disrupted, according to reports. Several people in Kabul have told the BBC that their fibre-optic internet stopped working towards the end of the working day, around17:00 local time (12:30 GMT). Because of this, it is understood many people will not notice the impact until Tuesday morning, when banking services and other businesses are due to resume. [...]\n \nThe Taliban earlier said an alternative route for internet access would be created, without giving any details. Business leaders at the time warned that if the internet ban continued their act",
        "id": 3694195,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/09/29/2059245/afghanistan-hit-by-nationwide-internet-blackout-as-taliban-cuts-fiber-optic-cables?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Afghanistan Hit By Nationwide Internet Blackout As Taliban Cuts Fiber Optic Cables",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T22:20:30.035747+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T22:20:00+00:00",
        "description": "An anonymous reader quotes a report from Politico: California Gov. Gavin Newsom signed a first-in-the-nation law on Monday that will force major AI companies to reveal their safety protocols -- marking the end of a lobbying battle with big tech companies like ChatGPT maker OpenAI and Meta and setting the groundwork for a potential national standard.\n \nThe proposal was the second attempt by the author, ambitious San Francisco Democrat state Sen. Scott Wiener, to pass such legislation after Newsom vetoed a broader measure last year that set off an international debate. It is already being watched in Congress and other states as an example to follow as lawmakers seek to rein in an emerging technology that has been embraced by the Trump administration in the race against China, but which has also prompted concerns for its potential to create harms.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Gavin+Newsom+Signs+First-",
        "id": 3693786,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/29/2054225/gavin-newsom-signs-first-in-nation-ai-safety-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gavin Newsom Signs First-In-Nation AI Safety Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T22:20:30.167589+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T21:41:00+00:00",
        "description": "F-Droid has warned that Google's upcoming developer verification program will kill the free and open source app repository. Google announced plans several weeks ago to force all Android app developers to register their apps and identity with the company. Apps not validated by Google will not be installable on certified Android devices. \n\nF-Droid says it cannot require developers to register with Google or take over app identifiers to register for them. The site operators say doing so would effectively take over distribution rights from app authors. Google plans to begin testing the verification scheme in the coming weeks and may charge registration fees. Unverified apps will start being blocked next year in Brazil, Indonesia, Singapore, and Thailand before expanding globally in 2027. F-Droid is calling on US and EU regulators to intervene.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Open+Source+Android+Repository",
        "id": 3693787,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/29/2015257/open-source-android-repository-f-droid-says-googles-new-rules-will-shut-it-down?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Open Source Android Repository F-Droid Says Google's New Rules Will Shut It Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T22:20:30.323691+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T21:00:00+00:00",
        "description": "An anonymous reader shares a report: OpenAI is planning to release a new version of its Sora video generator that creates videos featuring copyrighted material unless copyright holders opt out of having their work appear, according to people familiar with the matter. OpenAI began alerting talent agencies and studios about the forthcoming product and its opt-out process over the last week and plans to release the new version in the coming days, the people said. \n\nThe new opt-out process means that movie studios and other intellectual property owners would have to explicitly ask OpenAI not to include their copyrighted material in videos Sora creates. While copyrighted characters will require an opt-out, the new product won't generate images of recognizable public figures without their permission, people familiar with OpenAI's thinking said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI's+New+Sora+Video+Generat",
        "id": 3693788,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/29/1959236/openais-new-sora-video-generator-to-require-copyright-holders-to-opt-out?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's New Sora Video Generator To Require Copyright Holders To Opt Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T20:30:05.518211+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T20:20:00+00:00",
        "description": "The UK government will underwrite a $2 billion loan guarantee to Jaguar Land Rover in a bid to support its suppliers as a cyber-attack continues to halt production at the car maker. BBC: Business Secretary Peter Kyle said the loan, from a commercial bank, would protect jobs in the West Midlands, Merseyside and across the UK. The manufacturer has been forced to suspend production for weeks after being targeted by hackers at the end of August. There have been growing concerns some suppliers, mostly small businesses, could go bust due to the prolonged shutdown. \n\nAbout 30,000 people are directly employed at the company's UK plants with about 100,000 working for firms in the supply chain. Some of these firms supply parts exclusively to JLR, while others sell components to other carmakers as well. It is believed to be the first time that a company has received government help as a result of a cyber-attack.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href",
        "id": 3693089,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/29/1945254/uk-government-to-guarantee-2-billion-jaguar-land-rover-loan-after-cyber-shutdown?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Government To Guarantee $2 Billion Jaguar Land Rover Loan After Cyber Shutdown",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T20:30:05.626527+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T19:40:00+00:00",
        "description": "An anonymous reader shares a report: In a preprint titled \"Can LIGO Detect Daylight Savings Time?,\" Reed Essick, former LIGO member and now a physicist at the University of Toronto, gives a simple answer to the paper's title: \"Yes, it can.\" The paper, which has yet to be peer-reviewed, was recently uploaded to arXiv. That might seem like an odd connection. It's true that observational astronomy must contend with noise from light pollution, satellites, and communication signals. But these are tangible sources of noise that scientists can sink their teeth into, whereas daylight savings time is considerably more nebulous and abstract as a potential problem. \n\nTo be clear, and as the paper points out, daylight savings time does not influence actual signals from merging black holes billions of light-years away -- which, as far as we know, don't operate on daylight savings time. The \"detection\" here refers to the \"non-trivial\" changes in human activity having to do with the researchers invo",
        "id": 3693090,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/29/1934243/daylight-savings-time-is-so-bad-its-messing-with-our-view-of-the-cosmos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Daylight Savings Time Is So Bad, It's Messing With Our View of the Cosmos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T20:30:05.808526+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T19:01:00+00:00",
        "description": "The European way of life is being jeopardized by environmental degradation, a report has found, with EU officials warning against weakening green rules. The Guardian: The continent has made \"important progress\" in cutting planet-heating pollution, according to the European Environment Agency, but the death of wildlife and breakdown of the climate are ruining ecosystems that underpin the economy. The seventh edition of the report, which has been published every five years since 1995, found: \n\n1. More than 80% of protected habitats are in a poor or bad state, with \"unsustainable\" consumption and production patterns driving loss of wildlife.\n2. The EU's \"carbon sink\" has declined by about 30% in a decade as logging, wildfires and pests damage forests.\n3. Emissions from transport and food have barely budged since 2005, despite progress in other sectors.\n4. Member states have failed to adapt to extreme weather as fast as risk levels have risen.\n5. Water stress already affects one in three ",
        "id": 3693091,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/29/191252/environmental-damage-is-putting-european-way-of-life-at-risk-says-report?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Environmental Damage is Putting European Way of Life at Risk, Says Report",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T18:38:12.219054+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T18:18:00+00:00",
        "description": "A review of 62 scientific studies published in Osteoporosis International found that microplastics weaken bones by disrupting bone marrow stem cells and stimulating osteoclasts, cells that degrade bone tissue. Laboratory experiments found the particles reduce cell viability, induce premature cellular aging, modify gene expression, and trigger inflammatory responses. Animal studies found microplastic accumulation decreases white blood cell counts and deteriorates bone microstructure, creating irregular cell structures that increase fracture risk. Rodrigo Bueno de Oliveira from the State University of Campinas in Brazil said the effects interrupted skeletal growth in test animals.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microplastics+Could+Be+Weakening+Your+Bones%2C+Research+Suggests%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F09%2F29%2F1818259%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src",
        "id": 3692468,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/29/1818259/microplastics-could-be-weakening-your-bones-research-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microplastics Could Be Weakening Your Bones, Research Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T18:38:12.287835+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T17:33:00+00:00",
        "description": "Anthropic's Claude Sonnet 4.5 ran autonomously for 30 hours to build a chat application similar to Slack or Teams, generating approximately 11,000 lines of code before stopping upon task completion. The model, announced today, marks a significant leap from the company's Opus 4 model, which ran for seven hours in May. \n\nClaude Sonnet 4.5 performs three times better at browser navigation and computer use than Anthropic's October technology. Beta-tester Canva deployed the model for complex engineering tasks in its codebase and product features. Anthropic paired the release with virtual machines, memory, context management, and multi-agent support tools, enabling developers to build their own AI agents using the same building blocks that power Claude Code.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+Claude+Model+Runs+30-Hour+Marathon+To+Create+11%2C000-Line+Slack+Clone%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fs",
        "id": 3692469,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/29/1733238/new-claude-model-runs-30-hour-marathon-to-create-11000-line-slack-clone?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Claude Model Runs 30-Hour Marathon To Create 11,000-Line Slack Clone",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T17:16:50.375213+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T16:40:00+00:00",
        "description": "An anonymous reader writes: Landlords are using a service that logs into a potential renter's employer systems and scrapes their paystubs and other information en masse, potentially in violation of U.S. hacking laws, according to screenshots of the tool shared with 404 Media. \n\nThe screenshots highlight the intrusive methods some landlords use when screening potential tenants, taking information they may not need, or legally be entitled to, to assess a renter. \n\n\"This is a statewide consumer-finance abuse that forces renters to surrender payroll and bank logins or face homelessness,\" one renter who was forced to use the tool and who saw it taking more data than was necessary for their apartment application told 404 Media. 404 Media granted the person anonymity to protect them from retaliation from their landlord or the services used. [...]\n\n\"Argyle hijacked my live Workday session, stayed hidden from view, and downloaded every pay stub plus all W-4s back to 2024, each PDF seconds apar",
        "id": 3691871,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/29/1634200/landlords-are-demanding-tenants-workplace-login-details-to-verify-their-income?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Landlords Are Demanding Tenants' Workplace Login Details To Verify Their Income",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T17:16:50.496700+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T16:10:00+00:00",
        "description": "An anonymous reader shares a report: You've probably heard of vibe coding -- novices writing apps by creating a simple AI prompt -- but now Microsoft wants to introduce a similar thing for its Office apps. The software maker is launching a new Agent Mode in Excel and Word that can generate complex spreadsheets and documents with just a prompt. A new Office Agent in Copilot chat, powered by Anthropic models, is also launching today that can create PowerPoint presentations and Word documents from a \"vibe working\" chatbot. \n\n[...] Agent Mode essentially takes a complex task and breaks it down with planning and reasoning that you can follow. It then uses OpenAI's GPT-5 model to break down each step of document creation into an agentic task and execute it. It's like watching an automated macro in real time, showing everything it's doing in the sidebar.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Launches+'Vi",
        "id": 3691872,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/29/1610226/microsoft-launches-vibe-working-in-excel-and-word?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Launches 'Vibe Working' in Excel and Word",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T15:54:28.828097+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T15:21:00+00:00",
        "description": "The world's highest bridge opened in China on Sunday, taking the crown from another bridge in the same province. From a report: The Huajiang Grand Canyon Bridge soars about 2,050 feet above a river and gorge in the southern Chinese province of Guizhou. It is more than twice as high as the Royal Gorge Bridge, which is suspended 956 feet above the Arkansas River in Colorado and is the highest in the United States. \n\nAccording to Chinese state media, the new Guizhou bridge also sets a record as the world's longest bridge in a mountainous region, spanning 4,600 feet across. Hailed as China's latest \"infrastructure miracle,\" the bridge is designed to spur tourism and economic growth in one of the country's least developed regions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Opens+World's+Highest+Bridge%2C+Breaking+Its+Own+Record%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F29%2F1459255%2F%3Futm_source%3Dtwi",
        "id": 3691154,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/29/1459255/china-opens-worlds-highest-bridge-breaking-its-own-record?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Opens World's Highest Bridge, Breaking Its Own Record",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T15:54:28.945464+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T14:40:00+00:00",
        "description": "What's the proper punishment for an illegal U-turn? If you're a human being in California, it's a fine of up to $234. If you're a robot, apparently, it's nothing at all. The San Francisco Standard: This injustice became apparent to many Facebook users Saturday night after a viral post from the San Bruno Police Department showed footage of officers pulling over a Waymo for the scofflaw maneuver only to discover that no one was behind the wheel. \n\nThe car stopped automatically when it saw the police lights during a Friday evening DUI checkpoint, but instead of a person IRL, officers say they were connected with a Waymo rep over the phone. After a brief exchange, the Waymo was sent on its way. Under current law, officials explained, they couldn't issue a ticket. \"Our citation books don't have a box for 'robot,'\" they joked on Facebook. \"Hopefully the reprogramming will keep it from making any more illegal moves.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slash",
        "id": 3691155,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/29/1329246/no-driver-no-hands-no-clue-waymo-pulled-over-for-illegal-u-turn?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'No Driver, No Hands, No Clue': Waymo Pulled Over For Illegal U-turn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T14:33:05.925650+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T14:00:00+00:00",
        "description": "BrianFagioli writes: Electronic Arts has agreed to a $55 billion buyout by Saudi Arabia's Public Investment Fund (PIF), private equity firm Silver Lake, and Jared Kushner's Affinity Partners, marking the largest all-cash sponsor take-private deal ever. Shareholders will receive $210 per share, a 25 percent premium over EA's unaffected price, and once the transaction closes the company will be delisted from public markets. EA CEO Andrew Wilson will remain in charge, with the group arguing that private ownership will allow the publisher to innovate faster and expand its global footprint. \n\nThe deal, however, is already sparking controversy. PIF, a sovereign wealth fund controlled by the Saudi government, will effectively gain control of one of the most influential names in gaming. While investors stand to profit, many gamers and industry watchers are concerned about how Saudi ownership could shape EA's creative direction, monetization strategies, and role in esports. With regulatory app",
        "id": 3690560,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/09/29/134259/saudi-takeover-of-ea-in-55-billion-deal-raises-serious-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Saudi Takeover of EA in $55 Billion Deal Raises Serious Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T13:06:57.347633+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T11:34:00+00:00",
        "description": "\"Computer science went from a future-proof career to an industry in upheaval in a shockingly small amount of time,\" writes Business Insider, citing remarks from UC Berkeley professor Hany Farid said during a recent episode of Nova's \"Particles of Thought\" podcast. \n\"Our students typically had five internship offers throughout their first four years of college,\" Farid said. \"They would graduate with exceedingly high salaries, multiple offers. They had the run of the place. That is not happening today. They're happy to get one job offer....\"\n\nIt's too easy to just blame AI, though, Farid said. \"Something is happening in the industry,\" he said. \"I think it's a confluence of many things. I think AI is part of it. I think there's a thinning of the ranks that's happening, that's part of it, but something is brewing...\" \n\nFarid, one of the world's experts on deepfake videos, said he is often asked for advice. He said what he tells students has changed... \"Now, I think I'm telling people to b",
        "id": 3689639,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/29/029201/professor-warns-cs-graduates-are-struggling-to-find-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Professor Warns CS Graduates are Struggling to Find Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T09:14:15.787149+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T07:44:00+00:00",
        "description": "An anonymous reader shared this report from the blog Linuxiac:\n\n\nIn a somewhat unexpected move, Cloudflare has announced its sponsorship of the Ladybird browser, an independent (still-in-development) open-source initiative aimed at developing a modern, standalone web browser engine. \nIt's a project launched by GitHub's co-founder and former CEO, Chris Wanstrath, and tech visionary Andreas Kling. It's written in C++, and designed to be fast, standards-compliant, and free of external dependencies. Its main selling point? Unlike most alternative browsers today, Ladybird doesn't sit on top of Chromium or WebKit. Instead, it's building a completely new rendering engine from scratch, which is a rare thing in today's web landscape. For reference, the vast majority of web traffic currently runs through engines developed by either Google (Blink/Chromium), Apple (WebKit), or Mozilla (Gecko). \n\nThe sponsorship means the Ladybird team will have more resources to accelerate development. This inclu",
        "id": 3688505,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/29/0446226/ladybird-browser-gains-cloudflare-support-to-challenge-the-status-quo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ladybird Browser Gains Cloudflare Support to Challenge the Status Quo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T05:05:27.181707+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T04:59:00+00:00",
        "description": "An anonymous reader shared this report from Ars Technica:\n\nLate last week, The Hollywood Reporter ran a story about an \"AI Stan Lee hologram\" that would be appearing at the LA Comic Con this weekend. [Watch it in action here.] Nearly seven years after the famous Marvel Comics creator's death at the age of 95, fans will be able to pay $15 to $20 this weekend to chat with a life-sized, AI-powered avatar of Lee in an enclosed booth at the show. The instant response from many fans and media outlets to the idea was not kind, to say the least. A writer for TheGamer called the very idea \"demonic\" and said we need to \"kill it with fire before it's too late....\" \n\n\nBut Chris DeMoulin, the CEO of the parent company behind LA Comic Con, urged critics to come see the AI-powered hologram for themselves before rushing to judgment. \"We're not afraid of people seeing it and we're not afraid of criticism,\" he told Ars. \"I'm just a fan of informed criticism, and I think most of what's been out there so",
        "id": 3687465,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/09/29/041251/ai-powered-stan-lee-hologram-debuts-at-la-comic-con?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI-Powered Stan Lee Hologram Debuts at LA Comic Con",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T03:46:38.517968+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T03:05:00+00:00",
        "description": "\"As awareness grows around the dangers of head trauma in sports, a small number of professional fighters and football players are turning to a psychedelic called ibogaine for treatment,\" reports the Los Angeles Times. \n\nThey note that the drug's proponents \"tout its ability to treat addiction, post-traumatic stress disorder and traumatic brain injury, or TBI. \"\n\nIbogaine, which is derived from a West African shrub, is a Schedule 1 drug in America with no legal medical uses, and experts urge caution because of the need for further studies. But the results, several athletes say, are \"game-changing\".... Although athletes are just discovering ibogaine, the drug is well known within the veteran community, which experiences high rates of brain injury and PTSD. In Stanford's study on the effects of ibogaine on special forces veterans, participants saw average reductions of 88% in PTSD symptoms, 87% in depression symptoms and 81% in anxiety symptoms. They also exhibited improvements in concen",
        "id": 3687198,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/29/033214/some-athletes-are-trying-the-psychedelic-ibogaine-to-treat-brain-injuries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some Athletes are Trying the Psychedelic Ibogaine to Treat Brain Injuries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-29T02:32:18.955639+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-29T01:32:00+00:00",
        "description": "The editors of the culture magazine n + 1 decry the \"well-funded upheaval\" caused by a large and powerful coalition of pro-AI forces. (\"According to the logic of market share as social transformation, if you move fast and break enough things, nothing can contain you...\") \n\"An extraordinary amount of money is spent by the AI industry to ensure that acquiescence is the only plausible response. But marketing is not destiny.\"\n\nThe AI bubble&#226;S &mdash; &#226;Sand it is a bubble, as even OpenAI overlord Sam Altman has admitted&#226;S &mdash; &#226;Swill burst. The technology's dizzying pace of improvement, already slowing with the release of GPT-5, will stall... [P]rofessional readers and writers: We retain some power over the terms and norms of our own intellectual life. We ought to stop acting like impotence in some realms means impotence everywhere. Major terrains remain AI-proofable. For publishers, editors, critics, professors, teachers, anyone with any say over what people read, t",
        "id": 3686974,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/29/0129218/culture-magazine-urges-professional-writers-to-resist-ai-boycott-and-stigmatize-ai-slop?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Culture Magazine Urges Professional Writers to Resist AI, Boycott and Stigmatize AI Slop",
        "vote": 0
    }
]