[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-22T17:30:16+00:00",
        "description": "The classic 90’s Amiga shoot ‘em up returns in a newly enhanced remaster for Steam, Switch, PS5, and Xbox Series X/S. The novel underwater theme stood out at the time and still delights to this day thanks to fun levels and a wealth of customization. \n\nThe shop is even better in this remaster, with explanations of each weapon and a new preconfigured loadout option. Besides some cheats and a new mirror mode, X-Out: Resurfaced doesn’t add features common to many modern remakes. \n\nThere’s no online co-op and the omission of new game+ is felt. Still, this is a solid shoot ‘em up that will challenge and entertain fans of the genre, but $20 for 8 levels may turn others away.",
        "id": 2173814,
        "language": null,
        "link": "https://www.youtube.com/watch?v=xrpXnoWO2J8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xrpXnoWO2J8/hqdefault.jpg",
        "title": "X-Out Resurfaced Review - Is This Remake Worth It?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-22T15:30:09+00:00",
        "description": "There’s a rather distinct thrill in the experience of a well-earned power fantasy, one where you start out like a petty prey that’s ripe for being picked to a fierce predator and the later on, overcome any situation with skill and wit. \n\nThe best survival games thrive on such gameplay loops and the last few years have provided us with plenty of releases that blend these mechanics within the framework of an open world which is almost a perfect match. \n\nThe sheer variety between these experiences has been absolutely phenomenal. With this video, we will be exploring just that with 20 of the best open-world survival games that you need to play if you are even remotely interesting in this genre.",
        "id": 2173084,
        "language": null,
        "link": "https://www.youtube.com/watch?v=JpBm8aAf6-0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JpBm8aAf6-0/hqdefault.jpg",
        "title": "20 BEST Open World Survival Games You Need To Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-22T09:30:18+00:00",
        "description": "It would be unfair to say that Assassin’s Creed is struggling right now, with Assassin’s Creed Valhalla and Mirage both having been undeniably successful games from a commercial standpoint. \n\nAnd yet, both titles also saw reception that was at best muted, and at worst outright divisive. Looking at recent years, it’s not unfair to say that Assassin’s Creed has hit a bit of a lull, even if it isn’t quite down in the dumps the way it was, say, immediately in the aftermath of Unity’s disastrous release. \n\nThat, in fact, is exactly why there’s so much riding on the upcoming Assassin’s Creed Shadows (among other reasons). Will the action RPG be up to the task? Here, we discuss just that.",
        "id": 2171329,
        "language": null,
        "link": "https://www.youtube.com/watch?v=lhgfGE8E2iU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lhgfGE8E2iU/hqdefault.jpg",
        "title": "Assassin’s Creed Shadows DESPERATELY Needs to Deliver",
        "vote": 0
    }
]