[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T23:42:13.173829+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T23:30:00+00:00",
        "description": "Disney's channels, including ESPN, ABC, FX, and NatGeo, have gone dark on YouTube TV after Google and Disney failed to renew their carriage agreement before the October 30 deadline, with each side blaming the other for using unfair negotiating tactics and price hikes. YouTube TV says it will issue a $20 credit to subscribers if the blackout continues while negotiations proceed. Engadget reports: \"Last week Disney used the threat of a blackout on YouTube TV as a negotiating tactic to force deal terms that would raise prices on our customers,\" YouTube said in an announcement on its blog. \"They're now following through on that threat, suspending their content on YouTube TV.\" YouTube added that Disney's decision harms its subscribers while benefiting its own live TV products, such as Hulu+Live TV and Fubo.\n \nIn a statement sent to the Los Angeles Times, however, Disney accused Google's YouTube TV of choosing to deny \"subscribers the content they value most by refusing to pay fair rates fo",
        "id": 3954930,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/31/2017209/youtube-tv-loses-espn-abc-and-other-disney-channels",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube TV Loses ESPN, ABC and Other Disney Channels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T23:42:13.255131+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T22:50:00+00:00",
        "description": "Amazon will begin blocking sideloaded piracy apps on Fire TV devices by cross-checking them against a blacklist maintained by the Alliance for Creativity and Entertainment. The company will, however, continue to allow legitimate sideloading for developers. Heise reports: In response to an inquiry, Amazon explained that it has always worked to ban piracy from its app store. As part of an expanded program led by the ACE, it is now blocking apps that demonstrably provide access to pirated content, including those downloaded outside the app store. This builds on Amazon's ongoing efforts to support creators and protect customers, as piracy can also expose users to malware, viruses, and fraud.\n \n[...] The sideloading option will remain available on Fire TV devices running Amazon's new operating system, Vega OS. However, it is generally limited to developers here. In this context, the company emphasized that, contrary to rumors, there are no plans to upgrade existing Fire TV devices with Fir",
        "id": 3954931,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/31/2012202/amazon-to-block-piracy-apps-on-fire-tv",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon To Block Piracy Apps On Fire TV",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T22:29:59.000723+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from The Record: Denmark's justice minister on Thursday said he will no longer push for an EU law requiring the mandatory scanning of electronic messages, including on end-to-end encrypted platforms. Earlier in its European Council presidency, Denmark had brought back a draft law which would have required the scanning, sparking an intense backlash. Known as Chat Control, the measure was intended to crack down on the trafficking of child sex abuse materials (CSAM). After days of silence, the German government on October 8 announced it would not support the proposal, tanking the Danish effort.\n \nDanish Justice Minister Peter Hummelgaard told reporters on Thursday that his office will support voluntary CSAM detections. \"This will mean that the search warrant will not be part of the EU presidency's new compromise proposal, and that it will continue to be voluntary for the tech giants to search for child sexual abuse material,\" Hummelgaard said, accordin",
        "id": 3954347,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/31/205234/denmark-reportedly-withdraws-chat-control-proposal-following-controversy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark Reportedly Withdraws 'Chat Control' Proposal Following Controversy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T22:29:59.210961+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T21:30:00+00:00",
        "description": "An anonymous reader shares a report: Is installing Windows 11 with a local account or on unsupported hardware harmful or dangerous? YouTube's AI moderation system seems to think so, as it has started pulling videos that show users how to sidestep Microsoft's setup restrictions. \n\nTech YouTuber Rich White, aka CyberCPU Tech, was the first to go public about the issue on October 26, when he posted a video reporting the removal of a how-to he published on installing Windows 11 25H2 with a local account instead of a Microsoft account. In the video, White expressed concern that YouTube's automated flagging process may be the root of the problem, as he found it hard to believe that \"creating a local account in Windows 11 could lead to serious harm or even death,\" as YouTube reportedly alleged when it removed the video. \n\nWhen he appealed, White said that YouTube denied the request within 10 to 20 minutes, early on a Sunday morning, which led him to speculate that there wasn't a human in the",
        "id": 3954348,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/31/1853251/youtubes-ai-moderator-pulls-windows-11-workaround-videos-calls-them-dangerous",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube's AI Moderator Pulls Windows 11 Workaround Videos, Calls Them Dangerous",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T22:29:59.321132+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T20:50:00+00:00",
        "description": "Microsoft is bringing shared audio to Windows 11, allowing you to stream audio across two pairs of wireless headphones, speakers, earbuds, or hearing aids. From a report: The feature is built using the Bluetooth Low Energy (LE) audio codec, and it's rolling out in preview to Windows 11 Insiders in the Dev and Beta channels. Shared audio comes in handy if you're watching a movie on a laptop with your friend or family member, or just want to show them new music that you can both stream inside your own wireless headsets. You can use shared audio by connecting Bluetooth LE-supported devices to your Windows 11 PC and then selecting the Shared audio (preview) button in your quick settings menu. Microsoft introduced an LE Audio feature on Windows 11 in August, enabling higher audio quality while using a wireless headset in a game or call.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+11+Tests+Bluetooth+Audio+Shari",
        "id": 3954349,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/31/1850220/windows-11-tests-bluetooth-audio-sharing-that-connects-two-headsets-at-once",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows 11 Tests Bluetooth Audio Sharing That Connects Two Headsets at Once",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T22:29:59.544321+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T20:05:00+00:00",
        "description": "An anonymous reader shares a report: When Coinbase's quarterly earnings call wrapped up Thursday, its chief executive, Brian Armstrong, didn't finish with profit guidance or statements of confidence. He closed it out with a list: \"Bitcoin, Ethereum, blockchain, staking and Web3.\" Those weren't random buzzwords. They were part of an $84,000 betting market [non-paywalled source]. \n\nAcross prediction market platforms Kalshi and Polymarket, users had wagered on which words would be spoken during the call -- part of a niche category known as mention markets, where the outcome isn't tied to earnings, price moves or sports games, but to what people say in some public forum. With the final analyst question complete, several terms listed in contracts were still unsaid. Armstrong ticked them off one by one. \n\n\"I was a little distracted because I was tracking the prediction market about what Coinbase will say on their next earnings call,\" he said in his parting remarks. \"I just want to add here ",
        "id": 3954350,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/31/1758205/coinbase-ceo-stunt-exposes-prediction-market-vulnerability",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Coinbase CEO Stunt Exposes Prediction Market Vulnerability",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T19:52:03.005302+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T19:21:00+00:00",
        "description": "Snowflake filed an 8-K with the Securities and Exchange Commission earlier this week after its chief revenue officer gave financial projections in a TikTok video. Mike Gannon told an influencer outside the New York Stock Exchange that the data-storage company would exit the year with just over $4.5 billion in revenue and reach $10 billion in a couple of years. \n\nThe filing stated that Gannon is not authorized to disclose financial information on behalf of the company and that investors should not rely on his statements. Snowflake reaffirmed its August guidance of $.395 billion for fiscal year 2026. The video appeared on an account called theschoolofhardknockz and drew more than 555,000 views on TikTok. Gannon told the interviewer he watches the videos all the time.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+TikTok+Interview+Triggered+a+Securities+Filing%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F10%2F31",
        "id": 3953508,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/31/1721243/a-tiktok-interview-triggered-a-securities-filing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A TikTok Interview Triggered a Securities Filing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T19:52:03.144072+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T18:41:00+00:00",
        "description": "Trevor McNally posts videos of himself opening locks. The former Marine has 7 million followers and nearly 10 million people watched him open a Proven Industries trailer hitch lock in April using a shim cut from an aluminum can. The Florida company responded by filing a federal lawsuit in May charging McNally with eight offenses. Judge Mary Scriven denied the preliminary injunction request in June and found the video was fair use. \n\nMcNally's followers then flooded the company with harassment. Proven dismissed the case in July and asked the court to seal the records. The company had initiated litigation over a video that all parties acknowledged was accurate. ArsTechnica adds: Judging from the number of times the lawsuit talks about 1) ridicule and 2) harassment, it seems like the case quickly became a personal one for Proven's owner and employees, who felt either mocked or threatened. That's understandable, but being mocked is not illegal and should never have led to a lawsuit or a c",
        "id": 3953509,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/31/1715249/10m-people-watched-a-youtuber-shim-a-lock-the-lock-company-sued-him-bad-idea",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "10M People Watched a YouTuber Shim a Lock; the Lock Company Sued Him. Bad Idea.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T18:20:05.673662+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T18:01:00+00:00",
        "description": "An anonymous reader shares a report: The rush to secure electricity has intensified as tech companies look to spend trillions of dollars building data centers. There's an industry that consumes even more power than many tech giants, and it has largely escaped the same scrutiny: suppliers of industrial gases. \n\nEveryday items like toothpaste and life-saving treatments like MRIs are among the countless parts of modern life that hinge on access to gases such as nitrogen, oxygen and helium. Producing and transporting these gases to industrial facilities and hospitals is a highly energy-intensive process. Three companies -- Linde, Air Liquide and Air Products and Chemicals -- control 70% of the $120 billion global market for industrial gases. Their initiatives to rein in electricity use or switch to renewables aren't enough to rapidly cut carbon emissions, according to a new report from the campaign group Action Speaks Louder. \n\n\"The scale of the sector's greenhouse gas emissions and elect",
        "id": 3952656,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/31/1646235/the-worlds-secret-electricity-superusers-revealed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The World's Secret Electricity Superusers Revealed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T18:20:05.780589+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T17:20:00+00:00",
        "description": "A top United States regulator plans to unveil a faster approach to approving custom gene-editing treatments, a move designed to unleash a wave of industry investment that will yield cures for patients with rare diseases. From a report: Vinay Prasad, who oversees gene therapies at the Food and Drug Administration, said scientific advances, like Crispr, have forced the agency to relax some of its strict rules. As an example, he cited the case of 10-month-old KJ Muldoon, who this year became the first person in history to have his genes custom edited to cure an inherited disease. \n\n\"Regulation has to evolve as fast as science evolves,\" Prasad said in an interview with Bloomberg News. The agency is \"going to be extremely flexible and work very fast with the scientists who want to bring these therapies to kids who need it.\" Prasad plans to publish a paper in early November outlining the FDA's new approach. He predicted it will spark interest in developing treatments for conditions that may",
        "id": 3952657,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/31/1622222/fda-clears-way-for-faster-personalized-gene-editing-therapy",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FDA Clears Way For Faster Personalized Gene Editing Therapy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T16:58:36.777303+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T16:41:00+00:00",
        "description": "Google Maps is testing a power saving mode in its latest Android beta release that strips the navigation interface to its bare essentials. The feature transforms the screen into a monochrome display and removes nearly all UI elements during navigation, according to AndroidAuthority. \n\nUsers discovered code strings in version 25.44.03.824313610 indicating the mode activates through the phone's physical power button rather than through any in-app menu. The stripped-down interface eliminates standard map labels and appears to omit even the name of the upcoming street where drivers need to turn. The mode supports walking, driving, and two-wheeler directions but currently cannot be used in landscape orientation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Working+on+Bare-Bones+Maps+That+Removes+Almost+All+Interface+Elements+and+Labels%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F10%2F31%2F1527233%2F%3Futm_",
        "id": 3951987,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/31/1527233/google-working-on-bare-bones-maps-that-removes-almost-all-interface-elements-and-labels",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Working on Bare-Bones Maps That Removes Almost All Interface Elements and Labels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T16:58:36.868727+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T16:02:00+00:00",
        "description": "An anonymous reader shares a report: Immigration and Customs Enforcement (ICE) does not let people decline to be scanned by its new facial recognition app, which the agency uses to verify a person's identity and their immigration status, according to an internal Department of Homeland Security (DHS) document obtained by 404 Media. The document also says any face photos taken by the app, called Mobile Fortify, will be stored for 15 years, including those of U.S. citizens. \n\nThe document provides new details about the technology behind Mobile Fortify, how the data it collects is processed and stored, and DHS's rationale for using it. On Wednesday 404 Media reported that both ICE and Customs and Border Protection (CBP) are scanning peoples' faces in the streets to verify citizenship. \n\n\"ICE does not provide the opportunity for individuals to decline or consent to the collection and use of biometric data/photograph collection,\" the document, called a Privacy Threshold Analysis (PTA), says",
        "id": 3951988,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/31/1515258/you-cant-refuse-to-be-scanned-by-ices-facial-recognition-app-dhs-document-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "You Can't Refuse To Be Scanned by ICE's Facial Recognition App, DHS Document Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T16:58:36.963958+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T15:22:00+00:00",
        "description": "ArsTechnica: When graphic design platform-provider Canva bought the Affinity image-editing and publishing apps early last year, we had some major questions about how the companies' priorities and products would mesh. How would Canva serve the users who preferred Affinity's perpetually licensed apps to Adobe's subscription-only software suite? And how would Affinity's strong stance against generative AI be reconciled with Canva's embrace of those technologies. \n\nThis week, Canva gave us definitive answers to all of those questions: a brand-new unified Affinity app that melds the Photo, Designer, and Publisher apps into a single piece of software called \"Affinity by Canva\" that is free to use with a Canva user account, but which gates generative AI features behind Canva's existing paid subscription plans ($120 a year for individuals). \n\nThis does seem like mostly good news, in the near to mid term, for existing Affinity app users who admired Affinity's anti-AI stance: All three apps' co",
        "id": 3951989,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/31/1411210/affinitys-image-editing-apps-go-freemium-in-first-major-post-canva-update",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Affinity's Image-Editing Apps Go 'Freemium' in First Major Post-Canva Update",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T15:07:32.615283+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T14:40:00+00:00",
        "description": "Amazon CEO Andy Jassy says the company's latest big round of layoffs -- about 14,000 corporate jobs -- wasn't triggered by financial strain or AI replacing workers, but rather a push to stay nimble. From a report: Speaking with analysts on Amazon's quarterly earnings call Thursday, Jassy said the decision stemmed from a belief that the company had grown too big and too layered. \"The announcement that we made a few days ago was not really financially driven, and it's not even really AI-driven -- not right now, at least,\" he said. \"Really, it's culture.\" \n\nJassy's comments are his first public explanation of the layoffs, which reportedly could ultimately total as many as 30,000 people -- and would be the largest workforce reduction in Amazon's history. The news this week prompted speculation that the cuts were tied to automation or AI-related restructuring. Earlier this year, Jassy wrote in a memo to employees that he expected Amazon's total corporate workforce to shrink over time due t",
        "id": 3950947,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/31/1358220/amazon-ceo-says-massive-corporate-layoffs-were-about-agility---not-ai-or-cost-cutting",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon CEO Says Massive Corporate Layoffs Were About Agility - Not AI or Cost-Cutting",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T15:07:32.863009+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T14:00:00+00:00",
        "description": "An anonymous reader shares a report: Adobe brought together 10,000 marketers, filmmakers and content creators to its annual conference this week to persuade them that the company's software products are adapting to AI and remain the best tools for their work. But it's Adobe's investors, rather than its users, who are the most skeptical that generative AI technology won't disrupt the company's business as the top seller of software for creative professionals. \n\nDespite a strong strategy, Adobe is \"at risk of structural AI-driven competitive and pricing pressure,\" wrote Tyler Radke, an analyst at Citigroup. The company's shares have lost about a quarter of their value this year as AI tools like Google's video-generating model Veo have gained steam. In an interview with Bloomberg Television earlier this week, Adobe Chief Executive Officer Shantanu Narayen said the company is undervalued as the market is focused on semiconductors and the training of AI models.<p><div class=\"share_submissi",
        "id": 3950948,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/31/1338224/adobe-struggles-to-assure-investors-that-it-can-thrive-in-ai-era",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Adobe Struggles To Assure Investors That It Can Thrive in AI Era",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T15:07:33.073851+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: Australian scientists have developed roof coatings that can passively cool surfaces up to 6C below ambient temperature, as well as extract water from the atmosphere, which they say could reduce indoor temperatures during extreme heat events. One coating made from a porous film, which can be painted on to existing roofs, works by reflecting 96% of incoming solar radiation, rather than absorbing the sun's energy. It also has a high thermal emittance, meaning it effectively dissipates heat to outer space when the sky is clear. Its properties are known as passive radiative cooling. [...]\n \nIn a study, published in the journal Advanced Functional Materials, the researchers tested a prototype for six months on the roof of the Sydney Nanoscience Hub, pairing the cool paint with a UV-resistant topcoat that encouraged dew droplets to roll down into a receptacle. As much as 390 milliliters per sq meter per day could be collected for about a",
        "id": 3950949,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/31/014230/scientists-reveal-roof-coating-that-can-reduce-surface-temperatures-up-to-6c-on-hot-days",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Reveal Roof Coating That Can Reduce Surface Temperatures Up To 6C On Hot Days",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T12:34:57.475040+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T10:00:00+00:00",
        "description": "alternative_right shares a report from Phys.org: It is known in the scientific community that if you have a self-sustained oscillation, such as an arteriole, and you add an external stimulus at a similar but not identical frequency, you can lock the two, meaning you can shift the frequency of the oscillator to that of the external stimulus. In fact, it has been shown that if you connect two clocks, they will eventually synchronize their ticking. Distinguished Professor of Physics and Neurobiology David Kleinfeld found that if he applied an external stimulus to a neuron, the entire vasculature would lock at the same frequency. However, if he stimulated two sets of neurons at two different frequencies, something unexpected happened: some arterioles would lock at one frequency and others would lock at another frequency, forming a staircase effect.\n \nSearching for an explanation, Kleinfeld enlisted the help of his colleague, Professor of Physics Massimo Vergassola, who specializes in unde",
        "id": 3949780,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/31/0037250/how-a-chorus-of-synchronized-frequencies-helps-you-digest-your-food",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How a Chorus of Synchronized Frequencies Helps You Digest Your Food",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T07:34:06.776600+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T07:00:00+00:00",
        "description": "schwit1 shares a report from Behind the Black: SpaceX is going to land this spaceship manned on the Moon, whether or not NASA's SLS and Orion are ready. And even if those expensive, cumbersome, and poorly designed boondoggles are ready for those first two Artemis landings, SpaceX is likely to quickly outmatch them with numerous other private missions to the Moon, outside of NASA. It has the funds to do it, and it knows it has the customers willing to buy the flights. The news comes from a detailed update SpaceX released today on the Starship lunar lander. Here's the section where SpaceX \"made it clear that it sees Starship and Superheavy as its own space effort, irrelevant of NASA\": \"To return Americans to the Moon, SpaceX aligned Starship development along two paths: development of the core Starship system and supporting infrastructure, including production facilities, test facilities, and launch sites -- which SpaceX is self-funding representing over 90% of system costs -- and devel",
        "id": 3948103,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/31/0045236/spacex-starship-will-be-going-to-the-moon-with-or-without-nasa",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SpaceX: Starship Will Be Going To the Moon, With Or Without NASA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T05:16:17.020874+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: Someone recently managed to get on a Microsoft Teams call with representatives from phone hacking company Cellebrite, and then leaked a screenshot of the company's capabilities against many Google Pixel phones, according to a forum post about the leak and 404 Media's review of the material. The leak follows others obtained and verified by 404 Media over the last 18 months. Those leaks impacted both Cellebrite and its competitor Grayshift, now owned by Magnet Forensics. Both companies constantly hunt for techniques to unlock phones law enforcement have physical access to.\n \n\"You can Teams meeting with them. They tell everything. Still cannot extract esim on Pixel. Ask anything,\" a user called rogueFed wrote on the GrapheneOS forum on Wednesday, speaking about what they learned about Cellebrite capabilities. GrapheneOS is a security- and privacy-focused Android-based operating system. rogueFed then posted two screenshots of the Microso",
        "id": 3947530,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/31/0028256/someone-snuck-into-a-cellebrite-microsoft-teams-call-and-leaked-phone-unlocking-details",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Someone Snuck Into a Cellebrite Microsoft Teams Call and Leaked Phone Unlocking Details",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T02:53:54.539193+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T01:25:00+00:00",
        "description": "alternative_right shares a report from Phys.org: Today's cutting-edge theory -- quantum gravity -- suggests that even space and time aren't fundamental. They emerge from something deeper: pure information. This information exists in what physicists call a Platonic realm -- a mathematical foundation more real than the physical universe we experience. It's from this realm that space and time themselves emerge. \"The fundamental laws of physics cannot be contained within space and time, because they generate them. It has long been hoped, however, that a truly fundamental theory of everything could eventually describe all physical phenomena through computations grounded in these laws. Yet we have demonstrated that this is not possible. A complete and consistent description of reality requires something deeper -- a form of understanding known as non-algorithmic understanding.\" \"We have demonstrated that it is impossible to describe all aspects of physical reality using a computational theor",
        "id": 3947106,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/30/2232258/mathematical-proof-debunks-the-idea-that-the-universe-is-a-computer-simulation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mathematical Proof Debunks the Idea That the Universe Is a Computer Simulation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T02:53:54.624337+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T00:45:00+00:00",
        "description": "Google and Magic Leap have extended their partnership for another three years to develop Android XR glasses. They also showed off a new prototype concept that combines Google's Raxium microLED light engine with Magic Leap's AR optics, resulting in a lightweight, stylish pair of glasses that blends real-world vision with multimodal AI. 9to5Google reports: As noted by Android Central, a press release shared by Magic Leap adds some further technical details. This includes mentioning that Google's \"Raxium microLED light engine\" integrates with Magic Leap's tech to bring \"digital content seamlessly into the world.\" As pictured above, the \"display\" portion of the lens is visible at some angles, but it's largely impossible to see.\n \nMagic Leap and Google will show an AI glasses prototype at FII that will serve as a prototype and reference design for the Android XR ecosystem. The demo shows how Magic Leap's technology, integrated with Google's Raxium microLED light engine, brings digital cont",
        "id": 3947107,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/31/0021217/google-shows-off-prototype-android-xr-glasses-from-extended-magic-leap-deal",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Shows Off Prototype Android XR Glasses From Extended Magic Leap Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-31T00:26:58.634175+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-31T00:02:00+00:00",
        "description": "PC Mag's Michael Kan writes: A \"Keep Android Open\" campaign is pushing back on new rules from Google that will reportedly block users from sideloading apps on Android phones. It's unclear who's running the campaign, but a blog post on the free Android app store F-Droid is directing users to visit the campaign's website, which urges the public to lobby government regulators to intervene and stop the upcoming restrictions. \"Developers should have the right to create and distribute software without submitting to unnecessary corporate surveillance,\" reads an open letter posted to the site. [...]\n \nGoogle has described the upcoming change as akin to requiring app developers to go through \"an ID check at the airport.\" However, F-Droid condemned the new requirement as anti-consumer choice. \"If you own a computer, you should have the right to run whatever programs you want on it,\" it says. Additionally, the rules threaten third-party app distribution on F-Droid, which operates as a \"free/open",
        "id": 3946468,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/30/2225257/keep-android-open-campaign-pushes-back-on-googles-sideloading-restrictions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Keep Android Open' Campaign Pushes Back On Google's Sideloading Restrictions",
        "vote": 0
    }
]