[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-28T16:27:46.341350+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-28T15:30:02+00:00",
        "description": "Gears of War: Reloaded's presence on the PlayStation 5 is an excellent showcase of how Sony's gaming powerhouse has become a very attractive option for developers who may not have chosen the platform in the past. \n\nAside from a very solid gameplay experience made even better by the PS5's unique strengths, the fact that this once Xbox-exclusive franchise is now playable on the PS showcases a shift towards a gaming industry in which console-exclusivity has made way for a more player-focused approach to releases new and old. \n\nAside from the potential to create more ambitious projects that bring larger communities of players together, this shift cements the PlayStation as a great option for single-player blockbusters, and a console that, like the Gears franchise, has withstood the test of time.",
        "id": 3441419,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=5_fVmpOOIpk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5_fVmpOOIpk/hqdefault.jpg",
        "title": "Gears of War Reloaded PS5 Proves PlayStation Is Now The True Home of Single Player Blockbusters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-28T14:14:52.446193+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-28T13:30:19+00:00",
        "description": "The time has finally come. After its announcement in February 2019 and many delays later, Hollow Knight: Silksong launches on September 4th for Xbox Series X/S, Xbox One, PS4, PS5, PC, Nintendo Switch and Switch 2. \n\nIt's an auspicious occasion – several other developers have already delayed their games to get out of the way – but what is there to know about Silksong? Besides serving as a follow-up to one of the best games ever made, what are some new mechanics and features that players can look forward to? Let's dive into all of them here.",
        "id": 3439669,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=MvDsGcaA5C0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MvDsGcaA5C0/hqdefault.jpg",
        "title": "Hollow Knight Silksong - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]