[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-09T15:30:25+00:00",
        "description": "Like a Dragon (or Yakuza, as it was formerly known) has to be one of the busiest and most active franchises around, which means we’re never too far away from another new entry in the series. \n\nLike a Dragon: Pirate Yakuza in Hawaii is now right around the corner, and even though it’s a smaller and cheaper spinoff on paper, it’s still turning more than a few heads. \n\nBuilding on Infinite Wealth’s strong foundations, it will obviously feature plenty of familiar elements, but at the same time, it’s also going to have its fair share of new ideas of its own, setting the experience apart from last year’s game in numerous ways. As we count the days down to its launch, here, we’re going to talk about just that.",
        "id": 2074860,
        "language": null,
        "link": "https://www.youtube.com/watch?v=gQj_nEwOVCs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gQj_nEwOVCs/hqdefault.jpg",
        "title": "Like a Dragon: Pirate Yakuza In Hawaii vs. Infinite Wealth – 10 BIGGEST DIFFERENCES",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-09T09:30:02+00:00",
        "description": "More and more physical media has looked locked on to die a quick death. The last decade or so has seen digital sales’ share increasing dramatically in virtually all markets and on pretty much every platform. \n\nBut of course, depending on the region and on even each individual player’s preference, physical media is still far from fully dead, even if it has unequivocally become the more niche method of purchasing games at this point in time. \n\nWith all of that in mind, deciding whether or not to include a physical media option with its next PlayStation console is going to be far from a straightforward decision for Sony. Multiple factors are going to be at play, and here, that’s exactly what we’ll be discussing.",
        "id": 2074861,
        "language": null,
        "link": "https://www.youtube.com/watch?v=8DQuKxuhftc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8DQuKxuhftc/hqdefault.jpg",
        "title": "Will The PS6 Be DISCLESS?",
        "vote": 0
    }
]