[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:15:36.084441+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:01:20+00:00",
        "description": "Skyrim is one of the most beloved and influential games of the modern era, and that’s because its core design is so innately compelling. It’s so easy to pick it up and get lost in its dense, layered, sprawling fantasy world again, and find yourself in adventures of discovery and exploration and intrigue. \n\nThe fact that the game itself remains fun to play means it is still easy to recommend, well, mostly. There are those peripheral caveats that can’t really be dismissed or handwaved after all. I would definitely be a lot angrier at the missteps taken here if it weren’t for the fact that the upgrade is being offered for free; however, for anyone who is looking to jump in now, these omissions and fumbles are fair warnings for them to consider and bear in mind. \n\nSkyrim on the Switch 2 is conflicted - it’s Skyrim, and on Switch 2, which is great, but this isn’t a particularly great version, and there are some very obvious fixes Bethesda can make here. Hopefully in the months and years to",
        "id": 4304488,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=edAyXcoFMuw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/edAyXcoFMuw/hqdefault.jpg",
        "title": "The Elder Scrolls 5: Skyrim Switch 2 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T15:08:41.886155+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T13:30:00+00:00",
        "description": "Resident Evil Requiem would receive a “new look” at The Game Awards, I was expecting Leon. You know, rookie detective, president's bodyguard, stunning hair follicles – that Leon. Yeah, I believed Dusk Golem when all of you doubted him! Jokes aside, however, it seemed like the right time. Even if the sequel is getting a “deeper dive” in early 2026, if Leon is really such a significant part of the game, what bigger and better stage to reveal him than The Game Awards?\n\nWell, if that PlayStation Store leak wasn't enough evidence, we can finally confirm it: Leon S. Kennedy is in Resident Evil Requiem. That alone would be enough, but the game wasn't just content on teasing, oh no. It showcased his new look – one that's gruffer, with longer hair and some stubble. Don't even get me started on his new outfit – the black coat, complete with the high fur collar and gloves, is pretty darn cool. Almost covert ops but far sleeker.",
        "id": 4303879,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=-gfUmgwbi3E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-gfUmgwbi3E/hqdefault.jpg",
        "title": "Resident Evil Requiem Leon Revealed - Hidden Things You Missed In The NEW Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T11:51:39.070309+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T10:15:03+00:00",
        "description": "The Game Awards 2025 had some massive gaming announcements. From most anticipated sequels to new game announcements, this year's iteration had it all.\n\nLet's take a look at 25 of the biggest announcements at The Game Awards 2025.",
        "id": 4301836,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=XaibNx0b7Wk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XaibNx0b7Wk/hqdefault.jpg",
        "title": "The Game Awards 2025 - 25 Biggest Game Announcements That Sent Hype Through The Roof",
        "vote": 0
    }
]