[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:01.118561+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T18:00:09+00:00",
        "description": "The journey of a 22 year old man from being told he would never walk or use his hands again to becoming a participant in science 35 years later and helping people with spinal cord injuries. Never giving up!  Scott is an incomplete quadriplegic with fine motor skill limitations, following a spinal cord injury (C4 through C6) from a car accident in 1985, caused by a seatbelt failure. \n\nToday, Scott participates in groundbreaking spinal cord injury research at the University of Chicago, where he can control a robotic arm and hand with sensory feedback. The goal of this study is to restore independence to individuals with spinal cord injuries. His journey is one of hope, resilience, and unwavering determination. \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305754,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6qjLR-m1zn0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6qjLR-m1zn0/hqdefault.jpg",
        "title": "Why I volunteered for brain-computer interface research | Scott Imbrie | TEDxNorthwesternU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:01.403354+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:59:29+00:00",
        "description": "Dans ce talk, Carole FONTY nous invite à explorer le chaos et la résilience à travers l’histoire surprenante d’une moule : la moule quagga.\n\nOriginaire de la mer Noire, cette espèce invasive a traversé l’Atlantique, colonisé les Grands Lacs d’Amérique du Nord puis nos lacs suisses, dont le Léman. Dotée d’une incroyable capacité d’adaptation et de reproduction, la moule quagga incarne à la fois la résilience du vivant… mais également le chaos écologique et économique qu’il peut engendrer.\n\nÀ travers cet exemple, Carole FONTY nous montre que le chaos n’est pas une fatalité : il peut révéler ce qui doit être protégé et inspirer l’innovation et faire grandir la collaboration.\n\nAlliant les dernières avancées scientifiques à des innovations technologiques de pointe, elle développe des solutions novatrices et respectueuses de l’environnement pour cohabiter avec cette espèce invasive, atténuer ses impacts négatifs sur la biodiversité et les services écosystémiques et transformer ce fléau en o",
        "id": 4305755,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jXnb6_O7Isg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jXnb6_O7Isg/hqdefault.jpg",
        "title": "Comme quoi, l’arrivée d’une petite moule peut faire basculer le monde ! | Carole Fonty | TEDxGeneva",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:01.555199+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:59:21+00:00",
        "description": "Amb humor i lucidesa, el jove ponent Pol Ruiz explora la “fal·làcia de la planificació”: la tendència a subestimar el temps i l’esforç que requereixen els projectes. A partir de la seva experiència rodant un curtmetratge, reflexiona sobre la diferència entre el pla perfecte i la realitat caòtica. Ofereix quatre claus per aprendre dels errors, gestionar imprevistos i disfrutar del procés creatiu. La seva xerrada combina rigor i frescor, recordant que no es tracta d’evitar el caos, sinó d’estar preparats per a ell. Una lliçó vital sobre flexibilitat i aprenentatge. En Pol ha dedicat el seu treball de recerca a analitzar la fal·làcia de la planificació, un biaix cognitiu que ens porta a creure que tot sortirà més ràpid o més fàcil del que realment passa.\n\nAmb una mirada fresca i crítica, mostra com aquest error afecta tant a l’àmbit acadèmic com a la vida quotidiana, i com aprendre a detectar-lo ens pot ajudar a ser més realistes i a gestionar millor expectatives i projectes.\n\nVol convid",
        "id": 4305756,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OG3dRJr3maY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OG3dRJr3maY/hqdefault.jpg",
        "title": "Això ho faig ràpid i ja està | Pol Ruiz | TEDxIgualada",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:01.754287+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:59:08+00:00",
        "description": "El professor de la UPC David López parla amb la saviesa de 35 anys de docència. Defensa que la clau de l’aprenentatge no és la nota sinó la motivació, i que l’error és una oportunitat, no un fracàs. Proposa una educació que valori el procés i no només el resultat, fomentant la curiositat i la confiança entre professorat i alumnat. Denuncia un sistema que penalitza l’equivocació i mata la creativitat. Amb exemples reals i humanitat, recorda que educar és un diàleg, no un monòleg. La seva ponència és una crida a encendre la llum interior de cada estudiant. Professor del Departament d’Arquitectura de Computadors a la Facultat d’Informàtica de Barcelona de la UPC. Al llarg de més de tres dècades ha combinat la recerca en educació amb la innovació docent, dirigint l’Institut de Ciències de l’Educació de la UPC. Va impulsar la creació del doctorat en Educació en Enginyeria, Ciències i Tecnologia de la UPC, primer d’aquestes característiques a l’estat i dels primers a Europa.\n\nHa estat recon",
        "id": 4305757,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ABq1WnRtNpg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ABq1WnRtNpg/hqdefault.jpg",
        "title": "Motivació per transformar l'educació | David López | TEDxIgualada",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:01.924581+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:58:55+00:00",
        "description": "He discusses his journey in the Indian film industry, including the challenges he faced and how he overcame them.  Mr Sandeep Bharadwaj is an Indian actor and theatre artist best known for his compelling portrayal of the notorious bandit Veerappan in Ram Gopal Varma’s Killing Veerappan (Kannada, 2016) and its Hindi remake Veerappan (2016). A seasoned performer with a strong foundation in theatre, Bharadwaj has also appeared in films such as Baby (2015) and Miracle (2019), among others in Hindi, Kannada, and Telugu cinema. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305758,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_bEg7oFyUXo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_bEg7oFyUXo/hqdefault.jpg",
        "title": "Overcoming Hurdles | SANDEEP BHARDWAJ | TEDxSTS Dwarka Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:02.132804+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:58:47+00:00",
        "description": "Tras más de 30 años atendiendo emergencias neurológicas, el Dr. Tomás Segura presenta dos casos que marcaron su trayectoria y ayudan a comprender mejor el porqué de los grandes avances alcanzados en la atención al ictus durante este periodo de tiempo. Su charla combina ciencia, experiencia y humanidad para mostrar cómo la tecnología y el trabajo en equipo están cambiando el destino de miles de pacientes con infarto cerebral. Tomás Segura is a neurologist and Full Professor of Neurology at the University of Castilla-La Mancha. He completed his residency at Hospital de La Princesa (Madrid) and holds a PhD in Medicine. Since 2000, he has worked at the University Hospital of Albacete, where he has led the Stroke Unit since 2009 and has served as Head of Neurology since 2012.\n\nHe has been principal investigator in over 40 international projects and received 17 competitive research grants focused on stroke, neurodegeneration, neuro-oncology, Parkinson’s, and post-COVID syndrome. Author of m",
        "id": 4305759,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QygagK_AQyc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QygagK_AQyc/hqdefault.jpg",
        "title": "Salvar cerebros, salvar vidas  | Tomás Segura | TEDxAlbacete",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:02.274413+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:58:37+00:00",
        "description": "L’impact des violences subies dans l’enfance reste méconnu et constitue un angle mort des politiques publiques. Pourtant, ces violences peuvent faire perdre jusqu’à 20 ans d’espérance de vie aux victimes. \nLa protection de l’enfance est-elle l’affaire des professionnels… ou de chacun d’entre nous ? \nQuel empreinte voulons-nous laisser sur la vie des enfants vulnérables ? \n\nDans ce talk intime et puissant, Alissa Denissova raconte son parcours d’enfant déracinée, placée, déplacée, puis de jeune adulte livrée à elle-même. À travers son histoire, elle révèle les failles systémiques de la protection de l’enfance en France, les effets des ruptures successives et le poids du silence collectif.\n\nMais surtout, elle montre comment une seule personne peut changer une trajectoire, comme Brigitte, l’éducatrice qui lui a tendu la main, et comment chacun d’entre nous peut agir pour faire des enfants placés d’aujourd’hui les adultes épanouis de demain.\n\n? En cas de doute ou de danger concernant un e",
        "id": 4305760,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XhP5mjTJRlY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XhP5mjTJRlY/hqdefault.jpg",
        "title": "Enfant placée : ce que révèle mon histoire | Alissa Denissova | TEDxNantes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:02.495113+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:58:29+00:00",
        "description": "India is home to millions of hectares of barren, climate-vulnerable land. Can we heal our land, our livelihoods and our biodiversity? In this talk, Madhav Pai, CEO of WRI India shares how India can restore 100 million hectares of degraded land by codifying and scaling landscape restoration practices, leveraging technologies like geospatial and soil science and unlocking capital to power local enterprises. Mr. Pai leads WRI India, an independent research organization, which provides objective information and practical proposals to foster environmentally sound and socially equitable development. \n \nHe has been a respected thinker-practitioner working on critical issues of urbanization, climate change, transportation and environment across various countries for decades. He graduated from the University of Mumbai as a civil engineer and earned a Master's degree in Transport Planning from the University of California, Berkeley. His work is rooted in systems thinking to negotiate the comple",
        "id": 4305761,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gMKjk-ua5uI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gMKjk-ua5uI/hqdefault.jpg",
        "title": "India’s Land Restoration Opportunity | Madhav Pai | TEDxIITDelhi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:02.644582+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:58:11+00:00",
        "description": "In this compelling talk, Edupreneur Dr. Karandeep Singh unpacks the true meaning of pressure and the paradox that surrounds it. He explores how pressure—often seen as a burden—can also serve as a powerful driving force for growth, clarity, and transformation. Through thoughtful insights and real-world reflections, Dr. Singh challenges audiences to rethink their relationship with pressure and discover how embracing it can unlock hidden potential. Dr. (Capt.) Karandeep Singh is an award-winning edupreneur, UN SDG 2030 Ambassador, and former Army Captain whose journey spans the military, academia, and entrepreneurship. A recipient of the Sena Medal and an alumnus of Oxford, Cambridge, and Kyoto University, Dr. Singh brings military precision to the world of educational innovation. Featured in Forbes and Fortune as a global thought leader in AI, sustainability, and education reform, his work has transformed classrooms into ecosystems of innovation—from pioneering the “Forest Education” mo",
        "id": 4305762,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9ZEP3r0hvB8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9ZEP3r0hvB8/hqdefault.jpg",
        "title": "The Pressure Paradox | Dr. Karandeep Singh | TEDxMount Olympus School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:02.863448+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:58:07+00:00",
        "description": "In a bold and provocative talk at the TEDxDublin Salon, Charandeep explored how we are willingly trading pieces of our humanity for convenience, handing over our creativity, decision-making, and even identity to algorithms—one small choice at a time.\n\nThis was more than a warning; it was a wake-up call! \n\nCharandeep revealed the quiet takeover already happening, flipping the narrative on \"AI replacing humans\" and lastly challenging us to make conscious choices about which parts of our humanity we want to preserve before it’s too late. Charandeep is a seasoned professional with extensive experience in technology and business operations. He has led cross-functional teams, driven process optimization and digital transformation initiatives, and delivered scalable, high-impact solutions. Charandeep excels at aligning tech strategy with organizational goals to create sustainable growth. This talk was given at a TEDx event using the TED conference format but independently organized by a loca",
        "id": 4305763,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7XNZad8wL_o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7XNZad8wL_o/hqdefault.jpg",
        "title": "AI won’t replace us | Charandeep Singh Arora | TEDxDublin Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:03.000206+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:58:00+00:00",
        "description": "In this inspiring talk, Mehak Kasbekar — Country Manager and Editor-in-Chief of Brut India — takes us behind the scenes of one of the nation’s fastest-growing digital news platforms. She shares how Brut India evolved from shooting on a simple tripod under immense pressure to becoming one of the country’s most-watched digital video publishers. Through candid storytelling and industry insights, Mehak reveals how constraints, challenges, and high expectations can fuel innovation, sharpen creativity, and build a media powerhouse. Her journey perfectly captures the essence of The Pressure Paradox: that pressure, when embraced, can transform potential into impact. Ms. Mehak Kasbekar is the Country Manager and Editor-in-Chief of Brut India, India’s most watched digital video publisher. A Columbia\nUniversity graduate, Mehak leads a dynamic team of journalists, sales professionals and brand strategists, driving impactful storytelling in innovative formats while steering the organization’s comm",
        "id": 4305764,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=rbwQin9pNb0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rbwQin9pNb0/hqdefault.jpg",
        "title": "The Pressure Paradox | Mehak Kasbekar | TEDxMount Olympus School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:03.213794+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:57:52+00:00",
        "description": "At TEDxMountOlympusSchool, Arjun Saini explore “The Pressure Paradox”—the complex relationship between the pressures we face and the growth they can inspire. The talk dives into how pressure shapes our choices, challenges our limits, and ultimately transforms us. From personal resilience and academic expectations to societal demands and modern-day stressors, the speakers share powerful insights, real stories, and fresh perspectives on turning pressure into purpose. The talk encourage audiences to rethink how they perceive pressure—not just as a burden, but as a catalyst for innovation, self-discovery, and meaningful change. Arjun Saini is the Director of Mount Olympus Group of Schools and a Shiksha Gaurav Puraskar Awardee.\n\nWith a strong foundation shaped by UPSC and CDS, he brings resilience and purpose into education leadership aside from new age thinking. \n\nHe has effectively spearheaded the expansion of the group across multiple regions while strengthening the brand via tie ups wi",
        "id": 4305765,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LK8S8EZ3OaE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LK8S8EZ3OaE/hqdefault.jpg",
        "title": "The Pressure Paradox | Arjun Saini | TEDxMount Olympus School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:03.388397+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:57:42+00:00",
        "description": "As the Chief Operating Officer at the ECB Sustainable Youth Foundation, Bhavika Dabur has navigated high-impact roles, demanding environments, and the constant push to deliver meaningful change. In her talk, “The Pressure Paradox,” she reflects on how pressure has shaped her journey—not as an obstacle, but as a driving force that pushed her to unlock new capabilities, embrace responsibility, and achieve more than she imagined. Bhavika shares powerful personal insights on transforming pressure into purpose, offering a refreshing perspective on resilience, ambition, and growth for young leaders everywhere. Ms. Bhavika Dabur currently serves as the Chief Operating Officer at ECB Sustainable Youth Foundation, where she leads operations and strategy for youth-led sustainability programs across India. She also works as a Brand Strategist at The Greater Change, a Dubai-based HR Outsourcing Firm. Her experiences include impactful tenures with KPMG India, India Trade Promotion Organization and",
        "id": 4305766,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qYFPPuJNM-A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qYFPPuJNM-A/hqdefault.jpg",
        "title": "The Pressure Paradox | Bhavika Dabur | TEDxMount Olympus School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:03.591828+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:57:34+00:00",
        "description": "L’antropòloga Emma Fàbrega ens convida a mirar el món amb ulls curiosos i sense prejudicis. \n\nA través d’una anècdota d’infantesa, descobreix que allò que considerem “normal” o “estrany” depèn del context cultural. Explica com la mirada antropològica pot ajudar-nos a entendre millor la diferència i reduir els conflictes. La seva proposta és simple però poderosa: atura’t, pren perspectiva i sigues curiós. \n\nUna invitació a abraçar la diversitat amb empatia i consciència. Fàbrega defensa que la incomoditat és una oportunitat per créixer. Amb humor i sensibilitat, transforma la curiositat en eina de connexió humana. Doctora en Antropologia Social i Cultural  (UB) I professora lectora (UOC)\n\nL’Emma ha centrat la seva recerca en qüestions de migració, experiències d’envelliment, i percepcions socials del cos. Actualment és investigadora postdoctoral i forma part de grups de recerca sobre diversitat i identitat, des d’on explora com les narratives de vida, els privilegis i les desigualtats ",
        "id": 4305767,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bIBkkeIL338",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bIBkkeIL338/hqdefault.jpg",
        "title": "Pensa com un antropòleg | Emma Fàbrega | TEDxIgualada",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T18:43:03.793408+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:57:16+00:00",
        "description": "“Tiny But Mighty” is the extraordinary journey of 5-year-old Laranyaa Agarwal, who transforms a tiny beginning into a meaningful reality. Through the beautiful metaphor of a small seed, she shares how resilience, curiosity, and creativity can grow into purpose and strength.\n\nIn this inspiring TEDxSVSU talk, Laranyaa reminds us that even the smallest vision can decode tomorrow and evolve into something truly mighty. Her story proves that age and size do not define impact—a tiny spark can ignite big change.\nA message of hope.\nA celebration of imagination.\nA reminder that greatness often begins small.\n\nWatch this powerful talk and witness how a young mind redefines what it means to be tiny but mighty.\n\n#TEDxSVSU #TinyButMighty #LaranyaaAgarwal #TEDxTalks #Inspiration #Resilience #Creativity #DecodeTomorrow Laranyaa Agarwal is an eloquent young speaker who captivates audiences with her clarity, confidence, and charm. At just five, she inspires with thoughts beyond her years.\n\nA National R",
        "id": 4305768,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=v2rwYUFYShg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/v2rwYUFYShg/hqdefault.jpg",
        "title": "Tiny But Mighty:Unlocking the Strength Within | Laranyaa Agarwal |SVSU | Laranyaa Agarwal | TEDxSVSU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T19:50:43.559741+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:55:55+00:00",
        "description": "En esta charla inspiradora, Regina Carrot analiza por qué las mujeres que comunican mejor logran mayores oportunidades y mejores ingresos. A partir de su experiencia personal y profesional, Regina reflexiona sobre la visibilidad, la credibilidad y el poder de la comunicación efectiva, el storytelling, el hablar en público y la marca personal como herramientas clave para el liderazgo femenino.\nLa charla invita a cuestionar la idea de que el talento por sí solo es suficiente y propone un cambio de mentalidad: pasar de la invisibilidad a la acción, convirtiéndose en la protagonista de la propia historia para generar impacto, influencia y crecimiento profesional. Regina Martínez Sada, conocida como Regina Carrot, autora bestseller y CEO de Speaker Magnética Academy. Con más de 14 millones de seguidores en redes sociales, Regina ha construido una comunidad global de mujeres que buscan crecer, sanar y conquistar escenarios desde su autenticidad. Su propósito es claro: convertir la voz de ca",
        "id": 4306322,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XsD1Nu6UPGI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XsD1Nu6UPGI/hqdefault.jpg",
        "title": "¿Porqué las mujeres que comunican mejor, ganan mejor? | Regina Carrot | TEDxUANL",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:09.502344+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:53+00:00",
        "description": "How do we hold on to who we are in a world that constantly tells us to become someone else?\nThis talk explores identity through the story of a grandfather, a coastal culture, and the quiet strength passed down through generations.\nIt’s not about where you come from — but who you allow yourself to be, especially when no one is watching.\nA reflection on belonging, authenticity, and why knowing who you are may be the most underrated superpower of all.\n Gjertrud Østervold Toft is a mental performance coach, educator, and entrepreneur. She works at the intersection of psychology, identity, and growth — helping people find strength, clarity, and direction in both life and performance. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305138,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mQQNN7g_cIU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mQQNN7g_cIU/hqdefault.jpg",
        "title": "How living by the sea gave me clarity | Gjertrud Østervold Toft | TEDxØygarden",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:09.707578+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:45+00:00",
        "description": "Anca shares clear, practical tools to help teenagers cope with stress, expectations, and the fast pace of today's world. Psychologist and psychotherapist Anca Matei has been guiding and supporting people for over twenty years — helping them move beyond fear, confusion, and self-doubt towards balance, courage, and meaning. With studies at King’s College London and extensive work reaching over 40,000 children, parents, and adults through community projects, school initiatives and online programs, she believes that healing begins when we find the space to be seen, valued, and loved — and from that place, we naturally begin to grow.In a world changing faster than ever, Anca speaks about the need for guidance and how to overcome the inner blocks that hold us back. Her message invites us to cultivate inner balance so we can step into the future with clarity, confidence, and hope. This talk was given at a TEDx event using the TED conference format but independently organized by a local commu",
        "id": 4305139,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=4V9FzVie_Tc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/4V9FzVie_Tc/hqdefault.jpg",
        "title": "Choosing Yourself in a Crowded World | Anca Matei | TEDxBucharest Beirut International School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:10.016731+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:41+00:00",
        "description": "Pan's talk explores how personal growth, resilience, and passion transformed him from a struggling student into a leader, proving that innovation often begins within. BBIS alumnus and  and Master’s student in Computer Science at the University of Amsterdam, An Pan is passionate about the intersection of technology, creativity, and human connection. His work explores how innovation can shape meaningful experiences — from interactive events to digital solutions that bring people together. Blending analytical thinking with artistic vision, he represents a new generation of creators who use technology not just to build the future, but to make it more human. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305140,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=aF2RaTBKYqU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aF2RaTBKYqU/hqdefault.jpg",
        "title": "Innovation Within | An Pan | TEDxBucharest Beirut International School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:10.284142+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:34+00:00",
        "description": "Design is more than visuals, it is a language that tells stories without words. Alexandru Dadoo explores how shapes, colours and structure can shape emotions and meaning.  Alexandru Dadoo is the Owner and Creative Director of Maison DADOO, one of Romania’s most celebrated floral design and events agencies. Featured in Forbes 30 Under 30, Alexandru is a young and versatile entrepreneur who has helped transform Maison DADOO over the past decade from a floral atelier into a full-service events company, serving both private and corporate clients.\n\nAlexandru’s approach emphasizes refinement, creativity, and emotional storytelling, with every project tailored to reflect the client’s vision. Under his guidance, Maison DADOO has become known not only for its exquisite floral creations and event décor, but also for elevating the standards of elegance and professionalism in Romania’s wedding and events industry.\n\nBesides the events agency, Maison DADOO also operates a boutique flower shop locat",
        "id": 4305141,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XB0EpjrBBdI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XB0EpjrBBdI/hqdefault.jpg",
        "title": "Creativity in Full Bloom  | Alexandru Dadoo | TEDxBucharest Beirut International School",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:10.677058+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:26+00:00",
        "description": "He passionately discusses some wonderful ideas that can transform society and cater to the basic needs of people A dedicated student currently studying in the XIth grade. He cultivates a passion for leadership and teamwork with commitment to upholding the values of the institution. His pursuits extend to a keen interest in new technology, showcasing his inquisitive mindset, a practical approach to collaborative endeavours, and engaging in meaningful interactions and contributing positively to the academic community. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305142,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TKQi7EUh2qo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TKQi7EUh2qo/hqdefault.jpg",
        "title": "Community Toilets as Learning Hubs | TEJAS GUPTA | TEDxSTS Dwarka Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:10.996472+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:23+00:00",
        "description": "He Discussed what poeple assume about the personality of a data scientist or an IT professional also he discussed how everything todays consists data Group Senior Product Anlyst This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305143,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VFfIttYngm8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VFfIttYngm8/hqdefault.jpg",
        "title": "When Everything Speaks Data | Qasim Ali Khan | TEDxIMSciences",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:11.256407+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:10+00:00",
        "description": "She discussed how we can rewrite our life by facing our fears in a creative way Seemab is a Photographer and creative profesional from Pakistan , Graduated from National College Of Arts This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305144,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HIOrAjFhXtg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HIOrAjFhXtg/hqdefault.jpg",
        "title": "Creative Courage To Reinvent Things | Seemab Saqib Khan | TEDxIMSciences",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:11.474819+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:03+00:00",
        "description": "She discussed what are our responsibility as a human towards those animals who cant speak their emotions out \n Sidra Qamar is a Peshawar Based Animal Activist who works for the well being of the animals , specially the stray animals , she owns a foundation known as the voice for voiceless This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305145,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=uyTaCKzP4J0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uyTaCKzP4J0/hqdefault.jpg",
        "title": "The unspoken Language of Compassion : How to be a voice for voiceless | Sidra Qamar | TEDxIMSciences",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:11.714411+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:33:00+00:00",
        "description": "Story of a journey standing as a testament to the power of opportunity from Sarvam Shakti foundation, and inner strength. With grit and grace, she shows that girls from underserved communities can rise into confident leaders, given the right support. She reminds us to see them not as charity cases, but as “Shaktis”, bearers of strength, capable of uplifting entire communities. Necessary approvals have been obtained by the foundation. Simran grew up watching her father work long, exhausting days as a daily wage earner. Life around her was chaotic and filled with the pressure of survival, yet her father held one unwavering belief that his daughter deserved a chance to learn and grow beyond what society expected of her. That chance arrived through Sarvam Shakti. There, Simran entered a world of movement, discipline, health, confidence, and expression. Dance, yoga, nutrition, and self-awareness became tools that helped her shed the labels of “marginalised” or “disadvantaged,” and rewrite ",
        "id": 4305146,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=M2S0rsJI4hI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/M2S0rsJI4hI/hqdefault.jpg",
        "title": "Born from Grit, Raising with Grace | Simran Rai | TEDxNHVPS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:11.851392+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:32:14+00:00",
        "description": "In this heartfelt TEDx talk, Tvisha unpacks the comforting but dangerous idea of “later.” Through memories of her grandmother-the winters, the mustard oil, the oranges, the sarees, and the gold bangles she never got to gift-she shows how easily we postpone love and dreams.\n\nWith honesty and warmth, she reminds us that regret is made of all the things we kept for “someday.” Her message is simple: say what you feel, use the good plates, and start now.\n\nBecause “later” isn’t a time-it’s just another word for never. Tvisha Tuli, popularly known as Socho.Abhi, is a strategist and educator in business, branding, and the creator economy. With an engaging, fast-paced style, she “tea-ches” (teaches + reaches) entrepreneurs and content creators how to elevate their brand narrative and thrive in today’s digital ecosystems.\n\nHer content delivered via fun, insightful short formats covers topics like AI’s impact on business, brand voice, positioning, and content strategy. \n\n She is especially known",
        "id": 4305147,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9i09wV7gVrk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9i09wV7gVrk/hqdefault.jpg",
        "title": "The Illusion of Later - When later becomes too late. | Tvisha Tuli | TEDxMotilalNehruCollege",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:12.204234+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:32:02+00:00",
        "description": "Criminalistics and Equality of Arms” deals with the profound risks and difficulties forensic experts face in remaining the truly independent party, where they deal with parties with a legal interest, who may attempt to interpret evidence to their advantage.\nForensic Science is not just about solving crimes. It is about the search for truth in a world where the truth is often fragmented and hidden. Is there an Equality of Arms when not all the information about the evidence is provided in the case file? Marco Bosmans is a private forensic advisor championing the “Equality of Arms” in the justice system. With a background in biotechnology and a specialization in DNA, he provides his expertise to parties who previously had no access, ensuring that scientific evidence is interpreted fairly and objectively. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305148,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MBfF3lmi2HU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MBfF3lmi2HU/hqdefault.jpg",
        "title": "Criminalistics & equality of arms | Marco Bosmans | TEDxTheHague",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:12.385894+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:31:48+00:00",
        "description": "Hedvig Hjertaker shares life lessons she learned while becoming the youngest woman to walk solo to the South Pole. Through extreme cold, silence, and physical struggle, she discovered what truly matters, and what we must leave behind to find meaning in our own lives. Hedvig is a Norwegian adventure athlete and specialist dental therapist dedicated to helping people overcome fear, both in the dental chair and in the wild. A former national swimming champion, she later found her passion in pushing mental and physical boundaries through long-distance expeditions and challenging terrain.\n\nAfter recovering from a severe illness at 19 and losing her mother to cancer, Hedvig committed to making life as meaningful and adventurous as possible. Her philosophy is simple: every bold journey begins with a single step, and the courage to take it. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/te",
        "id": 4305149,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=WtHnIN8362Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WtHnIN8362Q/hqdefault.jpg",
        "title": "What I Learned About Life on the Way to the South Pole | Hedvig Hjertaker | TEDxØygarden",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:12.732318+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:30:05+00:00",
        "description": "Across my career, I have changed jobs several times and in different industries. Each time, I would walk into a completely new environment, new culture, new systems, new expectations.\nAnd each time, the temptation was the same: “Catherine, you need to look like you know it all or most of it”\nThat pressure is real.\nIt is the same pressure that makes us hide questions, pretend to understand, and blend in so we do not look like we do not know.\nBut here is the problem:  when we do that, we limit our ability to learn, we dull our curiosity, and we miss opportunities to connect.\nThe truth is that the beginner’s mindset is not a gap to hide; it is an asset to embrace.\n Catherine currently works as the Managing Director of Microsoft, Africa Development Centre; a software Development center that builds some of Microsoft's Products used globally.\nShe is well versed with the Technology(IT) landscape having led and worked with team across different sectors; Manufacturing,, Aviation, Banking, and ",
        "id": 4305150,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7BlP7LSTDak",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7BlP7LSTDak/hqdefault.jpg",
        "title": "The beginner's mindset | Catherine Muraga | TEDxNairobi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:12.935736+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:29:52+00:00",
        "description": "Jakaria Jalal delivers his sixth TEDx talk, reflecting on the long 170 year legacy of Jagannath University and its standout alumni like swimmer Brozen Das. Speaking under the theme “Rewired Perspectives,” he explains how real rewiring means letting go of old beliefs and embracing new ideas that push us forward.\n\nComing from a Chemical Engineering background, he describes the brain as a living lab with more power than any machine. By changing our thoughts and breaking old patterns, we can grow into stronger and more effective leaders.\n\nHe introduces the idea of the chemistry of confidence, focusing on four hormones that shape how we think and act: serotonin for confidence, dopamine for vision, cortisol for handling pressure, and oxytocin for trust and human connection.\n\nJalal also talks about the ripple effect of emotions, showing how one person’s mindset can influence an entire community. Jakaria Jalal is a Bangladeshi business leader and the Head of Bashundhara LP Gas Ltd, a major su",
        "id": 4305151,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HnaaRW8nNbA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HnaaRW8nNbA/hqdefault.jpg",
        "title": "Change Your Chemistry, Change the World | Jakaria Jalal | TEDxJagannath University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:37:13.278744+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:29:49+00:00",
        "description": "In an age defined by speed, delivery, and artificial intelligence, Koen invites us to rediscover something radically human: the power of pause. Drawing from his career in technology and his time as a Buddhist monk, he explores how our human next evolution might not be faster intelligence, but clarity and peace of mind. What if pause is our new progress? Koen is a technologist, teacher, meditator and former Buddhist monk passionate about helping to develop human wisdom in this time of artificial intelligence. Koen served in leadership positions at Microsoft, Amazon Web Services and Accenture and currently he helps organizations and students on the intersection of mindfulness, attention, and artificial intelligence. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4305152,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KP8XMSpQ7ww",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KP8XMSpQ7ww/hqdefault.jpg",
        "title": "Pause as our new progress | Koen van den Biggelaar | TEDxTheHague",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:28:16.121426+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:09:04+00:00",
        "description": "Perspective's role in your identity  Hello my name is Mia and I am a year eleven student at the international school of Monaco. I have been doing TED X youth at ISM for almost three years now, although I have been a student here for much longer. TED X youth has allowed me to discover the power my words hold, and allowed me to feel truly confident when speaking in front of crowds, no matter the size . I am very passionate about this years theme, the power of perspective, and look forward to hearing from all the speakers at the event. Most importantly, I hope through the TED X talks, at least one spectator will view something in a new light, considering all the perspectives. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4304561,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=V5E4eh_CuTU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/V5E4eh_CuTU/hqdefault.jpg",
        "title": "How cultures shape perspective | Mia Blundy | TEDxYouth@ISMonaco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:28:16.417670+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:08:56+00:00",
        "description": "The power of perspectives when interpreting different situations.  Hi everyone,my name is Leora,and I am 12 years old and from Eastern Europe.Ever since I was little,I have had a numerous number of interests including painting,reading,tennis and most importantly,performing in front of an audience.I joined Ted X youth purely out of interest in what it is like,however along the way I learned multiple skills like speaking with confidence,and convincing people as well as educating them.Although this journey was not easy and I sacrificed a lot of my free time,I couldn’t be happier with my decision. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4304562,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=j-ah61WyqcI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/j-ah61WyqcI/hqdefault.jpg",
        "title": "Perspective in hindsight | Leora Glotser | TEDxYouth@ISMonaco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:28:16.596516+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:08:48+00:00",
        "description": "The impact of perspectives on personal growth  Hello, my name is Anna Victoria, I am 12 year old and I am French, Swiss and Armenian! I highly enjoy public speaking because of how nicely it impacted my self-growth and self esteem. In my free time, I like baking/cooking and spend quality time with the people I love! My goal is to is to achieve talking to the public with full confidence and control. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4304563,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2xul8Y2ezHM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2xul8Y2ezHM/hqdefault.jpg",
        "title": "Polishing our perspective lens | Anna Victoria Ucari | TEDxYouth@ISMonaco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:28:16.735798+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:08:02+00:00",
        "description": "This talk explores how small decisions can transform the course of a person’s life. Through personal experiences and real stories, it highlights the power of resilience, self-awareness, and taking initiative. Speakers talked about their difficulties and their achievements. They explained how it is important to rise by taking risks in life and they invited the audience to rethink their limits and discover their own potential.\n Nazlı Bulum is a Turkish actress, producer, director, and screenwriter. She was born in 1992 in Istanbul and graduated from Kadir Has University’s Theater Department in 2015. She has an active career in both theater and cinema.\n\nShe has acted in numerous films, series, and theater productions, including “Birlikte Öleceğiz,” “Beni Sevenler Listesi,” “Sen Ben Lenin,” “Oregon,” and the popular TV series “Sadakatsiz.” In addition to acting, she has also worked as a producer, assistant director, and writer in several independent projects.\n\nHasan Süel is a senior execu",
        "id": 4304564,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zXtWNrAObw0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zXtWNrAObw0/hqdefault.jpg",
        "title": "0 -100: Riskle Yüksel! | Nazlı Bulum, Hasan Süel, Emre Sever & Zeynep Yalım Uzun | TEDxSaintMichelHS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:28:16.900669+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:07:26+00:00",
        "description": "Hepimiz daha fazlasını başarmak istiyoruz; fakat çoğu zaman yanlış yöntemlerle mücadele ediyoruz. Bu konuşma, çalışma anlayışını yeniden düşünmemizi sağlayan beş nörobilim temelli yöntemi anlatıyor. Kemal Berk İsler, tıp doktoru ve polyglot (çok dilli) içerik üreticisidir. YouTube’daki Berk MD kanalında yarım milyondan fazla takipçiye ulaşarak sağlık, hızlı dil öğrenme ve üretkenlik alanlarında içerikler üretmektedir. Çalışmalarında, güncel tıp literatürü ve bilimsel makalelerden yararlanarak, karmaşık bilgileri sade bir dille günlük yaşamı kolaylaştıracak önerilere dönüştürür.\n\nUluslararası bir firmanın medikal ekibinde görev almakta; aynı zamanda birçok üniversitede konuşmacı olarak yer alarak öğrencilere ve genç profesyonellere ilham vermektedir. 2024 yılında Türk Tıp Öğrencileri Birliği (TurkMSIC) tarafından “Yılın En İyi Influencer Doktoru” ödülüne layık görülmüştür.\n\nAltı farklı dilde sosyal medya içeriği üreten, ilgi çekici anlatım tarzı ve kanıta dayalı yaklaşımıyla geniş kitl",
        "id": 4304566,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_TLubEaf8tI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_TLubEaf8tI/hqdefault.jpg",
        "title": "5 Adımda Çok Değil, Akıllıca Çalış | Dr. Kemal Berk İsler | TEDxMFL High School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:28:17.098153+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:06:58+00:00",
        "description": "In this talk, the speaker shares a powerful realization that every single day, from the moment we wake up until we sleep, is a continuous opportunity for learning and personal development, which she learnt throughout her personal experiences. By viewing \"every day as growth,\" we can find meaning in our lives, cultivate a positive mindset, and turn even difficult times into proof that we are doing our best. Her speech will teach us how shifting our perspectives can transform your routine into a rewarding journey. She is a 3rd grader in Otsuma Nakano Junior and Senior High School. She will share what she found out about growh. Everything we experience leads to growth is something she realized. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4304567,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Nmc4BpT1zbA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Nmc4BpT1zbA/hqdefault.jpg",
        "title": "What exactly is Growth? | Saki Uehara | TEDxYouth@OtsumaNakano",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:28:17.233010+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:06:50+00:00",
        "description": "彼女の人生を豊かに彩り、前向きな力となってくれている「大切な存在」について深く掘り下げます。進路や悩みを受け止め、社会で生きる知恵を教えてくれる先生、居場所を実感させ、人生に大きな影響を与える友人、挑戦を促してくれる父親、そして人として尊敬している母親。彼女は、身近な人々の存在が、いかに人生を支え、未来への活力を与えているかを熱く語ります。聞く人にとって、人生を前向きに捉え直し、周囲の絆を見つめ直すきっかけとなるインスピレーションに満ちたトークです。 She is a 3rd grader in Otsuma Nakano Junior and Senior High School. She will present how much she appreciates people around her. They influenced her life in a positive way. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4304568,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1hcADHlCzH4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1hcADHlCzH4/hqdefault.jpg",
        "title": "私の人生を変えてくれた話 | Junka Toda | TEDxYouth@OtsumaNakano",
        "vote": 0
    }
]