[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T23:37:38.210883+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T23:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Google has increasingly moved toward keeping features locked to its hardware products, but the Translate app is bucking that trend. The live translate feature is breaking out of the Google bubble with support for any earbuds you happen to have connected to your Android phone. The app is also getting improved translation quality across dozens of languages and some Duolingo-like learning features.\n \nThe latest version of Google's live translation is built on Gemini and initially rolled out earlier this year. It supports smooth back-and-forth translations as both on-screen text and audio. Beginning a live translate session in Google Translate used to require Pixel Buds, but that won't be the case going forward. Google says a beta test of expanded headphone support is launching today in the US, Mexico, and India.\n \nThe audio translation attempts to preserve the tone and cadence of the original speaker, but it's not as capable as the f",
        "id": 4307912,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/12/2125205/google-translate-expands-live-translation-to-all-earbuds-on-android",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Translate Expands Live Translation To All Earbuds On Android",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T22:29:02.569746+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T22:22:00+00:00",
        "description": "Online retailer Coupang, often called South Korea's Amazon, is dealing with the fallout from a breach that exposed the personal information of more than 33 million accounts -- roughly two-thirds of the country's population -- after a former contractor allegedly used credentials that remained active months after his departure to access customer data through the company's overseas servers. \n\nThe breach began in June but went undetected until November 18, according to Coupang and investigators. Police have called it South Korea's worst-ever data breach. The compromised information includes names, phone numbers, email addresses and shipping addresses, though the company says login credentials, credit card numbers, and payment details were not affected. \n\nCoupang's former CEO Park Dae-jun told a parliamentary hearing that the alleged perpetrator was a Chinese national who had worked on authentication tasks before his contract ended last December. Chief information security officer Brett Ma",
        "id": 4307441,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/12/2054200/the-data-breach-that-hit-two-thirds-of-a-country",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Data Breach That Hit Two-Thirds of a Country",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T22:29:02.857068+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T21:40:00+00:00",
        "description": "An anonymous reader shares a report: Amazon has quietly added a new AI feature to its Kindle iOS app -- a feature that \"lets you ask questions about the book you're reading and receive spoiler-free answers,\" according to an Amazon announcement. \n\nThe company says the feature, which is called Ask this Book, serves as \"your expert reading assistant, instantly answering questions about plot details, character relationships, and thematic elements without disrupting your reading flow.\" \n\nPublishing industry resource Publishers Lunch noticed Ask this Book earlier this week, and asked Amazon about it. Amazon spokesperson Ale Iraheta told PubLunch, \"The feature uses technology, including AI, to provide instant, spoiler-free answers to customers' questions about what they're reading. Ask this Book provides short answers based on factual information about the book which are accessible only to readers who have purchased or borrowed the book and are non-shareable and non-copyable.\" \n\nAs PubLunch ",
        "id": 4307442,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/12/2046226/new-kindle-feature-uses-ai-to-answer-questions-about-books---and-authors-cant-opt-out",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Kindle Feature Uses AI To Answer Questions About Books - And Authors Can't Opt Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T21:23:28.093137+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T21:00:00+00:00",
        "description": "joshuark writes: Arkansas is becoming the first state to officially end its public television affiliation with PBS. The Arkansas Educational Television Commission, whose members are all appointed by the governor, voted to disaffiliate from PBS effective July 1, 2026, citing the $2.5 million annual membership dues as \"not feasible.\" The decision was also driven by the loss of a similar amount in federal funding after the Corporation for Public Broadcasting (CPB) was defunded by Congress. \n\nPBS Arkansas is rebranding itself as Arkansas TV and will provide more local content, the agency's Executive Director and CEO Carlton Wing said in a statement. Wing, a former Republican state representative, took the helm of the agency in September. \"Public television in Arkansas is not going away,\" Wing said. \"In fact, we invite you to join our vision for an increased focus on local programming, continuing to safeguard Arkansans in times of emergency and supporting our K-12 educators and students.\" ",
        "id": 4306976,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/12/2040247/arkansas-becoming-1st-state-to-sever-ties-with-pbs-effective-july-1",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Arkansas Becoming 1st State To Sever Ties With PBS, Effective July 1",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T21:23:28.173521+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T20:36:00+00:00",
        "description": "An anonymous reader shares a report: Amazon Prime Video has pulled its AI-powered video recap of Fallout after viewers noticed that it got key parts of the story wrong. The streaming service began testing Video Recaps last month, and now they're missing from the shows included in the test, including Fallout, The Rig, Tom Clancy's Jack Ryan, Upload, and Bosch. \n\nThe feature is supposed to use AI to analyze a show's key plot points and sum it all in a bite-sized video, complete with an AI voiceover and clips from the series. But in its season one recap of Fallout, Prime Video incorrectly stated that one of The Ghoul's (Walton Goggins) flashbacks is set in \"1950s America\" rather than the year 2077, as spotted earlier by Games Radar.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Prime+Video+Pulls+AI-Powered+Recaps+After+Fallout+Flub%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F12%2F12%2F2036218%2F%",
        "id": 4306977,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/12/2036218/amazon-prime-video-pulls-ai-powered-recaps-after-fallout-flub",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Prime Video Pulls AI-Powered Recaps After Fallout Flub",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T19:02:10.394252+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T18:30:00+00:00",
        "description": "Berlin's regional parliament has passed a far-reaching overhaul of its \"security\" law, giving police new authority to conduct both digital and physical surveillance. From a report: The CDU-SPD coalition, supported by AfD votes, approved the reform of the General Security and Public Order Act (ASOG), changing the limits that once protected Berliners from intrusive policing. Interior Senator Iris Spranger (SPD) argued that the legislation modernizes police work for an era of encrypted communication, terrorism, and cybercrime. But it undermines core civil liberties and reshapes the relationship between citizens and the state. \n\nOne of the most controversial elements is the expansion of police powers under paragraphs 26a and 26b. These allow investigators to hack into computers and smartphones under the banner of \"source telecommunications surveillance\" and \"online searches.\" Police may now install state-developed spyware, known as trojans, on personal devices to intercept messages before",
        "id": 4305983,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/12/1830239/berlin-approves-new-expansion-of-police-surveillance-powers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Berlin Approves New Expansion of Police Surveillance Powers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T17:56:22.064182+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T17:25:00+00:00",
        "description": "The Ninth Circuit Court of Appeals has almost entirely upheld a scathing April ruling that found Apple in willful violation of a 2021 injunction meant to open up iOS App Store payments in its long-running legal battle against Epic Games. A three-judge panel affirmed that Apple's 27% fee for developers using outside payment options had a \"prohibitive effect\" and that the company's design restrictions on external payment links were overly broad. \n\nThe appeals court also agreed that Apple acted in \"bad faith\" by rejecting viable, compliant alternatives in internal discussions. One divergence from the lower court: the appeals court ruled that Apple should still be able to charge a \"reasonable fee\" based on its actual costs to ensure user security and privacy, rather than charging nothing at all. What qualifies as \"reasonable\" remains to be determined. \n\nEpic CEO Tim Sweeney told reporters he believes those fees should be \"super super minor,\" on the order of \"tens or hundreds of dollars\" e",
        "id": 4305385,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/12/1655239/apple-tax-is-dead-in-the-usa",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Apple Tax is Dead in the USA'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:47:47.764931+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:44:00+00:00",
        "description": "China is leading research in nearly 90% of the crucial technologies that \"significantly enhance, or pose risks to, a country's national interests,\" according to a technology tracker run by the Australian Strategic Policy Institute (ASPI) -- an independent think-tank. Nature: The ASPI's Critical Technology Tracker evaluated research on 74 current and emerging technologies this year, up from the 64 technologies it analyzed last year. China is ranked number one for research on 66 of the technologies, including nuclear energy, synthetic biology, small satellites, while the United States topped the remaining 8, including quantum computing and geoengineering. \n\nThe results reflect a drastic reversal. At the beginning of this century, the United States led more than 90% of the assessed technologies, whereas China led less than 5% of them, according to the 2024 edition of the tracker. \"China has made incredible progress on science and technology that is reflected in research and development, ",
        "id": 4304816,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/12/1643211/china-leads-research-in-90-of-crucial-technologies---a-dramatic-shift-this-century",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Leads Research in 90% of Crucial Technologies - a Dramatic Shift this Century",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T16:47:47.851021+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T16:05:00+00:00",
        "description": "A new study of roughly 80,000 bachelor's degree recipients from a large urban public college system finds that characteristics of a graduate's first job can explain nearly two-thirds of the otherwise-unexplained earnings gap between students from low-income and high-income families five years after graduation. \n\nThe research [PDF], published as an NBER working paper by economists at Columbia University, tracked graduates from 2010 to 2017 using administrative education data linked to state unemployment insurance records. Low-income students -- defined as those receiving Pell grants throughout their undergraduate enrollment -- earned about 12% less than their high-income peers at the five-year mark. A substantial gap of roughly $4,900 persisted even after the researchers controlled for GPA, college attended, major, and other pre-graduation characteristics. That residual gap fell to about $1,700 once first-job variables entered the equation. \n\nGraduates from lower-income families tended",
        "id": 4304817,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/12/1537259/the-immediate-post-college-transition-and-its-role-in-socioeconomic-earnings-gaps",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Immediate Post-College Transition and its Role in Socioeconomic Earnings Gaps",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T15:45:30.455753+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T15:26:00+00:00",
        "description": "The Washington Post's top standards editor Thursday decried \"frustrating\" errors in its new AI-generated personalized podcasts, whose launch has been met with distress by its journalists. From a report: Earlier this week, the Post announced that it was rolling out personalized AI-generated podcasts for users of the paper's mobile app. In a release, the paper said users will be able to choose preferred topics and AI hosts, and could \"shape their own briefing, select their topics, set their lengths, pick their hosts and soon even ask questions using our Ask The Post AI technology.\" \n\nBut less than 48 hours since the product was released, people within the Post have flagged what four sources described as multiple mistakes in personalized podcasts. The errors have ranged from relatively minor pronunciation gaffes to significant changes to story content, like misattributing or inventing quotes and inserting commentary, such as interpreting a source's quotes as the paper's position on an is",
        "id": 4304180,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/12/1526213/washington-posts-ai-generated-podcasts-rife-with-errors-fictional-quotes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Washington Post's AI-Generated Podcasts Rife With Errors, Fictional Quotes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T15:45:30.527430+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T14:40:00+00:00",
        "description": "Carl Rinsch, the director behind the 2013 Keanu Reeves film \"47 Ronin,\" has been found guilty of defrauding Netflix out of $11 million that was meant to fund a science fiction series called \"Conquest,\" which the streaming company ultimately cancelled in 2021 after Rinsch failed to meet any production milestones. A jury in the Southern District of New York convicted the 48-year-old on seven charges: one count each of wire fraud and money laundering, and five counts of transacting in illicitly obtained property. \n\nProsecutors alleged that Rinsch funneled the $11 million through multiple bank accounts into a personal brokerage account, lost more than half of it on securities within two months, and then began speculating on cryptocurrency. Court records show he also spent $2.4 million on a Ferrari and five Rolls Royces, $3.3 million on furniture and antiques, and $387,000 on a Swiss watch. Netflix has written off $55 million in total and has not recovered any funds. Rinsch faces up to 90 ",
        "id": 4304181,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/12/1428243/hollywood-director-found-guilty-of-blowing-11-million-netflix-budget-on-crypto-and-ferraris",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hollywood Director Found Guilty of Blowing $11 Million Netflix Budget on Crypto and Ferraris",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T14:36:13.744654+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T14:01:00+00:00",
        "description": "Major automakers have urged Washington to prevent Chinese government-backed automakers and battery manufacturers from opening U.S. manufacturing plants, warning the industry's future is at stake. From a report: The Alliance for Automotive Innovation, which represents General Motors, Ford, Toyota Motor, Volkswagen, Hyundai, Stellantis and other major automakers, sounded the alarm and said Congress and the Trump administration needed to act. \n\n\"China poses a clear and present threat to the auto industry in the U.S.,\" the group wrote in a statement for a U.S. House hearing on Chinese vehicles. The group also said lawmakers should maintain the U.S. Commerce Department's prohibition on importing information and communications technology and services from China that effectively bars the import of vehicles from Chinese manufacturers. \"No amount of investment by automakers and battery manufacturers operating inside the U.S. can counter a China that is enabled by subsidies to chronically overs",
        "id": 4303403,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/12/141238/major-automakers-say-china-poses-clear-and-present-threat-to-us-auto-industry",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Major Automakers Say China Poses 'Clear and Present Threat' To US Auto Industry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T14:36:13.898417+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Guardian: Reddit has filed a challenge against Australia's under-16s social media ban in the high court, lodging its case two days after implementing age restrictions on its website. The company said in a Reddit post on Friday that while it agreed with protecting people under 16, the law \"has the unfortunate effect of forcing intrusive and potentially insecure verification processes on adults as well as minors, isolating teens from the ability to engage in age-appropriate community experiences.\"\n \nReddit said there was an \"illogical patchwork\" of platforms included in the ban. \"As the Australian Human Rights Commission put it, 'There are less restrictive alternatives available that could achieve the aim of protecting children and young people from online harms, but without having such a significant negative impact on other human rights.'\" Reddit argued it was a forum primarily for adults without the traditional social media features the gov",
        "id": 4303404,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/12/041226/reddit-launches-high-court-challenge-to-australias-under-16s-social-media-ban",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reddit Launches High Court Challenge To Australia's Under-16s Social Media Ban",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T12:24:14.554201+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T10:00:00+00:00",
        "description": "The SEC has granted the Depository Trust &amp; Clearing Corp., or DTCC, a no-action letter allowing it to custody and recognize tokenized stocks, ETFs, and Treasuries on approved blockchains for three years. \"Although this program is a pilot subject to various operational limitations, it marks a significant incremental step in moving markets onchain,\" SEC Commissioner Hester Peirce said in a statement. Bloomberg reports: With the permission, DTCC will also extend their record-keeping to the blockchain, Michael Winnike, global head of strategy and market solutions at DTCC Clearing &amp; Securities Services, said in an interview. \"It's the same legal entitlement, the same stock that you would hold in your account from the DTCC in traditional form,\" Winnike said. [...] The SEC's authorization of tokenization services only applies to a specific set of securities that trade often. The approval includes the Russell 1000 index which represents the 1,000 largest publicly traded US companies, ",
        "id": 4302397,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/12/0354219/sec-gives-dtcc-ok-to-tokenize-stocks-in-move-to-blockchain",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SEC Gives DTCC OK to Tokenize Stocks In Move To Blockchain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T08:47:48.179822+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T07:00:00+00:00",
        "description": "Cadmium zinc telluride (CZT), a hard-to-manufacture semiconductor produced by only a handful of companies, is enabling a quiet revolution in medical imaging, science, and security by delivering faster scans, lower radiation doses, and far more precise X-ray and gamma-ray detection. \"You get beautiful pictures from this scanner,\" says Dr Kshama Wechalekar, head of nuclear medicine and PET. \"It's an amazing feat of engineering and physics.\" The BBC reports: Kromek is one of just a few firms in the world that can make CZT. You may never have heard of the stuff but, in Dr Wechalekar's words, it is enabling a \"revolution\" in medical imaging. This wonder material has many other uses, such as in X-ray telescopes, radiation detectors and airport security scanners. And it is increasingly sought-after. Investigations of patients' lungs performed by Dr Wechalekar and her colleagues involve looking for the presence of many tiny blood clots in people with long Covid, or a larger clot known as a pu",
        "id": 4301507,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/12/0346227/cadmium-zinc-telluride-the-wonder-material-powering-a-medical-revolution",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cadmium Zinc Telluride: The Wonder Material Powering a Medical 'Revolution'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T03:45:12.020509+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Do Kwon, the South Korean cryptocurrency entrepreneur behind two digital currencies that lost an estimated $40 billion in 2022, was sentenced in New York federal court on Thursday to 15 years in prison for fraud and conspiracy. Kwon, 34, who co-founded Singapore-based Terraform Labs and developed the TerraUSD and Luna currencies, previously pleaded guilty and admitted to misleading investors about a coin that was supposed to maintain a steady price during periods of crypto market volatility.\n \nKwon was one of several cryptocurrency moguls to face federal charges after a slump in digital token prices in 2022 prompted the collapse of a number of companies. [...] Kwon was accused of misleading investors in 2021 about TerraUSD, a so-called stablecoin designed to maintain a value of $1. Prosecutors alleged that when TerraUSD slipped below its $1 peg in May 2021, Kwon told investors a computer algorithm known as \"Terra Protocol\" had restored",
        "id": 4300149,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/11/2239200/terrausd-creator-do-kwon-sentenced-to-15-years-over-40-billion-crypto-collapse",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "TerraUSD Creator Do Kwon Sentenced To 15 Years Over $40 Billion Crypto Collapse",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T02:42:52.249863+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T02:02:00+00:00",
        "description": "Longtime Slashdot reader Gilmoure shares a report from Nature: Scientists have produced the most detailed 3D map of almost all buildings in the world. The map, called GlobalBuildingAtlas, combines satellite imagery and machine learning to generate 3D models for 97% of buildings on Earth. The dataset, published in the open-access journal Earth System Science Data on December 1, covers 2.75 billion buildings, each mapped with footprints and heights at a spatial resolution of 3 meters by 3 meters. The 3D map opens new possibilities for disaster risk assessment, climate modeling and urban planning, according to study co-author Xiaoxiang Zhu, an Earth observation data scientist at the Technical University of Munich in Germany. \"Imagine a video game with the world's buildings already mapped in basic spatial dimensions!\" writes Gilmoure.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=97%25+of+Buildings+On+Earth+3D-Mapped%3",
        "id": 4299765,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/11/2333243/97-of-buildings-on-earth-3d-mapped",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "97% of Buildings On Earth 3D-Mapped",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T01:40:36.344178+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T01:25:00+00:00",
        "description": "joshuark shares a report from BleepingComputer: More than 10,000 Docker Hub container images expose data that should be protected, including live credentials to production systems, CI/CD databases, or LLM model keys. After scanning container images uploaded to Docker Hub in November, security researchers at threat intelligence company Flare found that 10,456 of them exposed one or more keys. The most frequent secrets were access tokens for various AI models (OpenAI, HuggingFace, Anthropic, Gemini, Groq). In total, the researchers found 4,000 such keys. \"These multi-secret exposures represent critical risks, as they often provide full access to cloud environments, Git repositories, CI/CD systems, payment integrations, and other core infrastructure components,\" Flare notes. [...]\n \nAdditionally, they found hardcoded API tokens for AI services being hardcoded in Python application files, config.json files, YAML configs, GitHub tokens, and credentials for multiple internal environments. S",
        "id": 4299456,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/11/2328238/over-10000-docker-hub-images-found-leaking-credentials-auth-keys",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Over 10,000 Docker Hub Images Found Leaking Credentials, Auth Keys",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T01:40:36.467837+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T00:45:00+00:00",
        "description": "Broadcom has quietly pulled VMware vSphere Foundation from parts of EMEA, pushing smaller customers toward far more expensive bundles and prompting some to consider jumping to Hyper-V or Nutanix. The Register reports: VVF is a bundle that offers compute, storage, and networking virtualization, and a platform to run containers. It's most useful in hyperconverged infrastructure and hybrid clouds, but is less capable than the Cloud Foundation (VCF) private cloud suite. Virtzilla said EMEA customers would need to check with their local dealer to see if VVF was still on sale in their country. \"VVF is no longer available in some EMEA countries, but for the majority it is still available,\" a Broadcom spokesperson said. \"Customers will have to reach out to sales reps or partners to determine availability of a given product in their region. These changes were recent.\"\n \nOur initial tipster said their reseller clued them into the impending change when VMware's new fiscal year started in Novembe",
        "id": 4299457,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/11/2324224/vmware-kills-vsphere-foundation-in-parts-of-emea",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "VMware Kills vSphere Foundation In Parts of EMEA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-12T00:33:37.546023+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-12T00:02:00+00:00",
        "description": "President Trump signed an executive order establishing a single federal AI regulatory framework that preempts state-level rules, aiming to centralize oversight of the rapidly growing AI industry. \"The Trump administration, with the aid of AI and crypto czar David Sacks, has been pursuing a path that would allow federal rules to preempt state regulations on AI, a move meant to keep big Democratic-led states like California and New York from exerting their control over the growing industry,\" notes CNBC.\n \nDeveloping...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Trump+Signs+Executive+Order+For+Single+National+AI+Regulation+Framework%2C+Limiting+Power+of+States%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F12%2F11%2F2352215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fyro.",
        "id": 4299014,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/11/2352215/trump-signs-executive-order-for-single-national-ai-regulation-framework-limiting-power-of-states",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Signs Executive Order For Single National AI Regulation Framework, Limiting Power of States",
        "vote": 0
    }
]