[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T23:05:26.592264+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T23:05:26+00:00",
        "description": "Pinterest is facing widespread user backlash over abrupt account suspensions and pin removals, with many reporting no clear reason or warning before being locked out. The Verge reports: The r/Pinterest subreddit is also currently dominated by posts from confused users who claim their accounts have been suspended without evidence explaining how they violated the platform's guidelines. Users are also reporting they're experiencing an unusually high quantity of pins being deleted by Pinterest with absurd explanations, such as quilting magazines, cross-stitch art, and Minecraft bunk bed builds all being flagged for \"adult content.\"\n \n\"We hear your concerns about recent account deactivations on Pinterest,\" the company said on X. \"To ensure Pinterest remains a safe and positive platform, we continuously monitor for content that violates our Community Guidelines and accounts with violative content may be deactivated as a result.\" \"Pinterest has long-established, public Community Guidelines t",
        "id": 2586833,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/02/216223/pinterest-users-left-confused-by-mass-account-suspensions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pinterest Users Left Confused By Mass Account Suspensions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T23:05:26.464176+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T23:05:26+00:00",
        "description": "Uber is partnering with Chinese autonomous driving startup Momenta to launch robotaxi services outside the U.S. and China, starting in Europe in early 2026 with safety operators onboard. CNBC reports: Uber said the goal is to combine its global ridesharing network with Momenta's technology to deliver safe and efficient robotaxi services. \"This collaboration brings together Uber's global ridesharing expertise and Momenta's AI-first autonomous driving technology, paving the way for a future where more riders around the world experience the benefits of reliable and affordable autonomous mobility,\" Uber CEO Dara Khosrowshahi said in the press release. Momenta CEO Xudong Cao said the arrangement \"completes the key ecosystem needed to scale autonomous driving globally.\"\n \nMomenta, based in Beijing, is a leading autonomous driving company known for its \"two-leg\" product strategy. It offers both Mpilot, a mass-production-ready assisted driving system, and MSD (Momenta Self-Driving), aimed at ",
        "id": 2586832,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/02/2113240/uber-inks-robotaxi-deal-with-chinese-startup-momenta?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Uber Inks Robotaxi Deal With Chinese Startup Momenta",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T22:00:27.617767+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T22:00:27+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: A European Union privacy watchdog fined TikTok 530 million euros ($600 million) on Friday after a four-year investigation found that the video sharing app's data transfers to China put users at risk of spying, in breach of strict EU data privacy rules. Ireland's Data Protection Commission also sanctioned TikTok for not being transparent with users about where their personal data was being sent and ordered the company to comply with the rules within six months.\n \nThe Irish national watchdog serves as TikTok's lead data privacy regulator in the 27-nation EU because the company's European headquarters is based in Dublin. \"TikTok failed to verify, guarantee and demonstrate that the personal data of (European) users, remotely accessed by staff in China, was afforded a level of protection essentially equivalent to that guaranteed within the EU,\" Deputy Commissioner Graham Doyle said in a statement. The Irish watchdog said its in",
        "id": 2586508,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/02/2032203/irish-privacy-watchdog-fines-tiktok-600-million-for-china-data-transfers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Irish Privacy Watchdog Fines TikTok $600 Million For China Data Transfers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T20:55:42.290045+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T20:55:26+00:00",
        "description": "An anonymous reader shares a report: In the nearly two months since former Google chief executive Eric Schmidt acquired Relativity Space, the billionaire has not said much publicly about his plans for the launch company. However, his intentions for Relativity now appear to be increasingly clear: He wants to have the capability to launch a significant amount of computing infrastructure into space. \n\nWe know this because Schmidt appeared before the House Committee on Energy and Commerce during a hearing in April, speaking on the future of AI and US competitiveness. Among the topics raised then was the need for more electricity -- both renewable and non-renewable -- to power data centers that will facilitate the computing needs for AI development and applications. Schmidt noted that an average nuclear power plant in the United States generates 1 gigawatt of power. \n\n\"People are planning 10 gigawatt data centers,\" Schmidt said. \"Gives you a sense of how big this crisis is. Many people thi",
        "id": 2586098,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/02/1839250/eric-schmidt-apparently-bought-relativity-space-to-put-data-centers-in-orbit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Eric Schmidt Apparently Bought Relativity Space To Put Data Centers in Orbit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T20:55:42.406772+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T20:55:26+00:00",
        "description": "The UK financial regulator is preparing to ban retail investors from using borrowed funds such as credit card balances to invest in cryptocurrency as it seeks to overhaul supervision of the fast-growing digital assets market. The Guardian: The soaring values of virtual currencies such as bitcoin after Donald Trump's election have put pressure on the Financial Conduct Authority (FCA) to take a tougher line while it also lays the groundwork for the industry to flourish in the UK. \n\nAccording to a recent YouGov survey, the proportion of people in the UK using borrowed funds to make crypto purchases more than doubled from 6% in 2022 to 14% last year. Borrowing to fund investments, when asset values could change dramatically, meant consumers risked losing their entire investment and potentially other assets, such as their home. These characteristics closely resembled gambling, the Treasury committee found.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href",
        "id": 2586099,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/02/1832253/uk-preparing-to-ban-consumers-from-buying-crypto-with-borrowed-funds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Preparing To Ban Consumers From Buying Crypto With Borrowed Funds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T19:50:25.683107+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T19:50:25+00:00",
        "description": "An anonymous reader shares a report: Apple is teaming up with startup Anthropic on a new \"vibe-coding\" software platform that will use AI to write, edit and test code on behalf of programmers. \n\nThe system is a new version of Xcode, Apple's programming software, that will integrate Anthropic's Claude Sonnet model, according to people with knowledge of the matter. Apple will roll out the software internally and hasn't yet decided whether to launch it publicly, said the people, who asked not to be identified because the initiative hasn't been announced. \n\nThe work shows how Apple is using AI to improve its internal workflow, aiming to speed up and modernize product development. The approach is similar to one used by companies such as Windsurf and Cursor maker Anysphere, which offer advanced AI coding assistants popular with software developers. Further reading: 'Vibe Coding' is Letting 10 Engineers Do the Work of a Team of 50 To 100, Says YC CEO.<p><div class=\"share_submission\" style=\"p",
        "id": 2585689,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/02/181227/apple-anthropic-team-up-to-build-ai-powered-vibe-coding-platform?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple, Anthropic Team Up To Build AI-Powered 'Vibe-Coding' Platform",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T18:43:23.210754+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T18:43:23+00:00",
        "description": "An anonymous reader shares a report: Pinterest is having some weird moderation issues. Reports of sweeping pin removals and account suspensions have appeared across social media platforms like Instagram, TikTok, and X, with many users saying they received no warning or explanation about the ban before being locked out of their accounts. \n\nThe r/Pinterest subreddit is also currently dominated by posts from confused users who claim their accounts have been suspended without evidence explaining how they violated the platform's guidelines. Users are also reporting they're experiencing an unusually high quantity of pins being deleted by Pinterest with absurd explanations, such as quilting magazines, cross-stitch art, and Minecraft bunk bed builds all being flagged for \"adult content.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Pinterest+Users+Left+Confused+By+Mass+Account+Suspensions%3A+https%3A%2F%2Fit.slashdot.org%",
        "id": 2585287,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/02/1724245/pinterest-users-left-confused-by-mass-account-suspensions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pinterest Users Left Confused By Mass Account Suspensions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T18:43:23.324730+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T18:43:23+00:00",
        "description": "The FDA has approved gene-edited pigs for human consumption, potentially marking the first major commercial application of CRISPR technology in the food chain. Created by British company Genus, these pigs have had their DNA modified to remove the receptor that the porcine reproductive and respiratory syndrome (PRRS) virus uses to enter cells, rendering them immune to 99% of known virus variants. \n\nPRRS causes losses of approximately $300 million annually in the US alone by killing piglets and spreading rapidly through factory farms. According to Matt Culbertson, chief operating officer of Genus subsidiary Pig Improvement Company, the gene-edited pork could reach US markets sometime next year. Before launching sales to pig farms, Genus must secure regulatory approval in key export markets including Mexico, Canada, Japan, and China.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Approves+CRISPR+Pigs+For+Food%3A+htt",
        "id": 2585288,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/02/1651254/us-approves-crispr-pigs-for-food?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Approves CRISPR Pigs For Food",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T17:38:20.719848+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T17:38:20+00:00",
        "description": "Redis, the popular in-memory data store, has returned to open source licensing with Redis 8 now available under the AGPL v3 license. The move reverses last year's controversial shift to proprietary licensing schemes (RSALv2 and SSPLv1) that aimed to force major cloud providers to pay for offering Redis as a managed service. \n\nThe decision follows significant market pressure, including AWS, Google, and Oracle backing the Valkey fork, which gained momentum in the open source community. \n\nRedis believes the AGPL license provides sufficient protection from cloud providers while satisfying open source requirements. Redis 8 will incorporate vector sets and integrate previously separate Redis Stack features including JSON, Time Series, and probabilistic data support.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Redis+Returns+To+Open+Source+After+Year-Long+Proprietary+Detour%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25",
        "id": 2584710,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/02/0825249/redis-returns-to-open-source-after-year-long-proprietary-detour?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Redis Returns To Open Source After Year-Long Proprietary Detour",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T17:38:20.608063+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T17:38:20+00:00",
        "description": "An invisible molecular cloud that could shed light on how stars and planets form has been detected surprisingly close to Earth. From a report: Named Eos after the Greek goddess of the dawn, the cloud of gas would appear huge in the night sky if visible to the naked eye. It measures roughly 40 moons in width and has a weight about 3,400 times the mass of the sun, researchers reported in a study published Monday in the journal Nature Astronomy. \n\n\"In astronomy, seeing the previously unseen usually means peering deeper with ever more sensitive telescopes -- detecting those smaller planets ... those more distant galaxies,\" said study coauthor Thomas Haworth, an astrophysicist at Queen Mary University of London. \"This thing was pretty much in our cosmic backyard, and we've just missed it,\" he added. Molecular clouds are composed of gas and dust from which hydrogen and carbon monoxide molecules can form. Dense clumps within these clouds can collapse to form young stars. The article clarifie",
        "id": 2584709,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/02/0515209/scientists-discover-massive-molecular-cloud-close-to-earth?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Discover Massive Molecular Cloud Close To Earth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T16:33:30.273365+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T16:33:30+00:00",
        "description": "Almost all new homes in England will be fitted with solar panels during construction within two years, the UK government will announce after Keir Starmer rejected Tony Blair's criticism of net zero policies. From a report: Housebuilders will be legally required to install solar panels on the roofs of new properties by 2027 under the plans. The policy is estimated to add between $4,000 and $5,320 to building a home but homeowners would save more than $1,331 on their annual energy bills, according to the Times. \n\nLabour has set a target of building 1.5m homes by the end of the parliament. The party has promised to decarbonise the electricity grid by 2030 and cut household energy bills by $400 a year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Solar+Panels+To+Be+Fitted+On+All+New-Build+Homes+in+England+By+2027%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F05%2F02%2F0558256%2F%3Futm_source%3Dtwitter%26utm_medium",
        "id": 2584055,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/02/0558256/solar-panels-to-be-fitted-on-all-new-build-homes-in-england-by-2027?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Solar Panels To Be Fitted On All New-Build Homes in England By 2027",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T15:29:38.582280+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T15:29:38+00:00",
        "description": "A Michigan federal magistrate judge has banned a lawyer from using a cartoon dragon watermark on legal filings, calling the practice \"juvenile and impertinent.\" Judge Ray Kent of the Western District of Michigan issued the order on April 28 after receiving a complaint featuring a purple, suit-wearing dragon on every page. \n\n\"Each page of plaintiff's complaint appears on an e-filing which is dominated by a large multi-colored cartoon dragon dressed in a suit,\" Kent wrote. \"The Court is not a cartoon.\" The watermark belongs to Jacob A. Perrone of Dragon Lawyers, who told The New York Times he purchased the image online for $20 because \"people like dragons.\" \n\nPerrone said it plans to continue using the logo in his practice but will tone it down in future court submissions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Federal+Judge+Orders+Lawyer+to+Remove+Dragon+Watermark+from+Court+Filings%3A+https%3A%2F%2Fyro.slash",
        "id": 2583615,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/02/0521233/federal-judge-orders-lawyer-to-remove-dragon-watermark-from-court-filings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Federal Judge Orders Lawyer to Remove Dragon Watermark from Court Filings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T15:29:38.470015+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T15:29:38+00:00",
        "description": "A thought experiment involving a cat trapped in a steel box with a potentially lethal device, first proposed by physicist Erwin Schrodinger in 1935, remains at the center of scientific and philosophical debate as it marks its 90th anniversary. \n\nThe paradox, initially published in a technical review of quantum mechanics, presented a scenario where a cat could theoretically exist in a superposition of states -- both alive and dead simultaneously -- until observed, highlighting profound questions about quantum reality. \"Schrodinger understood that under no circumstances could his cat be considered to be both alive and dead at the same time,\" science writer Jim Baggott noted in a recently published essay. Baggott co-authored \"Quantum Drama: From the Bohr-Einstein Debate to the Riddle of Entanglement\" in 2024. \n\nThe thought experiment gained cultural traction largely through science fiction writer Ursula Le Guin's 1974 short story \"Schrodinger's Cat,\" which wrestled with the paradox's phi",
        "id": 2583614,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/02/0551203/schrodingers-cat-paradox-marks-90-years-as-quantum-question-endures?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Schrodinger's Cat Paradox Marks 90 Years as Quantum Question Endures",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T13:18:35.386555+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T13:18:35+00:00",
        "description": "An anonymous reader quotes a report from Teslarati: Waymo Driver is already reducing severe crashes and enhancing the safety of vulnerable road users. As per a new research paper set for publication in the Traffic Injury Prevention Journal, Waymo Driver had outperformed human drivers in safety, particularly for vulnerable road users (VRUs). Over 56.7 million miles, compared to human drivers, Waymo Driver achieved a 92% reduction in pedestrian injury crashes. It also saw 82% fewer crashes with injuries with cyclists and 82% fewer crashes with injuries with motorcyclists. Waymo Driver also slashed injury-involving intersection crashes by 96%, which are a leading cause of severe road harm for human drivers. Waymo Driver saw 85% fewer crashes with suspected serious or worse injuries as well. \"It's encouraging to see real-world data showing Waymo outperforming human drivers when it comes to safety. Fewer crashes and fewer injuries -- especially for people walking and biking -- is exactly t",
        "id": 2582482,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/02/0433206/waymo-says-its-driverless-cars-are-better-than-humans-at-avoiding-crashes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Waymo Says Its Driverless Cars Are Better Than Humans At Avoiding Crashes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T12:14:31.394126+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T12:14:31+00:00",
        "description": "Rockstar has delayed Grand Theft Auto 6 to May 26, 2026. It was due out fall 2025. From a report: In a statement, Rockstar apologized for the significant delay to the game, expected to be the biggest entertainment launch of all time. \n\n\"We are very sorry that this is later than you expected,\" Rockstar said. \"The interest and excitement surrounding a new Grand Theft Auto has been truly humbling for our entire team. We want to thank you for your support and your patience as we work to finish the game.\" \n\n\"With every game we have released, the goal has always been to try and exceed your expectations, and Grand Theft Auto VI is no exception. We hope you understand that we need this extra time to deliver at the level of quality you expect and deserve. We look forward to sharing more information with you soon.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=GTA+6+Delayed+To+May+2026%3A+https%3A%2F%2Fgames.slashdot.org%2Fs",
        "id": 2582023,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/02/1156254/gta-6-delayed-to-may-2026?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "GTA 6 Delayed To May 2026",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T11:08:28.008398+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T11:08:27+00:00",
        "description": "Apple has updated its App Store Guidelines to comply with a court order from the Epic Games lawsuit, now allowing U.S. apps to include external payment links and buttons without needing special approval. \"The App Review Guidelines have been updated for compliance with a United States court decision regarding buttons, external links, and other calls to action in apps. These changes affect apps distributed on the United States storefront of the App Store,\" Apple said in an email to developers on Thursday night. 9to5Mac reports: Here are the full changes to the App Store Guidelines with today's revisions:\n \n3.1.1: Apps on the United States storefront are not prohibited from including buttons, external links, or other calls to action when allowing users to browse NFT collections owned by others. \n3.1.1(a): On the United States storefront, there is no prohibition on an app including buttons, external links, or other calls to action, and no entitlement is required to do so. \n3.1.3: The proh",
        "id": 2581584,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/02/0426218/apple-updates-app-store-guidelines-to-allow-links-to-external-payments?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Updates App Store Guidelines To Allow Links To External Payments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T07:53:29.579548+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T07:53:29+00:00",
        "description": "NASA's SPHEREx space observatory has officially begun its two-year mission to map the entire sky in 102 infrared wavelengths, capturing about 3,600 images daily to create 3D maps of hundreds of millions of galaxies. Its goal is to unlock new insights into cosmic inflation, the origins of galaxies, and the building blocks of life in the Milky Way by using spectroscopy to analyze light and matter across the universe. From a press release: From its perch in Earth orbit, SPHEREx peers into the darkness, pointing away from the planet and the Sun. The observatory will complete more than 11,000 orbits over its 25 months of planned survey operations, circling Earth about 14.5 times a day. It orbits Earth from north to south, passing over the poles, and each day it takes images along one circular strip of the sky. As the days pass and the planet moves around the Sun, SPHEREx's field of view shifts as well so that after six months, the observatory will have looked out into space in every direct",
        "id": 2580499,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/02/0419244/nasas-spherex-space-telescope-begins-capturing-entire-sky?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA's SPHEREx Space Telescope Begins Capturing Entire Sky",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T05:43:15.884395+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T05:43:15+00:00",
        "description": "Spotify has submitted an iOS app update that would allow US customers to use payment options beyond Apple's system, the company said Thursday. The move follows Wednesday's Epic Games v. Apple ruling, which prohibits Apple from taking a cut of non-Apple payment systems and from controlling how developers inform users about alternative payment methods. \n\nIf approved, the update would enable US users to view subscription pricing details and promotions directly in-app, purchase subscriptions via external links, seamlessly switch between Premium plans, and access payment options beyond Apple's system. Spotify suggested the update could eventually facilitate additional purchasing opportunities, including audiobooks. \"While other governments around the world have taken steps against Apple's harmful practices, this is, by far, the most consequential action to date,\" Spotify said, calling it \"absurd\" that these \"basic services\" weren't permitted despite being ordered by a judge four years ago.",
        "id": 2579963,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/01/2319213/spotify-moves-to-bypass-apple-payments-after-landmark-ruling?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Spotify Moves To Bypass Apple Payments After Landmark Ruling",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T05:43:16.071264+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T05:43:15+00:00",
        "description": "Donald Trump's crypto company created a digital dollar called USD1, which is now being used by a big investor in Abu Dhabi to help fund a $2 billion deal with Binance, the world's largest crypto exchange. Reuters reports: Stablecoins are an increasingly lucrative cog in global crypto trading. Their issuers typically profit by earning interest from the Treasuries and other assets that underpin them. The value of USD1 in circulation reached about $2.1 billion on Wednesday, according to CoinMarketCap data, making it one of the fastest-growing stablecoins. The identity of its major holders, however, remains unclear. An anonymous cryptocurrency wallet that holds $2 billion worth of USD1 received the funds between April 16 and 29, according to data from crypto research firm Arkham. Reuters could not ascertain the owner of this wallet.\n \nBinance founder and former CEO Changpeng Zhao, who was incarcerated in the United States last year after pleading guilty to violating U.S. laws against mone",
        "id": 2579964,
        "language": null,
        "link": "https://slashdot.org/story/25/05/01/2040201/trumps-stablecoin-chosen-for-2-billion-abu-dhabi-investment-in-binance?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump's Stablecoin Chosen For $2 Billion Abu Dhabi Investment In Binance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T04:38:14.839137+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T04:38:14+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: A new memo from Secretary of Defense Pete Hegseth is calling on defense contractors to grant the Army the right-to-repair. The Wednesday memo is a document about \"Army Transformation and Acquisition Reform\" that is largely vague but highlights the very real problems with IP constraints that have made it harder for the military to repair damaged equipment.\n \nHegseth made this clear at the bottom of the memo in a subsection about reform and budget optimization. \"The Secretary of the Army shall identify and propose contract modifications for right to repair provisions where intellectual property constraints limit the Army's ability to conduct maintenance and access the appropriate maintenance tools, software, and technical data -- while preserving the intellectual capital of American industry,\" it says. \"Seek to include right to repair provisions in all existing contracts and also ensure these provisions are included in all new contract",
        "id": 2579707,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/01/2132224/army-will-seek-right-to-repair-clauses-in-all-its-contracts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Army Will Seek Right To Repair Clauses In All Its Contracts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T01:22:02.804661+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T01:22:02+00:00",
        "description": "Apple said a majority of its devices shipped into the U.S. in the June quarter will originate in India and Vietnam, a move to allay investor concerns about the impact of tariffs on its operations. From a report: The company was among the hardest-hit of the tech giants last month because of its exposure to China, a primary target of the Trump administration's global tariff pressure. Most of Apple's devices are assembled in the country, and investors are closely watching its efforts to shift final assembly of devices bound for the U.S. to India and other countries. \n\nChief Executive Tim Cook said the impact in the June quarter from tariffs, assuming existing policies remain in place, would add $900 million to Apple's costs, a figure he suggested could be worse in future quarters. He also said that there was limited impact from tariffs in March. [...] He added that Apple would continue to diversify its supply chain away from China. \"What we learned some time ago was that having everythin",
        "id": 2579028,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/01/235234/apple-says-most-of-its-devices-shipped-into-us-will-be-from-india-vietnam?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Says Most of Its Devices Shipped Into US Will Be From India, Vietnam",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T00:17:55.580282+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T00:17:55+00:00",
        "description": "Microsoft has taken its most significant step yet toward eliminating passwords by making new Microsoft accounts \"passwordless by default.\" The change means new users will never need to create a password, instead using more secure authentication methods like biometrics, PINs, or security keys. \n\nThe move builds on Microsoft's decade-long push toward passwordless authentication that began with Windows Hello in 2015. According to company data, passkey sign-ins are eight times faster than password and multi-factor authentication combinations, with users achieving a 98% success rate compared to just 32% for password users. Microsoft also said it now registers nearly one million passkeys daily across its consumer services.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Makes+New+Accounts+Passwordless+by+Default%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F05%2F01%2F2354218%2F%3Futm_source%3Dtwitter%26utm_medi",
        "id": 2578753,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/01/2354218/microsoft-makes-new-accounts-passwordless-by-default?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Makes New Accounts Passwordless by Default",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T00:17:55.692964+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T00:17:55+00:00",
        "description": "Donald Trump's crypto company created a digital dollar called USD1, which is now being used by a big investor in Abu Dhabi to help fund a $2 billion deal with Binance, the world's largest crypto exchange. Reuters reports: Stablecoins are an increasingly lucrative cog in global crypto trading. Their issuers typically profit by earning interest from the Treasuries and other assets that underpin them. The value of USD1 in circulation reached about $2.1 billion on Wednesday, according to CoinMarketCap data, making it one of the fastest-growing stablecoins. The identity of its major holders, however, remains unclear. An anonymous cryptocurrency wallet that holds $2 billion worth of USD1 received the funds between April 16 and 29, according to data from crypto research firm Arkham. Reuters could not ascertain the owner of this wallet.\n \nBinance founder and former CEO Changpeng Zhao, who was incarcerated in the United States last year after pleading guilty to violating U.S. laws against mone",
        "id": 2578754,
        "language": null,
        "link": "https://slashdot.org/story/25/05/01/2040201/trumps-stablecoin-chose-for-2-billion-abu-dhabi-investment-in-binance?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump's Stablecoin Chose For $2 Billion Abu Dhabi Investment In Binance",
        "vote": 0
    }
]