[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T15:11:03.339408+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T15:00:15+00:00",
        "description": "It's official: Grand Theft Auto 6, perhaps the most anticipated game of this decade, is not launching in 2025. Rockstar Games announced a delay to May 26th, 2026, revealing that it needs more time to \"deliver at the level of quality you expect and deserve.”\n\nOn the one hand, it's not unexpected. The open-world title hasn't received many updates since the first trailer debuted in December 2023. No gameplay, no features, nothing. Even the fate of Grand Theft Auto Online is up in the air. Couple that with Rockstar's history of delays, as seen with Grand Theft Auto 5 and Red Dead Redemption 2.\n\nBut is there more than meets the eye to this? Are all those rumors of troubled development from years past finally catching up with Rockstar? What does Take-Two Interactive think of all this besides \"Money\"? Join us as we examine the delay and its impact.",
        "id": 2583418,
        "language": null,
        "link": "https://www.youtube.com/watch?v=9Mz-vH1vxZs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9Mz-vH1vxZs/hqdefault.jpg",
        "title": "GTA 6 Delayed To May 26, 2026 - What The HELL Is Going On?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-02T09:45:59.793482+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-02T09:30:09+00:00",
        "description": "Differing difficulty settings in video games serve different purposes. On the easier end of the scale, reduced challenge fosters a deeper involvement with a game’s story, with regular difficulties blending achievable challenge with story experience. \n\nThe most hardcore of difficulty settings offer something different: most commonly, more powerful enemies and reduced player health. Playing games on their most hardcore difficulty can heighten the experience in numerous ways: a profound immersion with the game’s world, a deeper understanding of its mechanics, and a more rewarding experience all round. \n\nIn fact, some games are improved when played on their most challenging setting. With this video discussing ten such games for PlayStation 5 that are absolutely worth attempting on their most hardcore difficulty.",
        "id": 2580973,
        "language": null,
        "link": "https://www.youtube.com/watch?v=H2bWZrmE90E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/H2bWZrmE90E/hqdefault.jpg",
        "title": "10 MORE PS5 Games You Should Play On Hardcore Mode If You’ve Got The Guts",
        "vote": 0
    }
]