[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-12T15:58:40.505365+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-12T15:30:11+00:00",
        "description": "This year’s Madden NFL iteration isn’t a complete overhaul, yet it feels fresh and exciting in several ways while still lagging behind in others. User interface and long load times have long plagued this EA series, and still continue to suffer with this year’s title. \n\nWhere it shines, however, is through the on-field presentation and gameplay. Some of the diverse pageantry from college football has been transferred here, except replace that with primetime television presentation. There’s just a whole lot more commentary lines and visual interest during gameday this time around. \n\nAll the familiar modes return as well, with Dynasty and Superstar undergoing the most change, little though it is. With more fine-tuning of the on-field physics and animations, and a bevy of options at the player’s fingertips, Madden NFL 26 is a worthy entry in the long running series.",
        "id": 3312419,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=CGxIzbvidoM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CGxIzbvidoM/hqdefault.jpg",
        "title": "Madden NFL 26 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-12T13:45:55.230133+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-12T13:30:50+00:00",
        "description": "It's nice to be excited for a new Battlefield game, and several fans, even those raising the loudest complaints, agree. Its gritty atmosphere and realistic combat, especially the responsive gunplay, are like nothing else out there. \n\nAs far as fans are concerned, Battlefield 6 is a solid step forward. All that's left now is to deliver on that potential when the full game launches on October 10th.",
        "id": 3311258,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=zyjMYxomKhU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zyjMYxomKhU/hqdefault.jpg",
        "title": "Why Battlefield 6 Hooked Hundreds of Thousands of GAMERS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-12T10:27:39.698651+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-12T10:00:37+00:00",
        "description": "We dive into everything you need to know before you pick up a copy of Gears of War: Reloaded, a title that has long been a favorite among Xbox players. With The Coalition finally bringing its cult classic to other consoles, the PS5 version of the original game is set to bring its fair share of value additions to the experience, and could very well mark a very successful debut for the franchise among PlayStation fans.\n\nIt's also a great time to dive into the story that set the franchise in motion considering that Gears of War: E-Day is slated to explore the origins of The Locusts and the Pendulum Wars. All things considered, it's a great time for Marcus Fenix to meet a new generation of players who will join him on an adventure that continues to be as thrilling as it was nearly twenty years ago.",
        "id": 3309809,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Icp83xtKbuQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Icp83xtKbuQ/hqdefault.jpg",
        "title": "Gears of War: Reloaded PS5 - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]