[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T21:25:23+00:00",
        "description": "AmiMoJo writes: The Shenzhen 8K UHD Video Industry Cooperation Alliance, a group made up of more than 50 Chinese companies, just released a new wired media communication standard called the General Purpose Media Interface or GPMI. This standard was developed to support 8K and reduce the number of cables required to stream data and power from one device to another. According to HKEPC, the GPMI cable comes in two flavors -- a Type-B that seems to have a proprietary connector and a Type-C that is compatible with the USB-C standard. \n\nBecause 8K has four times the number of pixels of 4K and 16 times more pixels than 1080p resolution, it means that GPMI is built to carry a lot more data than other current standards. There are other variables that can impact required bandwidth, of course, such as color depth and refresh rate. The GPMI Type-C connector is set to have a maximum bandwidth of 96 Gbps and deliver 240 watts of power. This is more than double the 40 Gbps data limit of USB4 and Th",
        "id": 2506343,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/07/1917215/china-launches-gpmi-a-powerful-alternative-to-hdmi-and-displayport?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Launches GPMI, a Powerful Alternative To HDMI and DisplayPort",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T20:21:16+00:00",
        "description": "An anonymous reader shares a report: Waymo is preparing to use data from its robotaxis, including video from interior cameras tied to rider identities, to train generative AI models, according to an unreleased version of its privacy policy found by researcher Jane Manchun Wong. \n\nThe draft language reveals Waymo may also share this data to personalize ads, raising fresh questions about how much of a rider's behavior inside autonomous vehicles could be repurposed for AI training and marketing. The privacy page states: \"Waymo may share data to improve and analyze its functionality and to tailor products, services, ads, and offers to your interests. You can opt out of sharing your information with third parties, unless it's necessary to the functioning of the service.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Waymo+May+Use+Interior+Camera+Data+To+Train+Generative+AI+Models%2C+Sell+Ads%3A+https%3A%2F%2Ftech.slash",
        "id": 2505939,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/07/196200/waymo-may-use-interior-camera-data-to-train-generative-ai-models-sell-ads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Waymo May Use Interior Camera Data To Train Generative AI Models, Sell Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T19:11:02+00:00",
        "description": "The United Kingdom has banned \"outrageous fake reviews and sneaky hidden fees\" to make life easier for online shoppers. From a report: New measures under the Digital Markets, Competition, and Consumer Act 2024 came into force on Sunday that require online platforms to transparently include all mandatory fees within a product's advertised price, including booking or admin charges. \n\nThe law targets so-called \"dripped pricing,\" in which additional fees -- like platform service charges -- are dripped in during a customer's checkout process to dupe them into paying a higher price than expected. The ban \"aims to bring to an end the shock that online shoppers get when they reach the end of their shopping experience only to find a raft of extra fees lumped on top,\" according to Justin Madders, the UK's Minister for Employment Rights, Competition and Markets.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UK+Bans+Fake+Revi",
        "id": 2505398,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/07/1729229/uk-bans-fake-reviews-and-sneaky-fees-for-online-products?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Bans Fake Reviews and 'Sneaky' Fees For Online Products",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T18:06:06+00:00",
        "description": "The internet's physical mass remains contested among scientists, with estimates ranging from a strawberry to something almost unimaginably small. In 2006, Harvard physicist Russell Seitz calculated the internet weighed roughly 50 grams based on server energy, a figure that would now equate to potato-weight given internet growth. \n\nChristopher White, president of NEC Laboratories America, has dismissed this calculation as \"just wrong.\" White suggests a more accurate method that accounts for the energy needed to encode all internet data in one place, yielding approximately 53 quadrillionths of a gram at room temperature. Alternatively, if the internet's projected 175 zettabytes of data were stored in DNA -- a storage medium scientists are actively exploring -- it would weigh 960,947 grams, equivalent to 10.6 American males. Though scientists debate measurement methods, White asserts the web's true complexity makes it \"essentially unknowable.\"<p><div class=\"share_submission\" style=\"posi",
        "id": 2504929,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/07/1740251/scientists-debate-actual-weight-of-the-internet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Debate Actual Weight of the Internet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T17:01:05+00:00",
        "description": "President Donald Trump signaled a potential diplomatic opening amid his aggressive tariff strategy on Monday, threatening China with an additional 50% tariff while simultaneously offering other nations a path to negotiate lower trade barriers. \n\nThe ultimatum to Beijing demands China withdraw a 34% increase by April 8, 2025, or face supplementary tariffs effective April 9, which would push total levies on Chinese goods to 104% or higher. Trump has already imposed a 20% tariff over fentanyl concerns and a 34% tariff related to trade issues. \"Negotiations with other countries, which have requested meetings, will begin taking place immediately,\" Trump wrote on social media, marking a shift from the administration's previously unyielding stance.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Trump+Opens+Trade+Talks+Window+While+Threatening+China+With+Steeper+Tariffs%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F04%",
        "id": 2504388,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/07/1558211/trump-opens-trade-talks-window-while-threatening-china-with-steeper-tariffs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Opens Trade Talks Window While Threatening China With Steeper Tariffs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T14:53:28+00:00",
        "description": "Scientists \"demonstrated a promising step toward using a person's own immune cells to fight gastrointestinal cancers\" at America's National Institutes of Health (or NIH), reports the Washington Post. \n\nBut the results were published in Nature Medicine on Tuesday &mdash; \"the same day the agency was hit with devastating layoffs...\"\n\n\nThe treatment approach is still early in its development; the personalized immunotherapy regimen shrank tumors in only about a quarter of the patients with colon, rectal and other GI cancers enrolled in a clinical trial. But a researcher who was not involved in the study called the results \"remarkable\" because they highlight a path to a frustratingly elusive goal in medicine &mdash; harnessing a person's own immune defenses to target common solid tumor cancers. Until now, cell-based immunotherapy has worked mainly on blood cancers, such as leukemia, but not the solid cancers that seed tumors in the breast, brain, lungs, pancreas and GI tract... \n\n But the",
        "id": 2502949,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/07/0444201/americas-nih-scientists-have-a-cancer-breakthrough-layoffs-are-delaying-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's NIH Scientists Have a Cancer Breakthrough. Layoffs are Delaying It.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T14:53:28+00:00",
        "description": "Microsoft's AI chief Mustafa Suleyman says the company has deliberately chosen to build AI models \"three or six months behind\" cutting-edge developments, citing cost savings and more focused implementation. \"It's cheaper to give a specific answer once you've waited for the first three or six months for the frontier to go first. We call that off-frontier,\" Suleyman told CNBC. \n\n\"That's actually our strategy, is to really play a very tight second, given the capital-intensiveness of these models.\" Microsoft owns substantial Nvidia GPU capacity but sees no need to develop \"the absolute frontier, the best model in the world first,\" as it would be \"very, very expensive\" and create unnecessary duplication, Suleyman said. \n\nDespite its $13.75 billion investment in OpenAI, Microsoft added the startup to its list of competitors in July 2024. OpenAI subsequently announced a partnership with Oracle on its $500 billion Stargate project, departing from exclusive reliance on Microsoft's Azure cloud",
        "id": 2502948,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/07/1354220/microsoft-ai-chief-sees-advantage-in-building-models-3-or-6-months-behind?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft AI Chief Sees Advantage in Building Models '3 or 6 Months Behind'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T08:20:17+00:00",
        "description": "Brain rot &mdash; the inability to think deeply after too much scrolling on a phone &mdash; afflicts \"plenty of people,\" writes the New York Times' lead consumer technology writer. [Alternate URL here.] He's suffering from it too &mdash; \"These days, it's tough to even finish a book.\" \n\nBut is the answer just avoiding distractions with a stripped-down $600 phone \"that barely does anything\"? For a week he tested the Light Phone III...\n\n\nThe newest version, which began shipping in March and is set for a broader release in July, can place calls, send texts, take photos, show map directions, play music and podcasts and not do much else. There is no web browser. There is also no app store, meaning there's no Uber to hail a ride, no Slack and no social media. There isn't even email... There were moments I enjoyed it. While waiting for a train, resting at the gym or eating alone, I was not tempted to stare at the phone screen, and I felt more mindful of my surroundings. Phone calls sounded ",
        "id": 2500812,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/04/07/0552241/can-using-a-dumber-phone-cure-brain-rot?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Can Using a Dumber Phone Cure 'Brain Rot'?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T05:06:10+00:00",
        "description": "\"Gen Z is rediscovering Tumblr &mdash; a chaotic, cozy corner of the internet untouched by algorithmic gloss and influencer overload...\" writes Fast Company, \"embracing the platform as a refuge from an internet saturated with influencers and algorithm fatigue.\"\n\nThanks to Gen Z, the site has found new life. As of 2025, Gen Z makes up 50% of Tumblr's active monthly users and accounts for 60% of new sign-ups, according to data shared with Business Insider's Amanda Hoover, who recently reported on the platform's resurgence. User numbers spiked in January during the near-ban of TikTok and jumped again last year when Brazil temporarily banned X. In response, Tumblr users launched dedicated communities to archive and share their favorite TikToks... \nTo keep up with the momentum, Tumblr introduced Reddit-style Communities in December, letting users connect over shared interests like photography and video games. In January, it debuted Tumblr TV &mdash; a TikTok-like feature that serves as bo",
        "id": 2500116,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/07/0350213/the-tumblr-revival-is-real---and-gen-z-is-leading-the-charge?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Tumblr Revival is Real - and Gen Z is Leading the Charge",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T01:50:16+00:00",
        "description": "\"U.S. stock market futures plunged on Sunday evening,\" reports Yahoo Finance, \"after the new U.S. tariff policy began collecting duties over the weekend...\" \nThe EU will vote on $28 billion in retaliatory tariffs Wednesday, Reuters reports. (And those tariffs will be approved unless \"a qualified majority of 15 EU members representing 65% of the EU's population oppose it. They would enter force in two stages, a smaller part on April 15 and the rest a month later.\") \n\nBut France's Economy and Finance Minister has an idea: more strictly regulating how data is used by America's Big Tech companies. Politico EU reports/A&gt;:\n\n\"We may strengthen certain administrative requirements or regulate the use of data,\" Lombard said in an interview with Le Journal Du Dimanche. He added that another option could be to \"tax certain activities,\" without being more specific. \nA French government spokesperson already said last week that the EU's retaliation against U.S. tariffs could include \"digital ser",
        "id": 2499525,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/07/018218/as-stocks-and-cryptocurrencies-drop-after-tariffs-france-considers-retaliating-against-us-big-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "As Stocks (and Cryptocurrencies) Drop After Tariffs, France Considers Retaliating Against US Big Tech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T00:45:41+00:00",
        "description": "\"Three Microsoft CEOs walk into a room...\" Satya Nadella posted on X.com, \"and are interviewed by Copilot!\" \n\nAs part of Microsoft's 50th anniversary celebration, Microsoft CEO Nadella joined former Microsoft CEOs Bill Gates and Steve Ballmer in a funny two-minute video (also available on YouTube) in which Nadella asks Copilot for an AI-powered roast of each of them. \n\"All right Satya,\" Copilot answers. \"Let's spice it up...\"\n\nCopilot: Steve, we'll start with you. Your enthusiasm is legendary. But do you ever worry that your energy might short-circuit the AI? I mean, even robots need a coffee break after your pep talks. \nSteve Ballmer: Come on dude! If you can't handle me, you can't handle a huge percentage of the world's population! We're counting on you! \nCopilot: Ha ha, fair point Steve. Now Bill, you've got that signature thoughtful gaze. But do you ever think the AI might feel intimidated by your intense thinking face? I mean, it's like it's waiting for a blue screen moment. \n\nB",
        "id": 2499328,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/06/2335230/microsofts-copilot-roasts-bill-gates-steve-ballmer-and-satya-nadella?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's Copilot Roasts Bill Gates, Steve Ballmer, and Satya Nadella",
        "vote": 0
    }
]