[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T17:01:03+00:00",
        "description": "After skipping last year’s game, the team at Milestone has pushed to reboot the Monster Energy Supercross series into the Unreal Engine 5 era. Does it succeed? Well, I wasn’t particularly impressed, but it’s not a complete dud either. One of the most notable additions are enhanced rut formations on the tracks. \n\nTracks change over time as more bikes ride across sections, forming deep ruts in corners. You feel the difference of these ruts in the loss of bike stability, adding some variety to laps. Unfortunately, the rigid rider movement is largely unchanged from past entries, and turning feels unintuitive and understeery.\n\nThe modes aren’t anything to write home about, with a bare-bones track editor and a Career mode echoing the many EA sports titles over the decades. Still, with a sizable track lineup and better graphics than ever before, this supercross game may delight hardcore fans.",
        "id": 2504956,
        "language": null,
        "link": "https://www.youtube.com/watch?v=x7O8NyKxWzk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/x7O8NyKxWzk/hqdefault.jpg",
        "title": "Monster Energy Supercross 25: The Official Video Game Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T13:30:07+00:00",
        "description": "The DOOM timeline can be pretty confusing, especially with id Software having provided few official and concrete answers to the fanbase’s many, many questions (and especially when you throw DOOM 3 into the mix, though that’s a whole another can of worms)- which means that even though we have a rough idea of the upcoming DOOM: The Dark Ages’ placement in the series’ overarching timeline, there is still that we don’t yet know in terms of the specifics. \n\nWe know that The Dark Ages will be set before 2016’s soft reboot, and we know that it will cover an important part of the Doom Slayer’s past- but in what other specific ways will it be tied to all of its predecessors?",
        "id": 2503009,
        "language": null,
        "link": "https://www.youtube.com/watch?v=AxWbGEo7ygo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AxWbGEo7ygo/hqdefault.jpg",
        "title": "What Is DOOM The Dark Ages’ Timeline Placement?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-07T09:45:03+00:00",
        "description": "We could go on and on about the games that stand as the brightest sparks in the PS3’s impressive library, but as is the case with any console that enjoys persistent and prolonged support, there were just as many games that released for it (if not even more) that did not receive even a fraction of the acclaim and attention that they deserved. \n\nFrom overlooked first party gems and underrated AA diamonds in the rough to unfortunate third party commercial flops and more, there are plenty such titles on the PS3, and here, that’s exactly what we’re going to cover.",
        "id": 2501489,
        "language": null,
        "link": "https://www.youtube.com/watch?v=j4pkg2D--FY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/j4pkg2D--FY/hqdefault.jpg",
        "title": "15 Amazing Single Player PS3 Games YOU TOTALLY IGNORED",
        "vote": 0
    }
]