[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T23:42:20+00:00",
        "description": "Murena has launched the Murena Pixel Tablet, a de-Googled version of the Pixel Tablet that removes Google's apps and services to enhance user privacy. Priced at $549, it offers /e/OS, an alternative app store, and privacy-focused productivity tools, but lacks Google's speaker dock and direct access to the Play Store. The Verge reports: First announced last December, the Murena Pixel Tablet is available now through the company's online store for $549. That's a steep premium given Google currently sells the same 128GB version of the Pixel Tablet for $399, or $479 as part of a bundle with the charging speaker dock that Murena isn't including. Part of Murena's de-Googling of the Pixel Tablet includes the removal of the Google Play Store. You can still download apps through /e/OS' App Lounge which acts as a front-end for the Play Store allowing you to browse and get free apps anonymously without Google knowing who you are. However, downloading paid apps requires a login to a Google accoun",
        "id": 2152554,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/19/2151255/murena-released-a-de-googled-version-of-the-pixel-tablet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Murena Released a De-Googled Version of the Pixel Tablet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T22:34:22+00:00",
        "description": "A recently patched Palo Alto Networks vulnerability (CVE-2025-0108) is being actively exploited alongside two older flaws (CVE-2024-9474 and CVE-2025-0111), allowing attackers to gain root access to unpatched firewalls. The Register reports: This story starts with CVE-2024-9474, a 6.9-rated privilege escalation vulnerability in Palo Alto Networks PAN-OS software that allowed an OS administrator with access to the management web interface to perform actions on the firewall with root privileges. The company patched it in November 2024. Dark web intelligence services vendor Searchlight Cyber's Assetnote team investigated the patch for CVE-2024-9474 and found another authentication bypass.\n \nPalo Alto (PAN) last week fixed that problem, CVE-2025-0108, and rated it a highest urgency patch as the 8.8/10 flaw addressed an access control issue in PAN-OS's web management interface that allowed an unauthenticated attacker with network access to the management web interface to bypass authentica",
        "id": 2152144,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/19/2059256/palo-alto-firewalls-under-attack-as-miscreants-chain-flaws-for-root-access?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Palo Alto Firewalls Under Attack As Miscreants Chain Flaws For Root Access",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T22:34:22+00:00",
        "description": "Valve has made Team Fortress 2's full client and server code public, allowing fans to modify, extend, or rewrite the game as long as their projects remain non-commercial. Game Rant reports: Valve has made Team Fortress 2's server and client code fully public, with the studio encouraging fans to explore the game's files and make it what they want. The game's code is now available thanks to a new update to the Source SDK, which dropped earlier this week. Fans have already been creating TF2 mods for years, but what this essentially means is that fans can make brand-new games. However, there's one catch: any and all TF2 mods must be released for free. \"The majority of items in the game now are thanks to the hard work of the TF2 community.\" Valve wrote. \"To respect that, we're asking TF2 mod makers to continue to respect that connection and not to make mods that have the purpose of trying to profit off Workshop contributors' efforts.\"\n \n\"TF2 mods may be published on the Steam Store, and a",
        "id": 2152143,
        "language": null,
        "link": "https://games.slashdot.org/story/25/02/19/2145217/valve-releases-team-fortress-2-full-client-and-source-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Valve Releases Team Fortress 2 Full Client and Source Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T21:29:50+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: For a while now, many AI researchers have been working to integrate a so-called \"world model\" into their systems. Ideally, these models could infer a simulated understanding of how in-game objects and characters should behave based on video footage alone, then create fully interactive video that instantly simulates new playable worlds based on that understanding. Microsoft Research's new World and Human Action Model (WHAM), revealed today in a paper published in the journal Nature, shows how quickly those models have advanced in a short time. But it also shows how much further we have to go before the dream of AI crafting complete, playable gameplay footage from just some basic prompts and sample video footage becomes a reality.\n \nMuch like Google's Genie model before it, WHAM starts by training on \"ground truth\" gameplay video and input data provided by actual players. In this case, that data comes from Bleeding Edge, a four-on-",
        "id": 2151751,
        "language": null,
        "link": "https://games.slashdot.org/story/25/02/19/2051259/microsoft-shows-progress-toward-real-time-ai-generated-game-worlds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Shows Progress Toward Real-Time AI-Generated Game Worlds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T20:24:42+00:00",
        "description": "France has upped the ante in the quest for fusion power by maintaining a plasma reaction for over 22 minutes -- a new record. From a report: The milestone was reached on February 12 at the Commissariat a lenergie atomique et aux energies alternatives (CEA) WEST Tokamak reactor. \n\nAchieving the dream of commercial fusion power is the Holy Grail of engineering and has been for 80 years. With a single gram of hydrogen isotopes yielding the energy equivalent of 11 tonnes of coal, a practical fusion reactor would hold the promise of unlimited, clean energy for humanity until the end of time. \n\nSmall wonder that billions have been invested by both government and industry in the quest to make fusion power a reality. However, while fusion is relatively easy to achieve in the heart of the sun or in a hydrogen bomb, creating a practical reactor that produces more energy than is put into it is another matter entirely.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpo",
        "id": 2151291,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/19/1922241/france-runs-fusion-reactor-for-record-22-minutes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "France Runs Fusion Reactor For Record 22 Minutes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T20:24:42+00:00",
        "description": "Cameron John Wagenius pleaded guilty to hacking AT&amp;T and Verizon and stealing a massive trove of phone records from the companies, according to court records filed on Wednesday. From a report: Wagenius, who was a U.S. Army soldier, pleaded guilty to two counts of \"unlawful transfer of confidential phone records information\" on an online forum and via an online communications platform. \n\nAccording to a document filed by Wagenius' lawyer, he faces a maximum fine of $250,000 and prison time of up to 10 years for each of the two counts. Wagenius was arrested and indicted last year. In January, U.S. prosecutors confirmed that the charges brought against Wagenius were linked to the indictment of Connor Moucka and John Binns, two alleged hackers whom the U.S. government accused of several data breaches against cloud computing services company Snowflake, which were among the worst hacks of 2024.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://",
        "id": 2151290,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/19/1942232/us-army-soldier-pleads-guilty-to-att-and-verizon-hacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Army Soldier Pleads Guilty To AT&amp;T and Verizon Hacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T19:21:38+00:00",
        "description": "Nikola, the hydrogen-truck maker that briefly sported a market value comparable to Ford Motor, has filed for bankruptcy with plans to wind down its business. From a report: Nikola on Wednesday said that it made the chapter 11 filing with the U.S. Bankruptcy Court in Delaware and that it plans to conduct a court-supervised auction of its assets. \n\nThe Phoenix company said it worked for months with its financial and legal advisers to find a way to sustain its operations before determining that a structured sale process was the best way to maximize the value of its assets.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nikola+Files+for+Bankruptcy+With+Plans+To+Sell+Assets%2C+Wind+Down%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F19%2F1459220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.p",
        "id": 2150796,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/19/1459220/nikola-files-for-bankruptcy-with-plans-to-sell-assets-wind-down?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nikola Files for Bankruptcy With Plans To Sell Assets, Wind Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T18:14:32+00:00",
        "description": "Apple has launched the iPhone 16E, featuring a 6.1-inch OLED display, Face ID, an A18 chipset, USB-C, 48MP camera, and support for Apple Intelligence. Gone but not forgotten: the home button, Touch ID and 64GB of base storage. The Verge reports: The 16E includes the customizable Action Button, but not the new Camera Control you'll find on the 16 series. It does swap its Lightning port for USB-C, now a requirement for the phone to be sold in the EU. On the inside, there's an A18 chipset, the same chip as the iPhone 16. That makes the 16E powerful enough to run Apple Intelligence, the suite of AI tools that includes notification summaries. Even the non-Pro iPhone 15 can't do that, so the 16E is one of the most capable iPhones out there. Apple has previously confirmed that 8GB RAM was the minimum to get Apple Intelligence support in the iPhone 16 series, so it's likely that the 16E also boasts at least that much memory. It's also been bumped to a baseline of 128GB of storage, meaning th",
        "id": 2150159,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/02/19/1658240/apple-launches-the-iphone-16e-with-in-house-modem-and-support-for-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Launches the iPhone 16E, With In-House Modem and Support For AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T18:14:32+00:00",
        "description": "After two decades of quantum computing research, Microsoft has unveiled its first quantum chip: the Majorana 1. CNBC reports: Microsoft's quantum chip employs eight topological qubits using indium arsenide, which is a semiconductor, and aluminum, which is a superconductor. A new paper in the journal Nature describes the chip in detail. Microsoft won't be allowing clients to use its Majorana 1 chip through the company's Azure public cloud, as it plans to do with its custom artificial intelligence chip, Maia 100. Instead, Majorana 1 is a step toward a goal of a million qubits on a chip, following extensive physics research.\n \nRather than rely on Taiwan Semiconductor or another company for fabrication, Microsoft is manufacturing the components of Majorana 1 itself in the U.S. That's possible because the work is unfolding at a small scale. \"We want to get to a few hundred qubits before we start talking about commercial reliability,\" Jason Zander, a Microsoft executive vice president, tol",
        "id": 2150160,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/19/1651235/microsoft-reveals-its-first-quantum-computing-chip-the-majorana-1?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Reveals Its First Quantum Computing Chip, the Majorana 1",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T17:09:28+00:00",
        "description": "AI hardware startup Humane -- which has been acquired by HP -- has given its users just ten days notice that their Pins will be disconnected. From a report: In a note to its customers, the company said AI Pins will \"continue to function normally\" until 12PM PT on February 28. On that date, users will lose access to essentially all of their device's features, including but not limited to calling, messaging, AI queries and cloud access. The FAQ does note that you'll still be able to check on your battery life, though. \n\nHumane is encouraging its users to download any stored data before February 28, as it plans on permanently deleting \"all remaining customer data\" at the same time as switching its servers off.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=All+of+Humane's+AI+Pins+Will+Stop+Working+in+10+Days%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F19%2F1217252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter",
        "id": 2149575,
        "language": null,
        "link": "https://slashdot.org/story/25/02/19/1217252/all-of-humanes-ai-pins-will-stop-working-in-10-days?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "All of Humane's AI Pins Will Stop Working in 10 Days",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T17:09:28+00:00",
        "description": "Microsoft has placed its new AI-powered text rewrite feature in Notepad behind a subscription paywall, requiring users to have a Microsoft 365 Personal or Family plan to access the functionality. While the core text editor remains free and accessible without a Microsoft account, the AI feature requires users to sign in and have sufficient \"AI credits\" included in their subscription.Users can disable the feature and hide its icon if they choose not to subscribe.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Puts+Notepad's+AI+Rewrite+Feature+Behind+Paywall%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F19%2F1356215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F19%2F1356215%2Fmicrosoft-puts-notepads-ai-rewrite-feature-behind-paywall",
        "id": 2149576,
        "language": null,
        "link": "https://slashdot.org/story/25/02/19/1356215/microsoft-puts-notepads-ai-rewrite-feature-behind-paywall?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Puts Notepad's AI Rewrite Feature Behind Paywall",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T16:01:45+00:00",
        "description": "Apple has told Britain's competition regulator that some of the remedy options proposed by the watchdog to address concerns in the mobile browser market would impact the iPhone maker's incentive to innovate. From a report: The responses from Apple and Google to the regulator's investigation in the supply of mobile browsers and browser engines and the distribution of cloud gaming services through app stores on mobile devices in the country were published on the government website on Wednesday.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Says+UK+Regulator's+Remedy+Options+on+Mobile+Browsers+Will+Hit+Innovation%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F02%2F19%2F1349205%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F02%2F19%2F13",
        "id": 2148926,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/19/1349205/apple-says-uk-regulators-remedy-options-on-mobile-browsers-will-hit-innovation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Says UK Regulator's Remedy Options on Mobile Browsers Will Hit Innovation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T14:54:20+00:00",
        "description": "Leading AI models can fix broken code, but they're nowhere near ready to replace human software engineers, according to extensive testing [PDF] by OpenAI researchers. The company's latest study put AI models and systems through their paces on real-world programming tasks, with even the most advanced models solving only a quarter of typical engineering challenges. \n\nThe research team created a test called SWE-Lancer, drawing from 1,488 actual software fixes made to Expensify's codebase, representing $1 million worth of freelance engineering work. When faced with these everyday programming tasks, the best AI model &#226;\" Claude 3.5 Sonnet -- managed to complete just 26.2% of hands-on coding tasks and 44.9% of technical management decisions. \n\nThough the AI systems proved adept at quickly finding relevant code sections, they stumbled when it came to understanding how different parts of software interact. The models often suggested surface-level fixes without grasping the deeper implica",
        "id": 2148309,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/02/19/1212257/ai-can-write-code-but-lacks-engineers-instinct-openai-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Can Write Code But Lacks Engineer's Instinct, OpenAI Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T14:54:20+00:00",
        "description": "Google has built an AI laboratory assistant to help scientists accelerate biomedical research [non-paywalled source], as companies race to create specialised applications from the cutting-edge technology. From a report: The US tech group's so-called co-scientist tool helps researchers identify gaps in their knowledge and propose new ideas that could speed up scientific discovery. \"What we're trying to do with our project is see whether technology like the AI co-scientist can give these researchers superpowers,\" said Alan Karthikesalingam, a senior staff clinician scientist at Google. \n\n[...] Early tests of Google's new tool with experts from Stanford University, Imperial College London and Houston Methodist hospital found it was able to generate scientific hypotheses that showed promising results. The tool was able to reach the same conclusions -- for a novel gene transfer mechanism that helps scientists understand the spread of antimicrobial resistance -- as a new breakthrough from ",
        "id": 2148308,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/19/1433205/google-builds-ai-co-scientist-tool-to-speed-up-research?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Builds AI 'Co-Scientist' Tool To Speed Up Research",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T13:49:10+00:00",
        "description": "An anonymous reader quotes a report from Bloomberg: Niantic, the company behind the 2016 hit Pokemon Go, is in talks to sell its video-game business to Saudi Arabia-owned Scopely, according to several people familiar with the discussions. A deal could be announced in coming weeks. The price being discussed is about $3.5 billion, according to one of the people. Any agreement would involve the Pokemon title as well as other mobile games, according to the people, who asked not to be identified because the discussions are private. There's no assurance an agreement will be reached.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='Pokemon+Go'+Maker+Nears+%243.5+Billion+Deal+To+Sell+Games+Unit%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F02%2F19%2F059211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/shar",
        "id": 2147836,
        "language": null,
        "link": "https://games.slashdot.org/story/25/02/19/059211/pokemon-go-maker-nears-35-billion-deal-to-sell-games-unit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Pokemon Go' Maker Nears $3.5 Billion Deal To Sell Games Unit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T10:34:18+00:00",
        "description": "Microsoft is reminding IT administrators that WSUS driver synchronization will be deprecated on April 18, 2025, urging them to transition to cloud-based update solutions like Windows Autopatch, Azure Update Manager, and Microsoft Intune. \"For on-premises contexts, drivers will be available on the Microsoft Update catalog, but you won't be able to import them into WSUS,\" the company said in a Windows message center update on Tuesday. \"You'll need to use any of the available alternative solutions, such as Device Driver Packages, or transition to cloud-based driver services for your organization, such as Microsoft Intune and Windows Autopatch.\" BleepingComputer reports: This reminder follows two other warnings issued since June 2024, announcing the deprecation of WSUS driver synchronization and encouraging customers to adopt Redmond's newer cloud-based driver services. The company also revealed in September 2024 that WSUS had been deprecated, but Microsoft added that it plans to keep pu",
        "id": 2146518,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/19/055211/microsoft-reminds-admins-to-prepare-for-wsus-driver-sync-deprecation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Reminds Admins To Prepare For WSUS Driver Sync Deprecation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T07:18:44+00:00",
        "description": "Late Tuesday afternoon, the White House confirmed that it would not proceed with laying off more than 1,000 probationary employees at NASA. \"NASA had sought exemptions for all of these employees, who comprise about 6 percent of NASA's workforce,\" notes Ars Technica. \"The Trump administration has sought to fire federal employees at several federal agencies who are in the 'probationary' period of their employment. This includes new hires within the last one or two years or long-time employees who have moved into or been promoted into a new position.\" From the report: It was not immediately clear why. A NASA spokesperson in Washington, DC, offered no comment on the updated guidance. Two sources indicated that it was plausible that private astronaut Jared Isaacman, whom President Trump has nominated to lead the space agency, asked for the cuts to be put on hold.\n \nAlthough this could not be confirmed, it seems reasonable that Isaacman would want to retain some control over where cuts at ",
        "id": 2145743,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/19/0458222/in-a-last-minute-decision-white-house-decides-not-to-terminate-nasa-employees?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "In a Last-Minute Decision, White House Decides Not To Terminate NASA Employees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T04:03:35+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Astronomers have detected over 5,800 confirmed exoplanets. One extreme class is ultra-hot Jupiters, of particular interest because they can provide a unique window into planetary atmospheric dynamics. According to a new paper published in the journal Nature, astronomers have mapped the 3D structure of the layered atmosphere of one such ultra-hot Jupiter-size exoplanet, revealing powerful winds that create intricate weather patterns across that atmosphere. A companion paper published in the journal Astronomy and Astrophysics (PDF) reported on the unexpected identification of titanium in the exoplanet's atmosphere as well. [...]\n \nThis latest research relied on observational data collected by the European South Observatory's (ESO) Very Large Telescope, specifically, a spectroscopic instrument called ESPRESSO that can process light collected from the four largest VLT telescope units into one signal. The target exoplanet, WASP-121b -",
        "id": 2145015,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/19/0058237/3d-map-of-exoplanet-atmosphere-shows-wacky-climate?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "3D Map of Exoplanet Atmosphere Shows Wacky Climate",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T02:58:24+00:00",
        "description": "Nvidia has confirmed on its forums that the RTX 50 series GPUs no longer support 32-bit PhysX. Tom's Hardware reports: As far as we know, there are no 64-bit games with integrated PhysX technology, thus terminating the tech entirely on RTX 50 series GPUs and newer. RTX 40 series and older will still be able to run 32-bit CUDA applications and thus PhysX, but regardless, the technology is now officially retired, starting with Blackwell. [...]\n \nThe only way now to run PhysX on RTX 50 series GPUs (or newer) is to install a secondary RTX 40 series or older graphics card and slave it to PhysX duty in the Nvidia control panel. As far as we are aware, Nvidia has not disabled this sort of functionality. But the writing is on the wall for PhysX, and we doubt there will be any future games that attempt to use the API.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nvidia+Ends+32-Bit+CUDA+App+Support+For+GeForce+RTX+50+Serie",
        "id": 2144825,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/19/0038255/nvidia-ends-32-bit-cuda-app-support-for-geforce-rtx-50-series?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia Ends 32-Bit CUDA App Support For GeForce RTX 50 Series",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T01:54:09+00:00",
        "description": "Valve removed the game PirateFi from Steam after discovering it was laced with the Vidar infostealer malware, designed to steal sensitive user data such as passwords, cookies, cryptocurrency wallets, and more. TechCrunch reports: Marius Genheimer, a researcher who analyzed the malware and works at SECUINFRA Falcon Team, told TechCrunch that judging by the command and control servers associated with the malware and its configuration, \"we suspect that PirateFi was just one of multiple tactics used to distribute Vidar payloads en masse.\" \"It is highly likely that it never was a legitimate, running game that was altered after first publication,\" said Genheimer. In other words, PirateFi was designed to spread malware.\n \nGenheimer and colleagues also found that PirateFi was built by modifying an existing game template called Easy Survival RPG, which bills itself as a game-making app that \"gives you everything you need to develop your own singleplayer or multiplayer\" game. The game maker co",
        "id": 2144550,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/19/0031255/hackers-planted-a-steam-game-with-malware-to-steal-gamers-passwords?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hackers Planted a Steam Game With Malware To Steal Gamers' Passwords",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T01:54:09+00:00",
        "description": "Meta's WhatsApp messaging service has surpassed 45 million users, earning the designation of a \"Very Large Online Platform\" under the EU's Digital Services Act. Bloomberg reports: WhatsApp's open channels, which are feeds affiliated with news outlets or public figures that under the DSA are comparable to a social network, averaged about 46.8 million monthly average users in the second half of 2024, Meta said in a filing on Feb. 14 that hasn't previously been reported. [...] The DSA content moderation rulebook imposes stricter requirements on very large online platforms, defined as those whose EU-based monthly active users exceed 45 million. Users of WhatsApp's core messaging feature do not count toward the designation under the DSA.\n \nThe commission would still need to rule that WhatsApp should be included in the more regulated tier. Under the DSA, very large online platforms must carry out risk assessments on the spread of illegal or harmful content, and put in place a mitigation st",
        "id": 2144551,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/19/0017218/whatsapp-faces-tougher-eu-rules-as-users-top-45-million?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WhatsApp Faces Tougher EU Rules As Users Top 45 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T00:48:35+00:00",
        "description": "Google has gained permission to sell its e-books and audiobooks directly to customers through its iOS app, Google Play Books. From a report: While iOS apps today can offer access to content previously purchased elsewhere, like e-books bought via a website, developers have to request a specific exception to link their iOS app's users to the company's own website to make purchases. According to a brief post on Google's blog, users will now be able to click on a new \"Get book\" button in the Google Play Books iOS app which will take them to the Google Play website to complete their e-book or audiobook purchase. \n\nFrom there, users will be able to see their recently opened book listings and complete a purchase using their Google Account and saved payment information. By processing the transaction on its own website, Google can avoid paying Apple a commission (generally 30%) on in-app purchases of digital content.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashp",
        "id": 2144243,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/18/2158214/google-play-books-purchases-on-ios-now-skirt-the-app-stores-commission?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Play Books Purchases on iOS Now Skirt the App Store's Commission",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T00:48:35+00:00",
        "description": "Former OpenAI CTO Mira Murati has launched Thinking Machines Lab with several leaders from OpenAI on board, including John Schulman, Barrett Zoph, and Jonathan Lachman. Their mission is \"to make AI systems more widely understood, customizable, and generally capable,\" with a commitment to publishing technical research and code. The Verge reports: In a press release shared with The Verge, the company suggests that it's building products that help humans work with AI, rather than fully autonomous systems. \"We're building a future where everyone has access to the knowledge and tools to make AI work for their unique needs and goals,\" says the press release.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Mira+Murati+Is+Launching+Her+OpenAI+Rival%3A+Thinking+Machines+Lab%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F18%2F2235256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_",
        "id": 2144244,
        "language": null,
        "link": "https://slashdot.org/story/25/02/18/2235256/mira-murati-is-launching-her-openai-rival-thinking-machines-lab?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mira Murati Is Launching Her OpenAI Rival: Thinking Machines Lab",
        "vote": 0
    }
]