[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T17:30:11+00:00",
        "description": "Silent Hill has come back from the dead and Metal Gear is also finally rising from its grave- but those two aren’t the only Konami franchises on the comeback trail. \n\nLong has the beloved turn based RPG series Suikoden been slumbering, but thankfully, it, too, is on the verge of returning to the limelight. Suikoden 1 and 2 HD Remaster has been cooking for a while, and soon, it’ll bring the original two classics to current hardware with new bells and whistles, from quality of life upgrades and visual enhancements to audio improvements and more. \n\nAs we count the days down to the Suikoden I & II HD Remaster Gate Rune and Dunan Unification Wars launch, here, we will be talking about all of that and more.",
        "id": 2150201,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cTHWjp1Nxvc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cTHWjp1Nxvc/hqdefault.jpg",
        "title": "Suikoden 1 and 2 HD Remaster – 15 Things You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T15:30:27+00:00",
        "description": "2025 is shaping up to be a banner year for the racing games genre. Whilst we haven’t got official news on Forza Horizon 6 nor the next Need for Speed game, we expect we’ll see something this year alongside the return of Mario Kart with flashes of its ninth entry appearing in Nintendo’s Switch 2 announcement trailer. \n\nEven without those sure-fire hits, 2025 is still promising a host of excellent entries to keep any type of racing fanatic happy. There’re numerous boundary pushing simulations seeing the light of day this year, alongside more arcade-orientated entries encompassing wacky destruction and chaotic karting. A couple of reboots including not one, but two celebrations of Japanese car culture make the cut for this rundown too.",
        "id": 2148966,
        "language": null,
        "link": "https://www.youtube.com/watch?v=us9-bGcudnc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/us9-bGcudnc/hqdefault.jpg",
        "title": "Top 15 NEW Racing Games of 2025 And Beyond",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-19T10:30:08+00:00",
        "description": "Every new Assassin’s Creed game since 2017's Origins brings new things to the table- a new setting, new protagonists, new mechanics and takes on a familiar formula. \n\nThe upcoming Assassin’s Creed Shadows is, of course, planning to do the same. In fact, it’s looking like it’s going to change things up for what has been the series’ core formula for several years now in some pretty notable ways. \n\nFrom combat and traversal to stealth, exploration, progression, and more, Assassin’s Creed Shadows is looking like it is going to set itself apart from Assassin’s Creed Valhalla – the series’ last mainline entry, barring 2023’s sidequel Mirage – in more ways than one. Join us as we discuss just that.",
        "id": 2146538,
        "language": null,
        "link": "https://www.youtube.com/watch?v=A7gHHNAGks8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/A7gHHNAGks8/hqdefault.jpg",
        "title": "Assassin's Creed Shadows vs. Assassin's Creed Valhalla - 15 BIGGEST DIFFERENCES You May Not Know",
        "vote": 0
    }
]