[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T18:47:19.363164+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T18:34:00+00:00",
        "description": "Bloomberg reports:\n\n\nBy the time Jessica Lindsey's customers accuse her of being an AI, they are often already shouting. For the past two years, her work as a call center agent for outsourcing company Concentrix has been punctuated by people at the other end of the phone demanding to speak to a real human. Sometimes they ask her straight, 'Are you an AI?' Other times they just start yelling commands: 'Speak to a representative! Speak to a representative...!' Skeptical customers are already frustrated from dealing with the automated system that triages calls before they reach a person. So when Lindsey starts reading from her AmEx-approved script, callers are infuriated by what they perceive to be another machine. \"They just end up yelling at me and hanging up,\" she said, leaving Lindsey sitting in her home office in Oklahoma, shocked and sometimes in tears. \"Like, I can't believe I just got cut down at 9:30 in the morning because they had to deal with the AI before they got to me....\" ",
        "id": 3043497,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/28/1740215/call-center-workers-are-tired-of-being-mistaken-for-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Call Center Workers Are Tired of Being Mistaken for AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T17:41:03.098193+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T17:34:00+00:00",
        "description": "\"A second major academic institution has accused Uber of using opaque computer code to dramatically increase its profits at the expense of the ride-hailing app's drivers and passengers,\" reports the Guardian:\n\n\nResearch by academics at New York's Columbia Business School concluded that the Silicon Valley company had implemented \"algorithmic price discrimination\" that had raised \"rider fares and cut driver pay on billions of ... trips, systematically, selectively, and opaquely\". The Ivy League business school research &mdash; which is based on an analysis of \"tens of thousands of trips ... as well as an analysis of over 2 million ... trip requests\" &mdash; follows a similar academic paper based on 1.5m UK trips that was published last week by the University of Oxford. The British study found that many UK Uber drivers were making \"substantially less\" each hour since the ride-hailing app introduced a \"dynamic pricing\" algorithm in 2023 that coincided with the company taking a significant",
        "id": 3043187,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/28/0427240/researchers-accuse-uber-of-using-opaque-algorithm-to-dramatically-boost-its-profits?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Accuse Uber of Using Opaque Algorithm To Dramatically Boost Its Profits",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T17:41:03.310592+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T16:34:00+00:00",
        "description": "An anonymous reader shared this report from WebProNews:\nThe Linux world is abuzz with news of XLibre, a fork of the venerable X11 window display system, which aims to be an alternative to X11's successor, Wayland. \nMuch of the Linux world is working to adopt Wayland, the successor to X11. Wayland has been touted as being a superior option, providing better security and performance. Despite Fedora and Ubuntu both going Wayland-only, the newer display protocol still lags behind X11, in terms of functionality, especially in the realm of accessibility, screen recording, session restore, and more. In addition, despite the promise of improved performance, many users report performance regressions compared to X11. \nWhile progress is being made, it has been slow going, especially for a project that is more than 17 years old. To make matters worse, Wayland is largely being improved by committee, with the various desktop environment teams trying to work together to further the protocol. Progres",
        "id": 3043188,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/06/28/054245/x11-fork-xlibre-released-for-testing-on-systemd-free-artix-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "X11 Fork XLibre Released For Testing On Systemd-Free Artix Linux",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T16:37:09.210044+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T15:34:00+00:00",
        "description": "After past damage to undersea cables, Denmark will boost their surveillance of Baltic Sea/North Sea waters by deploying four uncrewed surface vessels &mdash; about 10 meters long &mdash; that are equipped with drones and also AI, reports Euronews. \n\nThe founder/CEO of the company that makes the vessels &mdash; Saildrone &mdash; says they'll work \"like a truck\" that \"carries the sensors.\" And then \"we use on-board sophisticated machine learning and AI to fuse that data to give us a full picture of what's above and below the surface.\"\nPowered by solar and wind energy, they can operate autonomously for months at sea. [Saildrone] said the autonomous sailboats can support operations such as illegal fishing detection, border enforcement, and strategic asset protection... The four \"Voyagers\" will be first in operation for a three-month trial, as Denmark and NATO allies aim at extending maritime presence, especially around critical undersea infrastructure such as fibre optic cables and power ",
        "id": 3042827,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/28/047250/how-a-crewless-ai-enhanced-vessel-will-patrol-denmarks-and-natos-waters?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How a Crewless, AI-Enhanced Vessel Will Patrol Denmark's and NATO's Waters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T15:31:53.015593+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T14:34:00+00:00",
        "description": "\"Mercedes-AMG is transitioning away from the four-cylinder plug-in hybrid powertrain,\" reports Car and Driver, \"and back towards the inline-six and V-8 powertrains more traditionally associated with the brand.\"\n\nThat isn't to say that AMG had a change of heart concerning the merits of the four-cylinder powertrain, but rather that the automaker is responding to customer criticisms. \"Technically, the four-cylinder is one of the most advanced drivetrains available in a production car. It's also right up there on performance. But despite this, it failed to resonate with our traditional customers. We've recognized that,\" a source at Mercedes told Autocar... \nCar and Driver also spoke with AMG chief Michael Schiebe at the reveal of the AMG GT XX electric concept car... Although the four-cylinder may be on its way out, Schiebe did say AMG remains committed to plug-in hybrids. \"There are a lot of advantages of combining electric motors with combustion engines,\" Schiebe said. \"We want to offer",
        "id": 3042519,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/28/0342219/mercedes-amg-to-drop-four-cylinder-for-inline-sixes-and-v-8s?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mercedes-AMG to Drop Four-Cylinder for Inline-Sixes and V-8s",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T13:21:56.913625+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Tuesday, software engineer Doug Brown published his discovery of how to trigger a long-known but previously inaccessible Easter egg in the Power Mac G3's ROM: a hidden photo of the development team that nobody could figure out how to display for 27 years. While Pierre Dandumont first documented the JPEG image itself in 2014, the method to view it on the computer remained a mystery until Brown's reverse engineering work revealed that users must format a RAM disk with the text \"secret ROM image.\"\n \nBrown stumbled upon the image while using a hex editor tool called Hex Fiend with Eric Harmon's Mac ROM template to explore the resources stored in the beige Power Mac G3's ROM. The ROM appeared in desktop, minitower, and all-in-one G3 models from 1997 through 1999. \"While I was browsing through the ROM, two things caught my eye,\" Brown wrote. He found both the HPOE resource containing the JPEG image of team members and a suspicious se",
        "id": 3041780,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/27/2358259/after-27-years-engineer-discovers-how-to-display-secret-photo-in-power-mac-rom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "After 27 Years, Engineer Discovers How To Display Secret Photo In Power Mac ROM",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T12:16:58.851283+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T12:00:00+00:00",
        "description": "The Canadian government has ordered Chinese surveillance camera manufacturer Hikvision to cease operations in Canada over national security concerns, Industry Minister Melanie Joly said late on Friday. From a report: Hikvision, also known as Hangzhou Hikvision Digital Technology Co, has faced numerous sanctions and restrictions by Canada's neighbor, the United States, over the past five and a half years for the firm's dealings and the use of its equipment in China's Xinjiang region, where rights groups have documented abuses against the Uyghur population and other Muslim communities. \n\n\"The government has determined that Hikvision Canada's continued operations in Canada would be injurious to Canada's national security,\" Joly said on X, adding that the decision was taken after a multi-step review of information provided by Canada's security and intelligence community.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=C",
        "id": 3041474,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/28/0439206/canada-orders-chinese-firm-hikvision-to-cease-canadian-operations-over-national-security-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Canada Orders Chinese Firm Hikvision To Cease Canadian Operations Over National Security Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T10:07:05.314813+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T10:00:00+00:00",
        "description": "Graphic artists in China are pushing back against AI image generators, which they say \"profoundly shifts clients' perception of their work, specifically in terms of how much that work costs and how much time it takes to produce,\" reports The Verge. \"Freelance artists or designers working in industries with clients that invest in stylized, eye-catching graphics, like advertising, are particularly at risk.\" From the report: Long before AI image generators became popular, graphic designers at major tech companies and in-house designers for large corporate clients were often instructed by managers to crib aesthetics from competitors or from social media, according to one employee at a major online shopping platform in China, who asked to remain anonymous for fear of retaliation from their employer. Where a human would need to understand and reverse engineer a distinctive style to recreate it, AI image generators simply create randomized mutations of it. Often, the results will look like o",
        "id": 3040821,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/27/2343245/graphics-artists-in-china-push-back-on-ai-and-its-averaging-effect?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Graphics Artists In China Push Back On AI and Its Averaging Effect",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T09:01:53.101955+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T08:01:00+00:00",
        "description": "Japanese politicians failed to pass legislation last month that would have allowed married couples to keep separate surnames, despite surveys showing majority public support for the change. Japan remains the only country requiring married couples by law to share the same surname, with women taking their husband's name in 95% of cases. \n\nThe ruling Liberal Democratic Party's skepticism blocked opposition bills aimed at reforming the system. Keidanren, Japan's largest business lobby, says the current law \"hinders women's advancement\" as name changes complicate professional reputations. A study by NGO Asuniwa suggests reform could prompt 590,000 cohabiting couples to marry legally, potentially boosting Japan's birth rate since strong stigmas discourage births outside marriage. \n\nSome couples have developed workarounds. Teachers Uchiyama Yukari and Koike Yukio have divorced and remarried three times to sidestep the law, living unmarried most of the time but remarrying for each child's bir",
        "id": 3040562,
        "language": null,
        "link": "https://slashdot.org/story/25/06/27/2354246/japans-civil-war-over-surnames?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan's Civil War Over Surnames",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T07:56:58.771103+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T07:00:00+00:00",
        "description": "Seven people have now received Neuralink's N1 brain implant, which enables individuals with ALS or spinal cord injuries to control a computer with their thoughts. PCMag reports: In a February 2025 update, Neuralink confirmed that three people had received its brain-computer interface (BCI). That increased to five by June, when it also reported a $650 million funding round. We're now at seven, Barrow tweeted today; Neuralink retweeted that message.\n \nSix of the seven are participating in the PRIME study, conducted by Barrow, which handles the implantations from its Phoenix, Arizona, office. It aims to prove that the N1 implant, the R1 surgical robot, and the N1 User App on the computer are safe and effective, according to the program brochure. (No BCIs have been approved by the US Food and Drug Administration.)\n \nParticipants in the study get the implant through a surgery in which a custom-built robotic arm drills a hole in their skull and implants the device. The implant connects to a",
        "id": 3040307,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/27/2353222/7-people-now-have-neuralink-brain-implant?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "7 People Now Have Neuralink Brain Implant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T03:36:52.894770+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: The Danish government is to clamp down on the creation and dissemination of AI-generated deepfakes by changing copyright law to ensure that everybody has the right to their own body, facial features and voice. The Danish government said on Thursday it would strengthen protection against digital imitations of people's identities with what it believes to be the first law of its kind in Europe. Having secured broad cross-party agreement, the department of culture plans to submit a proposal to amend the current law for consultation before the summer recess and then submit the amendment in the autumn. It defines a deepfake as a very realistic digital representation of a person, including their appearance and voice.\n \nThe Danish culture minister, Jakob Engel-Schmidt, said he hoped the bill before parliament would send an \"unequivocal message\" that everybody had the right to the way they looked and sounded. He told the Guardian: \"In the ",
        "id": 3039506,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/27/2050240/denmark-to-tackle-deepfakes-by-giving-people-copyright-to-their-own-features?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark To Tackle Deepfakes By Giving People Copyright To Their Own Features",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T02:32:31.261661+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T01:40:00+00:00",
        "description": "Tech companies Google and Palo Alto Networks are sounding the alarm over the \"Scattered Spider\" hacking group's interest in the aviation sector. From a report: In a statement posted on LinkedIn, Sam Rubin, an executive at Palo Alto's cybersecurity-focused Unit 42, said his company had \"observed Muddled Libra (also known as Scattered Spider) targeting the aviation industry.\" \n\nIn a similar statement, Charles Carmakal, an executive with Alphabet-owned Google's cybersecurity-focused Mandiant unit, said his company was \"aware of multiple incidents in the airline and transportation sector which resemble the operations of UNC3944 or Scattered Spider.\" Axios adds: The group of mostly Western, English-speaking hackers has been on a months-long spree that's prompted operational disruptions at grocery suppliers, major retail storefronts and insurance companies in the U.S. and U.K. \n\nHawaiian Airlines said Thursday it's addressing a \"cybersecurity incident\" that affected some of its IT systems. ",
        "id": 3039322,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/27/2347206/tech-firms-warn-scattered-spider-hacks-are-targeting-aviation-sector?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tech Firms Warn 'Scattered Spider' Hacks Are Targeting Aviation Sector",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T01:27:26.039194+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T01:00:00+00:00",
        "description": "Steven J. Vaughan-Nichols writes in an opinion piece for The Register: Microsoft, tactically admitting it has failed at talking all the Windows 10 PC users into moving to Windows 11 after all, is -- sort of, kind of -- extending Windows 10 support for another year. For most users, that means they'll need to subscribe to Microsoft 365. This, in turn, means their data and meta-information will be kept in a US-based datacenter. That isn't sitting so well with many European Union (EU) organizations and companies. It doesn't sit that well with me or a lot of other people either.\n \nA few years back, I wrote in these very pages that Microsoft didn't want you so much to buy Windows as subscribe to its cloud services and keep your data on its servers. If you wanted a real desktop operating system, Linux would be almost your only choice. Nothing has changed since then, except that folks are getting a wee bit more concerned about their privacy now that President Donald Trump is in charge of the ",
        "id": 3039141,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/06/27/2326226/the-year-of-the-eu-linux-desktop-may-finally-arrive?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'The Year of the EU Linux Desktop May Finally Arrive'",
        "vote": 0
    }
]