[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T16:00:29.931234+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T15:30:22+00:00",
        "description": "No Man’s Sky is one of modern gaming’s finest recovery stories. Every addition to this very ambitious behemoth has made use of its core mechanics in meaningful ways, allowing the game to evolve at every stage of its shelf life. \n\nHello Games’ smart use of current-gen capabilities has allowed its flagship title to stay at the top of its game over the years - and also occupy a fond place in its players’ hearts. Hello Games has achieved a balance between storytelling and gameplay that other developers have tried to emulate while allowing it to go from strength to strength. \n\nIt’s a momentum that the studio will hope to sustain as it undertakes a new journey with Light No Fire.",
        "id": 3042558,
        "language": null,
        "link": "https://www.youtube.com/watch?v=TOFKt4fG4JU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TOFKt4fG4JU/hqdefault.jpg",
        "title": "The UNBELIEVABLE Recovery of No Man's Sky Is One For The History Books",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T13:50:32.082701+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T13:30:18+00:00",
        "description": "Any title with the size, scale and narrative weight of Death Stranding 2: On the Beach will offer numerous secrets and discoveries. With the sequel now available, however, we can see the full extent of a new Hideo Kojima title, built from the ground up for PS5.\n\nDust storms open up new possibilities for realism, including dust settling on characters and objects and realistically washing off. Character models and facial animations are on a different level, and that's even when compared to the original. Meanwhile, the environments are nearly indistinguishable from real life, whether you're scaling the nearest mountain or walking through the desert. Then there are the particle effects, which you must see to appreciate.\n\nAnd that's before getting into all the little touches that Kojima Productions has added, from the signature (and bizarre) birthday wish from the cast to the sweet dreams that Sam can have. Check out 15 amazing details that you should know about in Death Stranding 2: On th",
        "id": 3041854,
        "language": null,
        "link": "https://www.youtube.com/watch?v=CMS1-iWIc0M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CMS1-iWIc0M/hqdefault.jpg",
        "title": "15 STUNNING Details In Death Stranding 2 You Didn't Notice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-28T09:30:33.167728+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-28T09:30:04+00:00",
        "description": "Gaming is full of incredible trilogies, whether it's Mass Effect or Gears of War. However, the undisputed king among superhero-focused trilogies is undoubtedly Rocksteady's Batman Arkham series. Batman: Arkham Asylum proved that an incredible game was possible with a licensed hero, and Arkham City took that to the next level.\n\nBatman: Arkham Knight, which celebrates its 10th anniversary, is an interesting case. Developed from the ground up for Xbox One and PS4, it nevertheless faced numerous problems on PC. The Batmobile, a major gameplay addition, would receive a mixed response, particularly in the abundance of vehicular combat. Its ending also left something to be desired.\n\nHowever, in terms of gameplay, visual fidelity, traversal and many aspects of its world design, Batman: Arkham Knight was as enjoyable as its predecessors, if not superior in some ways. Despite the sheer boatload of expectations, it delivered a thunderous conclusion to the Dark Knight's journey and served as the ",
        "id": 3040584,
        "language": null,
        "link": "https://www.youtube.com/watch?v=6WciTZVI7lk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6WciTZVI7lk/hqdefault.jpg",
        "title": "Batman Arkham Knight Review - 10 YEARS LATER",
        "vote": 0
    }
]