[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T23:34:06.796039+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T22:45:00+00:00",
        "description": "\"Linus Torvalds has used his authority to reject the RISC-V architecture changes for the Linux 6.17 kernel,\" reports Phoronix:\n\nOnly on Friday were the RISC-V code updates submitted for the Linux 6.17 merge window. The Linux 6.17 merge window is expected to wrap up on Sunday with the Linux 6.17-rc1 release... [T]his pull request has been rejected by Linus Torvalds for Linux 6.17 on the basis of being late in the merge window especially with his international travels this week being known. And he's unhappy with some of the code included as part of this merge request. . \n\nHere's the text of Torvalds' response... \n\n\n&gt; RISC-V Patches for the 6.17 Merge Window, Part 1 \n\nNo. This is garbage and it came in too late. I asked for early pull requests because I'm traveling, and if you can't follow that rule, at least make the pull requests *good*. \nThis adds various garbage that isn't RISC-V specific to generic header files. \n\nAnd by \"garbage\" I really mean it. This is stuff that nobody shoul",
        "id": 3293472,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/08/09/2147224/linus-torvalds-rejects-risc-v-changes-for-linux-617-for-being-late-and-garbage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linus Torvalds Rejects RISC-V Changes For Linux 6.17 For Being Late and 'Garbage'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T22:29:49.520981+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T21:45:00+00:00",
        "description": "\"Heather Adkins, Google's vice president of security, announced Monday that its LLM-based vulnerability researcher Big Sleep found and reported 20 flaws in various popular open source software,\" reports TechCrunch:\n\nAdkins said that Big Sleep, which is developed by the company's AI department DeepMind as well as its elite team of hackers Project Zero, reported its first-ever vulnerabilities, mostly in open source software such as audio and video library FFmpeg and image-editing suite ImageMagick. [There's also a \"medium impact\" issue in Redis] \n\nGiven that the vulnerabilities are not fixed yet, we don't have details of their impact or severity, as Google does not yet want to provide details, which is a standard policy when waiting for bugs to be fixed. But the simple fact that Big Sleep found these vulnerabilities is significant, as it shows these tools are starting to get real results, even if there was a human involved in this case. \n\n\"To ensure high quality and actionable reports, ",
        "id": 3293208,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/09/1947230/google-says-its-ai-based-bug-hunter-found-20-security-vulnerabilities?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Says Its AI-Based Bug Hunter Found 20 Security Vulnerabilities",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T21:24:56.629414+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T20:34:00+00:00",
        "description": "A professional trapper had one question about the wild pig he'd found in California. Why was its flesh blue?\n\nThe Los Angeles Times explains:\n[California's Department of Fish and Wildlife] is now warning trappers and hunters to keep an eye out for possibly contaminated wildlife in the area, and not to consume the tainted meat, over concerns the blue meat is a sign that the animal may have consumed poison.... The startling find of wild pigs with bright blue tissue in Monterey County suggests the animals have been exposed to anticoagulant rodenticide diphacinone, a popular poison used by farmers and agriculture companies to control the population of rats, mice, squirrels and other small animals, according to a statement from the California Department of Fish and Wildlife. \"Hunters should be aware that the meat of game animals, such as wild pig, deer, bear and geese, might be contaminated if that game animal has been exposed to rodenticides,\" said Ryan Bourbor, pesticide investigations c",
        "id": 3292947,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/09/033255/strange-wild-pigs-in-california---what-turned-their-flesh-blue?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Strange Wild Pigs in California - What Turned Their Flesh Blue?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T20:19:54.582994+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T19:34:00+00:00",
        "description": "\"Benchmarking firm Artificial Analysis found that only five of the top 15 AI models are open source,\" reports the Washington Post, \"and all were developed by Chinese AI companies....\" \n\n\n\"Now some American executives, investors and academics are endorsing a plan to make U.S. open-source AI more competitive.\"\n\nA new campaign called the ATOM Project, for American Truly Open Models, aims to create a U.S.-based AI lab dedicated to creating software that developers can freely access and modify. Its blueprint calls for access to serious computing power, with upward of 10,000 of the cutting-edge GPU chips used to power corporate AI development. The initiative, which launched Monday, has gathered signatures of support from more than a dozen industry figures. They include veteran tech investor Bill Gurley; Clement Delangue, CEO of Hugging Face, a repository for open-source AI models and datasets; Stanford professor and AI investor Chris Manning; chipmaker Nvidia's director of applied research,",
        "id": 3292693,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/09/1916243/initiative-seeks-ai-lab-to-build-american-truly-open-models-atom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Initiative Seeks AI Lab to Build 'American Truly Open Models' (ATOM)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T19:14:04.015238+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T18:34:00+00:00",
        "description": "They haven't built a spacecraft for travelling to our nearest star system. But \"Engineers have designed a spacecraft that could take up to 2,400 people on a one-way trip to Alpha Centauri,\" reports LiveScience:\n\n\n The craft, called Chrysalis, could make the 25 trillion mile (40 trillion kilometer) journey in around 400 years, the engineers say in their project brief, meaning many of its potential passengers would only know life on the craft. Chrysalis is designed to house several generations of people until it enters the star system, where it could shuttle them to the surface of the planet Proxima Centuri b &mdash; an Earth-size exoplanet that is thought to be potentially habitable. \n\nThe project won first place in the Project Hyperion Design Competition, a challenge that requires teams to design hypothetical multigenerational ships for interstellar travel. \nBefore boarding the ship, the Chrysalis project would require initial generations of ship inhabitants to live in and adapt to an",
        "id": 3292411,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/09/1731242/spacecraft-designed-that-could-carry-2400-people-on-a-400-year-trip-to-alpha-centauri?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Spacecraft Designed That Could Carry 2,400 People on a 400-Year Trip to Alpha Centauri",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T18:11:38.646298+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T17:34:00+00:00",
        "description": "\"General Motors claimed a new world record for EV driving on a single charge,\" reports the Verge, \"after a Chevy Silverado EV traveled 1,059.2 miles without recharging its battery.\"\n\nThe potentially record-breaking run took place over seven days on public roads near GM's Milford Proving Ground and Detroit's Belle Isle \"using smart driving techniques\" that included limiting the speed to 20-25 mph. The truck was a 2026 Chevy Silverado EV Work Truck with an EPA-estimated range of 493 miles. But by making a number of adjustments, GM's engineers were able to far surpass the vehicle's estimated range... \nFirst of all, the test was conducted in the summer for \"optimum ambient temperature for battery efficiency,\" GM says. They also lowered the windshield wiper blades to reduce drag, inflated the tires to the highest acceptable pressure for lower rolling resistance, removed the spare tire to lighten the load, and optimized the wheel alignment. A tonneau cover was added to the truck bed for smo",
        "id": 3292054,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/09/0517212/chevy-silverado-ev-drives-10592-miles-on-a-single-charge-surpassing-world-record?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chevy Silverado EV Drives 1,059.2 Miles on a Single Charge, Surpassing World Record",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T17:05:01.232175+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T16:34:00+00:00",
        "description": "In 2023 a 13-year-old girl \"made an offensive joke while chatting online with her classmates,\" reports the Associated Press. \n\nBut when the school's surveillance software spotted that joke, \"Before the morning was even over, the Tennessee eighth grader was under arrest. She was interrogated, strip-searched and spent the night in a jail cell, her mother says.\" Her parents filed a lawsuit against the school system, according to the article (which points out the girl wasn't allowed to talk to her parents until the next day). \"A court ordered eight weeks of house arrest, a psychological evaluation and 20 days at an alternative school for the girl.\"\n\nGaggle's CEO, Jeff Patterson, said in an interview that the school system did not use Gaggle the way it is intended. The purpose is to find early warning signs and intervene before problems escalate to law enforcement, he said. \"I wish that was treated as a teachable moment, not a law enforcement moment,\" said Patterson. \n\nBut that's just one ",
        "id": 3291752,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/09/0624254/students-have-been-called-to-the-office---or-arrested---for-false-alarms-from-ai-powered-surveillance-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Students Have Been Called to the Office - Or Arrested - for False Alarms from AI-Powered Surveillance Systems",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T16:00:06.157071+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T15:34:00+00:00",
        "description": "\"KDE Linux is an all-new desktop Linux distro being developed as a showcase for the KDE desktop project,\" reports The Register. \n\n\"The project is still in a pre-alpha testing stage, but recently went public on the KDE website. Versions are available to download and try out.\"\n\n\nKDE Linux is an entirely new and experimental OS. There's lots of room for confusion here, because KDE already has a demonstration distro, KDE Neon. KDE Linux is a totally separate and far more ambitious project. In terms of its underlying design, it's intended to be a super-stable end-user distro. This is in contrast with Neon, which is an experimental showcase for the latest and greatest code. Neon isn't meant to be anyone's daily driver... \n\nSeveral aspects of [KDE Linux's] design are clearly influenced by Valve's SteamOS 3. Like SteamOS 3, KDE Linux is an immutable distro, with dual read-only Btrfs-format root partitions that update each other alternately... KDE Linux isn't based on Ubuntu or Debian. It's bu",
        "id": 3291393,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/08/09/0328207/kdes-other-distro---kde-linux---now-available-to-download-in-pre-alpha?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "KDE's 'Other' Distro - KDE Linux - Now Available To Download In Pre-Alpha",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T14:55:16.218667+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T14:34:00+00:00",
        "description": "\"California's biggest electric utilities pulled off a record-breaking test...\" reports Semafor, \"during the 7pm-9pm window that is typically its time of peak demand as people come home from work.\"\n\n\nPacific Gas &amp; Electric and other top California power companies switched on residential batteries in more than 100,000 homes and drew power from them into the broader statewide grid. The purpose of the test &mdash; the largest ever in the state, which has by far the most home battery capacity in the U.S. &mdash; was to see just how much power is really there for the utility to tap, and to ensure it could be switched on, effectively running the grid in reverse, without causing a crash. \n\nThe result, which the research firm Brattle published this week, was 535 megawatts, equal to adding a big hydro dam or a half-sized nuclear reactor at a fraction of the cost. \"Four years ago this capacity didn't even exist,\" Kendrick Li, PG&amp;E's director of clean energy programs, told Semafor. \"Now i",
        "id": 3291045,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/09/0446221/california-successfully-tests-virtual-power-plant-drawing-power-from-batteries-in-100000-homes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California Successfully Tests 'Virtual Power Plant', Drawing Power From Batteries in 100,000 Homes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T10:34:50.916255+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T10:00:00+00:00",
        "description": "hackingbear shares a report from CNN: Taiwanese authorities have detained three current and former employees of the world's largest chip manufacturer, Taiwan Semiconductor Manufacturing Company (TSMC), for allegedly stealing trade secrets [and taking them to Japanese company Tokyo Electrons], prosecutors said Tuesday. Law enforcement officers questioned several suspects and witnesses late last month. They searched their homes and detained three of them over \"serious suspicions of violating national security laws,\" the intellectual property branch of the Taiwan High Prosecutors Office said on Tuesday. After an internal investigation, the major Taiwanese exporter raised suspicions with authorities that its \"core technologies\" may have been illegally accessed by former and current staffers.\n \nNikkei Asia first reported on Tuesday that TSMC had fired staffers suspected of illegally obtaining business secrets related to the manufacturing technology for the company's 2-nanometer chip, the m",
        "id": 3289850,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/08/2335203/japanese-company-staff-implicated-in-alleged-theft-of-key-tsmc-technology?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japanese Company Staff Implicated In Alleged Theft of Key TSMC Technology",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T07:20:08.989478+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T07:00:00+00:00",
        "description": "NASA's Crew-10 mission has departed the International Space Station after 146 days, with astronauts Nichole Ayers, Anne McClain, Takuya Onishi, and Kirill Peskov set to splash down off California's coast on Saturday morning. You can watch a recording of the SpaceX Crew-10 undocking and departure on X. Reuters reports: The four-person crew launched to the ISS on March 14 in a routine mission that replaced the Crew-9 crew, which included NASA astronauts Butch Wilmore and Suni Williams, the astronaut pair left on the station by Boeing's Starliner capsule. Five months after the Starliner mission's conclusion, Wilmore this week retired from NASA after a 25-year career in which he flew four different spacecraft and logged a total of 464 days in space. Wilmore was a key technical adviser to Boeing's Starliner program along with Williams, who remains at the agency in its astronaut corps. [...] NASA said they are returning to Earth with \"important and time-sensitive research\" conducted in the ",
        "id": 3289037,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/08/2323252/nasa-crew-10-astronauts-depart-space-station-after-five-month-mission?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Crew-10 Astronauts Depart Space Station After Five-Month Mission",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T04:04:47.294226+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: They are supposed to monitor you throughout the working day and help make sure that life is not getting on top of you. But a study has concluded that smartwatches cannot accurately measure your stress levels -- and may think you are overworked when really you are just excited. Researchers found almost no relationship between the stress levels reported by the smartwatch and the levels that participants said they experienced. However, recorded fatigue levels had a very slight association with the smartwatch data, while sleep had a stronger correlation.\n \nEiko Fried, an author of the study, said the correlation between the smartwatch and self-reported stress scores was \"basically zero.\" He added: \"This is no surprise to us given that the watch measures heart rate and heart rate doesn't have that much to do with the emotion you're experiencing -- it also goes up for sexual arousal or joyful experiences.\" He noted that his Garmin had p",
        "id": 3288445,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/08/2150214/smartwatches-offer-little-insight-into-stress-levels-researchers-find?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Smartwatches Offer Little Insight Into Stress Levels, Researchers Find",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T03:00:04.878558+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T02:02:00+00:00",
        "description": "Advocacy groups have decided not to appeal a federal court ruling striking down Biden-era net neutrality rules, citing the FCC's current Republican majority and a Supreme Court they view as hostile to the issue. Instead, they plan to push for open internet protections through Congress, state laws, and future court cases, while noting California's net neutrality law remains in effect. Ars Technica reports: \"Trump's election flipped the FCC majority back to ideologues who've always taken the broadband industry's side on this crucial issue. And the justices making up the current Supreme Court majority have shown hostility toward sound legal reasoning on this precise question and a host of other topics too,\" said Matt Wood, VP of policy and general counsel at Free Press. [...] \"The 6th Circuit's decision earlier this year was spectacularly wrong, and the protections it struck down are extremely important. But rather than attempting to overcome an agency that changed hands -- and a Supreme",
        "id": 3288303,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/08/222237/net-neutrality-advocates-wont-appeal-loss?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Net Neutrality Advocates Won't Appeal Loss",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T01:54:57.156762+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T01:25:00+00:00",
        "description": "Grow a Garden, a Roblox game created by a 16-year-old in just a few days, has shattered records for the most concurrent players in gaming history, surpassing Fortnite with over 21.6 million concurrent players at once. The Associated Press reports: Grow a Garden is as simple as its name suggests -- players can fill a plot of land with plants and animals, harvest and sell, trade or steal each others' bounty. The game is low stress, with an aesthetic reminiscent of Minecraft and a soundtrack of soothing classical tunes such as Mozart's Rondo Alla Turca playing in the background. Its popularity has further cemented Roblox' place not just in the gaming world but in popular culture -- for better or for worse, it's where the kids hang out.\n \nCoincidence or not, Grow a Garden soared to popularity around the same time that Take-Two Interactive announced it would delay the launch of its wildly anticipated Grand Theft Auto 6 until next year. In late June, the gardening game logged 21.6 million c",
        "id": 3288113,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/08/08/2140221/millions-flock-to-grow-virtual-gardens-in-viral-roblox-game?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Millions Flock To Grow Virtual Gardens In Viral Roblox Game",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T01:54:57.336006+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T00:45:00+00:00",
        "description": "Bruce66423 shares a report from the BBC: The body running courts in England and Wales has been accused of a cover-up, after a leaked report found it took several years to react to an IT bug that caused evidence to go missing, be overwritten or appear lost. Sources within HM Courts &amp; Tribunals Service (HMCTS) say that as a result, judges in civil, family and tribunal courts will have made rulings on cases when evidence was incomplete. The internal report, leaked to the BBC, said HMCTS did not know the full extent of the data corruption, including whether or how it had impacted cases, as it had not undertaken a comprehensive investigation. It also found judges and lawyers had not been informed, as HMCTS management decided it would be \"more likely to cause more harm than good.\" HMCTS says its internal investigation found no evidence that \"any case outcomes were affected as a result of these technical issues.\" However, the former head of the High Court's family division, Sir James Mun",
        "id": 3288114,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/08/2133257/uk-courts-service-covered-up-it-bug-that-lost-evidence?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Courts Service 'Covered Up' IT Bug That Lost Evidence",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T00:49:49.286795+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from SecurityWeek: Two different firms have tested the newly released GPT-5, and both find its security sadly lacking. After Grok-4 fell to a jailbreak in two days, GPT-5 fell in 24 hours to the same researchers. Separately, but almost simultaneously, red teamers from SPLX (formerly known as SplxAI) declare, \"GPT-5's raw model is nearly unusable for enterprise out of the box. Even OpenAI's internal prompt layer leaves significant gaps, especially in Business Alignment.\"\n \nNeuralTrust's jailbreak employed a combination of its own EchoChamber jailbreak and basic storytelling. \"The attack successfully guided the new model to produce a step-by-step manual for creating a Molotov cocktail,\" claims the firm. The success in doing so highlights the difficulty all AI models have in providing guardrails against context manipulation. [...] \"In controlled trials against gpt-5-chat,\" concludes NeuralTrust, \"we successfully jailbroke the LLM, guiding it to produce",
        "id": 3287907,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/08/2113251/red-teams-jailbreak-gpt-5-with-ease-warn-its-nearly-unusable-for-enterprise?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Red Teams Jailbreak GPT-5 With Ease, Warn It's 'Nearly Unusable' For Enterprise",
        "vote": 0
    }
]