[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T16:22:35.372049+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T15:30:00+00:00",
        "description": "It’s hard not to recommend Demon Slayer: The Hinokami Chronicles 2 to fans of the source material, or to fans of shonen anime in general. This game is a great adaptation of some of the best material the anime and manga have, and is as good for fans who wish to relive some of those glorious moments as it is for someone who has no idea what Demon Slayer is about and will be using this game as a gateway into the world. \n\nWhile there are some issues the game has, such as its visuals feeling like a step down from the anime, or the voice acting feeling subpar, on the whole, this is a great continuation of the excellent first outing this franchise had in game form a few years ago. If you are a fan of Demon Slayer, or battle anime in general, you should look into this.",
        "id": 3291432,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=102SmqWSwSY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/102SmqWSwSY/hqdefault.jpg",
        "title": "Demon Slayer: Kimetsu no Yaiba - The Hinokami Chronicles 2 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T14:12:39.060287+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T13:30:02+00:00",
        "description": "Yes, the release of Metal Gear Solid Delta: Snake Eater is a landmark event. The first mainline Metal Gear game post-Kojima, and a remake of a timeless classic. Given shifting expectations of legacy remakes, and Konami’s own self-made pressures following nearly a decade of fanbase alienation, the stakes are high for Metal Gear Solid Δ: Snake Eater. \n\nHowever, whether a success or a failure, Delta will prove to be a turning point for the series. It could prove a springboard for the series’ future, or could eliminate one of the world’s most iconic stealth franchises, plus once-storied developer Konami, to the dustbins. \n\nFor this reason, Konami are evidently taking a conservation-first approach - modern refreshment whilst maintaining a reverence to the source material. Metal Gear Solid Delta: Snake Eater will be one of the biggest games of the year, whether positive or negative.",
        "id": 3290741,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=10MVJ55vycw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/10MVJ55vycw/hqdefault.jpg",
        "title": "Why Metal Gear Solid: Delta Snake Eater Is Shaping Up To Be One of The Biggest Games of the Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T09:53:02.065848+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T09:30:17+00:00",
        "description": "Bloober Team takes another shot at survival horror with Cronos: The New Dawn inching ever closer to its September release. There's a lot to like about this new game, including but not limited to its unique premise, terrifying enemies, and some innovative mechanics that give interesting twists to a tried and tested gameplay loop. \n\nCronos brings its protagonist to a very frightening alternate reality, giving players a harrowing adventure that could have them on the edge of their seats from start to finish. It's a game that needs to be taken at its own pace, while surviving its harsh environments is not a guaranteed outcome at any point.  We take a look at everything you need to know before you decide to jump in.",
        "id": 3289578,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=X2WH7OGMusI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/X2WH7OGMusI/hqdefault.jpg",
        "title": "Cronos: The New Dawn - 15 NEW Things You Need To Know Before You Buy",
        "vote": 0
    }
]