[
    {
        "age": null,
        "album": "",
        "author": "/u/TUD-13BarryAllen",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T23:18:17.105062+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T23:06:27+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Okay, <em>implied</em> spoilers but they&#39;ll be as minimal as possible in case you want to reread or you&#39;re trying to decide whether to read this.</p> <p>The Girl Next Door by Jack Ketchum is disturbing and grotesque for obvious reasons. But I have never heard anyone bring up character development. As well as vibes behind everything.</p> <p>There&#39;s so much more I could say about the writing style and the time management of this book but I&#39;ll keep it on topic:</p> <p>No one changed in this book, which is the thing that gets me. You can say that they became more evil over time but that&#39;s not exactly true, because even though it doesn&#39;t explicitly state anything in the beginning, you know from the minute the characters come up, they are vile and things are not right. Having done worse things towards Meg as time went on was not exactly a result of loss of restraint, it wasn&#39;t out of temper or due to a degradation of everyone&#39",
        "id": 3293307,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mm2zlk/the_things_about_the_girl_next_door_that_people",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The things about The Girl Next Door that people don't bring up. (No spoilers)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Dancing_Clean",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T22:12:52.578494+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T21:08:39+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I was talking to one of the workers at a local bookshop, and he happened to mention that Skippy Dies by Paul Murray is one of his favourite books. I was familiar with him because The Bee Sting, his most recent, was a huge hit (but I hadn’t read it at the time). So I decided to pick it up, despite its heftyness at 660 pages.</p> <p>This is a book that hooks you in almost immediately. Murray has a quirky style of writing, it’s a comedy, it’s a tragedy, it’s funny and sad, but most of all and most importantly, he has an understanding of adolescence I’ve only come across few times.</p> <p>Over the course of this massive book, you get to know Skippy, the titular character, a 14-year-old boy in a catholic boarding school in Ireland who can’t seem to tell anyone what’s truly on his mind. Why is he taking these pills to sleep? Why does he want to quit the swimming team when he’s gotten them a star-turning victory?</p> <p>And his group of friends, nerds and tr",
        "id": 3293078,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mm0chv/skippy_dies_by_paul_murray_2010",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Skippy Dies by Paul Murray (2010)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/birbdaughter",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T21:07:50.344236+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T21:06:36+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>So I’m doing a world reading challenge (through an online website) that’s based on where the <em>author</em> was born, not where the book is set. With many countries this is easy, but I’m wondering what people do regarding small countries without many authors? For instance, I can’t find any in-print authors from Christmas Island and my library has 0. I’ll check Internet Archive but idk. Would you just ignore the country if you can’t find a book, or mark it as complete? I don’t think I can exclude a country from the total tally. </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/birbdaughter\"> /u/birbdaughter </a> <br/> <span><a href=\"https://www.reddit.com/r/books/comments/1mm0aum/question_about_reading_around_the_world_challenge/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1mm0aum/question_about_reading_around_the_world_challenge/\">[comments]</a></span>",
        "id": 3292817,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mm0aum/question_about_reading_around_the_world_challenge",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Question about Reading Around the World Challenge",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Bulawayoland",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T21:07:50.512515+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T20:39:21+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Well, I just finished a disturbing and enlightening book by a lady who is probably deeply evil but very well educated and interesting anyway.</p> <p>When I say she is probably deeply evil I mean she seems very concerned to rationalize and justify the ability of humans to make animals suffer. This is what she said, on page 17:</p> <p>&quot;if what we want to do is ensure that chimpanzees, and other animals, are treated humanely and not exposed to potential pain and suffering, then assuming that they think exactly like us is a reasonable and a defensible position. Even if they can&#39;t experience suffering, it doesn&#39;t really matter -- either way, we have done no harm. In addition, it may well help us feel better as humans to treat all animals humanely, regardless of their actual capacities, so we could even be justified in doing so for these egocentric reasons alone.&quot;</p> <p>A careful person would probably call statements like these &quot;deep",
        "id": 3292818,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlzno5/beyond_the_brain_by_louise_barrett_2011",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Beyond the Brain, by Louise Barrett (2011)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/LTJ81",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T18:57:50.687797+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T18:15:47+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>“The Eyes of the Dragon” by Stephen King is the second book in my epic 17-book journey to The Dark Tower. After finally conquering the horror masterpiece of “The Stand,” I set my sights on this one. Here is how I’m tackling the entire Dark Tower saga in order, in case you’d like to do the same… </p> <p>The Stand<br/> The Eyes of the Dragon<br/> Insomnia<br/> Hearts in Atlantis<br/> ‘Salem’s Lot<br/> The Talisman<br/> Black House<br/> Everything&#39;s Eventual (The Little Sisters of Eluria)<br/> The Dark Tower I: The Gunslinger<br/> The Dark Tower II: The Drawing of the Three<br/> The Dark Tower III: The Waste Lands<br/> Charlie the Choo-Choo<br/> The Dark Tower IV: Wizard and Glass<br/> The Dark Tower: The Wind Through the Keyhole<br/> The Dark Tower V: Wolves of the Calla<br/> The Dark Tower VI: Song of Susannah<br/> The Dark Tower VII: The Dark Tower </p> <p>Before I start my review, I found some trigger warnings while reading this book. They were… ",
        "id": 3292255,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlw8y9/working_my_way_through_the_dark_tower_series_the",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Working my way through The Dark Tower series, \"The Eyes of the Dragon\" is a book I'll never forget",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/wxndering_thoughts_",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T18:57:50.444775+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T17:56:48+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>So I finished my reread of The Hunger Games trilogy a couple weeks ago (5/5 as always, loved it), and chapter 18 in particular suddenly had me thinking of and making comparisons to Fourth Wing, which I read several months back and decidely did <em>not</em> enjoy as much, because of the stark contrast in the military training programs and overall competence of the people running of them. This is a snippet from when Katniss undergoes training in District 13 to prepare for the invasion on the Capitol:</p> <p>&quot;The instructor breaks us into squads of eight and we attempt to carry out missions -- gaining a position, destroying a target, searching a home -- as if we were really fighting our way through the Capitol. The thing&#39;s rigged so that everything that can go wrong will go wrong for you does. A false step triggers a land mine, a sniper appears on a rooftop, your gun jams, a crying child leads you into an ambush, your squadron leader... gets hit",
        "id": 3292254,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlvs34/rereading_mockingjay_has_made_me_question_the",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Rereading Mockingjay has made me question the training in Fourth Wing even more",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/theluckyone95",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T14:37:51.213265+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T13:56:01+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>The reason why I&#39;m asking this question is because I&#39;m trying to declutter my home. I mainly borrow books from the library nowadays because I read so much and don&#39;t have space for books. But in the past, I&#39;d always buy them.</p> <p>I&#39;ve had pretty much the entire Pretty Little Liars book series since I was a teen (I&#39;m 30 now) and for some reason I found it difficult to let go of. I don&#39;t remember exactly what happened in the books so technically I <em>could</em> reread them and don&#39;t really know what&#39;s gonna happen, but I also don&#39;t know if I <em>would</em> reread them (there are so many other books I have never read!). I think I&#39;ve mainly saved them because if I ever get a daughter, they&#39;d be a good way for her to practice reading in English, I suppose. But it would be years until I have a daughter that age so perhaps it&#39;s pointless.</p> <p>But it also feels weird getting rid of an entire book serie",
        "id": 3290863,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlq1xe/do_you_throw_away_old_books",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Do you throw away old books?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Just-Passing-Thru737",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T22:12:53.151191+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T13:44:50+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I know there are other posts about this, but I’m late to the party and wanted to catch others who might be late too. I really thought I was going to like this book, but the longer it went the less and less I liked it. All the surrounding characters felt flat to me—like they were just NPCs for Ove to interact with (the good characters all immediately love him, the bad ones hate him)—and Ove…didn’t really change / grow as a person? I tend to be a sucker for curmudgeonly characters, but it felt like his character just wasn’t done well. And while I think the trope of a stoic older man struggling to cope after the loss of his wife can be very poignant (I’m looking at you, UP), the flashback scenes with Sonja made me roll my eyes. Again, she felt more like a stereotype than a realized character. I did feel for both Ove and Sonja when they lost their baby. (Since becoming a mom my heart immediately crumples at any mention of losing a child.) But I thought Ba",
        "id": 3293079,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlpsyl/thoughts_on_a_man_called_ove",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Thoughts on A Man Called Ove?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Rastabrotha",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T14:37:51.545122+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T13:44:30+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>If I don&#39;t rant (and slightly spoil) about this I might die. This series was the best awful read I ever inflicted onto myself, awful because the kinds of violence portrayed in this series are what I actively avoid in my escapist outlet but Octavia hooked me and didn&#39;t let me leave. Doro is so evil it made my stomach churn and heart wrench for people who are fictional. Even Frieza or Darth Vader who destroy planets and kill billions are kind of just dickheads in comparison, the shit that Doro does is personal and just doesn&#39;t compare.</p> <p>For context, since the books are almost 50 years old now, Doro became an involuntary body hopper when he was a tween. He was promply orphaned, captured and supressed memories of 50 years of what had to be prison torture. Since he can&#39;t kill himself or be killed for good he just kept going, losing empathy, kindness and any other redeeming quality. The slow reveal of his evil, red flags getting redder",
        "id": 3290864,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlpsom/2_months_later_and_octavia_bulters_patternist",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "2 months later and Octavia Bulters Patternist series is still rattling in my head",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/belongtotherain",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T13:32:52.253889+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T13:17:54+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Was anyone else really disappointed by this book?</p> <p>I thought the first book was a masterpiece and I heard the sequel was on-par. I disagree. </p> <p>The second book felt like a convoluted mess. I appreciate the ambition but it becomes so scattered and confusing. </p> <p>The Keats narrator lacks a strong personality to carry the book and often just felt like a plot device to explain how we can still follow the other people around the Web. </p> <p>What do you all think about the sequel? Did you appreciate how zoomed out it was compared to the first book? </p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/belongtotherain\"> /u/belongtotherain </a> <br/> <span><a href=\"https://www.reddit.com/r/books/comments/1mlp8bn/the_fall_of_hyperion_isnot_good/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/books/comments/1mlp8bn/the_fall_of_hyperion_isnot_good/\">[comments]</a></span>",
        "id": 3290522,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlp8bn/the_fall_of_hyperion_isnot_good",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Fall of Hyperion is…not good?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Funplings",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T12:27:53.711498+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T12:11:04+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://glasshalftrue.substack.com/publish/post/166522427\">https://glasshalftrue.substack.com/publish/post/166522427</a></p> <p>Wes Anderson, my favorite film director, often gets accused of being “style over substance”. I disagree with this criticism, because it draws a false dichotomy between style and substance. In filmmaking, the way images are presented on the screen is both the style <em>and</em> the substance: the medium is the message, as they say. His storybook visual flair and love of orderly symmetrical compositions aren’t just superficial details; they work to emphasize the whimsical, rose-colored lens through which many of his stories are told. The seeming emotional distance created by his convoluted, deadpan dialogue isn’t just a pretentious quirk; it serves to highlight the characters’ fear of emotional vulnerability, which heightens the sense of catharsis in the rare moments that their facades break down.</p> <p>This is not a ",
        "id": 3290252,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlnwru/my_review_of_blood_meridian",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "My review of \"Blood Meridian\"",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Radbot13",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T11:22:54.071277+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T10:38:41+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>You never truly know what cover you are going to get until you open the box because the ISBN for each cover is exactly the same. I just bought Stephen King&#39;s Dark Tower series from Blackwells because they have all the books new and listed as the &quot;Now with a stunning new cover look.&quot; After reaching out they confirmed that there is no guarantee what cover is sent if they have previous versions of the book with the same ISBN. This definitely screams false advertising, but at the same time the &quot;ISBN&quot; is there...</p> <p>You think there would be a way to guarantee what cover you are purchasing from a store by now. I&#39;m not trying to get a mystery crate, and the Ultimate Storyteller version of Stephen King&#39;s books seems like a pain to get in the U.S. since I missed out when these came out a few years ago. They aren&#39;t listed at any store and I can only find them used.</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href",
        "id": 3289994,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlmca6/buying_books_online_feels_like_buying_a_mystery",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Buying books online feels like buying a mystery figure box or loot boxes in video games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/HugoNebula",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T11:22:54.317424+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T10:30:16+00:00",
        "description": "<table> <tr><td> <a href=\"https://www.reddit.com/r/books/comments/1mlm7hr/death_of_a_publishing_dream_how_the_unbound/\"> <img src=\"https://external-preview.redd.it/ffw0mFmHv94y9kRNj9mDL9O6mvkfd-rMcgGtrBBTJaw.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=ee6fc7ca2a17d9af847278995c85a46d38f7a91c\" alt=\"Death of a Publishing Dream: How the Unbound Revolution Became Untethered—The literary disrupters enjoyed great success with their crowdfunding model, signing authors that other publishers overlooked. And then the money ran out…\" title=\"Death of a Publishing Dream: How the Unbound Revolution Became Untethered—The literary disrupters enjoyed great success with their crowdfunding model, signing authors that other publishers overlooked. And then the money ran out…\" /> </a> </td><td> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/HugoNebula\"> /u/HugoNebula </a> <br/> <span><a href=\"https://observer.co.uk/news/business/article/death-of-a-publishing-dream-how-the-unbound-revol",
        "id": 3289995,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlm7hr/death_of_a_publishing_dream_how_the_unbound",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://external-preview.redd.it/ffw0mFmHv94y9kRNj9mDL9O6mvkfd-rMcgGtrBBTJaw.jpeg?width=640&crop=smart&auto=webp&s=ee6fc7ca2a17d9af847278995c85a46d38f7a91c",
        "title": "Death of a Publishing Dream: How the Unbound Revolution Became Untethered—The literary disrupters enjoyed great success with their crowdfunding model, signing authors that other publishers overlooked. And then the money ran out…",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/Welther",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T10:17:49.607335+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T09:53:24+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I think it&#39;s really difficult to get scared by a book as an adult. I <em>can</em> think of a few audiobooks that scared me a bit, but like films, they have an easier time creating an atmosphere; with a good narrator and background sound effects, that is. A film can be scary just by setting and tension, you don&#39;t even have to like the protagonist to feel uncomfortable, which <em>may</em> be a requirement in a book? I think you have to fear <strong>for</strong> the protagonist (what is about to happen to him), rather than a &quot;scene&quot; being spooky. Poor lighting conditions doesn&#39;t have the same effect in words, after all :)<br/> I don&#39;t find blood and gore scary, I can just read a medical book, if I want to be grossed out. Ghosts are only as scary as the physical threat they present; Or it is just me...</p> <p>So what makes does a book scary?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/We",
        "id": 3289683,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mllne0/what_makes_a_book_scary",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What makes a book scary?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/AutoModerator",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T09:12:54.269816+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T09:00:25+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Welcome readers, </p> <p>Have you ever wanted to ask something but you didn&#39;t feel like it deserved its own post but it isn&#39;t covered by one of our other scheduled posts? Allow us to introduce you to our new Simple Questions thread! Twice a week, every Tuesday and Saturday, a new Simple Questions thread will be posted for you to ask anything you&#39;d like. And please look for other questions in this thread that you could also answer! A reminder that this is not the thread to ask for book recommendations. All book recommendations should be asked in <a href=\"/r/suggestmeabook\">/r/suggestmeabook</a> or our Weekly Recommendation Thread.</p> <p>Thank you and enjoy!</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/AutoModerator\"> /u/AutoModerator </a> <br/> <span><a href=\"https://www.reddit.com/r/books/comments/1mlkvsj/simple_questions_august_09_2025/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.c",
        "id": 3289407,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlkvsj/simple_questions_august_09_2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Simple Questions: August 09, 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/fortnerd",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T08:08:04.978772+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T07:35:42+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>It took forever, but I finally own some books with printed edges on them (Foundryside and Tainted Cup by Robert Jackson Bennett) I don&#39;t remember when this technology was first introduced, but it feels relatively recent. It seemed a bit, I dunno, gimmicky at first, and the technology was mostly found on YA romantasy stuff which may have led me to subconsciously avoid books with colored edges (I&#39;m 37) but it seems that it is very much here to stay. Part of me is very &#39;meh&#39; on them but then...another part of me remembers being in my 20s, working in a printshop and geeking out over a foil hotstamping machine 😅</p> <p>Do you guys like printed edges? Why or why not?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/fortnerd\"> /u/fortnerd </a> <br/> <span><a href=\"https://www.reddit.com/r/books/comments/1mljmqv/opinions_on_printed_edges/\">[link]</a></span> &#32; <span><a href=\"https://www.reddit.com/r/boo",
        "id": 3289152,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mljmqv/opinions_on_printed_edges",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Opinions on printed edges?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/SGI256",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T04:52:50.963407+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T04:06:53+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Here&#39;s a compelling case for why Justice Alito&#39;s upcoming book might be worth reading, even if you expect it to be self-serving or disappointing.</p> <p>Carlos Lozada, a New York Times columnist who specializes in reading political books, makes a fascinating argument on this On the Media episode: political figures &quot;always reveal themselves, their insecurities, their fears, their ambitions, whether they really mean to or not&quot; - no matter how carefully they try to present themselves in the best light.</p> <p>The most revealing insights often aren&#39;t the big, newsworthy moments that grab headlines. Instead, Lozada suggests looking for subtler tells: what they choose to include in their acknowledgments, how they describe interactions with staff, which anecdotes they select to make themselves look principled, and crucially - what they omit or gloss over.</p> <p>His analysis of Mike Pence&#39;s memoir is instructive here. Pence quoted T",
        "id": 3288553,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mlg4ot/argument_for_reading_alitos_book",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Argument for reading Alito's book",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/caseyjosephine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T03:48:05.155759+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T02:49:15+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>Please read Barbara Kingsolver! She is a spiritual successor to Steinbeck because she writes about how individuals interact with social systems in a way that shares a similar mentality. </p> <p>For example, The Poisonwood Bible is about a missionary family that moves to the Congo in the 1960s. The patriarch of the family has so much in common with East of Eden&#39;s Cathy: they&#39;re written as objectively &quot;evil&quot; characters, but the authors find deep sympathy for them anyways. I love how both Kingsolver and Steinbeck create moral worlds that are comfortable with calling characters out while also exploring shades of gray. </p> <p>If you want to get into Kingsolver, The Poisonwood Bible and Demon Copperhead are the best places to start. I&#39;ll also give a wildcard recommendation to Animal, Vegetable, Miracle, which is a nonfiction memoir about eating locally as a modern way to live off the land. </p> </div><!-- SC_ON --> &#32; submitted by ",
        "id": 3288380,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mleme6/for_everyone_who_keeps_recommending_east_of_eden",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "For everyone who keeps recommending East of Eden",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/big-enchilada",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T02:44:31.817144+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T02:25:08+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>I honestly don’t get whose idea it was to just say &quot;read more&quot; as if that solves anything. I know lots of people mean well when they say it, and maybe they’re thinking of good books or reading critically, but just saying “we need to increase male readership” means little. Even saying “men need to read more books,” for example, isn’t all that helpful.</p> <p>There are a lot of awful books out there, books full of misinformation, shallow ideas, lowest common denominator stuff.... So telling someone to read more, no matter what, is kind of like telling someone thin, “you need to eat more.” Sure, if someone’s anorexic and on their deathbed, sure, that advice makes sense. Same with reading. If someone’s literally never gone to school or can’t read at all, then yes, learning to read anything is better than nothing. But most people I know here in North America aren’t in that situation. This isn’t Chad or Afghanistan or whatever. So let’s not preten",
        "id": 3288215,
        "language": "",
        "link": "https://www.reddit.com/r/books/comments/1mle56k/why_do_we_keep_encourage_people_to_just_read_more",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 531,
        "source_url": "https://www.reddit.com/r/books/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why do we keep encourage people to just \"read more\"?",
        "vote": 0
    }
]