[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T16:58:03.602448+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T16:00:23+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Brandon Keeney of Tapestry highlights how 3D digital product creation (3D DPC) and technological advancements are setting the stage for a new era of fashion. \n\nTechnology has reshaped every industry, and fashion is no exception. From design to production, digital innovation is redefining how brands create, communicate, and connect with consumers. 3D DPC is at the forefront of this transformation, offering new ways to visualize, prototype, and scale ideas.\n\nTopics in this video include expanding 3D DPC capabilities; unlocking cross-functional applications; reimagining digital showrooms; and the role of avatars in fashion.\n\nTo find out more about Unreal Engine, check out our website: www.unrealengine.com/feed\n\n#DigitalFashion, #Tapestry, #3DDigitalProductCreation, #3DDPC, #DigitalShowrooms, #FashionAvatars, #UnrealEngine, #UE5, #UnrealFestOrlando",
        "id": 3291652,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9AJLzDG5tI4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9AJLzDG5tI4/hqdefault.jpg",
        "title": "Create Once, Use Many: How Tapestry Levels up Their 3D Workflow with UE | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T14:47:34.253721+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T14:00:43+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Patrick Hart of Aria Labs creates an interactive procedural music score from scratch with MetaSounds, Quartz, and other UE Audio features. \n\nUnreal Engine has made it easier than ever to get started making procedural music in games. This talk aims to demystify the process and show that it’s easier than one might think to integrate a rich procedural soundscape into your project.\n\nThe project shown in the video starts with the First Person Shooter template, and builds a procedural system that generates background music with multiple layers, synchronizes and tunes gunshots to the music, and triggers musical changes and flourishes from gameplay.\n\nThe presentation explores how to manage procedurally generated sounds and music data with Blueprints, covering the basics and touching on more intermediate and advanced tips and tricks to help our sounds stand out and enhance gameplay. \n\nThe session also discusses the advantages of using react",
        "id": 3290976,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QjcxmyOlnc4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QjcxmyOlnc4/hqdefault.jpg",
        "title": "Real-Time Music: Creating Procedural Music From Scratch | Unreal Fest Orlando 2025",
        "vote": 0
    }
]