[
    {
        "age": null,
        "album": "",
        "author": "Magia Natury",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-09T09:43:27.782359+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-09T09:00:23+00:00",
        "description": "Te miniaturowe owady żyją w dużych koloniach i ściśle ze sobą współpracują. Mają złożony system komunikacji, podział na kasty i określone funkcje. Bez chwili wahania są w stanie oddać życie za kolonię. Parają się rolnictwem, a nawet hodowlą. Potrafią napadać i przejmować inne kolonia, a nawet brać niewolników, którzy wykorzystywani są potem do ciężkiej pracy. Pojedyncza kolonia funkcjonuje niczym jeden superorganizm. Mrówki to jedne z najbardziej fascynujących organizmów żyjących dziś na ziemi. \n\n👉 Patronite ► https://patronite.pl/magia_natury\n__________\nAutor kanału nie rości sobie praw do materiałów wykorzystanych w filmie. Materiały wykorzystane są w ramach prawa dozwolonego użytku w celu zobrazowania, edukowania i lepszego zrozumienia zagadnienia lub pochodzą z serwisów udostępniających darmowe materiały.\n\nThe author of the channel does not claim any rights to the material used in the video. The materials are used under fair use law to illustrate, educate and better understand the",
        "id": 3289571,
        "language": "pl",
        "link": "https://www.youtube.com/watch?v=Iv3iNNHuois",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 461,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfDX69pxC4q6yKSaugs196g",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Iv3iNNHuois/hqdefault.jpg",
        "title": "Praktykują Niewolnictwo, Napadają, Hodują - MRÓWKI - Niestrudzone Maszyny Przetrwania",
        "vote": 0
    }
]