[
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T20:25:04.128697+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T19:24:06+00:00",
        "description": "Update on Key Improvements to Linux & NFS: Creating a High-Performance Standard for AI Workloads\n\nSponsored by Hammerspace\n\nThe increasing importance of AI in the enterprise has transformed the management, movement, and storage of unstructured data. Enterprises now require the high levels of storage performance and scale previously reserved for elite HPC and Hyperscale environments, as well as advanced data services to find, stage, and process the data needed for GenAI and inference workloads.\n\nThe problem is that AI workloads require high-performance access to datasets that are often distributed across existing on-prem and cloud-based storage silos, requiring performance levels traditional enterprise IT architectures are not designed for.\n\nBut within every enterprise data center there are Linux-based servers that already contain a series of high-performance enhancements that help accelerate existing IT environments to meet these challenges.\n\nWith an ongoing series of updates to the L",
        "id": 4053089,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=j3HIIQe_cJI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/j3HIIQe_cJI/hqdefault.jpg",
        "title": "LF Live Webinar: Update on Key Improvements to Linux & NFS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:57.490727+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:29+00:00",
        "description": "Governing Open Source in the Enterprise: OSPO Strategies for Innovation and Compliance - David Hirsch, Dynatrace\n\nEmbracing open source at scale brings tremendous opportunities – and new governance challenges – for enterprises. This session delves into how Open Source Program Offices (OSPOs) and robust governance models can balance rapid innovation with compliance and risk management. We will examine common hurdles large organizations face when integrating open-source software: from navigating license compliance and security vulnerabilities to managing contributions and community engagement. Through best practices and case studies, attendees will learn how to establish effective open source policies and processes that encourage innovation rather than hinder it. Key topics include setting up an OSPO charter, automated license compliance checks, inner sourcing vs. outsourcing decisions, and fostering a company culture that aligns with open-source values. With OSPO adoption growing 32% s",
        "id": 4045344,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=npjtLb5lllw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/npjtLb5lllw/hqdefault.jpg",
        "title": "Governing Open Source in the Enterprise: OSPO Strategies for Innovation and Compliance -David Hirsch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:57.206679+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:29+00:00",
        "description": "Keynote: How Microsoft Builds and Runs on Open Source - Jay Lee, Cloud Native Global Blackbelt, Microsoft\n\nOnce a skeptic of open source, Microsoft has evolved into one of the world’s most active open-source contributors. This talk will trace Microsoft’s journey, revisiting its history and highlighting the significant contributions it has made to the open-source community.",
        "id": 4045342,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ne624CKM1Zk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ne624CKM1Zk/hqdefault.jpg",
        "title": "Keynote: How Microsoft Builds and Runs on Open Source - Jay Lee",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:57.625096+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:29+00:00",
        "description": "Keynote: KOSSA: The Beginning of New Leadership - Hosung Shim, CEO & Full-time Vice Chairman, Korea Open Source Software Association (KOSSA)",
        "id": 4045345,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ou6sjwyxjxc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ou6sjwyxjxc/hqdefault.jpg",
        "title": "Keynote: KOSSA: The Beginning of New Leadership - Hosung Shim",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:57.876874+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:29+00:00",
        "description": "Keynote: Linus Torvalds, Creator of Linux & Git, in Conversation with Dirk Hohndel, Head of the Open Source Program Office, Verizon",
        "id": 4045347,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=tWx769t1JKg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tWx769t1JKg/hqdefault.jpg",
        "title": "Keynote: Linus Torvalds, Creator of Linux & Git, in Conversation with Dirk Hohndel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:57.763351+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:29+00:00",
        "description": "Keynote: Owning Your Silicon Future Starts with Building on RISC-V - Divyang Agrawal, VP RISC-V Cores, Tenstorrent\n\nOpen standards need open source design implementation, tools and infrastructure. Tenstorrent is on a mission to do just that for RiscV and Chiplets. We build on RiscV, use RiscV, and release hardware and software collateral to help expand the ecosystem. This talk will explore the availability of open source HW and SW collateral used to build RiscV based processors. These processors can then be deployed in AI cores, HPC, application processors and even small, highly efficient designs. Building on top of such open systems enables you to own your silicon future.",
        "id": 4045346,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=s7TJD7zyvK0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s7TJD7zyvK0/hqdefault.jpg",
        "title": "Keynote: Owning Your Silicon Future Starts with Building on RISC-V - Divyang Agrawal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:57.351400+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:29+00:00",
        "description": "Keynote: The Open Source Pathway: Democratizing AI's Benefits to Korea's Economy, Society, and Workforce - Anna Hermansen\n\nWhat opportunities does open source present for Korea's digital transformation? Anna Hermansen, Senior Researcher at the Linux Foundation, explores the data behind the value of open source AI from the perspective of Korea's economy, workforce, and society. Pulling findings from three LF Research studies---the 2025 State of Tech Talent Report, the 2025 State of Sovereign AI, and the Value of Open Source AI to APEC Economies---she describes Korea’s unique opportunities and identifies next steps and recommendations for open source adoption across government and corporate settings in the country.",
        "id": 4045343,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nkj04rm72hU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nkj04rm72hU/hqdefault.jpg",
        "title": "Keynote: The Open Source Pathway: Democratizing AI's Benefits to Korea's Economy... - A. Hermansen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:57.075984+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:29+00:00",
        "description": "Sponsored Session: Building Enterprise Solutions in the AI-Native Era with Red Hat - Daniel Oh, Red Hat\n\nEnterprises are rapidly evolving toward an “AI-Native” environment, where AI becomes a core element of business. Red Hat AI, built with an open source–driven ecosystem and a proven platform, enables organizations to securely and efficiently develop, deploy, and operate AI models optimized for their business, wherever the data resides. In this session, we will explore Red Hat’s Enterprise AI platform, grounded in the technology of open source and hybrid cloud, and discuss new directions for AI as it continues to capitalize on the innovation open source collaboration can bring.",
        "id": 4045341,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=dA8iLsSWUZc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dA8iLsSWUZc/hqdefault.jpg",
        "title": "Sponsored Session: Building Enterprise Solutions in the AI-Native Era with Red Hat - Daniel Oh",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:58.765554+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:27+00:00",
        "description": "Accelerating Korea's Open Source Future: Workforce, Innovation, & AI - Anna Hermansen, The Linux Foundation\n\nOpen source is powering the next era of innovation around the world. How does this translate to Korea’s workforce, economy, and society, particularly in light of the immense promise of AI? In this data-rich session, Anna Hermansen, Senior Researcher at the Linux Foundation, will share findings from three studies on the state of the Korean tech talent market, the economic and societal value of open source AI to Korea, and the opportunities for sovereign AI in the country. Woven together, these findings illustrate Korea’s unique opportunities in training and resourcing to thrive in this dynamic technological transformation. The session will conclude by identifying next steps to help inform Korean public and private sectors’ digital and policy strategy.",
        "id": 4045353,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TofhlmYNVw8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TofhlmYNVw8/hqdefault.jpg",
        "title": "Accelerating Korea's Open Source Future: Workforce, Innovation, & AI - Anna Hermansen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:58.883384+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:27+00:00",
        "description": "Code, Community, & Commerce: The Future of Payments with Solana’s Open-Source Ecosystem - Blair Kyung-ha Lee, Solana Foundation\n\nThis session offers a concise tour of the multi-layered “openness” strategy driving Solana’s growth. We’ll explore the open-source model and the symbiotic loop between core teams and community contributors, and walk through the pragmatic SIMD governance flow that turns community proposals into protocol reality.\n\nFocusing on payments, we’ll break down how the open-source Solana Pay protocol attracted Web2 leaders such as Shopify and Stripe. We’ll close by showing how superior developer tooling, global hackathons, and targeted grants create a growth flywheel that continuously pulls in new ideas and talent—laying out a clear blueprint for the future of finance powered by Solana’s open-source ethos.",
        "id": 4045354,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=U0NwO5Z43k4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/U0NwO5Z43k4/hqdefault.jpg",
        "title": "Code, Community, & Commerce: The Future of Payments with Solana’s Open-Source Ecosystem - B. Lee",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:58.616463+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:27+00:00",
        "description": "How To Talk To Your Lawyer about Open Source - Jimmy Ahlberg, Ericsson\n\nThis talk explores best practices for collaborating effectively with legal departments and external counsel on Open Source software, Open Source licensing and compliance. Drawing on real-world experiences from the speaker's Open Source journey, it emphasizes transforming legal teams from perceived obstacles into strategic partners. Attendees will learn how to bridge cultural and communication gaps between developers and lawyers, align motivations, and foster a shared understanding to manage risk and boost efficiency. The session highlights practical tools like OpenChain (ISO/IEC 5230:2020) to facilitate education and guidance.\n\nUltimately, the goal is to enable organizations to use and contribute to Open Source software smoothly while ensuring legal and business risks are accurately communicated to leadership. A successful partnership approach helps avoid mixed messages and supports sustainable Open Source engagem",
        "id": 4045352,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QiYRCTr0wxA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QiYRCTr0wxA/hqdefault.jpg",
        "title": "How To Talk To Your Lawyer about Open Source - Jimmy Ahlberg, Ericsson",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:59.031176+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:27+00:00",
        "description": "Keynote: OpenSearch: From Project to Community-Driven Ecosystem—Building Sustainable Governance Together - Andrew Ross, Principal Engineer, AWS\n\nThis keynote explores OpenSearch's transformative journey since joining the Linux Foundation, highlighting achievements in open governance, collaboration, and innovation. We'll examine the establishment of the Technical Steering Committee and elected Governing Board, showcasing how these initiatives have propelled OpenSearch into the top 20 Linux Foundation projects by contributor activity. The journey reveals concrete steps taken to create a truly community-driven ecosystem.\nWe’ll focus on how Linux Foundation infrastructure has democratized project participation and fostered a merit-based governance model, ensuring technical leadership remains independent and community-driven. And finally, you’ll hear how this collaborative approach is accelerating innovation and creating a sustainable ecosystem that benefits all participants, from individu",
        "id": 4045355,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Uyw97DO0eig",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Uyw97DO0eig/hqdefault.jpg",
        "title": "Keynote: OpenSearch: From Project to Community-Driven Ecosystem—Building Sustainable... - A. Ross",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:58.327741+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:27+00:00",
        "description": "Keynote: Rust in the Linux Kernel, Why? - Greg Kroah-Hartman, Linux Kernel Maintainer and Fellow, The Linux Foundation",
        "id": 4045350,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=HX0GH-YJbGw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HX0GH-YJbGw/hqdefault.jpg",
        "title": "Keynote: Rust in the Linux Kernel, Why? - Greg Kroah-Hartman",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:58.481846+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:27+00:00",
        "description": "Securing Open Source With SBOM: From Visibility To Trust - Heejo Lee, Korea University\n\nA Software Bill of Materials (SBOM) is a comprehensive inventory of all software components within a product, including open-source software (OSS). However, applying SBOMs to OSS projects presents several technical challenges, such as identifying modified OSS components, analyzing third-party dependencies, and verifying security vulnerabilities. In this talk, we introduce IoTcube.net, an automated platform for SBOM generation and vulnerability verification, which integrates with OpenSSF Guac and OpenVEX to enhance the usability and interoperability of SBOM documents. We then propose collaborative initiatives to strengthen OSS security such as standard representation of OSS and licenses, vulnerability management of unpatched OSS components, and recommendation of SBOM management followed by a discussion on potential joint efforts.",
        "id": 4045351,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MEJAFGiI2tk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MEJAFGiI2tk/hqdefault.jpg",
        "title": "Securing Open Source With SBOM: From Visibility To Trust - Heejo Lee, Korea University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:58.034925+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:27+00:00",
        "description": "The Open Source Imperative in AI: Transparency, Governance, and Global Collaboration - Chris Xie, Futurewei & Jesse McCrosky, Egen AI\n\nAs AI rapidly evolves, open source plays a crucial role in shaping its transparency, governance, and sustainability. This talk will explore how open source can drive AI openness at different levels, from model accessibility to reproducibility and ethical AI development. We will address critical challenges such as balancing AI transparency with responsible governance, ensuring sustainability amid increasing computational demands, and navigating legal complexities around copyrighted training datasets and fair use.\n\nDrawing insights from the Open Source AI Strategy Forum and global initiatives, we will examine how international collaboration in open source AI fosters innovation while addressing geopolitical and regulatory constraints. The session will also highlight emerging governance frameworks that promote accountability and trust in AI, ensuring that ",
        "id": 4045348,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=9eYhS-x9CV8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9eYhS-x9CV8/hqdefault.jpg",
        "title": "The Open Source Imperative in AI: Transparency, Governance, and Global... - C. Xie & J. McCrosky",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The Linux Foundation",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T02:02:58.175076+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T01:33:27+00:00",
        "description": "Vector Search Made Simple: Getting Started with OpenSearch for AI Applications - Dotan Horovits, OpenSearch\n\nOpenSearch, a Linux Foundation open source project, has evolved from search to a powerful vector database solution. This talk will begin by explaining the transition from traditional lexical search to vector-based similarity search, and how OpenSearch combines both approaches in one complete package.\n\nThe session introduces fundamental concepts of vector databases, including how they store and process embedded meanings of various data types (text, images, and audio) using k-nearest neighbors (k-NN) functionality.\n\nWe'll explore practical applications such as visual search, semantic search, and recommendation engines, with emphasis on real-world use cases. This is your opportunity to learn how OpenSearch can serve as a knowledge base for AI systems, particularly in applications like retrieval augmented generation (RAG) with large language models.",
        "id": 4045349,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BQGrrsBAnVI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 499,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BQGrrsBAnVI/hqdefault.jpg",
        "title": "Vector Search Made Simple: Getting Started with OpenSearch for AI Applications - Dotan Horovits",
        "vote": 0
    }
]