[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T18:40:04.715489+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T18:00:28+00:00",
        "description": "#shorts #tedx #ted #stevenbartlett #business #entrepreneur #diaryofaCEO #socialmedia",
        "id": 4052030,
        "language": "en",
        "link": "https://www.youtube.com/shorts/NSv3JDWaAUY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NSv3JDWaAUY/hqdefault.jpg",
        "title": "Steven Bartlett on the secret to success #shorts #tedx",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:18.227384+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:22:11+00:00",
        "description": "What if regulation isn’t the enemy of innovation, but its greatest enabler? In this insightful talk, David de Falguera, Partner at EY specializing in AI and Digital Law, challenges the common belief that rules stifle creativity. He reveals how smart regulation can actually build trust, provide certainty, and drive better design in the fast-moving world of artificial intelligence. Through the lens of the EU AI Act and real-world business experience, David shows that when we regulate AI to serve people, not just profit, we unlock innovation that is both ethical and enduring. David de Falguera is the Partner leading EY Spain’s AI & Digital Law practice and serves as Global Data Pillar Leader at EY. A qualified lawyer specialized in Digital Law, he advises leading private companies and public institutions on data protection, cybersecurity, digital services, intangible asset protection, and artificial intelligence. His work combines legal expertise with strategic vision, helping organizati",
        "id": 4051339,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SQZzO7xEkH0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SQZzO7xEkH0/hqdefault.jpg",
        "title": "Regulating AI to unlock innovation | David de Falguera | TEDxEsade Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:18.463321+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:22:02+00:00",
        "description": "When self-driving cars, AI weapons, and algorithms make life-or-death decisions, who should be held accountable, the engineer, the company, or the code itself? In this powerful and deeply reflective talk, Dila Şen explores the moral challenges at the heart of artificial intelligence. Through real-world dilemmas and human stories, she reveals that coding ethics into machines isn’t just a technical problem but a human one.  Dila Şen is a Senior Regulatory Specialist at Compliance & Risks, where she has led global regulatory requirements projects for five years, advising clients on compliance with AI regulations. A sworn translator and qualified lawyer in Türkiye since 2012, she brings over a decade of legal and industry experience across law firms and corporate sectors. \nShe holds an LL.B. from Yeditepe University, a B.A. in Communication from Istanbul University, and a European Master in Law and Economics from Bologna, Ghent, and Haifa Universities. \nDeeply engaged in AI governance, sh",
        "id": 4051340,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XjuIEMeiLe8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XjuIEMeiLe8/hqdefault.jpg",
        "title": "Can we code ethics into machines? | Dila Şen | TEDxEsade Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:18.799842+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:21:51+00:00",
        "description": "As AI systems race ahead, are we keeping up with responsibility? David Pereira, Global Head of Data & AI at SEIDOR, breaks down the ethical and strategic rules every leader should follow to build trustworthy technology. From real-world cases like Clearview AI to the balance between efficiency and humanity, David explores how companies can turn ethics into a competitive advantage.  David Pereira is a Telecommunications Engineer from the University of Vigo and holds a PDD from IESE Business School. As Global Head of Data & AI at SEIDOR, he drives the value of data and artificial intelligence across all markets where SEIDOR operates. In addition, he is an associate professor at digital business schools such as ISDI, where he teaches courses on Digital and Data-Driven Transformation as well as Artificial Intelligence. Alongside his professional career, David is a founding member of the editorial board of Springer's AI & Ethics journal and a member of the Advisory Board of the Catalonia Ob",
        "id": 4051341,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jho_PMH8JDY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jho_PMH8JDY/hqdefault.jpg",
        "title": "The three rules of responsible AI: From the lab to the boardroom | David Pereira | TEDxEsade Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:19.230912+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:21:46+00:00",
        "description": "We spent years memorizing formulas, grammar rules, and historical dates — but somehow, the most important lesson never made it into the syllabus. The one about our bodies, emotions, relationships, consent, and identity. The one that could’ve helped a generation grow up informed instead of confused.\n\nIn a culture where speaking about sex or intimacy is treated like a crime, silence has become our default teacher. Teenagers are left to learn about their own biology from the internet, whispers, or half-truths shared behind closed doors. Schools, bound by fear and tradition, pretend these conversations don’t exist — and in doing so, fail to protect the very students they aim to guide.\n\nIn his talk, Utsho dives deep into the uncomfortable truth: our education system skipped a chapter that could change lives. He explores how avoiding sex education doesn’t preserve innocence — it endangers it. Through raw honesty and empathy, he calls for a curriculum that doesn’t hide reality but prepares y",
        "id": 4051342,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TUYrkzYIwTg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TUYrkzYIwTg/hqdefault.jpg",
        "title": "The Lesson We Skipped | Utsho . | TEDxMUBC Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:19.626978+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:20:51+00:00",
        "description": "In a world addicted to constant stimulation, boredom has become something to avoid at all costs. But what if boredom is exactly what we need? This talk explores how embracing boredom can unlock creativity, clarity, and self-discovery. Through science, reflection, and humor, it challenges us to stop escaping quiet moments and start using them to think, dream, and create. Name: Asingwire Maria Michelle Kirabo\nAge: 19\nDate of Birth: 17/12/2005\nReligion: Catholicism\nPlace of Birth: Kampala, Uganda\nGender: Female\nNationality: Ugandan This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4051343,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ipk5iGz5BFA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ipk5iGz5BFA/hqdefault.jpg",
        "title": "Why Boredom Matters | Maria Asingwire | TEDxAga Khan HS Kampala Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:20.079594+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:20:36+00:00",
        "description": "What if artificial intelligence doesn’t take our jobs, but our ability to think? In this thought-provoking talk, executive coach Toni Liu explores how the rise of the attention economy and AI-generated content are reshaping our minds, focus, and creativity. Drawing from neuroscience, Eastern philosophy, and over a decade of coaching experience, she reveals how self-awareness and self-regulation are the antidotes to digital distraction.  Toni is an accredited careers and executive coach specialising in conscious leadership and value-based coaching. With 14+ years and over 4,000 coaching hours, she has worked with leading business schools (LBS, Bayes, Cambridge, Imperial, Esade, Henley) and global professionals to enhance employability, manage career transitions, and navigate leadership challenges.\nHaving lived and worked across three continents, she brings deep insight into cultural adaptation and supports professionals in building confidence and authenticity in global workplaces. Info",
        "id": 4051344,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PsA4QkBhEu0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PsA4QkBhEu0/hqdefault.jpg",
        "title": "AI, attention, and the power of self-regulation | Toni Liu | TEDxEsade Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:20.545880+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:20:28+00:00",
        "description": "In a world where anyone can write a book, compose music, or design art in hours with the help of artificial intelligence, what happens to human creativity? Lawyer and AI ethics advocate Laura Morató explores the groundbreaking Anthropic case, the largest copyright settlement in history, to uncover the tension between innovation and artistic integrity.  This talk is a call to future entrepreneurs, creators, and leaders to make choices that not only advance technology but also protect the human spirit behind it. Laura Morató is a lawyer specializing in data protection, technology, and intellectual property at Marimón Abogados in Barcelona. With extensive experience advising both national and international companies, she focuses on privacy, cybersecurity, AI regulation, and the ethical challenges of emerging technologies.\nShe holds a Law degree from the Universitat Oberta de Catalunya and the Universitat d’Andorra, and completed a Master’s in Legal Practice and a Master’s in Digital Law ",
        "id": 4051345,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GwWB9Ua9OVw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GwWB9Ua9OVw/hqdefault.jpg",
        "title": "The Anthropic case: Creativity on trial | Laura Morató | TEDxEsade Salon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:20.957063+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:19:55+00:00",
        "description": "Most of us build our careers like marble statues — fixed, flawless, and hard to change.\nBut what if success was never meant to be sculpted, only assembled?\nIn this TEDx talk, Gopal Iyer explores how purpose, courage, and connection can help us reimagine success — not as a race to the top, but as a journey of building, unlearning, and redesigning our lives.\nThrough personal stories and powerful insights, he reminds us that growth isn’t about perfection, but about possibility.\nBecause the future belongs to those who keep rebuilding. Gopal Iyer is the Founder & CEO of Career Shifts Consulting — an executive coach, entrepreneur, and host of the podcast Career Shifts – Journey to the Future.\n\nHe holds an Executive Programme in Strategic Management from IIM Kozhikode and is Stanford Certified in Design Thinking. With over two decades of leadership experience at global firms such as EY, Deloitte, and Target, Gopal made a bold shift — stepping away from the conventional path to explore what h",
        "id": 4051346,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=iqOHW2iINh0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iqOHW2iINh0/hqdefault.jpg",
        "title": "Why careers aren't marble statues | Gopal Iyer | TEDxYouth@JPSRanebennur",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:21.326460+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:19:20+00:00",
        "description": "O dönüm noktasının az öncesinde neler olur? Ali Sabancı, lisans eğitimini Tufts Üniversitesi Siyaset ve Ekonomi Bölümü’nde tamamlamış, ardından Columbia Business School’da Uluslararası Finans alanında MBA derecesi almıştır.\nAli Sabancı, ESAS’ın Yönetim Kurulu Başkanıdır. Aynı zamanda, ESAS’ın özel sermaye yatırımları arasında yer alan Pegasus Havayolları’nda Yönetim Kurulu Üyesidir ve ESAS Gayrimenkul’ün Yönetim Kurulu’nda da görev almaktadır.\nSosyal etkiyi sürdürülebilir bir biçimde iş dünyasının merkezine taşımayı amaçlayan ESAS Sosyal’in kurucularından biri olan Sabancı, Türkiye’de girişimcilik ekosisteminin gelişimine öncülük eden isimler arasındadır. 2009–2024 yılları arasında TOBB Genç Girişimciler Kurulu Başkanlığı görevini yürütmüş; bu dönemde Melek Yatırımcılık Mevzuatı, Global Girişimcilik Kongresi gibi girişimcilik ekosistemini güçlendiren birçok projeye liderlik etmiştir. This talk was given at a TEDx event using the TED conference format but independently organized by a l",
        "id": 4051347,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gIjHOoVZ6xM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gIjHOoVZ6xM/hqdefault.jpg",
        "title": "Dönüm Noktası | 2025 | Ali Sabancı | TEDxReset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:21.685594+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:18:05+00:00",
        "description": "Hayat hep şaşırtıcı. 1971 yılında dünyaya gelen Fırat Çakır, 1983‘te futbol ile başladığı spor hayatına atletizm ve masa tenisi ile devam etti. Bu dönem içerisinde katıldığı birçok turnuvada şampiyon oldu. Devamında Kung-Fu, Kick Boks ve Tayland Boksu üzerinde uzmanlaşıp bu dallarda eğitmenliğe başladı.\nİstanbul Anadolu yakasındaki ilk spor merkezi “Hit Form Club”’tan sonra Türkiye’nin en büyük spor merkezlerinden biri olan “Hit Form Life Club”’ı Göztepe’de kurdu. Yıllarca bu merkezi işlettikten sonra İstanbul Çekmeköy’de “Club 2006 Fitness Center”’i açarak o bölgede de hizmet verdi. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4051348,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=AZxNcQAv-IM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AZxNcQAv-IM/hqdefault.jpg",
        "title": "İnişler, Çıkışlar | 2025 | Fırat Çakır | TEDxReset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:22.051545+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:17:52+00:00",
        "description": "Bazen on saniye uzun gelir, bazen soluk alamazsın. Hava Harp Okulunda eğitim alarak pilot olan ilk Türk kadın havacıların izinde, 32 yıl aradan sonra 1992 yılında Hava Harp Okuluna alınan ilk kadın öğrencilerdendir. \n1996 yılında Hava Harp Okulundan Elektronik Mühendisi olarak Teğmen rütbesiyle mezun oldu. 1998 yılında pilotaj eğitimini tamamlayarak jet savaş pilotu oldu. \n1998 yılında F-5 uçağında yaptığı ses üstü uçuş ile Türkiye'de Ses Üstü Uçaklarla Uçuş Yapan İlk Türk Kadın Savaş Pilotu ünvanı ile havacılık tarihine adını yazdırdı.  Aynı zamanda Ses Üstü Uçaklarla Uçuş Yapan İlk Türk Kadın Savaş Pilotu Uçuş Öğretmenidir. \nTürk Hava Kuvvetlerinde 17 yıllık hizmetinin son 10 yılında F-16 ile uçacak savaş pilotlarına uçuş öğretmenliği eğitimi verdi. 2013 yılında Hava Kuvvetlerinden emekli olarak Sivil Havacılıkta özel bir uçuş okulunda Sivil Hava Yollarında pilot olarak görev yapacak pilot adaylarının seçimi ve uçuş eğitimlerinde Uçuş Öğretmeni ve Eğitim Müdürü olarak görev yaptı. T",
        "id": 4051349,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=TBWYljmRbhM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TBWYljmRbhM/hqdefault.jpg",
        "title": "Saniyenelerin Önemi | 2025 | Hürriyet Munanoğlu | TEDxReset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:22.463242+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:17:37+00:00",
        "description": "Bu orkestra şefleri bize arkalarını dönüp ne yaparlar? İtalyan-Türk asıllı orkestra şefi Nil Venditti, dünya çapında önde gelen orkestralar ve müzik toplulukları ile hızla önemli ilişkiler tesis etmektedir. Bu bağlamda, 2024/25 sezonundan itibaren Royal Northern Sinfonia'nın Baş Konuk Şefi pozisyonunu üstlenecek olması, kendisinin uluslararası müzik camiasındaki yükselen itibarının bir göstergesi olarak değerlendirilmektedir. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4051350,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=QOy97wyPF5c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QOy97wyPF5c/hqdefault.jpg",
        "title": "Orkestra Şefi Ne Yapar | 2025 | Nil Venditti | TEDxReset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:22.813699+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:17:27+00:00",
        "description": "Mutfaktan gelen ilham ışığı 1986 yılında İstanbul’da doğan Burcu Önal, dünya mutfakları arasında köprü kuran vizyoner bir şef, eğitmen ve girişimcidir. Kariyerine genç yaşta Uzak Doğu mutfağıyla başlayan Önal, Çin’de üniversite eğitimi almak için yola çıkıp mutfakta başlayan yolculuğunu, bugün 200’den fazla ülkede temsil edilen bir füzyon mutfak vizyonuna dönüştürmüştür.Yıllarca Do&Co’da uçan şef olarak görev alan Önal, Türk mutfağını dünyaya taşıyan özel etkinliklerde ve Formula 1, Expo, Michelin projelerinde sahne aldı. Bu yolculukta istasyon şefliğini de kariyerine ekledi; Osaka’nın ardından bugün Kolombiya’nın istasyon şefi olarak görev yapmaktadır. Bu pozisyonda hâlen aktif görev yapan tek kadın şef olarak uluslararası arenada öncü bir rol üstlenmektedir.\nBugün Burcu Önal, çok kültürlü mutfak yaklaşımı, eğitime verdiği önem ve öncü kadın şef kimliğiyle, gastronomi dünyasında güçlü bir ilham kaynağı olmaya devam etmektedir. This talk was given at a TEDx event using the TED confere",
        "id": 4051351,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ox4Z1KbLEb4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ox4Z1KbLEb4/hqdefault.jpg",
        "title": "Ghetto'da Fine Dining | 2025 | Burcu Önal | TEDxReset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:23.199645+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:17:04+00:00",
        "description": "Hayatın ve hayallerin küçük birer kopyasını çıkartmak nasıl oluyor. 2002 yılında Hatay’da doğan Didem Kalaycı, mekanların hafızası ve hikâye anlatıcılığına odaklanan bir diorama sanatçısı ve görsel hikaye anlatıcısıdır. Türkiye 188.’liği derecesiyle yerleştiği Anadolu Üniversitesi’nden Üstün Başarı Ödülü almıştır ve Sinema ve Televizyon Bölümü’nden mezun olmuştur. Öğrencilik yıllarından itibaren üretimlerini görsel sanatlar ve sinema arasında bir köprü kurarak şekillendirmiştir.\nKısa film çalışmalarından ilki Benlik ile sinema alanında üretimlerine başlayan Kalaycı, göçmenlik konusunu ele aldığı ikinci filmi Diaspora’yı ise tamamen kendi hazırladığı minyatür bir sette çekerek, diorama ve sinemanın kesişiminden özgün bir eser ortaya koymuştur.\nDiorama sanatında özellikle iç mekanlara ve bu mekanların hafızasını oluşturan eşyalara odaklanan Kalaycı, “insanın bir yerle ilişkisiyle kendisini de var ettiği” fikrinden yola çıkarak eserlerinde mekanların taşıdığı hikâyeleri görünür kılmaktad",
        "id": 4051352,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IYuMfwFVpBg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IYuMfwFVpBg/hqdefault.jpg",
        "title": "Küçük Hayatlar | 2025 | Didem Kalaycı | TEDxReset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T17:39:23.614040+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T17:13:49+00:00",
        "description": "El emeğinin kuyuma şekil verdiği sanat. 1965 yılında İstanbul’ da doğdu.\n1975 yılında amcası Hagop Arslanyan’ın yanında Zincirlihan’daki atölyede geleneksel kuyum sanatı ile tanıştı.\nLise eğitimini bitirene kadar, Hagop Arslanyan’ın atölyesine devam etti. 1985 yılında; Viyana, Köln, Amsterdam, Brüksel ve Paris’te mücevherat teknikleri eğitimleri aldı. Türkiye’ye döndükten sonra kendi atölyesini açtı. Cağaloğlu’nda bulunan atölyesinde Doğu ve Batı kültürünü harmanlayarak özgün tarzda kişiye özel takılar üretmeye başladı.\nTopkapı Sarayındaki eserlerden esinlenerek binlerce yıllık çini geleneğini Osmanlı’ya has murassa sanatı ile günümüzde buluşturdu. Sektörün önde gelen “murassa usta”larından biri oldu. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4051353,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EOsJeE4tJCg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EOsJeE4tJCg/hqdefault.jpg",
        "title": "Sadekar | 2025 | Hraç Arslanyan | TEDxReset",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:42.345796+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:21:41+00:00",
        "description": "In this TEDxBuffalo talk, Aitina Fareed-Cooke explores how creative arts can be a revolutionary act that challenges foster care statistics and labels empowering individuals to own their stories. From overcoming systemic barriers to becoming a visionary leader, her roots in foster care to her role as a creative arts strategist, she demonstrates that creative engagement fosters resilience, entrepreneurship, and community impact.\n\nMore than an artist, Aitina is a living testament to the healing power of the arts. Her story embodies resilience, innovation, and the transformative potential of creative expression to inspire the next generation of creatives. Aitina is the founder of Get Fokus’d Productions, an international award-winning digital storytelling company, national recording artist, speaker, creative educator, and serves as the Mayor-appointed Poet Laureate of Buffalo NY. With over 20 years of experience, she has impacted over 20,000 emerging creatives, raised nearly half a millio",
        "id": 4050601,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6ILh04qXvJ4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6ILh04qXvJ4/hqdefault.jpg",
        "title": "Using art to defy foster care statistics | Aitina Fareed-Cooke | TEDxBuffalo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:42.483047+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:21:38+00:00",
        "description": "Discover how to achieve your destiny and become the hero of your own story using game mechanics from the iconic tabletop role-playing game, Dungeons & Dragons. In this inspiring TEDx talk, Ashley Falletta shares her TTRPG framework, guiding you through character development, building community, unleashing imagination, and taking initiative to conquer your personal 'dragons' and achieve your life's purpose. Ashley Falletta is a ghostwriter, performer, and the founder of Prose Creative Writing Studio. She collaborates with entrepreneurs, visionaries, and thought leaders to transform their ideas into compelling, purpose-driven words that inspire action and leave a lasting legacy. She is also the face behind the TTRPG gaming brand CriticalNarrative, where she creates entertaining content and presentations around role-playing, character development, and storytelling within the gaming community. This talk was given at a TEDx event using the TED conference format but independently organized ",
        "id": 4050602,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_7dZ2R2L7NY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_7dZ2R2L7NY/hqdefault.jpg",
        "title": "How D&D skills can shape your real-life destiny | Ashley Falletta | TEDxBuffalo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:42.612161+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:20:59+00:00",
        "description": "Carolina Hernández Cufré, periodista argentina nos invita a hackear la mirada de que “lo que pasa afuera es siempre mejor que lo que hay adentro”. Con historias de argentinos que dicen “sí” frente a los desafíos, nos muestra cómo pequeños actos desde talleres, escuelas, pymes o comunidades pueden transformar su entorno, abrir oportunidades y contagiar esperanza. Una charla que nos recuerda que el cambio empieza con una decisión y que todos podemos ser protagonistas de nuestro propio impacto. Maragata, con los pies en Buenos Aires y el corazón en La Comarca, Caro Hernández Cufré es periodista en medios nacionales desde hace 16 años y está especializada en tecnología, innovación e inteligencia artificial. Como consultora, speaker y productora de contenidos en TV, crea y conduce programas, eventos e entrevistas que exploran el futuro de la tecnología con una mirada crítica y cercana. This talk was given at a TEDx event using the TED conference format but independently organized by a loca",
        "id": 4050603,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CJFPsF_dKtg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CJFPsF_dKtg/hqdefault.jpg",
        "title": "Personas que sí | Caro Hernández Cufré | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:42.753553+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:20:46+00:00",
        "description": "Ángeles Cortesi, diseñadora de futuros y especialista en innovación educativa, nos invita a imaginar lo imposible y a tomar las riendas de nuestro propio destino. En esta charla, Ángeles nos recuerda que el futuro no existe como línea recta: no hay un solo final, sino infinitos caminos posibles.\n\nA través de ejemplos provocadores, ejercicios prácticos y escenarios que parecen ciencia ficción y hoy ya son posibles, nos muestra cómo el diseño de futuros nos permite dejar de ser espectadores y convertirnos en protagonistas de nuestras vidas. Esta charla es un llamado a la acción: no esperes que el futuro llegue, ¡créalo! Ángeles Cortesi es diseñadora de futuros y ecosistemas de innovación, con más de 20 años hackeando las fronteras entre tecnología, diseño y desarrollo. Fundó el Global Learning Innovation Hub de UNICEF en Finlandia, donde movilizó más de 100M USD e impulsó proyectos de EdTech en 16 países. Su obsesión: conectar mundos, desafiar certezas y hacer de lo imposible, futuro. T",
        "id": 4050604,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=q7K26E-Xpbc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/q7K26E-Xpbc/hqdefault.jpg",
        "title": "Diseñá tu propia aventura | Ángeles Cortesi | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:42.876934+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:20:31+00:00",
        "description": "¿Se puede convertir el dolor en impulso? Juana Albina es actriz, bailarina y creadora digital. En esta charla nos comparte su historia de transformación y nos demuestra que sí. De adolescente entró en un “Escape Room” de su propia vida: un trastorno de conducta alimentaria que transformó su libertad en prisión. En su historia, cada pequeño paso hacia la recuperación se vuelve un acto de valentía. Aprendió que, aunque otros pueden acompañarte, la decisión de salir de la oscuridad depende únicamente de uno mismo. Hoy, Juana comparte su experiencia como un testimonio de resiliencia, autodescubrimiento y reconstrucción personal. Su mensaje va más allá de lo individual: nos invita a reflexionar sobre cómo la sociedad trata la salud mental y la percepción del cuerpo, y a valorar los gestos que ayudan a otros a encontrar su propia salida. Juana Albina, actriz, bailarina y creadora digital, construyó una comunidad de más de un millón de seguidores en redes sociales. Su vínculo con ellos está ",
        "id": 4050605,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3qVkLpffWpQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3qVkLpffWpQ/hqdefault.jpg",
        "title": "Golpes de evolución | Juana Albina | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:43.020973+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:20:08+00:00",
        "description": "Raúl Figueroa nos comparte su recorrido desde su barrio en Viedma (Río Negro, Argentina) hasta convertirse en realizador audiovisual. Una historia de perseverancia, pasión y apoyo comunitario: cómo los pequeños gestos de otros y la valentía de seguir su vocación transformaron su vida. Un relato inspirador sobre romper miedos, volver a empezar y confiar en el poder de perseguir lo que realmente amamos. Raúl Figueroa, realizador audiovisual nacido en un barrio de bajos recursos, descubrió su vocación al tomar por primera vez una cámara a los 18 años. Muchos lo recuerdan por su registro en redes de su viaje al Mundial de Qatar, pero su recorrido profesional trasciende esta anécdota deportiva y es testimonio del rol de las redes humanas en el camino por encontrar la vocación individual. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4050606,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=cz45XzuRr8E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cz45XzuRr8E/hqdefault.jpg",
        "title": "Pequeños gestos  construyen grandes historias | Raúl Figueroa | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:43.146442+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:20:00+00:00",
        "description": "Juan Pablo Montelpare nos invita a repensar el arte y su relación con la comunidad. Más allá de la institucionalización, explora cómo el arte ya habita en las prácticas cotidianas y rituales de las personas, transformando el espacio y la vida colectiva. Con ejemplos de su trabajo en la Bienal Internacional de Arte de Río Negro, Argentina, nos muestra que la comunidad no es espectadora, sino creadora activa, y que cada gesto cotidiano puede ser una obra de arte.\n Juan Pablo Montelpare, artista y gestor cultural, director de la Bienal Internacional de Arte de Río Negro que desde el 2022 se realiza en Valcheta, localidad de la Línea Sur rionegrina. Su trabajo se centra en la relación entre las obras, los artistas y las comunidades, con una mirada sobre el arte como herramienta de transformación. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4050607,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=uwn1aM0ANgA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uwn1aM0ANgA/hqdefault.jpg",
        "title": "Cuando el pueblo se volvió la obra de arte | Juan Pablo Montelpare | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:43.314772+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:19:44+00:00",
        "description": "Santiago “San Spiga” Spigarol nos invita a redescubrir el aprendizaje a través de la acción. Desde sus primeros dibujos hasta los Muraltares —altares comunitarios hechos en forma de murales—, nos muestra cómo el arte puede transformar espacios y unir a comunidades.\n\nCon humor, creatividad y ejemplos de sus talleres en escuelas, barrios y espacios públicos, San Spiga nos enseña que aprender es un acto colectivo, que la confianza y la participación activa son clave, y que cada mural puede convertirse en un lugar para celebrar, compartir y sentirse protagonista. San Spiga, muralista, diseñador gráfico y docente universitario. Es un apasionado de los procesos colectivos: crea Muraltares —altares comunitarios en forma de murales— y lleva su arte urbano a todas partes. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4050608,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=RrlD8Yn1n9I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RrlD8Yn1n9I/hqdefault.jpg",
        "title": "Se hace, Se aprende | Santiago Spigarol | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:43.460268+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:19:41+00:00",
        "description": "Matías Cella, ingeniero de sonido y productor musical, nos invita a descubrir cómo el sonido puede conectar artistas, culturas y emociones. En esta charla comparte su recorrido desde un piano de juguete hasta producir músicos de diferentes géneros y escenarios alrededor del mundo, mostrando cómo la música atraviesa el cuerpo y la mente, y cómo la producción se convierte en un puente entre la intención del artista y la percepción del público.\n\nCon sensibilidad y técnica, Matías nos enseña que el sonido no sólo se escucha: se siente, nos une y nos transforma, y que la curiosidad y la diversidad son la clave para crear experiencias musicales que nos hagan vibrar juntos. Ingeniero de sonido, productor y formador de la escena musical argentina. Ha trabajado con figuras como Soledad Pastorutti, Jorge Drexler, Kevin Johansen y Mercedes Sosa. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/",
        "id": 4050609,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zrzE8n6vJjE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zrzE8n6vJjE/hqdefault.jpg",
        "title": "El sonido como puente | Matías Cella | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:43.600031+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:19:40+00:00",
        "description": "Durante décadas, la energía nuclear fue rodeada de mitos, temores y estereotipos. En esta charla, Verónica Garea invita a mirar más allá de los prejuicios para descubrir el verdadero papel de la ciencia nuclear en nuestra vida cotidiana, su aporte frente a la crisis climática y el legado invisibilizado de las mujeres que la hicieron posible.\n\nCon una mirada clara y apasionada, propone repensar cómo construimos nuestras creencias sobre la ciencia y por qué la diversidad de voces —especialmente la de las mujeres— es clave para un futuro más justo, informado e inclusivo.\n\nVerónica Garea es ingeniera nuclear y referente en ciencia y tecnología núclear. Multifacética, combina su actividad profesional promoviendo la innovación y el desarrollo con triple impacto a través de su labor como música, docente, feminista y consultora en lactancia materna. Especialista en tecnología nuclear. Ingeniera nuclear (Instituto Balseiro), Doctora en Física de la Ingeniería. Presidenta de la Fundación INVAP ",
        "id": 4050610,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Fa0MBR-ayNM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Fa0MBR-ayNM/hqdefault.jpg",
        "title": "Artefactos, núcleos,mitos y mujeres | Verónica Garea | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:43.736304+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:18:47+00:00",
        "description": "Una pregunta tan simple como “¿cómo te das cuenta que está lloviendo?” cambió por completo la vida de Julieta Ansola. En esta charla, comparte cómo la pérdida de audición la llevó a descubrir el poder de la tecnología —y de la empatía— para abrir mundos y crear inclusión real.\n\nJulieta Ansola es ingeniera en tecnología, especialista en cloud computing e hipoacúsica. Convencida de que la innovación puede derribar barreras, impulsa una reflexión profunda sobre cómo diseñar un mundo donde todos puedan escuchar la lluvia. Ingeniera en tecnología, especialista en cloud computing. Hipoacúsica. Rompiendo barreras sobre discapacidad, género y tecnología. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4050611,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=s_DcPG9N9-4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s_DcPG9N9-4/hqdefault.jpg",
        "title": "¿Cómo te das cuenta que está lloviendo? | Julieta Ansola | TEDxViedma",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:43.927583+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:16:09+00:00",
        "description": "Stained glass isn’t dying. It’s misunderstood.\nIn this talk, stained glass preservationist and advocate Megan McElfresh challenges the myths that keep this ancient art form trapped in nostalgia.\nFrom sacred spaces to community revitalization, McElfresh explores how stained glass can be reframed as infrastructure: an act of generosity, not just a relic to be protected. Her talk confronts scarcity mindsets and survival-mode thinking, which are all too common in preservation work.\nThis is an invitation to reimagine the role stained glass plays in our world today and to choose growth, trust, and abundance in the face of decay.\nWhat will you see the next time you notice a bit of stained glass? Megan McElfresh is a nationally recognized speaker, writer, community advocate, and dedicated artisan with deep roots at the intersection of preservation trades, architectural glass art, and community service. Growing up in stained glass studios instilled in her a passion for hands-on creative trades",
        "id": 4050612,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hQEYErTq40s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hQEYErTq40s/hqdefault.jpg",
        "title": "How stained glass shatters the myth of inevitable decay | Megan McElfresh | TEDxBuffalo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:44.080007+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:15:38+00:00",
        "description": "The speaker reflects on cherishing identities and inclusivity while rejecting societal prejudices and labels, as a way forward for human development.   Alongside his academics, he is the winner of the prestigious Begum Jahan Ara Best Student Award. He is an ardent singer and his school's top performer in the grade-IX Matric Board Exam This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4050613,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ORJoNcTbZp4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ORJoNcTbZp4/hqdefault.jpg",
        "title": "Debunking Taboos | Onkar Singh | TEDxCrescent Model School Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:44.189735+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:15:19+00:00",
        "description": "In a world obsessed with being busy, Romanah Buchanan challenges us to rethink what it really means to move forward. Through her powerful story of resilience from building a business at 17 to facing her son’s time in intensive care she explores how purpose, not pace, defines true progress. Drawing from her background as a dancer and creative entrepreneur, Romanah introduces her five anchors Stretch, Pivot, Leap, Pause, and Rise as a framework for intentional purposeful living. This talk invites us all to stop chasing busyness and motion but to move with purpose. Romanah Buchanan is an award-winning creative entrepreneur, artistic director, and choreographer, known for her innovation and impact across the arts, education, and entrepreneurship. At just 17, she co-founded Eloquent Dance, which has grown into a multi-branch organisation spanning dance, education, talent, and creative spaces. Under her leadership, Eloquent received the Queen’s Award for Voluntary Service, the UK’s highest ",
        "id": 4050614,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ig3N9YnH1IQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ig3N9YnH1IQ/hqdefault.jpg",
        "title": "Move with purpose | Romanah Buchanan | TEDxAstonUniversity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:38:44.317324+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:15:16+00:00",
        "description": "Sul palco di TEDxLecco 2025 il compositore Mattia Vlad Morleo e la coreografa Anna Kolesarova hanno creato un momento sospeso in cui musica e movimento si cercano, si sfiorano e si rispondono. \n\nLa loro performance, ideata appositamente per l’evento, esplora il tema MIND THE GAP trasformando le distanze in possibilità, e il dialogo tra la delicatezza della musica classica e la vibrazione dell’elettronica diventa un territorio in cui gli opposti si incontrano e si riconoscono, mentre la coreografia di Anna dà corpo a ogni sfumatura del suono rendendo visibile ciò che vive tra una nota e l’altra. L’incontro con il compositore Mattia Vlad Morleo dà vita a uno spettacolo unico, dove la musica si intreccia in una narrazione intensa ed essenziale.\nMattia Morleo, classe 2000, è uno dei giovani compositori più apprezzati in Europa. Le sue musiche, tra cinema, arte e pubblicità, sono state scelte da Rai Storia, Vogue Germany, Ferrari e molti altri. Oggi è tra le voci più interessanti del minim",
        "id": 4050615,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FEOBKPvsXW8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FEOBKPvsXW8/hqdefault.jpg",
        "title": "Musica e danza | Mattia Morleo & Anna Kolesarova | TEDxLecco",
        "vote": 0
    }
]