[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T16:32:17.300553+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T16:00:03+00:00",
        "description": "Where Winds Meet is stunning, and one of 2025’s best experiences so far. The combat is outstanding, the campaign is genuinely intriguing, and the sheer volume of content is staggering. There are rough technical edges and the grind won’t be for everyone, and there’s always the worry that the economy could shift later, but right now Where Winds Meet is on the right path. \n\nIn its current state, it’s a genuinely good game you and your buddies can enjoy for weeks, with online hooks that add real longevity. With more narrative content promised, and hopefully aligned across regions, I’m eager to see where Everstone takes it next. For now, Where Winds Meet is a winner.",
        "id": 4050593,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=1PUAJLWTv5c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1PUAJLWTv5c/hqdefault.jpg",
        "title": "Where Winds Meet Review - A Stunning Open World Action RPG",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T14:19:08.223214+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T13:31:06+00:00",
        "description": "Microsoft may have shot itself in the foot over and over again this year – don't even get me started on this generation – but man alive, the Xbox Series X has games. Good games, at that! Plenty of exclusives have come and gone, some making a deeper mark than others, and even if Game Pass remains the most compelling aspect, it's nice to have 30 different and good games to fall back on. \n\nSo without further ado, here are our picks for the top 30 best Xbox Series X games of all time as of 2025, starting with number 30...",
        "id": 4049311,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=ypJydLPV4_0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ypJydLPV4_0/hqdefault.jpg",
        "title": "Top 30 Best Xbox Series X | S Games of All Time [2025 Edition]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-12T10:14:07.797052+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-12T10:00:39+00:00",
        "description": "Look, Breath of the Wild is an amazing game, debatably the single greatest game ever made, but we have now spent nearly a decade in its world and continuity. Not counting re-releases, we have had Breath of the Wild, its expansion, Age of Calamity, Tears of the Kingdom, and now Age of Imprisonment. To be perfectly honest, I am a little fatigued by this Hyrule, this Zelda, this Link, and this version of the Zelda mythos overall. \n\nOne of the strongest points in the franchise’s favour in the past has perennially been how each new game varied from its predecessors in every regard – story, characters, map, even art style. But we’ve been stuck with the Breath of the Wild rendition of Zelda and Hyrule for so long now, that I am honestly ready for something new. That isn’t this game’s fault, mind you – but it does mean that its inessential stay rankles more than it would if I didn’t feel this way.\n\nEventually, the Switch 2 will have its own proper Zelda game, and when it does happen, I hope i",
        "id": 4047483,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Nqj1UQNz15Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Nqj1UQNz15Y/hqdefault.jpg",
        "title": "One Week Later With Hyrule Warriors: Age of Imprisonment - Should You Still Buy It? [REVIEW]",
        "vote": 0
    }
]