[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T22:23:52.345617+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T21:48:00+00:00",
        "description": "California researchers planned a multimillion-dollar test of salt water-spraying equipment that could one day be used to dim the sun's rays &mdash; over a 3,900-square mile are off the west coasts of North America, Chile or south-central Africa. E&amp;E News calls it part of a \"secretive\" initiative backed by \"wealthy philanthropists with ties to Wall Street and Silicon Valley\" &mdash; and a piece of the \"vast scope of research aimed at finding ways to counter the Earth's warming, work that has often occurred outside public view.\"\n\n\"At such scales, meaningful changes in clouds will be readily detectable from space,\" said a 2023 research plan from the [University of Washington's] Marine Cloud Brightening Program. The massive experiment would have been contingent upon the successful completion of the thwarted pilot test on the carrier deck in Alameda, according to the plan.... Before the setback in Alameda, the team had received some federal funding and hoped to gain access to governmen",
        "id": 3213150,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/27/2146205/researchers-quietly-planned-a-test-to-dim-sunlight-over-3900-square-miles?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Quietly Planned a Test to Dim Sunlight Over 3,900 Square Miles",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T22:23:52.524413+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T19:59:00+00:00",
        "description": "Proton VPN reported a 1,400 percent hourly increase in signups over its baseline Friday &mdash; the day the UK's age verification law went into effect. For UK users, \"apps with explicit content must now verify visitors' ages via methods such as facial recognition and banking info,\" notes Mashable:\n\nProton VPN previously documented a 1,000 percent surge in new subscribers in June after Pornhub left France, its second-biggest market, amid the enactment of an age verification law there... A Proton VPN spokesperson told Mashable that it saw an increase in new subscribers right away at midnight Friday, then again at 9 a.m. BST. The company anticipates further surges over the weekend, they added. \"This clearly shows that adults are concerned about the impact universal age verification laws will have on their privacy,\" the spokesperson said... Search interest for the term \"Proton VPN\" also saw a seven-day spike in the UK around 2 a.m. BST Friday, according to a Google Trends chart. \n\nThe Fin",
        "id": 3213151,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/07/27/1957211/vpn-downloads-surge-in-uk-as-new-age-verification-rules-take-effect?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "VPN Downloads Surge in UK as New Age-Verification Rules Take Effect",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T19:38:46.597390+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T18:34:00+00:00",
        "description": "\"Search engines still require users to use critical thinking to interpret and contextualize the results,\" argues Aaron French, an assistant professor of information systems. But with the rise of generative AI tools like ChatGPT, \"internet users aren't just outsourcing memory &mdash; they may be outsourcing thinking itself.\"\n\nGenerative AI tools don't just retrieve information; they can create, analyze and summarize it. This represents a fundamental shift: Arguably, generative AI is the first technology that could replace human thinking and creativity. \n\nThat raises a critical question: Is ChatGPT making us stupid...? \n\n[A]s many people increasingly delegate cognitive tasks to AI, I think it's worth considering what exactly we're gaining and what we are at risk of losing. \n\"For many, it's replacing the need to sift through sources, compare viewpoints and wrestle with ambiguity,\" the article argues, positing that this \"may be weakening their ability to think critically, solve complex pr",
        "id": 3212104,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/07/27/1818251/is-chatgpt-making-you-stupid?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is ChatGPT Making You Stupid?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T19:38:46.794182+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T17:34:00+00:00",
        "description": "From the Adafruit blog:\n\nGreg Technology (aka Greg Sadetsky) on YouTube demonstrates a version of Chocolate Doom where opponent characters can be cut, copied, and pasted at will to add a bit more fun to the game. \n\nObviously this means you can paste in your attackers multiple times. (\"They're kind of not really happy if you do that...\" Greg says at one point in the video. \"But then, you can also cut them... like, vaccuum them out.\") \nIn response to a comment on YouTube, Sadetsky explained that \"It stores a reference to the kind of monster (every monster has a unique type number). \n\n\"So yeah, you could paste them across games!\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='It's+DOOM%2C+but+You+Can+Cut%2C+Copy+and+Paste+Opponents'%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F07%2F27%2F1640244%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class",
        "id": 3212105,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/07/27/1640244/its-doom-but-you-can-cut-copy-and-paste-opponents?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'It's DOOM, but You Can Cut, Copy and Paste Opponents'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T17:05:51.476381+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T16:34:00+00:00",
        "description": "Marvel's Fantastic Four: First Steps \"raked in about $57 million at the domestic box office for its opening day, according to multiple outlets,\" reports Forbes. \n\nThat haul makes it \"the year's second-largest opening day so far and a win for Marvel and Disney about a year after they announced a reduction in film and TV show quantity to focus on quality.\"\nThe roughly $57 million \"Fantastic Four: First Steps\" generated at the domestic box office Friday fell narrowly short of the opening day for \"A Minecraft Movie\" ($57.11 million) and just topped opening day for DC Comics rival \"Superman\" ($56.1 million), according to Variety. The film has netted about $106 million globally after securing $49.2 million overseas, setting itself up for an opening weekend of around $125 million, the same figure achieved by \"Superman\" earlier this month. \n\nFantastic Four: First Steps is receiving praise from critics and fans alike, boasting an 88% on Rotten Tomatoes and a 7.6/10 on IMDb... With its opening ",
        "id": 3210604,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/07/26/2225254/fantastic-four-tops-superman-opening-second-largest-of-the-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Fantastic Four' Tops 'Superman' Opening, Second-Largest of the Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T17:05:51.656573+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T15:34:00+00:00",
        "description": "Liquefied CO2 will be transported by ship to \"the world's first carbon shipping port,\" reports the Washington Post &mdash; an island in the North Sea where it will be \"buried in a layer of spongy rock a mile and a half beneath the seabed.\" \n\n\nNorway's government is covering 80% of the $1 billion first phase, with another $714 million from three fossil fuel companies toward an ongoing expansion (with an additional $150 million E.U. subsidy). As Europe's top oil and gas producer, Norway is using its fossil fuel income to see if they can make \"carbon dumping\" work.\n\n The world's first carbon shipment arrived this summer, carrying 7,500 metric tons of liquefied CO2 from a Norwegian cement factory that otherwise would have gone into the atmosphere... If all goes as planned, the project's backers &mdash; Shell, Equinor and TotalEnergies, along with Norway &mdash; say their facility could pump 5 million metric tons of carbon dioxide underground each year, or about a tenth of Norway's annual ",
        "id": 3210605,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/07/26/0358240/to-fight-climate-change-norway-wants-to-become-europes-carbon-dump?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "To Fight Climate Change, Norway Wants to Become Europe's Carbon Dump",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T17:05:51.836479+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T14:34:00+00:00",
        "description": "In 1995's online world, AOL existed mostly beside the internet as a \"walled, manicured garden,\" remembers Fast Company. \n\nThen along came AOHell \"the first of what would become thousands of programs designed by young hackers to turn the system upside down\" &mdash; built by a high school dropout calling himself \"Da Chronic\" who says he used \"a computer that I couldn't even afford\" using \"a pirated copy of Microsoft Visual Basic.\"\n[D]istributed throughout the teen chatrooms, the program combined a pile of tricks and pranks into a slick little control panel that sat above AOL's windows and gave even newbies an arsenal of teenage superpowers. There was a punter to kick people out of chatrooms, scrollers to flood chats with ASCII art, a chat impersonator, an email and instant message bomber, a mass mailer for sharing warez (and later mp3s), and even an \"Artificial Intelligence Bot\" [which performed automated if-then responses]. Crucially, AOHell could also help users gain \"free\" access to ",
        "id": 3210606,
        "language": "en-us",
        "link": "https://idle.slashdot.org/story/25/07/27/0015211/creator-of-1995-phishing-tool-aohell-on-piracy-script-kiddies-and-what-he-thinks-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Creator of 1995 Phishing Tool 'AOHell' On Piracy, Script Kiddies, and What He Thinks of AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T14:20:04.803913+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T11:34:00+00:00",
        "description": "NBC News reports:\n\n\nCustomers watched in disbelief as Florida police arrested a Chuck E. Cheese employee &mdash; in costume portraying the pizza-hawking rodent &mdash; and accused him of using a stolen credit card, officials said Thursday.... \"I grabbed his right arm while giving the verbal instruction, 'Chuck E, come with me Chuck E,'\" Tallahassee police officer Jarrett Cruz wrote in the report. \n\nAfter a child's birthday party in June at Chuck E. Cheese, the child's mother had \"spotted fraudulent charges at stores she doesn't frequent,\" according to the article &mdash; and she recognized a Chuck E. Cheese employee when reviewing a store's security footage. But when a police officer interviewed the employee &mdash; and then briefly left the restaurant &mdash; they returned to discover that their suspect \"was gone but a Chuck E. Cheese mascot was now in the restaurant.\" \nPolice officer Cruz \"told the mascot not to make a scene before the officer and his partner 'exerted minor physical",
        "id": 3204406,
        "language": "en-us",
        "link": "https://idle.slashdot.org/story/25/07/27/0532227/chuck-e-cheese-handcuffed-and-arrested-in-florida-charged-with-using-a-stolen-credit-card?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Chuck E. Cheese' Handcuffed and Arrested in Florida, Charged with Using a Stolen Credit Card",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T14:20:05.008108+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T07:34:00+00:00",
        "description": "\"A Chinese mega-constellation of communications satellites is facing serious delays,\" reports the South China Morning Post, \"that could jeopardise its ambitions to compete with SpaceX's Starlink for valuable orbital resources.\"\n\nOnly 90 satellites have been launched into low Earth orbit for the Qianfan broadband network &mdash; also known as the Thousand Sails Constellation or G60 Starlink &mdash; well short of the project's goal of 648 by the end of this year... Shanghai Yuanxin Satellite Technology, the company leading the project, plans to deploy more than 15,000 satellites by 2030 to deliver direct-to-phone internet services worldwide. To stay on track, Yuanxin &mdash; which is backed by the Shanghai municipal government &mdash; would have to launch more than 30 satellites a month to achieve its milestones of 648 by the end of 2025 for regional coverage and 1,296 two years later for global connectivity. \nThe New York Times reports that \"the other megaconstellation, Guowang, is eve",
        "id": 3204407,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/07/27/0233215/serious-delays-hit-satellite-mega-constellations-of-chinas-starlink-rivals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Serious Delays' Hit Satellite Mega-Constellations of China's Starlink Rivals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T14:20:05.236078+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T04:34:00+00:00",
        "description": "The vulnerability-watching \"Zero Day Initiative\" was started in 2005 as a division of 3Com, then acquired in 2015 by cybersecurity company Trend Micro, according to Wikipedia. \n\nBut the Register reports today that the initiative's head of threat awareness is now concerned about the source for that exploit of Microsoft's Sharepoint servers:\n How did the attackers, who include Chinese government spies, data thieves, and ransomware operators, know how to exploit the SharePoint CVEs in such a way that would bypass the security fixes Microsoft released the following day? \"A leak happened here somewhere,\" Dustin Childs, head of threat awareness at Trend Micro's Zero Day Initiative, told The Register. \"And now you've got a zero-day exploit in the wild, and worse than that, you've got a zero-day exploit in the wild that bypasses the patch, which came out the next day....\" \n\nPatch Tuesday happens the second Tuesday of every month &mdash; in July, that was the 8th. But two weeks before then, Mi",
        "id": 3204408,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/07/27/0337218/did-a-vendors-leak-help-attackers-exploit-microsofts-sharepoint-servers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Did a Vendor's Leak Help Attackers Exploit Microsoft's SharePoint Servers?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T14:20:05.450960+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T01:35:00+00:00",
        "description": "At this weekend's Comic-Con, \"Excitement has been high over the sneak peeks at Tron: Ares and Predator: Badlands,\" reports CNET. (Nine Inch Nails has even recorded a new song for Tron: Ares .) \n\n\n\nA few highlights from CNET's coverage:\n\n\nThe Coyote vs. Acme movie will hit theaters next year \"after being rescued from the pile of scrapped ashes left by Warner Bros. Discovery,\" with footage screened during a Comic-Con panel.\nThe first episode of Alien: Earth was screened before its premiere August 12th on FX.\nA panel reunited creators of the animated Avatar: The Last Airbender for its 20th anniversary &mdash; and discussed the upcoming sequel series Avatar: Seven Havens.\nA trailer dropped for the new Star Trek: Starfleet Academy series on Paramount+ (\"Star Trek Goes Full Gen Z...\" quips one headline.)\n\n\n\nTo capture some of the ambience, the Guardian has a collection of cosplayer photos. CNET notes there's even booths for Lego and Hot Wheels (which released toys commemorating the 40th ann",
        "id": 3204409,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/07/27/0131241/comic-con-peeks-at-new-alien-and-avatar-series-plus-predator-and-coyote-vs-acme-movies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Comic-Con Peeks at New 'Alien' and 'Avatar' Series, Plus 'Predator' and 'Coyote vs. Acme' Movies",
        "vote": 0
    }
]