[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T20:30:19.582279+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T15:30:18+00:00",
        "description": "For Mafia: The Old Country, developer Hangar 13 is culturally resetting the series. We’ve already discussed new mechanical and gameplay elements set to be introduced in other features so here, we’re going to discuss the differences Mafia: The Old Country harbours over its predecessor Mafia 3, focusing specifically on its non-gameplay elements: narrative, structure, themes, tone, and artistic presentation. \n\nIndeed, after gameplay and mechanical differences have been stripped away, we’re still left with starkly contrasting experiences between the two titles. Mafia: The Old Country represents not only a cultural shift for the series, but it’s the culmination of a philosophical refinement in how to craft games from the developer behind the series.\n\nBoth are Mafia games, but for The Old Country, the meaning has shifted.",
        "id": 3212345,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=ZoEfXn2-Whs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZoEfXn2-Whs/hqdefault.jpg",
        "title": "Mafia: The Old Country vs. Mafia 3 - WHAT'S CHANGING?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T20:30:19.754274+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T13:30:25+00:00",
        "description": "Madden NFL 26 is set to be the biggest overhaul of EA Sport’s long-running American Football simulation franchise that we’ve seen in a long time. Wholesale updates are coming to Franchise Mode, with particular emphasis on coaches. \n\nStrategic calls will be deeper and more meaningful, athlete management more involved, crafting the perfect gameplan more intuitive. EA Sports have zeroed in on detail too, utilising real-life NFL data to devise their AI systems. Furthermore, boons to presentation are set to ensure that actually playing Madden has the look and feel of a primetime TV broadcast. \n\nThere’s so much to unpack! This feature expands some of this year’s new inclusions further, outlining NFL 26’s biggest differences over last year’s version.",
        "id": 3212346,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=bq_L9DwaocA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bq_L9DwaocA/hqdefault.jpg",
        "title": "Madden NFL 26 vs. NFL 25  - 15 BIGGEST DIFFERENCES",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-27T20:30:19.926324+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-27T09:30:00+00:00",
        "description": "Liuyin’s World is the culmination of a three-part saga by KingnaGame, taking place in an cyber-fantasy world, a cyberpunk metropolis where humanity’s cyclical existence is being corroded by corrupt AI. \n\nFacing off against an army of enemies and mechanically reborn enemies in command of a cloaked hero swinging a sword and Soul Gun, Liuyin’s World pledges fast-paced, ‘aggression-first’ combat, exploration, upgradeable weapons, and highly conceptual world building. \n\nThe game’s demo is available now on PC via Steam, and although there’s still a ways to go for the developer, what's been presented thus far is steeped in promise and intrigue.",
        "id": 3212347,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=1GKbyEAk8Nc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1GKbyEAk8Nc/hqdefault.jpg",
        "title": "This Cyber Fantasy Action RPG Is All About Aggression, And It’s Glorious",
        "vote": 0
    }
]