[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-26T20:40:30.466337+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-26T20:30:00+00:00",
        "description": "Believe it or not, System Shock 2: 25th Anniversary Remaster has been in the works for quite some time. It would undergo a reboot of sorts, disappear from the radar, undergo a name change, and it's even seen a delay for other platforms. Nevertheless, it's a great time.\n\nMuch of that is due to how System Shock 2 has held up. The player's journey through the Von Braun, an FTL ship whose crew is infected by a parasitic force known as The Man, is a tense one. That's in no small part because of the atmospheric lighting, the peak sound design, and the overall flow and pacing. Of course, the gameplay is also pretty good, even with annoyances like weapon degradation and no respec.\n\nThe 25th Anniversary Remaster doesn't change the core loop or story but instead delivers a visually rich experience with a cleaner interface. It's the best way to experience the FPS/RPG, if you haven't already, and showcases why it's been influential for so long.",
        "id": 3028762,
        "language": null,
        "link": "https://www.youtube.com/watch?v=3MAIu7t00r4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3MAIu7t00r4/hqdefault.jpg",
        "title": "System Shock 2: 25th Anniversary Remaster Review - A Masterclass That Never Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-26T16:20:30.661214+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-26T15:30:11+00:00",
        "description": "It can be quite challenging to point to what exactly has made Death Stranding 2 soar to critical success. Is it the manner in which it builds on the mechanics and themes that Hideo Kojima introduced in the first game? Or is it the visually stunning, technically masterful open-world that he has brought to the table? \n\nThe answer is that it is a nuanced mix of everything that made the original game such a cult classic, with a healthy dose of new ideas and additions that have not only enthralled its players, but kept them on their toes. It’s an experience that no other title in modern gaming can offer, and is one that is sure to withstand the test of time as more players dive into what is sure to be among Kojima’s most ambitious projects yet.",
        "id": 3026616,
        "language": null,
        "link": "https://www.youtube.com/watch?v=K-UORX2z13o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/K-UORX2z13o/hqdefault.jpg",
        "title": "Why Are Millions ADDICTED To Death Stranding 2?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-26T14:10:31.774403+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-26T13:30:03+00:00",
        "description": "2025 has been a year of relative highs for the gaming industry with a slew of new releases that have begun to make the most out of current-gen hardware and the advantages it brings to a game’s visuals as well as its gameplay. From a DLC to 2023’s Lies of P to a sequel to Hideo Kojima’s massive hit Death Stranding 2, creative studios have brought innovative twists to traditional formulas across genres. \n\nWhile some ambitious games like MindsEye have failed to achieve the dizzying heights they aimed for, this has been a year of more hits than misses - a sign of more good things to come in the near future. \n\nWe take a look at 20 of the best games 2025 has given us so far.",
        "id": 3025335,
        "language": null,
        "link": "https://www.youtube.com/watch?v=3So66JFGywg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3So66JFGywg/hqdefault.jpg",
        "title": "Top 20 BEST Games of 2025 So Far [First Half]",
        "vote": 0
    }
]