[
    {
        "age": null,
        "album": "",
        "author": "FRONTLINE PBS | Official",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T17:26:20.590857+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T16:53:10+00:00",
        "description": "Leading up to Germany’s 2025 federal election, many people in the country’s southwest opened up their mailboxes to see something startling. Inside, they found fake tickets for a one-way flight out of Germany on election day, designed to look like real airline boarding passes. In the field where a passenger’s name would ordinarily appear, the fake tickets read instead: ILLEGAL IMMIGRANT.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate\n\nAs this video drawn from the new FRONTLINE documentary \"The Rise of Germany's New Right\" explores, the “deportation tickets” were part of an ad campaign by Germany’s far-right, nationalist Alternative for Deutschland (AfD) party. Tens of thousands of the flyers were distributed in mailboxes and at election campaign stands  — sparking accusations that the AfD, known for its polarizing use of rhetoric, was promoting racial hatred and echoing a grim Nazi-era history in which fake one-way",
        "id": 3982556,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=PJcx9h35BUM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 109,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PJcx9h35BUM/hqdefault.jpg",
        "title": "A German Far-Right Party’s Campaign Tactic: Fake ‘Deportation Tickets’ | FRONTLINE",
        "vote": 0
    }
]