[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T17:02:33.275124+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T16:00:43+00:00",
        "description": "Where Winds Meet might just seem like any other run-of-the-mill open world game. But look deeper beyond the stunning visuals and you're going to find that there's so much to discover and do in Qinghe and Kangfei that it might be easy to forget that they are just the beginning of a grand adventure. \n\nIt's a level of world-design that's very impressive considering how the game's story, combat, and exploration are all deftly weaved into its world, making the experience feel immersively authentic while having enough meat on its bones to be entertaining for hours on end. We dive into why we think this is an open world adventure that is poised to join modern gaming's greats, and why we can't wait to dive into it alongside you later this year.",
        "id": 3982435,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=PJTqSkwOSuY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PJTqSkwOSuY/hqdefault.jpg",
        "title": "I CAN’T WAIT To Lose Myself In The World of Where Winds Meet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T14:00:06.983055+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T13:31:00+00:00",
        "description": "Revenge is a dish that’s best served cold; and these single player games are a true embodiment of that idea in all its chilling intensity. From heartbreaking betrayals to deep personal losses and the quiet moments of rage in between, revenge has always been a powerful narrative force and certain games use it brilliantly to craft stories that leave a lasting mark. \n\nThese titles don’t just focus on payback; they explore the emotional weight behind it, the transformation it can potentially trigger, and the lengths a person will go once pushed to the edge. Whether driven by justice, anger, or pure survival, each journey feels unforgettable. To that effect, here are 15 such revenge-fueled games that are absolutely worth checking out.",
        "id": 3980690,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=mgqMj4T-d2E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mgqMj4T-d2E/hqdefault.jpg",
        "title": "15 Revenge-Fueled Single Player Games That HIT HARDER THAN YOU REMEMBER",
        "vote": 0
    }
]