[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T23:51:18.648025+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T23:10:00+00:00",
        "description": "Google's new \"Project Suncatcher\" aims to launch Tensor Processing Units (TPUs) into space, creating a solar-powered, satellite-based AI network\ncapable of scaling machine learning beyond Earth's limits. Google says a \"solar panel can be up to 8 times more productive than on earth\" for near-continuous power using a \"dawn-dusk sun-synchronous low earth orbit\" that reduces the need for batteries and other power generation. 9to5Google reports: These satellites would connect via free-space optical links, with large-scale ML workloads \"distributing tasks across numerous accelerators with high-bandwidth, low-latency connections.\" To match data centers on Earth, the connection between satellites would have to be tens of terabits per second, and they'd have to fly in \"very close formation (kilometers or less).\"\n \nGoogle has already conducted radiation testing on TPUs (Trillium, v6e), with \"promising\" results: \"While the High Bandwidth Memory (HBM) subsystems were the most sensitive component,",
        "id": 3985746,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/04/2236207/googles-next-moonshot-is-putting-tpus-in-space-with-project-suncatcher",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google's Next Moonshot Is Putting TPUs In Space With 'Project Suncatcher'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T22:50:14.568914+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T22:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Today, Samsung provided details about the next version of the HDR10 format, which introduces six new features. Among HDR10+ Advanced's most interesting features is HDR10+ Intelligent FRC (frame rate conversion), which is supposed to improve motion smoothing.\n \nA TV using motion smoothing analyzes each video frame and tries to determine what additional frames would look like if the video were playing at a frame rate that matched the TV's refresh rate. The TV then inserts those frames into the video. A 60Hz TV with motion smoothing on, for example, would attempt to remove judder from a 24p film by inserting frames so that the video plays as if it were shot at 60p. For some, this appears normal and can make motion, especially camera panning or zooming, look smoother. However, others will report movies and shows that look more like soap operas, or as if they were shot on higher-speed video cameras instead of film cameras. Critics, inc",
        "id": 3985396,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/04/2229238/new-hdr10-advanced-standard-will-try-to-fix-the-soap-opera-effect",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New HDR10+ Advanced Standard Will Try To Fix the Soap Opera Effect",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T21:49:39.653701+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T21:30:00+00:00",
        "description": "An anonymous reader shares a report: Microsoft officially ended mainstream support for Windows 10 last month, nudging users to upgrade to Windows 11. While that led to almost an overnight technological revolution in Japan, elsewhere, it has caused a lot of confusion. Certain versions of Windows 10, like Enterprise LTSC -- and those enrolled in the ESU program -- are still scheduled to receive security updates through at least 2027, but they're starting to see out-of-support messages in Settings. \n\nVarious users over the past few days reported that they're being subjected to end-of-life warnings in Windows, despite already qualifying for extended security updates through the ESU program. Windows 10 Enterprise LTSC 2021 and &#226;IoT Enterprise are business-oriented editions of the OS, so they're already supported up to 2032, but even they saw these incorrect messages. This widespread bug started to occur after the KB5066791 updates were pushed on October 14, 2025. \n\nMicrosoft has alrea",
        "id": 3984965,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/04/1942258/windows-10-update-incorrectly-tells-some-users-theyve-reached-end-of-life-despite-having-extended-support",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows 10 Update Incorrectly Tells Some Users They've Reached End-of-Life, Despite Having Extended Support",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T21:49:39.849479+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T20:51:00+00:00",
        "description": "Ferrari is tapping into crypto markets and tech-rich youngsters with a planned new digital token that its wealthiest fans will be able to use in an auction for a Ferrari 499P, the endurance car that won three straight Le Mans titles. From a report: The plan for now is limited in scope and is an effort by the Italian sports car maker to tap into a trend among luxury brands seeking access to the growing wealth of younger tech entrepreneurs, as AI and data centres drive investment and markets around the world. \n\nIt comes after Ferrari, which is also developing its first electric car, began accepting Bitcoin, ethereum and USDC for car purchases in the United States in 2023 and extended the service to Europe last year. Ferrari is working with Italian fintech Conio to launch the 'Token Ferrari 499P' for members of its Hyperclub -- which groups 100 of its most exclusive clients, with a passion for endurance races -- to trade amongst themselves and bid on the racing model.<p><div class=\"share",
        "id": 3984966,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/04/1935209/ferrari-aims-at-ai-generation-with-crypto-auction-for-le-mans-car",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ferrari Aims at AI Generation With Crypto Auction For Le Mans Car",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T20:47:53.352871+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T20:10:00+00:00",
        "description": "IBM will cut thousands of roles this quarter while it continues to shift focus to higher-growth software and services, Bloomberg News reported on Tuesday. From a report: \"We routinely review our workforce through this lens and at times rebalance accordingly,\" Bloomberg quoted a company spokesperson saying. \"In the fourth quarter we are executing an action that will impact a low single-digit percentage of our global workforce.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=IBM+To+Cut+Thousands+of+Roles+in+Focus+on+Software+Growth%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F04%2F1932232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F04%2F1932232%2Fibm-to-cut-thousands-of-roles-in-focus-on-software-growth%3Futm_source%3Dslashdot%26",
        "id": 3984475,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/04/1932232/ibm-to-cut-thousands-of-roles-in-focus-on-software-growth",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "IBM To Cut Thousands of Roles in Focus on Software Growth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T19:46:45.175859+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T19:30:00+00:00",
        "description": "Three employees at cybersecurity companies spent years moonlighting as criminal hackers, launching their own ransomware attacks in a plot to extort millions of dollars from victims around the country, US prosecutors alleged in court filings. From a report: Ryan Clifford Goldberg, a former incident response supervisor at Sygnia Consulting, and Kevin Tyler Martin, who was a ransomware negotiator for DigitalMint, were charged with working together to hack five businesses starting in May 2023. In one instance, they, along with a third person, received a ransom payment of nearly $1.3 million worth of cryptocurrency from a medical device company based in Tampa, Florida, according to prosecutors. \n\nThe trio worked in a part of the cybersecurity industry that has sprung up to help companies negotiate with hackers to unfreeze their computer networks -- sometimes by paying ransom. They are also accused of sharing their illicit profits with the developers of the type of ransomware they allegedly",
        "id": 3984038,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/04/1911217/ex-cybersecurity-staff-charged-with-moonlighting-as-hackers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ex-Cybersecurity Staff Charged With Moonlighting as Hackers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T19:46:45.332315+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T18:50:00+00:00",
        "description": "Amazon has sent a cease-and-desist letter to Perplexity AI demanding that the AI search startup stop allowing its AI browser agent, Comet, to make purchases online for users. From a report: The e-commerce giant is accusing Perplexity of committing computer fraud by failing to disclose when its AI agent is shopping on a user's behalf, in violation of Amazon's terms of service, according to people familiar with the letter sent on Friday. The document also said Perplexity's tool degraded the Amazon shopping experience and introduced privacy vulnerabilities, said the people, who spoke on condition of anonymity to discuss internal matters. \n\nIn response, Perplexity said Amazon is bullying a smaller competitor with a rival AI agent shopping product. The clash between Amazon and Perplexity offers an early glimpse into a looming debate over how to handle the proliferation of so-called AI agents that field more complex tasks online for users, including shopping. Like OpenAI and Alphabet's Goog",
        "id": 3984039,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/04/1839231/amazon-accuses-perplexity-of-computer-fraud-demands-it-stop-ai-agent-from-buying-on-its-site",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Accuses Perplexity of Computer Fraud, Demands It Stop AI Agent From Buying On Its Site",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T18:45:30.193607+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T18:12:00+00:00",
        "description": "Apple is preparing to enter the low-cost laptop market for the first time, developing a budget Mac aimed at luring away customers from Chromebooks and entry-level Windows PCs. Bloomberg News: The new device -- designed for students, businesses and casual users -- will target people who primarily browse the web, work on documents or conduct light media editing, according to people familiar with the matter. \n\n[...] Apple plans to sell the new machine for well under $1,000 by using less-advanced components. The laptop will rely on an iPhone processor and a lower-end LCD display. The screen will also be the smallest of any current Mac, coming in at slightly below the 13.6-inch one used in the MacBook Air. This would mark the first time that Apple has used an iPhone processor in a Mac, rather than a chip designed specifically for a computer. But internal tests have shown that the smartphone chip can perform better than the Mac-optimized M1 used in laptops as recently as a few years ago.<p>",
        "id": 3983497,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/04/1812238/apple-prepares-to-enter-low-cost-laptop-market-for-first-time",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Prepares To Enter Low-Cost Laptop Market for First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T17:44:47.548541+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T17:37:00+00:00",
        "description": "Speaking of Australia, its government has introduced content quotas on global streamers. From a report: The rules require Netflix, Prime Video and the other global streamers with more than one million Australian subscribers to spend 10% of their total Australian expenditure -- or 7.5% of their revenues -- on local originals, whether they are dramas, children's shows, docs, or arts and educational programs. \n\nFollowing the announcement, the legislation will be introduced into the Australian parliament. Australia's Labor government has long planned to being in the quotas as part of its Revive cultural policy, but months and months of delays had left the local industry wondering how committed their political leaders were to the plan. Global streamers have broadly rejected the necessity of quotas, claiming their local investment in content and jobs offsets them.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Australia+I",
        "id": 3982877,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/04/1737230/australia-introduces-landmark-streaming-content-quotas",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australia Introduces 'Landmark' Streaming Content Quotas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T17:44:47.687595+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T16:54:00+00:00",
        "description": "Britain's National Centre for Gaming Disorders has treated 67 people over the age of 40 since opening in 2019. The oldest patient was a 72-year-old woman with a smartphone gaming obsession. Britons over 65 spent more than three hours a day online on smartphones, computers and tablets last year, according to Ofcom. They spent more than five and a half hours watching broadcast television. Over-65s are more likely than under-25s to own tablets, smart televisions, e-readers, and desktop and laptop computers, a seven-country survey by GWI found. Nearly a fifth of 55- to 64-year-olds own a games console. \n\nIpsit Vahia, who heads the Technology and Ageing Laboratory at McLean Hospital, part of Harvard Medical School, said some older adults are increasingly living their lives through their phones the way teenagers or adolescents sometimes do. A 2022 study in South Korea estimated that 15% of those aged 60-69 were at risk of phone addiction. A meta-analysis published in April of studies on mor",
        "id": 3982878,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/04/1654219/meet-the-real-screen-addicts-the-elderly",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meet the Real Screen Addicts: the Elderly",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T16:44:07.414776+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T16:10:00+00:00",
        "description": "An anonymous reader shares a report: Before the potential of the internet was appreciated around the world, nations that understood its importance managed to scoop outsized allocations of IPv4 addresses, actions that today mean many users in the rest of the world are more likely to find their connections throttled or blocked. \n\nSo says Cloudflare, which last week published research that recalls how once the world started to run out of IPv4 addresses, engineers devised network address translation (NAT) so that multiple devices can share a single IPv4 address. NAT can handle tens of thousands of devices, but carriers typically operate many more. Internetworking wonks therefore developed Carrier-Grade NAT (CGNAT), which can handle over 100 devices per IPv4 address and scale to serve millions of users. \n\nThat's useful for carriers everywhere, but especially valuable for carriers in those countries that missed out on big allocations of IPv4 because their small pool of available number reso",
        "id": 3982345,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/04/1610204/isps-more-likely-to-throttle-netizens-who-connect-through-carrier-grade-nat-cloudflare",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ISPs More Likely To Throttle Netizens Who Connect Through Carrier-Grade NAT: Cloudflare",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T15:43:34.002477+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T15:25:00+00:00",
        "description": "AWS today announced Fastnet, a subsea fiber-optic cable that will link Maryland's Eastern Shore to County Cork, Ireland. The project marks Amazon's first wholly-owned subsea cable system after previously participating in similar ventures through consortiums. \n\nThe cable will carry data at speeds exceeding 320 terabits per second. Amazon did not disclose construction costs but expects the system to begin operations in 2028. The company is burying the cable roughly one and a half meters deep across the ocean floor. Installers will bore a horizontal tunnel from shore to shore. Amazon has added protective steel wiring to guard against ship anchors and deliberate sabotage.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Builds+First+Solo+Subsea+Cable+Linking+Maryland+To+Ireland%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F04%2F1516239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.f",
        "id": 3981735,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/04/1516239/amazon-builds-first-solo-subsea-cable-linking-maryland-to-ireland",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Builds First Solo Subsea Cable Linking Maryland To Ireland",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T15:43:34.171371+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T14:40:00+00:00",
        "description": "Dick Cheney, who served four Republican presidents and became one of the most powerful and controversial vice presidents in American history as an architect of the post-9/11 war on terror, died at 84. His family said he died from complications of pneumonia and cardiac and vascular disease. \n\nCheney served as vice president under George W. Bush for two terms beginning in 2001 and relentlessly advocated for the 2003 invasion of Iraq. Many Americans came to view the war as a strategic and humanitarian disaster. The conflict had far-reaching policy and political consequences that helped turn the public against intervention and upheaved Republican politics. Cheney continued to defend the invasion long after leaving office in 2009. \n\nHe had heart disease for most of his life and underwent a transplant in 2012. That allowed him to live to see his daughter Liz Cheney follow in his political footsteps to become a House GOP leader. Before serving as vice president, Cheney was defense secretary ",
        "id": 3981736,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/04/1437234/dick-cheney-powerful-former-vp-dies-at-84",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Dick Cheney, Powerful Former VP, Dies at 84",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T14:41:34.965321+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T14:07:00+00:00",
        "description": "Amazon's data-center expansion turned Umatilla, Oregon into an unlikely nerve center for American infrastructure investment. The community of roughly 8,000 residents has seen home prices double and local government budgets surge from $7 million in 2011 to a hundred and $44 million in the past fiscal year. Yesenia Leon-Tejeda, a Realtor and daughter of Mexican-born farmhands who once worked 12-hour shifts at a distribution center, is now on pace to close 35 deals this year. \n\nFederal data shows investment in software and information-processing equipment drove most of America's GDP growth in the first half of 2025. Goldman Sachs estimated that roughly 72% of all server-farm capacity sat in just 1% of counties as of July. The region's hydroelectric dams and cheap power attracted Amazon Web Services more than a decade ago. Growth has brought rising costs for housing and child care. Political tensions over spending erupted this year when Mayor Caden Sipe sued the city manager and council m",
        "id": 3981126,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/04/147232/what-happened-when-small-town-america-became-data-center-usa",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Happened When Small-Town America Became Data-Center, USA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T13:40:07.985991+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: U.S. prosecutors have charged two rogue employees of a cybersecurity company that specializes in negotiating ransom payments to hackers on behalf of their victims with carrying out ransomware attacks of their own. Last month, the Department of Justice indicted Kevin Tyler Martin and another unnamed employee, who both worked as ransomware negotiators at DigitalMint, with three counts of computer hacking and extortion related to a series of attempted ransomware attacks against at least five U.S.-based companies.\n \nProsecutors also charged a third individual, Ryan Clifford Goldberg, a former incident response manager at cybersecurity giant Sygnia, as part of the scheme. The three are accused of hacking into companies, stealing their sensitive data, and deploying ransomware developed by the ALPHV/BlackCat group. [...] According to an FBI affidavit filed in September, the rogue employees received more than $1.2 million in ransom payments",
        "id": 3980620,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/04/0317218/doj-accuses-us-ransomware-negotiators-of-launching-their-own-ransomware-attacks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DOJ Accuses US Ransomware Negotiators of Launching Their Own Ransomware Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T10:36:54.302390+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T10:00:00+00:00",
        "description": "Longtime Slashdot reader sinij shares a report from Car and Driver: Sales of electric vehicles surged in September as shoppers rushed to take advantage of the $7500 federal EV tax credit before it disappeared at the end of the month. With the government subsidies now gone, EV sales were expected to take a hit in October. While only a few automakers still report sales on a monthly basis, the results we do have do not paint a rosy picture for EVs in a post-tax credit world.\n \nThe Korean automakers were hit particularly hard by the loss of the tax credit. The Hyundai Ioniq 5, which was the fifth-best-selling EV through the third quarter of this year, experienced a 63 percent drop, moving 1642 units in October 2025, down from 4498 in 2024. Its platform-mates saw similar declines. The Kia EV6 moved just 508 units, down 71 percent versus the same month the year before, while the luxurious Genesis GV60 only found 93 buyers, a 54 percent slide year over year. Things were even worse at Honda. ",
        "id": 3979263,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/04/039212/ev-sales-plummet-in-october-after-federal-tax-credit-ends",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EV Sales Plummet In October After Federal Tax Credit Ends",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T07:33:32.441347+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T07:00:00+00:00",
        "description": "Australia's new \"solar sharer\" program will give households in NSW, south-east Queensland, and South Australia at least three hours of free solar power each day starting in 2026 -- even for those without rooftop panels. Other areas will potentially follow in 2027. The Guardian reports: The government said Australians could schedule appliances such as washing machines, dishwashers and air conditioners and charge electric vehicles and household batteries during this time. The solar sharer scheme would be implemented through a change to the default market offer that sets the maximum price retailers can charge customers for electricity in parts of the country. The climate change and energy minister, Chris Bowen, said the program would ensure \"every last ray of sunshine was powering our homes\" instead of some solar energy being wasted.\n \nAustralians have installed more than 4m solar systems and there is regularly cheap excess generation in the middle of the day. Part of the rationale for t",
        "id": 3978377,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/04/032244/australians-to-get-at-least-three-hours-a-day-of-free-solar-power---even-if-they-dont-have-solar-panels",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australians To Get At Least Three Hours a Day of Free Solar Power - Even If They Don't Have Solar Panels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T04:30:52.751700+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from CNN: An Antarctic glacier shrunk by nearly 50% in just two months, the fastest retreat recorded in modern history, according to a new study -- and the way it retreated could have big implications for global sea level rise. The Hektoria Glacier, roughly the size of Philadelphia, is on the Antarctic Peninsula, a spindly chain of mountains sticking off the continent like a thumb pointing toward South America. It is one of the fastest warming regions on Earth.\n \nGrounded glaciers like Hektoria, which rest on the seabed and don't float, generally retreat no more than a few hundred meters a year. But between November and December 2022, Hektoria retreated by 5 miles, according to the study published Monday in the journal Nature Geoscience. [...] Understanding more about why this happened is vital; if larger glaciers retreat at similar rates, it could have \"catastrophic implications for sea level rise,\" the authors wrote in a statement accompanying the",
        "id": 3977568,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/04/0026217/antarctic-glacier-saw-the-fastest-retreat-in-modern-history",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Antarctic Glacier Saw the Fastest Retreat In Modern History",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T02:29:05.316227+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T02:10:00+00:00",
        "description": "Bruce66423 shares a report from the Los Angeles Times: The board of the Los Angeles Department of Water and Power on Tuesday approved a controversial plan to convert part of the city's largest natural gas-fired power plant into one that also can burn hydrogen. In a 3-0 vote, the DWP board signed off on the final environmental impact report for an $800-million modernization of Units 1 and 2 of the Scattergood Generating Station in Playa del Rey. The power plant dates to the late 1950s and both units are legally required to be shut down by the end of 2029. In their place, the DWP will install new combined-cycle turbines that are expected to operate on a mixture of natural gas and at least 30% hydrogen with the ultimate goal of running entirely on hydrogen as more supply becomes available.\n \nThe hydrogen burned at Scattergood is supposed to be green, meaning it is produced by splitting water molecules through a process called electrolysis. Hydrogen does not emit planet-warming carbon dio",
        "id": 3977080,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/03/2351252/ladwp-says-it-will-shift-its-largest-gas-power-plant-to-hydrogen",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LADWP Says It Will Shift Its Largest Gas Power Plant To Hydrogen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T02:29:05.681348+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T01:30:00+00:00",
        "description": "A new class-action lawsuit accuses Spotify of allowing billions of fraudulent Drake streams generated by bots between 2022 and 2025, allegedly inflating his royalties at the expense of other artists. \"Spotify pays streaming royalties using a 'pro-rata' model based on an artist's market share,\" notes Consequence. \"Each month, revenue from subscriptions and ads is collected into a single, fixed 'pot' of money, which is then distributed to rights holders based on their percentage of the platform's total streams. Because this pot is fixed, an artist who artificially inflates their numbers through bots would dilute the value of every legitimate stream. This allows them to take a larger share of the pot than they earned, effectively siphoning royalties that should have gone to other artists.\" From the report: According to Rolling Stone, the lawsuit alleges bot use is a widespread problem on Spotify. However, Drake is the only example named, based on \"voluminous information\" which the compan",
        "id": 3977081,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/04/0011221/spotify-sued-over-billions-of-fraudulent-drake-streams",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Spotify Sued Over 'Billions' of Fraudulent Drake Streams",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T01:28:22.852276+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T00:50:00+00:00",
        "description": "concertina226 shares a report from The Register: [A massive power outage in April left tens of millions across Spain, Portugal, and parts of France without electricity for hours due to cascading grid failures, exposing how fragile and interconnected Europe's energy infrastructure is. The incident, though not a cyberattack, reignited concerns about the vulnerability of aging, fragmented, and insecure operational technology systems that could be easily exploited in future cyber or ransomware attacks.] This headache is one the European Commission is focused on. It is funding several projects looking at making electric grids more resilient, such as the eFort framework being developed by cybersecurity researchers at the independent non-profit Netherlands Organisation for Applied Scientific Research (TNO) and the Delft University of Technology (TU Delft).\n \nTNO's SOARCA tool is the first ever open source security orchestration, automation and response (SOAR) platform designed to protect pow",
        "id": 3976774,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/04/000255/ukraine-first-to-demo-open-source-security-platform-to-help-secure-power-grid",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ukraine First To Demo Open Source Security Platform To Help Secure Power Grid",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T00:27:43.877612+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from Tom's Hardware: After a turbulent weekend of updates and clarifications, AMD has published an entire web page to assuage user backlash and reaffirm its commitment to continued support for its RDNA 1 and RDNA 2-based drives, following a spate of confusion surrounding its recent decision to put Radeon RX 5000 and 6000 series cards in \"maintenance mode.\" This comes after AMD had to deny that the RX 7900 cards were losing USB-C power supply moving forward, even though the drive changelog said something quite different.\n \nJust last week, AMD released a new driver update for its graphics cards, and it went anything but smoothly. First, the wrong drivers were uploaded, and even after that was corrected, several glaring errors in the release notes required clarification. AMD was forced to correct claims about its RX 7900 cards, but at the time clarified that, indeed, RX 5000 and 6000 graphics cards were entering \"Maintenance Mode,\" despite some RX 6000",
        "id": 3976434,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/03/2142220/amd-will-continue-game-optimization-support-for-older-radeon-gpus-after-all",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AMD Will Continue Game Optimization Support For Older Radeon GPU's After All",
        "vote": 0
    }
]