[
    {
        "age": null,
        "album": "",
        "author": "Carrie",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-04T15:43:46.027012+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-04T15:11:15+00:00",
        "description": "<p>W 2020 roku młody mężczyzna, znany jako JK, starał się o przyjęcie do służb mundurowych. Napotkał jednak problem – w Krajowym Systemie Informacyjnym Policji (KSIP) nadal widniały informacje o postępowaniu karnym toczącym się dwa lata wcześniej. JK był podejrzany o spowodowanie wypadku komunikacyjnego, ale jego sprawę umorzono. Mężczyzna, który od tamtego czasu nie złamał prawa, zwrócił się do Komendanta Głównego Policji o usunięcie niekorzystnych danych z KSIP i&#8230; otrzymał odmowę. Postanowił zaskarżyć tę decyzję do UODO i w ten sposób rozpoczął się bardzo ciekawy, pięcioletni spór o prawo do ochrony danych osobowych. <span id=\"more-26700\"></span></p>\n<h3>Jak długo Policja może przechowywać Twoje dane?</h3>\n<p>Nie dłużej, niż to potrzebne. Zgodnie z art. 31 ust. 1 ustawy o ochronie danych osobowych przetwarzanych w związku z zapobieganiem i zwalczaniem przestępczości rolą administratora danych jest m.in. zapewnienie, aby dane osobowe były przetwarzane w konkretnych i uzasadnion",
        "id": 3981737,
        "language": "pl-PL",
        "link": "https://niebezpiecznik.pl/post/policja-nie-moze-przechowywac-danych-bez-wyraznego-celu-wazny-wyrok-nsa",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 239,
        "source_url": "https://feeds.feedburner.com/niebezpiecznik",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://niebezpiecznik.pl/wp-content/uploads/2025/11/plic-150x150.jpg",
        "title": "Policja nie może przechowywać danych bez wyraźnego celu – ważny wyrok NSA",
        "vote": 0
    }
]