[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:13:26.959360+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:01:08+00:00",
        "description": "This session recorded at Unreal Fest Stockholm explores the latest developments in Unreal Engine to support physics-based character movement in a multi-player environment. \n\nWatch for an overview of the Chaos Mover plugin, which adds physics-based movement using the Mover plugin framework, and learn how to set up a controllable character that interacts with its physical environment. \n\nYou’ll see examples of the new kinds of gameplay this unlocks and how the system can be extended to add physics-based movement to suit your game. \n\nIn addition, we look at how this works with Network Physics and how server corrections are handled smoothly with the new rewind/resimulation system.\n\nLearn more about Unreal Engine here: unrealengine.com\n\n#PhysicsBasedCharacters, #ChaosMover, #NetworkPhysics, #UnrealEngine, #UE5, #UnrealFestStockholm",
        "id": 4295611,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_jRLlTDqoGI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_jRLlTDqoGI/hqdefault.jpg",
        "title": "A Dive Into Networked Physics-Based Character Movement | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:06:50.032027+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T15:01:57+00:00",
        "description": "Watch this session recorded at Unreal Fest Stockholm as Epic Games Technical Content Developers Florian Dirmhirn and Samuel Bass go on an epic quest to answer the question, \"Can you make a classic real-time strategy game in Fortnite?\"\n\nThis session is a fun, lighthearted exploration of the outer limits of Unreal Editor for Fortnite development, showing developers how far from the strictures of third-person shooter design they can roam. \n\nFlorian and Sam discuss what went right, what went wrong, and what went hilariously awry, in the process breaking down how they created unique user interfaces and camera and play controls, set up hordes of characters, imbued them with unique NPC behaviors, built unique gameplay systems, and tied it all together Verse.\n\nUltimately, this session is a breakdown of advanced UEFN techniques for the modern creator—Verse-driven and almost entirely custom, from UI to controls to gameplay systems to assets—making for an almost complete break from the Fortnite ",
        "id": 4294970,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wV8nlfqQLYg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wV8nlfqQLYg/hqdefault.jpg",
        "title": "Florian and Sam Make a Real-Time Strategy Game in UEFN | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T11:37:05.017459+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T11:15:45+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Nickelodeon and Xentrix reveal how they leveraged Unreal Engine to revolutionize TV animation on hit new show ‘Max & the Midknights’. \n\nDiscover the team's new agile story pipeline built around Unreal Engine, Storyboard Pro, and Premiere, and how it blends the best qualities of live-action and animated filmmaking. \n\nThe session also introduces the team's novel production processes which marry Unreal Engine, Maya, Houdini, and Nuke for animation, lighting, FX, rendering, and composition.\n\nLearn more about making animation with Unreal Engine here: unrealengine.com/uses/animation\n\n#Animation, #Max&TheMidknights, #Nickelodeon, #Xentrix, #UnrealEngine, #UE5, #UnrealFestOrlando",
        "id": 4292415,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=RImKAqYpItU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RImKAqYpItU/hqdefault.jpg",
        "title": "Max & the Midknights: A Case Study in Modern TV Animation with Unreal | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T11:37:05.184164+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T10:30:40+00:00",
        "description": "Watch this session recorded at Unreal Fest Stockholm and get up to speed with Horde, Unreal Game Sync (UGS), studio telemetry, mobile dev iteration, and other dev ops workflows. \n\nThis talk gets into the weeds of how these systems work together and how you can easily set them up in your own studio environment, with the goal of saving you R&D time and enabling you to take full advantage of Unreal Engine’s dev op tools in 5.5 and above.\n\nWhat: A one-hour presentation that rapid-fires through hordes of configurations, with a special focus on mobile development using Android in all examples. \n\nWho: AA studios; studios that don't have someone on dev ops full-time; tech directors about to start reading Horde docs who want to accelerate their onboarding; indie studios; studios working on mobile development. \n\nWhy: To demystify Horde, prove that it’s not rocket science to set up—and demonstrate some of its advantages over other solutions. \n\nThe session is a must for those curious about automa",
        "id": 4292416,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=sZIOVNQfKxI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sZIOVNQfKxI/hqdefault.jpg",
        "title": "Introduction to Horde: A Technical Primer | Unreal Fest Stockholm 2025",
        "vote": 0
    }
]