[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T23:30:45.983717+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T23:20:00+00:00",
        "description": "A UC Berkeley professor, suspecting years of targeted computer damage against one Ph.D. student, secretly installed a hidden camera that allegedly caught another doctoral candidate sabotaging the student's laptop. The student now faces felony vandalism charges and is due for his first court appearance on Dec. 15. The Mercury News reports: A UC Berkeley professor smelled a rat -- over the years there had been $46,855 in damage from computers that failed, and nearly all of it seemed to affect one particular Ph.D. candidate at the college's Electrical Engineering and Computer Sciences department.\n \nThe professor wondered if the student's luck was really that bad, or if something else was afoot. So he installed a hidden camera -- disguised in a department laptop, and pointed it at the student's computer. According to police, the sly move captured another Ph.D. candidate, 26-year-old Jiarui Zou, damaging his fellow student's computer with some implement that caused sparks to fly out of the",
        "id": 4298676,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/11/222243/uc-berkeley-professor-uses-secret-camera-to-catch-phd-candidate-sabotaging-rival",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UC Berkeley Professor Uses Secret Camera To Catch PhD Candidate Sabotaging Rival",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T23:30:46.257080+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T22:40:00+00:00",
        "description": "During the company's first \"Autonomy &amp; AI Day\" event today, Rivian unveiled a major autonomy push featuring custom silicon, lidar, and a \"large driving model.\" It also hinted at a potential entry into the self-driving ride-hail market, according to CEO RJ Scaringe. TechCrunch reports: Rivian said it will expand the hands-free version of its driver-assistance software to \"over 3.5 million miles of roads across the USA and Canada\" and will eventually expand beyond highways to surface streets (with clearly painted road lines). This expanded access will be available on the company's second-generation R1 trucks and SUVs. It's calling the expanded capabilities \"Universal Hands-Free\" and will launch in early 2026. Rivian says it will charge a one-time fee of $2,500 or $49.99 per month.\n \n\"What that means is you can get into the vehicle at your house, plug in the address to where you're going, and the vehicle will completely drive you there,\" Scaringe said Thursday, describing a point-to-",
        "id": 4298677,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/11/2149239/rivian-goes-big-on-autonomy-with-custom-silicon-lidar-and-a-hint-at-robotaxis",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rivian Goes Big On Autonomy, With Custom Silicon, Lidar, and a Hint At Robotaxis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T22:25:05.508990+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The Wild West of copyrighted characters in AI may be coming to an end. There has been legal wrangling over the role of copyright in the AI era, but the mother of all legal teams may now be gearing up for a fight. Disney has sent a cease and desist to Google, alleging the company's AI tools are infringing Disney's copyrights \"on a massive scale.\" According to the letter, Google is violating the entertainment conglomerate's intellectual property in multiple ways. The legal notice says Google has copied a \"large corpus\" of Disney's works to train its gen AI models, which is believable, as Google's image and video models will happily produce popular Disney characters -- they couldn't do that without feeding the models lots of Disney data.\n \nThe C&amp;D also takes issue with Google for distributing \"copies of its protected works\" to consumers. So all those memes you've been making with Disney characters? Yeah, Disney doesn't like that,",
        "id": 4298252,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/11/2141219/disney-says-google-ai-infringes-copyright-on-a-massive-scale",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Disney Says Google AI Infringes Copyright 'On a Massive Scale'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T22:25:05.669230+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T21:22:00+00:00",
        "description": "Google's Chrome team has built an experimental browser called Disco that takes a query or prompt, opens a cluster of related tabs, and then generates a custom application tailored to whatever task the user is trying to accomplish. The browser launched Thursday as an experiment in Google's Search Labs. \n\nGenTabs, the core feature powering Disco, are information-rich pages created by Google's Gemini AI models -- ask for travel tips and the system builds a planner app; ask for study help and it creates a flashcard system. Disco -- named partly for fun and partly as shorthand for \"discovery\" -- started as a hackathon project inside Google before catching the team's imagination. \n\nParisa Tabriz, who leads the Chrome team, said that Disco is not intended as a general-purpose browser and is not an attempt to cannibalize Chrome. The experiment aims to test what happens when users move from simply having tabs to generating personalized, curated applications on demand. The capability relies on ",
        "id": 4298253,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/11/2022257/google-is-building-an-experimental-new-browser-and-a-new-kind-of-web-app",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google is Building an Experimental New Browser and a New Kind of Web App",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T21:19:28.815269+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T20:45:00+00:00",
        "description": "Cisco's stock price touched $80.25 on Wednesday, finally eclipsing its dotcom-era peak of $80.06 set on March 27, 2000 -- when the networking giant briefly surpassed Microsoft to become the world's most valuable company. The journey back took 25 years, eight months and 13 days. The company's fundamentals improved dramatically over that period, of course. Revenues have nearly quintupled since 1999, profits have quadrupled, earnings per share have grown eightfold, and margins have remained healthy throughout. Investors who bought at the peak still lost money to inflation for a generation. \n\nCisco's trajectory draws obvious comparisons to Nvidia, today's dominant \"picks and shovels\" supplier for the AI boom. Nvidia trades at a price-to-earnings ratio above 45 and an enterprise value-to-sales ratio near 24. At its 2000 peak, Cisco traded at a P/E above 200 and EV/sales of 31.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?stat",
        "id": 4297703,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/11/2013233/cisco-stock-hits-new-all-time-high-25-years-after-the-dotcom-bubble-burst",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cisco Stock Hits New All-Time High, 25 Years After the Dotcom Bubble Burst",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T20:07:29.637219+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T20:05:00+00:00",
        "description": "New York Governor Kathy Hochul on Thursday signed two bills aimed at regulating the use of AI in entertainment, requiring disclosure when ads feature AI-generated performers and mandating consent from heirs before a deceased person's likeness can be used commercially. Hochul described both measures as \"first in the nation\" policies during a signing ceremony at SAG-AFTRA's New York City offices. \n\nThe first bill compels ad producers to disclose the use of synthetic performers, and the second requires companies to obtain consent from heirs or executors before using a person's name, image, or likeness for commercial purposes after their death. \"We will have responsible AI policies in the state of New York,\" Hochul said. \"It's a time where we do want to embrace innovation. But not to the detriment of people.\" \n\nThe signing came the same day Disney announced a partnership allowing users of OpenAI's Sora to create clips featuring Marvel, Pixar, and Star Wars characters.<p><div class=\"share_",
        "id": 4297113,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/11/1953202/new-york-becomes-first-state-to-require-disclosure-of-ai-performers-in-ads",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New York Becomes First State To Require Disclosure of AI Performers in Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T20:07:29.821423+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T19:24:00+00:00",
        "description": "Uber has discontinued its monthly electric vehicle bonuses for drivers in the United States and Canada, marking the latest in a series of rollbacks from a company that once pledged to pour $800 million into helping its drivers transition away from gasoline-powered cars. The ride-hailing giant had previously eliminated its $1-per-ride EV perk last year, replacing it with monthly bonuses that required drivers to complete 200 rides. Those monthly payments are now gone too. \n\nThe company is far behind its self-imposed climate targets. Uber had pledged to reach 100% EVs in London by 2025 and across North America and Europe by 2030. Current figures paint a different picture: roughly 40% of miles in London come from EVs, while Europe sits at about 15% and North America at just 9%. The company's emissions have nearly doubled over the past three years and now exceed Denmark's total carbon footprint. Uber executives acknowledged to Bloomberg that they will likely miss their green targets. The c",
        "id": 4297114,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/11/1918242/uber-pulls-back-from-electric-cars-slashing-incentives-for-drivers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Uber Pulls Back From Electric Cars, Slashing Incentives for Drivers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T19:00:58.190684+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T18:45:00+00:00",
        "description": "OpenAI on Thursday released GPT-5.2, its latest and what the company calls its \"best model yet for everyday professional use,\" just days after CEO Sam Altman declared a \"code red\" internally to marshal resources toward improving ChatGPT amid intensifying competition from Google's well-received Gemini 3 model. The GPT-5.2 series ships in three tiers: Instant, designed for faster responses and information retrieval; Thinking, optimized for coding, math, and planning; and Pro, the most powerful tier targeting difficult questions requiring high accuracy. \n\nOpenAI says the Thinking model hallucinated 38% less than GPT-5.1 on benchmarks measuring factual accuracy. Fidji Simo, OpenAI's CEO of applications, denied that the launch was moved up in response to the code red, saying the company has been working on GPT-5.2 for \"many, many months.\" She described the internal directive as a way to \"really signal to the company that we want to marshal resources in this one particular area.\" \n\nThe comp",
        "id": 4296628,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/11/1844246/gpt-52-arrives-as-openai-scrambles-to-respond-to-gemini-3s-gains",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GPT-5.2 Arrives as OpenAI Scrambles To Respond To Gemini 3's Gains",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T19:00:58.383926+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T18:10:00+00:00",
        "description": "Since the Supreme Court struck down the federal prohibition on sports betting in 2018, 39 states have legalized the activity, and college campuses have emerged as ground zero for what appears to be a generational gambling problem among young men. A 2023 NCAA survey found that 60% of college students have gambled on sports, and 16% of 18-to-22-year-olds engage in what the organization classifies as problematic gambling. A Siena University poll from January found that 28% of men aged 18-to-34 who use sports-betting apps have had trouble meeting a financial obligation because of a lost bet. \n\nTimothy Fong, a psychiatry professor at UCLA, says every one of his recent clients has been an 18-to-24-year-old man seeking help for a sports-betting or cryptocurrency addiction. John Simonian, a personal-bankruptcy lawyer in Rhode Island, says he never used to see young men filing for bankruptcy -- now it's common. On November 7th, the NCAA announced it had uncovered three separate betting scandal",
        "id": 4296629,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/11/187218/college-campuses-have-become-a-front-line-in-americas-sports-betting-boom",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "College Campuses Have Become a Front Line in America's Sports-Betting Boom",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:57:08.571359+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:36:00+00:00",
        "description": "The Game Awards, which broadcasts tonight on Twitch, YouTube, and Prime Video, has become the biggest night on the video game calendar since launching in 2014, but the show's treatment of developers has drawn increasing criticism. At the 2023 ceremony, acceptance speeches were often cut off after roughly 30 seconds while Hideo Kojima received five minutes to discuss his upcoming game OD -- enough time for 13 acceptance speeches, Aftermath calculated. That year's show also ignored the industry's mass layoffs entirely; host Geoff Keighley acknowledged the labor crisis only at the 2024 ceremony. \n\nThe show's Future Class program, launched in 2020 to celebrate game makers representing an inclusive future for the industry, has quietly ended. No new class has been named for two years. \"At this time, we are not planning a new Future Class for this year,\" organizer Emily Weir told Game Developer.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twit",
        "id": 4295968,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/11/1737204/the-game-awards-are-losing-their-luster",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Game Awards Are Losing Their Luster",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:57:08.881493+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:44:00+00:00",
        "description": "An anonymous reader shares a report: Growing support for far-right parties is pressuring European governments to introduce stricter controls on immigration. Switzerland is set to vote on a proposal that would take the idea to the next level -- imposing a cap on its population [non-paywalled link]. The initiative could lead eventually to a blanket ban on new arrivals if the number of residents rises from around 9 million currently to above 10 million, with little distinction made between refugees, skilled workers and top managers on six-figure salaries. \n\nCitizens will likely vote on the proposal next year under the country's unique system of plebiscites on constitutional amendments and policy, and polls suggest there's a chance they'll approve it. The risk is it could lead to shortages of critical skills that end up harming Switzerland's competitiveness. The outcome will show how far citizens are willing to go to preserve some of the traits that made their country such an appealing de",
        "id": 4295969,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/11/1639230/why-switzerland-is-weighing-a-10-million-population-limit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Switzerland Is Weighing a 10 Million Population Limit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:47:43.966080+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:13:00+00:00",
        "description": "Stanford researchers spent much of the past year building an AI bot called Artemis that scans networks for software vulnerabilities, and when they pitted it against ten professional penetration testers on the university's own engineering network, the bot outperformed nine of them. The experiment offers a window into how rapidly AI hacking tools have improved after years of underwhelming performance. \n\n\"We thought it would probably be below average,\" said Justin Lin, a Stanford cybersecurity researcher. Artemis found bugs at a fraction of human cost -- just under $60 per hour compared to the $2,000 to $2,500 per day that professional pen testers typically charge. But its performance wasn't flawless. About 18% of its bug reports were false positives, and it completely missed an obvious vulnerability on a webpage that most human testers caught. In one case, Artemis found a bug on an outdated page that didn't render in standard browsers; it used a command-line tool called Curl instead of ",
        "id": 4295333,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/11/1613223/ai-hackers-are-coming-dangerously-close-to-beating-humans",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Hackers Are Coming Dangerously Close to Beating Humans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T15:41:53.868413+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T15:22:00+00:00",
        "description": "Disney is investing $1 billion in OpenAI and has entered into a three-year licensing deal that will let users generate AI-powered short videos and images featuring more than 200 characters from its Disney, Marvel, Star Wars and Pixar franchises. \n\nThe new features are expected to launch in 2026 through Sora, OpenAI's short-form video platform, and ChatGPT. A selection of user-generated short videos will also be available to stream on Disney+. The licensing agreement excludes any talent likenesses or voices. Disney will receive warrants to purchase additional OpenAI equity as part of the arrangement, and its employees will gain access to OpenAI tools including ChatGPT for building new products.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Disney+Puts+%241+Billion+Into+OpenAI%2C+Licenses+200%2B+Characters+for+AI-Generated+Videos+and+Images%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F12%2F11%2F1522244%2F%3Futm_sourc",
        "id": 4294724,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/11/1522244/disney-puts-1-billion-into-openai-licenses-200-characters-for-ai-generated-videos-and-images",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Disney Puts $1 Billion Into OpenAI, Licenses 200+ Characters for AI-Generated Videos and Images",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T15:41:54.077751+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T14:45:00+00:00",
        "description": "Opera has opened its AI-powered browser Neon to the public after a couple of months of testing, and anyone interested in trying it will need to pay $19.90 per month. The Norway-based company first unveiled Neon in May and launched it in early access to select users in October. Like Perplexity's Comet, OpenAI's Atlas, and The Browser Company's Dia, Neon bakes an AI chatbot into its interface that can answer questions about pages, create mini apps and videos, and perform tasks. The browser uses your browsing history as context, so you can ask it to fetch details from a YouTube video you watched last week. The subscription also grants access to AI models including Gemini 3 Pro and GPT-5.1.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Opera+Wants+You+To+Pay+%2420+a+Month+For+Its+AI+Browser%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F12%2F11%2F1430237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"ht",
        "id": 4294725,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/11/1430237/opera-wants-you-to-pay-20-a-month-for-its-ai-browser",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Opera Wants You To Pay $20 a Month For Its AI Browser",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T14:32:12.099044+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T14:05:00+00:00",
        "description": "Tourists from dozens of countries including the UK could be asked to provide a five-year social media history as a condition of entry to the United States, under a new proposal unveiled by American officials. From a report: The new condition would affect people from dozens of countries who are eligible to visit the US for 90 days without a visa, as long as they have filled out an Electronic System for Travel Authorization (ESTA) form. Since returning to the White House in January, President Donald Trump has moved to toughen US borders more generally - citing national security as a reason. \n\nAnalysts say the new plan could pose an obstacle to potential visitors, or harm their digital rights. Asked whether the proposal could lead to a steep drop-off in tourism to the US, Trump said he was not concerned. \"No. We're doing so well,\" the president said on Wednesday. \"We just want people to come over here, and safe. We want safety. We want security. We want to make sure we're not letting the",
        "id": 4294048,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/11/145213/us-could-ask-foreign-tourists-for-five-year-social-media-history-before-entry",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Could Ask Foreign Tourists For Five-Year Social Media History Before Entry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T13:23:43.265633+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Axios: OpenAI says the cyber capabilities of its frontier AI models are accelerating and warns Wednesday that upcoming models are likely to pose a \"high\" risk, according to a report shared first with Axios. The models' growing capabilities could significantly expand the number of people able to carry out cyberattacks. OpenAI said it has already seen a significant increase in capabilities in recent releases, particularly as models are able to operate longer autonomously, paving the way for brute force attacks.\n \nThe company notes that GPT-5 scored a 27% on a capture-the-flag exercise in August, GPT-5.1-Codex-Max was able to score 76% last month. \"We expect that upcoming AI models will continue on this trajectory,\" the company says in the report. \"In preparation, we are planning and evaluating as though each new model could reach 'high' levels of cybersecurity capability as measured by our Preparedness Framework.\" \"High\" is the second-highest lev",
        "id": 4293489,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/12/11/0040221/new-openai-models-likely-pose-high-cybersecurity-risk-company-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New OpenAI Models Likely Pose 'High' Cybersecurity Risk, Company Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T10:06:53.509408+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T10:00:00+00:00",
        "description": "schwit1 shares a report from CBS News: perm from a donor who unknowingly carried a cancer-causing gene has been used to conceive nearly 200 babies across Europe, an investigation by 14 European public service broadcasters, including CBS News' partner network BBC News, has revealed. Some children conceived using the sperm have already died from cancer, and the vast majority of those who inherited the gene will develop cancer in their lifetimes, geneticists said. The man carrying the gene passed screening checks before he became a donor at the European Sperm Bank when he was a student in 2005. His sperm has been used by women trying to conceive for 17 years across multiple countries.\n \nThe cancer-causing mutation occurred in the donor's TP53 gene -- which prevents cells in the body from turning cancerous -- before his birth, according to the investigation. It causes Li Fraumeni syndrome, which gives affected people a 90% chance of developing cancers, particularly during childhood, as we",
        "id": 4292178,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/11/0034259/sperm-donor-with-cancer-causing-gene-fathered-nearly-200-children-across-europe",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sperm Donor With Cancer-Causing Gene Fathered Nearly 200 Children Across Europe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T07:55:20.496039+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T07:00:00+00:00",
        "description": "NASA has lost contact with its MAVEN Mars orbiter after it passed behind Mars. When it remerged from behind the planet, the spacecraft never resumed communications. SpaceNews reports: MAVEN launched in November 2013 and entered orbit around Mars in September 2014. The spacecraft's primary science mission is to study the planet's upper atmosphere and interactions with the solar wind, including how the atmosphere escapes into space. That is intended to help scientists understand how the planet changes from early in its history, when it had a much thicker atmosphere and was warm enough to support liquid water on its surface.\n \nMAVEN additionally serves as a communications relay, using a UHF antenna to link the Curiosity and Perseverance rovers on the Martian surface with the Deep Space Network. NASA's Mars Odyssey and Mars Reconnaissance Orbiter spacecraft also serve as communications relays for the rovers, but are both significantly older than MAVEN. The spacecraft has suffered some tec",
        "id": 4291567,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/11/0026246/nasa-loses-contact-with-maven-mars-orbiter",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Loses Contact With MAVEN Mars Orbiter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T03:41:44.781947+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Apple on Wednesday released its annual list of the most downloaded apps and games for the year. For the U.S. market, OpenAI's ChatGPT topped the ranks of free iPhone apps (not including games) with the most installs in 2025. The AI app was followed by Threads, Google, TikTok, WhatsApp, Instagram, YouTube, Google Maps, Gmail, and Google's Gemini. ChatGPT made it to No. 4 last year, but the top spot was taken by Chinese shopping app Temu. In 2023, the AI app didn't make the top-10 list despite being released on the iPhone in May 2023 to a strong debut.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=ChatGPT+Is+Apple's+Most+Downloaded+App+of+2025%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F12%2F10%2F2250214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook",
        "id": 4290561,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/10/2250214/chatgpt-is-apples-most-downloaded-app-of-2025",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ChatGPT Is Apple's Most Downloaded App of 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T01:36:43.845985+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T00:50:00+00:00",
        "description": "A startup called Operation Bluebird is petitioning the US Patent and Trademark Office to strip X Corp of the \"Twitter\" and \"tweet\" trademarks, hoping to relaunch a new Twitter with the old brand, bird logo, and \"town square\" vibe. \"The TWITTER and TWEET brands have been eradicated from X Corp.'s products, services, and marketing, effectively abandoning the storied brand, with no intention to resume use of the mark,\" the petition states. \"The TWITTER bird was grounded.\" Ars Technica reports: If successful, two leaders of the group tell Ars, Operation Bluebird would launch a social network under the name Twitter.new, possibly as early as late next year. (Twitter.new has created a working prototype and is already inviting users to reserve handles.)\n \nMichael Peroff, an Illinois attorney and founder of Operation Bluebird, said that in the intervening years, more Twitter-like social media networks have sprung up or gained traction -- like Threads, Mastodon, and Bluesky. But none have the s",
        "id": 4290045,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/10/2245217/operation-bluebird-wants-to-relaunch-twitter-for-a-new-social-network",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Operation Bluebird Wants To Relaunch 'Twitter' For a New Social Network",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T00:29:13.216231+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T00:10:00+00:00",
        "description": "EU regulators say Google's Play Store changes still don't meet fairness rules and are preparing a potentially hefty 2026 fine unless Google makes deeper concessions. Reuters reports: Google Play has been in the European Commission's crosshairs since March, with regulators singling out technical restrictions preventing app developers from steering users to other channels for cheaper offers. Another issue is the service fee charged by Google for facilitating an app developer's initial acquisition of a new customer via Google Play which the regulator said goes beyond what is justified.\n \nTweaks to Google Play announced in August to make it easier for app developers to direct customers to other channels and choose a fee model are still falling short, the people said, with the EU antitrust regulator viewing Apple's recent changes to its App Store as a benchmark. [...] Google can still offer to make more changes before regulators impose a fine, likely in the first quarter of the next year, ",
        "id": 4289677,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/10/2238215/google-faces-fines-over-google-play-if-it-doesnt-make-more-concessions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Faces Fines Over Google Play If It Doesn't Make More Concessions",
        "vote": 0
    }
]