[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:17.139154+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T18:00:47+00:00",
        "description": "Call it a “loneliness crisis” or a “friendship recession,” but in an age of endless scrolling and shrinking social circles, many of us have forgotten how to make friends, especially how to make friends as an adult. In this inspiring and hopeful talk, friendship expert Sheridan Voysey explores why friendship has become one of the great challenges of our day, and shares three simple commitments that can spark a friendship revolution. \n\nThrough personal stories, humour, and cutting-edge research, Sheridan shows how friendship can not only boost our wellbeing and restore our sense of belonging, but also transform our society and shape a more connected future. This talk is perfect for anyone interested in relationships, social connection, wellbeing, personal growth, and adult friendships, offering practical insights and inspiration to prioritise the people who enrich our lives every day. \n\nSheridan Voysey is an author, broadcaster, and founder of Friendship Lab, a pioneering organisation h",
        "id": 4296338,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=h3oXB4I89YM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/h3oXB4I89YM/hqdefault.jpg",
        "title": "Why we suck at making friends (and 3 ways to improve) | Sheridan Voysey | TEDxSt Albans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:17.401773+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:59:35+00:00",
        "description": "In this bold TEDx talk, poet and journalist Aditya Tiwari shares how growing up gay in a small Indian town shaped his voice and nearly silenced it. From surviving homophobia to writing for global publications and becoming a BBC producer, Aditya reveals the unexpected force behind his journey: delusion.\n\nFor him, delusion means believing in a future no one else can see and chasing it with action, persistence, and unapologetic self-belief. Through poetry, activism, and journalism, he learned to turn rejection into fuel and untold stories into power.\n\nThis talk is a reminder: your dreams don’t need permission. Be delusional, just smart enough to make it real. Aditya Tiwari’s voice spans continents and platforms with his work featured in Times Of India, VICE, The Telegraph, Hindustan Times, and more. Whether it’s reporting from the ground, writing poetry, or producing podcasts, he captures the raw, real, and often overlooked stories of our time. This talk was given at a TEDx event using t",
        "id": 4296339,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pIdoHkol5V4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pIdoHkol5V4/hqdefault.jpg",
        "title": "How Expression Becomes Survival | Aditya Tiwari | TEDxVBIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:17.713569+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:59:27+00:00",
        "description": "Community-led sanitation shows how dignity and urban health are rebuilt from the ground up. Discover why sanitation and dignity must rise together: Sanitation and dignity rise and fall together, yet millions still navigate cities without safe toilets. This talk exposes how fragile urban life becomes when sanitation systems collapse, and how community-led infrastructure can transform that reality. Drawing on work with plumbers and residents, it reveals how simple maintenance can save millions of litres of water, prevent disease, and restore human dignity. From high-density settlements to global megacities, the lesson is universal: society cannot thrive if sanitation fails. When citizens organise, innovate, and insist on dignity, even the most neglected systems can be rebuilt from the ground up. As director of Sticky Situations, Jen van den Bussche works to improve water and sanitation services in high-density urban areas. Her projects combine technical solutions with community engageme",
        "id": 4296340,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MNh_1phAznY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MNh_1phAznY/hqdefault.jpg",
        "title": "Sanitation and dignity rise and fall together | Jen van den Bussche | TEDxJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:17.917092+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:59:09+00:00",
        "description": "Imagine ditching engineering and KPMG for stage lights. Aanchal went from a mute 6-year-old mourning her dad to fearlessly anchoring for thousands in Mumbai after 8 years. She synced her hidden self with the spotlight version, filters gone.\n\nNow hungry for psychology and philosophy, she calls out \"forever careers.\" Growth blooms in grey zones, failures rewire your world, and you ignore society's script. Forge ironclad self-trust. Nurture your roots first.\n\nFor the wide-eyed girl craving life's full spectrum, her mantra rings true. Shatter norms, chase evolution, and own your truth unapologetically. From a disciplined defense upbringing and excelling as a national athlete to transitioning from KPMG to becoming an award-winning emcee, Aanchal’s journey is a powerful tale of breaking boundaries and embracing change.\n\nHer accolades, including the National Child Award and her profound impact in the entertainment world, showcase how courage and resilience lead to extraordinary success. This",
        "id": 4296341,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SIOQmtW_p3s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SIOQmtW_p3s/hqdefault.jpg",
        "title": "The Courage to Listen Within | Aanchal Bajwa | TEDxVBIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:18.217897+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:59:01+00:00",
        "description": "Raised as the only Indian kid in Swiss and American classrooms, bullied for her identity, she found solace in music when her family returned to Chennai. A singing competition loss became her turning point, teaching her that dreams demand skill, practice, and grit.\n\nShe performed for free, chased opportunities, and built her craft through discipline. After 12th grade, she made a bold choice: move to India alone and pursue music professionally. Her breakout hit \"Mela\" and Top 12 finish on Indian Idol proved her sacrifice worthwhile.\n\nFrom isolation to inspiration, loneliness to stages heard nationwide, Aditi transformed nothing into something through courage and unwavering passion. Her story celebrates cultural identity reclaimed and the power of persistence Aditi’s journey as a playback singer and performer is a celebration of versatility and voice. Seamlessly transitioning across musical styles and platforms, she has built a vibrant identity that reflects both passion and evolution. H",
        "id": 4296342,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ovMTlpukvJk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ovMTlpukvJk/hqdefault.jpg",
        "title": "How I Reclaimed My Identity Through Music | Aditi Bhavaraju | TEDxVBIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:18.486503+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:58:58+00:00",
        "description": "From choosing computers over her mom's doctor dreams to founding Akin, Janaki's journey defies the script. She navigates engineering confusion, IT boredom, dusty infrastructure sites, and entrepreneurship before realizing drones could solve real problems beyond wedding photoshoots.\n\nCrashing prototypes, ignored pitches, rejection after rejection. She learns entrepreneurship isn't glamorous unicorn chases or LinkedIn success stories. It's surviving the big failures, being told no a hundred times, and showing up for the 101st attempt with unwavering grit.\n\nIn 1.5 years, Akin grew organically from an idea to Forbes 40 Under 40, government partnerships, and national recognition. Her philosophy: Don't build for applause, build for impact. Ignore the noise. Trust your intuition. Let confusion become clarity, and failure become fuel. From leading roles in top multinational companies to founding Akin Analytics, Janaki’s journey is one of growth, courage, and making a lasting impact through vi",
        "id": 4296343,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3zYYYVE0ugg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3zYYYVE0ugg/hqdefault.jpg",
        "title": "Why Curiosity Will Take You Further Than Confidence | Janaki Pulaparthi | TEDxVBIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:18.751758+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:58:49+00:00",
        "description": "Kalpika shares her fragmented life lessons through dance breakthroughs, academic pivots from stats to software, and acting stardom in Prayanam and SVSC. From a shy, bullied child inheriting her vitiligo-surviving mom's fears, she navigates health crises, career doubts, and emotional baggage.\n\nAfter 15 years of building her world, physical challenges and emotional weight led to a profound reset. Family stayed close, vulnerability opened doors, and she emerged stronger, seeing her true self daily as a work in progress.\n\nHer call stands clear. Nourish your body and mind first. Capture life's right frame with empathy, consciousness, and self-acceptance. Welcome every piece of you Kalpika’s journey from an emerging actor to a powerful on-screen presence is a testament to the depth and beauty of storytelling. With every character she embodies whether in films like Prayanam, Yashoda, or 8 A.M. Metro she brings fragmented human emotions to life, making them whole and deeply relatable. This ta",
        "id": 4296344,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=NkV1qHNREqc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NkV1qHNREqc/hqdefault.jpg",
        "title": "Healing What Hurt in Silence | Kalpika Ganesh | TEDxVBIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:18.974032+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:58:41+00:00",
        "description": "Swathi's rise from call center employee to Radio Mirchi's RJ and Instagram influencer is anything but polished. Five cruel comments about her education, voice, looks, and parenting became her proving ground. She transformed criticism into fuel, doubters into believers, and silence into a platform heard by thousands daily.\n\nWith barely one percent confidence, she walked into a Radio Mirchi audition and got selected. Now navigating a relentless routine of school runs, creative content, tutoring, and family dinners, she discovers her real superpower through listener messages. People cry watching her emotional reels, transform their lives through her words, and celebrate her milestones as their own.\n\nEvery talent lies dormant until you dare to explore it. Your career becomes your life when you choose passion over fear. Keep smiling, keep creating, keep inspiring. From a Mass Communication graduate to becoming one of the most beloved and familiar voices across the Telugu states, Swathi’s j",
        "id": 4296345,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vuo3jJQLzH4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vuo3jJQLzH4/hqdefault.jpg",
        "title": "Why You Don’t Need to “Fit In” to Succeed | Swathi Rayabarapu | TEDxVBIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:19.171024+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:58:33+00:00",
        "description": "Savitha Sastry, a classical Bharatanatyam dancer, reimagines an ancient art form for the digital age. Rather than diluting tradition, she preserves its sacred grammar while transforming its cinematic language. Through choreography, music, camera movement, and emotional pacing, Bharatanatyam transcends the stage and becomes pure storytelling on screen.\n\nIn her hands, classical dance isn't decoration. It's the narrative itself. Every gesture carries meaning. Every frame advances emotion. Even viewers unfamiliar with the art recognize themselves in the movement, saying, \"That's my story.\"\n\nBharatanatyam has evolved from temples to courts to concert halls. Now, standing at the digital threshold, Savitha asks a crucial question. \"Can classical art survive by staying archived, or should it evolve to breathe new truths into contemporary life?\" Savitha Sastry has redefined the art of Bharatanatyam, blending traditional movements with contemporary narratives to create powerful, modern expressi",
        "id": 4296346,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8HtVqgISf8Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8HtVqgISf8Y/hqdefault.jpg",
        "title": "Reimagining Bharatanatyam for the Digital Age | Savitha Sastry | TEDxVBIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:19.412463+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:44:02+00:00",
        "description": "Nesta palestra transformadora, Marcus Varandas revela como a fé (não como religião), mas como decisão, coragem e ação, salvou seu filho em coma após um tumor cerebral e redefiniu toda a sua vida. Ele compartilha os momentos mais intensos dentro da UTI, o instante em que ouviu dos médicos que o filho não acordaria mais, e como a escolha de acreditar antes de ver mudou absolutamente tudo. A mesma fé que tirou sua família do impossível foi a que guiou sua jornada como empreendedor no Nordeste, fundando uma empresa do zero, alcançando liderança nacional e sendo adquirida por uma gigante global. Aqui, Marcus mostra como todos nós enfrentamos “comas” emocionais, profissionais e espirituais, e como o Paradoxo da Fé pode ser o caminho para reacender sonhos, transformar crises e reconstruir futuros. Uma palestra que começa com dor, termina com esperança e promete marcar sua vida para sempre. Marcus Varandas é empreendedor, investidor, escritor e fundador do Grupo MVX, um ecossistema empresaria",
        "id": 4296347,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qdSYrfEuTSE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qdSYrfEuTSE/hqdefault.jpg",
        "title": "Inexplicável: como ter fé salvou meu filho e meu negócio | Marcus Varandas | TEDxJoaoPessoaSalon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:19.553845+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:41:35+00:00",
        "description": "I docenti sono giardinieri a cui ogni anno vengono affidati dei semi di cui possono e vogliono prendersi cura. Quei semi, uno diverso dall'altro, meritevoli di ascolto e di attenzione individuale, sono i vostri figli Daniele Manni insegna informatica e educazione alla mentalità imprenditoriale presso l'Istituto \n\"Costa\" di Lecce. Da oltre 20 anni incentiva i suoi giovani studenti ad ideare e condurre piccole attività imprenditoriali innovative (startup), sia economiche che sociali. La sua particolare tecnica didattica denominata \"Learning (entrepreneurship) by doing (startups)\" ha ricevuto numerosi premi e riconoscimenti, nazionali ed internazionali. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4296348,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zjvIrb5D_88",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zjvIrb5D_88/hqdefault.jpg",
        "title": "Chi semina creatività, raccoglie startup | Daniele Manni | TEDxLecce",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:19.772711+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:40:45+00:00",
        "description": "Sur l’île d’Hatamin, en Indonésie, Martin Colognoli, biologiste marin et photographe, découvre, aux côtés d’une communauté de pêcheurs, une vérité inattendue : le corail n’est pas seulement un organisme à sauver. C’est un maître du vivant, résilient, symbiotique, lent et coopératif.\n\nDans ce talk poétique et scientifique, il partage comment l’observation du récif a transformé sa vision de la conservation, pour nous inviter à un changement de regard : apprendre du corail pour repenser notre place dans le vivant.\n\nLe corail a 500 millions d’années d’expérience. Il a traversé cinq extinctions.\nEt s’il détenait les clés de notre propre survie ? Biologiste marin, photographe et spécialiste du corail, Martin Colognoli a passé plusieurs années sur le terrain, immergé au cœur des récifs coralliens, pour contribuer à leur préservation. Cette expérience a profondément transformé sa manière de voir, de décider et d’agir.\nAujourd’hui basé en France, il poursuit cette recherche à travers des expos",
        "id": 4296349,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=DmQ4vw1KL_s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DmQ4vw1KL_s/hqdefault.jpg",
        "title": "Et si ce n’était pas à nous de protéger le corail ? | Martin Colognoli | TEDxGeneva",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:19.946357+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:40:37+00:00",
        "description": "Tre improvvisazioni musicali per tre momenti diversi a TEDxLakeComo 2025 su tre notissime canzoni: \"Parlami d'amore, Mariù\", \"Lambada de serpente\" e \"On the sunny side of the Street\" del trio composto da Marco Bianchi al vibrafono, Elisa Simonetto alla chitarra elettrica e Filippo Valnegri alla batteria.\nThree musical improvisations for three different moments at TEDxLakeComo 2025, based on three well-known songs: *“Parlami d’amore, Mariù,” “Lambada de serpente,”* and *“On the Sunny Side of the Street.”*Performed by the trio composed of Marco Bianchi on vibraphone, Elisa Simonetto on electric guitar, and Filippo Valnegri on drums.\n Marco Bianchi “Vibes”, tra i più eclettici vibrafonisti europei, ha all’attivo oltre 2’500 concerti, 80 dischi, 200 collaborazioni e più di 300 brani depositati alla SIAE per teatro, TV e video. È anche autore comico di sketch TV. Presenta il nuovo Vibes Trio con Elisa Simonetto (chitarra) e Filippo Valnegri (batteria), una formazione Jazz di altissimo live",
        "id": 4296350,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wEjgp_yChTI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wEjgp_yChTI/hqdefault.jpg",
        "title": "Marco Bianchi Vibes live | Marco Bianchi Vibes con Elisa Simonetto e Filippo Valnegri | TEDxLakeComo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:20.127408+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:39:33+00:00",
        "description": "In an age dominated by the digital — we must learn to cherish the analogue aspects of our lives. She will challenges us to reflect on the role of technology, data, and privacy in shaping what it means to be human.\n\nThe Power of Analog becomes an invitation to rethink our relationship with technology — to protect the spaces where we are unobserved, unpredictable, and chaotically human. Carissa Véliz is an Associate Professor in Philosophy at the Institute for Ethics in AI, and a Fellow at Hertford College at the University of Oxford. She is the recipient of the 2021 Herbert A. Simon Award for Outstanding Research in Computing and Philosophy. She is the author of the highly-acclaimed Privacy Is Power (an Economist book of the year, 2020) and the editor of the Oxford Handbook of Digital Ethics. She is a member of UNESCO’s Women 4 Ethical AI. She advises companies and policymakers around the world on privacy and the ethics of AI. She is a board member of the Proton Foundation, along with ",
        "id": 4296351,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=IvJeUQ9Egnk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IvJeUQ9Egnk/hqdefault.jpg",
        "title": "The power of analogue | Carissa Veliz | TEDxGeneva",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T18:38:20.326181+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:39:25+00:00",
        "description": "How do you turn setbacks into growth opportunities? Drawing from chaos theory, we will explore why embracing unpredictability and tiny changes isn’t just scientifically sound, but it’s essential for growth. Christos Lazaridis is a Learning & Knowledge Management Architect at ASML, an ex-CERN physicist and a computer geek for as long as he can remember. His journey from probing the fundamental particles of the universe to designing learning experiences reflects his belief that complex systems (whether in particle physics or our personal development) thrive when embracing uncertainty and iteration.\nToday, Christos designs learning experiences and knowledge management solutions that help people develop new skills and navigate complexity. His work sits at the intersection of learning innovation, scientific thinking and human development, where the principles of chaos theory offer valuable insights for cultivating a growth mindset. This talk was given at a TEDx event using the TED conferen",
        "id": 4296352,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2zlp1aC0maQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2zlp1aC0maQ/hqdefault.jpg",
        "title": "How to leave your comfort zone—using chaos theory | Christos Lazaridis | TEDxGeneva",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:12.975681+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:15:57+00:00",
        "description": "Kathy introduces the “Aim Anyway” formula—a practical framework for sparking positive change even amid uncertainty and imperfection. Through stories of local, national, and global impact, she demonstrates how courage, good character, and collaborative action can help anyone make their corner of the world safer, kinder, and better. This talk is an invitation to discover what matters, connect with others, and take meaningful steps toward a brighter future—together as neighbors. A chemist turned tech founder, Kathy Green acknowledges that while human institutions are inherently imperfect, imperfection is an opportunity to keep leveling up, not a reason to give up. With decades of experience across chemical operations, logistics, and commercial roles, she has led international product lines, rebuilt relationships after business disputes, and contributed marketing strategies to startups in China. These experiences deepened her belief in the power of learning by doing. Kathy carries that be",
        "id": 4295693,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=mT4jiYHu4rM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mT4jiYHu4rM/hqdefault.jpg",
        "title": "A formula for progress in an imperfect world | Kathy Green | TEDxBellevueWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:13.158336+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:15:43+00:00",
        "description": "Tomás apresenta algumas curiosidades e desafios de ser gêmeo idêntico. Ele explica como funciona essa condição rara, compartilha situações engraçadas e mostra que, apesar das semelhanças físicas, cada gêmeo tem sua própria personalidade. Tomás Saboia tem 11 anos, é aluno do 5º ano do Colégio Santo Inácio e vive uma experiência rara: ser gêmeo univitelino. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295694,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XMtnPEaU83Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XMtnPEaU83Q/hqdefault.jpg",
        "title": "Como é ser gêmeo idêntico? | Tomás Carmo | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:13.324566+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:15:35+00:00",
        "description": "Théo Padula explora um mistério fascinante: por que a música nos emociona? Ele investiga como padrões melódicos e harmônicos despertam sentimentos, questiona se a música é uma linguagem própria e apresenta teorias sobre sua influência, mostrando que essa arte vai muito além do som. Théo é aluno do 3º ano do Colégio Santo Inácio e apaixonado por música. Curioso e criativo, além de estudar para o vestibular, ele estuda e toca piano desde pequeno. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295695,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Dh4hgTz1tr0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Dh4hgTz1tr0/hqdefault.jpg",
        "title": "O poder da música | Théo Padula | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:13.511694+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:15:31+00:00",
        "description": "João Abritta aborda a importância de cuidar do planeta, nossa “Casa Comum”, destacando os impactos da poluição atmosférica e suas principais causas. Ele apresenta soluções inovadoras implementadas no Brasil e no mundo, além de sugerir ações locais. Aluno do 4º ano do Colégio Santo Inácio, João é curioso e se preocupa com o futuro do nosso planeta. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295696,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=65RynONgM-0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/65RynONgM-0/hqdefault.jpg",
        "title": "Cuidado com a Casa Comum | João Abritta de Moura | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:13.647588+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:15:23+00:00",
        "description": "Annette illustrates how limited resources and challenging circumstances shaped her early life and perspective. Through the lens of her experience—where imagination was stifled by lack of exposure—the concept of \"futuring\" is introduced as the missing piece that empowers individuals to envision new possibilities. The narrative emphasizes that futuring is not just about dreaming, but about actively designing and pursuing a path toward a better reality. By learning to future, anyone can transform hopes into concrete steps, making their own vision achievable and attainable. Annette Diggs is a scientist, certified ski instructor, mountaineer, and humanitarian whose work lives at the intersection of equity, adventure, and transformation. She is the founder of EDGE Outdoors, a Black woman-led organization redefining who belongs in mountain spaces by creating pathways for Black, Indigenous, and Women of Color to access snow sports, outdoor leadership, and wellness. Annette’s early life was sh",
        "id": 4295697,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BZP4OXTCy7c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BZP4OXTCy7c/hqdefault.jpg",
        "title": "From Vision to Reality: The Art of Futuring | Annette Diggs | TEDxBellevueWomen",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:13.784403+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:15:19+00:00",
        "description": "Manuela aborda os desafios da adolescência nos dias atuais, incluindo mudanças físicas e emocionais, influência das amizades, riscos do uso excessivo de telas, fake news, bullying e pressão para crescer antes da hora. Destaca a importância do apoio familiar, da orientação e dos limites para garantir uma adolescência saudável e segura, além de trazer reflexões pessoais sobre expectativas para essa fase. Manuela é estudante do 5º ano do Colégio Santo Inácio e gosta de aproveitar a vida e cada uma das suas fases. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295698,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=MPQtOpuem_g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MPQtOpuem_g/hqdefault.jpg",
        "title": "Adolescência nos dias atuais | Manuela Taboada Fontanella | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:14.008406+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:15:04+00:00",
        "description": "Lícia compartilha sua experiência como atleta de vôlei e mostra que dedicação, disciplina e autoconfiança podem superar qualquer expectativa. Ela desafia padrões e prova que talento e determinação são mais importantes do que altura, inspirando todos a não desistirem dos seus sonhos. Lícia tem 10 anos, é aluna do 5º ano do Colégio Santo Inácio e atleta de vôlei. Apaixonada pelo esporte, ela treina três vezes por semana e sonha em ser levantadora. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295699,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=c_N9QLtl1gc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/c_N9QLtl1gc/hqdefault.jpg",
        "title": "Minha pequena grande vida no esporte | Lícia de Mattos Pereira | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:14.170999+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:15:00+00:00",
        "description": "Arthur questiona a utilidade de estudar história e mostra como compreender acontecimentos passados é essencial para interpretar o presente e projetar o futuro. Ele conecta fatos históricos a situações cotidianas e à geopolítica, revelando que a história não é apenas memória, mas uma ferramenta para entender o mundo. Aluno do 8º ano do Colégio Santo Inácio, Arthur é apaixonado por história desde pequeno. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295700,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Mv4kOvnlQWM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Mv4kOvnlQWM/hqdefault.jpg",
        "title": "Estudar história serve para alguma coisa mesmo? | Arthur Levone | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:14.391772+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:14:52+00:00",
        "description": "Amora aborda um sentimento muito comum, mas pouco discutido: a insuficiência. Em sua fala, ela reflete sobre como a comparação constante, especialmente potencializada pelas redes sociais, pode afetar nossa autoestima e nos paralisar. A partir de experiências pessoais, Amora propõe um olhar diferente sobre a comparação e a importância de seguir em frente, mesmo diante da insegurança. Amora tem 16 anos e cursa a 2ª série do Ensino Médio. Já participou de simulações diplomáticas e agora encara o palco do TEDx para compartilhar uma reflexão sobre autoconfiança e superação. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295701,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=wUzKgfXbRfY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wUzKgfXbRfY/hqdefault.jpg",
        "title": "O peso de se sentir insuficiente | Amora Berenger | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:14.684927+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:13:10+00:00",
        "description": "Mariana discute como os livros influenciam nossa vida, destacando os benefícios da leitura. Ela compartilha sua experiência pessoal, apresenta uma pesquisa sobre hábitos de leitura entre alunos e dá dicas práticas para transformar a leitura em um hábito prazeroso, com o objetivo é incentivar a valorização da literatura e mostrar que toda leitura é importante. Mariana Berrini é estudante do 7º ano do Colégio Santo Inácio e é apaixonada por livros desde a infância. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295702,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eCSjZl5PSKI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eCSjZl5PSKI/hqdefault.jpg",
        "title": "Como os livros afetam a nossa vida | Mariana Berrini | TEDxYouth@SantoInacioRio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:14.866956+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:12:46+00:00",
        "description": "Financial resilience is the missing climate solution. Here’s how it can unlock green jobs, climate finance, and a just energy transition | Financial resilience is fast becoming the world’s missing climate solution. As climate shocks accelerate, traditional finance still clings to short-term logic, reacting to crisis instead of anticipating it. This talk reframes financial resilience and climate finance as catalysts for rebuilding economies around adaptability, dignity, and long-term stability. Drawing on global examples, from water scarcity to debt-for-nature swaps, Leanne Emery-Hunter reveals how the just energy transition can unlock green jobs, community innovation, and investment pathways that reward sustainability over fragility. The real opportunity is not merely funding the transition, but designing financial systems that create futures worth inheriting | As Chief Executive Officer at Tshikululu Social Investments, Leanne Emery-Hunter helps channel corporate and philanthropic ca",
        "id": 4295703,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hdgAm8gqFSM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hdgAm8gqFSM/hqdefault.jpg",
        "title": "The shift from finite capital to infinite resilience | Leanne Emery-Hunter | TEDxJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:15.119908+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:12:33+00:00",
        "description": "In this compelling TEDx talk, Shreya Malpani reflects on balancing a 100-year-old family legacy while spearheading modern ventures like Dave & Buster’s India. She shares how reinvention, calculated risk, and clarity of purpose can transform traditional enterprises into future-ready ecosystems.\nHer journey highlights the power of adapting heritage to new opportunities without losing its soul.\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx\n Shreya Malpani leads entertainment ventures at Malpani Group and Imagicaaworld Entertainment Ltd., managing 8 theme and water parks across India. She spearheaded the India launch of Dave & Buster’s, driving strategy from concept to execution and positioning it as a premium F&B and gaming brand. With a sharp blend of strategy and creativity, she continues to expand India’s entertainment landscape while fostering innovation and growth. This tal",
        "id": 4295704,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=veQmKM6gwss",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/veQmKM6gwss/hqdefault.jpg",
        "title": "Legacy, Reinvention, and the Courage to Create the New  | Shreya Malpani | TEDxChrist University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:15.327082+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:12:30+00:00",
        "description": "Vibhushri Rivesh Vade’s TEDx Talk titled “From Transaction to Connection: The Power of Listening in a Noisy World” reflects on how modern life has made us experts at reacting but not at truly listening. Surrounded by constant noise and surface-level communication, we often lose the ability to understand what others feel, need, or mean.\n\nThrough his personal journey shaped by a life-changing incident, Vibhushri shares how he learned to listen not just with his ears but with presence and empathy. The Ektari a single-string instrument, became the symbol of this shift, teaching him that even one sound can restore harmony and connection.\n\nThis talk encourages viewers to pause, be present, and listen deeply to people, emotions, silences, and the world around them. Because, as he beautifully concludes:\n“When you truly listen, life sings.” Vibhushri Rivesh Vade\nFounder : Wellness Vibe & Bodhmarga Foundation\n\nVibhushri Rivesh Vade, a Software Engineer and Management graduate from IIT Bombay, b",
        "id": 4295705,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=eHk2z1AtxsM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eHk2z1AtxsM/hqdefault.jpg",
        "title": "The Power of Listening in a Noisy World | Vibhushri Rivesh Vade | TEDxKIRC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:15.607917+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:12:23+00:00",
        "description": "In this introspective TEDx talk, Registrar Dr. Anil Pinto explores how students can cultivate critical thinking, adaptability, and intellectual curiosity. He reflects on the future of learning and the importance of asking questions , observing, and staying open to evolving perspectives.\nHis message encourages students to seek depth and meaning in a world overloaded with information.\n \nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx\n Registrar, Christ University - an academician and thought leader shaping education through creativity and critical inquiry. Known for his deep engagement with literature, philosophy, and higher education policy, Dr. Pinto has been instrumental in fostering an ecosystem where research, ethics, and innovation converge. His leadership reflects a rare blend of intellect, empathy, and cultural vision that continues to inspire both faculty and students al",
        "id": 4295706,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=J8EqO7EnAgo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/J8EqO7EnAgo/hqdefault.jpg",
        "title": "Learning to Think in a Fast-Changing World | Dr Anil Pinto | TEDxChrist University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T17:33:15.921609+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T17:12:15+00:00",
        "description": "Avinash Anand Singh’s TEDx Talk titled “From Transaction to Transcendence” challenges the modern mindset of living life through constant exchanges achievements, validation, and external success. He highlights how this transactional approach limits human potential and emotional well-being. Drawing from ancient wisdom and mind-body science, the talk emphasizes the power of inner awareness in shaping our thoughts, emotions, and overall quality of life.\n\nThrough a short guided meditation, Avinash demonstrates how simple shifts in consciousness can support emotional balance and inner clarity. This talk encourages viewers to explore self-awareness, mindfulness, and the deeper intelligence within moving from a life measured by outcomes to a life enriched by presence, purpose, and transcendence. Avinash Anand Singh\nBreakthrough Coach | Founder, Blue Dot Transform Consulting Pvt. Ltd.\n\nAvinash Anand Singh is a leading breakthrough coach specializing in growth mindset, subconscious mastery, and",
        "id": 4295707,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PEKNiEOFK04",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PEKNiEOFK04/hqdefault.jpg",
        "title": "From Transaction to Transcendence | Avinash Anand Singh | TEDxKIRC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:11.220948+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:23:24+00:00",
        "description": "يشرح كيف أن العمل الجاد والشغف يمكن أن يصنع فرقًا، مستعرضًا تجربته في ريادة الأعمال وصناعة الفرص في قريته بولاية نزوى في سلطنة عمان، موضحًا كيف يمكن للأفكار الطموحة أن تتحول إلى مشاريع ملموسة تؤثر إيجابيًا على المجتمع Entrepreneur, trainer, and founder of Nuzul Al-Dar, he champions economic development and community growth. Through education and cultural initiatives, he invests in people today to create opportunities for tomorrow. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295033,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=sN2hnkpIuWg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sN2hnkpIuWg/hqdefault.jpg",
        "title": "كيف تحول الجنون إلى إلهام؟ | د. إسحاق الشرياني | TEDxThaqafah St",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:11.624405+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:23:21+00:00",
        "description": "One day changed the way I understood what it means to age and how to address ageism in social work. Absence of malice doesn’t mean absence of ageism. No matter what you do, what population you work with, whether clinical or macro, the work you do impacts a person at some point in their life. Makieya Kamara, MSW, LCSW, is a licensed certified social worker (LCSW) and the Director of the Elder Services Department at Action for Boston Community Development, Inc.  She is responsible for developing programs and services that support the welfare and independence of older adults in Greater Boston. Her work emphasizes civic engagement among elders, with a particular focus on the needs of multicultural and multilingual older adults. Her interests include digital equity, storytelling, and intergenerational spaces/programming. Makieya is an alum of the American Society on Aging RISE Fellowship, a social justice and leadership program for rising leaders of color in aging. She received her Masters",
        "id": 4295034,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KxgKPryKZl0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KxgKPryKZl0/hqdefault.jpg",
        "title": "How to spot ageism—and what do about it | Makieya Kamara, MSW, MNL, LCSW | TEDxNewbury Street Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:12.048257+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:23:12+00:00",
        "description": "Unlike hospice, whose core focus is comfort management of the dying process, palliative care providers aim to improve quality of life by targeting symptom management and assist with future planning. Nearing the end of life presents an arguably unique challenge for women. Loss of independence challenges the caregiver roles that women experience through their lives. https://www.massgeneral.org/medicine/palliative-care-and-geriatric-medicine/about/staff/pamela-woo-williams This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295035,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=5H4a_wMwQWg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5H4a_wMwQWg/hqdefault.jpg",
        "title": "Caregiving to Care Receiving | Pamela Woo Williams, MSN, ANP-BC, ACHPN | TEDxNewbury Street Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:12.423649+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:22:09+00:00",
        "description": "Mr. Atul Mehtani explains that dance isn’t just a performance—it’s a basic necessity that brings happiness, freedom, and health. Atul Mehtani is a highly experienced dance choreographer and entrepreneur, with over 23 years in the industry. He specializes in wedding choreography and is skilled in a wide range of dance styles including Bollywood, Punjabi, Classical, Hip-hop, and Contemporary. Atul has built a reputation for creating personalized and engaging dance routines tailored for couples and families to celebrate special occasions with style and energy. Beyond weddings, he has also had the opportunity to teach and choreograph for Bollywood celebrities, highlighting his expertise and prominence in the dance community. His dedication to quality and passion for dance make him a sought-after professional in the field. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295036,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fUOvdEcIopM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fUOvdEcIopM/hqdefault.jpg",
        "title": "Dance is Math, Physics, Chemistry all coming together. | Mr. Atul Mehtani | TEDxHeritageGirlsSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:12.887981+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:22:00+00:00",
        "description": "Hayatımızda yoğun bir şekilde yer alan yapay zekanın doğru kullanımı.  Aralarında çok satanlar da olan 20 kitabın yazarı. Sanat yönetmeni; Harvard Business Review, Bloomberg Businessweek, Grafik Tasarım, BrandMap, The Independent ve Milliyet.com.tr dergilerinin köşe yazarı… Onedio Küratörlerinden. Boğaziçi Üniversitesi’nde lisans eğitimini bitirdi, Marmara Üniversitesi ve Yeditepe Üniversitesi’nde yaptığı 3 yüksek lisansın ardından Marmara Üniversitesi’nde doktorasını tamamladı ve LSU’da bulundu. Profesyonel kariyerinde pek çok ulusal ve uluslararası marka için reklamlar yazan ve stratejiler geliştiren ödüllü bir reklamcı olan Batı, Reklam Yaratıcıları Derneği Başkan Yardımcılığını uzun yıllar yürüttü. Telsim, Rumeli Telekom gibi firmalarda marka uzmanlığı, Gode İstanbul’da yaratıcı yönetmenlik, son olarak da İstanbul Menkul Kıymetler Borsası’ndan Borsa İstanbul’a geçiş sürecinde marka tarafında yöneterek, 4 yıl boyunca kurumda finansal iletişim, uluslararası markalaşma, pazarlama ile",
        "id": 4295037,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_Hyo9DuXnzk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_Hyo9DuXnzk/hqdefault.jpg",
        "title": "Yapay Zeka Değil Yatay Zeka | Uğur Batı | TEDxAtapark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:13.321933+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:21:40+00:00",
        "description": "Clean technologies are fundamentally reshaping economies. What we do next will have profound consequences for people’s livelihoods, economies and global security | The climate transition is reshaping the world faster than any revolution in human history. Global warming and the clean technologies to deal with are powerful economic forces, shifting capital, collapsing old industries, and accelerating clean energy adoption. Across continents, from China to Ethiopia to Brazil, nations are racing ahead, proving what a just transition can look like when ambition meets urgency. Crispian Olver lays bare the stakes: resist and face a chaotic, unequal future—or lean in and build new jobs, new skills, and new resilience. The path is clear, he argues. The only question left is whether we choose disruption or design | \n\n As Deputy Chairperson of the Presidential Climate Commission, and its former Executive Director, Crispian Olver has been at the centre of South Africa’s just transition. He works ",
        "id": 4295038,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FEAgTV4836A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FEAgTV4836A/hqdefault.jpg",
        "title": "How climate change is triggering an economic revolution | Crispian Olver | TEDxJohannesburg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:13.665985+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:21:27+00:00",
        "description": "For decades, personal responsibility has been weaponized to blame the consumer for the plastic pollution crisis. The system is unfair, and the game is rigged, but we must take personal responsibility to change it. In this TEDx talk, Hayden Begley empowers the individual to make choices every day that align with their moral compass, even when they feel like it doesn’t matter—because it does. Hayden Carson Begley is an actor, writer, activist, and EMA Young Hollywood Board Member. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295039,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=qzQ72rPQ-CA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qzQ72rPQ-CA/hqdefault.jpg",
        "title": "An Inconvenient Choice and Plastic Pollution | Hayden Begley | TEDxGreatPacificGarbagePatch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:13.943378+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:20:06+00:00",
        "description": "A specialist doctor by profession, Dr. M. Charnaen Ibrahim talks about his challenges and how he and others can embrace them. Dr. M. Charnaen Ibrahim, Sp.O.G, is a respected Obstetrician and Gynecologist practicing at RS Pondok Indah – Bintaro Jaya. With extensive expertise, he is dedicated to providing holistic care for women throughout their pregnancy journeys. Dr. Charnaen is also the founder of Amnion Clinic in Bintaro, which offers comprehensive services for maternal and child health, including prenatal education, lactation support, and aesthetic treatments tailored for pregnant women. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295040,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=FkXnJ0wOMpA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FkXnJ0wOMpA/hqdefault.jpg",
        "title": "Embracing your challenges with belif | dr. M. Charnaen Ibrahim, Sp. O.G | TEDxGJS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:14.229821+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:19:58+00:00",
        "description": "Have you ever felt overwhelmed by the pressures of juggling work, family, and personal life? In this TEDxEtobicoke talk, Suzanne Knight, shares her personal journey of feeling stuck in the endless cycle of responsibilities and expectations, only to find a way to transform her life using the principles of agility. Drawing from her professional experience in promoting agile business strategies, Suzanne introduces innovative approaches to managing daily tasks, saying \"no\" to unnecessary commitments, and finding balance amidst the chaos. With warmth, humor, and wisdom, Suzanne explores the power of process over rigid planning, helping you navigate the unpredictability of life with greater ease. This talk is an inspiring invitation to reflect on your own life, assess what’s working, and make small but impactful changes. Whether you're a parent, professional, or someone simply trying to find balance, this talk will leave you with practical strategies for living a more adaptable, efficient, ",
        "id": 4295041,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=0zbD4tPIibc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0zbD4tPIibc/hqdefault.jpg",
        "title": "How to Juggle 10 Balls at the Same Time: Mastering Life's Chaos | Suzanne Knight | TEDxEtobicoke",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:14.443033+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:19:49+00:00",
        "description": "Ms. Ruchi Sharma explains how small habit tweaks can harness neuroplasticity, reshaping our brains and paving the way for a brighter future.\n She is a certified functional health coach with over seven years of experience, having worked with more than 2,500 clients across 25 countries. She hold certifications from the Institute of Health(Australia), AWPT University (Australia), INFS, ECNA and Emory University. Her work has been featured in leading publications like Cosmopolitan, Femina, Grazia, The Indian Express, Midday and several other leading publications. She has also spoken in panel discussions on CNBC Awaaz, contributed to Josh Talks, and written extensively for health blogs. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295042,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=tupC1eiJI38",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tupC1eiJI38/hqdefault.jpg",
        "title": "Comb your mind | Ms. Ruchi Sharma | TEDxHeritageGirlsSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:14.581082+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:19:45+00:00",
        "description": "Ms. Shatakshi Singh, a 12th‑grade student, reflects on how we often underestimate the power we wield as an audience, yet time and again it is the audience that shapes the stars. Shatakshi Singh, a student of Heritage Girls School, has served as the Secretary General of the HGS Youth Parliament and was a key member of the TEDx organizing team 2024. As an accomplished debater, she earned High Commendation on her MUN debut and has actively participated in multiple MUNs and debates. With an outstanding academic record, including 92% in ICSE and a perfect 100 in History, she embodies excellence in both leadership and scholarship. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295043,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=pVmcIkXjvJk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/pVmcIkXjvJk/hqdefault.jpg",
        "title": "You, the Audience—Own the Power | Ms. Shatakshi Singh | TEDxHeritageGirlsSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:15.032022+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:19:37+00:00",
        "description": "Ms. Swati Krishnan, a 17‑year‑old student, opens up about her battle with excessive hair‑picking driven by stress, and how she overcame it to inspire others to share their own struggles and find hope in recovery. Swati Krishnan, a student of Heritage Girls School, is the Vice-Captain of Maitri House and a member of the Student Editorial Board. She is a district-level footballer, poet, and caricaturist, and has won multiple accolades including Best Caricaturist Award at HGS Youth Parliament and Emerging Delegate Award at DWPS MUN. As she is always eager to explore new horizons, she brings passion and creativity to everything she pursues. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295044,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=3Qbf71ZEBiU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3Qbf71ZEBiU/hqdefault.jpg",
        "title": "The war beneath her fingertips. | Ms. Swati Krishnan | TEDxHeritageGirlsSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:15.350703+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:19:27+00:00",
        "description": "Ms. Ami Kothari explains that a dining table is more than a place to sit and eat—it’s a buffet of ideas, people, and stories and how the art of designing a table can teach us the art of designing our lives. Ami Kothari is a Mumbai-based table stylist and the founder of Dining Couture, a venture that transforms dining into an immersive experience through artful table styling. Her work blends creativity with cultural heritage, offering bespoke setups for events ranging from intimate gatherings to grand weddings. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295045,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=rzwB5ehrxXY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rzwB5ehrxXY/hqdefault.jpg",
        "title": "More than a meal: Life lessons from my table. | Ms. Ami Kothari | TEDxHeritageGirlsSchool",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:15.747974+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:19:26+00:00",
        "description": "The power of culture is that it is collective–—and it is organized, collective power that can bring about real and revolutionary solutions to the plastic pollution crisis. In this TEDx talk, Liz Havstad relays her experience from her work at Hip Hop Caucus, challenging the petrochemical industry at the sites where they want to build new facilities in Black, Brown, Indigenous and low-income communities. Havstad says we must obliterate the industry narratives that purport plastics and petrochemicals as essential to our communities, economies, and our overall way of life. Liz Havstad is Hip Hop Caucus’ Managing Director and Chief Operating Officer, leading the diverse team, grassroots leaders, and cultural influencers that make Hip Hop Caucus one of the nation’s most dynamic 21st century civil and human rights organizations. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295046,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2h9TZe0MHJ4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2h9TZe0MHJ4/hqdefault.jpg",
        "title": "The Power of Culture to Solve Plastic Pollution | Liz Havstad | TEDxGreatPacificGarbagePatch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-11T16:24:16.127359+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-11T16:19:23+00:00",
        "description": "Uşak Kent Orkestrası eşliğinde önce Mert Doruk sonrasında ise sürpriz bir şekilde Keremcem'in harika sahne performansı U1994 Uşak doğumlu olup ilk ve orta öğrenimini Uşak'ta tamamladı. Üniversite eğitimi için İzmir Dokuz Eylül Üniversitesini tercih ederek jeoloji mühendisliği bölümünü bitirdi. Uşak Belediyesi Kent Orkestrasının vokalliğini yapmaktadır. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4295047,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BlqiAGmGRz0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BlqiAGmGRz0/hqdefault.jpg",
        "title": "Performans | Mert Doruk | TEDxAtapark",
        "vote": 0
    }
]