[
    {
        "age": null,
        "album": "",
        "author": "China Insights-SOHTV",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T04:03:16.377890+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T03:30:52+00:00",
        "description": "A group of middle-aged single men retreated into the remote mountains of Chongqing, China — livestreaming a quiet life of self-sufficiency: growing vegetables, raising chickens, and rejecting the brutal pressures of modern Chinese society. No jobs. No marriages. No debt. No future in the system.\n\nTheir viral hideout became known as \"Bachelor Mountain.\"\n\nBut on May 15, it all ended. The leader, known online as “Bachelor Bro,” abruptly announced the group’s disbandment, citing “uncontrollable forces.” The stream cut off. The mountain emptied. What happened?\n\nIn Chinese history, desperate single men have sparked uprisings that shook empires. The Chinese Communist Party hasn’t forgotten — and it doesn’t take chances.\n\nThis is the story of a quiet rebellion... and why it couldn’t be allowed to continue.",
        "id": 2721934,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ERqEd4T4rhw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 68,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCwjvvgGX6oby5mZ3gbDe8Ug",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ERqEd4T4rhw/hqdefault.jpg",
        "title": "No Job, No Wife, No Debt — And Too Dangerous for China#shorts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "China Insights-SOHTV",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T02:58:10.615914+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T02:17:21+00:00",
        "description": "In May 2025, Chinese actress Huang Yang Tiantian, not yet 18 years old, posted a video on social media flaunting a pair of luxury earrings—later identified as GRAFF diamonds worth over 2.3 million yuan (~$320,000). Netizens quickly uncovered that her father, Yang Wei, was a former Chinese Communist Party (CCP) official who oversaw post-earthquake reconstruction projects in Sichuan after the 2008 Wenchuan and 2013 Ya’an earthquakes.\n\nDigging deeper revealed a massive corruption scandal: donations meant for earthquake victims may have been funneled into luxury villas, designer jewelry, and secret business ventures—despite CCP regulations banning government officials from owning companies. Victims from the disaster zones have spoken out, saying they never received the promised aid and had to rebuild homes out of pocket, even as billions in relief funds vanished.\n\nThis is not just a story about one corrupt family—it's a chilling look at how the Chinese Communist Party turns human sufferin",
        "id": 2721764,
        "language": null,
        "link": "https://www.youtube.com/watch?v=nrEI105CrVU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 68,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCwjvvgGX6oby5mZ3gbDe8Ug",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nrEI105CrVU/hqdefault.jpg",
        "title": "She Wore a $2M Earring Bought with Earthquake Relief Funds? – Chinese Officials' Corruption Exposed",
        "vote": 0
    }
]