[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T15:58:48.271151+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T15:00:04+00:00",
        "description": "Blades of Fire is a new action RPG, and it’s a well polished game brimming with interesting ideas and new mechanics. Top of that list of unique mechanics is the forging process. You fully develop and create the weapons you use in this game, and it impacts gameplay in wonderful ways. \n\nThough, if you’re not fond of weapon durability, be warned, weapons do break. It’s not frequent but it happens. Besides just forging weapons, you’re fighting enemies using four directional attacks. The protagonist, Aran, can also sharpen his blade at the cost of durability, further giving him an edge in a fight. \n\nThe level design is open-ended but not truly open-world. And there’s even a tried-and-true Souls like bonfire system here with the anvils scattered across the map. Blades of Fire releases on May 22nd on PC, Xbox Series X/S, and PS5.",
        "id": 2726704,
        "language": null,
        "link": "https://www.youtube.com/watch?v=0Oxh3YxMmXg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0Oxh3YxMmXg/hqdefault.jpg",
        "title": "Blades of Fire Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T14:53:49.742807+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T13:30:14+00:00",
        "description": "It took a little over nine months for Bungie to land in another cluster of increasingly awful proportions. Eight, if you count the month that Marathon, its upcoming extraction shooter, was revealed, promising a whopping three maps, six playable characters, and a yet-to-be-revealed price tag. You would think the company would become more stable after eliminating 220 roles in August 2024, or at least keep its head down and not make any more poor decisions to drag itself in the public light.\n\nYet, here we are, with Marathon art director Joseph Cross apologizing on a recent livestream for the game using assets taken from an independent artist in-game without her permission. He said there was “absolutely no excuse for this oversight” and the team is “100 percent committed” to its review process to ensure this won't happen again, both for Marathon and at Bungie.",
        "id": 2725967,
        "language": null,
        "link": "https://www.youtube.com/watch?v=G4WOKumxPpo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/G4WOKumxPpo/hqdefault.jpg",
        "title": "Bungie BUNGLES MARATHON In The Worst Possible Ways",
        "vote": 0
    }
]