[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T23:56:41.793110+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T23:20:00+00:00",
        "description": "Spain has ordered Airbnb to remove over 65,000 listings that violate rental regulations, citing missing license numbers and unclear ownership details. The crackdown is part of a broader government effort to address the country's housing crisis, which many blame on unregulated short-term rentals reducing long-term housing supply. Reuters reports: Most of the Airbnb listings to be blocked do not include their licence number, while others do not specify whether the owner was an individual or a corporation, the Consumer Rights Ministry said in a statement on Monday. Consumer Rights Minister Pablo Bustinduy said his goal was to end the general \"lack of control\" and \"illegality\" in the holiday rental business. \"No more excuses. Enough with protecting those who make a business out of the right to housing in our country,\" he told reporters.\n \nBustinduy said Madrid's high court is backing the request to withdraw as many as 5,800 listings. Airbnb will appeal the decision, a spokesperson said on",
        "id": 2730653,
        "language": null,
        "link": "https://slashdot.org/story/25/05/20/226218/spain-blocks-more-than-65000-airbnb-holiday-rental-listings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Spain Blocks More Than 65,000 Airbnb Holiday Rental Listings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T22:51:35.251386+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T22:40:00+00:00",
        "description": "An anonymous reader quotes a report from Decrypt: The founder of online news publication TechCrunch has claimed that Coinbase's recent data breach \"will lead to people dying,\" amid a wave of kidnap attempts targeting high-net-worth crypto holders. TechCrunch founder and venture capitalist Michael Arrington added that this should be a point of reflection for regulators to re-think the importance of know-your-customer (KYC), a process that requires users to confirm their identity to a platform. He also called for prison time for executives that fail to \"adequately protect\" customer information.\n \n\"This hack -- which includes home addresses and account balances -- will lead to people dying. It probably has already,\" he tweeted. \"The human cost, denominated in misery, is much larger than the $400 million or so they think it will actually cost the company to reimburse people.\" [...] He believes that people are in immediate physical danger following the breach, which exposed data including ",
        "id": 2730280,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/20/2052220/coinbase-data-breach-will-lead-to-people-dying-techcrunch-founder-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Coinbase Data Breach Will 'Lead To People Dying,' TechCrunch Founder Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T22:51:35.408053+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T22:00:00+00:00",
        "description": "Google on Tuesday unveiled Veo 3, an AI video generator that includes synchronized audio -- such as dialogue and animal sounds -- setting it apart from rivals like OpenAI's Sora. The company also launched Imagen 4 for high-quality image generation, Flow for cinematic video creation, and made updates to its Veo 2 and Lyria 2 tools. CNBC reports: \"Veo 3 excels from text and image prompting to real-world physics and accurate lip syncing,\" Eli Collins, Google DeepMind product vice president, said in a blog Tuesday. The video-audio AI tool is available Tuesday to U.S. subscribers of Google's new $249.99 per month Ultra subscription plan, which is geared toward hardcore AI enthusiasts. Veo 3 will also be available for users of Google's Vertex AI enterprise platform.\n \nGoogle also announced Imagen 4, its latest image-generation tool, which the company said produces higher-quality images through user prompts. Additionally, Google unveiled Flow, a new filmmaking tool that allows users to creat",
        "id": 2730281,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/2042219/google-launches-veo-3-an-ai-video-generator-that-incorporates-audio?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Launches Veo 3, an AI Video Generator That Incorporates Audio",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T21:46:36.423154+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T21:20:00+00:00",
        "description": "Google has unveiled a major overhaul of its search engine with the introduction of A.I. Mode -- a new feature that works like a chatbot, enabling users to ask follow-up questions and receive detailed, conversational answers. Announced at the I/O 2025 conference, the feature is now being rolled out to all Search users in the U.S. Engadget reports: Google first began previewing AI Mode with testers in its Labs program at the start of March. Since then, it has been gradually rolling out the feature to more people, including in recent weeks regular Search users. At its keynote today, Google shared a number of updates coming to AI Mode as well, including some new tools for shopping, as well as the ability to compare ticket prices for you and create custom charts and graphs for queries on finance and sports.\n \nFor the uninitiated, AI Mode is a chatbot built directly into Google Search. It lives in a separate tab, and was designed by the company to tackle more complicated queries than people",
        "id": 2729877,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/2035200/google-is-rolling-out-ai-mode-to-everyone-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Is Rolling Out AI Mode To Everyone In the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T21:46:36.579092+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T20:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: On Sunday, the Chicago Sun-Times published an advertorial summer reading list containing at least 10 fake books attributed to real authors, according to multiple reports on social media. The newspaper's uncredited \"Summer reading list for 2025\" supplement recommended titles including \"Tidewater Dreams\" by Isabel Allende and \"The Last Algorithm\" by Andy Weir -- books that don't exist and were created out of thin air by an AI system. The creator of the list, Marco Buscaglia, confirmed to 404 Media (paywalled) that he used AI to generate the content. \"I do use AI for background at times but always check out the material first. This time, I did not and I can't believe I missed it because it's so obvious. No excuses,\" Buscaglia said. \"On me 100 percent and I'm completely embarrassed.\"\n \nA check by Ars Technica shows that only five of the fifteen recommended books in the list actually exist, with the remainder being fabricated titles fa",
        "id": 2729878,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/20/2019221/chicago-sun-times-prints-summer-reading-list-full-of-fake-books?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chicago Sun-Times Prints Summer Reading List Full of Fake Books",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T20:41:35.142491+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T19:55:00+00:00",
        "description": "Delta can pursue much of its lawsuit seeking to hold cybersecurity company CrowdStrike liable for a massive computer outage last July that caused the carrier to cancel 7,000 flights, a Georgia state judge ruled. From a report: In a decision on Friday, Judge Kelly Lee Ellerbe of the Fulton County Superior Court said Delta can try to prove CrowdStrike was grossly negligent in pushing a defective update of its Falcon software to customers, crashing more than 8 million Microsoft Windows-based computers worldwide.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Delta+Can+Sue+CrowdStrike+Over+Global+Outage+That+Caused+7%2C000+Canceled+Flights%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F20%2F1955255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F2",
        "id": 2729404,
        "language": null,
        "link": "https://slashdot.org/story/25/05/20/1955255/delta-can-sue-crowdstrike-over-global-outage-that-caused-7000-canceled-flights?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Delta Can Sue CrowdStrike Over Global Outage That Caused 7,000 Canceled Flights",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T19:36:38.020450+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T19:15:00+00:00",
        "description": "Google today unveiled significant upgrades to its Gemini 2.5 AI models, introducing an experimental \"Deep Think\" reasoning mode for 2.5 Pro that allows the model to consider multiple hypotheses before responding. The new capability has achieved impressive results on complex benchmarks, scoring highly on the 2025 USA Mathematical Olympiad and leading on LiveCodeBench, a competition-level coding benchmark. Gemini 2.5 Pro also tops the WebDev Arena leaderboard with an ELO score of 1420. \n\n\"Based on Google's experience with AlphaGo, AI model responses improve when they're given more time to think,\" said Demis Hassabis, CEO of Google DeepMind. The enhanced Gemini 2.5 Flash, Google's efficiency-focused model, has improved across reasoning, multimodality, and code benchmarks while using 20-30% fewer tokens. Both models now feature native audio capabilities with support for 24+ languages, thought summaries, and \"thinking budgets\" that let developers control token usage. Gemini 2.5 Flash is cu",
        "id": 2728848,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/1915256/googles-gemini-25-models-gain-deep-think-reasoning?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's Gemini 2.5 Models Gain \"Deep Think\" Reasoning",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T18:33:30.999101+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T18:00:00+00:00",
        "description": "Google is adding AI-powered live translation to Meet, enabling participants to converse in their native languages while the system automatically translates in real time with the speaker's original vocal characteristics intact. Initially launching with English-Spanish translation this week, the technology processes speech with minimal delay, preserving tone, cadence, and expressions -- creating an effect similar to professional dubbing but with the speaker's own voice, the company announced at its developer conference Tuesday. \n\nIn some testings, WSJ found occasional limitations: initial sentences sometimes appear garbled before smoothing out, context-dependent words like \"match\" might translate imperfectly (rendered as \"fight\" in Spanish), and the slight delay can create confusing crosstalk with multiple participants. Google plans to extend support to Italian, German, and Portuguese in the coming weeks. The feature is rolling out to Google AI Pro and Ultra subscribers now, with enterp",
        "id": 2728247,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/1750258/google-brings-ai-powered-live-translation-to-meet?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Brings AI-Powered Live Translation To Meet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T17:26:45.534820+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T17:20:00+00:00",
        "description": "Adobe will rebrand its Creative Cloud All Apps subscription to \"Creative Cloud Pro\" on June 17 for North American users, making significant price increases while bundling AI features. Individual annual subscribers will see monthly rates jump from $59.99 to $69.99, while monthly non-contracted subscribers face a $15 hike to $104.99. \n\nThe revamped plan includes unlimited generative AI image credits, 4,000 monthly \"premium\" AI video and audio credits, access to third-party models like OpenAI's GPT, and the beta Firefly Boards collaborative whiteboard. Adobe will also offer a cheaper \"Creative Cloud Standard\" option at $54.99 monthly with severely reduced AI capabilities, but this plan remains exclusive to existing subscribers -- forcing new customers into the pricier AI-focused tier.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Adobe+Forces+Creative+Cloud+Users+Into+Pricier+AI-Focused+Plan%3A+https%3A%2F%2Fslashdot.",
        "id": 2727642,
        "language": null,
        "link": "https://slashdot.org/story/25/05/20/1710222/adobe-forces-creative-cloud-users-into-pricier-ai-focused-plan?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Adobe Forces Creative Cloud Users Into Pricier AI-Focused Plan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T17:26:45.711193+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T16:40:00+00:00",
        "description": "Microsoft is starting to integrate AI shortcuts, or what it calls AI actions, into the File Explorer in Windows 11. From a report: These shortcuts let you right-click on a file and quickly get to Windows AI features like blurring the background of a photo, erasing objects, or even summarizing content from Office files. \n\nFour image actions are currently being tested in the latest Dev Channel builds of Windows 11, including Bing visual search to find similar images on the web, the blur background and erase objects features found in the Photos app, and the remove background option in Paint. Similar AI actions will soon be tested with Office files, The Verge added.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+is+Putting+AI+Actions+Into+the+Windows+File+Explorer%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F05%2F20%2F1627210%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/",
        "id": 2727643,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/20/1627210/microsoft-is-putting-ai-actions-into-the-windows-file-explorer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft is Putting AI Actions Into the Windows File Explorer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T16:21:37.022098+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T16:00:00+00:00",
        "description": "America's regional state universities are experiencing steep enrollment declines, triggering economic crises in the towns that depend on them, while flagship universities continue to thrive. \n\nAt Western Illinois University in Macomb, enrollment has plummeted 47% since 2010, driving the city's population down 23% to 14,765. Empty dorms have been repurposed or demolished, while local businesses struggle to survive. \"It's almost like you're watching the town die,\" Kalib McGruder, a 28-year veteran of the campus police department, told WSJ. \n\nAn analysis of 748 public four-year institutions reveals enrollment at prestigious state universities increased 9% between 2015 and 2023, while regional state schools saw a 2% decline. The University of Tennessee Knoxville's enrollment jumped 30% as the state's regional colleges collectively fell 3%. With high school graduate numbers expected to decline starting next year after reaching a record high in 2024, the outlook for struggling college towns",
        "id": 2726925,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/20/1554221/americas-college-towns-go-from-boom-to-bust?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's College Towns Go From Boom To Bust",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T16:21:37.177072+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T15:22:00+00:00",
        "description": "French authorities have denied Telegram founder Pavel Durov's request to travel to the U.S. for \"negotiations with investment funds.\" From a report: The Paris prosecutor's office told POLITICO that it rendered its decision on May 12 \"on the grounds that such a trip abroad did not appear imperative or justified.\" \n\nDurov was arrested in August 2024 at a French airport and has been under strict legal control since last September, when he was indicted on six charges related to illicit activity on the messaging app he operates. He is forbidden to leave France without authorization -- which he obtained to travel to Dubai from March 15 to April 7, the prosecutor's office said. Russian-born Durov is a citizen, among other countries, of France and the United Arab Emirates.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=France+Barred+Telegram+Founder+Pavel+Durov+From+Traveling+To+US%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%",
        "id": 2726926,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/20/1452250/france-barred-telegram-founder-pavel-durov-from-traveling-to-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "France Barred Telegram Founder Pavel Durov From Traveling To US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T15:16:39.615700+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T14:40:00+00:00",
        "description": "An anonymous reader shares a report: Intel has considered divesting its network and edge businesses as the chipmaker looks to shave off parts of the company its new chief executive does not see as crucial, three sources familiar with the matter said. \n\nTalks about the potential sale of the group, once called NEX in Intel's financial results, are a part of CEO Lip-Bu Tan's strategy to focus its tens of thousands of employees on areas in which it has historically thrived: PC and data center chips.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel+Explores+Sale+of+Networking+and+Edge+Unit%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F20%2F142206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F20%2F142206%2Fintel-explores-sale-of-networking-an",
        "id": 2726202,
        "language": null,
        "link": "https://slashdot.org/story/25/05/20/142206/intel-explores-sale-of-networking-and-edge-unit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Explores Sale of Networking and Edge Unit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T14:11:40.342244+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T14:00:00+00:00",
        "description": "Survey response rates have collapsed from 30-50% in the 1970s to as low as 5% today, while AI agents now account for an estimated 20% of survey responses, according to a new analysis. \n\nThe UK's Office for National Statistics has seen response rates drop from 40% to 13%, with some labor market questions receiving only five human responses. The U.S. Current Population Survey hit a record low 12.7% response rate, down from 50% historically.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Quiet+Collapse+of+Surveys%3A+Fewer+Humans+(and+More+AI+Agents)+Are+Answering+Survey+Questions%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F20%2F1030208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F05%2F20%2F1030208%2Fthe-quiet-collapse-of-surveys-fewer-humans",
        "id": 2725624,
        "language": null,
        "link": "https://slashdot.org/story/25/05/20/1030208/the-quiet-collapse-of-surveys-fewer-humans-and-more-ai-agents-are-answering-survey-questions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Quiet Collapse of Surveys: Fewer Humans (and More AI Agents) Are Answering Survey Questions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T13:06:53.024052+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T12:00:00+00:00",
        "description": "The US tech sector shed 214,000 jobs in April amid continuing economic uncertainty, according to CompTIA analysis of Bureau of Labor Statistics data. Companies are extending hiring timelines to two or three times longer than last year while significantly raising skill requirements, particularly for AI competencies. \n\n\"It's the great hesitation,\" said George Denlinger of Robert Half, noting employers now demand 10-12 skills instead of 6-7 previously. Entry-level programming positions are disappearing as AI assumes those functions, with Janco Associates CEO Victor Janulaitis observing that \"a job that has been eliminated from almost all IT departments is an entry-level IT programmer.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Tech+Job+Market+Is+Shrinking+as+AI+Reshapes+Industry+Requirements%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F05%2F20%2F0947254%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img s",
        "id": 2724975,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/20/0947254/tech-job-market-is-shrinking-as-ai-reshapes-industry-requirements?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tech Job Market Is Shrinking as AI Reshapes Industry Requirements",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T10:57:36.640043+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T10:00:00+00:00",
        "description": "Klarna's net loss more than doubled in the first quarter [non-paywalled link] as more consumers failed to repay loans from the Swedish \"buy now, pay later\" lender as concerns rose about the financial health of US consumers. Financial Times: The fintech, which offers interest-free consumer loans to allow customers to make retail purchases, on Monday reported a net loss of $99 million for the three months to March, up from $47 million a year earlier. \n\nThe company, which makes money by charging fees to merchants and to consumers who fail to repay on time, said its customer credit losses had risen to $136 million, a 17% year-on-year increase. The increased failure to repay comes on the back of gloomy economic sentiment in the US, where a closely watched measure of consumers' confidence last week fell to its second-lowest level on record. US President Donald Trump's trade war has driven expectations of higher inflation. Further reading: The Klarna Hype Machine.<p><div class=\"share_submiss",
        "id": 2723981,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/20/096258/klarnas-losses-widen-after-more-consumers-fail-to-repay-loans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Klarna's Losses Widen After More Consumers Fail To Repay Loans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T07:41:36.698015+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T07:00:00+00:00",
        "description": "SAG-AFTRA has filed a labor complaint against Fortnite developer Epic Games, alleging the game improperly used AI to replicate James Earl Jones' Darth Vader voice without bargaining with the union, despite the estate's approval. Gizmodo reports: The union has now filed an unfair labor practice charge (link to the PDF is on the SAG-AFTRA website) that calls out \"Fortnite's signatory company, Llama Productions\" for \"[replacing] the work of human performers with AI technology\" without \"providing any notice of their intent to do this and without bargaining with us over appropriate terms.\"\n \nThe union notes that it's not against the general idea here: \"We celebrate the right of our members and their estates to control the use of their digital replicas and welcome the use of new technologies to allow new generations to share in the enjoyment of those legacies and renowned roles.\" The problem is that the AI being used here makes human voice actors obsolete, and \"we must protect our right to ",
        "id": 2722828,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/05/19/2245207/sag-aftra-calls-out-fortnite-over-darth-vader-ai-voice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SAG-AFTRA Calls Out Fortnite Over Darth Vader AI Voice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T04:26:39.241187+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: There's a lot of matter around, which ensures that any antimatter produced experiences a very short lifespan. Studying antimatter, therefore, has been extremely difficult. But that's changed a bit in recent years, as CERN has set up a facility that produces and traps antimatter, allowing for extensive studies of its properties, including entire anti-atoms. Unfortunately, the hardware used to capture antiprotons also produces interference that limits the precision with which measurements can be made. So CERN decided that it might be good to determine how to move the antimatter away from where it's produced. Since it was tackling that problem anyway, CERN decided to make a shipping container for antimatter, allowing it to be put on a truck and potentially taken to labs throughout Europe. [...]\n Overall, the hardware stayed cold, generally at a bit over 5 Kelvin. The exception was when the system was reconnected to the antimatter sou",
        "id": 2722050,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/19/2124234/cern-gears-up-to-ship-antimatter-across-europe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CERN Gears Up To Ship Antimatter Across Europe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T01:11:38.396097+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T00:50:00+00:00",
        "description": "According to Bloomberg's Mark Gurman (paywalled), Apple has big plans to turn Siri into a true ChatGPT competitor. \"A next-generation, chatbot version of Siri has reportedly made significant progress during testing over the past six months; some executives allegedly now see it as 'on par' with recent versions of ChatGPT,\" reports MacRumors. \"Apple is also apparently discussing giving Siri the ability to access the internet to gather and synthesize data from multiple sources, just like ChatGPT.\" From the report: The report added that Apple now has artificial intelligence offices in Zurich, where employees are working on an all-new software architecture for Siri. This \"monolithic model\" is entirely built on an LLM engine that will eventually replace Siri's current \"hybrid\" architecture that has been incoherently layered up with different functionality over many years. The new model will make Siri more conversational and better at synthesizing information.\n \nGoogle's Gemini is expected t",
        "id": 2721355,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/05/19/2119226/apples-next-gen-version-of-siri-is-on-par-with-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple's Next-Gen Version of Siri Is 'On Par' With ChatGPT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-20T01:11:38.509672+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-20T00:10:00+00:00",
        "description": "Sony has begun mass suspensions of PlayStation accounts linked to Russian users, including those registered in other countries like Turkiye and Kazakhstan, in an effort to crack down on circumvention of regional restrictions like PS Plus access. This move follows Sony's 2022 exit from the Russian market due to the war in Ukraine. Ukrainska Pravda reports: Russians are trying to bypass the blocks and are contacting PlayStation support, but these attempts are to no avail. Users with purchased accounts encounter the most problems -- Sony checks IP addresses for verification. There are already many similar reports. In some cases, accounts with thousands of roubles worth of games purchased have been blocked. Russian media outlets like RT are reporting the news.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sony+Mass-Bans+Russian+PlayStation+Accounts%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F05%2F19%2F2112252%2F",
        "id": 2721356,
        "language": null,
        "link": "https://games.slashdot.org/story/25/05/19/2112252/sony-mass-bans-russian-playstation-accounts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sony Mass-Bans Russian PlayStation Accounts",
        "vote": 0
    }
]