[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T23:27:06.018345+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T22:10:00+00:00",
        "description": "\"There has never been a successful, widespread malware attack against iPhone,\" notes Apple's security blog, pointing out that \"The only system-level iOS attacks we observe in the wild come from mercenary spyware... historically associated with state actors and [using] exploit chains that cost millions of dollars...\" \n\nBut they're doing something about it &mdash; this week announcing a new always-on memory-safety protection in the iPhone 17 lineup and iPhone Air (including the kernel and over 70 userland processes)...\n\n\n Known mercenary spyware chains used against iOS share a common denominator with those targeting Windows and Android: they exploit memory safety vulnerabilities, which are interchangeable, powerful, and exist throughout the industry... For Apple, improving memory safety is a broad effort that includes developing with safe languages and deploying mitigations at scale... \n\nOur analysis found that, when employed as a real-time defensive measure, the original Arm Memory Tag",
        "id": 3574021,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/09/14/228211/apple-claims-most-significant-upgrade-to-memory-safety-in-os-history?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Claims 'Most Significant Upgrade to Memory Safety' in OS History",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T21:03:37.199670+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T20:34:00+00:00",
        "description": "The oldest person living in Japan is 114 years old, reports the BBC. But \"The number of people in Japan aged 100 or older has risen to a record high of nearly 100,000, its government has announced.\"\n\n Setting a new record for the 55th year in a row, the number of centenarians in Japan was 99,763 as of September, the health ministry said on Friday. Of that total, women accounted for an overwhelming 88%... Health minister Takamaro Fukoka congratulated the 87,784 female and 11,979 male centenarians on their longevity and expressed his \"gratitude for their many years of contributions to the development of society\".... \n\nThe higher life expectancy is mainly attributed to fewer deaths from heart disease and common forms of cancer, in particular breast and prostate cancer. Japan has low rates of obesity, a major contributing factor to both diseases, thanks to diets low in red meat and high in fish and vegetables. The obesity rate is particularly low for women, which could go some way to expl",
        "id": 3573469,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/14/2023209/japan-sets-record-nearly-100000-people-aged-over-100?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japan Sets Record:  Nearly 100,000 People Aged Over 100",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T18:40:56.033685+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T18:34:00+00:00",
        "description": "\"When residents of Equatorial Guinea's Annob&oacute;n island wrote to the government in Malabo in July last year complaining about the dynamite explosions by a Moroccan construction company, they didn't expect the swift end to their internet access...\" reports the Associated Press. \n\n\"Residents and activists said the company's dynamite explosions in open quarries and construction activities have been polluting their farmlands and water supply...\"\n\nDozens of the signatories and residents were imprisoned for nearly a year, while internet access to the small island has been cut off since then, according to several residents and rights groups. Local residents interviewed by The Associated Press left the island in the past months, citing fear for their lives and the difficulty of life without internet. Banking services have shut down, hospital services for emergencies have been brought to a halt and residents say they rack up phone bills they can't afford because cellphone calls are the on",
        "id": 3572479,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/14/1656244/african-island-demanding-government-action-punished-with-year-long-internet-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "African Island Demanding Government Action Punished with Year-Long Internet Outage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T18:40:56.200735+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T17:34:00+00:00",
        "description": "America's Federal Trade Commission is investigating whether Amazon and Google misled advertisers placing ads on their websites, reports Bloomberg, and specifically whether the two companies \"properly disclosed the terms and pricing for ads.\"\n\nThe FTC is seeking details about Amazon's auctions and whether it disclosed \"reserve pricing\" for some search ads &mdash; price floors that advertisers must meet before they can buy an ad, the people said. Separately, the FTC is examining practices by Google, including its internal pricing process and whether it increased the cost of ads in ways that weren't disclosed to advertisers, the people said... \n\nAccording to one of the people, the FTC's latest investigation emerged from its earlier antitrust case. In that complaint, the agency alleges that Amazon litters its marketplace with irrelevant results for search queries, making it harder for shoppers to find what they are looking for and more expensive for sellers to use the platform. The practi",
        "id": 3572480,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/14/1638247/americas-ftc-opens-new-probe-into-amazon-and-google-advertising-practices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America's FTC Opens New Probe into Amazon and Google Advertising Practices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T16:41:30.825103+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T16:34:00+00:00",
        "description": "Many coral reefs \"have now turned ghostly white,\" reports CBS News &mdash; and \"a major culprit is climate change.\" \n\nSFGate adds that more than 50% of the world's coral reefs have been lost, mostly over the past 10 years, according to coral reef scientist Rebecca Albright at the California Academy of Sciences. \"If changes aren't made soon, 90% to 99% of the coral reefs that are remaining could be deteriorated by 2050, Albright said...\" \n\nBut CBS News notes that Albright's lab is the first in America to successfully spawn coral to regenerate the reefs:\nThe lab is mastering the art and science of creating baby corals, and the scientists have brought their expertise into the wild. The location: the second-largest reef in the world, known as the Mesoamerican Reef, stretching some 700 miles along the coasts of Mexico, Belize, Guatemala, and Honduras... Armed with test tubes, the scientists quickly dove into the water and collected the tiny packets of gametes. Back on land, the eggs were f",
        "id": 3571923,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/13/2025209/can-lab-grown-coral-restore-reefs-damaged-by-climate-change?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Can Lab-Grown Coral Restore Reefs Damaged By Climate Change?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T15:40:08.325845+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T15:34:00+00:00",
        "description": "TechCrunch reports:\n\nThanks to a pledge to unbundle its corporate messaging app Teams from its productivity suites, Microsoft has managed to slip unscathed through a major antitrust investigation by the European Commission that could have resulted in massive fines for the tech giant. \n\nThe Commission on Friday okayed Microsoft's concessions to address the EU's competition concerns over the company including Teams along with the rest of its Office productivity suite for free, concluding a multi-year investigation that was sparked by complaints from rival office messaging app Slack in 2020. Microsoft has promised that for the next seven years, it will provide Microsoft 365 and Office 365 without Teams at a lower price and will let customers choose whether they want to pay more to add the collaboration app to the suites... \nMicrosoft is voluntarily offering some versions of both its productivity suites without Teams at a 50% lower price compared to versions that bundle the app, worldwide",
        "id": 3571535,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/14/0433205/microsoft-escapes-eu-competition-probe-by-unbundling-teams-for-seven-years-opening-api?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Escapes EU Competition Probe by Unbundling Teams for Seven Years, Opening API",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T14:38:49.381348+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T14:34:00+00:00",
        "description": "One of the worlds in the TRAPPIST-1 system, a mere 40 light-years away, just might be clad in a life-supporting atmosphere,\" reports ScienceAlert. \n\n\"In exciting new JWST observations, the Earth-sized exoplanet TRAPPIST-1e shows hints of a gaseous envelope similar to our own, one that could facilitate liquid water on the surface.\"\n\n\nAlthough the detection is ambiguous and needs extensive follow-up to find out what the deal is, it's the closest astronomers have come yet in their quest to find a second Earth... [T]he first step is finding exoplanets that are the right distance from their host star, occupying a zone where water neither freezes under extreme cold nor evaporates under extreme heat. Announced in 2016, the discovery of the TRAPPIST-1 system was immediately exciting for this reason. The red dwarf star hosts seven exoplanets that have a rocky composition (as opposed to gas or ice giants), several of which are bang in the star's habitable, liquid water zone... \n\nRed dwarf stars",
        "id": 3571142,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/13/0553219/most-earth-like-planet-yet-may-have-been-found-just-40-light-years-away?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Most Earth-Like Planet Yet May Have Been Found Just 40 Light Years Away",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T12:33:51.878271+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T11:34:00+00:00",
        "description": "\"Facebook users who filed a claim in parent company Meta's $725 million settlement related to the Cambridge Analytica scandal may soon get a payment,\" reports CNN, since \"on August 27, the court ordered that settlement benefits be distributed.\"\n\n\nIt's been over two years since Facebook users were able to file claims in Meta's December 2022 settlement. The class-action lawsuit began after the social media giant said in 2018 that as many as 87 million Facebook users' private information was obtained by data analytics firm Cambridge Analytica... \n\nMeta was accused of allowing Cambridge Analytica and other third parties, including developers, advertisers and data brokers, to access private information about Facebook users. The social media giant was also accused of insufficiently managing third-party access to and use of user data. Meta did not admit wrongdoing as part of the settlement. Following the Cambridge Analytica incident, Facebook restricted third-party access to user data and \"d",
        "id": 3570355,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/14/031203/facebook-begins-sending-settlement-payments-from-cambridge-analytica-scandal-soon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Facebook Begins Sending Settlement Payments from Cambridge Analytica Scandal Soon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T08:14:12.983836+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T07:34:00+00:00",
        "description": "They stole a woman's phone in Barcelona. Unfortunately, her husband was security consultant/penetration tester Martin Vigo, reports Spain's newspaper El Pais. \n\n\"His weeks-long investigation coincided with a massive two-year police operation between 2022 and 2024 in six countries where 17 people were arrested: Spain, Argentina, Colombia, Chile, Ecuador, and Peru....\"\n\n\tIn Vigo's case, the phone was locked and the \"Find my iPhone\" feature was activated... Once stolen, the phones are likely wrapped in aluminum foil to prevent the GPS from tracking their movements. \"Then they go to a safe house where they are gathered together and shipped on pallets outside of Spain, to Morocco or China.\" This international step is vital to prevent the phone from being blocked if the thieves try to use it again. Carriers in several European countries share lists of the IMEIs (unique numbers for each device) of stolen devices so they can't be used. But Morocco, for example, doesn't share these lists. Ther",
        "id": 3569362,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/14/0357239/thieves-busted-after-stealing-a-cellphone-from-a-security-experts-wife?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Thieves Busted After Stealing a Cellphone from a Security Expert's Wife",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T03:59:17.222208+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T03:34:00+00:00",
        "description": "TIOBE attempts to calculate programming language popularity using the number of skilled engineers, courses, and third-party vendors. \nAnd the eight most popular languages in September's rankings haven't changed since last month:\n\n 1. Python\n2. C++\n3. C \n4. Java\n5. C#\n6. JavaScript\n7. Visual Basic\n8. Go \n\n\n\nBut by TIOBE's ranking, Perl is still the #10 most-popular programming in September (dropping from #9 in August). \"One year ago Perl was at position 27 and now it suddenly pops up at position 10 again,\" marvels TIOBE CEO Paul Jansen.\nThe technical reason why Perl is rated this high is because of its huge number of books on Amazon. It has 4 times more books listed than for instance PHP, or 7 times more books than Rust. The underlying \"real\" reason for Perl's increase of popularity is unknown to me. The only possibility I can think of is that Perl 5 is now gradually considered to become the real Perl... Perl 6/Raku is at position 129 of the TIOBE index, thus playing no role at all in ",
        "id": 3568601,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/14/0134239/is-perl-the-worlds-10th-most-popular-programming-language?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is Perl the World's 10th Most Popular Programming Language?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-14T01:43:31.323155+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-14T01:34:00+00:00",
        "description": "After its six-year journey to Saturn's moon Titan, Dragonfly's rotorcraft lander \"will fly like a large drone,\" explains its web page, spending three years sampling multiple landing sites to characterize Titan's habitability and look for \"precursors of the origin of life.\"\n\n\"However, the project has undergone multiple replans impacting cost and schedule, resulting in a life-cycle cost increase of nearly $1 billion and over 2 years of delays,\" according to an announcement from NASA's Inspector General. \nFrom the Inspector General's report:\n\nThe cost increase and schedule delay were largely the result of NASA directing [Johns Hopkins University] Applied Physics Laboratory to conduct four replans between June 2019 and July 2023 early in Dragonfly's development. Justifications for these replans included the COVID-19 pandemic, supply chain issues, changes to accommodate a heavy-lift launch vehicle, projected funding challenges, and inflation.\" \nBut its higher-than-expected life-cycle cost ",
        "id": 3568249,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/14/0026256/dragonfly-mission-to-saturns-moon-titan-behind-schedule-overbudget-says-nasa-inspector-general?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Dragonfly' Mission to Saturn's Moon Titan: Behind Schedule, Overbudget, Says NASA Inspector General",
        "vote": 0
    }
]