[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T23:37:41.394367+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T23:30:00+00:00",
        "description": "Irish competitor Diarmuid Early, dubbed the \"Lebron James of Excel spreadsheets,\" has won the 2025 Microsoft Excel World Championship in Las Vegas, dethroning three-time champion Andrew Ngai. The BBC reports: The esport showpiece in December attracted competitors worldwide as 256 spreadsheet heads battled it out across knockout rounds to join the final 24 in Vegas. [...] A three-time champion in the financial Excel tournaments, this win was Diarmuid's first in the overall competition. He held the triple-world champion Andrew Ngai to second place, and won the $5,000 prize and title belt. [...]\n \nExcel esports transforms a common office tool into a dynamic sport. More than 20 years old, the competitive scene has evolved from being finance based to now involving more general problem solving. Although it might help, Diarmuid said \"it doesn't require accounting or finance knowledge.\" He described an example where Excel is used in solving a maze, scoring poker hands, or even sorting Kings a",
        "id": 4394451,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/23/2214235/irelands-diarmuid-early-wins-world-microsoft-excel-title",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ireland's Diarmuid Early Wins World Microsoft Excel Title",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T23:37:41.578763+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T22:50:00+00:00",
        "description": "A federal judge blocked Texas' app store age-verification law, ruling it likely violates the First Amendment by forcing platforms to gate speech and collect data in an overly broad way. The law was set to go into effect on January 1, 2026. The Verge reports: In an order granting a preliminary injunction on the Texas App Store Accountability Act (SB 2420), Judge Robert Pitman wrote that the statute \"is akin to a law that would require every bookstore to verify the age of every customer at the door and, for minors, require parental consent before the child or teen could enter and again when they try to purchase a book.\" Pitman has not yet ruled on the merits of the case, but his decision to grant the preliminary injunction means he believes its defenders are unlikely to prevail in court.\n \nPitman found that the highest level of scrutiny must be applied to evaluate the law under the First Amendment, which means the state must prove the law is \"the least restrictive means of achieving a c",
        "id": 4394452,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/23/2235204/judge-blocks-texas-app-store-age-verification-law",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Judge Blocks Texas App Store Age Verification Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T22:35:36.883964+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: CBS cannot contain the online spread of a \"60 Minutes\" segment that its editor-in-chief, Bari Weiss, tried to block from airing. The episode, \"Inside CECOT,\" featured testimonies from US deportees who were tortured or suffered physical or sexual abuse at a notorious Salvadoran prison, the Center for the Confinement of Terrorism. \"Welcome to hell,\" one former inmate was told upon arriving, the segment reported, while also highlighting a clip of Donald Trump praising CECOT and its leadership for \"great facilities, very strong facilities, and they don't play games.\"\n \nWeiss controversially pulled the segment on Monday, claiming it could not air in the US because it lacked critical voices, as no Trump officials were interviewed. She claimed that the segment \"did not advance the ball\" and merely echoed others' reporting, NBC News reported. Her plan was to air the segment when it was \"ready,\" insisting that holding stories \"for whatever",
        "id": 4394098,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/23/222221/limewire-re-emerges-in-online-rush-to-share-pulled-60-minutes-segment",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LimeWire Re-Emerges In Online Rush To Share Pulled '60 Minutes' Segment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T22:35:37.214924+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T21:30:00+00:00",
        "description": "An anonymous reader shares a report: It's been more than eight years since Amazon bought Whole Foods, but the two companies still haven't aligned their setup for the Microsoft software their employees use. That disconnect was flagged in an 8-week Deloitte review of Whole Foods' use of Microsoft 365 apps earlier this year, according to an internal document obtained by Business Insider. Deloitte found that Whole Foods relies on \"fragmented\" Microsoft toolsets, has loose security and data-retention practices, and employs a complex user-management setup -- all of which contribute to inefficiencies and lower productivity when working with Amazon employees. \n\nThe consulting firm recommended a 24-month integration plan that would first move Whole Foods' corporate employees onto Amazon's backend system, followed by its frontline workers. The phased approach would ensure a \"smooth transition for users and minimal disruption to business processes,\" while generating cost savings, the document sa",
        "id": 4394099,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/23/1830242/fragmented-microsoft-tools-undercut-efficiency-at-amazon-and-whole-foods-internal-deloitte-review-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Fragmented' Microsoft Tools Undercut Efficiency at Amazon and Whole Foods, Internal Deloitte Review Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T21:27:03.167316+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T20:51:00+00:00",
        "description": "In the late 1980s, Merriam-Webster's Collegiate Dictionary sat on the New York Times best-seller list for 155 consecutive weeks and eventually sold 57 million copies, a figure believed to be second only to the Bible in the United States -- but those days are thoroughly gone. Stefan Fatsis's new book \"Unabridged: The Thrill of (and Threat to) the Modern Dictionary\" chronicles what Louis Menand describes in The New Yorker as \"a losing struggle\" for legacy dictionaries to survive in the internet age. \n\nThe profession has been decimated: an estimated 200 full-time lexicographers worked in the US 25 years ago, and Fatsis believes that number is \"probably closer to thirty\" today. \"By the time I finished this book,\" Fatsis writes, \"it wasn't clear how long flesh-bone-and-blood lexicographers would be needed to chronicle the march of the English language.\" \n\nMerriam-Webster is now owned by Encycloaedia Britannica, another print-era giant that stopped publishing physical volumes in 2012. The c",
        "id": 4393673,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/23/191223/is-the-dictionary-done-for",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is the Dictionary Done For?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T20:20:11.625470+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T20:10:00+00:00",
        "description": "European public institutions are quietly migrating away from American cloud providers and office software, driven less by policy ambitions in Brussels than by the mundane legal reality that GDPR-mandated risk assessments keep flagging the US CLOUD Act as an unacceptable threat to citizen data. \n\nAustria's Federal Ministry for Economy, Energy and Tourism moved 1,200 employees to the open-source platform Nextcloud in four months. Germany's Schleswig-Holstein has already transitioned 24,000 of its 30,000 civil servants to LibreOffice, Nextcloud and Thunderbird. The International Criminal Court in The Hague announced in November 2025 that it would replace Microsoft office software after chief prosecutor Karim Khan was temporarily locked out of his Outlook account. \n\nCompetition economist Cristina Caffarra estimates that 90% of Europe's digital infrastructure is now controlled by non-European companies. Forrester predicts no European enterprise will fully abandon US hyperscalers in 2026, b",
        "id": 4393238,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/23/1843236/europes-public-institutions-are-quietly-ditching-us-cloud-providers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Europe's Public Institutions Are Quietly Ditching US Cloud Providers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T20:20:11.828954+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T19:44:00+00:00",
        "description": "An anonymous reader shares a report: Samsung is breaking new ground with its 2026 lineup of gaming monitors, with the Odyssey 3D G90XH becoming the first to feature a 6K display with \"glasses-free 3D.\" The new monitor comes with a 32-inch IPS panel, offering real-time eye-tracking that \"adjusts depth and perspective\" based on your position, along with a speedy 165Hz refresh rate that you can boost to 330Hz with a Dual Mode feature that switches to 3K. \n\n[...] A 6K 3D display isn't the only notable upgrade coming to Samsung's lineup; the company is launching the Odyssey G6 G60H, which it says is the \"world's first\" 1,040Hz gaming monitor. The 27-inch monitor only supports this ultra-fast refresh rate in HD, while its native 1440p resolution still offers speeds up to a very fast 600Hz. It's also compatible with AMD FreeSync Premium and NVIDIA G-Sync.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung's+2026+Gaming",
        "id": 4393239,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/23/1944212/samsungs-2026-gaming-monitors-promise-6k-3d-and-up-to-1040hz",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung's 2026 Gaming Monitors Promise 6K, 3D, and Up To 1,040Hz",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T19:07:31.333394+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T18:50:00+00:00",
        "description": "The great return-to-office battle has effectively concluded and a clear pecking order has emerged, according to Sander van 't Noordende, the CEO of Randstad, a staffing giant that places around half a million workers in jobs every week. Remote work is becoming a status symbol reserved for star performers and those possessing rare skills. \"You have to be very special to be able to demand a 100% remote job,\" van 't Noordende told Fortune. \"That's increasingly the story. You have to have very special technology skills or some expertise.\" \n\nThe equilibrium appears to be settling at a hybrid model of three to four days in office for most workers. Van 't Noordende noted that apart from some banks in major cities, the five-day office week isn't returning as the norm despite hardline mandates from companies like Amazon and JPMorgan. Korn Ferry predicted this \"hybrid hierarchy\" at the start of 2025, forecasting that flexibility would become a perk reserved for top talent. At some companies, hi",
        "id": 4392729,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/23/1836252/remote-work-is-officially-dead-says-the-worlds-largest-recruiter",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Remote Work is Officially Dead, Says the World's Largest Recruiter",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T19:07:31.504390+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T18:16:00+00:00",
        "description": "Australia is on track for a significant expansion of desalination capacity -- converting seawater to freshwater -- to meet the needs of a swelling population at a time of declining average rainfall. From a report: The world's driest inhabited continent is projected to build or expand 11 desalination plants worth more than A$23 billion ($15 billion) over the next 10 years, according to a research report by Dominic McNally at Oxford Economics. \n\n\"Our population growth forecasts imply an additional 190GL/year in household water demand across major cities by 2035, while the booming data center industry also threatens to rapidly expand urban water use,\" he said. \"This growing demand coincides with falling average rainfall in major population centers, increasing the vulnerability of existing infrastructure.\" Water construction activity slowed after 2010 as a severe drought receded. However, recent dry periods have reignited interest in water security and coincide with a new boom in water in",
        "id": 4392731,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/23/1816257/australia-poised-for-desalination-boom-as-water-shortages-loom",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australia Poised for Desalination Boom as Water Shortages Loom",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T18:01:24.719282+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T17:28:00+00:00",
        "description": "Asus has been showcasing its new 5K 27-inch ROG Strix 27 Pro gaming monitor running at 5,120 x 2,880 resolution and up to 180Hz, but even Nvidia's flagship RTX 5090 struggles to deliver smooth frame rates at this demanding pixel count. In testing conducted by Asus, the RTX 5090D -- a Chinese-exclusive variant with weaker AI performance -- achieved just 51 frames per second in a Cyberpunk 2077 benchmark at ultra ray traced settings. The test system ran an AMD Ryzen 9950X3D processor, had DLSS set to balanced, and kept frame generation disabled. The same configuration running at 4K managed 77 fps, around 50% higher. \n\nThe underlying math is simple: 5K resolution requires rendering 78% more pixels than 4K. That 218 PPI pixel density delivers impressive sharpness up close, but Asus chose an IPS panel over OLED technology to reach it, trading away deeper black levels and faster response times. Asus appears to be positioning the monitor as a dual-mode display -- 5K for productivity and vide",
        "id": 4392222,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/12/23/1728203/5k-gaming-is-too-hard-even-for-an-rtx-5090d",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "5K Gaming Is Too Hard, Even for an RTX 5090D",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T16:52:22.058434+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T16:41:00+00:00",
        "description": "Speaking of Italy's competition authority , it has fined Ryanair $301 million for abusing its dominant market position to limit sales of tickets by online travel agents. The Guardian: The authority said Europe's largest airline had \"implemented an abusive strategy to hinder travel agencies\" via an \"elaborate strategy\" of technical obstacles for agents and passengers to make it difficult for online travel agents to sell Ryanair tickets and instead force sales through its own website. \n\nThe fine related to Ryanair's conduct between April 2023 and at least until April 2025, the authority said on Tuesday. It said Ryanair had prevented online travel agents from selling tickets on its flights in combination with other airlines and services, weakening competition. Ryanair said it would immediately appeal against the \"legally flawed\" ruling.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ryanair+Fined+%24301M+Over+'Abusive+",
        "id": 4391656,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/23/1516239/ryanair-fined-301m-over-abusive-strategy-to-limit-ticket-sales-by-online-travel-agencies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ryanair Fined $301M Over 'Abusive Strategy' To Limit Ticket Sales By Online Travel Agencies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T16:52:22.159811+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T16:01:00+00:00",
        "description": "Tech giants Google and Apple are asking some employees with H-1B visas to reconsider international travel, as their legal teams warned that visa processing delays could keep employees abroad for months, according to Business Insider. From a report: Law firms representing the tech giants sent memos advising staff who require visa stamps for reentry to stay in the U.S., warning that international travel could entangle them in visa screening delays following the introduction of a new social media screening requirement, according to the news agency. The policy subjects H-1B workers and their dependents to reviews of their social media histories. \n\n\"Please be aware that some US Embassies and Consulates are experiencing significant visa stamping appointment delays, currently reported as up to 12 months,\" BAL Immigration Law, which represents Google, said in a memo obtained by Business Insider. The law firm said the delays were affecting H-1B, H-4, F, J and M visas.<p><div class=\"share_submi",
        "id": 4391657,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/23/158236/apple-and-google-asking-some-employees-with-h-1b-visas-to-avoid-international-travel",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple and Google Asking Some Employees With H-1B Visas To Avoid International Travel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T15:44:49.661437+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T15:22:00+00:00",
        "description": "Apple has been fined $116 million by Italy's antitrust regulator over the \"excessively burdensome\" privacy rules it imposes on third-party apps. From a report: The Italian Competition Authority (AGCM) says that Apple abused its dominant app store market position by burdening developers with \"disproportionate\" terms around data collection that exceed privacy law requirements, compared to rules for native iOS apps. \n\nThe fine specifically targets the App Tracking Transparency (ATT) policy Apple launched in 2021, which requires third-party developers to ask users for consent twice to track their data across other apps and websites. Apple's own apps can obtain this permission in a single tap. AGCM says that the burden of consenting twice led to a reduction in user consent rates for advertising profiling, thus harming developers whose business models depend upon revenue generated by personalized ads.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http",
        "id": 4391044,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/12/23/151231/apple-fined-116-million-over-app-privacy-prompts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Fined $116 Million Over App Privacy Prompts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T15:44:49.835487+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T14:40:00+00:00",
        "description": "An anonymous reader shares a report: The United States will take action against China's semiconductor industry, setting new tariffs on chips from China from June 23, 2027, that have 0% duties currently, the US Trade Representative said. \n\nThe announcement comes following a year-long investigation into China's chip imports into the United States, launched by the Biden administration and led by the U.S. Trade Representative. \"China's targeting of the semiconductor industry for dominance is unreasonable and burdens or restricts U.S. commerce and thus is actionable,\" the agency said in its release.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+To+Impose+Tariffs+on+Chips+From+China%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F23%2F1435213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php",
        "id": 4391045,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/23/1435213/us-to-impose-tariffs-on-chips-from-china",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US To Impose Tariffs on Chips From China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T14:36:14.503399+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T14:01:00+00:00",
        "description": "China has unveiled new rules to rein in aggressive pricing tactics by online platforms, prohibiting e-commerce operators from forcing merchants to offer discounts or setting different prices based on user demographics without consent. The 29-article regulation -- jointly issued over the weekend by the National Development and Reform Commission, State Administration for Market Regulation (SAMR), and Cyberspace Administration of China -- lays out detailed compliance requirements that target several long-standing pain points as competition among internet giants has often eroded the rights of both consumers and merchants. \n\nTo restore merchant autonomy on pricing, the rules ban platform operators from leveraging their dominant scale to impose \"lowest price\" agreements. Platforms are prohibited from using traffic throttling, search ranking demotions, or algorithm penalties to pressure merchants into predatory price-cutting or exclusive pricing arrangements.<p><div class=\"share_submission\" ",
        "id": 4390569,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/23/1334206/china-bans-e-commerce-platforms-from-forcing-lowest-prices-or-abusing-algorithms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Bans E-commerce Platforms From Forcing Lowest Prices or Abusing Algorithms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T13:26:18.439561+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T13:00:00+00:00",
        "description": "Uber and Lyft plan to trial robotaxis in London starting in 2026 using autonomous vehicles from Baidu, as the UK fast-tracks approvals for self-driving cars on public roads. CNBC reports: Lyft's testing of Baidu's initial fleet of dozens of vehicles will begin in 2026, pending regulatory approval, \"with plans to scale to hundreds from there,\" Lyft CEO David Risher said in a post on social media platform X on Monday. Meanwhile, Uber said that its first pilot is expected to start in the first half of 2026. \"We're excited to accelerate Britain's leadership in the future of mobility, bringing another safe and reliable travel option to Londoners next year,\" the company added.\n \nThe moves add to Baidu's growing global footprint, which it says includes 22 cities and more than 250,000 weekly trips, as it races against other Chinese players like WeRide and Western giants like Alphabet's Waymo. The UK, in particular, has seen a wave of interest from driverless taxi companies, following the gove",
        "id": 4390061,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/22/2219206/uber-lyft-set-to-trial-robotaxis-in-the-uk-in-partnership-with-chinas-baidu",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Uber, Lyft Set To Trial Robotaxis In the UK In Partnership With China's Baidu",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T11:12:11.596150+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T10:00:00+00:00",
        "description": "joshuark shares a report from Ars Technica: For the better part of two months last year, most of us had no idea how serious the problems were with Boeing's Starliner spacecraft docked at the International Space Station. A safety advisory panel found this uncertainty also filtered through NASA's workforce. [...] The Starliner capsule was beset by problems with its maneuvering thrusters and pernicious helium leaks on its 27-hour trip from the launch pad to the ISS. For a short time, Starliner commander Wilmore lost his ability to control the movements of his spacecraft as it moved in for docking at the station in June 2024. Engineers determined that some of the thrusters were overheating and eventually recovered most of their function, allowing Starliner to dock with the ISS. [...]\n \nThroughout that summer, managers from NASA and Boeing repeatedly stated that the spacecraft was safe to bring Wilmore and Williams home if the station needed to be evacuated in an emergency. But officials o",
        "id": 4389188,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/23/0839241/safety-panel-says-nasa-should-have-taken-starliner-incident-more-seriously",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Safety Panel Says NASA Should Have Taken Starliner Incident More Seriously",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T07:49:54.373661+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T07:00:00+00:00",
        "description": "Tony Isaac shares a report from NPR: The U.S. government calculates the country's official time using more than a dozen atomic clocks at a federal facility northwest of Denver. But when a destructive windstorm knocked out power to the National Institute of Standards and Technology (NIST) laboratory in Boulder on Wednesday and a backup generator subsequently failed, time ever so slightly slowed down. The lapse \"resulted in NIST UTC [universal coordinated time] being 4.8 microseconds slower than it should have been,\" NIST spokesperson Rebecca Jacobson said in an email. [...]\n \nSince 2007, the official time of the U.S. has been determined by the commerce secretary, who oversees NIST, along with the U.S. Navy. The national time standard is known as NIST UTC. (Somewhat confusingly, UTC itself is a separate, global time standard to which the U.S. and other countries contribute measurements.) NIST currently calculates the standard using a weighted average of the readings of 16 atomic clocks ",
        "id": 4388221,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/23/018200/how-a-power-outage-in-colorado-caused-us-official-time-to-be-48-microseconds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How a Power Outage In Colorado Caused US Official Time To Be 4.8 Microseconds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T04:32:29.044169+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T03:30:00+00:00",
        "description": "\"Garmin's Collier Trophy award-winning Autonomi emergency Autoland, a system designed to safely land an aircraft in the event of pilot incapacitation, made its first real-world use and save on Saturday,\" writes Slashdot reader slipped_bit. AvBrief.com reports: Social media posts from flight tracking hobbyists reported a King Air 200 squawked 7700 about 2 p.m. local time today. The Autoland system was initiated and landed the aircraft at Rocky Mountain Metropolitan Airport near Denver. A recording from LiveATC's feed of the airport's tower frequency includes a robotic female voice declaring a pilot incapacitation and the intention to land on Runway 30. The aircraft landed successfully and there have been no reports of injuries. The nature of the incapacitation and the condition of the pilot have not been released. VASAviation put together this nice animation of the event [here].\n \nThe aircraft, N479BR, was being operated by Buffalo River Outfitters from Aspen to Rocky Mountain Metropol",
        "id": 4387464,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/23/0050202/garmin-emergency-autoland-has-first-save",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Garmin Emergency Autoland Has First Save",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T02:17:47.466456+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T01:40:00+00:00",
        "description": "The FCC has banned approval of new foreign-made drones and components, citing \"an unacceptable risk\" to national security. The move will most heavily impact DJI but it \"does not affect drones or drone components that are currently sold in the United States.\" Reuters reports: The tech was placed on the commission's \"Covered List,\" barring DJI and other foreign drone manufacturers from receiving the FCC's approval to sell new drone models for import or sale in the U.S. In Monday's announcement, the agency said that the move \"will reduce the risk of direct [drone] attacks and disruptions, unauthorized surveillance, sensitive data exfiltration and other [drone] threats to the homeland.\"\n \nFCC Chair Brendan Carr said in a statement that while drones offer the potential to boost public safety and the U.S.' posture on global innovation, \"criminals, terrorists and hostile foreign actors have intensified their weaponization of these technologies, creating new and serious threats to our homelan",
        "id": 4386973,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/23/0036201/fcc-bans-foreign-made-drones-over-national-security-spying-concerns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FCC Bans Foreign-Made Drones Over National Security, Spying Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T01:13:08.130506+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T01:03:00+00:00",
        "description": "Microsoft plans to eliminate all C and C++ code across its major codebases by 2030, replacing it with Rust using AI-assisted, large-scale refactoring. \"My goal is to eliminate every line of C and C++ from Microsoft by 2030,\" Microsoft Distinguished Engineer Galen Hunt writes in a post on LinkedIn. \"Our strategy is to combine AI and Algorithms to rewrite Microsoft's largest codebases. Our North Star is '1 engineer, 1 month, 1 million lines of code.' To accomplish this previously unimaginable task, we've built a powerful code processing infrastructure. Our algorithmic infrastructure creates a scalable graph over source code at scale. Our AI processing infrastructure then enables us to apply AI agents, guided by algorithms, to make code modifications at scale. The core of this infrastructure is already operating at scale on problems such as code understanding.\"\n \nHunt says he's looking to hire a Principal Software Engineer to help with this effort. \"The purpose of this Principal Software",
        "id": 4386724,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/23/010200/microsoft-to-replace-all-cc-code-with-rust-by-2030",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft To Replace All C/C++ Code With Rust By 2030",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T01:13:08.346353+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T00:20:00+00:00",
        "description": "Alphabet is acquiring Intersect for $4.75 billion to accelerate data center and power-generation capacity as AI infrastructure demand surges. CNBC reports: Alphabet said Intersect's operations will remain independent, but that the acquisition will help bring more data center and generation capacity online faster. \"Intersect will help us expand capacity, operate more nimbly in building new power generation in lockstep with new data center load, and reimagine energy solutions to drive U.S. innovation and leadership,\" Sundar Pichai, CEO of Google and Alphabet, said in a statement.\n \nGoogle already had a minority stake in Intersect from a funding round that was announced last December. In a release at the time, Intersect said its strategic partnership with Google and TPG Rise Climate aimed to develop gigawatts of data center capacity across the U.S., including a $20 billion investment in renewable power infrastructure by the end of the decade.\n \nAlphabet said Monday that Intersect will wo",
        "id": 4386725,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/22/226229/alphabet-acquires-data-center-and-energy-infrastructure-company-intersect-for-475-billion",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Alphabet Acquires Data Center and Energy Infrastructure Company Intersect For $4.75 Billion",
        "vote": 0
    }
]