[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T16:20:09.341837+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T15:30:00+00:00",
        "description": "Clair Obscur has done very well this year, bagging a lot of recognition thanks to an experience that manages to fire on all fronts and manage to sustain that quality across the board. \n\nA fascinating world full of creative designs, challenging battles, intriguing mysteries, and a very memorable cast of characters with incredibly talented voice artists has made this one a tale for the ages. \n\nBut its endings have proven divisive, with a rather impossible choice given to us at the concluding portion of an epic adventure. While things might look like they're both great, if bittersweet, conclusions to a story that's about grief there are certain factors that make choosing Verso's course of action as the best one. \n\nAllow us to try and convince you about why that's the case.",
        "id": 4391369,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=iYKHCg5moqk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/iYKHCg5moqk/hqdefault.jpg",
        "title": "Clair Obscur’s Two Endings - Settling The BIGGEST Debate of the Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T09:31:01.840656+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T09:30:00+00:00",
        "description": "Every year or so, there are a handful of open-world titles which simply astound us with their scale. There's a reason they continue to sell so well, even if concerns about \"open world fatigue\" crop up every now and again. Exploring such a massive landscape full of different activities is fun, especially if developers find ways to mix up the formula.\n\nOf course, size isn't everything. Deus Ex: Mankind Divided and Like a Dragon have earned recognition for smaller worlds packed with plenty to do, leading to the term \"semi-open world.\" While it could mean many things - like several moderately sized areas that aren't seamlessly connected - it has resulted in some contemporary classics.\n\nSo without further ado, let's dive into the best semi-open world games from 2025.",
        "id": 4388650,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=lp2CMD_OnF8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lp2CMD_OnF8/hqdefault.jpg",
        "title": "10 Awesome Semi-Open World Games of 2025 You May Have Missed Playing",
        "vote": 0
    }
]