[
    {
        "age": null,
        "album": "",
        "author": "Vox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T22:10:44.141679+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T21:00:28+00:00",
        "description": "Politicians should be judged by whether or not they deliver, regardless of their party. In this conversation with Today, Explained co-host Astead Herndon, Ezra Klein discusses his new book and the idea of “abundance,” and how leaders should be actually creating for their constituents. To hear the full conversation, listen to this episode on Today, Explained, wherever you get your podcasts.\n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts: https://www.vox.com/podcasts",
        "id": 4393939,
        "language": "en",
        "link": "https://www.youtube.com/shorts/RBL2GIRkbOM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 779,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCLXo7UDZvByw2ixzpQCufnA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RBL2GIRkbOM/hqdefault.jpg",
        "title": "Politicians should be judged by whether or not they deliver, regardless of their party.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Vox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-23T15:21:01.811238+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-23T15:00:31+00:00",
        "description": "The town of Oswego, New York, has three nuclear power plants within 10 miles — and it wants another one. New York Gov. Kathy Hochul recently announced a commitment to add a gigawatt of nuclear power to the New York state grid, partially to meet the electricity demands of the booming AI industry. And Oswego is vying to be chosen as a site for this new power plant. \n\nTo find out more about why Oswego is so eager for nuclear — and what would happen next if it’s chosen — Vox video producer Nate Krieger traveled there to meet with the mayor of Oswego and see the nuclear power plants up close. \n\nThere are a lot of benefits to adding more nuclear energy to the grid: The average US nuclear power station can provide enough electricity to support 1.4 million homes. Nuclear power operates 24/7 and doesn’t generate carbon emissions or traditional air pollution. Plus, these plants create hundreds of jobs. \n\nBut disasters like Three Mile Island, Chernobyl, and Fukushima Daiichi loom large in the pu",
        "id": 4390834,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CzImxou8eYk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 779,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCLXo7UDZvByw2ixzpQCufnA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CzImxou8eYk/hqdefault.jpg",
        "title": "This town has three nuclear plants. Now it wants another one",
        "vote": 0
    }
]