[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T18:07:27.569509+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T17:30:12+00:00",
        "description": "When does the desire for justice ultimately supersede one's honor? How easily could one abandon their values if it meant winning a war? Is it because there's no other way, or was one's innate code fundamentally flawed? All these questions – and many more – were answered in Ghost of Tsushima. Released in 2020 for the PlayStation 4, eventually making its way to PS5 in 2021 and PC in 2024, Sucker Punch Productions' open-world epic offered something that fans of the Assassin's Creed series had craved for decades until that point: A stealth action experience set in Japan.\n\nThe story unfolds, surprise surprise, on Tsushima, an island off the mainland with a few thousand residents. When the game begins in 1274, Jin Sakai and his uncle, Shimura, who also served as the island's steward, would go up against Khotun Khan and his Mongol fleet. Based loosely on the first Mongol invasion of the island, which was thwarted by a “great storm,” the game's events aren't actually historically accurate, bu",
        "id": 3701292,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=oavQL5y1alA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oavQL5y1alA/hqdefault.jpg",
        "title": "Ghost of Tsushima FULL STORY - Before You Play Ghost of Yotei",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T16:01:44.438928+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T15:30:30+00:00",
        "description": "Nintendo’s iconic plumber is blasting off into space once again with Super Mario Galaxy + Super Mario Galaxy 2, set to release on October 2, 2025 for both the Switch and the Switch 2. \n\nWhile fans may still be dreaming of a third Galaxy entry, this re-release bundles the two beloved classics with modern upgrades and fresh content. Most fans would understandably have plenty of questions about the pricing, new features, and accessibility options that Nintendo may or may not have included with this upcoming release. \n\nWith this feature, we try to get you up to speed on the upcoming release as we run down 13 of the most important things that you need to know about before making up your mind for the purchase.",
        "id": 3700165,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=XaJ68Ux4vEo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XaJ68Ux4vEo/hqdefault.jpg",
        "title": "Super Mario Galaxy + Super Mario Galaxy 2 - 15 Things To Know Before You Buy For Switch And Switch 2",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T14:34:11.795855+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T13:45:02+00:00",
        "description": "As packed as September was, October looks to somehow, someway, offer even more. Big open-world blockbusters, the return of multiple renowned franchises, a brand new extraction shooter that could give the big players a run for their money, and much more await.\n\nAnd that's not even accounting for the horror titles! Without further ado, here are the 20 biggest games to look forward to in October 2025.",
        "id": 3699051,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=JAPEGU6ldME",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JAPEGU6ldME/hqdefault.jpg",
        "title": "20 BIGGEST Games of October 2025 You NEED TO PLAY",
        "vote": 0
    }
]