[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T22:55:14.165696+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T22:20:00+00:00",
        "description": "An anonymous reader quotes a report from the BBC: A Chinese national has been convicted following an international fraud investigation which resulted in what's believed to be the single largest cryptocurrency seizure in the world. The Metropolitan Police says it recovered 61,000 bitcoin worth more than $6.7 billion in current prices. Zhimin Qian, also known as Yadi Zhang, pleaded guilty on Monday at Southwark Crown Court of illegally acquiring and possessing the cryptocurrency. A second person appeared in court on Tuesday to admit to their role in the scheme.\n \nMalaysian national Seng Hok Ling, of Matlock, Derbyshire, pleaded guilty at Southwark Crown Court of entering into a money laundering arrangement on or before April 23, 2024. According to the charge, he had been dealing in cryptocurrency on Qian's behalf, \"knowing or suspecting his actions would facilitate the acquisition or control of criminal property by another.\" Between 2014 and 2017 Qian led a large-scale scam in China whi",
        "id": 3703756,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/30/2035246/chinese-woman-convicted-after-worlds-biggest-bitcoin-seizure?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Woman Convicted After 'World's Biggest' Bitcoin Seizure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T22:55:14.248648+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T21:40:00+00:00",
        "description": "Alongside its updated Sora 2 AI video generator, OpenAI has launched an iPhone-only social app called Sora that lets users consent to have friends create deepfake-style cameos of them. The invite-only app works a lot like TikTok with short remixable videos but enforces restrictions on public figures and explicit content. The Verge reports: In a briefing with reporters on Monday, employees called it the potential \"ChatGPT moment for video generation.\" The Sora app is currently only available to US and Canada users, with other countries set to follow, and when someone receives access, they also get four additional invites to share with friends. There's no word on when an Android version might be released.\n \nSora users can give their friends -- or, if they're feeling bold, everyone -- permission to create \"cameos\" with their own likeness using the new video model, which is dubbed Sora 2. The person whose likeness is being generated is a \"co-owner\" of that end result, OpenAI employees sai",
        "id": 3703757,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/30/2028215/openais-new-social-video-app-will-let-you-deepfake-your-friends?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's New Social Video App Will Let You Deepfake Your Friends",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T21:36:36.038505+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T21:00:00+00:00",
        "description": "Starting in November, Venmo and PayPal users will finally be able to send money directly to each other, ending years of workarounds despite Venmo being owned by PayPal. TechCrunch reports: This change means that PayPal users will now be able to find Venmo users by inputting their phone numbers, and later, their email addresses. If you don't want PayPal users to be able to find you, you can update your settings in the Venmo app by navigating to Settings - Privacy - Find me... and while you're at it, you might as well default your Venmo transactions to private via Settings &gt; Privacy. You'll thank me in the long run.\n \nPayPal announced that it would broaden its network of payment systems in July, starting with Venmo, but the companies did not confirm the date of the update until now. This collection of partnerships, which PayPal has named PayPal World, will also work with Mercado Pago, NPCI International Payments Limited, and Tenpay Global. This will help users send money internationa",
        "id": 3703214,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/30/2019252/venmo-and-paypal-users-will-finally-be-able-to-send-money-to-each-other?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Venmo and PayPal Users Will Finally Be Able To Send Money To Each Other",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T21:36:36.128531+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T20:20:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: The U.S. Federal Communications Commission voted on Tuesday to consider whether to lift the long-standing prohibition on a merger between any of the largest four broadcast networks and to consider relaxing other media ownership rules. The FCC said it would consider public comments before deciding whether to reverse the rule that bars a merger among the \"Big Four\" networks: NBC, owned by Comcast, Walt Disney Co's ABC, Paramount Skydance's CBS or Fox. The FCC also said it was seeking public comment on whether to eliminate or revise a rule that limits a single entity from owning more than two of the four largest television stations in the same local market and a rule that limits the total number of local radio stations that may be owned in a single market.\n \nPreviously, the FCC noted that a version of the rule barring dual ownership of networks has existed since the 1940s. A 2018 media ownership review concluded the bar should be upheld \"",
        "id": 3703215,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/09/30/2016222/fcc-to-consider-ending-merger-ban-among-us-broadcast-networks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FCC To Consider Ending Merger Ban Among US Broadcast Networks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T20:10:03.686895+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T18:27:00+00:00",
        "description": "Microsoft began rolling out Windows 11 version 25H2 today, delivering the annual update as a compact enablement package to users who enable the \"get the latest updates as soon as they're available\" toggle in Windows Update. The company tested the release in its Windows Insider Release Preview ring during the previous month before the broader rollout.Version 25H2 shares its code base and servicing branch with the existing 24H2 release. Both versions will receive identical monthly feature updates going forward. \n\nThe update removes PowerShell 2.0 and the Windows Management Instrumentation command-line tool to reduce the operating system's footprint. John Cable, vice president of program management for Windows servicing and delivery, said the release includes advancements in build and runtime vulnerability detection paired with AI-assisted secure coding. Microsoft designed the version to address security threats under its security development lifecycle policy requirements. The company pl",
        "id": 3702507,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/30/1827229/windows-11s-2025-update-arrives?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows 11's 2025 Update Arrives",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T18:32:12.793106+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T17:30:00+00:00",
        "description": "Imgur, a popular image hosting platform with more than 130 million users, has stopped being available in the UK after regulators signalled their intention to impose penalties over concerns around children's data. From a report: The Information Commissioner's Office (ICO) said that it has reached provisional findings in an investigation in the parent company of image hosting site, Imgur. Its probe was launched earlier this year, as part of the regulator's Children's Code strategy, which is intended to set the standards for how online services handle the personal information of young people. BBC adds: The UK's data watchdog, the Information Commissioner's Office (ICO), said it recently notified the platform's parent company, MediaLab AI, of plans to fine Imgur after probing its approach to age checks and use of children's personal data.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Imgur+Pulls+Out+of+UK+as+Data+Watch",
        "id": 3701663,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/30/1715206/imgur-pulls-out-of-uk-as-data-watchdog-threatens-fine?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Imgur Pulls Out of UK as Data Watchdog Threatens Fine",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T18:32:12.879627+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T16:55:00+00:00",
        "description": "Chinese hackers breached email servers of foreign ministers as part of a years-long effort targeting the communications of diplomats around the world, according to researchers at the cybersecurity firm Palo Alto Networks. From a report: Attackers accessed Microsoft Exchange email servers, gaining the ability to search for information at some foreign ministries, said the team at Unit 42, the threat intelligence division of Palo Alto Networks, which has been tracking the group for nearly three years. \n\nHackers specifically searched in the email servers for key terms related to a China-Arab summit in Riyadh, Saudi Arabia, in 2022, said Lior Rochberger, senior researcher at the company. They also searched for names such as including Chinese President Xi Jinping and his wife, Peng Liyuan, in the context of that summit, the researchers said. The researchers declined to specifically identify which countries had their systems breached in the hacking campaign, but wrote in the report that the ",
        "id": 3701664,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/30/1655230/china-hackers-breached-foreign-ministers-emails-palo-alto-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Hackers Breached Foreign Ministers' Emails, Palo Alto Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T16:23:49.988705+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T16:10:00+00:00",
        "description": "Cancer rates among people aged 15 to 49 have increased 10% since 2000 even as rates have fallen among older populations. Young women face an 83% higher cancer rate than men in the same age range. A 150,000-person study presented at the American Association for Cancer Research meeting found millennials appear to be aging biologically faster than previous generations based on blood biomarkers. That acceleration was associated with up to 42% increased risk for certain cancers including lung, gastrointestinal and uterine malignancies. \n\nResearchers are examining the \"exposome\" -- the full range of environmental exposures across a person's life. Studies have linked early-onset cancers to medications taken during pregnancy, ultra-processed foods that now account for more than half of daily calorie intake in the United States, circadian rhythm disruption from artificial light and shift work, and chemical exposures. Gary Patti at Washington University is using zebrafish exposed to known and s",
        "id": 3700364,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/30/1549226/what-researchers-suspect-may-be-fueling-cancer-among-millennials?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Researchers Suspect May Be Fueling Cancer Among Millennials",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T16:23:50.063224+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T15:29:00+00:00",
        "description": "Amazon today announced three new Kindle Scribe models, its e ink-featuring tables designed for note-taking and reading. The lineup includes the standard Kindle Scribe and a version without a front light alongside the Kindle Scribe Colorsoft. The new devices feature an 11-inch glare-free E Ink screen compared to the 10.2-inch display on previous models. \n\nAmazon has reduced the weight to 400 grams from 433 grams and made the devices 5.4mm thin. The company added a quad-core processor and additional memory to deliver writing and page turns that are 40% faster than earlier versions. The Colorsoft model uses custom-built display technology to offer 10 pen colors and five highlighter colors. Amazon redesigned the software to include AI-powered notebook search and summaries. The devices will support Google Drive and Microsoft OneDrive for document access and allow users to export notes as editable text to OneNote. The standard Kindle Scribe will start at $499.99 and the Colorsoft at $629.99",
        "id": 3700365,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/30/1529241/kindle-scribe-redesign-adds-color-model-and-ai-powered-notebook-features?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Kindle Scribe Redesign Adds Color Model and AI-powered Notebook Features",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T16:23:50.137815+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T14:56:00+00:00",
        "description": "An anonymous reader shares a report: Boeing is planning a new single-aisle airplane that would succeed the 737 MAX, according to people familiar with the matter, a long-term bid to recover business lost to rival Airbus during its series of safety and quality problems. Earlier this year, Chief Executive Kelly Ortberg met with officials from Rolls-Royce in the U.K., two of the people said, where they discussed a new engine for the aircraft. Ortberg appointed a new senior product chief in Boeing's commercial plane business, whose prior role was developing a new type of aircraft. \n\nBoeing has also been designing the flight deck of a new narrow-body aircraft, according to a person familiar with the plans. This new aircraft is in early-stage development and plans are still taking shape, some of the people said. Boeing's plans represent a shift for the company, which had put some new aircraft development work on the back burner while it navigated multiple challenges. They are also a sign tha",
        "id": 3700366,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/30/1456248/boeing-has-started-working-on-a-737-max-replacement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Boeing Has Started Working on a 737 MAX Replacement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T14:56:00.854980+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T14:06:00+00:00",
        "description": "Trust in America's elite universities has declined sharply over the past decade [non-paywalled source]. A Manhattan Institute survey conducted in June 2025 found that only 42% of Americans have significant trust in higher education, down 15 percentage points from a decade earlier. Trust in Ivy League institutions stands at just 15%. \n\nHarvard is considering building trade schools as part of a settlement with the Trump administration. The proposal comes as elite universities face criticism for shifting focus from academic excellence to shaping students' political and moral values. Princeton changed its informal motto in 2016 to \"In the Nation's Service and the Service of Humanity.\" Grade inflation has become prevalent at elite schools. A Bloomberg column argues universities should adopt more objective admissions criteria, reduce grade inflation, and make education their primary mission again rather than attempting to fix societal problems.<p><div class=\"share_submission\" style=\"positio",
        "id": 3699366,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/30/146247/americas-elite-universities-have-lost-their-way?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'America's Elite Universities Have Lost Their Way'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T13:19:29.212838+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T13:00:00+00:00",
        "description": "Camembert writes: In a move that is sure to make Ripple nervous, traditional financial network Swift announced yesterday that it is partnering with Consensys and more than 30 global banks to build a blockchain based network that will run in parallel with its traditional network. Interestingly, unlike XRP, there is no native coin, rather it aims for interoperability (probably using Chainlink with whom the company did case studies for a few years already). There is also a strong focus on regulatory compliance. There are several news articles and opinion pieces on this event; I linked the Reuters article.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Swift+To+Build+a+Global+Financial+Blockchain%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F30%2F034241%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com",
        "id": 3697923,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/30/034241/swift-to-build-a-global-financial-blockchain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Swift To Build a Global Financial Blockchain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T11:16:21.075988+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T10:00:00+00:00",
        "description": "BrianFagioli shares a report from NERDS.xyz: NASA has awarded Solstar Space a $150,000 SBIR Phase I contract to develop a Lunar Wi-Fi Access Point (LWIFI-AP). The system is designed to provide wireless connectivity for astronauts, rovers, and orbiting spacecraft as part of the Artemis and Commercial Lunar Payload Services programs. Solstar's goal is to build a space-rated, multi-band, multi-protocol access point that can survive radiation, extreme lunar temperatures, and other harsh conditions. NASA has identified Wi-Fi and 3GPP standards as core communication needs across mission systems ranging from the Human Landing System and Lunar Terrain Vehicle to the Lunar Gateway.\n \nAlthough this is only an early-stage contract, Solstar's proposal addresses a clear gap in space-qualified networking hardware. The company says that just as Wi-Fi transformed daily life on Earth, it will be equally important for living and working on the Moon. If the project advances, astronauts could soon be rel",
        "id": 3697151,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/30/0312213/nasa-backs-lunar-wi-fi-project-to-connect-astronauts-and-rovers-on-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NASA Backs Lunar Wi-Fi Project To Connect Astronauts and Rovers On the Moon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T08:23:08.042363+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T07:00:00+00:00",
        "description": "Sen. Mark Kelly and three Democratic colleagues urged appropriations leaders to block funding for moving space shuttle Discovery from the Smithsonian's Udvar-Hazy Center in Virginia to Houston, arguing the transfer would waste taxpayer money, risk permanent damage, and restrict public access. The relocation, pushed by Texas senators Cornyn and Cruz under a new law, carries an estimated cost of nearly $400 million. Ars Technica reports: \"Why should hundreds of millions of taxpayer dollars be spent just to jeopardize a piece of American history that's already protected and on display?\" wrote Kelly in a social media post on Friday. \"Space Shuttle Discovery belongs at the Smithsonian, where millions of people, including students and veterans, go to see it for free.\" In a letter sent on the same day to the leadership of the Senate Committee on Appropriations, Kelly and his three colleagues cautioned that any effort to transfer the winged orbiter would \"waste taxpayer dollars, risk permanen",
        "id": 3696127,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/30/008214/senators-try-to-halt-shuttle-move-saying-little-evidence-of-public-demand?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Senators Try To Halt Shuttle Move, Saying 'Little Evidence' of Public Demand",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T04:10:07.158672+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T03:30:00+00:00",
        "description": "Researchers in Texas confirmed the first documented wild hybrid between a blue jay and a green jay -- a rare pairing that is likely a result of climate change and habitat shifts. Slashdot reader fjo3 shares a report from CNN: \"We think it's the first observed vertebrate that's hybridized as a result of two species both expanding their ranges due, at least in part, to climate change,\" said Brian Stokes, a doctoral student of biology at the University of Texas at Austin and first author of the study published September 10 in the journal Ecology and Evolution. The vividly colored green jay is found in parts of South and Central America, Mexico and a limited portion of southern Texas. But since 2000, the tropical bird's territory has expanded north by hundreds of kilometers -- more than 100 miles and about 2 degrees of latitude -- along the Rio Grande and up toward San Antonio, said study coauthor Timothy Keitt.\n \nAvid birders across Central Texas have taken note, sharing sightings of the",
        "id": 3695117,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/30/000219/climate-change-spurs-rare-hybrid-between-blue-jay-and-green-jay?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Climate Change Spurs Rare Hybrid Between Blue Jay and Green Jay",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T02:39:51.451814+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T02:20:00+00:00",
        "description": "alternative_right shares a report from 404 Media: Critics of YouTuber Ethan Klein are pushing back on subpoenas that would reveal their identities as part of an ongoing legal fight between Klein and his detractors. Klein is a popular content creator whose YouTube channel has more than 2 million subscribers. He's also involved in a labyrinthine personal and legal beef with three other content creators and the moderators of a subreddit that criticizes his work. Klein filed a legal motion to compel Discord and Reddit to reveal the identities of those moderators, a move their lawyers say would put them in harm's way and stifle free speech on the internet forever.\n \n[...] On July 31, a judge allowed Klein's lawyers to file a subpoena with Reddit and Discord that would reveal the identities of the people running r/h3snark and an associated Discord server. On September 22, lawyers for the defendants filed a motion to quash the subpoenas. \"On its face, the Action is about copyright infringeme",
        "id": 3694839,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/29/2350234/reddit-mods-sued-by-youtuber-ethan-klein-fight-efforts-to-unmask-them?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Reddit Mods Sued By YouTuber Ethan Klein Fight Efforts To Unmask Them",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T02:39:51.527101+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T01:40:00+00:00",
        "description": "Pirate sports streaming site Streameast has quietly reclaimed the Streameast.xyz domain after U.S. authorities allowed it to expire, despite having seized it under a federal warrant in 2024. TorrentFreak reports: While researching both old and newly-seized Streameast domains recently, we noticed that Streameast.xyz expired earlier this year. Apparently, it was not renewed by those who controlled it, as the seizure banner was gone. Instead, the domain appeared to have been reclaimed by the original Streameast team. While it is not listed as an official mirror site, Streameast.xyz points to content from the original site once again. And indeed, the original Streameast team confirms that the domain is theirs.\n \nIt is not clear why the U.S. authorities lost control of the domain or whether it was intentional. Other domain names covered by the same seizure warrant were renewed recently, including Streameast.io. The Streameast team might view this as a significant symbolic victory. After al",
        "id": 3694840,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/29/2344210/streameast-reclaims-domain-name-previously-seized-by-us-government?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Streameast Reclaims Domain Name Previously Seized By US Government",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T01:20:01.266141+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T01:00:00+00:00",
        "description": "OpenAI unveiled Instant Checkout, a new ChatGPT feature that lets users buy stuff directly through its chatbot. Currently, the feature supports single-item purchases directly from Etsy sellers, but support for more than one million Shopify merchants is coming soon. It's also only available to U.S. ChatGPT Plus, Pro and Free users at this time. CNBC reports: OpenAI will take a fee from transactions that are completed through ChatGPT, which means Instant Checkout could become an important new revenue stream for the startup. OpenAI is not yet profitable, and is burning through cash as it works to scale up its computing infrastructure. The company declined to share specific details about how large the fees are since they are determined through confidential contracts with Etsy and Shopify. Instant Checkout is free to users and will not affect their prices, OpenAI said.\n \n\"Our vision for ChatGPT -- and a lot of the technology we create, but especially ChatGPT -- is that it's not just provid",
        "id": 3694604,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/29/2119248/chatgpt-adds-instant-checkout-to-shop-directly-in-chat?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ChatGPT Adds 'Instant Checkout' To Shop Directly In Chat",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-30T01:20:01.335935+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-30T00:20:00+00:00",
        "description": "An anonymous reader quotes a report from CBS News: A pair of e-commerce entrepreneurs who bought a number of well-known retail brands -- including RadioShack, Modell's Sporting Goods and Pier 1 Imports -- out of bankruptcy are accused of running a Ponzi scheme. The Securities and Exchange Commission on Monday accused Alex Mehr and Tai Lopez, founders of the Miami-based Retail Ecommerce Ventures (REV), of defrauding investors out of approximately $112 million. Through their holding company, Mehr and Lopez acquired distressed brick-and-mortar companies in order to turn them into successful, online-only brands. Dress Barn and Linens 'n Things were also among their acquisitions. [...]\n \nThe SEC's suit alleges that between 2020 and 2022, Mehr and Lopez, \"made material misrepresentations\" to hundreds of investors about the bankrupt retailers they had acquired. For example, to entice individuals to invest in their acquisitions, they said their portfolio companies were \"on fire\" and that \"cas",
        "id": 3694605,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/29/2112250/buyers-of-radioshack-accused-of-running-112-million-ponzi-scheme?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Buyers of RadioShack Accused of Running $112 Million Ponzi Scheme",
        "vote": 0
    }
]