[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T18:59:35.931637+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T18:00:10+00:00",
        "description": "Watch this session recorded at Unreal Fest Orlando 2025 in which Matthew Campbell of Obsidian gives a tour of Unreal Engine 5 technologies and customizations used to ensure performance and quality in action role-playing game ‘Avowed’.\n\nThis session, focused on GPU, performance, and notable customizations, discusses the successes, failures and pain points encountered during production of ‘Avowed’, along with where and how the use of these features affected performance on the Xbox Series S/X and PC. \n\nUnder the hood, ‘Avowed’ incorporates several UE5 core render technologies including Lumen, Nanite, Virtual Shadow Maps, and ray tracing to achieve its performance and quality goals. This session explores the implementation of these technologies in the game.\n\nLearn more about using Unreal Engine for video games here: www.unrealengine.com/uses/games\n\n#Obsidian, #Avowed, #Lumen, #Nanite, #VirtualShadowMaps, #RayTracing, #GameDevelopment, #UnrealEngine, #UE5, #UnrealFestOrlando",
        "id": 3729030,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BKaAzhMHJZ0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BKaAzhMHJZ0/hqdefault.jpg",
        "title": "Avowed: A GPU Technical Retrospective | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T16:23:01.825090+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T16:01:07+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Jase Lindgren, Sr. Solutions Engineer and P4 Evangelist at Perforce, reveals some practical examples for bringing your developers and artists into a unified workflow between artist software and Unreal Editor using the latest Perforce P4 version control tools. \n\nMaking an engaging game, film, or virtual experience takes more than a great vision and mechanics. It requires great character design, performances, and sound to fully immerse you into a new world. \n\nWatch this video to learn how to combine your 3D/2D art, music, voiceovers, and Blueprints into one cohesive project while picking up tips that will make your life easier—for your own development and your collaborators’. \n\nTo find out more about Unreal Engine, check out our website: unrealengine.com/feed\n\n#PerforceP4, #VersionControl, #3DArt, #2DArt, #Music, #Voiceovers, #BlueprintVisualScripting, #UnrealEngine, #UE5, #UnrealFestOrlando",
        "id": 3727663,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_pkJFG85FhM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_pkJFG85FhM/hqdefault.jpg",
        "title": "Integrate Art, Sound, and Code into Unreal Engine with Perforce P4 | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T15:00:16.044456+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T14:00:22+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, CORYS gives an overview of their project to completely redevelop their production pipeline under Unreal Engine 5, with the aim of bringing a new level of realism to rail simulation, and to increase production efficiency with tools for editing and procedural/parametric asset generation.\n\nUnreal Engine features implemented as part of the CORYS project include Nanite and Lumen, alongside a CORYS-developed module called World Manager that defines the cells, loads GIS data, gets the terrain, and distributes the work. The team also integrated with an existing C++ simulator and implemented a non-destructive pre-cooking pass.\n\nCORYS has been meeting the simulation needs of freight, passenger rail and urban transportation operators worldwide for three decades. The company pioneered the use of CGI for transportation simulation decades ago, and remains a leader today with high-fidelity imagery driven by advanced data processing and AI.\n\nFind ",
        "id": 3726828,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=8d7HjwKkivo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8d7HjwKkivo/hqdefault.jpg",
        "title": "Building a Next-Gen Simulator Production Pipeline with Unreal Engine 5 | Unreal Fest Orlando 2025",
        "vote": 0
    }
]