[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T23:45:28.375213+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T23:20:00+00:00",
        "description": "Last month, federal investigators said they dismantled a China-linked plot that aimed to cripple New York City's telecommunications system by overloading cell towers, jamming 911 calls, and disrupting communications. According to law enforcement sources, the plot was even bigger than first thought. \"Agents from Homeland Security Investigations found an additional 200,000 SIM cards at a location in New Jersey,\" according to ABC News. \"That's double the 100,000 SIM cards, along with hundreds of servers, that were recently seized at five other vacant offices and apartments in and around the city.\" From the report: Investigators secured each of those locations, seized the electronics, and are now trying to track down who rented the spaces and filled them with shelves full of gear capable of sending 30 million anonymous text messages every minute, overloading communications and blacking out cellular service in a city that relies on it for emergency response and counterterrorism.\n \nAccordin",
        "id": 3730807,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/10/03/2131218/thwarted-plot-to-cripple-cell-service-in-ny-was-bigger-than-first-thought",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Thwarted Plot To Cripple Cell Service In NY Was Bigger Than First Thought",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T23:45:28.495353+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T22:40:00+00:00",
        "description": "OpenAI's valuation has surged to $500 billion after a $6.6 billion secondary stock sale, briefly making it the world's most valuable startup ahead of SpaceX and ByteDance. The Associated Press reports: Current and former OpenAI employees sold $6.6 billion in shares to a group of investors, pushing the privately held artificial intelligence company's valuation to $500 billion, according to a source with knowledge of the deal who was not authorized to discuss it publicly. The investors buying the shares included Thrive Capital, Dragoneer Investment Group and T. Rowe Price, along with Japanese tech giant SoftBank and the United Arab Emirates' MGX, the source said Thursday.\n \nThe valuation reflects high expectations for the future of AI technology and continues OpenAI's remarkable trajectory from its start as a nonprofit research lab in 2015. But with the San Francisco-based company not yet turning a profit, it could also amplify concerns about an AI bubble if the generative AI products m",
        "id": 3730808,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/03/2120259/openai-becomes-worlds-most-valuable-startup-after-500-billion-valuation",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Becomes World's Most Valuable Startup After $500 Billion Valuation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T22:38:00.753409+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T22:02:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: As we careen toward a future in which Google has final say over what apps you can run, the company has sought to assuage the community's fears with a blog post and a casual \"backstage\" video. Google has said again and again since announcing the change that sideloading isn't going anywhere, but it's definitely not going to be as easy. The new information confirms app installs will be more reliant on the cloud, and devs can expect new fees, but there will be an escape hatch for hobbyists.\n \nConfirming app verification status will be the job of a new system component called the Android Developer Verifier, which will be rolled out to devices in the next major release of Android 16. Google explains that phones must ensure each app has a package name and signing keys that have been registered with Google at the time of installation. This process may break the popular FOSS storefront F-Droid. It would be impossible for your phone to carr",
        "id": 3730495,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/03/2027237/google-confirms-android-dev-verification-will-have-free-and-paid-tiers-no-public-list-of-devs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Confirms Android Dev Verification Will Have Free and Paid Tiers, No Public List of Devs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T22:38:00.913362+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T21:22:00+00:00",
        "description": "Dozens of countries have yet to secure accommodation at next month's COP30 climate summit in Brazil and some delegates are considering staying away as a shortage of hotels has driven prices to hundreds of dollars per night. Reuters: Small island states on the frontline of rising sea levels are confronted with having to consider reducing the size of delegations they send to Belem, while two European nations said they were considering not attending at all. \n\nCOP30 organisers are racing to convert love motels, cruise ships and churches into lodgings for an anticipated 45,000 delegates. Brazil chose to hold the climate talks at Belem, which typically has 18,000 hotel beds available, in the hope its location on the edge of the Amazon rainforest would focus attention on the threat climate change poses to this ecosystem, and its role in absorbing climate-warming emissions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Hot",
        "id": 3730496,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/03/166218/hotel-prices-lead-countries-to-consider-skipping-cop30-climate-summit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hotel Prices Lead Countries To Consider Skipping COP30 Climate Summit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T21:21:34.327951+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T20:41:00+00:00",
        "description": "An anonymous reader shares a report from The Verge: Microsoft is getting ready to announce an ad-supported version of Xbox Cloud Gaming. Sources familiar with Microsoft's plans tell The Verge that the software maker has started testing ad-supported games streaming internally, allowing employees to play select titles free without a Game Pass subscription. \n\nI understand that the free ad-supported version of Xbox Cloud Gaming will include the ability to stream some games you own, as well as eligible Free Play Days titles, which let Xbox players try games over a weekend. You'll also be able to stream Xbox Retro Classics games. Sources tell me the internal testing includes around two minutes of preroll ads before a game is available to stream for free through Xbox Cloud Gaming. [...] The ad-supported Xbox Cloud Gaming version will be available on PC, Xbox consoles, handheld devices, and via the web.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http",
        "id": 3729981,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/03/1537231/microsoft-is-about-to-launch-free-xbox-cloud-gaming-with-ads",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft is About To Launch Free Xbox Cloud Gaming With Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T20:08:46.524710+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T20:01:00+00:00",
        "description": "The blackout that left Spain without power last April was the most severe incident to hit European networks in two decades and the first of its kind, according to the European Network of Transmission System Operators for Electricity. Damian Cortinas, the organization's chairman, said the April 28 outage was Europe's first blackout linked to cascading voltages. More than 50 million people lost electricity for several hours. \n\nA preliminary report published in July attributed the outage to a chain of power generation disconnections and abnormal voltage surges. The final assessment will be released in the first quarter of next year and presented to the European Commission and member states. A government probe in June found that grid operator Red Electrica failed to replace one of 10 planned thermal plants, reducing reserve capacity. Spain spent only $0.3 on its grid for every dollar invested in renewables between 2020 and 2024, the lowest ratio among European countries and well below the",
        "id": 3729463,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/03/1527209/spain-outage-was-first-of-its-kind-worst-in-decades-group-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Spain Outage Was First of Its Kind, Worst in Decades, Group Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T20:08:46.606719+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T19:21:00+00:00",
        "description": "theodp writes: From Thursday's Code.org press release announcing the replacement of the annual Hour of Code for K-12 schoolkids with the new Hour of AI: \"A decade ago, the Hour of Code ignited a global movement that introduced millions of students to computer science, inspiring a generation of creators. Today, Code.org announced the next chapter: the Hour of AI, a global initiative developed in collaboration with CSforALL and supported by dozens of leading organizations. [...] As artificial intelligence rapidly transforms how we live, work, and learn, the Hour of AI reflects an evolution in Code.org's mission: expanding from computer science education into AI literacy. This shift signals how the education and technology fields are adapting to the times, ensuring that students are prepared for the future unfolding now.\" \n\n\"Just as the Hour of Code showed students they could be creators of technology, the Hour of AI will help them imagine their place in an AI-powered world,\" said Hadi P",
        "id": 3729464,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/03/1515258/tech-companies-to-k-12-schoolchildren-learn-to-ai-is-the-new-learn-to-code",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tech Companies To K-12 Schoolchildren: Learn To AI Is the New Learn To Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T18:52:05.594114+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T18:40:00+00:00",
        "description": "Ha Dang, a self-taught accountant from Scunthorpe who trained via YouTube, won the inaugural Microsoft Excel UK Championships on September 30. The victory earned him a spot at the Microsoft Excel World Championships in Las Vegas, a three-day tournament inside a 30,000-square-foot esports arena where players compete for $5,000 and are broadcast on ESPN. \n\nThirty competitors sat shoulder to shoulder through three gruelling rounds of spreadsheet challenges. Each round featured a custom case with seven levels of increasing difficulty. The second round case, Right Royal Battle Part II, took 80 drafts to perfect. Players calculated troop sizes from emoji battalions and army movements across fourteenth-century France. Hadyn Wiseman, who once held the Guinness World Record for most backflips in a minute, placed fourth. Lara Holding-Jones finished thirteenth. Jaq Kennedy founded the UK chapter last year. National chapters have since formed in Germany, Brazil, and Chile.<p><div class=\"share_sub",
        "id": 3728922,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/03/0815211/microsoft-excel-uk-championships-crowned-its-first-winner",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Excel UK Championships Crowned Its First Winner",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T18:52:05.685624+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T18:01:00+00:00",
        "description": "Social media usage peaked in 2022 and has been on a steady decline since. An analysis of 250,000 adults across more than 50 countries by the digital audience insights company GWI found that adults aged 16 and older spent an average of two hours and 20 minutes per day on social platforms at the end of 2024. That figure is down almost 10% from 2022. The decline is most pronounced among teenagers and people in their twenties. \n\nUsage has traced a smooth curve upward and then downward over the past decade. This is not simply the unwinding of increased screen time during pandemic lockdowns. The data also captured a shift in how people use these platforms. The share of people who report using social media to stay in touch with friends, express themselves or meet new people has fallen by more than a quarter since 2014. \n\nOpening the apps reflexively to fill spare time has risen. North America is an exception to the global trend. Social media consumption there continues to climb. By 2024 it r",
        "id": 3728923,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/03/0825245/have-we-passed-peak-social-media",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Have We Passed Peak Social Media?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T17:38:32.184901+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T17:21:00+00:00",
        "description": "Jeff Bezos told an audience on Friday that gigawatt-scale data centers will be built in space within the next ten to twenty years. The Amazon founder said these orbital facilities would eventually outperform their terrestrial counterparts because space offers uninterrupted solar power around the clock. \n\nBezos was speaking in a fireside chat with Ferrari and Stellantis Chairman John Elkann. He said the giant training clusters needed for AI would be better built in space because there are no clouds, rain or weather to interrupt power generation. Bezos predicted that space-based data centers would beat the cost of Earth-based ones within a couple of decades. He described the shift as part of a broader pattern that has already occurred with weather satellites and communication satellites. The next steps would be data centers and then other kinds of manufacturing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Jeff+Bezo",
        "id": 3728347,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/03/1426244/jeff-bezos-predicts-gigawatt-data-centers-in-space-within-two-decades",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Jeff Bezos Predicts Gigawatt Data Centers in Space Within Two Decades",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T17:38:32.257225+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T16:40:00+00:00",
        "description": "Air pollution increases the likelihood of people becoming frail in middle and old age, according to an international review of studies. The Guardian: The review team found 10 studies that looked at outdoor air pollution and frailty. The people studied came from 11 countries including China, the UK, Sweden, South Africa and Mexico. Two of the studies showed that men were more vulnerable than woman, with a stronger association between particle pollution and frailty. The risk of frailty increased with outdoor particle pollution. For the UK, this could mean about 10-20% of frailty cases are attributable to air pollution. \n\nExposure to secondhand smoking was the environmental factor that presented the greatest risk of frailty. The risk of frailty was increased by about 60% for people who breathed other people's smoke at home. Using solid fuels for cooking or home heating also carried an extra risk of frailty. This was about half the risk of living with a smoker, based on studies from six c",
        "id": 3728348,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/03/117228/frailty-in-ageing-populations-worsened-by-air-pollution-global-review-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Frailty in Ageing Populations Worsened By Air Pollution, Global Review Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T16:13:52.927988+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T16:00:00+00:00",
        "description": "Pew Research: Public awareness of legal sports betting has grown in recent years -- and so has the perception that it is a bad thing for society and sports, according to a new Pew Research Center survey. Today, 43% of U.S. adults say the fact that sports betting is now legal in much of the country is a bad thing for society. That's up from 34% in 2022. And 40% of adults now say it's a bad thing for sports, up from 33%. \n\nDespite these increasingly critical views of legal sports betting, many Americans continue to say it has neither a bad nor good impact on society and on sports. Fewer than one-in-five see positive impacts. Meanwhile, the share of Americans who have bet money on sports in the past year has not changed much since 2022. \n\nToday, 22% of adults say they've personally bet money on sports in the past year. That's a slight uptick from 19% three years ago. This figure includes betting in any of three ways:\n1. With friends or family, such as in a private betting pool, fantasy l",
        "id": 3727596,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/03/0918249/americans-increasingly-see-legal-sports-betting-as-a-bad-thing-for-society-and-sports",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Americans Increasingly See Legal Sports Betting as a Bad Thing For Society and Sports",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T16:13:53.007118+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T15:21:00+00:00",
        "description": "No automaker has matched Tesla's ability to deliver over-the-air software updates despite years of effort and billions in spending. Tesla introduced the technology in 2012 and issued 42 updates within six months, Jean-Marie Lapeyre, Capgemini's chief technology officer for automotive, told WIRED. Other automakers ship updates \"maybe once a year,\" Lapeyre said. \n\nGeneral Motors actually introduced OTA functionality first in 2010, two years before Tesla, but limited it to the OnStar telematics system. Traditional automakers treat software as one bolt-on component among many. Tesla and other digital-native brands like Rivian, Lucid and Chinese companies including BYD and Xpeng treat it as central. There are now 69 million OTA-capable vehicles in the United States, S&amp;P Global estimates. More than 13 million vehicles were recalled in 2024 due to software-related issues, a 35 percent increase over the prior year. OTA updates cost automakers $66.50 per vehicle for each gigabyte of data, ",
        "id": 3727597,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/03/151237/teslas-lead-in-car-software-updates-remains-unchallenged",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tesla's Lead in Car Software Updates Remains Unchallenged",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T14:54:07.294723+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T14:41:00+00:00",
        "description": "The Cybersecurity Information Sharing Act expired on Wednesday when the federal government shut down. The law had provided legal protections since 2015 for organizations to share cyber threat intelligence with federal agencies. Without these protections, private sector companies that control most U.S. critical infrastructure face potential legal risks when sharing information about threats. Sen. Gary Peters called the lapse \"an open invitation to cybercriminals and hostile actors to attack our economy and our critical infrastructure.\" \n\nThe intelligence sharing enabled by CISA 2015 helped expose Chinese campaigns including Volt Typhoon in 2023 and Salt Typhoon last year. Several cybersecurity firms pledged to continue sharing threat data despite the law's expiration. Halcyon and CrowdStrike confirmed they would maintain information sharing. Palo Alto Networks said it remained committed to public-private partnerships but did not specify whether it would continue sharing threat data. Mu",
        "id": 3726738,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/03/1441215/key-cybersecurity-intelligence-sharing-law-expires-as-government-shuts-down",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Key Cybersecurity Intelligence-Sharing Law Expires as Government Shuts Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T14:54:07.495962+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T14:00:00+00:00",
        "description": "James Marriott, writing in a column: The world of print is orderly, logical and rational. In books, knowledge is classified, comprehended, connected and put in its place. Books make arguments, propose theses, develop ideas. \"To engage with the written word,\" the media theorist Neil Postman wrote, \"means to follow a line of thought, which requires considerable powers of classifying, inference-making and reasoning.\" \n\nAs Postman pointed out, it is no accident, that the growth of print culture in the eighteenth century was associated with the growing prestige of reason, hostility to superstition, the birth of capitalism, and the rapid development of science. Other historians have linked the eighteenth century explosion of literacy to the Enlightenment, the birth of human rights, the arrival of democracy and even the beginnings of the industrial revolution. The world as we know it was forged in the reading revolution. \n\nNow, we are living through the counter-revolution. More than three hu",
        "id": 3726739,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/03/096256/the-dawn-of-the-post-literate-society",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Dawn of the Post-Literate Society",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T14:54:07.720995+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T13:00:00+00:00",
        "description": "Longtime Slashdot reader theodp writes: Big Tech Told Kids to Code. The Jobs Didn't Follow, a New York Times podcast episode discussing how the promise of a six-figure salary for those who study computer science is turning out to be an empty one for recent grads in the age of AI, drew the ire of the co-founders of nonprofit Code.org, which -- ironically -- is pivoting to AI itself with the encouragement of, and millions from, its tech-giant backers.\n \nIn a LinkedIn post, Code.org CEO and co-founder Hadi Partovi said the paper and its Monday episode of \"The Daily\" podcast were cherrypicking anecdotes \"to stoke populist fears about tech corporations and AI.\" He also took to X, tweeting: \"Today the NYTimes (falsely) claimed CS majors can't find work. The data tells the opposite story: CS grads have the highest median wage and the fifth-lowest underemployment across all majors. [...] Journalism is broken. Do better NYTimes.\" To which Code.org co-founder Ali Partovi (Hadi's twin), replied:",
        "id": 3726740,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/10/03/0426240/nyt-podcast-on-job-market-for-recent-cs-grads-raises-ire-of-codeorg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "NYT Podcast On Job Market For Recent CS Grads Raises Ire of Code.org",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T10:18:01.458778+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T10:00:00+00:00",
        "description": "Snapchat will start charging users who exceed 5GB of saved Memories, with paid plans starting at $1.99/month for 100GB. \"If your memories exceed this limit, you'll need to subscribe to one of its new Memories Storage plans,\" reports TechCrunch. From the report: The company told TechCrunch in an email that the introductory storage plan offers up to 100GB of storage for $1.99 per month. Snapchat+ users will get up to 250GB of storage as part of their $3.99 monthly subscription, while Snapchat Platinum users will get 5TB as part of their $15.99 monthly subscription. Snapchat explains that when it first launched Memories, it didn't expect it to grow to what it has today, as users have saved more than 1 trillion Memories on the platform.\n \nSnapchat will provide 12 months of temporary Memories storage for any Memories that exceed the 5GB storage limit. The company notes that users can download Memories directly to their devices. If you're over the limit, but don't sign up for a plan, your o",
        "id": 3724959,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/03/0444229/snapchat-caps-free-memory-storage-launches-paid-storage-plans",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Snapchat Caps Free Memory Storage, Launches Paid Storage Plans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T07:56:55.501126+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T07:00:00+00:00",
        "description": "An anonymous reader quotes a report from MIT Technology Review: A team at Microsoft says it used artificial intelligence to discover a \"zero day\" vulnerability in the biosecurity systems used to prevent the misuse of DNA. These screening systems are designed to stop people from purchasing genetic sequences that could be used to create deadly toxins or pathogens. But now researchers led by Microsoft's chief scientist, Eric Horvitz, says they have figured out how to bypass the protections in a way previously unknown to defenders.The team described its work today in the journalScience.\n \nHorvitz and his team focused on generative AI algorithms that propose new protein shapes. These types of programs are already fueling the hunt for new drugs at well-funded startups like Generate Biomedicines and Isomorphic Labs, a spinout of Google. The problem is that such systems are potentially \"dual use.\" They can use their training sets to generate both beneficial molecules and harmful ones. Microso",
        "id": 3724251,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/02/2335217/microsoft-says-ai-can-create-zero-day-threats-in-biology",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Says AI Can Create 'Zero Day' Threats In Biology",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T06:27:24.922200+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T03:30:00+00:00",
        "description": "alternative_right shares a report from the Smoking Gun: Minutes after vandalizing 17 cars in a Missouri college parking lot, a 19-year-old sophomore had a lengthy ChatGPT conversation during which he confessed to the crime, asked about the possibility of getting caught, and wondered, \"is there any way they could know it was me,\" according to a police probable cause statement. Ryan Schaefer was arrested yesterday and charged with felony property damage for a rampage early Sunday at a Missouri State University parking lot. Investigators allege that Schaefer shattered car windows, ripped off side mirrors, dented hoods, and broke windshield wipers during the 3 AM spree.\n \nWhen confronted with surveillance footage and other evidence, Schaefer said that he could see the resemblance between the suspect and himself. At that point, Schaefer reportedly consented to a search of his iPhone. A subsequent review of the device revealed location data placing Schaefer \"at or near the scene of the crim",
        "id": 3722952,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/02/238239/cops-accused-vandal-confessed-to-chatgpt",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Cops: Accused Vandal Confessed To ChatGPT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T06:27:25.027522+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T02:02:00+00:00",
        "description": "Bruce66423 shares a report from The Guardian: Those diagnosed as small children typically have distinct genetic profile from those diagnosed later, [finds an international study based on genetic data from more than 45,000 autistic people in Europe and the U.S]. So, there's more than one condition out there that's being diagnosed as \"autism.\" This, of course, messes with the debate about causes; one version of autism may be caused by something for which the evidence is very weak overall. \"The term 'autism' likely describes multiple conditions,\" said Dr Varun Warrier, from Cambridge's department of psychiatry, senior author of the research. \"For the first time, we have found that earlier and later diagnosed autism have different underlying biological and developmental profiles.\"\n \n\"It is a gradient,\" added Warrier. \"There are also many other factors that contribute to age of diagnosis, so the moment you go from averages to anything that is applicable to an individual, it's false equival",
        "id": 3722953,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/02/2217211/autism-should-not-be-seen-as-single-condition-with-one-cause-say-scientists",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Autism Should Not Be Seen As Single Condition With One Cause, Say Scientists",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T06:27:25.128483+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T01:25:00+00:00",
        "description": "Ford's push for a four-day in-office workweek hit turbulence when someone hijacked meeting room screens to display an anti-RTO protest image targeting CEO Jim Farley. The company quickly removed it and is investigating. The Detroit Free Press reports: According to photos employees took of the image, which were posted on social media and sent to the Detroit Free Press, it contained an image of CEO Jim Farley along with a big red circle with a slash through it over his face and the words \"(Expletive) RTO.\"\n \n\"We're aware of an inappropriate use of Ford's IT technology and we're investigating it,\" Dave Tovar, Ford spokesman, told the Detroit Free Press. Tovar said the image was up for \"a short amount of time\" and Ford was able to quickly remove it. He said the company is investigating whether the image appeared only in Dearborn offices or globally.\n \nFarley mandated that employees return to the office four days a week earlier this year and it has been in place since Sept. 1, with no fall",
        "id": 3722954,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/02/224238/ford-it-systems-tampered-with-to-display-vulgar-anti-rto-message-across-office-screens",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ford IT Systems Tampered With To Display Vulgar Anti-RTO Message Across Office Screens",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T06:27:25.243783+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T00:45:00+00:00",
        "description": "Colorado unveiled an autonomous crash-protection truck designed to absorb highway work zone collisions, removing human drivers from one of the most dangerous road maintenance roles. The Denver Gazette reports: At a press event in Falcon on Monday, the Colorado Department of Transportation demonstrated an autonomous truck-mounted attenuator -- a driverless crash-protection vehicle designed to absorb impacts in roadside work areas. These trucks are already in the state's fleet, but previously required a worker in the cab, leaving them exposed during crashes. \"These vehicles are designed to get hit so people don't have to,\" said Kay Kelly, CDOT's chief of innovative mobility. \"We want to remove the human from that truck whenever possible.\"\n \n[...] Colorado pioneered this technology in 2017, becoming the first state to test it. Developed by San Diego-based defense contractor Kratos Defense, the company started on autonomous follower systems in 2012 and installed its initial version in Col",
        "id": 3722955,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/02/2156215/colorado-deploys-self-driving-crash-trucks-to-protect-highway-workers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Colorado Deploys Self-Driving Crash Trucks To Protect Highway Workers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T06:27:25.350850+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: New Zealand's Institute of IT Professionals has discovered it is insolvent and advised members it has no alternative but to enter liquidation. The Institute (ITP) wrote to members on Thursday and posted a document titled \"Important Update on ITP's Future\" that reveals it has \"reached a point where the organization cannot continue. After a full review of our finances, the Board has confirmed that ITP is insolvent.\"\n \nInsolvency seems to have come as something of a surprise. \"These debts are historic. They go back over many years. While some of the issues were worked on in more recent times, the full scale of the problem only became visible during the leadership change in 2025,\" the Update states. \"Once the Board understood the full picture, it was clear that there was no responsible way forward other than liquidation.\" [...]\n \nITP's constitution requires its members to formally resolve to wind up the organization, so as one of its ",
        "id": 3722956,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/02/2116200/new-zealands-institute-of-it-professionals-collapses",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Zealand's Institute of IT Professionals Collapses",
        "vote": 0
    }
]