[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T18:32:12.577743+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T17:30:16+00:00",
        "description": "It's always refreshing to see unique concepts for video games surface in a crowd of releases that do not really raise the bar despite being solid offerings. Kingmakers is certainly one of the more unique titles we've covered this year, bringing a unique blend of time-travel shenanigans, RTS strategy, and  futuristic action to the countryside of 1401 Wales. \n\nWhile using the weapons of the present (or future) against forces of the past is easy to write off as a power trip that can quickly get boring, this is a game that seems to have accounted for that very complaint, and made provisions to sustain the thrills it can bring for the duration of its campaign. If you're on the fence about this one, our list of things to know about it could help you decide one way or another.",
        "id": 3728757,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=_Ha8j_24LCU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_Ha8j_24LCU/hqdefault.jpg",
        "title": "Kingmakers - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T15:55:19.098446+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T15:30:17+00:00",
        "description": "In the lead up to Battlefield 6’s release, conversation has zeroed on its potential to boot stamp Call of Duty: Black Ops 7. This pair of FPS titans have locked horns throughout history, with Call of Duty routinely coming out on top. This time, however, it seems Battlefield is securing victory by locking into the zeitgeist, whilst Call of Duty strays too far away from what its fans want.\n\nAfter all, Battlefield 6 is laser-focused on delivering a tightly crafted experience, returning the series to its best via cinematic battles, emergent moments, and class-based infantry. Black Ops 7, behind its ambition, feels a muddle of ideas. \n\nHowever, is this simply a case of series fatigue? Or, are CoD players tired of spending on a series which continues moving away from its DNA? The big question though: is Battlefield 6 a CoD killer?",
        "id": 3727456,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=U04fjZkPlPk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/U04fjZkPlPk/hqdefault.jpg",
        "title": "Why Battlefield 6 Is All Set To DESTROY Call of Duty Black Ops 7",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-03T14:22:00.714778+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-03T13:45:08+00:00",
        "description": "It can be hard to compare two titles that do things so differently while retaining a lot of similarities aside from their setting and story beats. But Ghost of Yotei and Assassin's Creed Shadows are additions to the open-world action adventure genre that must be compared thanks to how their respective takes on ancient Japan each bring a lot of cool touches.\n\nBut is it even possible to pick a winner between two titles that seem so alike on paper? Turn out that the answer is not only a resounding yes, but getting there is a battle almost as epic as the ones we've faced in both games. Join us as we pick a favorite among favorites in this interesting match-up.",
        "id": 3726547,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=orfW3r1NdPE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/orfW3r1NdPE/hqdefault.jpg",
        "title": "Ghost of Yotei vs. Assassin's Creed Shadows - The Ultimate Showdown",
        "vote": 0
    }
]