[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T23:37:05.024047+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T23:00:00+00:00",
        "description": "Yoshua Bengio, a pioneer in AI and Turing Award winner, has launched a $30 million non-profit aimed at developing \"honest\" AI systems that detect and prevent deceptive or harmful behavior in autonomous agents. The Guardian reports: Yoshua Bengio, a renowned computer scientist described as one of the \"godfathers\" of AI, will be president of LawZero, an organization committed to the safe design of the cutting-edge technology that has sparked a $1 trillion arms race. Starting with funding of approximately $30m and more than a dozen researchers, Bengio is developing a system called Scientist AI that will act as a guardrail against AI agents -- which carry out tasks without human intervention -- showing deceptive or self-preserving behavior, such as trying to avoid being turned off.\n \nDescribing the current suite of AI agents as \"actors\" seeking to imitate humans and please users, he said the Scientist AI system would be more like a \"psychologist\" that can understand and predict bad behavi",
        "id": 2842542,
        "language": null,
        "link": "https://slashdot.org/story/25/06/03/2149233/ai-pioneer-announces-non-profit-to-develop-honest-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Pioneer Announces Non-Profit To Develop 'Honest' AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T22:32:41.376095+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T22:20:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: In a nod to European customers' growing mistrust of American hyperscalers, Amazon Web Services says it is establishing a new organization in the region \"backed by strong technical controls, sovereign assurances, and legal protections.\" Ever since the Trump 2.0 administration assumed office and implemented an erratic and unprecedented foreign policy stance, including aggressive tariffs and threats to the national sovereignty of Greenland and Canada, customers in Europe have voiced unease about placing their data in the hands of big U.S. tech companies. The Register understands that data sovereignty is now one of the primary questions that customers at European businesses ask sales reps at hyperscalers when they have conversations about new services.\n \n[...] AWS is forming a new European organization with a locally controlled parent company and three subsidiaries incorporated in Germany, as part of its European Sovereign Cloud (ESC)",
        "id": 2842140,
        "language": null,
        "link": "https://slashdot.org/story/25/06/03/2024222/aws-forms-eu-based-cloud-unit-as-customers-fret?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AWS Forms EU-Based Cloud Unit As Customers Fret",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T22:32:41.532248+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T21:40:00+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report: A Romanian national pleaded guilty on Monday to charges related to his role in a \"swatting\" ring that targeted dozens of public officials, including a former US president. Going by the aliases \"Plank,\" \"Jonah\" and \"Cypher,\" 26-year-old Thomasz Szabo took part in a years-long conspiracy to place bogus 911 calls, claiming emergencies were taking place at the homes of top government officials, and make bomb threats against government buildings and houses of worship, according to the Justice Department.\n \nSzabo and a co-conspirator, 21-year-old Serbian national Nemanja Radovanovic, allegedly targeted about 100 people, including members of Congress, governors, cabinet-level executive branch officials and state officials. Szabo, who was extradited from Romania last November, pleaded guilty to one count of conspiracy and one count of making bomb threats. He is slated to be sentenced in a Washington, DC, federal court in October. [...] Charges",
        "id": 2842141,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/03/2014254/romanian-national-pleads-guilty-to-swatting-over-75-public-officials?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Romanian National Pleads Guilty To 'Swatting' Over 75 Public Officials",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T21:26:05.413631+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T21:00:00+00:00",
        "description": "\"It appears as though Meta (aka: Facebook's parent company) and Yandex have found a way to sidestep the Android Sandbox,\" writes Slashdot reader TheWho79. Researchers disclose the novel tracking method in a report: We found that native Android apps -- including Facebook, Instagram, and several Yandex apps including Maps and Browser -- silently listen on fixed local ports for tracking purposes.\n \nThese native Android apps receive browsers' metadata, cookies and commands from the Meta Pixel and Yandex Metrica scripts embedded on thousands of web sites. These JavaScripts load on users' mobile browsers and silently connect with native apps running on the same device through localhost sockets. As native apps access programmatically device identifiers like the Android Advertising ID (AAID) or handle user identities as in the case of Meta apps, this method effectively allows these organizations to link mobile browsing sessions and web cookies to user identities, hence de-anonymizing users' v",
        "id": 2841755,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/03/205251/meta-and-yandex-are-de-anonymizing-android-users-web-browsing-identifiers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta and Yandex Are De-Anonymizing Android Users' Web Browsing Identifiers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T21:26:05.577989+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T20:20:00+00:00",
        "description": "An anonymous reader quotes a report from the Latin Times: A once-hyped AI startup backed by Microsoft has filed for bankruptcy after it was revealed that its so-called artificial intelligence was actually hundreds of human workers in India pretending to be chatbots. Builder.ai, a London-based company previously valued at $1.5 billion, marketed its platform as an AI-powered solution that made building apps as simple as ordering pizza. Its virtual assistant, \"Natasha,\" was supposed to generate software using artificial intelligence. In reality, nearly 700 engineers in India were manually coding customer requests behind the scenes, the Times of India reported.\n \nThe ruse began to collapse in May when lender Viola Credit seized $37 million from the company's accounts, uncovering that Builder.ai had inflated its 2024 revenue projections by 300%. An audit revealed the company generated just $50 million in revenue, far below the $220 million it claimed to investors. A Wall Street Journal rep",
        "id": 2841756,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/03/1954225/ai-startup-revealed-to-be-700-indian-employees-pretending-to-be-chatbots?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Startup Revealed To Be 700 Indian Employees Pretending To Be Chatbots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T20:21:05.132065+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T19:40:00+00:00",
        "description": "Epic Games CEO Tim Sweeney anticipated his company's battle with Apple would create \"fireworks,\" but he never expected Fortnite to disappear from the iOS App Store for nearly five years. When Epic deliberately violated App Store rules in 2020 by inserting its own payment system into Fortnite, Sweeney thought the resulting legal clash would be brief. \"I had actually hoped that we would get an injunction against Apple blocking Fortnite and that we'd only be off for a few weeks,\" Sweeney told The Verge. \"But the court process dragged out, and we were off for five years.\" \n\nFortnite returned to iOS last month and has quickly reclaimed its position as the top free game in the App Store, accumulating roughly 10 million downloads since May 20th. The game now offers players a choice between Epic's payment system, which provides 20% back in Epic Rewards, and Apple's traditional in-app purchase system. About 60% of users have chosen Apple's system while 40% have opted for Epic's alternative, ac",
        "id": 2841269,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/03/1914219/tim-sweeney-didnt-expect-a-five-year-fortnite-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tim Sweeney Didn't Expect a Five-Year Fortnite Ban",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T19:15:45.347153+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T19:00:00+00:00",
        "description": "Microsoft cut hundreds more jobs just weeks after its largest layoff in years, underscoring the tech industry's efforts to trim costs even as it plows billions of dollars into artificial intelligence. From a report: More than 300 employees were told their positions had been eliminated on Monday, according to a Washington state notice reviewed by Bloomberg. \n\nThe cuts impacted a range of positions, including software engineers, marketers, product managers, lawyers and research scientists, a state document showed. A Microsoft spokesperson said the latest headcount reduction is in addition to the 6,000 job cuts announced last month.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Cuts+Hundreds+of+Jobs+After+Firing+6%2C000+in+May%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F03%2F1835226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"",
        "id": 2840736,
        "language": null,
        "link": "https://slashdot.org/story/25/06/03/1835226/microsoft-cuts-hundreds-of-jobs-after-firing-6000-in-may?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Cuts Hundreds of Jobs After Firing 6,000 in May",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T19:15:45.507165+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T18:20:00+00:00",
        "description": "T-Mobile announced Tuesday it will expand its fiber internet service to more than 500,000 households nationwide, offering three symmetrical speed tiers with five-year price locks starting June 5th. The plans range from 500 Mbps at $80 monthly to 2 Gbps at $110 monthly, with $5 autopay discounts for debit card payments. The expansion follows T-Mobile's joint venture with fiber provider Lumos and its pending Metronet acquisition, positioning the wireless carrier to reach 12 to 15 million households by 2030 as it challenges AT&amp;T and Verizon's multibillion-dollar fiber investments.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=T-Mobile+Launches+Fiber+Internet+Service+in+the+US+With+a+Five-Year+Price+Lock%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F03%2F1820218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://ww",
        "id": 2840737,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/03/1820218/t-mobile-launches-fiber-internet-service-in-the-us-with-a-five-year-price-lock?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "T-Mobile Launches Fiber Internet Service in the US With a Five-Year Price Lock",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T18:10:50.734920+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T17:30:00+00:00",
        "description": "Meta has struck a 20-year deal with energy company Constellation to keep the Clinton Clean Energy Center nuclear plant in Illinois operational, the social media giant's first nuclear power purchase agreement as it seeks clean energy sources for AI data centers. The aging facility, which was slated to close in 2017 after years of financial losses and currently operates under a state tax credit reprieve until 2027, will receive undisclosed financial support that enables a 30-megawatt capacity expansion to 1,121 MW total output. \n\nThe arrangement preserves 1,100 local jobs while generating electricity for 800,000 homes, as Meta purchases clean energy certificates to offset a portion of its growing carbon footprint driven by AI operations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta's+Going+To+Revive+an+Old+Nuclear+Power+Plant%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F03%2F1720258%2F%3Futm_source%3D",
        "id": 2840285,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/03/1720258/metas-going-to-revive-an-old-nuclear-power-plant?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta's Going To Revive an Old Nuclear Power Plant",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T17:07:55.454246+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T16:50:00+00:00",
        "description": "Animal cloning has evolved from experimental science into a thriving commercial industry producing thousands of genetic copies across nearly 60 species, despite sustained public opposition to the technology. ViaGen Pets &amp; Equine, the world's leading producer of cloned cats, dogs and horses, charges $50,000 to clone a pet and $85,000 for a horse, with customers joining waiting lists for the service. \n\nThe technology has found applications ranging from preserving exceptional beef cattle genetics to creating armies of polo horses. Top polo player Adolfo Cambiaso owns more than 100 clones of his best mare and once fielded an entire team riding copies of the same horse. West Texas A&amp;M professor Ty Lawrence successfully cloned superior beef cattle from meat samples, with ranchers subsequently purchasing thousands of straws of semen from his cloned bulls. A 2023 Gallup survey found 61% of Americans still consider animal cloning \"morally wrong,\" nearly unchanged since Dolly the sheep'",
        "id": 2839633,
        "language": null,
        "link": "https://slashdot.org/story/25/06/03/1632256/the-quietly-booming-business-of-making-animals-live-forever?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Quietly Booming Business of Making Animals Live Forever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T17:07:55.614909+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T16:16:00+00:00",
        "description": "More office space in the U.S. is being removed than added for the first time in at least 25 years. New data from CBRE Group shows that across the 58 largest US markets, 23.3 million square feet of office space is slated for demolition or conversion by year-end, while developers will complete just 12.7 million square feet of new construction.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=More+Office+Space+Being+Removed+Than+Added+For+First+Time+in+At+Least+25+Years%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F03%2F1616258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F06%2F03%2F1616258%2Fmore-office-space-being-removed-than-added-for-first-time-in-at-least-25-years%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/",
        "id": 2839634,
        "language": null,
        "link": "https://slashdot.org/story/25/06/03/1616258/more-office-space-being-removed-than-added-for-first-time-in-at-least-25-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Office Space Being Removed Than Added For First Time in At Least 25 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T16:05:16.169355+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T15:20:00+00:00",
        "description": "An anonymous reader shares a report: Open source software used by hobbyist drones powered an attack that wiped out a third of Russia's strategic long range bombers on Sunday afternoon, in one of the most daring and technically coordinated attacks in the war. In broad daylight on Sunday, explosions rocked air bases in Belaya, Olenya, and Ivanovo in Russia, which are hundreds of miles from Ukraine. The Security Services of Ukraine's (SBU) Operation Spider Web was a coordinated assault on Russian targets it claimed was more than a year in the making, which was carried out using a nearly 20-year-old piece of open source drone autopilot software called ArduPilot. \n\nArduPilot's original creators were in awe of the attack. \"That's ArduPilot, launched from my basement 18 years ago. Crazy,\" Chris Anderson said in a comment on LinkedIn below footage of the attack. On X, he tagged his the co-creators Jordi Munoz and Jason Short in a post about the attack. \"Not in a million years would I have pre",
        "id": 2838883,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/03/1518251/ukraines-massive-drone-attack-was-powered-by-open-source-software?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ukraine's Massive Drone Attack Was Powered by Open Source Software",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:53.560222+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T14:49:00+00:00",
        "description": "The Ninth Circuit has ruled that the 1967 Ford Mustang fastback nicknamed \"Eleanor\" in Gone in 60 Seconds is a film prop rather than a protectable character. The panel said the car fails all three Towle test prongs, so it cannot receive standalone copyright protection. sinij writes: The ruling states that the Mustang doesn't pass tests that would qualify it as a character. In the past, studio aggressively went after builders for any Mustang that even remotely approximated Eleanor, making it a hassle to restomod classic Mustangs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ford+Mustang+Eleanor+From+Gone+In+60+Seconds+Can't+Be+Copyrighted%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F06%2F03%2F1449224%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fyro.slashdot.org%2Fstory%2",
        "id": 2838261,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/03/1449224/ford-mustang-eleanor-from-gone-in-60-seconds-cant-be-copyrighted?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ford Mustang Eleanor From Gone In 60 Seconds Can't Be Copyrighted",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:53.716127+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T14:09:00+00:00",
        "description": "Live-animal markets across Southeast Asia continue operating as natural laboratories for deadly pathogens despite warnings from public health experts about their role in disease transmission, according to new research published in Nature. \n\nScientists studying markets like Jakarta's Jatinegara found that coronavirus detection rates in trafficked animals increase dramatically along supply chains, with rats sold at Vietnamese markets testing positive at rates ten times higher than those caught in fields. Pangolins confiscated in Vietnam showed a seven-fold increase in coronavirus infections compared to animals seized earlier in the smuggling process. \n\nThe research comes as political headwinds have severely reduced funding for pandemic preparedness, with the Trump administration terminating a $125-million disease monitoring program and cutting all USAID functions. Scientists report growing reluctance from government officials to authorize publication of pathogen discoveries, fearing sti",
        "id": 2838262,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/03/1410205/wild-animal-markets-pose-rising-pandemic-threat?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wild-Animal Markets Pose Rising Pandemic Threat",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:53.872852+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from The Register: Broadcom's VMware business unit has dropped the lowest tier of its channel program, a move one analyst told The Register will benefit its rivals. The virtualization pioneer currently operates a four-tier channel program spanning Pinnacle, Premier, Select, and Registered partners. On Sunday the business unit announced the retirement of the Registered tier. A blog post written by Brian Moats, Broadcom's Senior Vice President for Global Commercial Sales and Partners, states VMware made the decision because \"the vast majority of customer impact and business momentum comes from partners operating within the top three tiers.\"\n \nLaura Falko, Broadcom's Head of Global Partner Programs, Marketing &amp; Experience, told The Register \"The vast majority of these [Registered] partners are inactive and lack the capabilities to support customers through VMware's evolving private cloud journey. That's why the Registered tier is being retired to e",
        "id": 2838263,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/03/0354202/vmware-drops-the-lowest-tier-of-its-partner-program-except-in-europe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "VMware Drops the Lowest Tier of Its Partner Program, Except In Europe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:54.028254+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T10:00:00+00:00",
        "description": "President Trump's 2026 budget proposes over $1 billion for Mars exploration through a new Commercial Mars Payload Services Program, while simultaneously slashing NASA's overall budget by 25%. Phys.Org reports: Under the proposal, NASA would award contracts to companies developing spacesuits, communications systems and a human-rated landing vehicle to foster exploration of the Red Planet. Trump's proposed $18.8 billion NASA budget would cut the agency's funding by about 25% from the year before, with big hits to its science portfolio. The fleshed-out request on Friday builds upon a condensed budget proposal released earlier this month.\n \n\"We must continue to be responsible stewards of taxpayer dollars,\" NASA Acting Administrator Janet Petro wrote in a letter included in the request. \"That means making strategic decisions -- including scaling back or discontinuing ineffective efforts.\" The new Mars scheme is modeled after NASA's Commercial Lunar Payload Services program that has benefit",
        "id": 2838264,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/03/0335217/trump-wants-1-billion-for-private-sector-led-mars-exploration?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Wants $1 Billion For Private-Sector-Led Mars Exploration",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:54.181880+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T07:00:00+00:00",
        "description": "New simulations suggest that the long-assumed collision between the Milky Way and Andromeda galaxies is not guaranteed, with the odds now estimated at just over 50% within the next 10 billion years. Factoring in other massive galaxies like M33 and the Large Magellanic Cloud revealed that their gravitational influence significantly alters the likelihood of a merger. ScienceAlert reports: The Milky Way and Andromeda are not, however, alone in this little corner of the cosmos. They belong to a small group of galaxies within a radius of about 5 million light-years from the Milky Way known as the Local Group. The Milky Way and Andromeda are the largest members, but there are quite a few other objects hanging out that need to be taken into consideration when modeling the future. [Astrophysicist Till Sawala of the University of Helsinki] and his colleagues took the latest data from the Hubble and Gaia space telescopes, and the most recent mass estimates for the four most massive objects in t",
        "id": 2838265,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/03/0341222/the-milky-way-might-not-crash-into-the-andromeda-galaxy-after-all?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Milky Way Might Not Crash Into the Andromeda Galaxy After All",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:54.335846+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: People born more recently are less likely to have dementia at any given age than earlier generations, research suggests, with the trend more pronounced in women. According to the World Health Organization, in 2021 there were 57 million people worldwide living with dementia, with women disproportionately affected. However, while the risk of dementia increases with age, experts have long stressed it is not not an inevitability of getting older. \"Younger generations are less likely to develop dementia at the same age as their parents or grandparents, and that's a hopeful sign,\" said Dr Sabrina Lenzen, a co-author of the study from the University of Queensland's Centre for the Business and Economics of Health. But she added: \"The overall burden of dementia will still grow as populations age, and significant inequalities remain -- especially by gender, education and geography.\"\n \nWriting in the journal Jama Network Open, researchers in",
        "id": 2838266,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/03/0142217/younger-generations-less-likely-to-have-dementia-study-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Younger Generations Less Likely To Have Dementia, Study Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:54.491810+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T01:40:00+00:00",
        "description": "Coinbase reportedly knew as early as January about a customer data breach linked to its outsourcing partner TaskUs, where an employee in India was caught leaking customer information in exchange for bribes. \"At least one part of the breach [...] occurred when an India-based employee of the U.S. outsourcing firm TaskUs was caught taking photographs of her work computer with her personal phone,\" reports Reuters, citing five former TaskUs employees. Though Coinbase disclosed the incident in May after receiving an extortion demand, the newly revealed timeline raises questions about how long the company was aware of the breach, which could cost up to $400 million. Reuters reports: Coinbase said in the May SEC filing that it knew contractors accessed employee data \"without business need\" in \"previous months.\" Only when it received an extortion demand on May 11 did it realize that the access was part of a wider campaign, the company said. In a statement to Reuters on Wednesday, Coinbase said",
        "id": 2838267,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/03/0135257/coinbase-breach-linked-to-customer-data-leak-in-india?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Coinbase Breach Linked To Customer Data Leak In India",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:54.646201+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T01:02:00+00:00",
        "description": "An anonymous reader shares a report: Microsoft's changes in response to the Digital Markets Act already included allowing Windows machines in the regions it covers to uninstall Edge and remove Bing results from Windows search, but now the list is growing in some meaningful ways. New features announced Monday for Microsoft Windows users in the European Economic Area (the EU plus Iceland, Liechtenstein, and Norway) include the option to uninstall the Microsoft Store and avoid extra nags or prompts asking them to set Microsoft Edge as the default browser unless they choose to open it. \n\nAdditionally, setting a different browser, like Chrome, Firefox, Brave, or something else, will pin it to the taskbar unless the user chooses not to. While setting a different browser default already attaches it to a few link and file types like https and .html, now users in the EEA will see it apply to more types like \"read,\" ftp, and .svg. The default browser changes are live for some users in the beta ",
        "id": 2838268,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/03/011231/microsoft-to-finally-stop-bugging-windows-users-about-edge---but-only-in-europe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft To Finally Stop Bugging Windows Users About Edge - But Only in Europe",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-03T14:58:54.801290+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-03T00:02:00+00:00",
        "description": "Texas is poised to become the first state with a Republican-controlled government to pass a right to repair law, as its Senate unanimously approved HB 2963. The bill requires manufacturers to provide parts, manuals, and tools for equipment sold or used in the state. The Verge reports: A press release from the United States Public Interest Research Group (PIRG), which has pushed for repairability laws nationwide, noted that this would make Texas the ninth state with a right to repair rule, and the seventh with a version that includes consumer electronics. It follows New York, Colorado, Minnesota, California, Oregon, Maine, and most recently, Washington [...]. \"More repair means less waste. Texas produces some 621,000 tons of electronic waste per year, which creates an expensive and toxic mess. Now, thanks to this bipartisan win, Texans can fix that,\" said Environment Texas executive director Luke Metzger.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" h",
        "id": 2838269,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/02/225250/texas-right-to-repair-bill-passes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Texas Right To Repair Bill Passes",
        "vote": 0
    }
]