[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T23:27:06.687024+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T22:50:00+00:00",
        "description": "Coca-Cola has doubled down on AI-generated holiday ads despite widespread criticism of last year's uncanny results. This year the beverage company is replacing human actors with oddly animated animals in a visually inconsistent campaign. The Verge reports: There's no consistent style, switching between attempted realism and a bug-eyed toony look, and the polar bears, panda, and sloth move unnaturally, like flat images that have been sloppily animated rather than rigged 3D models in CG. Compared to the convincing deepfake videos being generated by tools like OpenAI's Sora 2 or Google's Veo 3, the videos produced for this Coke ad feel extremely dated.\n \nThe only notable improvement to my eyes is that the wheels on the iconic Coke trucks are actually consistently turning this year, rather than gliding statically over snow-covered roads. The Wall Street Journal reports that Coca-Cola teamed up with Silverside and Secret Level on its latest holiday campaign, two of the AI studios that prev",
        "id": 3976126,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/03/2129227/coca-colas-new-ai-holiday-ad-is-a-sloppy-eyesore",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Coca-Cola's New AI Holiday Ad Is a Sloppy Eyesore",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T22:23:50.714318+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: You may be disappointed if you go looking for Google's open Gemma AI model in AI Studio today. Google announced late on Friday that it was pulling Gemma from the platform, but it was vague about the reasoning. The abrupt change appears to be tied to a letter from Sen. Marsha Blackburn (R-Tenn.), who claims the Gemma model generated false accusations of sexual misconduct against her.\n \nBlackburn published her letter to Google CEO Sundar Pichai on Friday, just hours before the company announced the change to Gemma availability. She demanded Google explain how the model could fail in this way, tying the situation to ongoing hearings that accuse Google and others of creating bots that defame conservatives. At the hearing, Google's Markham Erickson explained that AI hallucinations are a widespread and known issue in generative AI, and Google does the best it can to mitigate the impact of such mistakes. Although no AI firm has managed t",
        "id": 3975686,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/03/2124238/google-removes-gemma-models-from-ai-studio-after-gop-senators-complaint",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Removes Gemma Models From AI Studio After GOP Senator's Complaint",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T22:23:51.028381+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T21:30:00+00:00",
        "description": "A long-simmering battle over who controls credit scoring in America has erupted into open warfare. Fair Isaac, whose FICO score is used in about 90% of consumer-lending decisions in the U.S., announced it will double the price of its mortgage credit score to $10 next year. The company also said it will bypass the three credit-reporting firms that have supplied the data feeding into its algorithm for decades. \n\nEquifax, Experian and TransUnion created VantageScore in 2006 as an alternative to FICO and collectively own the scoring system. The move came months after Bill Pulte, head of the Federal Housing Finance Agency, announced that Fannie Mae and Freddie Mac would allow lenders to use VantageScore for mortgage approvals. The three credit-reporting firms responded by offering VantageScore free for many loans. Fair Isaac had charged a few cents per score for decades before chief executive Will Lansing began raising prices several years ago. Revenue from selling credit scores reached $9",
        "id": 3975687,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/03/2018216/a-fight-over-credit-scores-turns-into-all-out-war",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Fight Over Credit Scores Turns Into All-Out War",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T21:23:06.900415+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T20:45:00+00:00",
        "description": "Apple is paying Google to create a custom Gemini-based model that will run on the company's private cloud servers and power the next version of Siri, according to Bloomberg. The decision marks a departure from Apple's tradition of building core technologies in-house. The arrangement follows a competition Apple held this year between Anthropic and Google, the report said. Anthropic offered a superior model, but Google made more financial sense because of the tech giants' existing search relationship. Neither company is expected to discuss the partnership publicly, the report added. \n\nThe new Siri will introduce AI-powered web search and other features users have come to expect from voice assistants. The custom model will not flood Siri with Google services or Gemini features already available on Android devices. Instead, it will provide the underlying AI capabilities through an Apple user interface. The company is betting heavily on the revamped Siri to undo years of brand damage.<p><d",
        "id": 3975300,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/03/2014204/apple-to-white-label-googles-gemini-model-for-next-generation-siri-report-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple To White-Label Google's Gemini Model for Next-Generation Siri, Report Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T20:22:15.194012+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T20:06:00+00:00",
        "description": "The Internet Archive celebrated archiving its trillionth webpage last month and received congratulations from San Francisco, which declared October 22 \"Internet Archive Day.\" Senator Alex Padilla designated the nonprofit a federal depository library. The organization currently faces no major lawsuits and no active threats to its collections. But these victories arrived after years of bruising copyright battles that forced the removal of more than 500,000 books from the Archive's Open Library. \"We survived, but it wiped out the Library,\" founder Brewster Kahle told ArsTechnica. \n\nIn 2024, the Archive lost its final appeal in a lawsuit brought by book publishers over its e-book lending model. Damages could have topped $400 million before publishers announced a confidential settlement. Last month, the organization settled another suit over its Great 78 Project after music publishers sought damages of up to $700 million. That settlement was also confidential. In both cases, the Archive's ",
        "id": 3974801,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/03/1930232/internet-archives-legal-fights-are-over-but-its-founder-mourns-what-was-lost",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Internet Archive's Legal Fights Are Over, But Its Founder Mourns What Was Lost",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T20:22:15.389690+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T19:25:00+00:00",
        "description": "Captchas have largely vanished from the web in 2025, replaced by invisible tracking systems that analyze user behavior rather than asking people to decipher distorted text or identify traffic lights in image grids. Google launched reCaptcha v3 in 2018 to generate risk scores based on behavioral signals during site interactions, making bot-blocking technology \"completely invisible\" for most users, according to Tim Knudsen, a director of product management at Google Cloud. \n\nCloudflare followed in 2022 by releasing Turnstile, another invisible alternative that sometimes appears as a simple checkbox but actually gathers data from devices and software to determine if users are human. Both companies distribute their security tools for free to collect training data, and Cloudflare now sees 20% of all HTTP requests across the internet. \n\nThe rare challenges that do surface have become increasingly bizarre, ranging from requests to identify dogs and ducks wearing various hats to sliding a joc",
        "id": 3974802,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/03/1916215/the-curious-case-of-the-bizarre-disappearing-captcha",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Curious Case of the Bizarre, Disappearing Captcha",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T19:21:45.844140+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T18:57:00+00:00",
        "description": "An anonymous reader shares a report: The Content Overseas Distribution Association (CODA), an anti-piracy organization representing Japanese IP holders like Studio Ghibli and Bandai Namco, released a letter last week asking OpenAI to stop using its members' content to train Sora 2, as reported by Automaton. The letter states that \"CODA considers that the act of replication during the machine learning process may constitute copyright infringement,\" since the resulting AI model went on to spit out content with copyrighted characters. \n\nSora 2 generated an avalanche of content containing Japanese IP after it launched on September 30th, prompting Japan's government to formally ask OpenAI to stop replicating Japanese artwork. This isn't the first time one of OpenAI's apps clearly pulled from Japanese media, either -- the highlight of GPT-4o's launch back in March was a proliferation of \"Ghibli-style\" images. \n\nAltman announced last month that OpenAI will be changing Sora's opt-out policy f",
        "id": 3974302,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/03/1857255/studio-ghibli-bandai-namco-square-enix-demand-openai-stop-using-their-content-to-train-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Studio Ghibli, Bandai Namco, Square Enix Demand OpenAI Stop Using Their Content To Train AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T19:21:46.037310+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T18:16:00+00:00",
        "description": "A developer operating under the handle @XenoPanther has stripped Windows 7 down to 69MB. The OS boots but runs almost nothing because critical files like common dialog boxes and common controls are missing. @XenoPanther described the project on X as \"more of a fun proof of concept rather than something usable.\" The desktop appears and the genuine check remains intact.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+7+Squeezed+To+69MB+in+Proof-of-Concept+Build%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F03%2F1816216%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F03%2F1816216%2Fwindows-7-squeezed-to-69mb-in-proof-of-concept-build%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_l",
        "id": 3974303,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/03/1816216/windows-7-squeezed-to-69mb-in-proof-of-concept-build",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows 7 Squeezed To 69MB in Proof-of-Concept Build",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T18:21:07.528767+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T17:21:00+00:00",
        "description": "An anonymous reader shares a report: arXiv, a preprint publication for academic research that has become particularly important for AI research, has announced it will no longer accept computer science articles and papers that haven't been vetted by an academic journal or a conference. Why? A tide of AI slop has flooded the computer science category with low-effort papers that are \"little more than annotated bibliographies, with no substantial discussion of open research issues,\" according to a press release about the change. \n\narXiv has become a critical place for preprint and open access scientific research to be published. Many major scientific discoveries are published on arXiv before they finish the peer review process and are published in other, peer-reviewed journals. For that reason, it's become an important place for new breaking discoveries and has become particularly important for research in fast-moving fields such as AI and machine learning (though there are also sometimes",
        "id": 3973854,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/03/1716252/arxiv-changes-rules-after-getting-spammed-with-ai-generated-research-papers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "arXiv Changes Rules After Getting Spammed With AI-Generated 'Research' Papers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T17:18:30.373196+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T16:41:00+00:00",
        "description": "Palantir launched a fellowship that recruited high school graduates directly into full-time work, bypassing college entirely. The company received more than 500 applications and selected 22 for the inaugural class. The four-month program began with seminars on Western civilization, U.S. history, and leaders including Abraham Lincoln and Winston Churchill. Fellows then embedded in client teams working on live projects for hospitals, insurance companies, defense contractors, and government agencies. \n\nCEO Alex Karp, who studied at Haverford and Stanford, said in August that hiring university students now means hiring people engaged in \"platitudes.\" The program wraps up in November. Palantir executives said they had a clear sense by the third or fourth week of which fellows were succeeding in the company environment. Fellows who perform well will receive offers for permanent positions without college degrees.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\"",
        "id": 3973221,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/03/1620202/palantir-thinks-college-might-be-a-waste-so-its-hiring-high-school-grads",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Palantir Thinks College Might Be a Waste. So It's Hiring High-School Grads.",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T16:18:01.409302+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T16:02:00+00:00",
        "description": "Microsoft AI chief Mustafa Suleyman says only biological beings are capable of consciousness, and that developers and researchers should stop pursuing projects that suggest otherwise. From a report: \"I don't think that is work that people should be doing,\" Suleyman told CNBC in an interview this week at the AfroTech Conference in Houston, where he was among the keynote speakers. \"If you ask the wrong question, you end up with the wrong answer. I think it's totally the wrong question.\" \n\nSuleyman, Microsoft's top executive working on artificial intelligence, has been one of the leading voices in the rapidly emerging field to speak out against the prospect of seemingly conscious AI, or AI services that can convince humans they're capable of suffering.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+AI+Chief+Says+Only+Biological+Beings+Can+Be+Conscious%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F11%2F03%",
        "id": 3972606,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/03/1534209/microsoft-ai-chief-says-only-biological-beings-can-be-conscious",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft AI Chief Says Only Biological Beings Can Be Conscious",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T16:18:01.541780+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T15:23:00+00:00",
        "description": "An anonymous reader shares a report: Chinese President Xi Jinping joked about security backdoors while presenting a pair of Xiaomi smartphones to his South Korean counterpart, a rare moment of spontaneous levity captured during a week of tense trade negotiations with Donald Trump. \n\nXi, in South Korea to meet Trump on the sidelines of the Asia-Pacific Economic Cooperation summit, presented the pair of devices to Korean President Lee Jae Myung. In a video circulated on social media, Lee asked: \"Is the line secure?\" Xi chuckled, pointed at the gadgets and replied through an interpreter: \"You can check if there's a backdoor.\" The two leaders burst into laughter. \n\nThe exchange was striking because the issue of security and alleged espionage is a sensitive one and a major thorn in US-Chinese relations. American lawmakers have raised the possibility that tech companies such as Huawei build backdoors -- ways to gain access to sensitive data -- into their equipment or services, something the",
        "id": 3972607,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/11/03/1523219/xi-quips-about-backdoors-during-xiaomi-phone-gift-to-koreas-lee",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Xi Quips About Backdoors During Xiaomi Phone Gift To Korea's Lee",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T15:16:12.345268+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T14:47:00+00:00",
        "description": "OpenAI will pay Amazon $38 billion for computing power in a seven-year deal that marks the companies' first partnership. Amazon expects all of the computing capacity negotiated as part of the agreement will be available to OpenAI by the end of next year. The ChatGPT maker will train new AI models using Amazon's data centers and use them to process user queries. \n\nThe deal is small compared with OpenAI's $300 billion agreement with Oracle and its $250 billion commitment to Microsoft. OpenAI ended its exclusive cloud-computing partnership with Microsoft last month and has since signed almost $600 billion in new cloud commitments. Amazon Web Services is the industry's largest cloud provider, but Microsoft and Google have reported faster cloud-revenue growth in recent years after capturing new demand from AI customers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Signs+%2438+Billion+Cloud+Deal+With+Amazon%3A+ht",
        "id": 3972134,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/03/1448202/openai-signs-38-billion-cloud-deal-with-amazon",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Signs $38 Billion Cloud Deal With Amazon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T14:14:15.554538+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T14:00:00+00:00",
        "description": "Microsoft has released a patch that fixes a longstanding bug in Windows 11 and Windows 10 where selecting \"Update and shut down\" would restart the computer instead of powering it off. The issue affected users across both operating systems since Windows 10's initial release. The fix arrived in Windows 11 25H2 Build 26200.7019 and the October 2025 optional update KB5067036. \n\nMicrosoft confirmed the patch \"addressed underlying issue which can cause 'Update and shutdown' to not actually shut down your PC after updating.\" The problem likely stemmed from the Windows Servicing Stack failing to carry the power-off command through the required reboot phase. During updates Windows must restart into an offline servicing mode to replace system files. The power-off instruction was either cleared or blocked during this transition.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Fixes+Decade-Old+Windows+Bug+That+Made+'Up",
        "id": 3971560,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/03/1249212/microsoft-fixes-decade-old-windows-bug-that-made-update-and-shut-down-restart-pcs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Fixes Decade-Old Windows Bug That Made 'Update and Shut Down' Restart PCs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T13:10:57.700536+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T12:43:00+00:00",
        "description": "\"During the past two years or so I have been slow-rolling an effort to port the Linux kernel to WebAssembly,\" reads a surprising post on the Linux kernel mailing list.\n\n\nI'm now at the point where the kernel boots and I can run basic programs from a shell. As you will see if you play around with it for a bit, it's not very stable and will crash sooner or later, but I think this is a good first step.\nWasm is not necessarily only targeting the web, but that's how I have\nbeen developing this project... This is Linux, booting in your browser tab, accelerated by Wasm. \n Phoronix warns that \"there are stability issues and it didn't take me long either to trigger crashes for this Linux kernel WASM port when running within Google Chrome.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Linux+Ported+to+WebAssembly%2C+Boots+in+a+Browser+Tab%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F25%2F11%2F03%2F0610234%2F%3Futm_source%3D",
        "id": 3971025,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/11/03/0610234/linux-ported-to-webassembly-boots-in-a-browser-tab",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linux Ported to WebAssembly, Boots in a Browser Tab",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T09:06:54.237559+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T08:53:00+00:00",
        "description": "\"Rockstar Games fired dozens of employees,\" reports Bloomberg, \"in a move that a British trade union said was designed to prevent the workers from unionizing. The company said they were fired for misconduct.\"\n\n\nTheGrand Theft Automaker terminatedbetween 30 and 40 staffersacross multipleoffices in the UK and Canada on Thursday, according to aspokesperson for the Independent Workers' Union of Great Britain (IWGB). All of the employees were part of a private trade union chat groupon Discord and were either members of the union or attempting to organize at the company, the union spokesperson said. \n\n\"Rockstar has just carried out one of the most blatant and ruthless acts of union busting in the history of the games industry,\" Alex Marshall, president of theIWGB, said in a statement. \"This flagrant contempt for the law and for the lives of the workers who bring in their billions is an insult to their fans and the global industry.\" \n\nOn BlueSky the IWGB union posted \"We won't back down, and",
        "id": 3969511,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/03/0542221/grand-theft-auto-studio-accused-of-union-busting-after-firing-dozens",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Grand Theft Auto' Studio Accused of Union Busting After Firing Dozens",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T06:05:01.744403+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T05:53:00+00:00",
        "description": "\"It finally happened,\" writes the GamingOnLinux site:\n\nLinux gamers on Steam as of the Steam Hardware &amp; Software Survey for October 2025 have crossed over the elusive 3% mark. The trend has been clear for sometime, and with Windows 10 ending support, it was quite likely this was going to be the time for it to happen as more people try out Linux... \n\nOverall, 3% might not seem like much to some, but again &mdash; that trend is very clear and equates to millions of people. The last time Valve officially gave a proper monthly active user count was in 2022, and we know Steam has grown a lot since then, but even going by that original number would put monthly active Linux users at well over 4 million. \n\n\nAdditional details from Phoronix:\n\n\nThe only time Steam on Linux use was close to the 3% mark was when Steam on Linux initially debuted a decade ago and at that time the overall Steam user-base was much smaller than it is today. Long story short, thanks to the ongoing success of Valve'",
        "id": 3968757,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/11/03/048228/linux-gamers-on-steam-finally-cross-over-the-3-mark",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Linux Gamers on Steam Finally Cross Over the 3% Mark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T04:03:46.176647+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T03:53:00+00:00",
        "description": "TechCrunch reports:\n\nOpenAI CEO Sam Altman recently said that the company is doing \"well more\" than $13 billion in annual revenue &mdash; and he sounded a little testy when pressed on how it will pay for its massive spending commitments. \nHis comments came up during a joint interviewon the Bg2 podcast between Altman and Microsoft CEO Satya Nadella about the partnership between their companies. Host Brad Gerstner (who's also founder and CEO of Altimeter Capital) brought upreports that OpenAI is currently bringing in around $13 billion in revenue &mdash; a sizable amount, but one that's dwarfed by more than $1 trillion in spending commitments for computing infrastructure that OpenAI has made for the next decade. \n\"First of all, we're doing well more revenue than that. Second of all, Brad, if you want to sell your shares, I'll find you a buyer,\" Altman said, prompting laughs from Nadella. \"I just &mdash; enough. I think there are a lot of people who would love to buy OpenAI shares.\" \nAlt",
        "id": 3968307,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/11/03/0349255/openais-sam-altman-defends-1-trillion-spending-commitments-predicts-steep-revenue-growth-more-products",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's Sam Altman Defends $1 Trillion+ Spending Commitments, Predicts Steep Revenue Growth, More Products",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T03:03:21.118208+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T02:34:00+00:00",
        "description": "\"An engineer got curious about how his iLife A11 smart vacuum worked and monitored the network traffic coming from the device,\" writes Tom's Hardware. \n\n\"That's when he noticed it was constantly sending logs and telemetry data to the manufacturer &mdash; something he hadn't consented to.\"\n\n\nThe user, Harishankar, decided to block the telemetry servers' IP addresses on his network, while keeping the firmware and OTA servers open. While his smart gadget worked for a while, it just refused to turn on soon after... He sent it to the service center multiple times, wherein the technicians would turn it on and see nothing wrong with the vacuum. When they returned it to him, it would work for a few days and then fail to boot again... [H]e decided to disassemble the thing to determine what killed it and to see if he could get it working again... \n\n[He discovered] a GD32F103 microcontroller to manage its plethora of sensors, including Lidar, gyroscopes, and encoders. He created PCB connectors a",
        "id": 3968107,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/02/2241201/manufacturer-remotely-bricks-smart-vacuum-after-its-owner-blocked-it-from-collecting-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Manufacturer Remotely Bricks Smart Vacuum After Its Owner Blocked It From Collecting Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-03T01:02:13.005607+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-03T00:52:00+00:00",
        "description": "\"Ubuntu's decision to switch to Rust-based coreutils in 25.10 hasn't been the smoothest ride,\" writes the blog OMG Ubuntu, \"as the latest &mdash; albeit now resolved &mdash; bug underscores.\"\n\n\n\n\n[Coreutils] are used by a number of processes, apps and scripts, including Ubuntu's own unattended-upgrades process, which automatically checks for new software updates. Alas, the Rust-based version of date had a bug which meant Ubuntu 25.10 desktops, servers, cloud and container images were not able to automatically check for updates when configured. Unattended-upgrades hooks into the date utility to check the timestamp of a reference file of when an update check was last run and, past a certain date, checks again. But date was incorrectly showing the current date, always. \n\nA fix has been issued so only Ubuntu 25.10 installs withrust-coreutils 0.2.2-0ubuntu2 (or earlier) are affected.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/ho",
        "id": 3967642,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/03/0049215/bug-in-rust-based-uutils-broke-ubuntu-2510-automatic-update-checks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bug in Rust-Based UUtils Broke Ubuntu 25.10 Automatic Update Checks",
        "vote": 0
    }
]