[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T16:07:45.391889+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T15:30:21+00:00",
        "description": "With EA Sports College Football 26, the studio is looking to build on the momentum it created last year for a franchise that many fans had been hoping would make its way back to the spotlight. It has taken a lot of the feedback it received from its fans into account, and has crafted an experience that seems more fleshed-out this time around. \n\nWith exciting changes to its Dynasty Mode, optional cross-play support for online features, a new Road to CFP mode brought over from Madden 26, changes to how recruiting works, and so much more, College Football 26 could very well be the definitive experience that the studio set out to bring to its players.",
        "id": 3097902,
        "language": null,
        "link": "https://www.youtube.com/watch?v=YurdybKZCxE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YurdybKZCxE/hqdefault.jpg",
        "title": "EA SPORTS College Football 26 - 15 Things You Need To Know Before You PRE-ORDER",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T10:44:19.348784+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T09:30:27+00:00",
        "description": "The streak of $50 titles with tons of potential continues, and this time, it's Leenzee's Wuchang: Fallen Feathers. It releases on July 24th for Xbox Series X/S, PS5, and PC alongside Game Pass, and follows the pirate Wuchang, who ends up in the Land of Shu to overcome the Feathering disease.\n\nWith a world design similar to Dark Souls 1, combat that takes cues from Wo Long: Fallen Dynasty, and a skill tree that could put Nioh 2 to shame, Wuchang: Fallen Feathers is somewhat of a dark horse. The fact that it offers 40 to 60 hours for an average playthrough is just the icing on the cake.\n\nHowever, the timing of its release is interesting because around the same time last year, another big action RPG made its presence known - Black Myth: Wukong. Can Wuchang repeat that same success? Time will tell, but for now, how does it stack up to Game Science's magnum opus? Find out here.",
        "id": 3096238,
        "language": null,
        "link": "https://www.youtube.com/watch?v=rpWe7dRTKAk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rpWe7dRTKAk/hqdefault.jpg",
        "title": "Wuchang Fallen Feathers vs. Black Myth Wukong - 15 BIGGEST DIFFERENCES",
        "vote": 0
    }
]