[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T23:22:58.573552+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T22:29:00+00:00",
        "description": "\"California residents who lit illegal fireworks over the July 4 holiday may be in for a nasty surprise in the mail thanks to covert fire department operations,\" reports SFGate. \n\n\"A number of California cities, including Sacramento, have begun using drones to locate people shooting off illegal fireworks.\"\n\nFrom Wednesday to Saturday night, the Sacramento Fire Department's special fireworks task force patrolled the streets with unmarked cars and drones, focusing on neighborhoods where they've had prior complaints. Task force officers and the drones took photos of the illegal activity, and within 30 days the property owner where the fireworks were used could receive a fine in the mail... \n\nThis year, Sacramento upped the fine to $1,000 for the first firework, $2,500 for the second and $5,000 per firework after that. If you lit a firework on city property, such as a park or a school, the fine goes up to $10,000 each. There's no limit to how many fines you can be issued... This year, a nu",
        "id": 3099945,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/07/06/2228207/drones-used-by-california-cities-to-patrol-for-illegal-fireworks-and-issue-fines?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Drones Used by California Cities to Patrol for Illegal Fireworks and Issue Fines",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T21:12:56.180153+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T20:26:00+00:00",
        "description": "China \"is pouring money into building an AI supply chain with as little reliance on the U.S. as possible,\" reports the Wall Street Journal. \n\nAnd now Chinese AI companies \"are loosening the U.S.'s global stranglehold on AI,\" reports the Wall Street Journal, \"challenging American superiority and setting the stage for a global arms race in the technology.\"\n\n\n\n\nIn Europe, the Middle East, Africa and Asia, users ranging from multinational banks to public universities are turning to large language models from Chinese companies such as startup DeepSeek and e-commerce giant Alibaba as alternatives to American offerings such as ChatGPT... Saudi Aramco, the world's largest oil company, recently installed DeepSeek in its main data center. Even major American cloud service providers such as Amazon Web Services, Microsoft and Google offer DeepSeek to customers, despite the White House banning use of the company's app on some government devices over data-security concerns. \n\nOpenAI's ChatGPT remai",
        "id": 3099432,
        "language": null,
        "link": "https://slashdot.org/story/25/07/06/2022253/is-china-quickly-eroding-americas-lead-in-the-global-ai-race?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is China Quickly Eroding America's Lead in the Global AI Race?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T19:02:57.460084+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T18:34:00+00:00",
        "description": "The Free Software Foundation's services face \"ongoing (and increasing) distributed denial of service (DDoS) attacks,\" senior systems administrator Ian Kelling wrote Wednesday. But \"Even though we are under active attack, gnu.org, ftp.gnu.org, and savannah.gnu.org are up with normal response times at the moment, and have been for the majority of this week, largely thanks to hard work from the Savannah hackers Bob, Corwin, and Luke who've helped us, your sysadmins.\" \n\"We've shielded these sites for almost a full year of intense attacks now, and we'll keep on fighting these attacks for as long as they continue.\"\n\nOur infrastructure has been under attack since August 2024. Large Language Model (LLM) web crawlers have been a significant source of the attacks, and as for the rest, we don't expect to ever know what kind of entity is targeting our sites or why. \n\n- In the fall Bulletin, we wrote about the August attack on gnu.org. That attack continues, but we have mitigated it. Judging from ",
        "id": 3098866,
        "language": null,
        "link": "https://news.slashdot.org/story/25/07/06/1737253/the-fsf-faces-active-ongoing-and-increasing-ddos-attacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The FSF Faces Active 'Ongoing and Increasing' DDoS Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T17:57:58.630314+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T17:34:00+00:00",
        "description": "Three space probes are leaving our solar system &mdash; yet are still functioning. After the two Voyager space probes, New Horizons \"was launched in 2006, initially to study Pluto,\" remembers New Scientist. But \"it has since travelled way beyond this point, ploughing on through the Kuiper belt, a vast, wide band of rocks and dust billions of miles from the sun. It is now speeding at tens of thousands of kilometres per hour...\" \n\nAnd it's just performed the first ever example of interstellar navigation...\n\nAs it hurtles out of our solar system, NASA's New Horizons spacecraft is so far from Earth that the stars in the Milky Way appear in markedly different positions compared with our own view... due to the parallax effect. This was demonstrated in 2020 when the probe beamed back pictures of two nearby stars, Proxima Centauri and Wolf 359, to Earth. \nNow, Tod Lauer at the US National Optical-Infrared Astronomy Research Laboratory in Arizona and his colleagues have used this effect to wor",
        "id": 3098525,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/06/155217/interstellar-navigation-demonstrated-for-the-first-time-with-nasas-new-horizons?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Interstellar Navigation Demonstrated for the First Time With NASA's 'New Horizons'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T16:52:35.245098+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T16:34:00+00:00",
        "description": "A Maine police department has now acknowledged \"it inadvertently shared an AI-altered photo of drug evidence on social media,\" reports Boston.com:\n\n\nThe image from the Westbrook Police Department showed a collection of drug paraphernalia purportedly seized during a recent drug bust on Brackett Street, including a scale and white powder in plastic bags. According to Westbrook police, an officer involved in the arrests snapped the evidence photo and used a photo editing app to insert the department's patch. \"The patch was added, and the photograph with the patch was sent to one of our Facebook administrators, who posted it,\" the department explained in a post. \"Unbeknownst to anyone, when the app added the patch, it altered the packaging and some of the other attributes on the photograph. None of us caught it or realized it.\" \n\nIt wasn't long before the edited image's gibberish text and hazy edges drew criticism from social media users. According to the Portland Press Herald, Westbrook ",
        "id": 3098176,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/07/06/0252201/police-department-apologizes-for-sharing-ai-doctored-evidence-photo-on-social-media?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Police Department Apologizes for Sharing AI-Doctored Evidence Photo on Social Media",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T15:47:37.166686+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T15:34:00+00:00",
        "description": "\"Scientists have created the first lasers made entirely from edible materials,\" reports Science magazine \"which could someday help monitor and track the properties of foods and medications with sensors that can be harmlessly swallowed.\"\n\n\n[The researchers' report] shows that tiny droplets of everyday cooking oils can act like echo chambers of light, otherwise known as lasers. By providing the right amount of energy to an atom, the atom's electrons will excite to a higher energy level and then relax, releasing a photon of light in the process. Trap a cloud of atoms in a house of mirrors and blast them with the right amount of energy, and the light emitted by one excited atom will stimulate one of its neighbors, amplifying the atoms' collective glow... \n[The researchers] shot purple light at droplets of olive oil, whose surfaces can keep photons of light bouncing around, trapping them in the process. This reflected light excited the electrons in the oil's chlorophyll molecules, causing ",
        "id": 3097821,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/05/2010206/these-tiny-lasers-are-completely-edible?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "These Tiny Lasers Are Completely Edible",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T14:42:41.152190+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T14:34:00+00:00",
        "description": "\"Apple quietly dropped a new AI model on Hugging Face with an interesting twist,\" writes 9to5Mac. \"Instead of writing code like traditional LLMs generate text (left to right, top to bottom), it can also write out of order, and improve multiple chunks at once.\" \n\n\"The result is faster code generation, at a performance that rivals top open-source coding models.\"\n\nTraditionally, most LLMs have been autoregressive. This means that when you ask them something, they process your entire question, predict the first token of the answer, reprocess the entire question with the first token, predict the second token, and so on. This makes them generate text like most of us read: left to right, top to bottom... An alternative to autoregressive models is diffusion models, which have been more often used by image models like Stable Diffusion. In a nutshell, the model starts with a fuzzy, noisy image, and it iteratively removes the noise while keeping the user request in mind, steering it towards some",
        "id": 3097457,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/07/05/1259255/diffusion--coding--diffucode-how-apple-released-a-weirdly-interesting-coding-language-model?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Diffusion + Coding = DiffuCode.  How Apple Released a Weirdly Interesting Coding Language Model",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T12:32:36.827701+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T11:34:00+00:00",
        "description": "An anonymous reader shared this report from the San Francisco Standard:\n\nAbout an hour into my meeting with the undisputed hackathon king of San Francisco, Rene Turcios asked if I wanted to smoke a joint with him. I politely declined, but his offer hardly surprised me. Turcios has built a reputation as a cannabis-loving former professional Yu-Gi-Oh! player who resells Labubus out of his Tenderloin apartment when he's not busy attending nearly every hackathon happening in the city. Since 2023, Turcios, 29, has attended more than 200 events, where he's won cash, software credits, and clout. \"I'm always hustling,\" he said. \n\nThe craziest part: he doesn't even know how to code. \n\"Rene is the original vibe coder,\" said RJ Moscardon, a friend and fellow hacker who watched Turcios win second place at his first-ever hackathon at the AGI House mansion in Hillsborough. \"All the engineers with prestigious degrees scoffed at him at first. But now they're all doing exactly the same thing....\" Turc",
        "id": 3096781,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/07/06/0357235/vibe-coder-who-doesnt-know-how-to-code-keeps-winning-hackathons-in-san-francisco?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Vibe Coder' Who Doesn't Know How to Code Keeps Winning Hackathons in San Francisco",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T08:12:40.265355+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T07:34:00+00:00",
        "description": "\"Tesla has launched its new Oasis Supercharger,\" reports Electrek, \"the long-promised EV charging station of the future, with a solar farm and off-grid batteries.\"\n\n\nEarly in the deployment of the Supercharger network, Tesla promised to add solar arrays and batteries to the Supercharger stations, and CEO Elon Musk even said that most stations would be able to operate off-grid... Last year, Tesla announced a new project called 'Oasis', which consists of a new model Supercharger station with a solar farm and battery storage enabling off-grid operations in Lost Hills, California. \n\n\nTesla has now unveiled the project and turned on most of the Supercharger stalls. The project consists of 168 chargers, with half of them currently operational, making it one of the largest Supercharger stations in the world. However, that's not even the most notable aspect of it. The station is equipped with 11 MW of ground-mounted solar panels and canopies, spanning 30 acres of land, and 10 Tesla Megapacks ",
        "id": 3095720,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/07/06/0440235/tesla-launches-solar-powered-oasis-supercharger-station-30-acre-solar-farm-39-mwh-of-off-grid-batteries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tesla Launches Solar-Powered 'Oasis' Supercharger Station: 30-Acre Solar Farm, 39 MWh of Off-Grid Batteries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T03:52:44.404054+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T03:34:00+00:00",
        "description": "\"A computer science degree used to be a golden ticket to the promised land of jobs,\" a college senior tells the New York Times. But \"That's no longer the case.\" \n\nThe article notes that in the last three years there's been a 65% drop from companies seeking workers with two years of experience or less (according to an analysis by technology research/education organization CompTIA), with tech companies \"relying more on AI for some aspects of coding, eliminating some entry-level work.\" \n\nSo what do college professors teach when AI \"is coming fastest and most forcefully to computer science\"?\nComputer science programs at universities across the country are now scrambling to understand the implications of the technological transformation, grappling with what to keep teaching in the AI era. Ideas range from less emphasis on mastering programming languages to focusing on hybrid courses designed to inject computing into every profession, as educators ponder what the tech jobs of the future wil",
        "id": 3094960,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/07/06/0237251/how-do-you-teach-computer-science-in-the-age-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How Do You Teach Computer Science in the Age of AI?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-06T01:42:15.571342+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-06T01:34:00+00:00",
        "description": "OpenBSD Journal writes:\n\nYes, you read that right: KDE 6.4.0 Plasma is now in OpenBSD packages... The news was announced 2025-07-04 via a fediverse post and of course the commit message itself, where the description reads.... \n\n\"[I]n 6.4 the KDE Kwin team split kwin into kwin-x11 and kwin (wayland). This seems to be the sign that X11 is no longer of interest and we are focussing on Wayland. As we currently only support X11, kwin-x11 has been added as a runtime dependency to kwin. So nobody should have to install anything later. This ports update also includes Aurorae; a theme engine for KWin window decorations.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=KDE+Plasma+6.4+Has+Landed+in+OpenBSD%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F07%2F05%2F1951224%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.",
        "id": 3094664,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/07/05/1951224/kde-plasma-64-has-landed-in-openbsd?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "KDE Plasma 6.4 Has Landed in OpenBSD",
        "vote": 0
    }
]