[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-09T16:29:15.772661+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-09T15:30:40+00:00",
        "description": "The Decima Engine from Guerilla Games has been a factor in the success of incredible hits like Horizon Zero Dawn, Horizon Forbidden West, Death Stranding, and Death Stranding 2: On the Beach. Rising from humble origins as a proprietary powerhouse for Killzone Shadow Fall, it has been the driving force behind worlds that feel alive in the hands of their players while the characters it has brought to life blur the lines between a game and reality. \n\nWith Aloy and Sam Porter already benefitting from its many strengths, we dive into why Decima has been a criminally underrated presence in modern gaming, and the potential for that status quo to change in the near future as more games begin to utilize the long list of pros that it brings to the table.",
        "id": 3123954,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=z_zpkaMhWWE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z_zpkaMhWWE/hqdefault.jpg",
        "title": "Why Decima Is One of the Best Graphics Engines Ever Built",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-09T14:19:21.790220+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-09T13:30:14+00:00",
        "description": "Grounded 2 is the upcoming sequel to the 2022 bite-sized action-adventure survivor and, much like its predecessor, will be releasing to early access before its full launch. \n\nGrounded 2 aims to replicate Grounded’s success by placing community led feedback at the forefront of the game's development. There’s a clearly defined roadmap ahead, but for now as a baseline Grounded 2 has numerous differences; tweaks and improvements to the Grounded formula that’ll help the sequel feel fresh. \n\nA richer story, more mechanical depth, additions to combat, more distinct playstyles, and substantially larger surface area to explore, plus one much-requested feature in mount riding, sit alongside new ways to scavenge, collect, craft, and build. \n\nGrounded 2 is set up to propel the series beyond its predecessor’s dedicated fanbase to find a broader audience.",
        "id": 3122575,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Ij3KCxuUsFU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Ij3KCxuUsFU/hqdefault.jpg",
        "title": "Grounded 2 vs Grounded 1 - 10 BIGGEST DIFFERENCES You Need to Know",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-09T09:57:11.875955+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-09T09:30:00+00:00",
        "description": "The first half of 2025 has brought a lot of titles that have pushed the envelope for what a video game can do with its graphics. From original games that showcase stunning worlds and environments to remakes that leave the pixels of their former iterations behind, this is a year in which current-gen platforms have truly begun to flex their muscles. \n\nWhile a few of these games do come with last-gen counterparts that have limited them on the graphical front, they are still an impressive display of what a talented team can achieve with the tools they have at their disposal. Some others are a showcase of a very bright future for the gaming world in terms of the visual fidelity that they can bring to the table, and make us quite excited to see what the rest of the year has in store for us.",
        "id": 3120543,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=1SMQQJ6yqxs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1SMQQJ6yqxs/hqdefault.jpg",
        "title": "15 Best Graphics of 2025 So Far That LOOKED INSANE",
        "vote": 0
    }
]