[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T21:44:07+00:00",
        "description": "The U.S. Army told the government it had a lot of success using AI to \"process targets\" during a recent deployment. It said that it had used AI systems to identify targets at a rate of 55 per day but could get that number up to 5,000 a day with \"advanced artificial intelligence tools in the future.\" 404 Media: The line comes from a new report from the Government Accountability Office -- a nonpartisan watchdog group that investigates the federal government. The report is titled \"Defense Command and Control\" and is, in part, about the Pentagon's recent push to integrate AI systems into its workflow. \n\nAcross the government, and especially in the military, there has been a push to add or incorporate AI into various systems. The pitch here is that AI systems would help the Pentagon ID targets on the battlefield and allow those systems to help determine who lives and who dies. The Ukrainian and Israeli military are already using similar systems but the practice is fraught and controversia",
        "id": 2521763,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/09/2034234/us-army-says-it-could-acquire-targets-faster-with-advanced-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Army Says It Could Acquire Targets Faster With 'Advanced AI'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T20:41:08+00:00",
        "description": "Anthropic has unveiled a new premium tier for its AI chatbot Claude, targeting power users willing to pay up to $200 monthly for broader usage. The \"Max\" subscription comes in two variants: a $100/month tier with 5x higher rate limits than Claude Pro, and a $200/month option boasting 20x higher limits -- directly competing with OpenAI's ChatGPT Pro tier. \n\nUnlike OpenAI, Anthropic still lacks an unlimited usage plan. Product lead Scott White didn't rule out even pricier subscriptions in the future, telling TechCrunch, \"We'll always keep a number of exploratory options available to us.\" The launch coincides with growing demand for Anthropic's Claude 3.7 Sonnet, the company's first reasoning model, which employs additional computing power to handle complex queries more reliably.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+Launches+Its+Own+%24200+Monthly+Plan%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F0",
        "id": 2521223,
        "language": null,
        "link": "https://slashdot.org/story/25/04/09/203231/anthropic-launches-its-own-200-monthly-plan?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anthropic Launches Its Own $200 Monthly Plan",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T20:41:08+00:00",
        "description": "WordPress.com has released an AI-powered site builder in early access that constructs complete websites with generated text, layouts, and images. The tool operates through a chatbot interface where users input specifications, resulting in a fully formed site that can be further refined through additional prompts. \n\nWhile WordPress.com claims the builder creates \"beautiful, functional websites in minutes,\" it currently cannot handle ecommerce sites or complex integrations. Users need a WordPress.com account for the free trial, but publishing requires a hosting plan starting at $18 monthly (less with annual subscriptions). The builder only works with new WordPress instances, not existing sites. \n\nThis launch comes as parent company Automattic recently cut 16% of its workforce and faces a lawsuit from hosting company WP Engine, which offers competing site-building tools.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=",
        "id": 2521224,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/09/1834225/wordpress-launches-ai-site-builder-amid-company-restructuring?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WordPress Launches AI Site Builder Amid Company Restructuring",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T19:06:23+00:00",
        "description": "The battle for AI talent is so hot that Google would rather give some employees a paid one-year vacation than let them work for a competitor. From a report: Some Google DeepMind staff in the UK are subject to noncompete agreements that prevent them from working for a competitor for up to 12 months after they finish work at Google, according to four former employees with direct knowledge of the matter who asked to remain anonymous because they were not permitted to share these details with the press. \n\nAggressive noncompetes are one tool tech companies wield to retain a competitive edge in the AI wars, which show no sign of slowing down as companies launch new bleeding-edge models and products at a rapid clip. When an employee signs one, they agree not to work for a competing company for a certain period of time. Google DeepMind has put some employees with a noncompete on extended garden leave. These employees are still paid by DeepMind but no longer work for it for the duration of th",
        "id": 2520629,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/09/1717210/google-deepmind-has-a-weapon-in-the-ai-talent-wars-aggressive-noncompete-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google DeepMind Has a Weapon in the AI Talent Wars: Aggressive Noncompete Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T18:02:25+00:00",
        "description": "Google is opening up its Google Maps Platform data so that cities, developers, and other business decision makers can more easily access information about things like infrastructure and traffic. The Verge: Google is integrating new datasets for Google Maps Platform directly into BigQuery, the tech giant's fully managed data analytics service, for the first time. This should make it easier for people to access data from Google Maps platform products, including Imagery Insights, Roads Management Insights, and Places Insights.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Maps+is+Launching+Tools+To+Help+Cities+Analyze+Infrastructure+and+Traffic%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F04%2F09%2F1512236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.",
        "id": 2520058,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/09/1512236/google-maps-is-launching-tools-to-help-cities-analyze-infrastructure-and-traffic?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Maps is Launching Tools To Help Cities Analyze Infrastructure and Traffic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T15:52:32+00:00",
        "description": "Scientists have recreated in a laboratory the sensory pathway that transmits feelings of pain to the human brain, in a breakthrough that could lead to better treatments. Financial Times: A team at Stanford University in California is the first to combine different neurons grown from human stem cells into a functioning brain circuit in a lab dish. Their experiments, published in Nature on Wednesday, illustrate scientists' rapid progress in replicating living tissues and organs through synthetic biology. \n\nWhen the Stanford scientists exposed the brain circuit they had created to sensory stimulants, they observed waves of electrical activity travelling along it. The molecule that makes chilli peppers hot, capsaicin, immediately induced a strong response. \n\n[...] The synthetic brain circuits could be used to screen for better-targeted therapies for pain that tone down excessive waves of neurotransmission, without affecting the brain's reward circuitry as opioids do, project leader [Serg",
        "id": 2518815,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/09/1521244/scientists-recreate-brain-circuit-in-lab-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Recreate Brain Circuit in Lab For First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T15:52:32+00:00",
        "description": "New research suggests that given the right kind of training, AI bots can deliver mental health therapy with as much efficacy as -- or more than -- human clinicians. From a report: The recent study, published in the New England Journal of Medicine, shows results from the first randomized clinical trial for AI therapy. Researchers from Dartmouth College built the bot as a way of taking a new approach to a longstanding problem: The U.S. continues to grapple with an acute shortage of mental health providers. \"I think one of the things that doesn't scale well is humans,\" says Nick Jacobson, a clinical psychologist who was part of this research team. For every 340 people in the U.S., there is just one mental health clinician, according to some estimates. \n\nWhile many AI bots already on the market claim to offer mental health care, some have dubious results or have even led people to self-harm. More than five years ago, Jacobson and his colleagues began training their AI bot in clinical bes",
        "id": 2518816,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/09/155247/the-ai-therapist-can-see-you-now?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The AI Therapist Can See You Now",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T14:47:26+00:00",
        "description": "Samsung Electronics and Google Cloud are jointly entering the consumer robotics market with Ballie, a yellow, soccer-ball-shaped robot equipped with a video projector and powered by Google's Gemini AI models. First previewed in 2020, the long-delayed device will finally launch this summer in the US and South Korea. The mobile companion uses small wheels to navigate homes autonomously and integrates with Samsung's SmartThings platform to control smart home devices. \n\nRunning on Samsung's Tizen operating system, Ballie can manage calendars, answer questions, handle phone calls, and project video content from services including YouTube and Netflix. Samsung EVP Jay Kim described it as a \"completely new Ballie\" compared to the 2020 version, with Google Cloud integration being the most significant change. The robot leverages Gemini for understanding commands, searching the web, and processing visual data for navigation, while using Samsung's AI models for accessing personal information.<p>",
        "id": 2518183,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/09/146254/samsung-and-google-partner-to-launch-ballie-home-robot-with-built-in-projector?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Samsung and Google Partner To Launch Ballie Home Robot with Built-in Projector",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T12:37:01+00:00",
        "description": "China retaliated against the US after new tariffs imposed by President Donald Trump, announcing it would raise the tariff on US goods to 84%, escalating the trade conflict between the world's two largest economies. From a report: The Chinese countermeasures are effective April 10, according to a government statement Wednesday. China's move came after Trump's latest tariffs went into force at midday Wednesday in Beijing, taking the cumulative rate announced this year to 104%. A day earlier, China vowed to \"fight to the end\" if the US insists on new tariffs. Where US-China Decoupling Is Hardest: After decades of trade integration, Chinese companies have become increasingly essential suppliers of goods and materials that range from niche to ones many Americans can barely do without. \n\nAt $41 billion last year, smartphones -- largely consisting of Apple's iPhones -- were the single largest US import from China. More than 70% of all smartphone imports are from China, according to Bloomber",
        "id": 2517039,
        "language": null,
        "link": "https://slashdot.org/story/25/04/09/1131225/china-raises-tariffs-on-us-goods-to-84-as-rift-escalates?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Raises Tariffs on US Goods To 84% as Rift Escalates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T10:27:27+00:00",
        "description": "Established software companies hoping to ride the AI wave are facing a stiff headwind: many of their potential customers are building AI tools themselves. This do-it-yourself approach is channeling billions in spending towards cloud computing providers but leaving traditional software vendors struggling to capitalize, complicating their AI growth plans. \n\nCloud platforms like Microsoft Azure and Amazon Web Services are pulling in an estimated $22 billion from AI services, with Azure alone capturing $11.3 billion. Yet, software application vendors have collectively garnered only about $2 billion from selling AI products. Stripping out Microsoft's popular Copilot tools, that figure drops to a mere $450 million across all other vendors combined. \n\nWhy are companies choosing the harder path of building? Feedback gathered by UBS points to several key factors driving this \"persistent DIY trend.\" Many business uses for AI are highly specific or narrow, making generic software unsuitable. Of",
        "id": 2516115,
        "language": null,
        "link": "https://slashdot.org/story/25/04/09/0912235/enterprises-are-shunning-vendors-in-favor-of-diy-approach-to-ai-ubs-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Enterprises Are Shunning Vendors in Favor of DIY Approach To AI, UBS Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T07:10:37+00:00",
        "description": "The world used clean power sources to meet more than 40% of its electricity demand last year for the first time since the 1940s, figures show. The Guardian: A report by the energy thinktank Ember said the milestone was powered by a boom in solar power capacity, which has doubled in the last three years. The report found that solar farms had been the world's fastest-growing source of energy for the last 20 consecutive years. \n\nPhil MacDonald, Ember's managing director, said: \"Solar power has become the engine of the global energy transition. Paired with battery storage, solar is set to be an unstoppable force. As the fastest-growing and largest source of new electricity, it is critical in meeting the world's ever-increasing demand for electricity.\" \n\nOverall, solar power remains a relatively small part of the global energy system. It made up almost 7% of the world's electricity last year, according to Ember, while wind power made up just over 8% of the global power system. The fast-gr",
        "id": 2515162,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/09/0451237/clean-energy-powered-40-of-global-electricity-in-2024-report-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Clean Energy Powered 40% of Global Electricity in 2024, Report Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T04:57:15+00:00",
        "description": "Fake job seekers using AI tools to impersonate candidates are increasingly targeting U.S. companies with remote positions, creating a growing security threat across industries. By 2028, one in four global job applicants will be fake, according to Gartner. These imposters use AI to fabricate photo IDs, generate employment histories, and provide interview answers, often targeting cybersecurity and cryptocurrency firms, CNBC reports. \n\nOnce hired, fraudulent employees can install malware to demand ransoms, steal customer data, or simply collect salaries they wouldn't otherwise obtain, according to Vijay Balasubramaniyan, CEO of Pindrop Security. The problem extends beyond tech companies. Last year, the Justice Department alleged more than 300 U.S. firms inadvertently hired impostors with ties to North Korea, including major corporations across various sectors.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Fake+Job+Se",
        "id": 2514634,
        "language": null,
        "link": "https://slashdot.org/story/25/04/09/0134223/fake-job-seekers-are-flooding-us-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Fake Job Seekers Are Flooding US Companies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T02:47:22+00:00",
        "description": "Hackers intercepted about 103 bank regulators' emails for more than a year, gaining access to highly sensitive financial information, Bloomberg News reported Tuesday, citing two people familiar with the matter and a draft letter to Congress. From the report: The attackers were able to monitor employee emails at the Office of the Comptroller of the Currency after breaking into an administrator's account, said the people, asking not to be identified because the information isn't public. OCC on Feb. 12 confirmed that there had been unauthorized activity on its systems after a Microsoft security team the day before had notified OCC about unusual network behavior, according to the draft letter. \n\nThe OCC is an independent bureau of the Treasury Department that regulates and supervises all national banks, federal savings associations and the federal branches and agencies of foreign banks -- together holding trillions of dollars in assets. OCC on Tuesday notified Congress about the compromi",
        "id": 2514140,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/09/0034251/hackers-spied-on-100-us-bank-regulators-emails-for-over-a-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hackers Spied on 100 US Bank Regulators' Emails for Over a Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T01:42:00+00:00",
        "description": "New submitter toutankh writes: The UK government is developing a tool to predict murder. The scheme was originally called the \"homicide prediction project\", but its name has been changed to \"sharing data to improve risk assessment\". The Ministry of Justice hopes the project will help boost public safety but campaigners have called it \"chilling and dystopian\".The existence of the project was uncovered by Statewatch rather than announced by the UK government. PR following this discovery looks like uncoordinated damage control: one stated goal is to \"ultimately contribute to protecting the public via better analysis\", but a spokesperson also said that it is \"for research purpose[s] only\". One criticism is that such a system will inevitably reproduce existing bias from the police. What could go wrong?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=+UK+Creating+'Murder+Prediction'+Tool+To+Identify+People+Most+Likely+To+",
        "id": 2513980,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/09/0028213/uk-creating-murder-prediction-tool-to-identify-people-most-likely-to-kill?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Creating 'Murder Prediction' Tool To Identify People Most Likely To Kill",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T00:37:04+00:00",
        "description": "Microsoft has scrapped plans to build three data center campuses in Licking County, Ohio, in a $1 billion investment pullback, the company said. The canceled developments in New Albany, Heath, and Hebron join a growing list of Microsoft data center project cancellations across the United States, Europe, Asia-Pacific and the United Kingdom. \n\nMicrosoft will retain ownership of the land and plans to eventually develop the sites at an unspecified future date. Two properties will remain available for farming in the interim.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Cancels+%241+Billion+Ohio+Data+Center+Projects%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F04%2F09%2F009213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F04%2F09%2F009213%2Fm",
        "id": 2513731,
        "language": null,
        "link": "https://slashdot.org/story/25/04/09/009213/microsoft-cancels-1-billion-ohio-data-center-projects?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Cancels $1 Billion Ohio Data Center Projects",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T00:37:04+00:00",
        "description": "Razer's upcoming Blade 16 and other laptops are no longer available for preorder or purchase on its US site. From a report: The configurator for preordering its new Blade 16 laptop was available as recently as April 1st, according to the Internet Archive -- one day before the Trump administration announced sweeping US tariffs on China, Taiwan, and others that make laptop components. \n\nWhen asked recently if tariffs might affect Razer's prices or availability, its Public Relations Manager, Andy Johnston, told The Verge, \"We do not have a comment at this stage regarding tariffs.\" Razer may not be openly talking about the impact of tariffs, but Framework halted sales of its entry-level Laptop 13 in the US on April 7th, and Micron reportedly confirmed surcharges for its memory chips will apply once the tariffs take effect after midnight tonight.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Razer+Pauses+Direct+Laptop+",
        "id": 2513732,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/08/2343230/razer-pauses-direct-laptop-sales-in-the-us-as-new-tariffs-loom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Razer Pauses Direct Laptop Sales in the US as New Tariffs Loom",
        "vote": 0
    }
]