[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T23:00:45+00:00",
        "description": "When you think of survival sandbox titles, Butterscotch Shenanigans' Crashlands probably isn't the first game that comes to mind. Eschewing any survival elements for a lighter mood and heavier narrative focus, the original earned a cult following even while similar titles like Don't Starve soared higher.\n\nCrashlands 2 aims for the same kind of levity with its story, with Flux Dabes returning to Woanope and embroiled in a world-changing event (and the Bureau of Shipping seemingly up to no good). The presentation and combat have seen more detail and improvements, and the world itself is sizable enough while offering extensive freedom.\n\nOther elements like crafting, base-building and progression are sold, even if they don't necessarily break the mould. The humor is occasionally fun, if overdone at times (to the point of awkwardness), and the difficulty can feel pretty punishing early on. Crashlands 2 still comes recommended for fans of the original, even if it plays things relatively sa",
        "id": 2522454,
        "language": null,
        "link": "https://www.youtube.com/watch?v=qBKoYf_8YpI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/qBKoYf_8YpI/hqdefault.jpg",
        "title": "Crashlands 2 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T15:30:16+00:00",
        "description": "id Software’s DOOM continues to be one of the most influential games of all time, playing a huge role in shaping the modern first person shooter. While the series has had its share of ups and downs, it's safe to say that DOOM is back and better than ever. \n\nRight from its surprisingly deep lore to the ultra violent gameplay, DOOM has always reveled in its over the top nature - and its suite of weapons is something that has been just as iconic as the games themselves. In anticipation of DOOM: The Dark Ages, we will be taking a look at 15 of the best weapons in the DOOM franchise, starting from the bottom and reaching all the way to the top.",
        "id": 2518857,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Wpc98gyQWGw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Wpc98gyQWGw/hqdefault.jpg",
        "title": "Top 15 Legendary Weapons From The Entire DOOM Series - Before You Play DOOM: The Dark Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-09T10:00:04+00:00",
        "description": "As its name suggests, Nintendo Switch 2 isn’t looking to tear up the rulebook as Nintendo consoles have so often been known to do, with the focus this time being on providing an iterative, evolutions upgrade, rather than a full-on reinvention. \n\nEven so, the upcoming next-gen console is changing things up from its predecessor in a number of ways with its hardware upgrades, new user features, pricing policies, and more. \n\nHere, we’re going to highlight a few of those differences. For the purposes of this specific feature, we're going to be pitting the Switch 2 against only the base Switch model.",
        "id": 2516141,
        "language": null,
        "link": "https://www.youtube.com/watch?v=2GHM9LpeFU8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2GHM9LpeFU8/hqdefault.jpg",
        "title": "SWITCH 2 Vs. SWITCH 1 - 15 Biggest Differences You Need To Know Before You Buy Switch 2",
        "vote": 0
    }
]