[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T18:35:43.919945+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T16:01:04+00:00",
        "description": "This year’s NHL title from EA revamps the Be A Pro mode to impressive heights. The dynamic braodcast presentation and addition of milestone cutscenes contributes to this, but minor league play is a crucial step in the right direction.\n\nNHL 26 as a whole just feels more energetic and lively. But the on-ice gameplay isn’t slacking behind either. Authentic NHL EDGE data helps stats and player behaviors match their real-life counterparts while improving AI. Goalies are also expanded with 80 new animations and smarter AI.\n\nAll in all, NHL 26 packs quite a bit of punch compared to the past five or so years. It’s got better presentation, more fleshed out modes, and slightly improved loading times across the board.",
        "id": 3504876,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Y8XKTz99txE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y8XKTz99txE/hqdefault.jpg",
        "title": "NHL 26 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T15:54:18.548291+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T13:30:29+00:00",
        "description": "Dying Light: The Beast is all set to bring a refreshing new experience to the franchise's tried and tested formula. There are terrifying threats to face down, a slew of new weapons to face them with, and an open-world that's been lovingly crafted from the ground up to make this upcoming title one that represents everything that's good about the franchise. \n\nWe take a look at a few details that could make this one a game that has you really excited to try out, and dive into why Techland's efforts to craft the definitive Dying Light experience could very well be worth your time.",
        "id": 3503494,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=UTJvsLzcWEA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UTJvsLzcWEA/hqdefault.jpg",
        "title": "Dying Light: The Beast - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T07:48:28.452713+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T07:30:12+00:00",
        "description": "Remember when all those indie titles announced delays after Hollow Knight: Silksong got a release date? How some people said it was unnecessary because the hype is completely overblown, or for some other similarly suspect reason? Now that Team Cherry's sequel is finally available across all platforms (and Game Pass), those delays were undoubtedly the right call. Because as soon as the clock struck 7 AM PST, the very second, Steam broke.\n\nThe front page still seemed accessible at the very least, but I couldn't access Silksong's Steam page. “Something went wrong, we were unable to service your request” accompanied by these cartoon creatures that I didn't even know existed on Steam, and it continued like this for a few minutes. Then it was back up and wouldn't recognize the game in my cart, but by this point, I had already bought it on GOG. For however long, SteamDB revealed that the game was “sustaining a very high amount of traffic,” which I've never seen before.",
        "id": 3500276,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=OsYfrAhbyFU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OsYfrAhbyFU/hqdefault.jpg",
        "title": "Why Are MILLIONS Addicted To Hollow Knight: Silksong?",
        "vote": 0
    }
]