[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T20:42:41.394378+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T20:01:00+00:00",
        "description": "Microsoft is giving away Microsoft 365 Personal subscriptions to all US college students. From a report: This subscription gives students free access to Microsoft's Office apps and the Copilot AI assistant integration for a year, after which the students are eligible for a 50 percent discount to continue the subscription. \n\nWhile most students have access to education versions of Microsoft 365 or Google Workspace, Microsoft's offer is for student's own personal Microsoft accounts, and is available to claim until October 31st. Microsoft 365 Personal is usually $99.99 a year, or $9.99 a month, and includes 1TB of OneDrive cloud storage.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+365+Personal+is+Now+Free+For+US+College+Students+For+a+Year%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F09%2F05%2F1628256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.pn",
        "id": 3505964,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/05/1628256/microsoft-365-personal-is-now-free-for-us-college-students-for-a-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft 365 Personal is Now Free For US College Students For a Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T20:42:41.572256+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T19:20:00+00:00",
        "description": "Networks of pipes and heat exchangers can transfer excess heat from buildings into nearby bodies of water -- but as the world warms, the cooling potential of some water courses is now diminishing, Wired reports. Paris's district cooling network, which pipes Seine river water to cool 800 buildings including the Louvre Museum, faces diminishing returns as climate change warms water temperatures. The system achieves coefficients of performance between 4 and 15 -- significantly higher than conventional air conditioning -- by transferring building heat through heat exchangers to the river. The Seine briefly exceeded 27C this summer, approaching the 30C regulatory limit for returned water. \n\nThe network currently spans 100 kilometers of pipes and will expand to 245 kilometers by 2042 to serve 3,000 buildings. Similar installations operate in Toronto using lake water from 83-meter depths and at Cornell University drawing 4C water from Lake Cayuga at 76 meters. Rotterdam and other cities are ",
        "id": 3505965,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/05/1543244/rising-river-temperatures-threaten-pariss-water-based-building-cooling-network?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Rising River Temperatures Threaten Paris's Water-Based Building Cooling Network",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T19:19:34.211970+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T18:41:00+00:00",
        "description": "An anonymous reader shares a report: Can AI help \"smooth over\" discussion on abortion, racism, immigration, or Israel-Palestine? Columbia University sure hopes so. The Verge has learned that the university recently began testing Sway, an AI debate program currently in beta. Developed by two researchers at Carnegie Mellon University, Sway matches up students with opposing views to chat one-on-one about hot-button issues and \"facilitates better discussions between them,\" according to the tool's website. Nicholas DiBella, a postdoctoral scholar at CMU who helped develop Sway, told The Verge that about 3,000 students from more than 30 colleges and universities have used the tool. \n\nOne of those may soon be Columbia. News of the potential partnership comes after more than two years of escalating tensions at Columbia between students, administrators, and the federal government. The university has spent years at the center of controversy after controversy: expulsions of pro-Palestinian stude",
        "id": 3505236,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/05/1418221/columbia-tries-using-ai-to-cool-off-student-tensions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Columbia Tries Using AI To Cool Off Student Tensions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T19:19:34.483622+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T18:01:00+00:00",
        "description": "Anthropic is blocking its services from Chinese-controlled companies, saying it's taking steps to prevent a US adversary from advancing in AI and threatening American national security. From a report: The San Francisco-based startup is widening existing restrictions on \"authoritarian\" regimes to cover any company that's majority-owned by entities from countries such as China. That includes their overseas operations, it said in a statement. Foreign-based subsidiaries could be used to access its technology and further military applications, the startup added. \n\nAnthropic's Dario Amodei has publicly advocated technological sanctions on China, particularly after DeepSeek stunned Silicon Valley with an advanced model this year. While Anthropic didn't name any companies, Chinese big tech firms from Alibaba to ByteDance have joined DeepSeek in an intensifying race to build AI services that can rival the likes of OpenAI in the US. Chinese entities \"could use our capabilities to develop applic",
        "id": 3505237,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/05/0535228/anthropic-clamps-down-on-ai-services-for-chinese-owned-firms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Clamps Down on AI Services for Chinese-Owned Firms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T17:31:53.220152+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T17:20:00+00:00",
        "description": "Much of the world favors protecting 30% of the world's land and water for nature by 2030, according to new research that has found overwhelming public support for the goal across eight countries on five continents. The Guardian: Nearly 200 nations agreed in 2022 to set aside 30% of the world's land and 30% of marine areas for nature. But just 17.6% of the world's land and 8.6% of the seas are now under global protection, and more than 100 nations are less than halfway to meeting the target, which was established under the 2022 Kunming-Montreal Global Biodiversity Framework. \n\nGovernments will need to implement swift changes if they are to achieve the target within the next five years. But setting aside more space for nature can be a political pitfall. Often it can mean restricting people's access to land, halting resource extraction and relocating human settlements. These issues, along with possible effects on economic growth, are often cited by countries as barriers to expanding prot",
        "id": 3503997,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/05/1436209/public-strongly-backs-aim-of-30-of-land-and-sea-set-aside-for-nature-poll-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Public Strongly Backs Aim of 30% of Land and Sea Set Aside For Nature, Poll Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T17:31:53.545707+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T16:40:00+00:00",
        "description": "Nobel laureate Geoffrey Hinton has warned that AI will concentrate wealth among a small elite while impoverishing most workers. The computer scientist, who pioneered neural network research in the 1980s, told Financial Times that rich people will use AI to replace workers, creating massive unemployment and profit increases. \n\nHinton, who left Google in 2023 after selling his AI startup for $44 million a decade earlier, dismissed universal basic income as insufficient to address human dignity concerns from job losses. The 77-year-old physicist predicts superintelligent AI will arrive within five to twenty years. He blamed capitalism rather than AI technology itself for the coming economic disruption, stating the system ensures AI will primarily benefit the wealthy rather than solve grand problems like hunger or poverty.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Geoffrey+Hinton%3A+'AI+Will+Make+a+Few+People+Much+",
        "id": 3503998,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/05/1428223/geoffrey-hinton-ai-will-make-a-few-people-much-richer-and-most-people-poorer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Geoffrey Hinton: 'AI Will Make a Few People Much Richer and Most People Poorer'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T17:31:53.881021+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T16:00:00+00:00",
        "description": "Alphabet's Google was hit with a $3.45 billion EU antitrust fine on Friday for anti-competitive practices in its lucrative adtech business, marking its fourth penalty in its decade long fight with EU competition regulators. From a report: The move by the European Commission was triggered by a complaint from the European Publishers Council and comes amid a threat by U.S. President Donald Trump to retaliate against the European Union for any push against Big Tech. \n\nThe EU competition enforcer had originally planned to hand out the fine on Monday but opposition from EU trade chief Maros Sefcovic on concerns about the impact on U.S. tariffs on European cars derailed EU antitrust chief Teresa Ribera's plan. The Commission said Google favored its own online display technology services to the detriment of rivals and online publishers and that it abused its market power since 2014 until today.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitte",
        "id": 3503999,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/05/1527251/google-hit-with-345-billion-eu-antitrust-fine-over-adtech-practices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Hit With $3.45 Billion EU Antitrust Fine Over Adtech Practices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T17:31:54.279918+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T15:20:00+00:00",
        "description": "Panasonic's market value has remained flat at approximately $25 billion over the past decade while rivals Hitachi, Sony and NEC have increased their valuations sixfold during the same period. The Osaka-based conglomerate announced a restructuring plan in May 2025 to eliminate 10,000 positions and streamline operations across its six operating companies and hundreds of product lines. The company generates $57 billion in annual revenue and maintains dominant positions in several markets. Financial Times reports: Within Panasonic's six operating companies and hundreds of product lines are industrial technology gems. The company supplies 70 per cent of the world's in-flight entertainment systems, its facial recognition technology is being used to measure brain health, and its EV battery plants are among the world's most efficient, according to auto industry insiders.\nPanasonic chief said in January that AI-driven hardware and software solutions would constitute 30% of revenues by 2035, co",
        "id": 3504000,
        "language": "en-us",
        "link": "https://ask.slashdot.org/story/25/09/05/1515244/slashdot-asks-can-panasonic-reinvent-itself?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Slashdot Asks: Can Panasonic Reinvent Itself?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T14:50:35.812919+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T14:40:00+00:00",
        "description": "An anonymous reader shares a report: Google's CEO Sundar Pichai stood smiling in a leafy-green California garden in September 2020 and declared that the tech behemoth was entering the \"most ambitious decade yet\" in its climate action. \"Today, I'm proud to announce that we intend to be the first major company to operate carbon free -- 24 hours a day, seven days a week, 365 days a year,\" he said, in a video announcement at the time. \n\nPichai added that he knew the \"road ahead would not be easy,\" but Google \"aimed to prove that a carbon-free future is both possible and achievable fast enough to prevent the most dangerous impacts of climate change.\" Five years on, just how hard Google's \"energy journey\" would become is clear. In June, Google's Sustainability website proudly boasted a headline pledge to achieve net-zero emissions by 2030. By July, that had all changed. An investigation by Canada's National Observer has found that Google's net-zero pledge has quietly been scrubbed, demoted ",
        "id": 3502878,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/05/135248/google-deletes-net-zero-pledge-from-sustainability-website?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Deletes Net-Zero Pledge From Sustainability Website",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T14:50:35.956910+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T14:00:00+00:00",
        "description": "Uber's Indian arm has started using its app to offer rideshare and delivery drivers the chance to make money by classifying data used by AI systems. From a report: Megha Yethadka, global head of Uber AI Solutions, revealed the new gigs in a Thursday LinkedIn post in which she said drivers sometimes have downtime during the day or might want to make some extra cash after hours. Yethadka said the work can involve reviewing photos, counting objects, classifying text, recording audio, or digitizing receipts. \n\nShe said the gigs are \"Powering our enterprise customers worldwide for their gen AI models or consumer applications.\" \"Until now, these tasks were completed by independent contractors outside the app,\" Yethadka wrote. \"The early results are very promising, and we're eager to scale this further.\" In an accompanying video, she mentioned \"worldwide\" expansion for the offering. Prabhjeet Singh, Uber's president for India and South Asia, said the gigs are available in 12 cities and that ",
        "id": 3502879,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/05/1315244/uber-india-starts-offering-drivers-gigs-collecting-and-classifying-info-for-ai-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Uber India Starts Offering Drivers Gigs Collecting and Classifying Info For AI Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T14:50:36.111366+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T10:00:00+00:00",
        "description": "A UK government trial of Microsoft's M365 Copilot found no clear productivity gains despite user satisfaction with tasks like summarizing meetings and writing emails. While the tool sped up some routine work, it actually slowed down more complex tasks like Excel analysis and PowerPoint creation, often producing lower-quality results. The Register reports: The Department for Business and Trade received 1,000 licenses for use between October and December 2024, with the majority of these allocated to volunteers and 30 percent to randomly selected participants. Some 300 of these people consented to their data being analyzed. An evaluation of time savings, quality assurance, and productivity was then calculated in the assessment (PDF). Overall, 72 percent of users were satisfied or very satisfied with their digital assistant and voiced disappointment when the test ended. However, the reality of productivity gains was more nuanced than Microsoft's marketing materials might suggest. Around t",
        "id": 3502880,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/04/2326232/uk-government-trial-of-m365-copilot-finds-no-clear-productivity-boost?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Government Trial of M365 Copilot Finds No Clear Productivity Boost",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T14:50:36.256907+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T07:00:00+00:00",
        "description": "Amazon's Project Kuiper has landed its first airline deal with JetBlue and plans to offer satellite-powered in-flight Wi-Fi starting in 2027. The Verge reports: Yesterday, Amazon's Panos Panay showed off a speed test using an \"enterprise-grade customer terminal\" (aka, dish) to achieve a download speed of just over a gigabit. Fine, but we'll have to wait to see how it performs once individuals using consumer dishes at scale. Amazon says the first customers will start using the service this year, ahead of a broader rollout in 2026.\n \nProject Kuiper-powered Wi-Fi will be available on \"select\" aircraft initially. Amazon says its satellites will provide lower latency and \"more reliable service\" for passengers, as they orbit between 367 and 391 miles above Earth -- far closer than the geostationary satellites that orbit around 22,369 miles above the planet. Amazon has also struck a deal with Airbus to build Project Kuiper's satellite internet service into its aircraft.<p><div class=\"share_s",
        "id": 3502881,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/09/04/2317243/amazons-project-kuiper-strikes-its-first-satellite-internet-deal-with-an-airline?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's Project Kuiper Strikes Its First Satellite Internet Deal With an Airline",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T14:50:36.400919+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Fine-particulate air pollution can drive devastating forms of dementia by triggering the formation of toxic clumps of protein that destroy nerve cells as they spread through the brain, research suggests. Exposure to the airborne particles causes proteins in the brain to misfold into the clumps, which are hallmarks of Lewy body dementia, the second most common form of dementia after Alzheimer's disease. The finding has \"profound implications\" for preventing the neurodegenerative disorder, which affects millions worldwide, with scientists calling for a concerted effort to improve air quality by cutting emissions from industrial activity and vehicle exhausts, improving wildfire management and reducing wood burning in homes.\n \nThe researchers began by analyzing hospital records of the 56.5 million US Medicare patients. They looked at those who were admitted for the first time between 2000 and 2014 with the protein damage. Armed with t",
        "id": 3502882,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/04/2258256/air-pollution-can-drive-devastating-forms-of-dementia-research-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Air Pollution Can Drive Devastating Forms of Dementia, Research Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T07:02:04.793609+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T02:02:00+00:00",
        "description": "In a landmark collaboration across 22 labs, neuroscientists have created the first brain-wide map of decision-making in mice, tracking over 620,000 neurons across nearly 280 brain regions. They found that decision-making is distributed much more broadly than previously thought, involving not just \"cognitive\" centers but also regions linked to movement. From a report: The task was deceptively simple task. Mice sat in front of a screen that intermittently displayed a black-and-white striped circle for a brief amount of time on either the left or right side. A mouse could earn a sip of sugar water if they quickly moved the circle toward the center of the screen by operating a tiny steering wheel in the same direction, often doing so within one second. On some trials, the circle was faint, requiring the animal to rely on past experience to make a guess, which allowed researchers to study how expectations influence future decisions. While the mice performed the task, researchers recorded b",
        "id": 3499076,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/04/2311257/first-brain-wide-map-of-decision-making-charted-in-mice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "First Brain-Wide Map of Decision-Making Charted In Mice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T07:02:04.919765+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T01:25:00+00:00",
        "description": "An Indiana bankruptcy lawyer named Mark Zuckerberg is suing Meta after his Facebook page was repeatedly shut down for \"impersonating\" CEO Mark Zuckerberg, despite being his real legal name. TechCrunch reports: Mark Zuckerberg the lawyer uses a commercial Facebook page to advertise his legal practice and communicate with potential clients. But his page has been disabled five times in the last eight years, since Meta's moderation systems flag his account as falsely impersonating Mark Zuckerberg, the founder of the platform. Mark Zuckerberg is not impersonating Mark Zuckerberg, because he, too, is Mark Zuckerberg. In his legal complaint, Mark Zuckerberg points out that he has been practicing law since Mark Zuckerberg was just three years old.\n \n\"It's not funny,\" Mark Zuckerberg, the lawyer, said to Indianapolis' 13WTHR. \"Not when they take my money. This really pissed me off.\" Mark Zuckerberg has spent over $11,000 to advertise his page on Mark Zuckerberg's Meta platforms, but when Mark ",
        "id": 3499077,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/04/2251235/mark-zuckerberg-sues-mark-zuckerberg?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mark Zuckerberg Sues Mark Zuckerberg",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T07:02:05.097366+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T00:45:00+00:00",
        "description": "Warner Bros. Discovery has filed a major copyright lawsuit against Midjourney, accusing the AI image generator of exploiting its movies and TV shows to train models and generate near-identical reproductions of iconic characters like Batman, Bugs Bunny, and Rick and Morty. From The Hollywood Reporter: The company \"brazenly dispenses Warner Bros. Discovery's intellectual property\" by letting subscribers produce images and videos of iconic copyrighted characters, alleges the complaint, filed on Thursday in California federal court. \"The heart of what we do is develop stories and characters to entertain our audiences, bringing to life the vision and passion of our creative partners,\" said a Warner Bros. Discovery spokesperson in a statement. \"Midjourney is blatantly and purposefully infringing copyrighted works, and we filed this suit to protect our content, our partners, and our investments.\"\n \nFor years, AI companies have been training their technology on data scraped across the interne",
        "id": 3499078,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/04/2236226/warner-bros-discovery-sues-midjourney-for-copyright-infringement?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Warner Bros. Discovery Sues Midjourney For Copyright Infringement",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-05T07:02:05.241078+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-05T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Popular Science: According to a new medical survey, scrolling on your smartphone while using the toilet may dramatically increase your risk of hemorrhoids. The evidence is laid out in a study published on September 3 in the journal PLOS One. [...] Over the past 20 years, one single device has unequivocally lengthened the amount of time most people spend sitting. \"We're still uncovering the many ways smartphones and our modern way of life impact our health,\" Harvard Medical School gastroenterologist and study co-author Trisha Pasricha said in a statement. \"It's possible that how and where we use them -- such as while in the bathroom -- can have unintended consequences.\"\n \nTo test this theory, Pasricha and colleagues oversaw a study of 125 adults who recently received a colonoscopy screening. The patients were surveyed on both their daily lifestyles and toilet traditions, while endoscopists subsequently evaluated them for hemorrhoids. Of those vo",
        "id": 3499079,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/04/2159215/bathroom-doomscrolling-may-increase-your-risk-of-hemorrhoids?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bathroom Doomscrolling May Increase Your Risk of Hemorrhoids",
        "vote": 0
    }
]