[
    {
        "age": null,
        "album": "",
        "author": "Magia Natury",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T09:56:35.630923+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T09:00:03+00:00",
        "description": "Muchomor sromotnikowy wykształcił silne toksyny w toku ewolucji jako mechanizm zapobiegający zjadaniu go przez owady, ślimaki czy ssaki dzięki czemu jego owocniki mogą przetrwać dłużej i grzyb może skuteczniej się rozmnażać. Wiele zwierząt już instynktownie po samym zapachu rozpoznaje tego grzyba jako trującego i omija go z daleka. Te, którego go skosztują, małą nawet ilość odpadają z puli genetycznej danej populacji. Dla człowieka grzyb ten jest śmiertelnie niebezpieczny.\n\n👉 Patronite ► https://patronite.pl/magia_natury\n__________\nAutor kanału nie rości sobie praw do materiałów wykorzystanych w filmie. Materiały wykorzystane są w ramach prawa dozwolonego użytku w celu zobrazowania, edukowania i lepszego zrozumienia zagadnienia lub pochodzą z serwisów udostępniających darmowe materiały.\n\nThe author of the channel does not claim any rights to the material used in the video. The materials are used under fair use law to illustrate, educate and better understand the issue, or they come fr",
        "id": 3343153,
        "language": "pl",
        "link": "https://www.youtube.com/watch?v=0BDYUM2KDu4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 461,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfDX69pxC4q6yKSaugs196g",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0BDYUM2KDu4/hqdefault.jpg",
        "title": "Rosyjska Ruletka w Lesie - GRZYBOBRANIE - M. Sromotnikowy, Czerwony, Szatan vs Jadalne Grzyby",
        "vote": 0
    }
]