[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T23:49:42.212104+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T22:55:00+00:00",
        "description": "An anonymous reader shared this report from Tom's Hardware:\n\n\nAccording to German news outlet Heise, notable progress has been made regarding the counterfeit Seagate hard drive case. Just like something out of an action movie, security teams from Seagate's Singapore and Malaysian offices, in conjunction with local Malaysian authorities, conducted a raid on a warehouse in May that was engaged in cooking up counterfeit Seagate hard drives, situated outside Kuala Lumpur. \n\nDuring the raid, authorities reportedly uncovered approximately 700 counterfeit Seagate hard drives, with SMART values that had been reset to facilitate their sale as new... However, Seagate-branded drives were not the only items involved, as authorities also discovered drives from Kioxia and Western Digital. Seagate suspects that the used hard drives originated from China during the Chia [cryptocurrency] boom. Following the cryptocurrency's downfall, numerous miners sold these used drives to workshops where many were ",
        "id": 3346950,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/16/2253203/seagate-spins-up-a-raid-on-a-counterfeit-hard-drive-workshop?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Seagate 'Spins Up' a Raid on a Counterfeit Hard Drive Workshop",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T22:44:58.376480+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T21:49:00+00:00",
        "description": "\"Illinois last week banned the use of artificial intelligence in mental health therapy,\" reports the Washington Post, \"joining a small group of states regulating the emerging use of AI-powered chatbots for emotional support and advice.\"\n\nLicensed therapists in Illinois are now forbidden from using AI to make treatment decisions or communicate with clients, though they can still use AI for administrative tasks. Companies are also not allowed to offer AI-powered therapy services &mdash; or advertise chatbots as therapy tools &mdash; without the involvement of a licensed professional. \n\nNevada passed a similar set of restrictions on AI companies offering therapy services in June, while Utah also tightened regulations for AI use in mental health in May but stopped short of banning the use of AI. \n\nThe bans come as experts have raised alarms about the potential dangers of therapy with AI chatbots that haven't been reviewed by regulators for safety and effectiveness. Already, cases have eme",
        "id": 3346754,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/16/0434221/illinois-bans-ai-therapy-joins-two-other-states-in-regulating-chatbots?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Illinois Bans AI Therapy, Joins Two Other States in Regulating Chatbots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T21:39:50.600339+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T20:49:00+00:00",
        "description": "\"The planet Uranus emits more heat than it gets from the Sun,\" reports Science Daily , citing a new study led by University of Houston researchers, in collaboration with planetary scientists worldwide. \"This means it's still slowly losing leftover heat from its early history,\" says the first author on the paper, \"a key piece of the puzzle that helps us understand its origins and how it has changed over time.\" \n\nThe study found the planet emitting about 12.5% more heat than it absorbs via sunlight, which \"suggests Uranus does have its own internal heat &mdash; an advance that not only informs NASA's future missions but also deepens scientists' understanding of planetary systems, including processes that influence Earth's climate and atmospheric evolution.\"\n\nThe discovery resolves a long-standing scientific mystery about the giant planet, because observational analyses from Voyager 2 in 1986 didn't suggest the presence of significant internal heat &mdash; contradicting scientists' under",
        "id": 3346515,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/16/2045223/researchers-solve-long-standing-mystery-after-voyagers-1986-flyby-of-uranus?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers Solve Long-Standing Mystery After Voyager's 1986 Flyby of Uranus",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T20:33:09.574672+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T19:39:00+00:00",
        "description": "\"Several cybersecurity companies debuted advancements in AI agents at the Black Hat conference last week,\" reports Axios, \"signaling that cyber defenders could soon have the tools to catch up to adversarial hackers.\"\n\n- Microsoft shared details about a prototype for a new agent that can automatically detect malware &mdash; although it's able to detect only 24% of malicious files as of now. \n- Trend Micro released new AI-driven \"digital twin\" capabilities that let companies simulate real-world cyber threats in a safe environment walled off from their actual systems. \n- Several companies and research teams also publicly released open-source tools that can automatically identify and patch vulnerabilities as part of the government-backed AI Cyber Challenge. \n\nYes, but: Threat actors are now using those AI-enabled tools to speed up reconnaissance and dream up brand-new attack vectors for targeting each company, John Watters, CEO of iCounter and a former Mandiant executive, told Axios. \n\nTh",
        "id": 3346235,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/16/1936221/ai-is-reshaping-hacking-no-one-agrees-how-fast?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Is Reshaping Hacking. No One Agrees How Fast",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T19:28:24.933404+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T18:34:00+00:00",
        "description": "Matt Asay answered questions from Slashdot readers in 2010 as the then-COO of Canonical. Today he runs developer marketing at Oracle (after holding similar positions at AWS, Adobe, and MongoDB). \nAnd this week Asay contributed an opinion piece to InfoWorld reminding us of open source contributions from companies where \"enlightened self-interest underwrites the boring but vital work &mdash; CI hardware, security audits, long-term maintenance &mdash; that grassroots volunteers struggle to fund.\"\n\n[I]f you look at the Linux 6.15 kernel contributor list (as just one example), the top contributor, as measured by change sets, is Intel... Another example: Take the last year of contributions to Kubernetes. Google (of course), Red Hat, Microsoft, VMware, and AWS all headline the list. Not because it's sexy, but because they make billions of dollars selling Kubernetes services... Some companies (including mine) sell proprietary software, and so it's easy to mentally bucket these vendors with li",
        "id": 3345963,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/16/1749228/remember-the-companies-making-vital-open-source-contributions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Remember the Companies Making Vital Open Source Contributions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T18:23:02.103274+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T17:34:00+00:00",
        "description": "Slashdot reader darwinmac writes: Volkswagen is offering a subscription model for extra horsepower on its ID.3 electric cars. Want to bump your ride from the standard 201 bhp to the full 228 bhp? That will be about &pound;16.50 per month or &pound;165 per year, or a one-time &pound;649 &quot;lifetime&quot; fee that is tied to the car, not you. If you sell it, you have to pay again.\n\n VW defended this to the BBC by saying you are basically paying for a sportier experience without buying a higher powered model upfront, calling it &quot;nothing new.&quot; Nothing changes mechanically. You are just paying VW to essentially flip a boolean somewhere in the car's software.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Volkswagen+Wants+You+To+Pay+Monthly+To+Unlock+More+Horsepower%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F16%2F0242202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.co",
        "id": 3345667,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/16/0242202/volkswagen-wants-you-to-pay-monthly-to-unlock-more-horsepower?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Volkswagen Wants You To Pay Monthly To Unlock More Horsepower",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T17:18:19.007064+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T16:34:00+00:00",
        "description": "Puerto Rico expects 93 different power outages this summer, reports the Washington Post. \n\nBut they also note that \"roughly 1 in 10 Puerto Rican homes now have a battery and solar array for backup power\" which have also \"become a crucial source of backup power for the entire island grid.\"\n\nA network of 69,000 home batteries can generate as much electricity as a small natural gas turbine during an emergency, temporarily covering about 2 percent of the island's energy needs when things go wrong... \"It has very, very certainly prevented more widespread outages,\" said Daniel Haughton, [transmission and distribution planning director for Puerto Rico's grid operator]. \"In the instances that we had to [cut power], it was for a much shorter duration: A four-hour outage became a one- or two-hour outage.\" \n\nPuerto Rico's experience offers a glimpse into the future for the rest of the United States, where batteries are starting to play a big role in keeping the lights on. Authorities in Texas, C",
        "id": 3345351,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/16/0335211/virtual-power-plants-where-home-batteries-are-saving-americans-from-blackouts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Virtual Power Plants: Where Home Batteries are Saving Americans from Blackouts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T16:13:01.496552+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T15:34:00+00:00",
        "description": "ChatGPT now has nearly 700 million weekly users, OpenAI says. But after launching GPT-5 last week, critics bashed its less-intuitive feel, reports CNBC, \"ultimately leading the company to restore its legacy GPT-4 to paying chatbot customers.\" \n\nYet GPT-5 was always about cracking the enterprise market \"where rival Anthropic has enjoyed a head start,\" they write. And one week in, \"startups like Cursor, Vercel, and Factory say they've already made GPT-5 the default model in certain key products and tools, touting its faster setup, better results on complex tasks, and a lower price.\"\nSome companies said GPT-5 now matches or beats Claude on code and interface design, a space Anthropic once dominated. Box, another enterprise customer, has been testing GPT-5 on long, logic-heavy documents. CEO Aaron Levie told CNBC the model is a \"breakthrough,\" saying it performs with a level of reasoning that prior systems couldn't match... \n\nStill, the economics are brutal. The models are expensive to ru",
        "id": 3345018,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/16/0623240/openais-gpt-5-sees-a-big-surge-in-enterprise-use?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's GPT-5 Sees a Big Surge in Enterprise Use",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T15:08:35.441728+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T14:34:00+00:00",
        "description": "Last month, Python \"reached the highest ranking a programming language ever had in the TIOBE index,\" according to TIOBE CEO Paul Jansen. \n\n\"We thought Python couldn't grow any further, but AI code assistants let Python take yet another step forward.\"\n According to recent studies of Stanford University (Yegor Denisov-Blanch), AI code assistants such as Microsoft Copilot, Cursor or Google Gemini Code Assist are 20% more effective if used for popular programming languages. The reason for this is obvious: there is more code for these languages available to train the underlying models. This trend is visible in the TIOBE index as well, where we see a consolidation of languages at the top. Why would you start to learn a new obscure language for which no AI assistance is available? This is the modern way of saying that you don't want to learn a new language that is hardly documented and/or has too few libraries that can help you.\n \nTIOBE's \"Programming Community Index\" attempts to calculate t",
        "id": 3344715,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/16/0658254/python-surges-in-popularity-and-so-does-perl?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Python Surges in Popularity. And So Does Perl",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T14:03:07.022878+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the BBC: Drug treatment can help people newly diagnosed with ADHD (attention deficit hyperactivity disorder) to reduce their risk of substance misuse, suicidal behavior, transport accidents and criminality, a study suggests. These issues are linked to common ADHD symptoms such as acting impulsively and becoming easily distracted. Some 5% of children and 2.5% of adults worldwide are thought to be affected by the disorder -- and growing numbers are being diagnosed. The findings, published in the British Medical Journal (BMJ), confirm the wider potential benefits of drug treatment and could help patients decide whether to start medication, the researchers say. The researchers found taking ADHD medication was linked to reductions of first-time instances of:\n - suicidal behavior - 17% - substance misuse - 15% - transport accidents - 12% - criminal behavior - 13%\n \nWhen recurrent events were analyzed, the researchers found ADHD medication was linked ",
        "id": 3344372,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/15/2040240/adhd-drugs-have-wider-life-benefits-study-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ADHD Drugs Have Wider Life Benefits, Study Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T10:48:04.620178+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T10:00:00+00:00",
        "description": "alternative_right shares a report from Phys.org: Take note of the name: ReHMGB1. A new study pinpoints this protein as being able to spread the wear and tear that comes with time as it quietly travels through the bloodstream. This adds significantly to our understanding of aging. The researchers were able to identify ReHMGB1 as a critical messenger passing on the senescence signal by analyzing different types of human cells grown in the lab and conducting a variety of tests on mice. When ReHMGB1 transmission was blocked in mice with muscle injuries, muscle regeneration happened more quickly, while the animals showed improved physical performance, fewer signs of cellular aging, and reduced systemic inflammation. The findings have been published in the journal Metabolism.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Aging+Can+Spread+Through+Your+Body+Via+a+Single+Protein%2C+Study+Finds%3A+https%3A%2F%2Fscience.slash",
        "id": 3343420,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/15/2031257/aging-can-spread-through-your-body-via-a-single-protein-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Aging Can Spread Through Your Body Via a Single Protein, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T07:31:30.853802+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T07:00:00+00:00",
        "description": "Scientists in Svalbard warn Arctic glaciers are in \"terminal\" decline, with microbe-driven biological darkening accelerating ice melt and potentially triggering major climate feedback loops. The Guardian reports: Recent research implicates snow and ice-dwelling microbes in positive feedback loops that can accelerate melting. With more than 70% of the planet's freshwater stored in ice and snow -- and billions of lives sustained by glacier-fed rivers -- this has profound implications everywhere. Yet not all polar microbes amplify global heating. Emerging evidence suggests that certain populations are -- for now -- applying a brake to methane emissions. [...] Microbes that live in surface ice and snow produce dark-colored pigments to harness sunlight and shield themselves from damaging UV light. They also trap dark-colored dust and debris. Together, these factors darken snow and ice, causing it to absorb more heat and melt faster -- a process known as \"biological darkening.\"\n \nMicrobes a",
        "id": 3342644,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/15/2027248/arctic-glaciers-face-terminal-decline-as-microbes-accelerate-ice-melt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Arctic Glaciers Face 'Terminal' Decline As Microbes Accelerate Ice Melt",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T04:17:33.496573+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from ScientificAmerican: After a brain stem stroke left him almost entirely paralyzed in the 1990s, French journalist Jean-Dominique Bauby wrote a book about his experiences -- letter by letter, blinking his left eye in response to a helper who repeatedly recited the alphabet. Today people with similar conditions often have far more communication options. Some devices, for example, track eye movements or other small muscle twitches to let users select words from a screen. And on the cutting edge of this field, neuroscientists have more recently developed brain implants that can turn neural signals directly into whole words. These brain-computer interfaces (BCIs) largely require users to physically attempt to speak, however -- and that can be a slow and tiring process. But now a new development in neural prosthetics changes that, allowing users to communicate by simply thinking what they want to say.\n \nThe new system relies on much of the same techno",
        "id": 3342050,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/15/1950205/new-brain-device-is-first-to-read-out-inner-speech?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Brain Device Is First To Read Out Inner Speech",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T02:06:31.593457+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T02:02:00+00:00",
        "description": "Sam Altman's brain-chip venture is exploring the idea of genetically altering brain cells to make better implants. \"The company, which has been referred to as Merge Labs, is looking at an approach involving gene therapy that would modify brain cells,\" reports Bloomberg. \"In addition, an ultrasound device would be implanted in the head that could detect and modulate activity in the modified cells.\" From the report: It's one of a handful of ideas and technologies the company has been exploring, they said. The venture is still in early stages and could evolve significantly. \"We have not done that deal yet,\" Altman told journalists at a dinner Thursday in San Francisco, referring to a question about a brain-computer interface venture. \"I would like us to.\" Altman said he wants to be able to think something and have ChatGPT respond to it. [...]\n \nFor years, researchers have been studying how to genetically change cells to make them respond to ultrasound, a field called sonogenetics. The id",
        "id": 3341715,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/15/2012223/sam-altmans-brain-chip-venture-is-mulling-gene-therapy-approach?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sam Altman's Brain Chip Venture Is Mulling Gene Therapy Approach",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T02:06:31.791103+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T01:25:00+00:00",
        "description": "South Korean authorities have arrested the operator of Yubin Archive, a Telegram-based \"pirate library\" that grew to over 330,000 members by sharing textbooks, workbooks, lectures, and exam prep materials under the banner of \"eliminating educational inequality.\" TorrentFreak reports: An official statement confirming the operator's arrest was published locally on August 12. The timeline suggests the arrest probably took place on or around August 9. The following notice appeared on Yubin Archive on August 11. \"The Ministry of Culture and Sports' Copyright Crime Science Investigation Team used digital science investigation (forensics) and various investigation methods to identify the core operator, conduct simultaneous search and seizure at their homes, and fully secure the Telegram criminal activities,\" the Ministry's statement reads. \"Investigations into accomplices who participated in the operation are also underway.\"\n \nWhile copyright infringement at scale is almost always a crime, r",
        "id": 3341716,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/15/2019257/yubin-archive-pirate-library-operator-arrested-illegal-study-materials-group-canceled-for-330k-members?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Yubin Archive' Pirate Library Operator Arrested, Illegal Study Materials Group Canceled For 330K Members",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T01:01:28.996624+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T00:45:00+00:00",
        "description": "Wine 10.13 has been released after a one-month break, introducing a Windows Gaming Input configuration tab for the Joystick Control Panel, new ECDSA_P521 and ECDH_P521 cryptographic algorithms, OpenGL WoW64 thunk generation, and expanded Windows Runtime metadata support. The update also delivers 32 bug fixes,\" which is more than normal given the month of time between releases,\" writes Phoronix's Michael Larabel. \"There are fixes for Microsoft Office 365, Microsoft SQL Server Management Studio Express, Doom 3 BFG Edition, and a variety of other game and application fixes.\"\n \nYou can download and learn more about the release at WineHQ.org GitLab.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wine+10.13+Released%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F15%2F204222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http:",
        "id": 3341468,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/15/204222/wine-1013-released?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wine 10.13 Released",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T01:01:29.175598+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T00:02:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: The United States' practice of installing location trackers in chip shipments at risk of diversion to China reflects the \"instincts of a surveillance empire,\" China's state-run media outlet Xinhua said in a commentary published on Friday. Reuters reported earlier this week that U.S. authorities had secretly placed location tracking devices in targeted shipments of advanced chips to detect diversions to China, which is under U.S. curbs for advanced chip exports. The Xinhua commentary, titled \"America turns chip trade into a surveillance game,\" cited \"reports\" that Washington had embedded such trackers, accusing the United States of running \"the world's most sprawling intelligence apparatus.\" [...] In its commentary, Xinhua accused the U.S. government of seeing its trading partners as \"rivals to be tripped up or taken down,\" adding that \"if U.S. chips are seen as Trojan horses for surveillance, customers will look elsewhere.\" Further rea",
        "id": 3341469,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/15/1955249/chinese-state-media-calls-us-a-surveillance-empire-over-trackers-in-chips?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese State Media Calls US a 'Surveillance Empire' Over Trackers In Chips",
        "vote": 0
    }
]