[
    {
        "age": null,
        "album": "",
        "author": "/u/l0_0is",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T14:55:56.688575+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T14:48:20+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>The current web is filled with click-attracting headlines and high-level content that doesn&#39;t provide much value, and it&#39;s this way by design because the search engines money comes from the time people spend on them.</p> <p>So, it&#39;s always a give or take on providing just good enough content to retain a user but not easily provide all information so they come back. Also, the attention span of all of us is low, so writers need to cut out relevant information to avoid getting the reader bored.</p> <p>This led to many click-attracting experts writing content and topics that they barely understand, and along the way undervaluing writers who have done the research and put the time to write about complex topics.</p> <p>With the rise of LLMs, now everyone can write &quot;good&quot; content because they were trained on that clickbait expert content, but foundational LLMs as well as people struggle to write something NEW because it&#39;s just hard ",
        "id": 3344605,
        "language": "en",
        "link": "https://www.reddit.com/r/searchengines/comments/1mrxczy/clickbait_fooled_us_al_isnt_buying_it",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 463,
        "source_url": "https://www.reddit.com/r/searchengines/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Clickbait fooled us, Al isn't buying it!",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "/u/JamesAI_journal",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T03:00:48.929127+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T02:14:11+00:00",
        "description": "<!-- SC_OFF --><div class=\"md\"><p>The challenge today isn’t writing long posts or stuffing keywords. It’s building trust with search engines. Only trusted sites get visibility, and in the world of Generative and Answer Engines, AI will reference your content only if your site is credible.</p> <p>This is where Ghost Pages 👻 and GEO come in:</p> <p>Ghost Pages: Pages hosted on Google-owned platforms, indexed almost instantly, generating organic traffic without a website, hosting, or backlinks.</p> <p>GEO (Generative Engine Optimization): Optimizing content to appear in AI-powered engines like ChatGPT, Claude, and Perplexity.</p> <p>The connection is clear: Start with traditional SEO to secure strong rankings and credibility, then adopt GEO and Ghost Pages to maximize organic traffic from both Google and AI engines.</p> <p>The result: Your site doesn’t just appear in search results—it becomes a trusted source for AI engines, attracting daily organic traffic quickly and anonymously.</p> <",
        "id": 3341803,
        "language": "en",
        "link": "https://www.reddit.com/r/searchengines/comments/1mrhtxw/seo_isnt_deadits_evolving_fast_every_new_google",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 463,
        "source_url": "https://www.reddit.com/r/searchengines/.rss",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SEO isn’t dead—it’s evolving fast. Every new Google update forces SEO specialists to level up, not quit.",
        "vote": 0
    }
]