[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T16:32:41.671413+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T15:30:01+00:00",
        "description": "The Rogue Prince of Persia's 1.0 release is fast approaching, and thanks to a string of sizeable updates since first emerging to early access back in May 2024 the game is thoroughly transformed. Evil Empire have proven themselves dedicated to fully-realising The Rogue Prince’s potential, with substantial updates to the game’s stylish traversal and combat, its intuitive build synergies, its art direction, enemies, biomes, and more that was released during early access. \n\nFollowing a barebones reveal, The Rogue Prince of Persia is now fully poised to win over players and critics alike thanks to an experience which looks, feels, and plays exceptionally. A potential standout in the crowded roguelike genre beckons.",
        "id": 3345091,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=2w-4bazuDv8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2w-4bazuDv8/hqdefault.jpg",
        "title": "The Rogue Prince of Persia - 15 Things To Know BEFORE YOU BUY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-16T14:22:54.527083+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-16T13:30:07+00:00",
        "description": "With E3 gone and buried, Gamescom is officially one of, if not the biggest, gaming events of the year. With over 1,500 exhibitors this year, including heavy hitters like Xbox and Nintendo, there is a lot to look forward to, and that applies to all the new announcements as well.\n\nGamescom Opening Live returns on August 19th and features new trailers and reveals from Silent Hill f, Lords of the Fallen 2, Ninja Gaiden 4, Honor of Kings: World, and Resident Evil Requiem, to name a few. Then there's the Future Games Show on August 20th, which includes new trailers for Little Nightmares 3 and Phantom Blade Zero. Don't even get us started on Xbox's two-day broadcast, featuring dozens of games and a potential release date announcement for the ROG Xbox Ally and Ally X.\n\nThe potential reveals are too much to count, but it seems like we may finally get a date for Hollow Knight: Silksong, among other titles.",
        "id": 3344406,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=9m826h_pLw0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9m826h_pLw0/hqdefault.jpg",
        "title": "Gamescom 2025 - 16 Gaming REVEALS That May Happen",
        "vote": 0
    }
]