[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T16:11:48.256092+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T15:30:26+00:00",
        "description": "Developing a game can be a really tricky job. Video games take a lot of time and effort to make, and there are a lot of moving parts involved in the process. While it’s majorly clear what makes a game tick, sometimes it happens that developers make worse decisions and develop something that isn’t innovative in the slightest. \n\nIt can occur due to a disconnect between what the fan base expects and what the developer delivers, or maybe iterating without innovation, or maybe just a poor development cycle. \n\nWith this video, we will be taking a look at 15 such cases of games where the developers actually ended up “making it worse”!",
        "id": 2937496,
        "language": null,
        "link": "https://www.youtube.com/watch?v=rIqOi2L50kM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rIqOi2L50kM/hqdefault.jpg",
        "title": "15 Times Game Devs Said “LET'S MAKE IT WORSE” And Actually Did",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T14:02:35.161426+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T13:30:17+00:00",
        "description": "For numerous reasons, player perception of games prior to even a minute’s play can be damning. This isn’t a video on how you should all give Marathon a chance though, no. Instead, we’re aiming to highlight games that visually might look unimpressive, or mechanically may appear shallow, or conceptually or thematically might seem repetitive or over-explored. \n\nThe games featured here harbour more beneath their presentation. Furthermore, they’ve delighted legions of fans – some of which into the millions – via their innovative gameplay, engrossing stories, wonderful characters, inventive mechanics, or a combination of them all. \n\nTo bottom line: first impressions can be deceiving, and it’s in playing these games that their true power comes to the fore beyond what they initially appear to be about.",
        "id": 2936762,
        "language": null,
        "link": "https://www.youtube.com/watch?v=EQkbQUy61tE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EQkbQUy61tE/hqdefault.jpg",
        "title": "15 Games That Are BETTER Than They Look",
        "vote": 0
    }
]