[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T23:26:13.490981+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T22:32:00+00:00",
        "description": "Timothy B. Lee has written for the Washington Post, Vox.com, and Ars Technica &mdash; and now writes a Substack blog called \"Understanding AI.\" \nThis week he visits recent research by computer scientists and legal scholars from Stanford, Cornell, and West Virginia University that found that Llama 3.1 70B&#194;(released in July 2024) has memorized 42% of the first Harry Potter book well enough to reproduce 50-token excerpts at least half the time...\nThe paper was published last month by a team of computer scientists and legal scholars from Stanford, Cornell, and West Virginia University. They studied whether five popular open-weight models &mdash; three from Meta and one each from Microsoft and EleutherAI &mdash; were able to reproduce text from Books3, a collection of books that is widely used to train LLMs. Many of the books are still under copyright... Llama 3.1 70B &mdash; a mid-sized model Meta released in July 2024 &mdash; is far more likely to reproduce Harry Potter text than an",
        "id": 2939613,
        "language": null,
        "link": "https://slashdot.org/story/25/06/15/2230206/metas-llama-31-can-recall-42-of-the-first-harry-potter-book?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta's Llama 3.1 Can Recall 42% of the First Harry Potter Book",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T22:21:20.920054+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T21:29:00+00:00",
        "description": "Meta and AWS have used Rust, and Netflix uses Go,reports the programming news site InfoQ. But using another language, Apple recently \"migrated its global Password Monitoring service from Java to Swift, achieving a 40% increase in throughput, and significantly reducing memory usage.\" \n\n\nThis freed up nearly 50% of their previously allocated Kubernetes capacity, according to the article, and even \"improved startup time, and simplified concurrency.\"\n\n\nIn a recent post, Apple engineers detailed how the rewrite helped the service scale to billions of requests per day while improving responsiveness and maintainability... \"Swift allowed us to write smaller, less verbose, and more expressive codebases (close to 85% reduction in lines of code) that are highly readable while prioritizing safety and efficiency.\" \nApple's Password Monitoring service, part of the broader Password app's ecosystem, is responsible for securely checking whether a user's saved credentials have appeared in known data br",
        "id": 2939333,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/15/2126220/apple-migrates-its-password-monitoring-service-to-swift-from-java-gains-40-performance-uplift?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Migrates Its Password Monitoring Service to Swift from Java, Gains 40% Performance Uplift",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T21:16:14.528238+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T20:10:00+00:00",
        "description": "NPR looks at the \"high-quality, climate-friendly apartments\" in Vienna, asking if it's a model for addressing both climate change and the housing crisis. \nAbout half the city's 2 million people live in the widespread (and government-supported) apartments, with solar panels on top and very thick, insulated walls that reduce the need for heating and cooling. (One resident tells NPR they don't even need an air conditioner because \"It's not cold in winter times. It's not hot in summer times.\")\n\nVienna council member Nina Abrahamczik, who heads the climate and environment committee, says as the city transitions all of its buildings off planet-heating fossil fuels, they're starting with the roughly 420,000 housing units they already own or subsidize.... As Vienna makes an aggressive push to completely move away from climate-polluting natural gas by 2040, it's starting with much of this social housing, says J&uuml;rgen Czernohorszky, executive city councilor responsible for climate and envir",
        "id": 2939033,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/15/207237/could-this-city-be-the-model-for-how-to-tackle-the-both-the-climate-and-housing-crisis?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could This City Be the Model for How to Tackle the Both the Climate and Housing Crisis?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T19:05:34.530593+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T18:20:00+00:00",
        "description": "A chain of stores called Home Bargains installed facial recognition software to spot returning shoplifters. Unfortunately, \"Facewatch\" made a mistake. \n\"We acknowledge and understand how distressing this experience must have been,\" an anonymous Facewatch spokesperson tells the BBC, adding that the store using their technology \"has since undertaken additional staff training.\" \n\nA woman was accused by a store manager of stealing about &pound;10 (about $13) worth of items (\"Everyone was looking at me\"). And then it happened again at another store when she was shopping with her 81-year-old mother on June 4th:\n\n\"As soon as I stepped my foot over the threshold of the door, they were radioing each other and they all surrounded me and were like 'you need to leave the store',\" she said. \"My heart sunk and I was anxious and bothered for my mum as well because she was stressed....\" \nIt was only after repeated emails to both Facewatch and Home Bargains that she eventually found there had been an ",
        "id": 2938460,
        "language": null,
        "link": "https://slashdot.org/story/25/06/15/1817236/facial-recognition-error-sees-woman-wrongly-accused-of-theft?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Facial Recognition Error Sees Woman Wrongly Accused of Theft",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T16:51:55.421722+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T16:34:00+00:00",
        "description": "The state of New York is \"asking companies to disclose whether AI is the reason for their layoffs,\" reports Entrepreneur:\nThe move applies to New York State's existing Worker Adjustment and Retraining Notification (WARN) system and took effect in March, Bloomberg reported. New York is the first state in the U.S. to add the disclosure, which could help regulators understand AI's effects on the labor market. \n\nThe change takes the form of a checkbox added to a form employers fill out at least 90 days before a mass layoff or plant closure through the WARN system. Companies have to select whether \"technological innovation or automation\" is a reason for job cuts. If they choose that option, they are directed to a second menu where they are asked to name the specific technology responsible for layoffs, like AI or robots.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+York+State+Begins+Asking+Employers+to+Offically+Id",
        "id": 2937828,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/15/046216/new-york-state-begins-asking-employers-to-offically-identify-layoffs-caused-by-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New York State Begins Asking Employers to Offically Identify Layoffs Caused by AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T15:47:52.648975+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T15:34:00+00:00",
        "description": "\"Cooper Taylor is only 17 years old, but he's already trying to revolutionize the drone industry,\" writes Business Insider:\n\n\nHis design makes the drone more efficient, customizable, and less expensive to construct, he says. He's built six prototypes, 3D printing every piece of hardware, programming the software, and even soldering the control circuit board. He says building his drone cost one-fifth of the price of buying a comparable machine, which sells for several thousand dollars. Taylor told Business Insider he hopes that \"if you're a first responder or a researcher or an everyday problem solver, you can have access to this type of drone.\" \n\nHis innovation won him an $8,000 scholarship in April at the Junior Science and Humanities Symposium, funded by the Defense Department. Then, on May 16, he received an even bigger scholarship of $15,000 from the US Navy, which he won after presenting his research at the Regeneron International Science and Engineering Fair... \n\nIt all started ",
        "id": 2937464,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/15/0148202/17-year-old-student-builds-3d-printed-drone-in-garage-interests-dod-and-mit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "17-Year-Old Student Builds 3D-printed Drone In Garage, Interests DoD and MIT",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T14:41:53.797540+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T14:34:00+00:00",
        "description": "America's federal government is building a website and API called ai.gov to \"accelerate government innovation with AI\", according to an early version spotted by 404 Media that was posted on GitHub by the U.S. government's General Services Administration. \n\nThat site \"is supposed to launch on July 4,\" according to 404 Media's report, \"and will include an analytics feature that shows how much a specific government team is using AI...\"\nAI.gov appears to be an early step toward pushing AI tools into agencies across the government, code published on Github shows.... \nThe early version of the page suggests that its API will integrate with OpenAI, Google, and Anthropic products. But code for the API shows they are also working on integrating with Amazon Web Services' Bedrock and Meta's LLaMA. The page suggests it will also have an AI-powered chatbot, though it doesn't explain what it will do... Currently, AI.gov redirects to whitehouse.gov. The demo website is linked to from Github (archive ",
        "id": 2937099,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/15/0323209/site-for-accelerating-ai-use-across-the-us-government-accidentally-leaked-on-github?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Site for 'Accelerating' AI Use Across the US Government Accidentally Leaked on GitHub",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T12:31:19.095578+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T11:34:00+00:00",
        "description": "It's the technology \"Google tried (and failed at) more than a decade ago,\" writes CNN. (And Meta and Amazon have also previously tried releasing glasses with cameras, speakers and voice assistants.) \nYet this week Snap announced that \"it's building AI-equipped eyewear to be released in 2026.\" \n\nWhy the \"renewed buzz\"? CNN sees two factors: \n- Smartphones \"are no longer exciting enough to entice users to upgrade often.\"\n- \"A desire to capitalize on AI by building new hardware around it.\"\nAdvancements in AI could make them far more useful than the first time around. Emerging AI models can process images, video and speech simultaneously, answer complicated requests and respond conversationally... And market research indicates the interest will be there this time. The smart glasses market is estimated to grow from 3.3 million units shipped in 2024 to nearly 13 million by 2026, according to ABI Research. The International Data Corporation projects the market for smart glasses like those ma",
        "id": 2936386,
        "language": null,
        "link": "https://slashdot.org/story/25/06/14/1648202/do-people-actually-want-smart-glasses-now?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Do People Actually Want Smart Glasses Now?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T08:04:49.968934+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T07:34:00+00:00",
        "description": "Space may be the perfect place to study cancer &mdash; and someday even treat it,\" writes Space.com:\n\n\n\n\nOn Earth, gravity slows the development of cancer because cells normally need to be attached to a surface in order to function and grow. But in space, cancer cell clusters can expand in all directions as bubbles, like budding yeast or grapes, said Shay Soker, chief science program officer at Wake Forest's Institute for Regenerative Medicine. Since bubbles grow larger and more quickly in space, researchers can more easily test substances clinging to the edge of the larger bubbles, too. Scientists at the University of Notre Dame are taking advantage of this quirk to develop an in-space cancer test that needs just a single drop of blood. The work builds on a series of bubble-formation experiments that have already been conducted on the ISS. \"If cancer screening using our bubble technology in space is democratized and made inexpensive, many more cancers can be screened, and everyone ca",
        "id": 2935266,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/15/053254/space-is-the-perfect-place-to-study-cancer-and-someday-even-treat-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Space is the Perfect Place to Study Cancer and Someday Even Treat It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T04:49:51.129678+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T03:49:00+00:00",
        "description": "Meta's CTO, Palantir's CTO, and OpenAI's chief product officer are being appointed as lieutenant colonels in America's Army Reserve, reports The Register. (Along with OpenAI's former chief revenue officer). \n\nThey've all signed up for Detachment 201: Executive Innovation Corps, \"an effort to recruit senior tech executives to serve part-time in the Army Reserve as senior advisors,\" according to the official statement. \"In this role they will work on targeted projects to help guide rapid and scalable tech solutions to complex problems...\"\n\n\n\"Our primary role will be to serve as technical experts advising the Army's modernization efforts,\" [Meta CTO Andrew Bosworth] said on X... \nAs for Open AI's involvement, the company has been building its ties with the military-technology complex for some years now. Like Meta, OpenAI is working with Anduril on military ideas and last year scandalized some by watering down its past commitment to developing non-military products only. The Army wasn't a",
        "id": 2934685,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/15/0115241/executives-from-meta-openai-and-palantir-commissioned-into-the-us-army-reserve?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Executives from Meta, OpenAI, and Palantir Commissioned Into The US Army Reserve",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-15T02:39:30.781147+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-15T01:49:00+00:00",
        "description": "In 1989 a computer scientist argued that more functionality in software actually lowers usability and practicality &mdash; leading to the counterintuitive proposition that \"worse is better\". But is that still true? \n\nPython's original creator Guido van Rossum addressed the question last month in a lightning talk at the annual Python Language Summit 2025.\n\nGuido started by recounting earlier periods of Python development from 35 years ago, where he used UNIX \"almost exclusively\" and thus \"Python was greatly influenced by UNIX's 'worse is better' philosophy\"... \"The fact that [Python] wasn't perfect encouraged many people to start contributing. All of the code was straightforward, there were no thoughts of optimization... These early contributors also now had a stake in the language; [Python] was also their baby\"... \n\nGuido contrasted early development to how Python is developed now: \"features that take years to produce from teams of software developers paid by big tech companies. The s",
        "id": 2934343,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/06/14/2359251/python-creator-guido-van-rossum-asks-is-worse-is-better-still-true-for-programming-languages?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Python Creator Guido van Rossum Asks:  Is 'Worse is Better' Still True for Programming Languages?",
        "vote": 0
    }
]