[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T23:19:10.082881+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T22:22:00+00:00",
        "description": "\"Media headlines suggesting some slowdown in EV sales are simply incorrect,\" writes the site Electrek, \"and leave out the bigger picture that gas car sales actually are dropping...\"\n\n\n\nOver the course of\nthe last two years or so, sales of battery electric vehicles, while\ncontinuing to grow, have posted lower year-over-year percentage\ngrowth rates than they had in years prior. EV sales used to grow at\n50%+ per year, but for the last couple years, they have grown closer\nto ~25% per year. This alone is not particularly remarkable &mdash; it\nis inevitable that any growing product or category will show slower\npercentage growth rates as sales rise, particularly one that has been\ngrowing at such a fast rate for so long. In some recent years, we\nhad even seen year-over-year\ndoublings in EV market share (though one of those was 2020-&gt;2021,\nwhich was anomalous). To expect improvement at that level perpetually\nwould be close to impossible &mdash; after 3 years of doubling\nmarket share from 20",
        "id": 4079613,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/15/1943200/ev-sales-are-still-rising-they-have-not-slumped",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EV Sales Are Still Rising.  They Have Not Slumped",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T22:18:22.438438+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T21:22:00+00:00",
        "description": "From the personal blog of interface expert Bruce Ediger:\n\n\nEarly in March 2025, I noticed that a web crawler with a user\nagent string of \n\n\nmeta-externalagent/1.1 (+https://developers.facebook.com/docs/sharing/webmasters/crawler)\n\n \n\n\n was hitting my blog's machine at an unreasonable rate.\n \n\n I followed the URL and discovered this is what Meta uses to gather premium,\nhuman-generated content to train its LLMs. I found the rate of\nrequests to be annoying.\n\n\n\n\n I already have a PHP program that creates the illusion of an infinite website. I decided to answer any HTTP request that had\n\"meta-externalagent\" in its user agent string with the contents\nof a bork.php generated file...\n\n\n\n This worked\nbrilliantly. Meta ramped up to requesting 270,000 URLs on May 30 and\n31, 2025...\n\n\n\n\nAfter about 3 months, I got scared that Meta's insatiable\nconsumption of Super Great Pages about condiments, underwear and\ncirca 2010 C-List celebs would start costing me money. So I switched\nto giving \"meta-exter",
        "id": 4079336,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/15/2023242/while-meta-crawls-the-web-for-ai-training-data-bruce-ediger-pranks-them-with-endless-bad-data",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "While Meta Crawls the Web for AI Training Data, Bruce Ediger Pranks Them with Endless Bad Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T21:17:44.186909+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T20:22:00+00:00",
        "description": "An anonymous reader shared this post from the gaming news site Aftermath:\n\n Concord, Sony Interactive Entertainment and Firewalk Studios' Overwatch-like shooter, was live for just two weeks before it was pulled offline. Though Concord certainly had some dedicated players, it didn't have many &mdash; which is why it may be surprising to hear that a group of players are reverse-engineering the game and its servers to bring it back to life. \n\nPublisher Sony removed Concord from stores and digital marketplaces, automatically refunded some, and, later, shut down Firewalk Studios. Two hundred or so people were laid off, and any hopes of Concord's return were dashed. Poor sales &mdash; estimated to be under 25,000 copies sold &mdash; and low player numbers marred the release. Firewalk Studios' game director Ryan Ellis said in a blog post that pieces of the game \"resonated with players,\" but \"other aspects of the game and [Concord's] initial launch didn't land the way [Firewalk Studios] inten",
        "id": 4079102,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/11/15/0521203/sony-killed-this-game-in-2024-three-developers-reverse-engineered-it-back-to-life",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sony Killed This Game in 2024.  Three Developers Reverse-Engineered It Back to Life",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T20:17:13.755565+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T19:22:00+00:00",
        "description": "Long-time Slashdot reader schwit1 shares a Substack post by economist/entrepreneur Skander Garroum:\n\n\n\n\nYou know that feeling when you're waiting for the cable guy, and they said 'between 8am and 6pm, and you waste your entire day, and they never show up? Now imagine that, except the cable guy is 'electricity,' the day is '50 years,' and you're one of 600 million people. At some point, you stop waiting and figure it out yourself. \n\nWhat's happening across Sub-Saharan Africa right now is the most ambitious infrastructure project in human history, except it's not being built by governments or utilities or World Bank consortiums. It's being built by startups selling solar panels to farmers on payment plans. And it's working. Over 30 million solar products sold in 2024. 400,000 new solar installations every month across Africa. 50% market share captured by companies that didn't exist 15 years ago. Carbon credits subsidizing the cost. IoT chips in every device. 90%+ repayment rates on loan",
        "id": 4078796,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/15/0433216/why-solarpunk-is-already-happening-in-africa",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Solarpunk Is Already Happening In Africa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T17:14:59.287374+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T16:34:00+00:00",
        "description": "It was the first allegation of a crime committed in space &mdash; back in 2019. But by 2020 it had led to\ncharges of lying to federal authorities.\n\nAnd now a former Air Force intelligence officer \"has pleaded guilty to lying to a federal agent,\" reports CNBC, \"by falsely claiming that her estranged astronaut wife illegally accessed her bank account while aboard the International Space Station for six months, prosecutors in Houston, Texas, said Friday.\"\n\nThe guilty plea by Summer Worden, 50, on Thursday comes more than five years after she was indicted in the space case for lying about actions by her wife, Anne McClain, a U.S. Army colonel, West Point graduate and Iraq war combat veteran, while they were in the midst of a divorce. The claim came at a time when Worden said that the couple was engaged in a custody battle over what Worden's then-6-year-old son, who had been conceived through in vitro fertilizationand carried by a surrogate... \n\nMcClain was aboard the Space Station from De",
        "id": 4077806,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/15/0547207/woman-pleads-guilty-to-lying-about-astronaut-accessing-bank-account-from-international-space-station",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Woman Pleads Guilty to Lying About Astronaut Accessing Bank Account From International Space Station",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T16:14:17.850714+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T15:34:00+00:00",
        "description": "\"The International Energy Agency's latest outlook signals that oil demand could keep growing through to the middle of the century,\" reports CNBC, \"reflecting a sharp tonal shift from the world's energy watchdog and raising further questions about the future of fossil fuels.\"\n\nIn its flagship World Energy Outlook, the Paris-based agency on Wednesday laid out a scenario in which demand for oil climbs to 113 million barrels per day by 2050, up 13% from 2024 levels. The IEA had previously estimated a peak in global fossil fuel demand before the end of this decade and said that, in order to reach net-zero emissions by 2050, there should be no new investments in coal, oil and gas projects... The IEA's end-of-decade peak oil forecast kick-started a long-running war of words with OPEC, an influential group of oil exporting countries, which accused the IEA of fearmongering and risking the destabilization of the global economy. \n\nThe IEA's latest forecast of increasing oil demand was outlined i",
        "id": 4077479,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/11/15/0352221/a-peak-oil-prediction-surprise-from-the-international-energy-agency",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A 'Peak Oil' Prediction Surprise From the International Energy Agency",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T10:07:59.026925+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T10:00:00+00:00",
        "description": "schwit1 shares a report from the Business Times: General Motors (GM) has directed several thousand of its suppliers to scrub their supply chains of parts from China, four people familiar with the matter said, reflecting automakers' growing frustration over geopolitical disruptions to their operations. GM executives have been telling suppliers they should find alternatives to China for their raw materials and parts, with the goal of eventually moving their supply chains out of the country entirely, the people said. The automaker has set a 2027 deadline for some suppliers to dissolve their China sourcing ties, some of the sources said. GM approached some suppliers with the directive in late 2024, but the effort took on fresh urgency this past spring, during the early days of an escalating US-China trade battle, the sources said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=GM+Wants+Parts+Makers+To+Pull+Supply+Chains",
        "id": 4075568,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/11/15/0040214/gm-wants-parts-makers-to-pull-supply-chains-from-china",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "GM Wants Parts Makers To Pull Supply Chains From China",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T07:05:03.093513+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T07:00:00+00:00",
        "description": "alternative_right shares a report from ScienceAlert: A thorough investigation published in May 2023 found that the inner core of the Moon is, in fact, a solid ball with a density similar to that of iron. To figure it out once and for all, [astronomer Arthur Briaud of the French National Centre for Scientific Research in France] and his colleagues collected data from space missions and lunar laser-ranging experiments to compile a profile of various lunar characteristics. These include the degree of its deformation by its gravitational interaction with Earth, the variation in its distance from Earth, and its density.\n \n... they found that the lunar core is very similar to that of Earth &#226;\" with an outer fluid layer and a solid inner core. According to their modeling, the outer core has a radius of about 362 kilometers (225 miles), and the inner core has a radius of about 258 kilometers (160 miles). That's about 15 percent of the entire radius of the Moon. The inner core, the team fo",
        "id": 4074878,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/11/15/0037256/scientists-confirmed-what-is-inside-our-moon",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Confirmed What Is Inside Our Moon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T04:02:41.834537+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from the Washington Post: Winning the lottery isn't what brought Carrie Edwards her 15 minutes of fame. It was giving it all away. Standing alone in her kitchen one day in September, the Virginia woman was thunderstruck to discover she had won $150,000 in a Powerball drawing. As she was absorbing her windfall, she said, \"I just heard as loud as you can hear God or whoever you believe in the universe just say, this is -- it's not your money.\" Then came a decision: She would donate it all to her three most cherished charities (source paywalled; alternative source). [...] Her journey to the lucky prize started when she walked into a 7-Eleven with a friend who wanted to buy two Powerball tickets. The jackpot for the Sept. 6 drawing was topping $1.7 billion, the second-largest amount ever. Edwards, 68, hardly ever played the lottery, but her friend was an active player who gave her two pieces of advice: Always buy a paper ticket, rather than getting them",
        "id": 4074343,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/11/15/0025246/she-used-chatgpt-to-win-the-virginia-lottery-then-donated-every-dollar",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "She Used ChatGPT To Win the Virginia Lottery, Then Donated Every Dollar",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T02:01:45.432001+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T01:30:00+00:00",
        "description": "YouTube TV and Disney have ended their two-week carriage standoff, restoring ESPN, ABC, and other Disney networks under a new multiyear deal. Variety reports: Under the new agreement, ESPN's full lineup of sports -- including content from ESPN Unlimited -- will be made available on YouTube TV to base-plan subscribers at no additional cost by the end of 2026. In addition, access to a selection of live and on-demand programming from ESPN Unlimited will be available inside YouTube TV.\n \nThe deal also lets YouTube include the Disney+ and Hulu bundle as part of \"select YouTube offerings.\" According to Disney, \"select networks\" will be included in various genre-specific packages that YouTube TV expects to launch in the future. [...] The deal supersedes their prior distribution agreement, inked in December 2021 after a two-day blackout.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+TV+and+Disney+Reach+Deal+Ending+",
        "id": 4073964,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/11/15/019213/youtube-tv-and-disney-reach-deal-ending-two-week-blackout-of-espn-abc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube TV and Disney Reach Deal Ending Two-Week Blackout of ESPN, ABC",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T01:00:49.462686+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T00:50:00+00:00",
        "description": "Apple's limited-edition \"iPhone Pocket\" sold out almost instantly worldwide despite its $150-$230 price tag. Appleinsider reports: Longtime Apple users immediately saw the resemblance with the old iPod socks, and everyone saw the price. Apple and Japan's Issey Miyake fashion house partnered to create a limited edition iPhone Pocket, a stretched sock-like bag or shoulder strap.\n \nThere was no denying that an iPhone in this Pocket looked snuggly. There was definitely no denying that the accessory was well designed. There's also no question that it was about as goofy as the iPod Sock from back the in the day. But there was every denying of the price. The iPhone Pocket came in a short version for $150, and a longer one for $230.\n \nFor comparison, the Apple Watch SE starts at $250. As ever, though, if you liked it, if you had a use for it, and if you had the budget, there was no reason left not to buy. But if you have hesitated because of the cost, you are now out of luck. There are none l",
        "id": 4073719,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/11/15/0011232/apples-230-iphone-pocket-sells-out-nearly-immediately",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's $230 iPhone Pocket Sells Out Nearly Immediately",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T01:00:49.542407+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T00:10:00+00:00",
        "description": "\"Within the past year, stories have been posted on Slashdot about people helping North Koreans get remote IT jobs at U.S. corporations, companies knowingly assisting them, how not to hire a North Korean for a remote IT job, and how a simple question tripped up a North Korean applying for a remote IT job,\" writes longtime Slashdot reader smooth wombat. \"The FBI is even warning companies that North Koreans working remotely can steal source code and extort money from the company -- money that goes to fund the North Korean government. Now, five more people have plead guilty to knowingly helping North Koreans infiltrate U.S. companies as remote IT workers.\" TechCrunch reports: The five people are accused of working as \"facilitators\" who helped North Koreans get jobs by providing their own real identities, or false and stolen identities of more than a dozen U.S. nationals. The facilitators also hosted company-provided laptops in their homes across the U.S. to make it look like the North Kor",
        "id": 4073720,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/11/14/2143240/five-people-plead-quilty-to-helping-north-koreans-infiltrate-us-companies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Five People Plead Quilty To Helping North Koreans Infiltrate US Companies",
        "vote": 0
    }
]