[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T19:53:33.141536+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T19:00:16+00:00",
        "description": "This session recorded at Unreal Fest Orlando 2025 demonstrates the potential of Twinmotion to simplify your workflow and elevate your creative output. \n\nVisualization expert Sam Anderson discusses why Twinmotion stands out as a game-changing application—its user-friendly interface, expansive library, and compatibility with Unreal Engine enable creators to visualize projects in record time with future flexibility.\n\nThe session covers how Twinmotion stacks up with other visualization software such as V-Ray and Unreal Engine, and then deep-dives into the features that amplify the tool’s use with existing workflows. \n\nLearn how to use Twinmotion’s Library tools, import features, and advanced features such as action cameras to improve workflows for both visualizing projects in Twinmotion and porting to Unreal Engine for advanced interactivity.\n\nWhether you're new to 3D, a novice Twinmotion user, or looking for a visualization tool that's both powerful and efficient, this talk from ArchVisi",
        "id": 4078616,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=BnM5-BPdZns",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BnM5-BPdZns/hqdefault.jpg",
        "title": "Adopting Twinmotion for Smarter Solutions | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T17:52:37.504564+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T17:01:12+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Jim Piavis of Scaled Foundations shows how Open GRID utilizes Unreal Engine as the foundation for cloud-based AI model development, leveraging AirGen (formerly AirSim) for physics simulation and integrating with a large catalog of AI models. \n\nBy taking advantage of high-performance graphics, procedural rendering, and Nanite tesselation, Open GRID is able to provide a real-time, interactive simulation environment for robots and their sensors. The adaptation of AI models like object detection, segmentation, and visual navigation are then easily composed and integrated to perform macro-scale tasks that adapt to a changing environment.\n\nTopics covered in this talk will include the perceived gap between simulation and real-world performance; how closing this sim-to-real gap requires a continuum of risk reduction techniques; and how Scaled Foundations has used highly realistic virtual environments to demonstrate the deployment of robust",
        "id": 4077994,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=jf3L23H5niM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jf3L23H5niM/hqdefault.jpg",
        "title": "Closing the Sim-to-Real Gap with Unreal Engine | Unreal Fest Orlando 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-15T15:49:36.157692+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-15T15:00:28+00:00",
        "description": "In this session recorded at Unreal Fest Orlando 2025, Imerza showcases the real-time transformation of massive BIM models. \n\nThis presentation explores how Revit and Navisworks models are dynamically manipulated, animated, and optimized using real-world data sources like Primavera schedules, MySQL databases, and Excel datasets. \n\nWatch to learn best practices for preparing complex BIM data for real-time visualization—balancing performance with precision to create immersive, data-rich digital twins.\n\nTo find out more about Unreal Engine for architectural visualization, check out our website: unrealengine.com/uses/architecture\n\n#Imerza, #BIMModels, #Revit, #Navisworks, #DigitalTwins, #Archviz, #PrimaveraSchedules, #MySQLDatabases, #ExcelDatasets, #UnrealEngine, #UE5, #UnrealFestOrlando",
        "id": 4077239,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=H7UHMXJzNWc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/H7UHMXJzNWc/hqdefault.jpg",
        "title": "Dynamic Data-Driven Worlds: Transforming Massive BIM Models | Unreal Fest Orlando 2025",
        "vote": 0
    }
]