[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T23:07:20.361035+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T22:40:00+00:00",
        "description": "Amazon's Ring has announced a partnership with Flock Safety, the AI-powered camera network already used by ICE, the Secret Service, and other federal agencies. \"Now agencies that use Flock can request that Ring doorbell users share footage to help with 'evidence collection and investigative work,'\" reports TechCrunch. From the report: Flock cameras work by scanning the license plates and other identifying information about cars they see. Flock's government and police customers can also make natural language searches of their video footage to find people who match specific descriptions. However, AI-powered technology used by law enforcement has been proven to exacerbate racial biases. On the same day that Ring announced this partnership, 404 Media reported that ICE, the Secret Service, and the Navy had access to Flock's network of cameras. By partnering with Ring, Flock could potentially access footage from millions more cameras.<p><div class=\"share_submission\" style=\"position:relative",
        "id": 3840683,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/17/2039246/amazons-ring-partners-with-flock-a-network-of-ai-cameras-used-by-police",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon's Ring Partners With Flock, a Network of AI Cameras Used By Police",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T23:07:20.564529+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Texas is being sued by a Big Tech lobby group over the state's new law that will require app stores to verify users' ages and impose restrictions on users under 18. \"The Texas App Store Accountability Act imposes a broad censorship regime on the entire universe of mobile apps,\" the Computer &amp; Communications Industry Association (CCIA) said yesterday in a lawsuit (PDF). \"In a misguided attempt to protect minors, Texas has decided to require proof of age before anyone with a smartphone or tablet can download an app. Anyone under 18 must obtain parental consent for every app and in-app purchase they try to download -- from ebooks to email to entertainment.\"\n \nThe CCIA said in a press release that the law violates the First Amendment by imposing \"a sweeping age-verification, parental consent, and compelled speech regime on both app stores and app developers.\" When app stores determine that a user is under 18, \"the law prohibits th",
        "id": 3840684,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/17/2032236/big-tech-sues-texas-says-age-verification-law-is-broad-censorship-regime",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Big Tech Sues Texas, Says Age-Verification Law Is 'Broad Censorship Regime'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T23:07:20.698166+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T21:20:00+00:00",
        "description": "Plug-in hybrid electric vehicles (PHEVs) pump out nearly five times more planet-heating pollution than official figures show, a report has found. The Guardian: The cars, which can run on electric batteries as well as combustion engines, have been promoted by European carmakers as a way to cover long distances in a single drive -- unlike fully electric cars -- while still reducing emissions. \n\nData shows PHEVs emit just 19% less CO2 than petrol and diesel cars, an analysis by the non-profit advocacy group Transport and Environment found on Thursday. Under laboratory tests, they were assumed to be 75% less polluting. \n\nThe researchers analyzed data from the onboard fuel consumption meters of 800,000 cars registered in Europe between 2021 and 2023. They found real-world carbon dioxide emissions from PHEVs in 2023 were 4.9 times greater than those from standardized laboratory tests, having risen from being 3.5 times greater in 2021.<p><div class=\"share_submission\" style=\"position:relative",
        "id": 3840685,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/17/1948248/plug-in-hybrids-pollute-almost-as-much-as-petrol-cars-report-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Plug-in Hybrids Pollute Almost As Much As Petrol Cars, Report Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T23:07:20.861109+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T20:41:00+00:00",
        "description": "An anonymous reader shares a report: Cloud-computing firm Salesforce was hit with a proposed class action lawsuit by two authors who alleged the company used thousands of books without permission to train its AI software. Novelists Molly Tanzer and Jennifer Gilmore said in the complaint that Salesforce infringed copyrights by using their work to train its xGen AI models to process language.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Salesforce+Sued+By+Authors+Over+AI+Software%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F10%2F17%2F1944222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fyro.slashdot.org%2Fstory%2F25%2F10%2F17%2F1944222%2Fsalesforce-sued-by-authors-over-ai-software%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_ico",
        "id": 3840687,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/17/1944222/salesforce-sued-by-authors-over-ai-software",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Salesforce Sued By Authors Over AI Software",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T20:34:23.096183+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T20:01:00+00:00",
        "description": "An anonymous reader shares a report: Atari has announced yet another retro console revival, but this time it's launching hardware from an old competitor. \n\nAtari and Plaion, a company that develops, publishes, and distributes games, have collaborated on the new Intellivision Sprint that blends '80s console aesthetics with modern gaming conveniences. It's a new take on Mattel's Intellivision, which initially went head-to-head with the Atari 2600 when it was released in 1979. \n\nThe $150 Sprint looks a lot like the original Intellivision with a gold and black case and a wood-grain panel on the front, but there are a lot fewer cables. It connects to a TV using a single HDMI cable, and while it still includes two controllers featuring dials and number pads instead of joysticks, they're both wireless and charge when docked to the console.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Atari's+Resurrecting+the+Intellivisio",
        "id": 3839949,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/17/1910204/ataris-resurrecting-the-intellivision-one-of-its-biggest-competitors-in-the-80s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Atari's Resurrecting the Intellivision, One of Its Biggest Competitors in the '80s",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T20:34:23.218919+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T19:20:00+00:00",
        "description": "Foreign institutional investors have pulled nearly $30 billion from Indian equity markets over the past twelve months. A substantial portion of that capital moved to Korea and Taiwan. Foreign portfolio investor ownership in stocks listed on India's National Stock Exchange fell from 22.2% in September 2024 to 17.3% in May 2025. Taiwan absorbed $15 billion of net foreign inflows in the third quarter of 2025 alone. \n\nHSBC analysts say global investors increasingly view India through the lens of AI economics and are positioning the world's most populous nation as a global anti-AI play. India employs roughly 20 million people directly and indirectly in IT services. Services account for 55% of Indian gross domestic product. HSBC estimates digital AI agents cost approximately one-third as much as human agents for customer support and certain mid-office functions. Global tech giants will spend two trillion dollars on AI infrastructure between 2025 and 2030. India's AI Mission committed $1.25 ",
        "id": 3839950,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/17/197245/global-investors-position-india-as-anti-ai-play",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Global Investors Position India as Anti-AI Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T19:04:13.619432+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T18:40:00+00:00",
        "description": "Jason Allen has responded to critics who say he is not an artist by filing a new brief and announcing plans to sell oil-print reproductions of his AI-generated image. Allen won the Colorado State Fair Fine Arts Competition in 2022 after submitting Theatre D'opera Spatial, which Midjourney created. He said in a press release that being called an artist does not concern him but his work and expression do. \n\nAllen says he asked himself what could make the piece undeniably art and decided to create physical reproductions using technology. The reproductions employ a three-dimensional printing technique from a company called Arius that uses oil paints to simulate brushstrokes. Allen said the physical artifact is singular and real. His legal filing argues that he produced the artwork by providing hundreds of iterative text prompts to Midjourney and experimenting with over six hundred prompts before cropping and upscaling the final image. The U.S. Copyright Office has rejected his copyright a",
        "id": 3839336,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/17/1741256/creator-of-infamous-ai-painting-tells-court-hes-a-real-artist",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Creator of Infamous AI Painting Tells Court He's a Real Artist",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T19:04:13.742769+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T18:01:00+00:00",
        "description": "Backblaze has been tracking hard disk drive failures in its datacenter since 2013. The backup and cloud storage company's latest analysis of approximately 317,230 drives shows that peak failure rates have dropped dramatically and shifted much later in a drive's lifespan. Where the company once saw failure rates of 13.73% at around three years in 2013 and 14.24% at seven years and nine months in 2021, the current data shows a peak of just 4.25% at 10 years and three months. \n\nThis represents the first time the company has observed the highest failure rate occurring at the far end of the drive curve rather than earlier in its operational life, it said. The drives maintained relatively consistent failure rates through most of their use before spiking sharply near the end. The improvement amounts to roughly one-third of the previous peak failure rates.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=12+Years+of+HDD+Analy",
        "id": 3839337,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/17/1711228/12-years-of-hdd-analysis-brings-insight-to-the-bathtub-curves-reliability",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "12 Years of HDD Analysis Brings Insight To the Bathtub Curve's Reliability",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T17:32:24.012452+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T17:21:00+00:00",
        "description": "Instant coffee beat drip coffee in blind taste tests conducted by researchers at the Drexel Food Lab. Jonathan Deutsch and Rachel Sherman tested 84 participants across two rounds of tastings for The Guardian's Filter US newsletter. They first narrowed 24 instant coffee varieties to the best options. Those finalists then competed against drip coffees in a second test. 77% of participants preferred instant coffee over drip. The top-performing instant coffee was not from premium third-wave brands but a common grocery store variety. \n\nDeutsch compared the result to iconic products like Heinz ketchup and Reese's Peanut Butter Cups. Upscale interpretations of certain classic items often fail to surpass the originals, he said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Instant+Coffee+Beats+Drip+in+Blind+Taste+Tests%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F10%2F17%2F157201%2F%3Futm_source%3Dtwitter%26utm_medium",
        "id": 3838670,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/17/157201/instant-coffee-beats-drip-in-blind-taste-tests",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Instant Coffee Beats Drip in Blind Taste Tests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T17:32:24.112902+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T16:41:00+00:00",
        "description": "New York Gov. Kathy Hochul has signed into law legislation banning the use of price-fixing software by landlords to set rental rates. From a report: New York is the first state to outlaw algorithmic pricing by landlords, following a number of city-wide bans in Jersey City, Philadelphia, San Francisco, and Seattle. Software companies such as RealPage offer landlords algorithms that can set rental prices. \n\nThe software can also help determine the ideal number of people to live in a unit or the terms of a lease renewal. RealPage says it can help its clients \"optimize rents to achieve the overall highest yield, or combination of rent and occupancy, at each property.\" But the \"private data algorithms\" advertised by these software companies, Hochul says, cause the \"housing market distortion\" that harms renters \"during a historic housing supply and affordability crisis.\" \n\nNot only does the law outlaw setting rental terms with the software, it also says that any property owners who use the ",
        "id": 3838671,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/17/1627255/new-york-bans-ai-enabled-rent-price-fixing",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New York Bans AI-Enabled Rent Price Fixing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T16:07:41.644613+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T16:01:00+00:00",
        "description": "An anonymous reader shares a report: Samsung Electronics will unveil its highly-anticipated trifold smartphone when world leaders and global dignitaries gather at the Asia-Pacific Economic Cooperation summit in South Korea later this month. It will be the company's first device with two hinges -- allowing it to work as either a conventional smartphone or a significantly larger tablet when fully unfurled -- and will be displayed at an exhibition of cutting-edge Korean technology on the sidelines of the multilateral summit, according to a person familiar with the matter. \n\nFor Samsung, the Gyeongju-hosted APEC event will provide a global spotlight for a product it hopes will burnish its reputation as an engineering pioneer. Alongside Huawei, Samsung has led the move to develop foldable phones, and Huawei introduced the world's first trifold device in China last year. The Korean company now has the opportunity to take the form factor global.<p><div class=\"share_submission\" style=\"positio",
        "id": 3838008,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/10/17/1022235/samsung-to-showcase-its-first-ever-trifold-phone-later-this-month",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Samsung To Showcase Its First Ever Trifold Phone Later This Month",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T16:07:41.719756+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T15:20:00+00:00",
        "description": "Maj. Gen. William Taylor told reporters at the Association of the US Army Conference in Washington this week that he and the Eighth Army he commands out of South Korea are regularly using AI for decision-making. Taylor said he has been asking AI chatbots to help build models for personal decisions that affect his organization and overall readiness. The general referred to his chatbot companion as \"Chat\" and said the technology has been useful for predictive analysis in logistical planning and operational purposes.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Army+General+Says+He's+Using+AI+To+Improve+'Decision-Making'%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F10%2F17%2F1011256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F10%2F17%2F10",
        "id": 3838009,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/17/1011256/army-general-says-hes-using-ai-to-improve-decision-making",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Army General Says He's Using AI To Improve 'Decision-Making'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T16:07:41.792853+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T14:40:00+00:00",
        "description": "The Wikimedia Foundation, the nonprofit organization that hosts Wikipedia, says that it's seeing a significant decline in human traffic to the online encyclopedia because more people are getting the information that's on Wikipedia via generative AI chatbots that were trained on its articles and search engines that summarize them without actually clicking through to the site. 404 Media: The Wikimedia Foundation said that this poses a risk to the long term sustainability of Wikipedia. \"We welcome new ways for people to gain knowledge. However, AI chatbots, search engines, and social platforms that use Wikipedia content must encourage more visitors to Wikipedia, so that the free knowledge that so many people and platforms depend on can continue to flow Sustainably,\" the Foundation's Senior Director of Product Marshall Miller said in a blog post. \"With fewer visits to Wikipedia, fewer volunteers may grow and enrich the content, and fewer individual donors may support this work.\"<p><div cl",
        "id": 3838010,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/17/0931209/wikipedia-says-ai-is-causing-a-dangerous-decline-in-human-visitors",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wikipedia Says AI Is Causing a Dangerous Decline in Human Visitors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T14:44:33.415053+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T14:00:00+00:00",
        "description": "joshuark writes: Not all jobs are created equal, according to the new American Job Quality Study. The nationally representative survey of roughly 18,000 Americans finds that just 40% of U.S. workers hold \"quality jobs,\" \"Quality jobs\" are defined as roles with fair compensation, safe environments, growth opportunities, agency and manageable schedules. Quality jobs are linked to higher satisfaction and wellbeing, yet most U.S. workers face gaps in pay, advancement, scheduling and fairness. As former obsolete technology COM guru Don Box stated: COM sucks but pays my bucks. Now it sucks and no bucks.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Only+40%25+of+Workers+Have+High-Quality+Jobs%2C+Gallup+Finds%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F17%2F0836202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.faceb",
        "id": 3837034,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/17/0836202/only-40-of-workers-have-high-quality-jobs-gallup-finds",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Only 40% of Workers Have High-Quality Jobs, Gallup Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T14:44:33.534766+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from Heise: The European Commission has revised the Ecodesign requirements for external power supplies (EPS). The new rules aim to increase consumer convenience, resource efficiency, and energy efficiency. Manufacturers have three years to prepare for the changes. The new regulations apply to external power supplies that charge or power devices such as laptops, smartphones, Wi-Fi routers, and computer monitors. Starting in 2028, these products must meet higher energy efficiency standards and become more interoperable. Specifically, USB chargers on the EU market must have at least one USB Type-C port and function with detachable cables.\n \nWith the regulation, the EU is also establishing minimum requirements for the efficiency of power supplies with an output power of up to 240 watts that charge via USB Power Delivery (USB-PD), among other things, under other things, minimum requirements. Power supplies with an output power exceeding 10 watts will als",
        "id": 3837035,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/17/003211/eu-expands-usb-c-mandate-to-chargers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU Expands USB-C Mandate To Chargers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T14:44:33.666925+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T10:00:00+00:00",
        "description": "Physicists using SLAC's X-ray free-electron laser discovered two new laser phenomena that allowed them to generate the shortest, highest-energy X-ray pulses ever recorded (60-100 attoseconds). These breakthroughs could let scientists observe electron motion and chemical bond formation in real time. Physicists Uwe Bergmann and Thomas Linker write in an article for The Conversation: In this new study we used X-rays, which have 100 million times shorter wavelengths than microwaves and 100 million times more energy. This meant the resulting new X-ray laser pulses were split into different X-ray wavelengths corresponding to Rabi frequencies in the extreme ultraviolet region. Ultraviolet light has a frequency 100 million times higher than radio waves. This Rabi cycling effect allowed us to generate the shortest high-energy X-ray pulses to date, clocking in at 60-100 attoseconds.\n \nWhile the pulses that X-ray free-electron lasers currently generate allow researchers to observe atomic bonds f",
        "id": 3837036,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/16/2353220/physicists-inadvertently-generated-the-shortest-x-ray-pulses-ever-observed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Physicists Inadvertently Generated the Shortest X-Ray Pulses Ever Observed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T14:44:33.795007+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T07:00:00+00:00",
        "description": "fahrbot-bot shares a report from Popular Mechanics: [I]n a new study published in the journal Nature Materials, scientists from the Korea Research Institute of Standards and Science (KRISS) have now found yet another phase, appropriately named Ice XXI. At the heart of the experiment, scientists used diamond anvil cells (DACs) -- a common device used in materials science for squeezing samples under immense pressure -- to subject water to 2 gigapascals (20,000 times higher than normal atmosphere) of pressure in just 10 milliseconds.\n \nThe scientists call this kind of water \"supercompressed,\" and it's metastable, meaning it persists for a time even when another form of ice would be more stable. And because of the immense pressure, ice forms at room temperature but the molecules are much more densely packed. \"Rapid compression of water allows it to remain liquid up to higher pressures, where it should have already crystallized to ice VI,\" Geun Woo Lee, a co-author of the study from RISS, ",
        "id": 3837037,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/16/2342232/scientists-create-new-form-of-ice-known-as-ice-xxi",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Create New Form of Ice, Known As Ice XXI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T04:05:57.560764+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: I realize that, at this point, there are already far too many shows. Every channel, every streaming service is teeming with content demanding your attention, and there are simply too few hours in the day to watch them all. However, with that in mind, may I recommend a new show called Space Live? There's only one episode. The only potential downside is that the episode literally lasts for ever. Actually, that's inaccurate. Space Live isn't a show, it's a channel. It launched on Wednesday morning, tucked away on ITVX, and consists only of live footage of Earth broadcast from the International Space Station. It's beguiling to watch, especially for anyone who didn't realize that a person can be awestruck and bored simultaneously.\n \nIt's billed as a world first. ITV has partnered with British space media company Sen to use live 4K footage from its proprietary SpaceTV-1 video camera system, mounted on the International Space Station, gi",
        "id": 3834523,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/16/2255204/new-itvx-channel-streams-absolutely-spellbinding-footage-of-earth-forever",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New ITVX Channel Streams Absolutely Spellbinding Footage of Earth... Forever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T01:42:31.125652+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T01:30:00+00:00",
        "description": "Spotify has officially partnered with major record labels to create a \"responsible AI\" initiative aimed at developing generative music tools that supposedly benefit both artists and fans. While Spotify promises choice, transparency, and fair compensation, the vague announcement has many skeptics wondering if \"responsible AI\" is just another remix of old industry power plays set to a new algorithmic beat. The Verge reports: Spotify didn't detail any specific products in the works but said it was building a \"state-of-the-art generative AI research lab and product team focused on developing technologies that reflect our principles and create breakthrough experiences for fans and artists.\" Most of the press release is dedicated to vagaries and laying out the principles that will guide Spotify's generative AI projects: [partnerships with record labels, distributors, and music publishers; choice in participation; fair compensation and new revenue; and artist-fan connection.]<p><div class=\"s",
        "id": 3834051,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/16/2237225/spotify-says-its-working-with-labels-on-responsible-ai-music-tools",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Spotify Says It's Working With Labels On 'Responsible' AI Music Tools",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T01:42:31.207061+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T00:50:00+00:00",
        "description": "EA employees and the Communications Workers of America union have condemned the company's proposed $55 billion private acquisition -- backed by Saudi Arabia's Public Investment Fund and Jared Kushner's Affinity Partners, \"claiming they were not represented in the negotiations and any jobs lost as a result would 'be a choice, not a necessity, made to pad investors' pockets,\" reports Eurogamer. From the report: Following the announcement, there's been plenty of speculation around the future of EA and its multiple owned studios, split between EA Sports and EA Entertainment. Now, members of the United Videogame Workers union and the CWA have issued a formal response alongside a petition for regulators to scrutinize the deal. \"EA is not a struggling company,\" the statement reads. \"With annual revenues reaching $7.5 billion and $1 billion in profit each year, EA is one of the largest video game developers and publishers in the world.\"\n \nThis success has been driven by company workers, the u",
        "id": 3834052,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/16/2145217/video-game-union-workers-rally-against-55-billion-saudi-backed-private-acquisition-of-ea",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Video Game Union Workers Rally Against $55 Billion Saudi-Backed Private Acquisition of EA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-17T00:24:27.695805+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-17T00:10:00+00:00",
        "description": "Miami-Dade County is piloting a self-driving police car built by PolicingLab and powered by Perrone Robotics, equipped with 360-degree cameras, AI analytics, license plate readers, and even drone-launch capabilities. The Drive reports: \"Designed as a force multiplier, the PUG combines advanced autonomy from Perrone Robotics with AI-driven analytics, real-time crime data, and a suite of sensors including 360-degree cameras, thermal imaging, license plate recognition, and drone launch capabilities,\" [says the PolicingLab's announcement.] \"Its role: extend deputy resources, improve efficiency, and enhance community safety without additional cost to Miami-Dade taxpayers,\" it continued.\n \nFor starters, this is merely a pilot program being sponsored by PolicingLab, not a standard addition to the department's fleet. And second, at least initially, it's being soft-launched as a feeler for the Sheriff's public affairs folks. It'll be posted up at public and media events in order to \"gather fee",
        "id": 3833675,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/16/2120245/miami-is-testing-a-self-driving-police-car-that-can-launch-drones",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Miami Is Testing a Self-Driving Police Car That Can Launch Drones",
        "vote": 0
    }
]