[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T20:34:35.263797+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T20:00:09+00:00",
        "description": "Spirit of the North 2 seemingly contains all the ingredients for an emotionally compelling adventure. A nature-focused fantasy setting and a journey to cleanse the world seemed just the cream on top. Or so it would seem.\n\nThe first impression anyone will have, at least when playing on PS5, is the sheer amount of pop-in when trying to play in 60 frames per second. Throw in a hackneyed set-up and Spirit of the North 2 is off to a wobbly start. \n\nIts exploration offers some solace with Zelda-like tropes and some decently designed locations, but they're let down by a desolate world and tame puzzle-solving.\n\nIf that wasn't enough, the \"guided\" aspect of jumping hinders the platforming. Spirit of the North 2 has exceptional potential, but while patches could improve the visuals, it needs some serious rethinking in numerous other areas.",
        "id": 2648078,
        "language": null,
        "link": "https://www.youtube.com/watch?v=FNd8Lz4X3Dw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FNd8Lz4X3Dw/hqdefault.jpg",
        "title": "Spirit of the North 2 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T17:11:04.884293+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T16:00:04+00:00",
        "description": "Saber Interactive of Snowrunner and Mudrunner fame is rounding up work on Roadcraft, which is set to release for PC, PS5, and Xbox Series X/S on 20 May 2025. It’s a natural evolution of what came before, and it definitely has the potential to end up as one of the biggest surprise hits with its detailed simulation and gameplay variety. \n\nWith the simulation niche steadily growing in recent years, there is a sizeable fan base patiently awaiting its release. With this video, we will be taking a look at all the things that you need to know before buying Roadcraft - right from details about the gameplay to the various mechanics and everything in between.",
        "id": 2647179,
        "language": null,
        "link": "https://www.youtube.com/watch?v=0selbn-sBsQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/0selbn-sBsQ/hqdefault.jpg",
        "title": "RoadCraft - 14 THINGS You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T15:02:07.051341+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T14:01:32+00:00",
        "description": "Rockstar Games’ titles have always been known for their incredibly obsessive level of attention to detail, with each new game pushing the envelope visually and technically with the hardware and technology available to it. \n\nUnsurprisingly, it is looking like the upcoming and long anticipated Grand Theft Auto 6 will continue that tradition. Though the open world crime epic has been delayed by several months as many expected it would be, Rockstar did also recently release a new story and gameplay trailer for it- and as is usually the case with Rockstar trailers, it is packed full of tiny little details. \n\nHere, we’re going to go over a few such details.",
        "id": 2646421,
        "language": null,
        "link": "https://www.youtube.com/watch?v=xnjX5tGiAFs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xnjX5tGiAFs/hqdefault.jpg",
        "title": "GTA 6: 25 MIND-BLOWING Details That Will Melt Your Brain",
        "vote": 0
    }
]