[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T23:00:28.816198+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T22:14:00+00:00",
        "description": "Long-time Slashdot reader mbessey (a Mac/iOS developer) writes:\n\nAs we're coming up on the 50th anniversary of the first release of UCSD Pascal, I thought it would be interesting to poke around in it a bit, and work on some tools to bring this \"portable operating system\" back to life on modern hardware, in a modern language (Rust). \n\n\nWikipedia describes UCSD Pascal as \"a version that ran on a custom operating system that could be ported to different platforms. A key platform was the Apple II, where it saw widespread use as Apple Pascal. This led to Pascal becoming the primary high-level language used for development in the Apple Lisa, and later, the Macintosh. Parts of the original Macintosh operating system were hand-translated into Motorola 68000 assembly language from the Pascal source code.\" \n\nmbessey is chronicling their new project in a series of blog posts which begins here:\n\n\nThe p-System was not the first portable byte-code interpreter and compiler system &mdash; that idea g",
        "id": 2648760,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/05/10/2148230/developer-tries-resurrecting-47-year-old-apple-pascal-and-its-p-system-in-rust?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Developer Tries Resurrecting 47-Year-Old 'Apple Pascal' (and its p-System) in Rust",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T21:55:55.790473+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T21:14:00+00:00",
        "description": "Chungin Lee used ChatGPT to help write the essay that got him into Columbia University &mdash; and then \"proceeded to use generative artificial intelligence to cheat on nearly every assignment,\" reports New York magazine's blog Intelligencer:\n\nAs a computer-science major, he depended on AI for his introductory programming classes: \"I'd just dump the prompt into ChatGPT and hand in whatever it spat out.\" By his rough math, AI wrote 80 percent of every essay he turned in. \"At the end, I'd put on the finishing touches. I'd just insert 20 percent of my humanity, my voice, into it,\" Lee told me recently... When I asked him why he had gone through so much trouble to get to an Ivy League university only to off-load all of the learning to a robot, he said, \"It's the best place to meet your co-founder and your wife.\" \nHe eventually did meet a co-founder, and after three unpopular apps they found success by creating the \"ultimate cheat tool\" for remote coding interviews, according to the articl",
        "id": 2648487,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/10/2112201/is-everyone-using-ai-to-cheat-their-way-through-college?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is Everyone Using AI to Cheat Their Way Through College?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T19:46:02.757982+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T19:34:00+00:00",
        "description": "Though global sea levels \"varied little\" for the 2,000 years before the 20th century, CNN reports that sea levels then \"started rising and have not stopped since &mdash; and the pace is accelerating.\" \n\nAnd sea level rise \"was unexpectedly high last year, according to a recent NASA analysis of satellite data.\"\n\nMore concerning, however, is the longer-term trend. The rate of annual sea level rise has more than doubled over the past 30 years, resulting in the global sea level increasing 4 inches since 1993. \"It's like we're putting our foot on the gas pedal,\" said Benjamin Hamlington, a research scientist in the Sea Level and Ice Group at NASA's Jet Propulsion Laboratory. While other climate signals fluctuate, global sea level has a \"persistent rise,\" he told CNN. \n\nIt spells trouble for the future. Scientists have a good idea how much average sea level will rise by 2050 &mdash; around 6 inches globally, and as much as 10 to 12 inches in the US. Past 2050, however, things get very fuzzy",
        "id": 2647889,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/10/0830239/sea-levels-rose-faster-than-expected-last-year-blame-global-warming---but-what-happens-next?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sea Levels Rose Faster Than Expected Last Year. Blame Global Warming - But What Happens Next?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T19:46:02.918575+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T18:34:00+00:00",
        "description": "Inspired by researchers who'd bribed people to use Microsoft's Bing for two weeks (and found some wanted to keep using it), a Washington Post tech columnist also tried it &mdash; and reported it \"felt like quitting coffee.\" \n\n\"The first few days, I was jittery. I kept double searching on Google and DuckDuckGo, the non-Google web search engine I was using, to check if Google gave me better results. Sometimes it did. Mostly it didn't.\" \n\n\"More than two weeks into a test of whether I love Google search or if it's just a habit, I've stopped double checking. I don't have Google FOMO...\"\n\nI didn't do a fancy analysis into whether my search results were better with Google or DuckDuckGo, whose technology is partly powered by Bing. The researchers found our assessment of search quality is based on vibes. And the vibes with DuckDuckGo are perfectly fine. Many dozens of readers told me about their own satisfaction with non-Google searches... \n\nFor better or worse, DuckDuckGo is becoming a bit mo",
        "id": 2647890,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/10/0247242/i-broke-up-with-google-search-it-was-surprisingly-easy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'I Broke Up with Google Search. It was Surprisingly Easy.'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T18:42:04.398149+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T17:34:00+00:00",
        "description": "Long-time Slashdot reader smooth wombat writes: Over the past year there have been stories about North Korean spies unknowingly or knowingly being hired to work in western companies. During an interview by Kraken, a crypto exchange, the interviewers became suspicious about the candidate. Instead of cutting off the interview, Kraken decided to continue the candidate through the hiring process to gain more information. One simple question confirmed the user wasn't who they said they were and even worse, was a North Korean spy. \n\nWould-be IT worker \"Steven Smith\" already had an email address on a \"do-not-hire\" list from law enforcement agencies, according to CBS News. And an article in Fortune magazine says Kraken asked him to speak to a recruiter and take a technical-pretest, and \"I don't think he actually answered any questions that we asked him,\" according to its chief security officer Nick Percoco &mdash; even though the application was claiming 11 years of experience as a software e",
        "id": 2647600,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/10/0656226/how-a-simple-question-tripped-up-a-north-korean-spy-interviewing-for-an-it-job?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How A Simple Question Tripped Up a North Korean Spy Interviewing for an IT Job",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T17:36:08.592699+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T16:34:00+00:00",
        "description": "An anonymous reader shared this repost from the Washington Post:\n\nIt's becoming standard practice at a growing number of U.S. airports: When you reach the front of the security line, an agent asks you to step up to a machine that scans your face to check whether it matches the face on your identification card. Travelers have the right to opt out of the face scan and have the agent do a visual check instead &mdash; but many don't realize that's an option. \n\nSens. Jeff Merkley (D-Oregon) and John Neely Kennedy (R-Louisiana) think it should be the other way around. They plan to introduce a bipartisan bill that would make human ID checks the default, among other restrictions on how the Transportation Security Administration can use facial recognition technology. The Traveler Privacy Protection Act, shared with the Tech Brief on Wednesday ahead of its introduction, is a narrower version of a 2023 bill by the same name that would have banned the TSA's use of facial recognition altogether. T",
        "id": 2647295,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/10/0547237/more-us-airports-are-scanning-faces-but-a-new-bill-could-limit-the-practice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "More US Airports are Scanning Faces.  But a New Bill Could Limit the Practice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T16:32:04.093940+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T15:34:00+00:00",
        "description": "Adafruit's managing director Phillip Torrone is also long-time Slashdot reader ptorrone. \n\nHe stopped by Thursday to share what happened after a large portion of a recent import was subjected to a 125% +20% +25% import markup...\n\n\nWe're no stranger to tariff bills, although they have definitely ramped up over the last two months. However, this is our first \"big bill\"... Unlike other taxes like sales tax where we collect on behalf of the state and then submit it back at the end of the month &mdash; or income taxes, where we only pay if we are profitable &mdash; tariff taxes are paid before we sell any of the products. And they're due within a week of receipt, which has a big impact on cash flow.\n\n In this particular case, we're buying from a vendor, not a factory, so we can't second-source the items. (And these particular products we couldn't manufacture ourselves even if we wanted to, since the vendor has well-deserved IP protections). And the products were booked &amp; manufactured m",
        "id": 2646983,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/10/0715216/high-tariffs-become-real-for-adafruit---with-their-first-36k-bill-just-for-import-duties?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "High Tariffs Become 'Real' For Adafruit - With Their First $36K Bill Just For Import Duties",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T15:27:13.025232+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T14:34:00+00:00",
        "description": "Google will pay $1.4 billion to the state of Texas, reports the Associated Press, \"to settle claims the company collected users' data without permission, the state's attorney general announced Friday.\"\n\nAttorney General Ken Paxton described the settlement as sending a message to tech companies that he will not allow them to make money off of \"selling away our rights and freedoms.\" \n\"In Texas, Big Tech is not above the law.\" Paxton said in a statement. \"For years, Google secretly tracked people's movements, private searches, and even their voiceprints and facial geometry through their products and services. I fought back and won....\" \n\nThe state argued Google was \"unlawfully tracking and collecting users' private data.\" Paxton claimed, for example, that Google collected millions of biometric identifiers, including voiceprints and records of face geometry, through such products and services as Google Photos and Google Assistant.\n\n\n\nGoogle spokesperson Jos&eacute; Casta&ntilde;eda said t",
        "id": 2646550,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/10/0430217/google-will-pay-14-billion-to-texas-to-settle-claims-it-collected-user-data-without-permission?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Will Pay $1.4 Billion to Texas to Settle Claims It Collected User Data Without Permission",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T13:15:55.226030+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: Law enforcement authorities have dismantled a botnet that infected thousands of routers over the last 20 years to build two networks of residential proxies known as Anyproxy and 5socks. The U.S. Justice Department also indicted three Russian nationals (Alexey Viktorovich Chertkov, Kirill Vladimirovich Morozov, and Aleksandr Aleksandrovich Shishkin) and a Kazakhstani (Dmitriy Rubtsov) for their involvement in operating, maintaining, and profiting from these two illegal services.\n \nDuring this joint action dubbed 'Operation Moonlander,' U.S. authorities worked with prosecutors and investigators from the Dutch National Police, the Netherlands Public Prosecution Service (Openbaar Ministerie), and the Royal Thai Police, as well as analysts with Lumen Technologies' Black Lotus Labs. Court documents show that the now-dismantled botnet infected older wireless internet routers worldwide with malware since at least 2004, allowing unauth",
        "id": 2645809,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/09/2223226/police-dismantles-botnet-selling-hacked-routers-as-residential-proxies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Police Dismantles Botnet Selling Hacked Routers As Residential Proxies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T11:03:46.520931+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T10:00:00+00:00",
        "description": "joshuark shares a report from Axios: Bill Gates, once the richest man in the world, vowed to give away \"virtually all\" of his wealth through the Gates Foundation over the next two decades. Then, the foundation will close its doors on Dec. 31, 2045. [...] Gates wrote in a Thursday Gates Notes essay that the original plan was to sunset the foundation several decades after he and his then-wife died. Now, Gates believes that a \"shorter timeline\" is feasible.\n \nGates pledged three \"key aspirations\" to guide the foundation's funding over the next two decades, which center on promoting child and maternal health and fighting infectious diseases and poverty. He emphasized that progress is not possible without government cooperation, as the U.S. and other nations slash their foreign aid budgets. \"The reality is, we will not eradicate polio without funding from the United States,\" Gates wrote. It's unclear whether the world's richest countries will continue to stand up for its poorest people,\" G",
        "id": 2645173,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/09/2216249/bill-gates-plans-to-give-away-his-wealth-shutter-foundation-over-next-20-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bill Gates Plans To Give Away His Wealth, Shutter Foundation Over Next 20 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T07:48:44.747637+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T07:00:00+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Earth.com: McDermitt Caldera in Oregon is attracting attention for what could be one of the largest lithium deposits ever identified in the United States. Many view it as a potential boost for domestic battery production, while local communities voice concern over the impact on wildlife and cultural sites. The excitement stems from estimates that value the deposit at about $1.5 trillion. Some geologists say these ancient volcanic sediments could contain between 20 and 40 million metric tons of lithium. The study is published in the journal Minerals.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lithium+Deposit+Valued+At+%241.5+Trillion+Discovered+In+Oregon%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F05%2F09%2F2210247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http",
        "id": 2644385,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/09/2210247/lithium-deposit-valued-at-15-trillion-discovered-in-oregon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lithium Deposit Valued At $1.5 Trillion Discovered In Oregon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T04:33:23.213954+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Using AI can be a double-edged sword, according to new research from Duke University. While generative AI tools may boost productivity for some, they might also secretly damage your professional reputation. On Thursday, the Proceedings of the National Academy of Sciences (PNAS) published a study showing that employees who use AI tools like ChatGPT, Claude, and Gemini at work face negative judgments about their competence and motivation from colleagues and managers. \"Our findings reveal a dilemma for people considering adopting AI tools: Although AI can enhance productivity, its use carries social costs,\" write researchers Jessica A. Reif, Richard P. Larrick, and Jack B. Soll of Duke's Fuqua School of Business.\n \nThe Duke team conducted four experiments with over 4,400 participants to examine both anticipated and actual evaluations of AI tool users. Their findings, presented in a paper titled \"Evidence of a social evaluation penalt",
        "id": 2643810,
        "language": null,
        "link": "https://slashdot.org/story/25/05/09/225245/ai-use-damages-professional-reputation-study-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Use Damages Professional Reputation, Study Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T02:23:18.541458+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T01:25:00+00:00",
        "description": "Elizabeth Holmes has lost her bid to have the appeal of her 2022 fraud conviction reheard by the 9th Circuit Court of Appeals, leaving the U.S. Supreme Court as her final option. She and former Theranos executive Sunny Balwani remain liable for $452 million in restitution, while Holmes continues serving her 11-year sentence. CNBC reports: The 9th Circuit U.S. Court of Appeals denied Holmes' request for a rehearing before the original three-judge panel that upheld her conviction. At the same time, the court said no judge on the circuit court had asked for a vote on whether to have the full court rehear the appeal.\n \nHolmes, 41, was sentenced in January 2023 to 11 years and 3 months in prison after being found guilty of four counts of wire fraud in January 2022. She was found guilty of deceiving investors about the capabilities of Theranos, the blood-testing company she founded in 2003. The company crumbled after a Wall Street Journal story outlined the firm's struggles and shut down in",
        "id": 2643453,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/09/2149209/court-unanimously-denies-theranos-founder-elizabeth-holmes-request-for-rehearing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Court Unanimously Denies Theranos Founder Elizabeth Holmes' Request For Rehearing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T01:18:16.583143+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T00:45:00+00:00",
        "description": "Huawei has launched its first laptop running HarmonyOS instead of Windows, complete with AI features and support for over 2,000 mostly China-focused apps. The product is largely a result of U.S. sanctions that prevented U.S.-based companies like Google and Microsoft from doing business with Huawei, forcing the company to develop its own in-house solution. Liliputing reports: Early version of HarmonyOS were basically skinned version of Android, but over time Huawei has moved the two operating systems further apart and it now includes Huawei's own kernel, user interface, and other features. The version designed for laptops features a desktop-style operating system with a taskbar and dock on the bottom of the screen and support for multitasking by running multiple applications in movable, resizable windows.\n \nSince this is 2025, of course Huawei's demos also heavily emphasize AI features: the company showed how Celia, its AI assistant, can summarize documents, help prepare presentation s",
        "id": 2643240,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/09/2125208/huawei-unveils-a-harmonyos-laptop-its-first-windows-free-computer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Huawei Unveils a HarmonyOS Laptop, Its First Windows-Free Computer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-10T00:13:51.631455+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-10T00:02:00+00:00",
        "description": "Mexico has filed a lawsuit against Google for changing the name of the Gulf of Mexico to \"Gulf of America\" for U.S. users on Google Maps, following a Republican-led House vote on Thursday to codify the name change. President Claudia Sheinbaum argues the U.S. only has authority to rename its portion of the continental shelf and warned of legal action unless Google reversed the change. The Guardian reports: \"All we want is for the decree issued by the US government to be complied with,\" Sheinbaum said. \"The US government only calls the portion of the US continental shelf the Gulf of America, not the entire gulf, because it wouldn't have the authority to name the entire gulf,\" she added. In response to Trump, Sheinbaum has cheekily suggested calling the United States \"America Mexicana\" -- Mexican America, pointing to a map dating back to before 1848, when one-third of her country was seized by the United States.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashp",
        "id": 2642981,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/09/2119217/mexico-sues-google-over-changing-gulf-of-mexicos-name-for-us-users?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mexico Sues Google Over Changing Gulf of Mexico's Name For US Users",
        "vote": 0
    }
]