[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T22:58:24.133137+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T22:50:00+00:00",
        "description": "Qualcomm has entered the AI data center chip race with its new AI200 and AI250 accelerators, directly challenging Nvidia and AMD's dominance by promising lower power costs and high memory capacity. CNBC reports: The AI chips are a shift from Qualcomm, which has thus far focused on semiconductors for wireless connectivity and mobile devices, not massive data centers. Qualcomm said that both the AI200, which will go on sale in 2026, and the AI250, planned for 2027, can come in a system that fills up a full, liquid-cooled server rack. Qualcomm is matching Nvidia and AMD, which offer their graphics processing units, or GPUs, in full-rack systems that allow as many as 72 chips to act as one computer. AI labs need that computing power to run the most advanced models.\n \nQualcomm's data center chips are based on the AI parts in Qualcomm's smartphone chips called Hexagon neural processing units, or NPUs. \"We first wanted to prove ourselves in other domains, and once we built our strength over ",
        "id": 3918635,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/27/2030204/qualcomm-announces-ai-chips-to-compete-with-amd-and-nvidia",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Qualcomm Announces AI Chips To Compete With AMD and Nvidia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T22:58:24.461288+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T22:10:00+00:00",
        "description": "An anonymous reader quotes a report from Wired: As you're hunting through real estate listings for a new home in Franklin, Tennessee, you come across a vertical video showing off expansive rooms featuring a four-poster bed, a fully stocked wine cellar, and a soaking tub. In the corner of the video, a smiling real estate agent narrates the walk-through of your dream home in a soothing tone. It looks perfect -- maybe a little too perfect. The catch? Everything in the video isAI-generated. The real property is completely empty, and the luxury furniture is a product of virtual staging. The realtor's voice-over and expressions were born from text prompts. Even the camera's slow pan over each room is orchestrated by AI, because there was no actual video camera involved.\n \nAny real estate agent can create \"exactly that, at home, in minutes,\" says Alok Gupta, a former product manager at Facebook and software engineer at Snapchat who cofounded AutoReel, an app that allows realtors to turn imag",
        "id": 3918636,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/27/2026202/real-estate-is-entering-its-ai-slop-era",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Real Estate Is Entering Its AI Slop Era",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T21:51:59.174255+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T21:30:00+00:00",
        "description": "An anonymous reader shares a column: As the AI boom develops, consultants are in a tricky spot. The pandemic, inflation and economic uncertainty have encouraged many of their big clients to tighten expenditure. The U.S. government, one of the biggest spenders, has been cancelling multiple billion-dollar contracts in an effort to conserve cash. In March, 10 of the largest consultants including Deloitte, Accenture, Booz Allen Hamilton, IBM and Guidehouse were targeted by the Department of Government Efficiency to justify their fees. As a result, the largest listed players' shares have collapsed by up to 30% in the past two years, against the S&amp;P 500's 50% jump. \n\nAI is, in some respects, a boon. In September, Accenture said it had helped it cut 11,000 jobs, and CEO Julie Sweet is set to augment that with staff that cannot be retrained. Salesforce recently laid off 4000 customer support workers. Microsoft has halted hiring in its consulting business. Unfortunately, big clients are co",
        "id": 3918225,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/27/181215/ai-sets-up-kodak-moment-for-global-consultants",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'AI Sets Up Kodak Moment For Global Consultants'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T21:51:59.377697+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T20:51:00+00:00",
        "description": "Employees are using AI to generate fake expense receipts. Leading expense software platforms report a sharp increase in AI-created fraudulent documents following the launch of improved image generation models by OpenAI and Google. AppZen said fake AI receipts accounted for 14% of fraudulent documents submitted in September compared with none last year. Ramp flagged more than one million dollars in fraudulent invoices within 90 days. About 30% of financial professionals in the US and UK surveyed by Medius reported seeing a rise in falsified receipts after OpenAI released GPT-4o last year. \n\nSAP Concur processes more than 80 million compliance checks monthly and now warns customers to not trust their eyes. The receipts include wrinkles in paper, detailed itemization matching real menus and signatures. Creating fraudulent documents previously required photo editing skills or paying for such services. Free and accessible image generation software has made it possible for anyone to falsify",
        "id": 3918226,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/27/1829258/companies-battle-wave-of-ai-generated-fake-expense-receipts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Companies Battle Wave of AI-Generated Fake Expense Receipts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T20:36:45.201339+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T20:10:00+00:00",
        "description": "Microsoft's next Xbox console will run full Windows and allow users to exit the Xbox interface to access Steam, Epic Games Store, Battle.net, and other PC storefronts, according to Windows Central. The device will launch without a multiplayer paywall. Xbox CEO Phil Spencer told users last week to look at the Xbox Ally handheld for an indication of where Xbox is headed. The company has been using the Ally as a beta test to gather feedback on the experience that will power its next wave of console hardware. \n\nThe new Xbox will include the entire Xbox console library spanning original Xbox, Xbox 360, Xbox One, and Xbox Series X/S titles. These games will run natively and launch through the Xbox launcher's library. Users staying within the Xbox ecosystem will encounter an onboarding experience similar to current consoles. Those who choose to access Windows will be able to install PlayStation PC titles like God of War and Spider-Man purchased through Steam or Epic Games.<p><div class=\"shar",
        "id": 3917714,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/27/1824246/microsofts-next-xbox-will-run-full-windows-and-eliminate-multiplayer-paywall-report-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft's Next Xbox Will Run Full Windows and Eliminate Multiplayer Paywall, Report Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T20:36:45.344273+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T19:30:00+00:00",
        "description": "Many modern living rooms are now dominated by a huge television, but researchers say there might be little point in plumping for an ultra-high-definition model. From a report: Scientists at the University of Cambridge and Meta, the company that owns Facebook, have found that for an average-sized living room a 4K or 8K screen offers no noticeable benefit over a similarly sized 2K screen of the sort often used in computer monitors and laptops. In other words, there is no tangible difference when it comes to how sharp an image appears to our eyes. \n\n\"At a certain viewing distance, it doesn't matter how many pixels you add. It's just, I suppose, wasteful because your eye can't really detect it,\" said Dr Maliha Ashraf, the first author of the study from the University of Cambridge. Ashraf and colleagues, writing in the journal Nature Communications, report how they set about determining the resolution limit of the human eye, noting that while 20/20 vision implies the eye can distinguish 60",
        "id": 3917715,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/27/1821210/4k-or-8k-tvs-offer-no-distinguishable-benefit-over-similarly-sized-2k-screen-in-average-living-room-scientists-say",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "4K or 8K TVs Offer No Distinguishable Benefit Over Similarly Sized 2K Screen in Average Living Room, Scientists Say",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T19:22:34.404966+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T18:52:00+00:00",
        "description": "Amazon is planning to cut as many as 30,000 corporate jobs beginning Tuesday, as the company works to pare expenses and compensate for overhiring during the peak demand of the pandemic, Reuters reported Monday, citing sources familiar with the matter. From the report: The figure represents a small percentage of Amazon's 1.55 million total employees, but nearly 10% of the company's roughly 350,000 corporate employees. This would represent the largest job cut at Amazon since around 27,000 jobs were eliminated starting in late 2022.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Plans+To+Cut+As+Many+As+30%2C000+Corporate+Jobs+Beginning+Tomorrow%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F27%2F1852239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%",
        "id": 3917129,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/27/1852239/amazon-plans-to-cut-as-many-as-30000-corporate-jobs-beginning-tomorrow",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Plans To Cut As Many As 30,000 Corporate Jobs Beginning Tomorrow",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T19:22:34.505684+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T18:10:00+00:00",
        "description": "Mathematicians have identified the first shape that cannot pass through itself. Jakob Steininger and Sergey Yurkevich described the Noperthedron in a paper posted online in August. The shape has 90 vertices and 152 faces. The discovery resolves a question that began in the late 1600s when Prince Rupert of the Rhine won a bet by proving one cube could slide through a tunnel bored through another. Mathematician John Wallis confirmed this mathematically in 1693. \n\nThe property became known as the Rupert property. In 1968, Christoph Scriba proved the tetrahedron and octahedron also possess this quality. Over the past decade, researchers found Rupert tunnels through many symmetric polyhedra, including the dodecahedron and icosahedron. Mathematicians had conjectured every convex polyhedron would have the Rupert property. Steininger and Yurkevich divided the space of possible orientations into approximately 18 million blocks and tested each. None produced a passage. The Noperthedron consists",
        "id": 3917130,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/27/1749229/first-shape-found-that-cant-pass-through-itself",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "First Shape Found That Can't Pass Through Itself",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T18:02:01.813349+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T17:33:00+00:00",
        "description": "Apple is moving ahead with plans to bring advertising to its Maps app. Starting next year, businesses will be able to pay for more prominent placement within search results, according to Bloomberg [non-paywalled source]. The approach mirrors Search Ads in the App Store, where developers purchase promoted slots based on user queries. Apple has said the sponsored results will remain relevant to searches.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Moving+Ahead+With+Plans+To+Bring+Ads+in+Maps+App%2C+Report+Says%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F10%2F27%2F1743217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F10%2F27%2F1743217%2Fapple-moving-ahead-with-plans-to-bring-ads-in-maps-app-report-says%3Futm_source%3Dslashdot%26ut",
        "id": 3916445,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/27/1743217/apple-moving-ahead-with-plans-to-bring-ads-in-maps-app-report-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Moving Ahead With Plans To Bring Ads in Maps App, Report Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T18:02:01.970774+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T16:52:00+00:00",
        "description": "Finland's fertility rate has dropped below 1.3 children per woman, the lowest among Nordic countries and far beneath the 2.1 replacement level needed to maintain a steady population. The rate has declined by a third since 2010. Kela, Finland's social insurance agency, started distributing 2025 \"baby boxes\" -- filled with clothing and other infant supplies -- in August instead of spring because so many 2024 boxes remained unclaimed. \n\nMore parents now choose cash payments over the traditional boxes filled with infant supplies. The decline puzzles researchers because Finland offers paid parental leave for both mothers and fathers, subsidized childcare and national healthcare. Anneli Miettinen, Kela's research manager, said that good family policies no longer explain birth rates in Nordic countries. Immigration has offset some population loss, but officials worry about workforce shrinkage and pension system strain. \n\nAnna Rotkirch, who authored a government-commissioned report, found tha",
        "id": 3916446,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/27/1653231/finnish-fertility-rate-drops-by-a-third-since-2010",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Finnish Fertility Rate Drops by a Third Since 2010",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T16:50:00.209967+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T16:10:00+00:00",
        "description": "Australia's competition regulator sued Microsoft today, accusing it of misleading millions of customers into paying higher prices for its Microsoft 365 software after bundling it with AI tool Copilot. From a report: The Australian Competition and Consumer Commission alleged that from October 2024, the technology giant misled about 2.7 million customers by suggesting they had to move to higher-priced Microsoft 365 personal and family plans that included Copilot. \n\nAfter the integration of Copilot, the annual subscription price of the Microsoft 365 personal plan increased by 45% to A$159 ($103.32) and the price of the family plan increased by 29% to A$179, the ACCC said. The regulator said Microsoft failed to clearly tell users that a cheaper \"classic\" plan without Copilot was still available.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Australia+Sues+Microsoft+Over+AI-linked+Subscription+Price+Hikes%3A+https%3A%2F",
        "id": 3915713,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/27/1540239/australia-sues-microsoft-over-ai-linked-subscription-price-hikes",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Australia Sues Microsoft Over AI-linked Subscription Price Hikes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T16:50:00.427872+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T15:30:00+00:00",
        "description": "The U.S. has formed a $1 billion partnership with AMD to construct two supercomputers that will tackle large scientific problems ranging from nuclear power to cancer treatments to national security, said Energy Secretary Chris Wright and AMD CEO Lisa Su. From a report: The U.S. is building the two machines to ensure the country has enough supercomputers to run increasingly complex experiments that require harnessing enormous amounts of data-crunching capability. The machines can accelerate the process of making scientific discoveries in areas the U.S. is focused on. \n\nEnergy Secretary Wright said the systems would \"supercharge\" advances in nuclear power and fusion energy, technologies for defense and national security, and the development of drugs. Scientists and companies are trying to replicate fusion, the reaction that fuels the sun, by jamming light atoms in a plasma gas under intense heat and pressure to release massive amounts of energy. \"We've made great progress, but plasmas a",
        "id": 3915714,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/27/1526208/us-department-of-energy-forms-1-billion-supercomputer-and-ai-partnership-with-amd",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Department of Energy Forms $1 Billion Supercomputer and AI Partnership With AMD",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T16:50:00.649519+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T15:07:00+00:00",
        "description": "Countries signed their first UN treaty targeting cybercrime in Hanoi on Saturday, despite opposition from an unlikely band of tech companies and rights groups warning of expanded state surveillance. From a report: The new global legal framework aims to strengthen international cooperation to fight digital crimes, from child pornography to transnational cyberscams and money laundering. More than 60 countries were seen to sign the declaration Saturday, which means it will go into force once ratified by those states. UN Secretary General Antonio Guterres described the signing as an \"important milestone\", but that it was \"only the beginning\". \n\n\"Every day, sophisticated scams, destroy families, steal migrants and drain billions of dollars from our economy... We need a strong, connected global response,\" he said at the opening ceremony in Vietnam's capital on Saturday. The UN Convention against Cybercrime was first proposed by Russian diplomats in 2017, and approved by consensus last year ",
        "id": 3915715,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/27/157252/more-than-60-un-members-sign-cybercrime-treaty-opposed-by-rights-groups",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Than 60 UN Members Sign Cybercrime Treaty Opposed By Rights Groups",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T14:37:32.326326+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T14:01:00+00:00",
        "description": "Electronic Arts has spent the past year pushing its nearly 15,000 employees to use AI for everything from code generation to scripting difficult conversations about pay. Employees in some areas must complete multiple AI training courses and use tools like the company's in-house chatbot ReefGPT daily. \n\nThe tools produce flawed code and hallucinations that employees then spend time correcting. Staff say the AI creates more work rather than less, according to Business Insider. They fix mistakes while simultaneously training the programs on their own work. Creative employees fear the technology will eventually eliminate demand for character artists and level designers. One recently laid-off senior quality-assurance designer says AI performed a key part of his job -- reviewing and summarizing feedback from hundreds of play testers. He suspects this contributed to his termination when about 100 colleagues were let go this past spring from the company's Respawn Entertainment studio.<p><div ",
        "id": 3914686,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/27/1316249/electronic-arts-ai-tools-are-creating-more-work-than-they-save",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Electronic Arts' AI Tools Are Creating More Work Than They Save",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T12:03:39.447451+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T11:34:00+00:00",
        "description": "OpenAI's rival Anthropic has a different approach &mdash; and \"a clearer path to making a sustainable business out of AI,\"\nwrites the Wall Street Journal.\n\n\n\nOutside of OpenAI's close partnership with Microsoft, which integrates OpenAI's models into Microsoft's software products, OpenAI mostly caters to the mass market... which has helped OpenAI reach an annual revenue run rate of around $13 billion, around 30% of which it says comes from businesses. \n\nAnthropic has generated much less mass-market appeal. The company has said about 80% of its revenue comes from corporate customers. Last month it said it had some 300,000 of them... Its cutting-edge Claude language models have been praised for their aptitude in coding: A July report from Menlo Ventures &mdash; which has invested in Anthropic &mdash; estimated via a survey that Anthropic had a 42% market share for coding, compared with OpenAI's 21%. Anthropic is also now ahead of OpenAI in market share for overarching corporate AI use, M",
        "id": 3913389,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/27/0152229/openais-less-flashy-rival-might-have-a-better-business-model",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's Less-Flashy Rival Might Have a Better Business Model",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T08:30:54.627375+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T07:34:00+00:00",
        "description": "\"Mozilla is introducing a new privacy framework for Firefox extensions that will require developers to disclose whether their add-ons collect or transmit user data...\" reports the blog Linuxiac:\n\nThe policy takes effect on November 3, 2025, and applies to all new Firefox extensions submitted to addons.mozilla.org. According to Mozilla's announcement, extension developers must now include a new key in their manifest.json files. This key specifies whether an extension gathers any personal data. Even extensions that collect nothing must explicitly state \"none\" in this field to confirm that no data is being collected or shared. \n\nThis information will be visible to users at multiple points: during the installation prompt, on the extension's listing page on addons.mozilla.org, and in the Permissions and Data section of Firefox's about:addons page. In practice, this means users will be able to see at a glance whether a new extension collects any data before they install it.<p><div class=\"sh",
        "id": 3912119,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/27/0359250/mozilla-to-require-data-collection-disclosure-in-all-new-firefox-extensions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mozilla to Require Data-Collection Disclosure in All New Firefox Extensions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T04:56:18.050370+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T04:34:00+00:00",
        "description": "Slashdot reader joshuark writes: Microsoft says that the File Explorer (formerly Windows Explorer) now automatically blocks previews for files downloaded from the Internet to block credential theft attacks via malicious documents, according to a report from BleepingComputer. This attack vector is particularly concerning because it requires no user interaction beyond selecting a file to preview and removes the need to trick a target into actually opening or executing it on their system. \n\nFor most users, no action is required since the protection is enabled automatically with the October 2025 security update, and existing workflows remain unaffected unless you regularly preview downloaded files. \"This change is designed to enhance security by preventing a vulnerability that could leak NTLM hashes when users preview potentially unsafe files,\" Microsoft says in a support document published Wednesday.\n\n It is important to note that this may not take effect immediately and could require si",
        "id": 3911286,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/27/0314221/microsoft-disables-preview-in-file-explorer-to-block-attacks",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Disables Preview In File Explorer To Block Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T02:41:37.233381+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T01:34:00+00:00",
        "description": "America's largest university system, with 460,000 students, is the 22-campus \"Cal State\" system, reports the New York Times. And it's recently teamed with Amazon, OpenAI and Nvidia, hoping to embed chatbots in both teaching and learning to become what it says will be America's \"first and largest AI-empowered\" university\" &mdash; and prepare students for \"increasingly AI-driven\" careers. \n\n\nIt's part of a trend of major universities inviting tech companies into \"a much bigger role as education thought partners, AI instructors and curriculum providers,\" argues the New York Times, where \"dominant tech companies are now helping to steer what an entire generation of students learn about AI, and how they use it &mdash; with little rigorous evidence of educational benefits and mounting concerns that chatbots are spreading misinformation and eroding critical thinking...\" \n\n\"Critics say Silicon Valley's effort to make AI chatbots integral to education amounts to a mass experiment on young peop",
        "id": 3910871,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/27/0112204/california-colleges-test-ai-partnerships-critics-complain-its-risky-and-wasteful",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California Colleges Test AI Partnerships. Critics Complain It's Risky and Wasteful",
        "vote": 0
    }
]