[
    {
        "age": null,
        "album": "",
        "author": "China Insights",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T23:29:26.696896+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T22:30:09+00:00",
        "description": "As the CCP’s Fourth Plenum has just concluded, Beijing’s upper echelons are again convulsed by turmoil. Wang Renhua, secretary of the CMC Political and Legal Affairs Commission, was quietly removed; on the rostrum, an eight-second shot of Zhang Youxia ignited political speculation; and former Central Party School professor Cai Xia’s latest revelations further expose the inside story that Miao Hua and He Weidong built a “private army” for Xi Jinping. This purge may only be the beginning of a new round of power realignment. Don’t miss the next drop—subscribe and hit the bell.\nWelcome to China Insights — your window into the real China, beyond the veil.\nWith sharp analysis and a touch of dry humor, we dive into the social unrest, economic crises, censorship, faith suppression, and human rights challenges shaping China today.\nWe spotlight authentic Chinese culture, deliver timely and uncensored news, break down key economic trends, and explore shifting social dynamics — all while exposing",
        "id": 3918729,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=j7c-kTT7WA8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 68,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCwjvvgGX6oby5mZ3gbDe8Ug",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/j7c-kTT7WA8/hqdefault.jpg",
        "title": "Post-Plenum Shake-Up: General Purged",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "China Insights",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-27T17:20:07.645738+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-27T16:38:53+00:00",
        "description": "“Great heavens, save our Yu Menglong!”—this heart-wrenching cry from his mother shook the internet, leaving countless people devastated. As her wail still echoed, a chilling voice came through a walkie-talkie: two words, “Yi Yang.” After eight years of never going live, Yi Yang Qianxi suddenly appeared, silently stacking stones throughout the stream—what was this, a coincidence or a coded message? Yu Menglong’s mentor, Sun Derong, received a menacing threat warning of “October 25th as his D-day,” yet he defiantly responded, refusing to back down. Netizens worldwide have raised blank sheets of paper, demanding justice for Yu Menglong. This is no longer just a tragedy in the entertainment industry; it’s a battle about truth, fear, and courage. Don’t miss the next revelation—subscribe and hit the bell.\nWelcome to China Insights — your window into the real China, beyond the veil.\nWith sharp analysis and a touch of dry humor, we dive into the social unrest, economic crises, censorship, fai",
        "id": 3915926,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=X4fCXhBae64",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 68,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCwjvvgGX6oby5mZ3gbDe8Ug",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/X4fCXhBae64/hqdefault.jpg",
        "title": "Ghost Signal: “Yiyang” — A Mother’s Cry, Global White-Paper Protest",
        "vote": 0
    }
]