[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-18T16:27:14.948106+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-18T16:00:37+00:00",
        "description": "Techland's Dying Light: The Beast is going to be a fun survival-horror experience to both franchise debutants and veterans alike. It blends everything that is good about the Dying Light franchise with interesting new touches that make for a very unique gameplay loop, while its story remains quite interesting and can make you very curious to see what the next chapter of Kyle Crane's latest adventure has in store for him.\n\nThis is a game that has been crafted with a lot of love from its developers, and it shows. The Castor Woods are sure to keep you exploring away till the sun goes down and then some from the moment you're let loose in them. \n\nJust keep an eye on your wristwatch and watch out for the Volatiles!",
        "id": 3607839,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=IDGoMh7T5uY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IDGoMh7T5uY/hqdefault.jpg",
        "title": "Dying Light: The Beast Review - Kyle Crane Is Back WITH A BANG",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-18T14:03:22.378893+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-18T13:02:00+00:00",
        "description": "Sonic Racing: CrossWorlds doesn’t just redefine the series, it finally gives Sonic a kart racer with its own identity. By embracing speed, strategy, and pure chaos, Sonic Team has built a game that feels unmistakably “Sonic” rather than simply chasing Mario Kart’s tail. \n\nIt’s a racer I can see myself returning to for months, whether I’m shaving milliseconds off time trials, building ridiculous new gadget setups, or squinting through another round of Race Park mayhem.",
        "id": 3606472,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=tSYirsIBeao",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tSYirsIBeao/hqdefault.jpg",
        "title": "Sonic Racing: CrossWorlds Review - The Most Complete Sonic Racer To Date",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-18T11:52:25.411015+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-18T10:45:01+00:00",
        "description": "Silent Hill f is all set to scare and enthrall us in equal measures once it hits the shelves next week. But what has made it such an enticing title aside from its obvious history in modern gaming's survival horror genre. Can Konami and NeoBards collaboration and ambitious new ideas bring the franchise to life on current-gen platforms?\n\nWe believe that there is certainly potential to do so. There are a lot of factors that the two studios have ensured work in the game's favor, sustaining what made the franchise great in the first place while also adding some very creative new flourishes that could bring the long-dormant series back into the competitive spotlight of modern gaming (not counting last year's Silent Hill 2 Remake).  \n\nWe take a look at some of them, and how they could achieve what the game is setting out to do.",
        "id": 3605433,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Juy9yea-A70",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Juy9yea-A70/hqdefault.jpg",
        "title": "Silent Hill F Doesn’t Care If You’re Ready - IT WANTS YOU BROKEN",
        "vote": 0
    }
]