[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T20:25:56.017904+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T19:30:00+00:00",
        "description": "In 2016, there was the Slayer, and it made for good times. Not for the minions of Hell-infested Mars in id Software's sequel/soft reboot to its legendary first-person shooter series. But the fun didn't stop as it returned to the series' roots and offered fast-paced, brutal combat with minimal fuss. Such was the success of the new Glory Kills that other shooters tried – and most failed – to emulate the same.\n\nHowever, it didn't all truly begin here. DOOM (2016) offers some deceptively deep lore and confirms what some had suspected – that the Slayer wasn't a brand-new entity. Instead, he has ties to the first human to truly square up against the demonic forces: The Doom Marine.\n\nWith DOOM: The Dark Ages launching this May and exploring the origins of the Doom Slayer in a demonic medieval setting, it's a good time to familiarize yourself with the beginning. Who was the Doom Marine? How did he become the Doom Slayer? What is the connection between the classic Doom series and the post-2016",
        "id": 2592145,
        "language": null,
        "link": "https://www.youtube.com/watch?v=-rVqF3LGtRA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-rVqF3LGtRA/hqdefault.jpg",
        "title": "What Happened In DOOM 1, 2 & 64? - Full Story (Part 1) - Before You Play DOOM: The Dark Ages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T15:04:32.849401+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T14:01:30+00:00",
        "description": "Even before it received a remaster, The Elder Scrolls 4: Oblivion was a massive role-playing game with so many noteworthy secrets, references, and discoveries that fans were still unearthing years after launch. All this carries over into Oblivion Remastered, and they're just as worth pursuing as anything else.\n\nFor example, did you know that Frodo Baggins is referenced at some point alongside The One Ring? Or there's a unicorn you can use as a mount? How about the fact that enemy factions can stop attacking and even become somewhat friendly towards you? Don't forget about venturing to the signature Bethesda dev room and accessing all the content.\n\nIf that wasn't enough, you also discover the likes of Todd Howard as an NPC or Fortify stats like Acrobatics and Speed multiple times over to become super fast. Check out several other things you didn't know were possible in The Elder Scrolls 4: Oblivion Remastered.",
        "id": 2590497,
        "language": null,
        "link": "https://www.youtube.com/watch?v=y1r78xJQhNU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/y1r78xJQhNU/hqdefault.jpg",
        "title": "The Elder Scrolls 4: Oblivion Remastered - 15 Things YOU DIDN'T KNOW You Could Do",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T10:40:57.389829+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T10:01:01+00:00",
        "description": "The Nintendo Switch was a much-needed success for the Japanese gaming giant, especially after the drastic failure of the Wii U. The hybrid gaming console proved to be extremely popular among fans, selling well over 100 million units and enduring a 7-year-long lifecycle despite the weak hardware.\n\nAfter tons of rumors and speculation, we finally have confirmation that a Switch 2 is indeed real and coming this June. The first details about the console have officially dropped, which gives us an opportunity to make a comparison about what’s in store this time around and what came before.\n\nWith this video, we will be looking at each individual aspect ranging from CPU to GPU and memory, in both docked and mobile modes and compare it with the original Switch.",
        "id": 2589111,
        "language": null,
        "link": "https://www.youtube.com/watch?v=_NQy-xddgkM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_NQy-xddgkM/hqdefault.jpg",
        "title": "Switch 2 vs Switch 1 - SPECS COMPARISON - How Powerful Is The Switch 2?",
        "vote": 0
    }
]