[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T22:52:21.692829+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T22:52:21+00:00",
        "description": "Long-time Slashdot reader AmiMoJo shares an article from Renewables Now: Chinese tech company Leapting has successfully completed its first commercial deployment of photovoltaic (PV) modules with an AI-driven solar module mounting robot in Australia. The Chinese company was tasked with supporting the installation of French Neoen's (EPA:NEOEN) 350-MW/440-MWp Culcairn Solar Farm in New South Wales' Riverina region. Shanghai-based Leapting said this week that its intelligent robot has installed almost 10,000 modules at an \"efficient, safe, and stable\" pace that has \"significantly\" reduced the original construction timeline. Litian Intelligent was deployed at the Australian project site in early February. The machine has a 2.5-metre-high robotic arm sitting on a self-guided, self-propelled crawler. Equipped with a navigation system, and visual recognition technology, it can lift and mount PV panels weighing up to 30 kilograms. By replacing labour-intensive manual operations, the robot sho",
        "id": 2592838,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/05/03/198214/ai-driven-robot-installs-nearly-10000-solar-modules-in-australia?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI-Driven Robot Installs Nearly 10,000 Solar Modules in Australia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T21:48:21.581584+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T21:48:21+00:00",
        "description": "\"Researchers have created the first laboratory analog of the 'black hole bomb',\" reports ScienceAlert, \"a theoretical concept developed by physicists in the 1970s...\" \n\nThere's no black hole involved; their experiment just simulates the \"electromagnetic analogue\" of the theoretical concept &mdash; the \"exponential runaway amplification of spontaneously generated electromagnetic modes.\" \n\nOr, as ScienceAlert puts it, \"It doesn't, just to set your mind at ease, pose any danger. It consists of a rotating aluminum cylinder, placed inside layers of coils that generate magnetic fields that rotate around it, at controllable speeds.\"\n\nAs Roger Penrose proposed in 1971, the powerful rotational energy of a spinning black hole could be used to amplify the energy of nearby particles. Then, physicist Yakov Zel'Dovich figured out that you didn't need a black hole to see this phenomenon in action. An axially symmetrical body rotating in a resonance chamber, he figured, could produce the same energy ",
        "id": 2592553,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/03/2018249/scientists-simulate-first-ever-black-hole-bomb-laboratory-analog?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Simulate First-Ever 'Black Hole Bomb' Laboratory Analog",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T21:48:21.709038+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T21:48:21+00:00",
        "description": "Long-time Slashdot reader piojo writes: Tim Friede, Wisconsin man, has been injecting himself with snake venom for 18 years to gain protection from his pet snakes. The antibodies he developed have formed two components of a three-part antivenom, which gives partial or total protection against 18 of 19 species of venomous snakes that were tested. Notably, the antivenom is ineffective against vipers. \n\nFrom Australia's public broadcaster ABC:\n\nThe team's results have been published today in the journal Cell... The new antivenom described in the study is very different to traditional antivenoms, according to Peter Kwong, a biochemist at Columbia University and one of the study's authors. \n\nThe scientists call their new antivenom \"unparallel,\" according to the BBC, though the snake enthusiast (a former truck mechanic) had \"initially wanted to build up his immunity to protect himself when handling snakes, documenting his exploits on YouTube.\"\n\n\nThe team is trying to refine the antibodies f",
        "id": 2592554,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/03/2040208/unparalleled-snake-antivenom-made-with-antibodies-from-a-man-bitten-200-times?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Unparalleled' Snake Antivenom Made With Antibodies From a Man Bitten 200 Times",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T19:38:32.790780+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T19:38:32+00:00",
        "description": "America's federal government \"is a veritable cosmos of information, made up of constellations of databases,\" warns the Atlantic. The FBI \"has a facial-recognition apparatus capable of matching people against more than 640 million photos &mdash; a database made up of driver's license and passport photos, as well as mug shots. The Homeland Security department holds data \"about the movements of every person who travels by air commercially\". America's Drug Enforcement Administration \"tracks license plates scanned on American roads.\" And there's also every taxpayer's finance and employment history...\"\nGovernment agencies including the IRS, the FBI, DHS, and the Department of Defense have all purchased cellphone-location data, and possibly collected them too, via secretive groups such as the National Geospatial-Intelligence Agency. That means the government has at least some ability to map or re-create the past everyday movements of some American citizens. \nBut now the information at indivi",
        "id": 2591993,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/03/1844236/the-atlantic-warns-combining-us-government-databases-could-create-a-panopticon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Atlantic Warns Combining US Government Databases Could Create a 'Panopticon'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T19:38:32.907010+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T19:38:32+00:00",
        "description": "Threads has now grown to over 350 million monthly active users, reports TechCrunch, citing Mark Zuckerberg's comments on a company earnings call. That means Threads grew by 9.4% in roughly 90 days:\n\n\nThat's an increase of 30 million users since the prior quarter, where Meta reported that Threads had 320 million users. The new figure represents increased growth, as Threads added 30 million in the first quarter of this year, compared with 20 million in Q4 2024. \n\nIt's also worth noting that in a single quarter, Threads added nearly the same number of users to its network as one of its newer competitors, Bluesky. The latter, a decentralized social app, today has roughly 35 million users.\n \nZuckerberg also said there's been a 35% increase in time spent on Threads, according to the article, as a result of improvements to its recommendations systems.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Threads+Jumps+to+350+Mill",
        "id": 2591994,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/03/0546227/threads-jumps-to-350-million-adding-30-million-users-in-three-months?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Threads Jumps to 350 Million, Adding 30 Million Users in Three Months",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T18:33:22.716432+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T18:33:22+00:00",
        "description": "May is Maintainer Month: Celebrating those who secure Open Source\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@\nThe Open Source Initiative is joining \"a global community of contributors\" for GitHub's annual event \"honoring the individuals who steward and sustain Open Source projects.\" \nAnd the theme of the 4th Annual \"Maintainer Month\" will be: securing Open Source:\n\nThroughout the month, OSI and our affiliates will be highlighting maintainers who prioritize security in their projects, sharing their stories, and providing a platform for collaboration and learning... Maintainer Month is a time to gather, share knowledge, and express appreciation for the people who keep Open Source projects running. These maintainers not only review issues and merge pull requests &mdash; they also navigate community dynamics, mentor new contributors, and increasingly, adopt security best practices to protect their code and users.... \n\n- OSI will publish a series of articles on Opensource.net highlighting maintainers wh",
        "id": 2591637,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/03/0653227/may-is-maintainer-month-open-source-initiative-joins-github-to-celebrate-open-source-security?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "May is 'Maintainer Month'.  Open Source Initiative Joins GitHub to Celebrate Open Source Security",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T17:27:23.955813+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T17:27:23+00:00",
        "description": "An anonymous reader shared this report from the Washington Post:\n\nFacebook's loosening of its content moderation standards early this year got lots of attention and criticism. But a new study suggests that it might matter less what is taken down than when. The research finds that Facebook posts removed for violating standards or other reasons have already been seen by at least three-quarters of the people who would be predicted to ever see them. \n\n\"Content takedowns on Facebook just don't matter all that much, because of how long they take to happen,\" said Laura Edelson, an assistant professor of computer science at Northeastern University and the lead author of the paper in the Journal of Online Trust and Safety. Social media platforms generally measure how many bad posts they have taken down as an indication of their efforts to suppress harmful or illegal material. The researchers advocate a new metric: How many people were prevented from seeing a bad post by Facebook taking it down",
        "id": 2591302,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/03/0525218/facebooks-content-takedowns-take-so-long-they-dont-matter-much-researchers-find?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Facebook's Content Takedowns Take So Long They 'Don't Matter Much', Researchers Find",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T16:23:57.386548+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T16:23:57+00:00",
        "description": "Slashdot reader sciencehabit shares this excerpt from a new article in Science magazine:\n\n \n\n\nAt first, astronomers knew of only one cosmic scenario that fit the bill for the violent formation of \"jewelry shop\" elements [gold and sliver]: the collision of two ultra-dense stellar corpses called neutron stars. \n\nNow, a second has stepped onto the scene. \n\nAs they report this week in The Astrophysical Journal Letters, researchers have discovered signatures of this heavy element formation &mdash; called the r-process &mdash; in a giant flare first detected from a highly magnetic neutron star in 2004. The flare, which released more energy than our Sun does in a million years as it spewed electrically charged material, has remained shrouded in mystery since its discovery 20 years ago. Researchers quickly traced the outburst to a nearby magnetar, a special breed of neutron star whose magnetic fields are trillions times stronger than Earth's. But ten minutes after the massive flare, a second,",
        "id": 2590992,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/03/0245209/new-gold-creating-phenomenon-confirmed-in-space-using-2004-neutron-star-flare-readings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Gold-Creating Phenomenon Confirmed in Space Using 2004 Neutron Star Flare Readings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T15:18:25.145541+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T15:18:24+00:00",
        "description": "Remember when U.S. National Security Adviser Mike Waltz mistakenly included a journalist in an encrypted chatroom to discuss looming U.S. military action against Yemen's Houthis? \n\nA recent photo of a high-level cabinet meeting caught Waltz using a \"less-secure Signal app knockoff,\" reports the Guardian:\n\nThe chat app Waltz was using appears to be a modified version of Signal called TM SGNL, made by a company that copies messaging apps but adds an ability to retain messages and archive them. The White House officials may be using the modified Signal in order to comply with the legal requirement that presidential records be preserved... That function suggests the end-to-end encryption that makes Signal trusted for sharing private communications is possibly \"not maintained, because the messages can be later retrieved after being stored somewhere else\", according to 404 Media. \n\nThursday the national security adviser was removed from his position, the article points out. \nHe was instead ",
        "id": 2590633,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/03/0427226/us-national-security-official-caught-using-less-secure-signal-app-knockoff?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US National Security Official Caught Using 'Less-Secure Signal App Knockoff'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T13:09:28.442275+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T13:09:28+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: Google plans to roll out its Gemini artificial intelligence chatbot next week for children under 13 (source paywalled; alternative source) who have parent-managed Google accounts, as tech companies vie to attract young users with A.I. products. \"Gemini Apps will soon be available for your child,\" the company said in an email this week to the parent of an 8-year-old. \"That means your child will be able to use Gemini\" to ask questions, get homework help and make up stories. The chatbot will be available to children whose parents useFamily Link, a Google service that enables families to set up Gmail and opt into services like YouTube for their child. To sign up for a child account, parents provide the tech company with personal data like their child's name and birth date. Gemini has specific guardrails for younger users to hinder the chatbot from producing certain unsafe content, said Karl Ryan, a Google spokesman. When a child",
        "id": 2589879,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/03/0136232/google-plans-to-roll-out-its-ai-chatbot-to-children-under-13?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Plans To Roll Out Its AI Chatbot To Children Under 13",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T10:58:14.398916+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T10:58:14+00:00",
        "description": "A 25-year-old from Santa Clarita has pleaded guilty to hacking a Disney employee's computer using malware disguised as an AI art tool, stealing over 1 terabyte of confidential Disney data and threatening to leak it under the guise of a fake Russian hacktivist group. Variety reports: Santa Clarita resident Ryan Mitchell Kramer, 25, pleaded guilty to two felony charges, including one count of accessing a computer and obtaining information and one count of threatening to damage a protected computer. Each charge carries a maximum sentence of five years in federal prison. According to the plea agreement, in early 2024 Kramer posted a computer program on various online platforms that appeared to be used to create AI-generated art, when it really contained a malicious file to gain access to victims' computers.\n \nBetween April and May 2024, a Disney employee downloaded the program, and Kramer gained access to the victim's personal and work accounts, including a non-public Disney Slack channel",
        "id": 2589238,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/03/0126234/man-pleads-guilty-to-stealing-11-terabytes-of-disneys-slack-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Man Pleads Guilty To Stealing 1.1 Terabytes of Disney's Slack Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T07:43:36.893560+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T07:43:36+00:00",
        "description": "Astronomers may have found the best candidate yet for the elusive Planet Nine: a mysterious object in infrared sky surveys taken 23 years apart that appears to be more massive than Neptune and about 700 times farther from the sun than Earth. Space.com reports: [A] team led by astronomer Terry Long Phan of the National Tsing Hua University in Taiwan has delved into the archives of two far-infrared all-sky surveys in search of Planet Nine -- and incredibly, they have found something that could possibly be Planet Nine. The Infrared Astronomy Satellite, IRAS, launched in 1983 and surveyed the universe for almost a year before being decommissioned. Then, in 2006, the Japanese Aerospace Exploration Agency (JAXA) launched AKARI, another infrared astronomy satellite that was active between 2006 and 2011. Phan's team were looking for objects that appeared in IRAS's database, then appeared to have moved by the time AKARI took a look. The amount of movement on the sky would be tiny -- about thre",
        "id": 2588481,
        "language": null,
        "link": "https://science.slashdot.org/story/25/05/03/0118242/evidence-of-controversial-planet-9-uncovered-in-sky-surveys-taken-23-years-apart?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Evidence of Controversial Planet 9 Uncovered In Sky Surveys Taken 23 Years Apart",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T04:28:33.700407+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T04:28:33+00:00",
        "description": "An anonymous reader quotes a report from CNN: Driverless trucks are officially running their first regular long-haul routes, making roundtrips between Dallas and Houston. On Thursday, autonomous trucking firm Aurora announced it launched commercial service in Texas under its first customers, Uber Freight and Hirschbach Motor Lines, which delivers time- and temperature-sensitive freight. Both companies conducted test runs with Aurora, including safety drivers to monitor the self-driving technology dubbed \"Aurora Driver.\" Aurora's new commercial service will no longer have safety drivers.\n \n\"We founded Aurora to deliver the benefits of self-driving technology safely, quickly, and broadly, said Chris Urmson, CEO and co-founder of Aurora, in a release on Thursday. \"Now, we are the first company to successfully and safely operate a commercial driverless trucking service on public roads.\" The trucks are equipped with computers and sensors that can see the length of over four football fields",
        "id": 2587948,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/05/02/2258206/first-driverless-semis-have-started-running-regular-longhaul-routes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "First Driverless Semis Have Started Running Regular Longhaul Routes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T01:13:21.179627+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T01:13:21+00:00",
        "description": "Microsoft has appointed a Deputy CISO for Europe to address growing regulatory pressure and reassure EU leaders about its cybersecurity commitment. \"The move also highlights strong fears from European IT execs and government officials that the Trump administration may exert significant influence on cybersecurity companies,\" reports CSO Online. From the report: Who that Deputy CISO will ultimately be is unclear. Wednesday's statement simply said that Microsoft CISO Igor Tsyganskiy is \"appointing a new Deputy CISO for Europe as part of the Microsoft Cybersecurity Governance Council,\" but the phrasing made it unclear when that would happen. However, Tsyganskiy made a separate announcement on LinkedIn that he has given the role to current Deputy CISO Ann Johnson. But he then said that Johnson, who is based at Microsoft's head office in Redmond, Washington, will hold that post \"temporarily.\"\n \nIn his LinkedIn post, Tsyganskiy explained that the Cybersecurity Governance Council, which was c",
        "id": 2587433,
        "language": null,
        "link": "https://it.slashdot.org/story/25/05/02/2251200/microsoft-appoints-deputy-ciso-for-europe-to-reassure-european-it-leaders?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Appoints Deputy CISO For Europe To Reassure European IT leaders",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T00:09:47.352747+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T00:09:46+00:00",
        "description": "An anonymous reader quotes a report from the BBC: Temu has said it will stop selling goods imported from China in the US directly to customers from its platform. The online marketplace said sales would now be handled by \"locally based sellers,\" with orders fulfilled from within the country. The move comes as a duty-free rule for low-value packages is closed.\n \nTemu, and rival Chinese retail giant Shein, had previously relied on the so-called \"de minimis\" exemption to sell and ship low-value items directly to the US without having to pay duties or import taxes. Temu said it had been actively recruiting US firms to join the platform. \"All sales in the US are now handled by locally based sellers, with orders fulfilled from within the country. \"The move is designed to help local merchants reach more customers and grow their businesses,\" it added.\n \nSupporters of the de minimis loophole, which applied to parcels worth less than $800, argue it helped streamline the customs process. But both",
        "id": 2587154,
        "language": null,
        "link": "https://news.slashdot.org/story/25/05/02/2121218/temu-to-stop-selling-goods-from-china-directly-to-us-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Temu To Stop Selling Goods From China Directly To US Customers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-03T00:09:47.220946+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-03T00:09:46+00:00",
        "description": "The U.S. government is seeking to break up Google's advertising technology business after a judge ruled the company holds an illegal monopoly over ad tools for publishers, marking the second such antitrust case following a similar request to divest Chrome. The Guardian reports: \"We have a defendant who has found ways to defy\" the law, US government lawyer Julia Tarver Wood told a federal court in Virginia, as she urged the judge to dismiss Google's assurance that it would change its behavior. \"Leaving a recidivist monopolist\" intact was not appropriate to solve the issue, she added. [...] The US government specifically alleged that Google controls the market for publishing banner ads on websites, including those of many creators and small news providers.\n \nThe hearing in a Virginia courtroom was scheduled to plan out the second phase of the trial, set for September, in which the parties will argue over how to fix the ad market to satisfy the judge's ruling. The plaintiffs argued in th",
        "id": 2587153,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/05/02/2243229/us-asks-judge-to-break-up-googles-ad-tech-business?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Asks Judge To Break Up Google's Ad Tech Business",
        "vote": 0
    }
]