[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T22:21:19+00:00",
        "description": "Earth's core \"burns with an estimated forty-four trillion watts of power,\" the New Yorker reminds us &mdash; enough to \"satisfy the entire world's energy needs\" with a power source that's carbon-free, ubiquitous &mdash; and unlimited. (Besides running 24 hours a day, one of geothermal energy's key advantages is \"it can be used for both electricity and heating, which collectively account for around 38% of global climate emissions...\") \nAnd one drilling expert tells them there's been an \"exponential spin-up of activity in geothermal\" energy projects over the last two years. (Ironically it was the fracking boom also brought an \"explosion of new drilling practices &mdash; such as horizontal drilling and magnetic sensing &mdash; that inspired a geothermal resurgence.\") In 2005 one research team calculated that just 2% of the heat just four miles underground in America \"could meet the entire country's energy needs &mdash; two thousand times over,\" according to the article. \n\nSo their new a",
        "id": 2231826,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/02/229216/exponential-spin-up-in-geothermal-energy-projects-brings-hope-for-green-power?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Exponential Spin-up' In Geothermal Energy Projects Brings Hope for Green Power",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T21:16:12+00:00",
        "description": "\"Thousands of buildings across the United States are staying cool with the help of cutting-edge batteries made from one of the world's simplest materials,\" reports the Washington Post &mdash; ice.\n\nWhen electricity is cheap, the batteries freeze water. When energy costs go up, building managers turn off their pricey chillers and use the ice to keep things cool. A typical building uses about a fifth of its electricity for cooling, according to the International Energy Agency. By shifting their energy use to cheaper times of day, the biggest buildings can save hundreds of thousands of dollars a year on their power bills. They can also avoid using electricity from the dirtiest fossil fuel plants. In places where the weather is hot and energy prices swing widely throughout the day &mdash; for instance, Texas, Southern California and most of the American Southwest &mdash; buildings could cut their power bills and carbon emissions by as much as a third, experts say... \n\nWhen every building",
        "id": 2231550,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/02/2015220/how-buildings-are-staying-cool-and-saving-money---with-batteries-made-of-ice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How Buildings Are Staying Cool and Saving Money - with Batteries Made of Ice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T19:06:30+00:00",
        "description": "How confident are we about the safety of commercial space tourism? Long-time Slashdot reader theodp writes: \nIt's one thing for Microsoft to boast that they dare to use Outlook instead of Gmail. But it took a whole other level of commitment for Jeff Bezos to join his brother Mark aboard Blue Origin's first passenger-carrying mission in July 2021. \n\nSo, while Bezos is unhesitant about sending himself and other celebrities and loved ones into space aboard Blue Origin, how confident are you about the current state of space travel safety? \n\nIf offered a free ride into space from Bezos's Blue Origin, or one of the other options like Virgin Galactic, Axiom Space, or Boeing's Starliner, would you accept or decline it? \n\nShare your own thoughts and answers in the comments. \n\nWould you accept a free ride into space?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ask+Slashdot%3A++Would+You+Accept+a+Free+Ride+Into+Space%3F%3A",
        "id": 2230862,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/02/0123200/ask-slashdot-would-you-accept-a-free-ride-into-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ask Slashdot:  Would You Accept a Free Ride Into Space?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T19:06:30+00:00",
        "description": "Can a new 3D-printing technique shorten 3D printing times to just seconds? A team of researchers in Europe has modified Tomographic Volumetric Additive Manufacturing, which can \"create entire objects in one shot by shining light patterns into liquid resin,\" according to the 3D Printing Industry blog. (The liquid resin then solidifies when the light intensity is high enough...)\n\nWhile this approach can fabricate support-free, micro-scale parts within tens of seconds, it is \"highly inefficient.\" This is because under 1% of the encoded light reaches the resin vial. Conventional TVAM can also lead to unwanted distortions and poor resolution due to light blurring and projection artifacts. To address these limitations, the researchers developed HoloVAM, a new technique that uses a 3D hologram instead of conventional volumetric light projections. This approach reportedly boosts light efficiency by 20 times, resulting in faster and more accurate 3D printing. \n\nAccording to their paper, publi",
        "id": 2230863,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/02/0216225/fast-new-3d-printing-technique-shines-holograms-into-resin?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Fast New 3D Printing Technique Shines Holograms into Resin",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T19:06:30+00:00",
        "description": "Petawatt lasers have already allowed scientists to \"manipulate materials in new ways, emulate the conditions inside planets, and even split atoms,\" reports Science magazine. \"Now, accelerator physicists have matched that feat, producing petawatt pulses of electrons that could also have spectacular applications...\"\n\n\n Described in a paper published Thursday in Physical Review Letters, the electron pulses last one-quadrillionth of a second but carry 100 kiloamps of current. \"It's a supercool experiment,\" says Sergei Nagaitsev, an accelerator physicist at Brookhaven National Laboratory who was not involved in the work. Richard D'Arcy, a plasma accelerator physicist at the University of Oxford, adds, \"It's not just an experimental demonstration of something interesting, it's a steppingstone on the way to megaamp beams.\" If achievable, those even more powerful beams might begin to perform extraordinary feats such as ripping particles out of empty space, he says... \n\n[A]mped-up lasers woul",
        "id": 2230864,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/01/1943243/first-petawatt-electron-beam-arrives-ready-to-rip-apart-matter-and-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "First Petawatt Electron Beam Arrives, Ready To Rip Apart Matter and Space",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T19:06:30+00:00",
        "description": "A \"decision science partner\" at a seed-stage venture fund (who is also a cognitive-behavioral decision science author and professional poker player) explored what happens when GPT-4 Turbo converses with conspiracy theorists:\n\n\nResearchers have struggled for decades to develop techniques to weaken the grip of conspiracy theories and cult ideology on adherents. This is why a new paper in the journal Science by Thomas Costello of MIT's Sloan School of Management, Gordon Pennycook of Cornell University and David Rand, also of Sloan, is so exciting... In a pair of studies involving more than 2,000 participants, the researchers found a 20 percent reduction in belief in conspiracy theories after participants interacted with a powerful, flexible, personalized GPT-4 Turbo conversation partner. The researchers trained the AI to try to persuade the participants to reduce their belief in conspiracies by refuting the specific evidence the participants provided to support their favored conspiracy ",
        "id": 2230861,
        "language": null,
        "link": "https://slashdot.org/story/25/03/02/183210/what-happened-when-conspiracy-theorists-talked-to-openais-gpt-4-turbo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What Happened When Conspiracy Theorists Talked to OpenAI's GPT-4 Turbo?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T11:31:16+00:00",
        "description": "A malicious PyPi package effectively turned its users' systems \"into an illicit network for facilitating bulk music downloads,\" writes The Hacker News. \n\nThough the package has been removed from PyPI, researchers at security platform Socket.dev say it enabled \"coordinated, unauthorized music downloads from Deezer &mdash; a popular streaming service founded in France in 2007.\"\n\nAlthough automslc, which has been downloaded over 100,000 times, purports to offer music automation and metadata retrieval, it covertly bypasses Deezer's access restrictions... The package is designed to log into Deezer, harvest track metadata, request full-length streaming URLs, and download complete audio files in clear violation of Deezer's API terms... [I]t orchestrates a distributed piracy operation by leveraging both user-supplied and hardcoded Deezer credentials to create sessions with Deezer's API. This approach enables full access to track metadata and the decryption tokens required to generate full-le",
        "id": 2228455,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/02/064255/malicious-pypi-package-exploited-deezers-api-orchestrates-a-distributed-piracy-operation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Malicious PyPI Package Exploited Deezer's API, Orchestrates a Distributed Piracy Operation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T08:17:28+00:00",
        "description": "Adafruit managing director Phillip Torrone (also long-time Slashdot reader ptorrone) shared an interesting blog post. They'd spotted a Reddit post \"detailing how someone took a 27-year-old visual basic EXE file, fed it to Claude 3.7, and watched as it reverse-engineered the program and rewrote it in Python.\"\n\nIt was an old Visual Basic 4 program they had written in 1997. Running a VB4 exe in 2024 can be a real yak-shaving compatibility nightmare, chasing down outdated DLLs and messy workarounds. So! OP decided to upload the exe to Claude 3.7 with this request: \n\"Can you tell me how to get this file running? It'd be nice to convert it to Python.\"&gt; \nClaude 3.7 analyzed the binary, extracted the VB 'tokens' (VB is not a fully-machine-code-compiled language which makes this task a lot easier than something from C/C++), identified UI elements, and even extracted sound files. Then, it generated a complete Python equivalent using Pygame. According to the author, the code worked on the fi",
        "id": 2226668,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/01/2211210/27-year-old-exe-became-python-in-minutes-is-ai-assisted-reverse-engineering-next?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "27-Year-Old EXE Became Python In Minutes.  Is AI-Assisted Reverse Engineering Next?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T08:17:28+00:00",
        "description": "Long-time Slashdot reader MojoKid writes: AMD took the wraps of its next gen RDNA 4 consumer graphics architecture Friday, which was designed to enhance efficiency over the previous generation, while also optimizing performance for today's more taxing ray-traced gaming and AI workloads. RDNA 4 features next generation Ray Tracing engines, dedicated hardware for AI and ML workloads, better bandwidth utilization, and multimedia improvements for both gaming and content creation. AMD's 3rd generation Ray Accelerators in RDNA offer 2x the peak throughput of RDNA 3 and add support for a new feature called Oriented Bounding Boxes, that results in more efficient GPU utilization. 3rd Generation Matrix Accelerators are also present, which offer improved performance, along with support for 8-bit float data types, with structured sparsity. \n\nThe first cards featuring RDNA 4, the Radeon RX 9070 and 9070 XT go on sale next week, with very competitive MSRPs below $600, and are expected to do battle",
        "id": 2226671,
        "language": null,
        "link": "https://slashdot.org/story/25/03/01/209255/amd-reveals-rdna-4-gpu-architecture-powering-next-gen-radeon-rx-9070-cards?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AMD Reveals RDNA 4 GPU Architecture Powering Next Gen Radeon RX 9070 Cards",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T08:17:28+00:00",
        "description": "\"Tens of thousands of users were unable to access various Microsoft programs on Saturday afternoon,\" reports CNBC:\n\n\n\"We're investigating an issue in which users may be unable to access Outlook features and services,\" Microsoft 365 Status, the official Microsoft account for 365 service incidents, said in a post on X... \n\nThe number of reports that services such as Microsoft Outlook, Microsoft Exchange, Microsoft Teams, Microsoft 365 and Microsoft Azure were down spiked after 3:30 p.m. ET. More than 37,000 individuals reported an Outlook outage and roughly 24,000 reported an outage in the tech company's 365 service, according to Downdetector, while roughly 150 users reported their Teams accounts were down. \nOne hour ago Microsoft posted on X.com that \"We've identified a potential cause of impact and have reverted the suspected code to alleviate impact. We're monitoring telemetry to confirm recovery...\" \n\nMinutes later they added that \"Our telemetry indicates that a majority of impacte",
        "id": 2226670,
        "language": null,
        "link": "https://slashdot.org/story/25/03/01/2348212/microsoft-outage-leaves-tens-of-thousands-unable-to-access-email-and-other-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Outage Leaves Tens of Thousands Unable to Access Email and Other Apps",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T08:17:28+00:00",
        "description": "NBC News reports that Utah could make history as America's first state to ban fluoride in public water systems &mdash; even though major medical associations supporting water fluoridation:\n\n\nIf signed into law [by the governor], HB0081 would prevent any individual or political subdivision from adding fluoride \"to water in or intended for public water systems...\" A report published recently in JAMA Pediatrics found a statistically significant association between higher fluoride exposure and lower children's IQ scores &mdash; but the researchers did not suggest that fluoride should be removed from drinking water. According to the report's authors, most of the 74 studies they reviewed were low-quality and done in countries other than the United States, such as China, where fluoride levels tend to be much higher, the researchers noted. \n\nAn Australian study published last year found no link between early childhood exposure to fluoride and negative cognitive neurodevelopment. Researchers ",
        "id": 2226669,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/01/2316220/utah-could-become-americas-first-state-to-ban-fluoride-in-public-water?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Utah Could Become America's First State To Ban Fluoride In Public Water",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T08:17:28+00:00",
        "description": "Watch the \"Blue Ghost\" lunar lander attempt its moon landing. \n\nThe actual landing is scheduled to happen at 3:34 a.m. Eastern time, according to CNN, while \"The first images from the mission should be delivered about a half hour after...\"\n Success is not guaranteed... [B]roadly speaking, about half of all lunar landing attempts have ended in failure. Jason Kim, Firefly's CEO, told CNN in December that his company's experience building rockets has given him a high degree of confidence in Blue Ghost's propulsion systems. \"We're using (reaction control system) thrusters that we've built, developed in-house, that are designed by the same people that design our rocket engines. That reduces risk,\" Kim said. \"All that gives us high confidence when we have people that do rocket engines really, really well &mdash; some of the best in the world.\"\n \n\nBut the New York Times notes that Blue Ghost, built by Austin, Texas-based Firefly Aerospace, is just one of three robotic spacecraft \"in space r",
        "id": 2226667,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/02/0425256/watch-blue-ghost-attempt-its-landing-on-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Watch 'Blue Ghost' Attempt Its Landing on the Moon",
        "vote": 0
    }
]