[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T15:30:06+00:00",
        "description": "Souslikes are a dime a dozen in this era of gaming, yet surprises pop up here and there. The First Berserker Khazan may just be one of those pleasant surprises. The focus on a cinematic storyline and deep character development sure promises something different to Fromsoft’s more esoteric narratives.\n\nCombat-wise, there’s a lot to be excited for. The flow is fast paced, with a strong emphasis on parries and perfect dodges. Camera doesn’t get in the way of combat either. The starting bosses are great appetizers for what the full game has in store. \n\nThere’s a demo for The First Berserker Khazan right now if you want to try it out for yourself. The game releases on March 27th for PC, PS5, and Xbox Series X.",
        "id": 2229816,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Heqyi_oWydM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/Heqyi_oWydM/hqdefault.jpg",
        "title": "I Can't Wait To Play This Potential Game of the Year Contender...",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-02T09:30:14+00:00",
        "description": "Over the past few years, the triple-A games industry has been, to put it lightly, a mess. Ironically, it all came to a head in what many considered the best year for video games—2023. Even with so many big-name titles and successes, from The Legend of Zelda: Breath of the Wild and Super Mario Bros. Wonder to Baldur's Gate 3 and Marvel's Spider-Man 2, the year saw over 9,000 layoffs. This would roll into 2024 when almost 15,000 layoffs occurred.\n\nIt was also a year that saw multiple studios shuttered. Even after acquiring Activision Blizzard and becoming one of the biggest game publishers in the world, commanding a venerable army of IPs, Microsoft shut down Tango Gameworks, Arkane Austin, and Alpha Dog Games. Sony wasn't too far behind, shuttering its London Studio, Deviation Games, and – most infamously – Firewalk Studios in the wake of one of the biggest first-party failures of all time – Concord.",
        "id": 2228212,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Yq181LBrLeM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Yq181LBrLeM/hqdefault.jpg",
        "title": "The AAA Games Industry Is In An INCOMPREHENSIBLE MESS.....",
        "vote": 0
    }
]