[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T16:20:12.663131+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T16:00:55+00:00",
        "description": "If you are already a fan of the series, then you will find plenty to like in this game across the board. From the changes made to the on-pitch gameplay in response to player feedback to ones made to the structure of the specific modes, to even the franchise’s long overdue recognition of the fact that its immense audience may want two completely separate styles of play – EA Sports  FC 26 is a great game for those already on board with the series. \n\nBut if you’re not? Well, if you have played previous games, and didn’t care much for them, or were hoping for dramatic changes, this title is not for you. If you haven’t played these games before and just wanted a good football game, then this is as good of a title to look into as any other EA Sports FC game.",
        "id": 3629711,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=WXxiWB2Nfvw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WXxiWB2Nfvw/hqdefault.jpg",
        "title": "EA Sports FC 26 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T14:10:03.848073+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T13:30:23+00:00",
        "description": "The first-person genre is one of the most popular ones in the medium of gaming, and it continues to enjoy mainstream popularity for dozens of years with no signs of slowing down in the near future. The best games of this ilk transport you to wondrous locations, take you through memorable adventures, and put you in the shoes of characters that will stay with you long after the credits roll. \n\nFrom gripping narrative-driven experiences to adrenaline-pumping action and atmospheric exploration, first-person single-player games offer something for everyone. With this video, we’ll be highlighting 15 of the best first-person single-player titles in recent memory - games that not only showcase the strengths of the perspective but also push the boundaries of immersive storytelling.",
        "id": 3628939,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=GwNrfa3N37o",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GwNrfa3N37o/hqdefault.jpg",
        "title": "15 Amazing First-Person Single-Player Games Everyone Should Play [2025 Edition]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T10:53:53.485124+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T10:45:02+00:00",
        "description": "Ghost of  Yotei  is not aiming to rip up the rulebook, but it is bringing a comprehensive list of refinements over its predecessor which - if every element aligns - promises to be Sucker Punch’s greatest game yet. \n\nA new protagonist awaits - the revenge-fueled Atsu - armed to the teeth with medieval Japan’s greatest blades. Her mission? To enact revenge on the souls who massacred her family, destroyed her home, and left her for dead. As brutal as this tale seems, Sucker Punch have made space for numerous thoughtful, reflective endeavours throughout Atsu’s unhurried quest for vengeance. \n\nThis video outlines 15 such things we cannot wait to do once we roll up in the shadows of Mount Yotei on 2nd October.",
        "id": 3627958,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Oi69gI-7RpU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Oi69gI-7RpU/hqdefault.jpg",
        "title": "Ghost of Yotei - 15 Things WE CAN'T WAIT TO DO",
        "vote": 0
    }
]