[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T21:23:32.239736+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T21:17:00+00:00",
        "description": "\"On a recent assignment to test defenses, Dave Brauchler of the cybersecurity company NCC Group tricked a client's AI program-writing assistant into executing programs that forked over the company's databases and code repositories,\" reports the Washington Post. \n\n\"We have never been this foolish with security,\" Brauchler said...\n\n\n Demonstrations at last month's Black Hat security conference in Las Vegas included other attention-getting means of exploiting artificial intelligence. In one, an imagined attacker sent documents by email with hidden instructions aimed at ChatGPT or competitors. If a user asked for a summary or one was made automatically, the program would execute the instructions, even finding digital passwords and sending them out of the network. A similar attack on Google's Gemini didn't even need an attachment, just an email with hidden directives. The AI summary falsely told the target an account had been compromised and that they should call the attacker's number, mim",
        "id": 3631272,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/21/2022257/ai-tools-give-dangerous-powers-to-cyberattackers-security-researchers-warn?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Tools Give Dangerous Powers to Cyberattackers, Security Researchers Warn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T21:23:32.439534+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T20:17:00+00:00",
        "description": "Long-time Slashdot reader fahrbot-bot shared this report from ZME Science\nResearchers from the University of Turku, in collaboration with Aalto University and Wageningen University, have developed a bio-based UV protection film for solar cells that not only blocks nearly all harmful ultraviolet light but also outperforms commercial plastic films. The key ingredient is a water extract made from red onion skins... \n\n[T]he same sunlight that powers [solar cells] can also degrade their delicate components &mdash; particularly the electrolyte inside dye-sensitized solar cells (DSSCs), a type known for their flexibility and low-light performance. To mitigate this, manufacturers typically wrap cells in UV-protective films made from petroleum-based plastics like polyethylene terephthalate (PET). But these plastics degrade over time and are difficult to recycle... Nanocellulose can be processed into thin, transparent films that serve as the perfect substrate for UV-blocking compounds. \n\nTheir ",
        "id": 3631273,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/21/1942234/more-durable-uv-coating-for-solar-panels-made-from-red-onion-skins?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "More Durable UV Coating For Solar Panels Made From Red Onion Skins",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T20:17:05.170526+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T19:17:00+00:00",
        "description": "In a debate on employment rights, a U.K. Parliament member brought up Meta's former director of global public policy Sarah Wynn-Williams\n\nLouise Haigh, the former Labour transport secretary, said Wynn-Williams was facing a fine of $50,000 (&pound;37,000) every time she breached an order secured by Meta preventing her from talking disparagingly about the company... \"I am sure that the whole house and the government will stand with Sarah as we pass this legislation to ensure that whistleblowers and those with the moral courage to speak out are always protected....\" \n\nMeta has emphasised that Wynn-Williams entered into the non-disparagement agreement voluntarily as part of her departure. Meta said that to date, Wynn-Williams had not been forced to make any payments under the agreement... [The ruling came after Wynn-Williams published an expos&eacute; in March about her time at Facebook titled Careless People: A Cautionary Tale of Power, Greed, and Lost Idealism.] The ruling stated Wynn-W",
        "id": 3630982,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/21/195215/metas-uk-arbitration-threatens-to-bankrupt-facebook-whistleblower-says-her-lawyer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta's UK Arbitration 'Threatens to Bankrupt' Facebook Whistleblower, Says Her Lawyer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T19:11:33.191490+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T18:17:00+00:00",
        "description": "A July combat training exercise involved a satellite dish-style antenna that \"could fire enough electromagnetic energy to fry the satellite 22,000 miles away,\" reports the Washington Post. But \"Instead, the salvo would be more covert &mdash; millisecond pulses of energy that would subtly disrupt the satellite's signals, which U.S. military forces were using to communicate in the Pacific Ocean.\"\n\nThe goal was to disguise the strike as a garbled connection that could be easily remedied by securing a loose cable or a simple reboot, leaving U.S. service members frustrated without raising their suspicions. [And using less power \"would make it harder for the Blue Team to track where the interference was coming from.\"] This is how the next war could start: invisible shots fired in space on the electromagnetic spectrum that could render U.S. fighter jets and aircraft carriers deaf and blind, unable to communicate. In this case, the \"aggressors\" targeting the U.S. satellite were not from China",
        "id": 3630654,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/21/1815235/americas-space-force-is-preparing-for-a-new-kind-of-war?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America's Space Force is Preparing for a New Kind of War",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T16:47:04.389301+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T16:34:00+00:00",
        "description": "Last week the Guardian reported on \"thousands of AI workers contracted for Google through Japanese conglomerate Hitachi's GlobalLogic to rate and moderate the output of Google's AI products, including its flagship chatbot Gemini... and its summaries of search results, AI Overviews.\"\n\"AI isn't magic; it's a pyramid scheme of human labor,\" said Adio Dinika, a researcher at the Distributed AI Research Institute based in Bremen, Germany. \"These raters are the middle rung: invisible, essential and expendable....\" Ten of Google's AI trainers the Guardian spoke to said they have grown disillusioned with their jobs because they work in siloes, face tighter and tighter deadlines, and feel they are putting out a product that's not safe for users... In May 2023, a contract worker for Appen submitted a letter to the US Congress that the pace imposed on him and others would make Google Bard, Gemini's predecessor, a \"faulty\" and \"dangerous\" product \nThis week Google laid off 200 of those moderating",
        "id": 3629847,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/20/2338214/hundreds-of-google-ai-workers-were-fired-amid-fight-over-working-conditions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hundreds of Google AI Workers Were Fired Amid Fight Over Working Conditions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T15:43:13.321891+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T15:34:00+00:00",
        "description": "Writing in Communications of the ACM, former Go tech lead Russ Cox warns we need to keep improving defenses of software supply chains, highlighting \"promising approaches that should be more widely used\" and \"areas where more work is needed.\"\nThere are important steps we can take today, such as adopting software signatures in some form, making sure to scan for known vulnerabilities regularly, and being ready to update and redeploy software when critical new vulnerabilities are found. More development should be shifted to safer languages that make vulnerabilities and attacks less likely. We also need to find ways to fund open source development to make it less susceptible to takeover by the mere offer of free help. Relatively small investments in OpenSSL and XZ development could have prevented both the Heartbleed vulnerability and the XZ attack. \n\nSome highlights from the 5,000-word article:\n\n\n Make Builds Reproducible. \"The Reproducible Builds project aims to raise awareness of reprodu",
        "id": 3629508,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/21/0650219/secure-software-supply-chains-urges-former-go-lead-russ-cox?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Secure Software Supply Chains, Urges Former Go Lead Russ Cox",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T15:43:13.432176+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T14:34:00+00:00",
        "description": "Near Microsoft's headquarters in Redmond, the Five Stones coffee shop advertised for a barista a few months ago &mdash; and started getting resumes from \"people who listed Microsoft and other tech companies,\" writes the Wall Street Journal:\n\nThe applicants typically had master's degrees and experience in graphic design or marketing roles, Andrews said &mdash; sometimes senior ones. They were applying to jobs at Five Stones that would pay Redmond's minimum wage, $16.66 an hour. Five Stones hasn't yet hired such candidates because the coffee shop gives priority to more traditional entry-level baristas, like high-schoolers... \n\n[Microsoft and Amazon] have laid off more than 46,000 employees since 2023, according to Layoffs.fyi, which tracks workforce reductions. That represents 85% of layoffs by Seattle-area tech companies... As Amazon and Microsoft have made cuts &mdash; and other local tech firms including Expedia and Redfin have followed suit &mdash; the effects have rippled through S",
        "id": 3629509,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/21/0744258/tech-boomtown-seattle-grapples-with-fewer-tech-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tech Boomtown Seattle Grapples with Fewer Tech Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T12:27:45.361675+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T11:34:00+00:00",
        "description": "Mickey Mouse's first movie Steamboat Willie entered the public domain in 2024. \nNow one of America's largest personal injury firms is suing Disney, reports the Associated Press, \"in an effort to get a ruling that would allow it to use Steamboat Willie in advertisements...\"\n[The law firm said] it had reached out to Disney to make sure the entertainment company wouldn't sue them if they used images from the animated film for their TV and online ads. Disney's lawyers responded by saying they didn't offer legal advice to third parties, according to the lawsuit. Morgan &amp; Morgan said it was filing the lawsuit to get a decision because it otherwise feared being sued by Disney for trademark infringement if it used Steamboat Willie. \n\"Without waiver of any of its rights, Disney will not provide such advice in response to your letter,\" Disney's attorneys wrote in their letter (adding \"Very truly yours...\"). A local newscast showed a glimpse of the letter, along with a few seconds of the ad ",
        "id": 3628352,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/21/0550202/disney-sued-by-law-firm-wanting-to-use-steamboat-willie-in-its-ads?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Disney Sued by Law Firm Wanting to Use 'Steamboat Willie' in Its Ads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T09:12:53.098894+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T07:34:00+00:00",
        "description": "When Meta finally unveiled its newest smart glasses, CEO Mark Zuckerberg \"drew more snickers than applause,\" wrote the New York Times. (Mashable points out a video call failing onstage followed by an unsuccessful recipe demonstration.) \n\nMeta chief technology officer Andrew Bosworth later explained the funny reason their demo didn't work, reports TechCrunch, while answering questions on Instagram:\n\n\"When the chef said, 'Hey, Meta, start Live AI,' it started every single Ray-Ban Meta's Live AI in the building. And there were a lot of people in that building,\" Bosworth explained. \"That obviously didn't happen in rehearsal; we didn't have as many things,\" he said, referring to the number of glasses that were triggered... The second part of the failure had to do with how Meta had chosen to route the Live AI traffic to its development server to isolate it during the demo. But when it did so, it did this for everyone in the building on the access points, which included all the headsets. \"So",
        "id": 3627551,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/21/023248/glitches-humiliated-zuck-in-smart-glasses-launch-meta-cto-explains-what-happened?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Glitches Humiliated Zuck in Smart Glasses Launch. Meta CTO Explains What Happened",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T07:24:13.070532+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T03:44:00+00:00",
        "description": "The consumer advocacy nonprofit PIRG (Public Interest Research Group) is now petitioning Microsoft to reconsider pulling support for Windows 10 in 2025, since \"as many as 400 million perfectly good computers that can't upgrade to Windows 11 will be thrown out.\" In a petition addressed to Microsoft CEO Satya Nadella, the group warned the October 14 end of free support could cause \"the single biggest jump in junked computers ever, and make it impossible for Microsoft to hit their sustainability goals.\"\n\nAbout 40% of PCs currently in use can't upgrade to Windows 11, even if users want to... Less than a quarter of electronic waste is recycled, so most of those computers will end up in landfills. \n\nConsumer Reports recently also urged Microsoft to not to \"strand millions of customers.\". And now more groups are also pushing back, according to a post from the blog Windows: Central\n\nThe Restart Project co-developed the \"End of 10\" toolkit, which is designed to support Windows 10 users who can",
        "id": 3627172,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/21/0056225/pirg-other-groups-criticize-microsofts-plan-to-discontinue-support-for-windows-10?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PIRG, Other Groups Criticize Microsoft's Plan to Discontinue Support for Windows 10",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T04:15:26.307031+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T03:44:00+00:00",
        "description": "The consumer advocacy nonprofit PIRG (Public Interest Research Group) is now petitioning Microsoft to reconsider pulling support for Windows 10 in 2025, since \"as many as 400 million perfectly good computers that can't upgrade to Windows 11 will be thrown out.\" In a petition addressed to Microsoft CEO Satya Nadella, the group warned the October 14 end of free support could cause \"the single biggest jump in junked computers ever, and make it impossible for Microsoft to hit their sustainability goals.\"\n\nAbout 40% of PCs currently in use can't upgrade to Windows 11, even if users want to... Less than a quarter of electronic waste is recycled, so most of those computers will end up in landfills. \n\nConsumer Reports recently also urged Microsoft to not to \"strand millions of customers.\". And now more groups are also pushing back, according to a post from the blog Windows: Central\n\nThe Restart Project co-developed the \"End of 10\" toolkit, which is designed to support Windows 10 users who can",
        "id": 3626644,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/21/0056225/pirg-other-groups-criticize-microsofts-plan-to-discontinue-support-for-windows-11?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "PIRG, Other Groups Criticize Microsoft's Plan to Discontinue Support for Windows 11",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-21T02:10:25.923938+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-21T01:34:00+00:00",
        "description": "An anonymous reader shared this article from the Washington Post:\n\n\nA student taking an online quiz sees a button appear in their Chrome browser: \"homework help.\" Soon, Google's artificial intelligence has read the question on-screen and suggests \"choice B\" as the answer. The temptation to cheat was suddenly just two clicks away Sept. 2, when Google quietly added a \"homework help\" button to Chrome, the world's most popular web browser. The button has been appearing automatically on the kinds of course websites used by the majority of American college students and many high-schoolers, too. Pressing it launches Google Lens, a service that reads what's on the page and can provide an \"AI Overview\" answer to questions &mdash; including during tests. \n\nEducators I've spoken with are alarmed. Schools including Emory University, the University of Alabama, the University of California at Los Angeles and the University of California at Berkeley have alerted faculty how the button appears in the",
        "id": 3626351,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/20/029249/google-temporarily-pauses-ai-powered-homework-helper-button-in-chrome-over-cheating-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Temporarily Pauses AI-Powered 'Homework Helper' Button in Chrome Over Cheating Concerns",
        "vote": 0
    }
]