[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-25T20:50:02.033023+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-25T20:30:01+00:00",
        "description": "Ready or Not is the highly-tactical, high-stakes, ultra-immersive SWAT based shooter from VOID Interactive which has been entertaining PC players since its initial release back in 2023. \n\nAfter many community-led requests for a console port, the game is finally coming to PS5 and Xbox Series X|S players on July 15th. VOID Interactive’s mission to present as realistic a tactical shooter as possible shows no signs of slowing down with this console port, with the game set to fire on all cylinders with new missions, weapons, customisations, and cosmetics plus overhauled difficulty and remastered levels incoming alongside all the content PC players are already enjoying. \n\nThis video aims to unpack all there is to know before pulling the trigger on a Ready or Not pre-order for your PS5 or Xbox.",
        "id": 3019777,
        "language": null,
        "link": "https://www.youtube.com/watch?v=AKfCHwsIt24",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/AKfCHwsIt24/hqdefault.jpg",
        "title": "Ready Or Not PS5 And Xbox Series X | S - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-25T16:30:00.448229+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-25T15:30:13+00:00",
        "description": "Sony’s no stranger to the handheld scene. They revolutionized portability in the 70s with the cassette-playing Walkman and then became the first to earnestly compete with Nintendo’s dominant handhelds. The PSP was a massive success, both financially and critically, bringing us games beloved classics like Peace Walker and Chinatown Wars. \n\nBut after the tepid performance of the Vita, PlayStation has stepped back from handheld gaming. Now with the rise of PC handhelds and Nintendo and Xbox crafting their own portable experiences, Sony risks being left in the dust.\n\nBut it doesn’t need to sit back. In fact, now is the ideal time for Sony to step in and present their next dedicated gaming handheld. The PS Portal was merely a PS5 accessory, but it gave them some experience sculpting an external shell of a device. Now with the refinement of APU chips and the computing relief of upscaling, Sony has the tools to far outperform the Vita and even rival the current competition.",
        "id": 3017530,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DJaBkFhpxeQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DJaBkFhpxeQ/hqdefault.jpg",
        "title": "With Nintendo And Microsoft Out With Their Handhelds, It's Time For Sony To Jump Into The Party",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-25T14:20:00.392604+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-25T13:30:33+00:00",
        "description": "The Fall and Holiday seasons are often some of the busiest in the gaming industry. June also saw the launch of the Nintendo Switch 2 and its various ports, and that's not even accounting for all the other big releases. However, July is already shaping up to be one of the busiest months for gamers.\n\nIt all begins with what could be another incredible free-to-play multiplayer title, Mecha BREAK, followed by EA Sports College Football 26, with EA Sports improving on last year's big return for the franchise in dozens of ways. Tony Hawk's Pro Skater 3 + 4 marks the next compilation of remakes for the series; Donkey Kong Bananza is Nintendo's next big triple-A launch; and Shadow Labyrinth looks surprising with its edgy tones and exploration.\n\nThat's not even accounting for potential surprises like Eriksholm: The Stolen Dream, Wuchang: Fallen Feathers and Total Chaos. Let's dive into the 15 biggest games of July 2025.",
        "id": 3016297,
        "language": null,
        "link": "https://www.youtube.com/watch?v=SK2eDtxFdCU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SK2eDtxFdCU/hqdefault.jpg",
        "title": "15 NEW Games of July 2025 We Can't To Wait Play",
        "vote": 0
    }
]