[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-27T19:30:06+00:00",
        "description": "So you're diving into Monster Hunter Wilds, whether as a first-time Hunter or a veteran who's conquered the previous games' toughest challenges. Some of the most basic tasks, like gathering materials, selecting a weapon, and beating up a target are easy enough when starting. But what about everything else?\n\nWith the sheer number of new mechanics and systems in Wilds, it's good to leverage those tools for your benefit. For example, the regional map isn't just a means to see targets on the map - it's used to save hunts as Investigations. You can also access the Environmental Overview, which provides a breakdown of the weather conditions and upsurges in different materials.\n\nWounds and Focus Mode are also new additions - exploiting them is key to dealing big damage to monsters. Let's discuss all this and more tips to become a seasoned hunter in Monster Hunter Wilds.",
        "id": 2211220,
        "language": null,
        "link": "https://www.youtube.com/watch?v=rgtRTJMsMow",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rgtRTJMsMow/hqdefault.jpg",
        "title": "15 Beginners Tips And Tricks Monster Hunter Wilds Doesn't Tell You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-27T15:30:02+00:00",
        "description": "Monster Hunter Wilds is out now and is the first mainline title in the franchise since 2021's Monster Hunter Rise. It's much more ambitious in scale, pushing innovations like setting up camps in the wild, cooking anywhere, and seamlessly starting quests.\n\nAs reviews went live earlier this week, however, one tenet of the Monster Hunter experience - the difficulty - seems somewhat lacking. Not having to pay much heed to your gear throughout Low Rank and even the minimal danger in High Rank has left some critics mixed. The fact that the endgame is a little sparse and lacking much by way of challenge also doesn't help.\n\nHowever, it's vital to appreciate all the good things Wilds has to offer. It's not increasing the challenge from the previous games so much as establishing a new foundation for newcomers and veterans.",
        "id": 2208982,
        "language": null,
        "link": "https://www.youtube.com/watch?v=1is9plClevE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1is9plClevE/hqdefault.jpg",
        "title": "Is Monster Hunter Wilds Being Easy THAT BIG OF A DEAL?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-27T09:30:10+00:00",
        "description": "Whether you’re after out-and-out frights, psychological torment, depravity, or a desperate fight to survive, the horror genre has you covered. Seminal titles have been steadily releasing for years, and so plentiful are awesome single player horror games that numerous now sell for cheap. \n\nWhilst there’s a wealth of excellent horror titles for the price of a coffee (or less) on platforms such as Steam and console stories, this video instead opts to highlight horror games that are more well-known but currently retailing for less than you’d expect. What we’ve got here then is a rundown of 15 semi-modern (and some old yet re-released) horror titles, the age of which hasn’t dulled their scares whatsoever.",
        "id": 2206446,
        "language": null,
        "link": "https://www.youtube.com/watch?v=OiuVDPk2sAw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OiuVDPk2sAw/hqdefault.jpg",
        "title": "15 Awesome Horror Games That You Can Buy For UNDER $20",
        "vote": 0
    }
]