[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-05T17:00:20+00:00",
        "description": "When you think of survival sandbox titles, Butterscotch Shenanigans' Crashlands probably isn't the first game that comes to mind. Eschewing any survival elements for a lighter mood and heavier narrative focus, the original earned a following.\n\nCrashlands 2 aims for the same kind of levity with its story, with Flux Dabes returning to Woanope and embroiled in a world-changing event (and the Bureau of Shipping seemingly up to no good). The presentation and combat have seen more detail and improvements, and the world itself is sizable enough while offering extensive freedom.\n\nOther elements like crafting, base-building and progression are sold, even if they don't necessarily break the mould. The humor is occasionally fun, if overdone at times (to the point of awkwardness), and the difficulty can feel pretty punishing early on. Crashlands 2 still comes recommended for fans of the original, even if it plays things relatively safe.",
        "id": 2492187,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QgsiDT1n6q8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QgsiDT1n6q8/hqdefault.jpg",
        "title": "Crashlands 2 Review - More of the Same",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-05T13:30:40+00:00",
        "description": "For fans of real time strategy games, there aren’t nearly as many options out there as there once used to be, but thankfully, there isn’t a complete and total lack of them either. Many of these options have come from indie developers and lesser known studios, what with the larger companies deeming the genre too risky at this point, and the upcoming Tempest Rising is yet another example of that. \n\nTaking heavy inspiration from Command and Conquer and set in an alternate history setting, the upcoming PC title is making some pretty intriguing promises. Naturally, it has caught our attention, and here, we’re going to shine a spotlight on it and what it’ll bring to the table.",
        "id": 2491147,
        "language": null,
        "link": "https://www.youtube.com/watch?v=vV2Glf4xh1E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vV2Glf4xh1E/hqdefault.jpg",
        "title": "Tempest Rising - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-05T06:30:03+00:00",
        "description": "Sandfall Interactive’s first project is a visual spectacle, a dense fantasy RPG packed with imaginative environs. The story set up is an intriguing one too, with inhabitants of a prosperous city suffering. \n\nClair Obscur: Expedition takes influence from Sekiro, but derivative this game is anything but. The wonderous world and narrative set up serve as vehicles for thrilling combat – with enough distinction over battling in other RPGs – and an experience felt through the eyes of complex, emotionally anguished characters. \n\nClair Obscur: Expedition would be a crowning achievement for any studio but given its Sandfall Interactive’s first, it deserves extra recognition.",
        "id": 2489520,
        "language": null,
        "link": "https://www.youtube.com/watch?v=A-PFlF1sAhU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/A-PFlF1sAhU/hqdefault.jpg",
        "title": "Clair Obscur: Expedition Is One of The BIGGEST Games of The Year - HERE'S WHY",
        "vote": 0
    }
]