[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T23:59:33+00:00",
        "description": "Nicholas Carr wrote The Shallows: What the Internet Is Doing to Our Brains. But his new book looks at how social media and digital communication technologies \"are changing us individually and collectively,\" writes the Los Angeles Review of Books. \nThe book's title? Superbloom: How Technologies of Connection Tear Us Apart .\nBut if these systems are indeed tearing us apart, the reasons are neither obvious nor simple. Carr suggests that this isn't really about the evil behavior of our tech overlords but about how we have \"been telling ourselves lies about communication &mdash; and about ourselves.... Well before the net came along,\" says Carr, \"[the] evidence was telling us that flooding the public square with more information from more sources was not going to open people's minds or engender more thoughtful discussions. It wasn't even going to make people better informed....\" \n\nAt root, we're the problem. Our minds don't simply distill useful knowledge from a mass of raw data. They use",
        "id": 2129008,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/16/2311215/are-technologies-of-connection-tearing-us-apart?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Are Technologies of Connection Tearing Us Apart?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T21:49:49+00:00",
        "description": "\"A robotic lander from Texas-based Firefly Aerospace is now in orbit around the Moon,\" reports Spaceflight Now, \"and going through its final preparations to land in the coming weeks.\"\n\nIts arrival comes nearly a month after the spacecraft launched onboard a Falcon 9 rocket from pad 39A at NASA's Kennedy Space Center. This is the third mission launched as part of the agency's Commercial Lunar Payload Services (CLPS) program, an initiative designed to bring science and technology demonstrations to the Moon at a cheaper cost... \n\nManifested on this lander are 10 NASA payloads, which cover a range of objectives. Those include the Lunar Instrumentation for Subsurface Thermal Exploration with Rapidity (LISTER) instrument, which will drill between 2- to 3-meters into the Moon's surface to study the heat flow; and the Stereo Cameras for Lunar Plume-Surface Studies (SCALPSS) 1.1 instrument, which will use a series of cameras to capture the plume generated at landing to help create a three-dim",
        "id": 2128499,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/16/2138259/after-launch-by-spacex-in-january-firefly-aerospaces-lunar-lander-reaches-moon-orbit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After Launch by SpaceX in January, Firefly Aerospace's Lunar Lander Reaches Moon Orbit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T20:44:58+00:00",
        "description": "gwolf (Slashdot reader #26,339) writes: On Friday, February 14, Libertarian Argentinian president, Javier Milei, promoted the just-created $LIBRA cryptocoin, created by the Viva la libertad project, strongly aligned with his political party, La Libertad Avanza. Milei tweeted, \"This private project will be devoted to promote growth of the Argentinian economy, funding small startups and enterprises. The world wants to invest in Argentina!\" \n\nIt is worth noting that the project's website was registered a mere three minutes before Milei tweeted his endorsement. The cryptocoin quickly reached a $4.6 billion market cap... Only to instantaneously lose 89% of its value, with nine core investers pulling the rug from under the enthusiast investors.\n\nMore details from the blog Web3 Is Going Just Great:\n\n\n[W]ithin hours of the launch, insiders began selling off their holdings of the token. The token had been highly concentrated among insiders, with around 82% of the token held in a small cluster",
        "id": 2128190,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/16/1921209/argentinian-president-promotes-memecoin-it-then-crashed-95-as-insiders-cashed-out?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Argentinian President Promotes Memecoin. It Then Crashed 95% as Insiders Cashed Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T19:40:52+00:00",
        "description": "\"What if time is not as fixed as we thought?\" That's the question raised in an announcement from the University of Surrey. \n\n\"Imagine that instead of flowing in one direction &mdash; from past to future &mdash; time could flow forward or backward due to processes taking place at the quantum level.\"\n\nThis is the thought-provoking discovery made by researchers at the University of Surrey, as a new study reveals that opposing arrows of time can theoretically emerge from certain quantum systems. For centuries, scientists have puzzled over the arrow of time &mdash; the idea that time flows irreversibly from past to future. While this seems obvious in our experienced reality, the underlying laws of physics do not inherently favour a single direction. Whether time moves forward or backwards, the equations remain the same.... \n\nThis discovery provided a mathematical foundation for the idea that time-reversal symmetry still holds in open quantum systems &mdash; suggesting that time's arrow ma",
        "id": 2127943,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/16/1850213/time-flows-forward-or-backward-at-quantum-levels-researchers-suggest?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Time Flows Forward or Backward At Quantum Levels, Researchers Suggest",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T18:34:16+00:00",
        "description": "Christie's auction house notes that an AI-generated \"portrait\" of an 18th-century French gentleman recently sold for $432,500. (One member of the Paris-based collective behind the work says \"we found that portraits provided the best way to illustrate our point, which is that algorithms are able to emulate creativity.\") \n\nBut the blog post from Christie's goes on to acknowledge that AI researchers \"are still addressing the fundamental question of whether the images produced by their networks can be called art at all.\"\n\n. One way to do that, surely, is to conduct a kind of visual Turing test, to show the output of the algorithms to human evaluators, flesh-and-blood discriminators, and ask if they can tell the difference. \n\"Yes, we have done that,\" says Ahmed Elgammal [director of the Art and Artificial Intelligence Lab at Rutgers University in New Jersey]. \"We mixed human-generated art and art from machines, and posed questions &mdash; direct ones, such as 'Do you think this painting w",
        "id": 2127660,
        "language": null,
        "link": "https://slashdot.org/story/25/02/15/0412246/what-if-people-like-ai-generated-art-better?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What If People Like AI-Generated Art Better?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T17:29:14+00:00",
        "description": "\"Meta is involved in a class action lawsuit alleging copyright infringement, a claim the company disputes...\" writes the tech news site Hot Hardware. \n\nBut the site adds that newly unsealed court documents \"reveal that Meta allegedly used a minimum of 81.7TB of illegally torrented data sourced from shadow libraries to train its AI models.\"\n\nInternal emails further show that Meta employees expressed concerns about this practice. Some employees voiced strong ethical objections, with one noting that using content from sites like LibGen, known for distributing copyrighted material, would be unethical. A research engineer with Meta, Nikolay Bashlykov, also noted that \"torrenting from a corporate laptop doesn't feel right,\" highlighting his discomfort surrounding the practice. \n\nAdditionally, the documents suggest that these concerns, including discussions about using data from LibGen, reached CEO Mark Zuckerberg, who may have ultimately approved the activity. Furthermore, the documents sh",
        "id": 2127331,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/16/0346210/lawsuit-accuses-meta-of-training-ai-on-torrented-82tb-dataset-of-pirated-books?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lawsuit Accuses Meta Of Training AI On Torrented 82TB Dataset Of Pirated Books",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T16:24:11+00:00",
        "description": "Yahoo Finance shares an interesting prediction. Amazon has an \"under-the-radar robot push\" that \"could boost its profit margins big-time, Morgan Stanley managing director Brian Nowak said.\"\n\n\nNowak said Amazon has quietly developed six significant next-generation fulfillment centers in the past three years that bring automation front and center... Amazon now has industrial robots that can increase efficiencies across the storage, inventory management, pick and packing, and sorting order fulfillment processes. \nFulfillment costs make up about 20% of Amazon's retail revenue, so he reasoned that automation could have a significant impact on long-term operating profit potential. Nowak says if 30% to 40% of Amazon's US units were fulfilled through next-generation robotics-enabled warehouses by 2030, it could lead to $10 billion-plus of savings... The investments in robots may already be paying off. Amazon's North America retail operating margins on a trailing 12-month basis have risen for",
        "id": 2126997,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/16/0241242/amazon-tests-robots-for-automating-fulfillment-centers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Tests Robots For Automating Fulfillment Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T13:09:05+00:00",
        "description": "Luigi Mangione faces first-degree murder charges. On Valentine's Day he posted his first public comments online, reports People magazine, with Mangione saying he's grateful for the support he's receiving:\n\nEarlier this week, Mangione accepted $297,000 in donations to cover his legal bills from the December 4 Legal Committee, which is stewarding a fundraiser on GiveSendGo for his legal defense, according to a post shared by the group. (A source with knowledge of the situation confirmed to PEOPLE that the post was genuine.) The committee &mdash; named after the death date of Thompson &mdash; said the donations were offered by over 10,000 individual supporters. Mangione's lead attorney, Karen Friedman Agnifilo, told the committee that Mangione \"very much appreciates the outpouring of support....\" \n\nHis federal murder charges could land him the death penalty, and he also faces state murder charges that accuse him of committing an act of terrorism.<p><div class=\"share_submission\" style=\"p",
        "id": 2126054,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/16/0040252/alleged-ceo-shooter-luigi-mangione-raises-297k-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Alleged 'CEO Shooter' Luigi Mangione Raises $297K Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T08:49:04+00:00",
        "description": "In January the TIOBE Index (estimating programming language popularity) declared Python their language of the year. (Though it was already #1 in their rankings, it had showed a 9.3% increase in their ranking system, notes InfoWorld.) TIOBE CEO Paul Jansen says this reflects how easy Python is to learn, adding that \"The demand for new programmers is still very high\" (and that \"developing applications completely in AI is not possible yet.\") \n\nIn fact on February's version of the index, the top ten looks mostly static. The only languages dropping appear to be very old languages. Over the last 12 months C and PHP have both fallen on the index &mdash; C from the #2 to the #4 spot, and PHP from #10 all the way to #14. (Also dropping is Visual Basic, which fell from #9 to #10.) \n\nBut TechRepublican cites another factor that seems to be affecting the rankings: language speed.\n\n\nFast programming languages are gaining popularity, TIOBE CEO Paul Jansen said in the TIOBE Programming Community In",
        "id": 2125158,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/02/16/0332258/are-fast-programming-languages-gaining-in-popularity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Are Fast Programming Languages Gaining in Popularity?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T06:38:32+00:00",
        "description": "Bloomberg reports that Apple's long-promised overhaul for Siri \"is facing engineering problems and software bugs, threatening to postpone or limit its release, according to people with knowledge of the matter....\"\n\nLast June, Apple touted three major enhancements coming to Siri: \n\n- the ability to tap into a customer's data to better answer queries and take actions.\n- a new system that would let the assistant more precisely control apps.\n- the capability to see what's currently on a device's screen and use that context to better serve users.... \n\nThe goal is to ultimately offer a more versatile Siri that can seamlessly tap into customers' information and communication. For instance, users will be able to ask for a file or song that they discussed with a friend over text. Siri would then automatically retrieve that item. Apple also has demonstrated the ability for Siri to quickly locate someone's driver's license number by reviewing their photos... Inside Apple, many employees testing",
        "id": 2124765,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/02/16/0138205/ai-bugs-could-delay-upgrades-for-both-siri-and-alexa?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Bugs Could Delay Upgrades for Both Siri and Alexa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T03:23:37+00:00",
        "description": "Long-time Slashdot reader shanen has been testing AI clients. (They report that China's DeepSeek \"turned out to be extremely good at explaining why I should not trust it. Every computer security problem I ever thought of or heard about and some more besides.\") \n\nThen they wondered if there's also government censorship:\n\nIt's like the accountant who gets asked what 2 plus 2 is. After locking the doors and shading all the windows, the accountant whispers in your ear: \"What do you want it to be...?\" So let me start with some questions about DeepSeek in particular. Have you run it locally and compared the responses with the website's responses? My hypothesis is that your mileage should differ... \n\nIt's well established that DeepSeek doesn't want to talk about many \"political\" topics. Is that based on a distorted model of the world? Or is the censorship implemented in the query interface after the model was trained? My hypothesis is that it must have been trained with lots of data because",
        "id": 2124306,
        "language": null,
        "link": "https://ask.slashdot.org/story/25/02/15/2047258/ask-slashdot-what-would-it-take-for-you-to-trust-an-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ask Slashdot: What Would It Take For You to Trust an AI?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-16T01:13:43+00:00",
        "description": "\"Reddit Answers\" uses generative AI to answer questions using what past Reddittors have posted. Announced in December, Reddit now plans to integrate it into their search results, reports TechCrunch, with Reddit's CEO saying the idea has \"incredible monetization potential.\" \n\nAnd yet Reddit's stock fell 14% this week. CNBC's headline? \"Reddit shares plunge after Google algorithm change contributes to miss in user numbers.\"\n\n\nA Google search algorithm change caused some \"volatility\" with user growth in the fourth quarter, but the company's search-related traffic has since recovered in the first quarter, Reddit CEO Steve Huffman said in a letter to shareholders. \"What happened wasn't unusual &mdash; referrals from search fluctuate from time to time, and they primarily affect logged-out users,\" Huffman wrote. \"Our teams have navigated numerous algorithm updates and did an excellent job adapting to these latest changes effectively....\" Reddit has said it is working to convince logged-out ",
        "id": 2123999,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/16/007234/despite-plans-for-ai-powered-search-reddits-stock-fell-14-this-week?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Despite Plans for AI-Powered Search, Reddit's Stock Fell 14% This Week",
        "vote": 0
    }
]