[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T18:13:07.287168+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T17:30:12+00:00",
        "description": "The sheer flexibility of stories is but one of many reasons why I enjoy the horror genre. Being frightened isn't exclusive to titles within the genre itself. Anything, anywhere, could elicit a fright, the scale of which often varies depending on the person. \n\nSome prefer nonstop tension, perhaps a consistently paced stream of scares assaulting their senses. Others may prefer a palpable atmosphere of dread - nothing is going to jump out and scream at them, but it continuously escalates, messing with your mind until the anticipation drives you nearly insane. And there's no end to the list of things that can make someone afraid.\n\nThroughout the decades of horror games, films, comic books and novels, it's interesting how some of the best horror stories can be so different from each other, yet often find the same destination. \n\nTwo of the best horror games released this year - Dying Light: The Beast and Silent Hill f - found their way to audiences within the same week.",
        "id": 3684001,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=WXWoMbOGC-8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WXWoMbOGC-8/hqdefault.jpg",
        "title": "Dying Light: The Beast And Silent Hill f Bring Back PURE FEAR In Video Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T15:47:40.227872+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T15:30:07+00:00",
        "description": "Before you drop $69.99 on Digimon Story: Time Stranger, here are 15 essential details you need to know. This upcoming RPG mixes sci-fi storytelling, strategic battles, and monster taming mechanics gameplay into a more feature-complete package than ever before. As such, it’s quickly become one of the more anticipated and promising entries in the franchise.\n\nAnd you don’t need to be familiar with prior entries to enjoy Time Stranger; after all, it’s a stand-alone entry with its own cast of characters and unique narrative.There’s a bevy of added features and mechancis from the the classic Cyber Sleuth worth getting exciting about.",
        "id": 3683349,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=8QiG8s_bBwg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8QiG8s_bBwg/hqdefault.jpg",
        "title": "Digimon Story: Time Stranger - 15 Things You Need To Know Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T14:40:52.629694+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T13:45:10+00:00",
        "description": "DICE are positioning Battlefield 6 as both a return to form and a bold new chapter for their flagship shooter series following Battlefield 2042’s fallout. Bolstering Battlefield 6’s hype is as much what it leaves out by what it adds: 64-player battles are in, replacing large-scale 128-player matches; the more refined Classic Class System returns in place of the divisive Specialist Class System; and a semi-modern, more grounded setting restores the series’ signature grit in place of 2042’s futuristic dystopia. \n\nExpanded destruction mechanics across a suite of tightly designed maps, soundtracked by a hyper-aggressive War Tapes audio mix, headline Battlefield 6’s additions. \n\nEarly beta feedback suggests this could be the comeback the series needs; if Battlefield’s core ingredients - squad-based gameplay, immersive, large-scale battles, vehicles, tactics, and emergent moments - are present and correct, there’s nothing stopping Battlefield 6 from reuniting its scattered fanbase.",
        "id": 3683032,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=mLVpdD1e7Qc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mLVpdD1e7Qc/hqdefault.jpg",
        "title": "Battlefield 6 vs Battlefield 2042 -  15 BIGGEST DIFFERENCES",
        "vote": 0
    }
]