[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T23:50:50.766614+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T22:48:00+00:00",
        "description": "\"Swiss voters have backed plans for electronic identity cards by a wafer-thin margin,\" reports the Guardian, \"in the second nationwide vote on the issue.\"\nIn a referendum on Sunday, 50.4% of voters supported an electronic ID card, while 49.6% were against, confounding pollsters who had forecast stronger support for the \"yes\" vote. Turnout was 49.55%, higher than expected... [V]oters rejected an earlier version of the e-ID in 2021, largely over objections to the role of private companies in the system. In response to these concerns, the Swiss state will now provide the e-ID, which will be optional and free of charge... To ensure security the e-ID is linked to a single smartphone, users will have to get a new e-ID if they change their device... An ID card containing biometric data &mdash; fingerprints &mdash; will be available from the end of next year. \n\nCritics of the e-ID scheme raised data protection concerns and said it opened the door to mass surveillance. They also fear the volun",
        "id": 3686487,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/28/2156240/switzerland-approves-digital-id-in-narrow-vote-uk-proposes-one-too?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Switzerland Approves Digital ID In Narrow Vote, UK Proposes One Too",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T21:13:08.330711+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T20:37:00+00:00",
        "description": "Tim Berners-Lee writes in a new article in the Guardian that \"Somewhere between my original vision for web 1.0 and the rise of social media as part of web 2.0, we took the wrong path\n\n\nToday, I look at my invention and I am forced to ask: is the web still free today? No, not all of it. We see a handful of large platforms harvesting users' private data to share with commercial brokers or even repressive governments. We see ubiquitous algorithms that are addictive by design and damaging to our teenagers' mental health. Trading personal data for use certainly does not fit with my vision for a free web. On many platforms, we are no longer the customers, but instead have become the product. Our data, even if anonymised, is sold on to actors we never intended it to reach, who can then target us with content and advertising... \n\nWe have the technical capability to give that power back to the individual. Solid is an open-source interoperable standard that I and my team developed at MIT more t",
        "id": 3685940,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/28/1958242/tim-berners-lee-urges-new-open-source-interoperable-data-standard-protections-from-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Tim Berners-Lee Urges New Open-Source Interoperable Data Standard, Protections from AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T21:13:08.467327+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T19:37:00+00:00",
        "description": "\"Facebook and Instagram owner Meta is launching paid subscriptions for users who do not want to see adverts in the UK,\" reports the BBC:\n\n\nThe company said it would start notifying users in the coming weeks to let them choose whether to subscribe to its platforms if they wish to use them without seeing ads. EU users of its platforms can already pay a fee starting from &euro;5.99 (&pound;5) a month to see no ads &mdash; but subscriptions will start from &pound;2.99 a month for UK users. \n\n\"It will give people in the UK a clear choice about whether their data is used for personalised advertising, while preserving the free access and value that the ads-supported internet creates for people, businesses and platforms,\" Meta said. But UK users will not have an option to not pay and see \"less personalised\" adverts &mdash; a feature Meta added for EU users after regulators raised concerns... \n\nMeta said its own model would see its subscription for no ads cost &pound;2.99 a month on the web or",
        "id": 3685941,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/28/1934254/facebook-and-instagram-offer-uk-users-an-ad-stopping-subscription-fee?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Facebook and Instagram Offer UK Users an Ad-Stopping Subscription Fee",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T19:42:12.235463+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T18:26:00+00:00",
        "description": "IEEE Spectrum ranks the popularity of programming languages &mdash; but is there a problem? Programmers \"are turning away from many of these public expressions of interest. Rather than page through a book or search a website like Stack Exchange for answers to their questions, they'll chat with an LLM like Claude or ChatGPT in a private conversation.\"\n\nAnd with an AI assistant like Cursor helping to write code, the need to pose questions in the first place is significantly decreased. For example, across the total set of languages evaluated in the Top Programming Languages, the number of questions we saw posted per week on Stack Exchange in 2025 was just 22% of what it was in 2024... \n\nHowever, an even more fundamental problem is looming in the wings... In the same way most developers today don't pay much attention to the instruction sets and other hardware idiosyncrasies of the CPUs that their code runs on, which language a program is vibe coded in ultimately becomes a minor detail... ",
        "id": 3684897,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/28/1823244/will-ai-mean-bring-an-end-to-top-programming-language-rankings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Will AI Mean Bring an End to Top Programming Language Rankings?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T19:42:12.353324+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T16:34:00+00:00",
        "description": "\"Today's AIs are book smart,\" reports the Wall Street Journal. \"Everything they know they learned from available language, images and videos. To evolve further, they have to get street smart.\" \nAnd that requires \"world models,\" which are \"gaining momentum in frontier research and could allow technology to take on new roles in our lives.\"\nThe key is enabling AI to learn from their environments and faithfully represent an abstract version of them in their \"heads,\" the way humans and animals do. To do it, developers need to train AIs by using simulations of the world. Think of it like learning to drive by playing \"Gran Turismo\" or learning to fly from \"Microsoft Flight Simulator.\" These world models include all the things required to plan, take actions and make predictions about the future, including physics and time... There's an almost unanimous belief among AI pioneers that world models are crucial to creating next-generation AI. And many say they will be critical to someday creating ",
        "id": 3684898,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/27/0632215/researchers-including-google-are-betting-on-virtual-world-models-for-better-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Researchers (Including Google) are Betting on Virtual 'World Models' for Better AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T19:42:12.545771+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T15:34:00+00:00",
        "description": "The BBC reports that a million-year-old human skull found in China suggests that the human species \"began to emerge at least half a million years earlier than we thought, researchers are claiming in a new study.\"\n\nIt also shows that we co-existed with other sister species, including Neanderthals, for much longer than we've come to believe, they say. \n\nThe scientists claim their analysis \"totally changes\" our understanding of human evolution and, if correct, it would certainly rewrite a key early chapter in our history. But other experts in a field where disagreement over our emergence on the planet is rife, say that the new study's conclusions are plausible but far from certain. \n\n\nThe discovery, published in the leading scientific journal Science, shocked the research team, which included scientists from a university in China and the UK's Natural History Museum. \"From the very beginning, when we got the result, we thought it was unbelievable. How could that be so deep into the past?\"",
        "id": 3684899,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/09/27/2250232/million-year-old-skull-rewrites-human-evolution-scientists-claim?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Million-Year-Old Skull Rewrites Human Evolution, Scientists Claim",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T19:42:12.693022+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T14:34:00+00:00",
        "description": "Six months ago California had 48% more public and \"shared\" private EV chargers than gasoline nozzles. (In March California had 178,000 public and shared private EV chargers, versus about 120,000 gas nozzles.) \n\nSince then they've added 23,000 more public/shared charging ports &mdash; and announced this week that there's now 68% more EV charger ports than the number of gasoline nozzles statewide. \"Thanks to the state's ever-expanding charger network, 94% of Californians live within 10 minutes of an EV charger,\" according to the announcement from the state's energy policy agency. And the California Energy Commission staff told CleanTechnica they expect more chargers in the future. \"We are watching increased private investment by consortiums like IONNA and OEMs like Rivian, Ford, and others that are actively installing EV charging stations throughout the state.\" \n\nClean Technica notes in 2019, the state had roughly 42,000 charging ports and now there are a little over 200,000. (And today",
        "id": 3684900,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/09/28/0553221/california-now-has-68-more-ev-chargers-than-gas-nozzles-continues-green-energy-push?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California Now Has 68% More EV Chargers Than Gas Nozzles, Continues Green Energy Push",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T19:42:12.846816+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T11:34:00+00:00",
        "description": "Paris-based AI giant Mistral \"is pushing to improve its models,\" reports the Wall Street Journal, \"by looking inside legacy enterprises that hold some of the world's last untapped data reserves....\"\n\nMistral's approach will be to form partnerships with enterprises to further train existing models on their own proprietary data, a phenomenon known as post-training... [At Dutch chip-equipment company ASML], Mistral embeds its own solutions architects, applied AI engineers and applied scientists into the enterprise to work on improving models with the company's data. [While Mistral sells some models under a commercial license], this co-creation strategy allows Mistral to make money off the services side of its business and afford to give away its open source AI free of charge, while improving model performance for the customer with more industry context... \n\nThis kind of hand-holding approach is necessary for most companies to tackle AI successfully, said Arthur Mensch [co-founder and chi",
        "id": 3684901,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/27/1640203/mistrals-new-plan-for-improving-its-ai-models-training-data-from-enterprises?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mistral's New Plan for Improving Its AI Models: Training Data from Enterprises",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T19:42:13.033770+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T07:34:00+00:00",
        "description": "Long-time Slashdot reader theodp says America's Patent and Trademark Office (USPTO) has granted a patent to Tableau (Salesforce's visual analytics platform) &mdash; for a patent covering \"Data Processing For Visualizing Hierarchical Data\":\n\n\n\"A provided data model may include a tree specification that declares parent-child relationships between objects in the data model. In response to a query associated with objects in the data model: employing the parent-child relationships to determine a tree that includes parent objects and child objects from the objects based on the parent-child relationships; determining a root object based on the query and the tree; traversing the tree from the root object to visit the child objects in the tree; determining partial results based on characteristics of the visited child objects such that the partial results are stored in an intermediate table; and providing a response to the query that includes values based on the intermediate table and the parti",
        "id": 3684902,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/28/044220/should-salesforces-tableau-be-granted-a-patent-on-visualizing-hierarchical-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Should Salesforce's Tableau Be Granted a Patent On 'Visualizing Hierarchical Data'?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T19:42:13.151722+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T03:34:00+00:00",
        "description": "\"We've decided to support image-based search,\" announced the product manager for Firefox Search. Powered by the AI-driven Google Lens search technology, they promise the new feature offers \"a frictionless, fast, and a curiosity-sparking way to (as Google puts it) 'search what you see'.\"\n\n\nWith just a right-click on any image, you'll be able to: \n- Find similar products, places, or objects\n- Copy, translate, or search text from images\n- Get inspiration for learning, travel, or shopping \n\n\nLook for the new \"Search Image with Google Lens\" option in your right-click menu (tagged with a NEW badge at first). This is a desktop-only feature, and it will start gradually rolling out worldwide. Note: Google must be set as your default search engine for this feature to appear. \nWe'll be listening closely to your feedback as we roll it out. Some of the things we're wondering about: \n\n Does the placement in the context menu align with your expectations?\n Would you prefer the option to choose your v",
        "id": 3684903,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/28/0012206/firefox-will-offer-visual-searching-on-images-with-ai-powered-google-lens?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Firefox Will Offer Visual Searching on Images With AI-Powered Google Lens",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-28T19:42:13.289309+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-28T01:34:00+00:00",
        "description": "Cristian Fleming paid around $70,000 for one of Fisker Ocean's electric mid-size crossover SUVs. Seven months later the company filed for bankruptcy in June of 2024, reports the Verge, \"having only delivered 11,000 vehicles.\" \n\n\"Early adopters were left with cars plagued by battery failures, glitchy software, inconsistent key fobs, and door handles that did not always open. With the company gone, there was no way to fix any issues.\"\n\n\nRegulators logged dozens of complaints as replacement parts vanished. Passionate owners who spent top dollar on high-end trims saw their cars reduced to expensive driveway ornaments. \n\nRather than accept defeat, thousands of Ocean owners have organized into their own makeshift car company. The Fisker Owners Association (FOA) is a nonprofit that's launched third-party apps, built a global parts supply chain, and came together around a future for their orphaned vehicles. It's part car club, part tech startup, part survival mission. Fleming now serves as th",
        "id": 3684904,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/27/2331230/when-this-ev-company-went-bankrupt-its-customers-launched-a-nonprofit-to-keep-their-cars-running?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "When This EV Company Went Bankrupt, Its Customers Launched a Nonprofit to Keep Their Cars Running",
        "vote": 0
    }
]