[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T23:06:19.612296+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T22:50:00+00:00",
        "description": "Longtime Slashdot reader schwit1 shares a report from Reuters: OpenAI said on Tuesday it has banned several ChatGPT accounts with suspected links to the Chinese government entities after the users asked for proposals to monitor social media conversations. In its latest public threat report (PDF), OpenAI said some individuals had asked its chatbot to outline social media 'listening' tools and other monitoring concepts, violating the startup's national security policy.\n \nThe San Francisco-based firm's report raises safety concerns over potential misuse of generative AI amid growing competition between the U.S. and China to shape the technology's development and rules. OpenAI said it also banned several Chinese-language accounts that used ChatGPT to assist phishing and malware campaigns and asked the model to research additional automation that could be achieved through China's DeepSeek. It also banned accounts tied to suspected Russian-speaking criminal groups that used the chatbot to h",
        "id": 3760202,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/07/2057223/openai-bans-suspected-china-linked-accounts-for-seeking-surveillance-proposals",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Bans Suspected China-Linked Accounts For Seeking Surveillance Proposals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T23:06:19.934975+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T22:10:00+00:00",
        "description": "Longtime Slashdot reader kamesh shares a report from TechCrunch: Tech behemoth IBM is teaming up with AI research lab Anthropic to bring AI into its software. Armonk, New York-based IBM announced it will be adding Anthropic's Claude large language model family into some of its software products on Tuesday. The first product to tap Claude will be IBM's integrated development environment, which is already available to a select group of customers. IBM also announced it created a guide in partnership with Anthropic on how enterprises can build, deploy, and maintain enterprise-grade AI agents. Terms of the deal were not disclosed.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+and+IBM+Announce+Strategic+Partnership%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F10%2F07%2F2050249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=",
        "id": 3760203,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/07/2050249/anthropic-and-ibm-announce-strategic-partnership",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic and IBM Announce Strategic Partnership",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T23:06:20.277568+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T21:30:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Smartphone processor and modem maker Qualcomm is acquiring Arduino, the Italian company known mainly for its open source ecosystem of microcontrollers and the software that makes them function. In its announcement, Qualcomm said that Arduino would \"[retain] its brand and mission,\" including its \"open source ethos\" and \"support for multiple silicon vendors.\" Qualcomm didn't disclose what it would pay to acquire Arduino. The acquisition also needs to be approved by regulators \"and other customary closing conditions.\"\n \nThe first fruit of this pending acquisition will be the Arduino Uno Q, a Qualcomm-based single-board computer with a Qualcomm Dragonwing QRB2210 processor installed. The QRB2210 includes a quad-core Arm Cortex-A53 CPU and a Qualcomm Adreno 702 GPU, plus Wi-Fi and Bluetooth connectivity, and combines that with a real-time microcontroller \"to bridge high-performance computing with real-time control.\" \"Arduino will retai",
        "id": 3760204,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/07/2032219/qualcomm-is-buying-arduino-releases-new-raspberry-pi-esque-arduino-board",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Qualcomm Is Buying Arduino, Releases New Raspberry Pi-Esque Arduino Board",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T21:31:12.481218+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T20:50:00+00:00",
        "description": "U.S. GDP growth in the first half of 2025 was driven almost entirely by investment in data centers and information processing technology. The GDP growth would have been just 0.1% on an annualized basis without these technology-related categories, according to Harvard economist Jason Furman. Investment in information-processing equipment and software accounted for only 4% of U.S. GDP during this period but represented 92% of GDP growth. \n\nRenaissance Macro Research estimated in August that the dollar value contributed to GDP growth by AI data-center buildout had surpassed U.S. consumer spending for the first time. Consumer spending makes up two-thirds of GDP. Tech giants including Microsoft, Google, Amazon, Meta and Nvidia poured tens of billions of dollars into building and upgrading data centers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Without+Data+Centers%2C+GDP+Growth+Was+0.1%25+in+the+First+Half+of+2025%2",
        "id": 3759630,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/07/2012240/without-data-centers-gdp-growth-was-01-in-the-first-half-of-2025-harvard-economist-says",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Without Data Centers, GDP Growth Was 0.1% in the First Half of 2025, Harvard Economist Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T21:31:12.543713+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T20:10:00+00:00",
        "description": "An anonymous reader shares a report: Changes are coming to the Play Store in spite of a concerted effort from Google to maintain the status quo. The company asked the US Supreme Court to freeze parts of the Play Store antitrust ruling while it pursued an appeal, but the high court has rejected that petition. That means the first elements of the antitrust remedies won by Epic Games will have to be implemented in mere weeks. \n\nThe app store case is one of three ongoing antitrust actions against Google, but it's the furthest along of them. Google lost the case in 2023, and in 2024, US District Judge James Donato ordered a raft of sweeping changes aimed at breaking Google's illegal monopoly on Android app distribution. In July, Google lost its initial appeal, leaving it with little time before the mandated changes must begin. \n\n[...] The more dramatic changes are not due until July 2026, but this month will still bring major changes to Android apps. Google will have to allow developers to",
        "id": 3759631,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/07/201229/play-store-changes-coming-this-month-as-scotus-declines-to-freeze-antitrust-remedies",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Play Store Changes Coming This Month as SCOTUS Declines To Freeze Antitrust Remedies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T19:56:24.034108+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T19:30:00+00:00",
        "description": "An anonymous reader shares a report: YouTube megastar Jimmy Donaldson, the creator behind the platform's biggest channel MrBeast, is worried there are \"scary times\" ahead for the creator economy as AI video tools make it increasingly difficult to tell what is real. \n\n\"When AI videos are just as good as normal videos, I wonder what that will do to YouTube and how it will impact the millions of creators currently making content for a living.. scary times,\" Donaldson said on X on Sunday. Donaldson's concerns come on the heels of OpenAI's release of a Sora social media platform able to AI generated short-form videos, including of individuals who \"upload\" themselves onto the app. Meta launched its similar video-generating Vibes platform last month.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Youtube's+Biggest+Star+MrBeast+Fears+AI+Could+Impact+'Millions+of+Creators'+After+Sora+Launch%3A+https%3A%2F%2Fnews.slashdot.org",
        "id": 3759078,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/07/1913224/youtubes-biggest-star-mrbeast-fears-ai-could-impact-millions-of-creators-after-sora-launch",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Youtube's Biggest Star MrBeast Fears AI Could Impact 'Millions of Creators' After Sora Launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T19:56:24.139293+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T18:56:00+00:00",
        "description": "Samsung, Hisense, TCL and Sony presented RGB LED TVs at IFA in Berlin last month. The technology replaces each standard LED backlight with a trio of red, green and blue LEDs to expand the range of colors a screen can display. Each manufacturer is using different name for the technology: Hisense has called it RGB-MiniLED, Samsung named it Micro RGB, Sony introduced Sony RGB Technology, and TCL branded it RGB Micro LED. The companies previously tried other monikers at CES. \n\nAvi Greengart of Techsponential told PCMag the difference in color fidelity was not subtle when he viewed Samsung's version. PCMag found the Hisense 116UX the brightest TV with the widest color range he had evaluated. Both the 116-inch Hisense and Samsung's 115-inch model list at $30,000. TCL introduced RGB sets in China at prices starting at the equivalent of $1,150 for a 65-inch model. Greengart cautioned that it remained unclear whether the technology would rapidly decline in price or stay expensive like MicroLED",
        "id": 3759079,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/07/1855232/rgb-led-is-getting-its-time-in-the-spotlight-will-tv-shoppers-tune-in",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "RGB LED Is Getting Its Time in the Spotlight. Will TV Shoppers Tune In?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T18:25:38.007960+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T18:11:00+00:00",
        "description": "An anonymous reader shares a report: It's been a while since Apple last mocked Windows security, but the iPhone maker has just released an ad that hits Windows hard. The eight-minute commercial pokes fun at the CrowdStrike Blue Screen of Death (BSOD) issue that took down millions of Windows machines last year. \n\nApple's ad follows The Underdogs, a fictional company that's about to attend a trade show, before a PC outage causes chaos and a Blue Screen of Death shuts down machines at the convention. If it wasn't clear Apple was mocking the infamous CrowdStrike incident, an IT expert appears in the middle of the ad and starts discussing kernel-level functionality, the core part of an operating system that has unrestricted access to system memory and hardware.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Turned+the+CrowdStrike+BSOD+Issue+Into+an+Anti-PC+Ad%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F10%2F",
        "id": 3758307,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/07/1811221/apple-turned-the-crowdstrike-bsod-issue-into-an-anti-pc-ad",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Turned the CrowdStrike BSOD Issue Into an Anti-PC Ad",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T18:25:38.113791+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T17:28:00+00:00",
        "description": "The Danish government wants to introduce a ban on several social media platforms for children under the age of 15, as Prime Minister Mette Frederiksen announced Tuesday. From a report: \"Mobile phones and social media are stealing our children's childhood,\" she said in her opening speech to the Danish parliament, the Folketing. \"We have unleashed a monster,\" Frederiksen said, noting that almost all Danish seventh graders, where pupils are typically 13 or 14 years old, own a cellphone. \n\n\"I hope that you here in the chamber will help tighten the law so that we take better care of our children here in Denmark,\" she added. However, Frederiksen did not give further details on what such a ban would entail, nor does a bill on an age limit appear in the government's legislative program for the upcoming parliamentary year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Denmark+Aims+To+Ban+Social+Media+For+Children+Under+15%2",
        "id": 3758308,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/07/1728206/denmark-aims-to-ban-social-media-for-children-under-15-pm-says",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Denmark Aims To Ban Social Media For Children Under 15, PM Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T18:25:38.232314+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T16:45:00+00:00",
        "description": "OpenAI has signed about $1 trillion in deals this year for computing power to run its AI models, commitments that dwarf its revenue and raise questions about how it can fund them. From a report: Monday's deal with chipmaker AMD follows similar agreements with Nvidia, Oracle and CoreWeave, as OpenAI races to find the computing power it thinks it will need to run services such as ChatGPT. \n\nThe deals would give OpenAI access to more than 20 gigawatts of computing capacity, roughly equivalent to the power from 20 nuclear reactors, over the next decade. Each 1GW of AI computing capacity costs about $50bn to deploy in today's prices, according to estimates by OpenAI executives, making the total cost about $1tn. The deals have bound some of the world's biggest tech groups to OpenAI's ability to become a profitable business that can meet its increasingly steep financial obligations.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?",
        "id": 3758309,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/07/1556256/openais-computing-deals-top-1-trillion",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI's Computing Deals Top $1 Trillion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T16:47:16.107272+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T16:02:00+00:00",
        "description": "AmiMoJo writes: The Irish Government's basic income scheme for artists is set to become a permanent fixture from next year, with 2,000 new places to be made available under Budget 2026. Minister for Culture Patrick O'Donovan has secured agreement with other government departments to continue and expand the initiative, which had previously operated on a pilot basis. Participants in the scheme receive a weekly payment of $379.50. \n\nThe pilot programme, launched in 2022, provided basic income support to 2,000 artists and creative arts workers across Ireland. It aimed to support the arts sector's recovery following the COVID-19 pandemic, during which many artists experienced significant income loss due to restrictions on live performances and events. The scheme provides unconditional, regular payments to eligible artists and creative workers, allowing them to focus on their practice without the pressure of commercial viability. It is not means-tested and operates independently of social w",
        "id": 3757323,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/07/1548248/irish-basic-income-support-scheme-for-artists-to-be-made-permanent",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Irish Basic Income Support Scheme For Artists To Be Made Permanent",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T16:47:16.206594+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T15:22:00+00:00",
        "description": "Gov. Gavin Newsom has signed a law banning excessively loud advertisements on streaming platforms like Netflix, Hulu and Amazon Prime that could become a de facto national standard. From a report: The new California law is aimed at addressing what the Federal Communications Commission has called a \"troubling jump\" in TV ad noise complaints, fueled by streamers airing commercials louder than the shows and movies they accompany. \n\nIt's modeled off a federal law passed in 2010 that caps ad volumes on cable and broadcast TV, but doesn't apply to streaming services. Given the Golden State's massive sway in the entertainment industry, the new law may strong-arm streamers into shushing commercials nationwide. \"We heard Californians loud and clear, and what's clear is that they don't want commercials at a volume any louder than the level at which they were previously enjoying a program,\" Newsom said in a statement. \"California is dialing down this inconvenience across streaming platforms.\"<p>",
        "id": 3757324,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/10/07/1439238/california-law-forces-netflix-hulu-to-turn-down-ad-volumes",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California Law Forces Netflix, Hulu To Turn Down Ad Volumes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T15:13:20.371663+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T14:41:00+00:00",
        "description": "The New York Times: John Clarke, Michel H. Devoret and John M. Martinis were awarded the Nobel Prize in Physics on Tuesday in Sweden for showing that two properties of quantum mechanics, the physical laws that rule the subatomic realm, could be observed on a system large enough to see with the naked eye. They will share a prize of 11 million Swedish kroner, or around $1.17 million. \n\n\"There is no advanced technology today that does not rely on quantum mechanics,\" Olle Eriksson, chairman of the Nobel Committee for Physics, said during the announcement of the award. The laureates' discoveries, he added, paved the way for technologies like the cellphone, cameras and fiber optic cables. \n\nIt also helped lay the groundwork for current attempts to build a quantum computer, a device that could compute and process information at speeds that would not be possible with classical computer. Martinis worked at Google from 2014 to 2020 to build a quantum computer and led the quantum supremacy exper",
        "id": 3756467,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/07/1420233/nobel-prize-in-physics-is-awarded-for-work-in-quantum-mechanics",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nobel Prize in Physics Is Awarded for Work in Quantum Mechanics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T15:13:20.444792+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T14:01:00+00:00",
        "description": "India's electricity grid is struggling to accommodate the nation's economic expansion and isn't adequately equipped to handle future data center demand. Goldman Sachs estimates that power required from utilities needs roughly 7.2% annual growth between fiscal years 2025 and 2035, up from a prior 5.6%. \n\nIndia's data center base sits in the low single gigawatts today, but Bernstein forecasts reach 5 to 6 gigawatts by 2030. AI servers draw five to seven times the power of a legacy server rack, according to HSBC. Solar farms can be built in 12 to 24 months, but they flood the grid when daytime demand is comparatively low and then fade as households and commercial loads climb after 5 PM. On Goldman's full-year models, the system runs a 1 to 4% energy deficit by fiscal years 2034 through 2035. \n\nAssessments suggest India may need roughly 140 gigawatts of additional coal capacity by fiscal year 2035 versus 2023 levels. The government's current target is roughly 87 gigawatts by fiscal year 2",
        "id": 3756468,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/07/138252/indias-grid-cannot-keep-up-with-its-ambitions",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India's Grid Cannot Keep Up With Its Ambitions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T13:40:05.840030+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from The Hill: A Senate report released (PDF) Monday says AI and automation could replace nearly 100 million jobs across various industries over the next decade. The report, conducted by Democratic staffers on the Senate Health, Education, Labor and Pensions (HELP) Committee, led by Sen. Bernie Sanders (I-Vt.), outlines how AI and automation will impact the American economy and workforce. Sanders, the ranking member on the HELP Committee, has warned of the consequences widespread use of AI and automation can have for workers.\n \nAs part of their investigation, staffers asked ChatGPT, OpenAI's chatbot, to predict the impact of AI and automation on certain industries. Of the 20 workforces ChatGPT said would be most affected by the technological rush, 15 will see more than half of their workforces replaced by AI and automation over the next decade. The workforce most impacted will be fast food and counter employees. According to the report, more than 3 ",
        "id": 3755553,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/10/06/2342256/senate-dem-report-finds-almost-100-million-jobs-could-be-lost-to-ai",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Senate Dem Report Finds Almost 100 Million Jobs Could Be Lost To AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T10:29:44.937409+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T10:00:00+00:00",
        "description": "Microsoft is eliminating all known workarounds that let users install Windows 11 without an internet connection or Microsoft account, forcing everyone through the online setup process. The Verge reports: \"We are removing known mechanisms for creating a local account in the Windows Setup experience (OOBE),\" says Amanda Langowski, the lead for the Windows Insider Program. \"While these mechanisms were often used to bypass Microsoft account setup, they also inadvertently skip critical setup screens, potentially causing users to exit OOBE with a device that is not fully configured for use.\"\n \nThe changes mean Windows 11 users will need to complete the OOBE screens with an internet connection and Microsoft account in future versions of the OS. Microsoft already removed the \"bypassnro\" workaround earlier this year, and today's changes also disable the \"start ms-cxh:localonly\" command that Windows 11 users discovered after Microsoft's previous changes. Using this command now resets the OOBE p",
        "id": 3754096,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/06/2338211/microsoft-is-plugging-more-holes-that-let-you-use-windows-11-without-an-online-account",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Is Plugging More Holes That Let You Use Windows 11 Without an Online Account",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T07:38:08.326737+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T07:00:00+00:00",
        "description": "alternative_right shares a report from ScienceDaily: Scientists may have finally uncovered the mystery behind ultra-high-energy cosmic rays -- the most powerful particles known in the universe. A team from NTNU suggests that colossal winds from supermassive black holes could be accelerating these particles to unimaginable speeds. These winds, moving at half the speed of light, might not only shape entire galaxies but also fling atomic nuclei across the cosmos with incredible energy. [...]\n \nBut what on earth does that mean? The Milky Way is the neighborhood in the universe where you and I live. Our Sun and solar system are part of this galaxy, along with at least 100 billion other stars. \"There is a black hole called Sagittarius-A* located right in the centre of the Milky Way. This black hole is currently in a quiet phase where it isn't consuming any stars, as there is not enough matter in the vicinity,\" [said postdoctoral fellow Enrico Peretti from the Universite Paris Cite]. This co",
        "id": 3753134,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/06/2332220/black-holes-might-hold-the-key-to-a-60-year-cosmic-mystery",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Black Holes Might Hold the Key To a 60-Year Cosmic Mystery",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T04:35:12.578051+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: The heads of UK physics departments say their subject is facing a national crisis as one in four warns that their university departments are in danger of closing because of funding pressures. In an anonymous survey of department heads by the Institute of Physics (IoP), 26% said they faced potential closure of their department within the next two years, while 60% said they expected courses to be reduced. Four out of five departments said they were making staff cuts, and many were considering mergers or consolidation in what senior physicists described as a severe threat to the UK's future success. [...]\n \nTo avoid \"irreversible damage\", the IoP is asking for immediate government action including funding to support existing labs and research facilities, as well as setting up an \"early warning system\" to monitor departments at risk of closure, and reduce pressures affecting international student recruitment. In the longer term it is ",
        "id": 3752327,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/06/236216/quarter-of-uk-university-physics-departments-at-risk-of-closing-survey-finds",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Quarter of UK University Physics Departments At Risk of Closing, Survey Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T02:51:54.257840+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T02:10:00+00:00",
        "description": "Paramount has acquired The Free Press, Bari Weiss's Substack-born media outlet, for $150 million and appointed Weiss as editor-in-chief of CBS News. The move effectively places a conservative-leaning Substack writer at the helm of a legacy news network, following the FCC's approval of the Skydance-Paramount merger, which required CBS to feature a broader \"diversity of viewpoints from across the political and ideological spectrum.\" The Verge reports: Before starting The Free Press, Weiss worked as an op-ed and book review editor at The Wall Street Journal from 2013 to 2017 and later became an op-ed editor and writer at The New York Times to expand the publication's stable of conservative columnists during Donald Trump's first term. She resigned from the NYT in 2020, citing an \"illiberal environment.\"\n \nWeiss started a Substack newsletter in 2021, called Common Sense, which later evolved into The Free Press, touting itself as a media company \"built on the ideals that were once the bedro",
        "id": 3751968,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/06/2320224/cbs-news-was-just-taken-over-by-a-substack",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "CBS News Was Just Taken Over By a Substack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T02:51:54.394120+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T01:30:00+00:00",
        "description": "AstraZeneca has licensed Algen Biotechnologies' AI-powered gene-editing platform, AlgenBrain, to develop immune-related therapies in a deal worth up to $555 million. Reuters reports: AstraZeneca will get exclusive rights to develop and sell approved therapies, if any, that target immune system-related disorders in exchange for upfront and milestone payments to Algen. AstraZeneca has been advancing its cell and gene therapy capabilities through acquisitions and partnerships as it works towards its target of $80 billion in sales by 2030. Globally too, drugmakers are increasingly turning to artificial intelligence for drug development.\n \nMonday's deal, however, does not include AstraZeneca buying a stake in the company, Algen CEO and co-founder Chun-Hao Huang told Reuters in an interview. \"Together with AstraZeneca's deep expertise in translational science and clinical development, we aim to uncover new biological insights to accelerate the development of novel therapies,\" Huang said. Al",
        "id": 3751969,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/06/2255243/astrazeneca-signs-up-for-555-million-ai-deal-with-algen-to-develop-therapies",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AstraZeneca Signs Up For $555 Million AI Deal With Algen To Develop Therapies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T01:10:48.195529+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T00:50:00+00:00",
        "description": "California biotech entrepreneur and former magician Serhat Gumrukcu has been found guilty of orchestrating the 2018 murder of his business rival Gregory Davis, who had threatened to expose Gumrukcu's fraudulent dealings. He faces sentencing in November. SFGATE reports: Seven years ago, Turkish national Serhat Gumrukcu, 42, of Los Angeles, was negotiating a multimillion-dollar biotech merger built off his work on a supposed HIV cure. The deal was put in jeopardy by a former business partner named Gregory Davis, 49, who had threatened to bring legal action against Gumrukcu for fraudulent activities relating to a previous failed oil commodities deal, the U.S. Attorney's Office said in a news release last week. Gumrukcu, a magician-turned-scientist who admitted to buying his medical degree from a Russian university, lived in a Hollywood mansion and partied with Oscar winners and movie producers, according to VTDigger. He stood to make millions from the merger of his biotech company Enochi",
        "id": 3751584,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/10/06/2249240/california-biotech-tycoon-found-guilty-of-orchestrating-rivals-murder",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "California Biotech Tycoon Found Guilty of Orchestrating Rival's Murder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-07T01:10:48.264988+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-07T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from BleepingComputer: The Redis security team has released patches for a maximum severity vulnerability that could allow attackers to gain remote code execution on thousands of vulnerable instances. Redis (short for Remote Dictionary Server) is an open-source data structure store used in approximately 75% of cloud environments, functioning like a database, cache, and message broker, and storing data in RAM for ultra-fast access. The security flaw (tracked as CVE-2025-49844) is caused by a 13-year-old use-after-free weakness found in the Redis source code and can be exploited by authenticated threat actors using a specially crafted Lua script (a feature enabled by default). Successful exploitation enables them to escape the Lua sandbox, trigger a use-after-free, establish a reverse shell for persistent access, and achieve remote code execution on the targeted Redis hosts.\n \nAfter compromising a Redis host, attackers can steal credentials, deploy mal",
        "id": 3751585,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/06/222222/redis-warns-of-critical-flaw-impacting-thousands-of-instances",
        "manual_status_code": 0,
        "page_rating": 86,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Redis Warns of Critical Flaw Impacting Thousands of Instances",
        "vote": 0
    }
]