[
    {
        "age": null,
        "album": "",
        "author": "FRONTLINE PBS | Official",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-01T21:51:05.072910+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-01T21:37:44+00:00",
        "description": "Less than two weeks after Ahmad al-Sharaa ousted Bashar al-Assad in Syria, a U.S. State Department delegation arrived in Damascus to meet the onetime Al Qaeda commander. This video drawn from the documentary \"Syria After Assad\" shows what they thought of Syria’s new leader; why, for delegation head Barbara Leaf, how al-Sharaa talked about Israel was striking; and why one diplomat says he “walked away impressed.”\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate​.\n\nFor the full story, watch \"Syria After Assad\" starting July 1, 2025, at 7/6c at pbs.org/frontline and in the PBS App, and at 10/9c on PBS stations (check local listings) and FRONTLINE’s YouTube channel. The documentary will also be available on the PBS Documentaries Prime Video Channel. \n\n\"Syria After Assad\" is a FRONTLINE production with Rain Media, Inc. The producers are Martin Smith, Brian Funck and Marcela Gaviria. The co-producers are Hoda Osman and Sc",
        "id": 3062927,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Bar71-VrINc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 109,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Bar71-VrINc/hqdefault.jpg",
        "title": "What U.S. Diplomats Thought After Meeting Jihadi-Turned-Statesman Ahmad al-Sharaa | FRONTLINE (PBS)",
        "vote": 0
    }
]