[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-19T16:33:27.602164+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-19T15:30:08+00:00",
        "description": "Colonel Volgin, or Thunderbolt, is a man with many abilities. It's a pity that the former Russian spy did not find a more productive use for those talents. Or perhaps he was exactly where he needed to be, earning his place among the most terrifying antagonists to ever grace our screens in an era of incredible video games. \n\nWith Metal Gear Solid Delta: Snake Eater inching closer and closer to its release, we thought it would be a good idea to dive into this complicated character's backstory, and perhaps shed a little insight on why he did the things he did when he found Snake was more than a match for his incredible arsenal of skills.",
        "id": 3366560,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=6xacYwNcuOA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6xacYwNcuOA/hqdefault.jpg",
        "title": "The Origins of VOLGIN - Before You Play Metal Gear Solid 3: Delta Snake Eater",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-19T14:22:41.969556+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-19T13:30:30+00:00",
        "description": "Gearbox Entertainment’s iconic looter shooter series is set to return with a bang. Following Borderlands 3’s lukewarm fan reception, Borderlands 4 is set to bring significant upgrade: a bigger, now open, world, a new planet, new Vault Hunters, new enemies, new weapons, and a boatload of fresh mechanics suggest Gearbox Entertainment are gearing up for a return to form. \n\nWe’ve already published a Borderlands 4 preview in our ‘Borderlands 4 - 10 BIG NEW Details You May Not Know’ video, but there’s so much Gearbox Entertainment is bringing to the table in this fourquel that we’ve 15 more big differences to discuss. Whether every evolution resonates with fans is debatable, but so far, fan reception has been positive. Anticipation is building to what could be one this year’s best shooters.",
        "id": 3365343,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=Z2y_3C16d5E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Z2y_3C16d5E/hqdefault.jpg",
        "title": "Borderlands 4 - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy",
        "vote": 0
    }
]