[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T16:14:14.263735+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T15:30:27+00:00",
        "description": "Death Stranding 2: On the Beach might bring a massive new adventure for its players to experience but things don’t necessarily end the minute the credits roll on Sam’s new adventure. There’s a lot to do and find in the game’s take on Mexico and Australia, and more than a few individuals who could use Sam’s help in exchange for some very useful rewards. \n\nThe Strand System, APAS Enhancements, and secret bosses are all part of the experience, and as exciting as the main story for those who like to stray off the beaten path. The game rewards curiosity in ways that can impact the way it is played, making engaging with as much of its world as possible a very rewarding path of action well beyond the runtime of its story - and perhaps makes things even more convenient for Sam Porter in the bargain!",
        "id": 3092365,
        "language": null,
        "link": "https://www.youtube.com/watch?v=jXEaQ8qNnJ0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jXEaQ8qNnJ0/hqdefault.jpg",
        "title": "Death Stranding 2: On the Beach - 15 Things To Do AFTER FINISHING THE GAME",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T14:04:12.250959+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T13:30:10+00:00",
        "description": "One of the most iconic franchises of all time returns in 2025 with not-one-but-three new entries (if we’re counting the already released Ninja Gaiden II remake Ninja Gaiden II Black as new). Before the new 3D adventure Ninja Gaiden 4 comes later in the year, a return to the series’ roots in 2D side-scrolling action platformer Ninja Gaiden: Ragebound is incoming. \n\nImbued with the spirit of the series’ original trilogy but with a host of modernisations and quality of life improvements, Ninja Gaiden: Ragebound looks to tap into a perfect middle ground between vintage challenge and modern design. \n\nNew characters, new story, and fresh mechanics reinforce the series’ marquee combat fluidity, with a challenge not quite as brutal as what those who were old enough in 1988 remember.",
        "id": 3091669,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ECdXvpHZE98",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ECdXvpHZE98/hqdefault.jpg",
        "title": "Ninja Gaiden Ragebound - 15 DETAILS You Need To Know Before You Pick It Up",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T08:39:16.047322+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T08:00:54+00:00",
        "description": "Imagine, if you will, that you've been working on a new sci-fi MMORPG with Titanfall-like movement. Things are starting to come together after a long pre-production period, but it's okay because Phil Spencer, Microsoft Gaming's CEO, loves your game. He loves it so much that he reportedly couldn't stop playing it and needed Xbox's Matt Booty to tear the controller away. Microsoft executives didn't just like the game – they were, as sources told Bloomberg's Jason Schreier, “blown away by it.” Not in development hell either. Going places, good times.\n\nNow imagine that those leadership figures approach you and your team to tell you that your project, which you've poured years of your life into, has been cancelled. Actually, don't, because what happened (allegedly, of course) is that studio leaders locked your team out of their Slack accounts while telling them that the same project has been cancelled. Oh, and hours later, you don't even know if you're still employed.",
        "id": 3090286,
        "language": null,
        "link": "https://www.youtube.com/watch?v=j0tkEEvvpL8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/j0tkEEvvpL8/hqdefault.jpg",
        "title": "Xbox Is Struggling - And It May Get UGLIER",
        "vote": 0
    }
]