[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T23:32:16.485121+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T22:34:00+00:00",
        "description": "Interesting Engineering reports:\nAstral Systems, a UK-based private commercial fusion company, has claimed to have become the first firm to successfully breed tritium, a vital fusion fuel, using its own operational fusion reactor. This achievement, made with the University of Bristol, addresses a significant hurdle in the development of fusion energy.... \n\nScientists from Astral Systems and the University of Bristol produced and detected tritium in real-time from an experimental lithium breeder blanket within Astral's multi-state fusion reactors. \"There's a global race to find new ways to develop more tritium than what exists in today's world &mdash; a huge barrier is bringing fusion energy to reality,\" said Talmon Firestone, CEO and co-founder of Astral Systems. \"This collaboration with the University of Bristol marks a leap forward in the search for viable, greater-than-replacement tritium breeding technologies. Using our multi-state fusion technology, we are the first private fusio",
        "id": 3094238,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/07/05/150216/uk-scientists-achieve-first-commercial-tritium-production?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Scientists Achieve First Commercial Tritium Production",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T22:27:16.766006+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T21:34:00+00:00",
        "description": "\"Microsoft has released the source code for the GitHub Copilot Chat extension for VS Code under the MIT license,\" reports BleepingComputer.\n\nThis provides the community access to the full implementation of the chat-based coding assistant, including the implementation of \"agent mode,\" what contextual data is sent to large language models (LLMs), and the design of system prompts. The GitHub repository hosting the code also details telemetry collection mechanisms, addressing long-standing questions about data transparency in AI-assisted coding tools... \n\nAs the VS Code team explained previously, shifts in AI tooling landscape like the rapid growth of the open-source AI ecosystem and a more level playing field for all have reduced the need for secrecy around prompt engineering and UI design. At the same time, increased targeting of development tools by malicious actors has increased the need for crowdsourcing contributions to rapidly pinpoint problems and develop effective fixes. Essentia",
        "id": 3094016,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/07/05/1935203/microsoft-open-sources-copilot-chat-for-vs-code-on-github?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Open Sources Copilot Chat for VS Code on GitHub",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T21:22:17.771166+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T20:34:00+00:00",
        "description": "\"Some of our basic assumptions about the biological process of aging might be wrong,\" reports the New York Times &mdash; citing new research on a small Indigenous population in the Bolivian Amazon. [Alternate URL here.]\n\n\n Scientists have long believed that long-term, low-grade inflammation &mdash; also known as \"inflammaging\" &mdash; is a universal hallmark of getting older. But this new data raises the question of whether inflammation is directly linked to aging at all, or if it's linked to a person's lifestyle or environment instead. The study, which was published Monday, found that people in two nonindustrialized areas experienced a different kind of inflammation throughout their lives than more urban people &mdash; likely tied to infections from bacteria, viruses and parasites rather than the precursors of chronic disease. Their inflammation also didn't appear to increase with age. \nScientists compared inflammation signals in existing data sets from four distinct populations in I",
        "id": 3093738,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/05/1234225/a-common-assumption-about-aging-may-be-wrong-study-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Common Assumption About Aging May Be Wrong, Study Suggests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T20:17:16.339993+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T19:34:00+00:00",
        "description": "We're living in a new world now &mdash; one where it's an AI-powered penetration tester that \"now tops an eminent US security industry leaderboard that ranks red teamers based on reputation.\" CSO Online reports:\n\n\nOn HackerOne, which connects organizations with ethical hackers to participate in their bug bounty programs, \"Xbow\" scored notably higher than 99 other hackers in identifying and reporting enterprise software vulnerabilities. It's a first in bug bounty history, according to the company that operates the eponymous bot... \n\nXbow is a fully autonomous AI-driven penetration tester (pentester) that requires no human input, but, its creators said, \"operates much like a human pentester\" that can scale rapidly and complete comprehensive penetration tests in just a few hours. According to its website, it passes 75% of web security benchmarks, accurately finding and exploiting vulnerabilities. \n\nXbow submitted nearly 1,060 vulnerabilities to HackerOne, including remote code execution,",
        "id": 3093447,
        "language": null,
        "link": "https://it.slashdot.org/story/25/07/05/1847237/xbows-ai-powered-pentester-grabs-top-rank-on-hackerone-raises-75m-to-grow-platform?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "XBOW's AI-Powered Pentester Grabs Top Rank on HackerOne, Raises $75M to Grow Platform",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T19:12:18.241678+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T18:34:00+00:00",
        "description": "This week Hewlett-Packard Enterprise settled its antitrust case with America's Justice Department, \"paving the way for its acquisition of rival kit maker Juniper Networks,\" reported Telecoms.com:\n\nUnder the agreement, HPE has agreed to divest its Instant On unit, which sells a range of enterprise-grade Wi-Fi networking equipment for campus and branch deployments. It has also agreed to license Juniper's Mist AIOps source code &mdash; a software suite that enables AI-based network automation and management. HPE can live with that, since its primary motivation for buying Juniper is to improve its prospects in an IT networking market dominated by Cisco, where others like Arista and increasingly Nokia and Nvidia are also trying to make inroads. \nAnd after receiving regulatory clearance, HPE \"very quickly closed the deal...\" reports The Motley Fool. \"In the press release heralding the news, the buyer wrote that it \"doubles the size of HPE's networking business and provides customers with a ",
        "id": 3093221,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/07/05/050238/hpe-acquires-juniper-networks-for-14b-after-settling-antitrust-case?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "HPE Acquires Juniper Networks for $14B After Settling Antitrust Case",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T18:07:15.442863+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T17:34:00+00:00",
        "description": "Science Daily reports:\n\n\nWild orcas across four continents have repeatedly floated fish and other prey to astonished swimmers and boaters, hinting that the ocean's top predator likes to make friends. Researchers cataloged 34 such gifts over 20 years, noting the whales often lingered expectantly &mdash; and sometimes tried again &mdash; after humans declined their offerings, suggesting a curious, relationship-building motive... \n\n\"Orcas often share food with each other &mdash; it's a prosocial activity and a way that they build relationships with each other,\" said study lead author Jared Towers, of Bay Cetology in British Columbia, Canada. \"That they also share with humans may show their interest in relating to us as well.\" \n\nThe complete research was published in the Journal of Comparative Psychology. Its title? \"Testing the Waters: Attempts by Wild Killer Whales (Orcinus orca) to Provision People (Homo sapiens).\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"s",
        "id": 3092948,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/05/0442257/why-do-killer-whales-keep-handing-us-fish-scientists-unpack-the-mystery?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Do Killer Whales Keep Handing Us Fish? Scientists Unpack the Mystery",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T17:04:14.390031+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T16:34:00+00:00",
        "description": "Long-time Slashdot reader AmiMoJo shared this report from the Apple news blog 9to5Mac:\niOS 26 is a packed update for iPhone users thanks to the new Liquid Glass design and major updates for Messages, Wallet, CarPlay, and more. But another new feature was just discovered in the iOS 26 beta: FaceTime will now freeze your call's video and audio if someone starts undressing. \n\nWhen Apple unveiled iOS 26 last month, it mentioned a variety of new family tools... \"Communication Safety expands to intervene when nudity is detected in FaceTime video calls, and to blur out nudity in Shared Albums in Photos.\" However, at least in the iOS 26 beta, it seems that a similar feature may be in place for all users &mdash; adults included. \n\nThat's the claim of an X.com user named iDeviceHelp, who says FaceTime in iOS 26 swaps in a warning message that says \"Audio and video are paused because you may be showing something sensitive,\" giving users a choice of ending the call or resuming it. \n\n9to5Mac says ",
        "id": 3092611,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/07/05/0425229/will-facetime-in-ios-26-freeze-your-call-if-someone-starts-undressing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Will FaceTime In IOS 26 Freeze Your Call If Someone Starts Undressing?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T15:57:17.592255+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T15:34:00+00:00",
        "description": "In April researchers responsibly disclosed two security flaws found in Sudo \"that could enable local attackers to escalate their privileges to root on susceptible machines,\" reports The Hacker News. \"The vulnerabilities have been addressed in Sudo version 1.9.17p1 released late last month.\"\n\n\nStratascale researcher Rich Mirch, who is credited with discovering and reporting the flaws, said CVE-2025-32462 has managed to slip through the cracks for over 12 years. It is rooted in the Sudo's \"-h\" (host) option that makes it possible to list a user's sudo privileges for a different host. The feature was enabled in September 2013. However, the identified bug made it possible to execute any command allowed by the remote host to be run on the local machine as well when running the Sudo command with the host option referencing an unrelated remote host. \"This primarily affects sites that use a common sudoers file that is distributed to multiple machines,\" Sudo project maintainer Todd C. Miller s",
        "id": 3092315,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/07/05/0323220/two-sudo-vulnerabilities-discovered-and-patched?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Two Sudo Vulnerabilities Discovered and Patched",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T14:52:18.082981+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T14:34:00+00:00",
        "description": "This week America's Energy Department selected two companies to perform the first nuclear microreactor tests in a new facility in Idaho, saying the tests \"will fast-track the deployment of American microreactor technologies... The first fueled reactor experiment will start as early as spring 2026.\" \n\nThe new facility is named DOME (an acronym for Demonstration of Microreactor Experiments), and it leverages existing \"to safely house and test fueled reactor experiments, capable of producing up to 20 megawatts of thermal energy,\" according to a local newspaper.\n[T]wo companies were competitively selected in 2023 and are currently working through a multi-phase Energy Department authorization process to support the design, fabrication, construction, and testing of each fueled reactor experiment. Both are expected to meet certain milestones throughout the process to maintain their allotted time in DOME and to ensure efficient use of the test bed, according to the release... The department e",
        "id": 3092000,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/07/05/042203/nuclear-microreactors-advance-as-us-picks-two-companies-for-fueled-testing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nuclear Microreactors Advance as US Picks Two Companies for Fueled Testing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T12:42:40.339690+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T12:30:00+00:00",
        "description": "Some of the water around Antarctica has been getting saltier. And that has affected the amount of sea ice at the bottom of the planet. From a report: A study published Monday in the Proceedings of the National Academy of Sciences found that increases in salinity in seawater near the surface could help explain some of the decrease in Antarctic sea ice that have been observed over the past decade, reversing a previous period of growth. \n\n\"The impact of Antarctic ice is massive in terms of sea-level rise, in terms of global warming, and therefore, in terms of extremes,\" said Alessandro Silvano, a senior scientist at the University of Southampton studying the Southern Ocean and lead author of the study. The findings mean \"we are entering a new system, a new world,\" he said. The Times adds: \"the Department of Defense announced it would be no longer be providing some of the satellite data that researchers use to monitor changes in sea ice.\"<p><div class=\"share_submission\" style=\"position:re",
        "id": 3091338,
        "language": null,
        "link": "https://news.slashdot.org/story/25/07/04/1725220/near-antarctica-saltier-seas-mean-less-ice-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Near Antarctica, Saltier Seas Mean Less Ice, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T11:37:06.095523+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T11:00:00+00:00",
        "description": "Software engineer Sean Goedecke argues that AI coding agents have already been commoditized because they require no special technical advantages, just better base models. He writes: All of a sudden, it's the year of AI coding agents. Claude released Claude Code, OpenAI released their Codex agent, GitHub released its own autonomous coding agent, and so on. I've done my fair share of writing about whether AI coding agents will replace developers, and in the meantime how best to use them in your work. Instead, I want to make what I think is now a pretty firm observation: AI coding agents have no secret sauce. \n\n[...] The reason everyone's doing agents now is the same reason everyone's doing reinforcement learning now -- from one day to the next, the models got good enough. Claude Sonnet 3.7 is the clear frontrunner here. It's not the smartest model (in my opinion), but it is the most agentic: it can stick with a task and make good decisions over time better than other models with more ra",
        "id": 3091094,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/07/04/191224/ai-coding-agents-are-already-commoditized?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Coding Agents Are Already Commoditized",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T08:22:06.489484+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T08:00:00+00:00",
        "description": "Reuters: The European Union's landmark rules on AI will be rolled out according to the legal timeline in the legislation, the European Commission said on Friday, dismissing calls from some companies and countries for a pause. \n\nGoogle owner Alphabet, Facebook owner Meta and other U.S. companies as well as European businesses such as Mistral and ASML have in recent days urged the Commission to delay the AI Act by years. Financial Times adds: In an open letter, seen by the Financial Times, the heads of 44 major firms on the continent called on European Commission President Ursula von der Leyen to introduce a two-year pause, warning that unclear and overlapping regulations are threatening the bloc's competitiveness in the global AI race. \n\n[...] The current debate surrounds the drafting of a \"code of practice,\" which will provide guidance to AI companies on how to implement the act that applies to powerful AI models such as Google's Gemini, Meta's Llama and OpenAI's GPT-4. Brussels has a",
        "id": 3090275,
        "language": null,
        "link": "https://slashdot.org/story/25/07/04/198257/eu-sticks-with-timeline-for-ai-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "EU Sticks With Timeline For AI Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T05:07:04.091041+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T05:00:00+00:00",
        "description": "President Donald Trump's administration plans to restrict shipments of AI chips from the likes of Nvidia to Malaysia and Thailand, part of an effort to crack down on suspected semiconductor smuggling into China. Bloomberg: A draft rule from the Commerce Department seeks to prevent China -- to which the US has effectively banned sales of Nvidia's advanced AI processors -- from obtaining those components through intermediaries in the two Southeast Asian nations, according to people familiar with the matter. The rule is not yet finalized and could still change, said the people, who requested anonymity to discuss private conversations. \n\nOfficials plan to pair the Malaysia and Thailand controls with a formal rescission of global curbs from the so-called AI diffusion rule, the people said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Plans+AI+Chip+Curbs+on+Malaysia%2C+Thailand+Over+China+Concerns%3A+https%3A%2F%2Fsl",
        "id": 3089613,
        "language": null,
        "link": "https://slashdot.org/story/25/07/04/1644224/us-plans-ai-chip-curbs-on-malaysia-thailand-over-china-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Plans AI Chip Curbs on Malaysia, Thailand Over China Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-05T02:57:01.410858+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-05T02:00:00+00:00",
        "description": "A new study analyzing data from more than 60 previous research projects has found evidence that there is \"no safe amount\" of processed meat consumption -- so much so that even small daily portions are being linked to increased disease risk. \n\nThe research, published Monday in the journal Nature Medicine, examined connections between processed meats, sugar-sweetened beverages and trans fatty acids and the risk of type 2 diabetes, colorectal cancer and ischemic heart disease. People who ate as little as one hot dog daily showed an 11% greater risk of type 2 diabetes and 7% increased risk of colorectal cancer compared to those who consumed none. Drinking approximately one 12-ounce soda per day was associated with an 8% increase in type 2 diabetes risk and 2% increased risk of ischemic heart disease.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=There+Is+No+Safe+Amount+of+Processed+Meat+To+Eat%2C+According+to+New+Resea",
        "id": 3089266,
        "language": null,
        "link": "https://science.slashdot.org/story/25/07/04/1829219/there-is-no-safe-amount-of-processed-meat-to-eat-according-to-new-research?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "There Is No Safe Amount of Processed Meat To Eat, According to New Research",
        "vote": 0
    }
]