[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T23:48:03.929852+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T23:20:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Donald Trump is eyeing taking equity stakes in quantum computing firms in exchange for federal funding, The Wall Street Journal reported. At least five companies are weighing whether allowing the government to become a shareholder would be worth it to snag funding that the Trump administration has \"earmarked for promising technology companies,\" sources familiar with the potential deals told the WSJ.\n \nIonQ, Rigetti Computing, and D-Wave Quantum are currently in talks with the government over potential funding agreements, with minimum awards of $10 million each, some sources said. Quantum Computing Inc. and Atom Computing are reportedly \"considering similar arrangements,\" as are other companies in the sector, which is viewed as critical for scientific advancements and next-generation technologies. No deals have been completed yet, sources said, and terms could change as quantum-computing firms weigh the potential risks of governmen",
        "id": 3889027,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/23/2048226/trump-eyes-government-control-of-quantum-computing-firms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Eyes Government Control of Quantum Computing Firms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T23:48:04.020090+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T22:40:00+00:00",
        "description": "Microsoft is retiring Office Online Server on December 31, 2026, ending support and updates for organizations running browser-based Office apps on-premises. The Register reports: After this, there won't be any more security fixes, updates, or technical support from Microsoft. \"This change is part of our ongoing commitment to modernizing productivity experiences and focusing on cloud-first solutions,\" the company said. Office Online Server provides browser-based versions of Word, Excel, PowerPoint, and OneNote for customers who want to keep things on-prem without having to roll out the full desktop applications. Microsoft's solution is to move to Microsoft 365, its decidedly off-premises version of its applications. The company said it is \"focusing its browser-based Office app investments on Office for the Web to deliver secure, collaborative, and feature-rich experiences through Microsoft 365.\"\n \nOther than migrating to another platform when the vendor pulls the plug, affected custome",
        "id": 3889028,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/23/1919204/microsoft-puts-office-online-server-on-the-chopping-block",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Puts Office Online Server On the Chopping Block",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T22:31:26.277619+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T22:00:00+00:00",
        "description": "A UK tribunal ruled that Apple abused its dominant position by charging app developers unfair commissions through its App Store, potentially costing the company hundreds of millions in damages. It marks the first major tech \"class action\" victory under the UK's collective lawsuit regime. Reuters reports: The Competition Appeal Tribunal (CAT) ruled against Apple after a trial of the lawsuit, which was brought on behalf of millions of iPhone and iPad users in the United Kingdom. The CAT ruled that Apple had abused its dominant position from October 2015 until the end of 2020 by shutting out competition in the app distribution market and by \"charging excessive and unfair prices\" as commission to developers.\n \nApple -- which has faced mounting pressure from regulators in the U.S. and Europe over the fees it charges developers -- said it would appeal against the ruling, which it said \"takes a flawed view of the thriving and competitive app economy.\" The case had been valued at around $2 bi",
        "id": 3888568,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/23/196225/apple-loses-landmark-uk-lawsuit-over-app-store-commissions",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Loses Landmark UK Lawsuit Over App Store Commissions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T22:31:26.404655+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T21:20:00+00:00",
        "description": "An anonymous reader shares a report: China's Communist Party elite vowed on Thursday to build a modern industrial system and make more efforts to achieve technological self-reliance, moves it sees as key to bolstering its position in its intensifying rivalry with the United States. As expected, the Party's Central Committee also promised more efforts to expand domestic demand and improve people's livelihoods - long-standing goals that in recent years have been little more than an afterthought as China prioritised manufacturing and investment - without giving many details. \n\n[...] The full five-year plan will only be released at a parliamentary meeting in March, but the post-plenum outline from state news agency Xinhua hinted at policy continuity, which concerns economists who have been calling for a shift towards a&#226;growth model that relies more on household demand. Building \"a modern industrial system with advanced manufacturing as the backbone\" and accelerating \"high-level scien",
        "id": 3888569,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/23/1749205/chinas-new-five-year-plan-sharpens-industry-tech-focus",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China's New Five-Year Plan Sharpens Industry, Tech Focus",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T21:17:04.682957+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T20:41:00+00:00",
        "description": "Samsung and SK Hynix have raised DRAM and NAND flash prices by up to 30% for the fourth quarter, Korean publications report. The two Korean memory giants passed the new rates on to customers as analysts predict the AI-driven memory supercycle will be longer and stronger than past boom periods. \n\nSeveral leading international electronics and server companies are stockpiling memory and negotiating long-term supply deals spanning two to three years. U.S. and Chinese electronics firms and data center operators are exploring mid-to-long-term contracts. Companies typically sign DRAM contracts on a quarterly or annual basis.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Memory+Giants+Samsung+and+SK+Hynix+Push+Through+30%25+Price+Increases+Amid+AI+Server+Boom%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F10%2F23%2F1824201%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large",
        "id": 3887946,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/23/1824201/memory-giants-samsung-and-sk-hynix-push-through-30-price-increases-amid-ai-server-boom",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Memory Giants Samsung and SK Hynix Push Through 30% Price Increases Amid AI Server Boom",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T21:17:04.758795+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T20:02:00+00:00",
        "description": "The amount of energy required to supply the data centers powering AI is so vast that meeting that need may be more than a lifetime away, according to a senior executive at Apollo Global. From a report: \"The gap between what AI is demanding and what we have everywhere in the world on the grid in terms of generation and transmission is huge and will not be closed in our lifetime,\" Dave Stangis, who has led and developed Apollo's sustainability strategy over the past four years, said in an interview. \n\nThat means sustainable energy investors need to accept that renewables alone aren't enough to power the AI age, he said. The comments encapsulate a new approach across the finance industry, where the economics of the energy transition -- a concept intended to represent the shift to a low-carbon future -- are becoming merged with the economics of an unprecedented boost in supply. \"So what is happening around the world, there's no doubt about it, is what you might call energy addition,\" Stan",
        "id": 3887947,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/23/184238/apollo-says-ai-energy-gap-will-not-be-closed-in-our-lifetime",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apollo Says AI Energy Gap 'Will Not Be Closed in Our Lifetime'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T21:17:04.830362+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T19:20:00+00:00",
        "description": "President Donald Trump has pardoned the Founder of Binance, Changpeng Zhao, who pleaded guilty to anti-money-laundering violations and served prison time. The Associated Press reports: Zhao has deep ties to World Liberty Financial, a crypto venture that the Republican president and his sons Eric and Donald Jr. launched in September. Trump's most recent financial disclosure report reveals he made more than $57 million last year from World Liberty Financial, which has launched USD1, a stablecoin pegged at a 1-to-1 ratio to the U.S. dollar. World Liberty Financial also recently announced that an investment fund in the United Arab Emirates would be using $2 billion worth of USD1 to purchase a stake in Binance. Zhao also has publicly said that he had asked Trump for a pardon that could nullify his conviction.\n \nWhite House press secretary Karoline Leavitt said in a statement Thursday that the Biden administration prosecuted Zhao out of a \"desire to punish the cryptocurrency industry.\" She ",
        "id": 3887948,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/10/23/190204/trump-pardons-binance-founder-changpeng-zhao",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Pardons Binance Founder Changpeng Zhao",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T21:17:04.902034+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T18:41:00+00:00",
        "description": "Nearly three decades after Clippy appeared as Microsoft's Office assistant, the company is introducing Mico, a virtual character for Copilot's voice mode. The bouncing orb responds with real-time expressions during conversations and is being turned on by default, The Verge reports. Users can disable the feature, however. \n\nThe assistant draws on a new memory feature inside Copilot to recall facts about users and their work. Mico will be available in the United States, United Kingdom, and Canada at launch. Microsoft is also adding a Learn Live mode that transforms the character into a Socratic tutor using interactive whiteboards and visual cues. The initiative is part of an effort to give Copilot a permanent identity. Jacob Andreou, corporate vice president of product and growth at Microsoft AI, said: \"Clippy walked so that we could run.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Three+Decades+After+Clippy%2C+Mi",
        "id": 3887949,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/10/23/1734227/three-decades-after-clippy-microsoft-launches-mico",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Three Decades After Clippy, Microsoft Launches Mico",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T18:29:47.198550+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T18:01:00+00:00",
        "description": "Banks face a hit to their bottom lines of as much as $170 billion if they don't adapt their business models to respond to customers turning to AI to optimize their finances. From a report: The consultancy firm predicted that customer uptake of agentic AI -- effectively autonomous bots -- would hit the profits banks earn from customer money in low interest accounts, according to a report from McKinsey published Thursday. \"Imagine you have an AI agent that says: 'Hey, you could save $2,000-a-year by moving your money,'\" Pradip Patiath, a senior partner at McKinsey, said. \"It automates a lot of the inertia that is in the system today.\" \n\nConsumers hold $23 trillion out of a total of $70 trillion in accounts with close to zero interest rates, while the remainder is held in accounts that often pay relatively low rates, according to the research. Customer use of AI agents could lead to a 9% profit drop for banks, some $170 billion, if they do not change their business models. That could pus",
        "id": 3886883,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/23/1452218/mckinsey-says-bank-profits-face-possible-170-billion-ai-hit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "McKinsey Says Bank Profits Face Possible $170 Billion AI Hit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T18:29:47.340155+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T17:21:00+00:00",
        "description": "UN Secretary-General Antonio Guterres says it is now clear that efforts to cap global warming at 1.5C above pre-industrial levels will fail in the short term. AFP: Before next month's COP30 climate summit in Brazil, Guterres said going beyond 1.5C would result in \"devastating\" yet predictable impacts. \"One thing is already clear: we will not be able to contain the global warming below 1.5C in the next few years,\" Guterres said at the UN's World Meteorological Organisation (WMO) weather and climate agency in Geneva. \n\n\"Overshooting is now inevitable. Which means that we're going to have a period, bigger or smaller, with higher or lower intensity, above 1.5C in the years to come.\" However, if leaders start taking the problem seriously by driving towards net zero greenhouse gas emissions, \"the 1.5 still remains -- according to all the scientists I met -- possible before the end of the century.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://t",
        "id": 3886884,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/23/1445208/overshooting-15c-climate-target-inevitable-un-chief",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Overshooting 1.5C Climate Target 'Inevitable': UN Chief",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T17:16:24.094298+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T16:40:00+00:00",
        "description": "An anonymous reader shares a report: With gingko \"memory-boost tinctures,\" fennel \"tummy-soothing syrups\" and \"citrus-immune gummies,\" AI \"slop\" has come for herbalism, a study published by a leading AI-detection company has found. Originality.ai, which offers its tools to universities and businesses, says it scanned 558 titles published in Amazon's herbal remedies subcategory between January and September this year, and found 82% of the books \"were likely written\" by AI. \n\n\"This is a damning revelation of the sheer scope of unlabelled, unverified, unchecked, likely AI content that has completely invaded [Amazon's] platform,\" wrote Michael Fraiman, author of the study. \"There's a huge amount of herbal research out there right now that's absolutely rubbish,\" said Sue Sprung, a medical herbalist in Liverpool. \"AI won't know how to sift through all the dross, all the rubbish, that's of absolutely no consequence. It would lead people astray.\"<p><div class=\"share_submission\" style=\"positio",
        "id": 3886200,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/23/1440241/detection-firm-finds-82-of-herbal-remedy-books-on-amazon-likely-written-by-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Detection Firm Finds 82% of Herbal Remedy Books on Amazon 'Likely Written' By AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T17:16:24.164742+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T16:01:00+00:00",
        "description": "An anonymous reader writes: Gboard has introduced some significant changes to the app over the past few weeks, making typing on the app much easier than ever before. You can now resize the keyboard to your desired size, and there's even something in the works that will make adding apostrophes to your text even more seamless. \n\nIf all of that wasn't enough, the app is now introducing a feature that some will find peculiar, which will allow users to remove the period and common punctuation keys from Gboard. This news comes to us from 9to5Google, sharing that this is now an option with the latest version of the app.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Gboard's+Latest+Update+Removes+the+Period+and+Comma+Keys+on+Android%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F10%2F23%2F1432213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashp",
        "id": 3886201,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/23/1432213/gboards-latest-update-removes-the-period-and-comma-keys-on-android",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Gboard's Latest Update Removes the Period and Comma Keys on Android",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T15:57:44.613218+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T15:21:00+00:00",
        "description": "Fujitsu has released a new laptop in Japan with a built-in Blu-ray drive. The FMV Note A A77-K3 includes a BDXL-compatible optical drive that can read and burn discs. Most laptop manufacturers globally stopped including optical drives in the second half of the 2010s. The Japanese market has refused to follow that trend. \n\nShops in Tokyo's Akihabara district recently experienced a spike in demand for optical drives and systems capable of reading Blu-ray discs, Tom's Hardware reports. Fujitsu sells two additional models in the FMV Note A line using Intel thirteenth-generation chips. Those systems include DVD drives instead of Blu-ray capability. Some other Japanese manufacturers also released optical-drive-equipped laptops earlier in 2025.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Fujitsu's+New+Laptop+in+Japan+Includes+Optical+Drive+Abandoned+Elsewhere%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F10%2F23%2F142",
        "id": 3885429,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/10/23/1429225/fujitsus-new-laptop-in-japan-includes-optical-drive-abandoned-elsewhere",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Fujitsu's New Laptop in Japan Includes Optical Drive Abandoned Elsewhere",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T14:41:46.828339+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T14:40:00+00:00",
        "description": "Millions of tons of discarded electronics from the United States are being shipped overseas, much of it to developing countries in Southeast Asia unprepared to safely handle hazardous waste, according to a new report by an environmental watchdog. AP: The Seattle-based Basel Action Network, or BAN, said a two-year investigation found at least 10 U.S. companies exporting used electronics to Asia and the Middle East, in what it says is a \"hidden tsunami\" of electronic waste. \"This new, almost invisible tsunami of e-waste, is taking place ... padding already lucrative profit margins of the electronics recycling sector while allowing a major portion of the American public's and corporate IT equipment to be surreptitiously exported to and processed under harmful conditions in Southeast Asia,\" the report said. \n\nElectronic waste, or e-waste, includes discarded devices like phones and computers containing both valuable materials and toxic metals like lead, cadmium and mercury. As gadgets are ",
        "id": 3884659,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/10/23/1415234/american-e-waste-is-causing-a-hidden-tsunami-in-southeast-asia-report-says",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "American E-waste is Causing a 'Hidden Tsunami' in Southeast Asia, Report Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T14:41:46.913623+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T14:00:00+00:00",
        "description": "Microsoft has set a 30% profit margin goal for its Xbox gaming division, Bloomberg reported Thursday, well above the video game industry's average of 17% to 22%. The target, implemented in fall 2023 by CFO Amy Hood, represents a sharp departure from Xbox's previous approach of allowing developers to focus on making quality games without specific financial constraints. Xbox historically maintained profit margins between 10% and 20% and reported a 12% margin for the first nine months of Microsoft's 2022 fiscal year. \n\nThe division has responded by canceling several projects that had been in development for more than seven years, including Everwild, Perfect Dark and Project Blackbird. It has also eliminated thousands of jobs and raised prices. In 2024, Xbox began releasing most of its games on rival Nintendo and Sony platforms. The heightened scrutiny comes as Microsoft prioritizes investment in generative AI while overseeing a gaming division that has struggled despite spending $76.5 bi",
        "id": 3884660,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/10/23/122257/microsoft-demands-30-profit-margins-from-struggling-xbox-division",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Demands 30% Profit Margins from Struggling Xbox Division",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T10:55:02.123396+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T10:00:00+00:00",
        "description": "An anonymous reader quotes a report from 9to5Mac: Apple has been working on a new framework called AppMigrationKit, which will be compatible with devices running iOS 26.1 and later, as well as iPadOS 26.1 and later. Like iOS and iPadOS 26.1, the framework is currently in beta and will allow developers to include their app's data during the migration process between Apple and non-Apple devices (which, for now, essentially means Android). Interestingly, Apple notes that this framework is not intended for data migration between iOS and iPadOS, but rather exclusively to and from non-Apple devices: \"AppMigrationKit only supports migration to and from non-Apple platforms, such as Android. The system doesn't use the framework for migration between iOS or iPadOS devices. The framework also has no functionality in iOS apps running in visionOS or in macOS on Apple silicon. The framework ignores calls from Mac apps built with Mac Catalyst.\" The AppMigrationKit documentation can be found here.<p>",
        "id": 3882779,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/10/23/0318241/apple-readies-new-framework-to-let-iphone-users-migrate-app-data-to-android",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Readies New Framework To Let iPhone Users Migrate App Data To Android",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T07:08:39.867919+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T07:00:00+00:00",
        "description": "SpaceX has deactivated over 2,500 Starlink terminals allegedly used by scam operations in Myanmar, where the service isn't licensed but was reportedly enabling large-scale cybercrime networks tied to human trafficking and fraud. Ars Technica reports: Lauren Dreyer, vice president of Starlink business operations, described the action in an X post last night after reports that Myanmar's military shut down a major scam operation: \"SpaceX complies with local laws in all 150+ markets where Starlink is licensed to operate,\" Dreyer wrote. \"SpaceX continually works to identify violations of our Acceptable Use Policy and applicable law... On the rare occasion we identify a violation, we take appropriate action, including working with law enforcement agencies around the world. In Myanmar, for example, SpaceX proactively identified and disabled over 2,500 Starlink Kits in the vicinity of suspected 'scam centers.'\"\n \nStarlink is not licensed to operate in Myanmar. While Dreyer didn't say how the ",
        "id": 3881588,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/23/0311231/spacex-disables-2500-starlink-terminals-allegedly-used-by-asian-scam-centers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SpaceX Disables 2,500 Starlink Terminals Allegedly Used By Asian Scam Centers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T04:36:33.325197+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from The Drive: This week, a reader wrote to us sharing that the infotainment in their 2020 Audi A4 had been \"rebooting every five minutes all year.\" It looks like the problem was caused by a compatibility issue with a SiriusXM app update. Audi tells us the situation's been rectified, but it illustrates a serious pain point in modern cars -- myriad apps interacting with a diverse population of in-car software systems. Our reader was not the only Audi owner affected. \"Randomly restarting\" Audi infotainment screens have been discussed on Reddit, the Audiworld forum, and elsewhere, going back many months. Audi's recall notice and related service action only went out this summer.\n \nIt looks like this particular problem was caused when the satellite radio app pushed an update that was supposed to work on the latest version of Audi's infotainment software, but not all cars were running that. Then SiriusXM reverted, which, I guess, did not solve the proble",
        "id": 3880939,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/23/003245/a-siriusxm-update-sent-some-audi-screens-into-a-forced-reboot-loop-for-months",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A SiriusXM Update Sent Some Audi Screens Into a Forced-Reboot Loop For Months",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T02:07:41.930913+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T01:25:00+00:00",
        "description": "Meta is laying off about 600 employees from its AI division as part of a restructuring to streamline operations and solidify Alexandr Wang's leadership over the company's AI strategy. \"Workers across Meta's AI infrastructure units, Fundamental Artificial Intelligence Research unit (FAIR) and other product-related positions will be impacted,\" notes CNBC. \"However, the cuts did not impact employees within TBD Labs, which includes many of the top-tier AI hires brought into the social media company this summer.\" From the report: Those employees, overseen by Wang, were spared by the layoffs, underscoring Meta CEO Mark Zuckerberg's bet on his expensive hires versus the legacy employees, the people said. Within Meta, the AI unit was considered to be bloated, with teams like FAIR and more product-oriented groups often vying for computing resources, the people said. When the company's new hires joined the company to create Superintelligence Labs, it inherited the oversized Meta AI unit, they s",
        "id": 3880388,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/22/2351229/meta-lays-off-600-from-bloated-ai-unit",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Lays Off 600 From 'Bloated' AI Unit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T00:57:38.253181+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T00:45:00+00:00",
        "description": "As it nears its 30th anniversary, Pitchfork is testing user reviews and comments in a major shift from its long-standing critic-only model. The site will now let readers rate albums and leave comments, combining those into an aggregated \"reader score\" alongside the official Pitchfork score. The Verge reports: Pitchfork has historically been a one-sided affair. While it ran the occasional reader poll, there was no way for readers to directly voice their opinion on the site. If you thought that Jet's Shine On deserved better than a 0.0 (first off, you're wrong), there was no way to let the author know other than shouting into the void of this new thing at the time called Twitter. Now the site is considering letting users comment directly on reviews and give albums scores of their own. And then those scores will be averaged up into a single reader score for each album.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Pit",
        "id": 3880080,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/10/22/2030236/pitchfork-is-beta-testing-user-reviews-and-comments-as-it-approaches-30",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pitchfork Is Beta Testing User Reviews and Comments As It Approaches 30",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-10-23T00:57:38.359561+00:00",
        "date_dead_since": null,
        "date_published": "2025-10-23T00:02:00+00:00",
        "description": "Google is migrating all its internal workloads to run on both x86 and its custom Axion Arm chips, with major services like YouTube, Gmail, and BigQuery already running on both architectures. The Register reports: The search and ads giant documented its move in a preprint paper published last week, titled \"Instruction Set Migration at Warehouse Scale,\" and in a Wednesday post that reveals YouTube, Gmail, and BigQuery already run on both x86 and its Axion Arm CPUs -- as do around 30,000 more applications. Both documents explain Google's migration process, which engineering fellow Parthasarathy Ranganathan and developer relations engineer Wolff Dobson said started with an assumption \"that we would be spending time on architectural differences such as floating point drift, concurrency, intrinsics such as platform-specific operators, and performance.\" [...]\n \nThe post and paper detail work on 30,000 applications, a collection of code sufficiently large that Google pressed its existing auto",
        "id": 3880081,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/10/22/2022215/google-porting-all-internal-workloads-to-arm",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Porting All Internal Workloads To Arm",
        "vote": 0
    }
]