[
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-25T00:02:31.462195+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T23:20:00+00:00",
        "description": "Adult children across the United States are increasingly reporting that their aging parents have developed what looks remarkably like the smartphone addiction [non-paywalled source] typically associated with teenagers, a phenomenon The Atlantic's Charlie Warzel has dubbed \"phone-based retirement.\" A 2019 Pew Research Center study found people 60 and older spend more than half their daily leisure time -- four hours and 16 minutes -- in front of screens. Nielsen reported this year that adults 65 and up watch YouTube on their TVs nearly twice as much as they did two years ago. 40% of adults aged 59 to 77 reported feeling anxious without device access in a 2,000-person survey. \n\nIpsit Vahia, chief of geriatric psychiatry at Mass General Brigham's McLean Hospital, cautioned against treating all older adults as a monolithic group. The COVID-19 pandemic drove significant tech adoption among seniors as Zoom became essential for family gatherings, church services, and telehealth. Some research",
        "id": 4401445,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/24/1952241/the-phone-based-retirement-is-here",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Phone-Based Retirement Is Here",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T22:56:41.024059+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T22:40:00+00:00",
        "description": "After Anna's Archive published a massive scrape containing 86 million songs and metadata from Spotify, the streaming giant responded by disabling the nefarious accounts responsible. A spokesperson for Spotify told Recorded Future News that it \"has identified and disabled the nefarious user accounts that engaged in unlawful scraping.\"\n \n\"We've implemented new safeguards for these types of anti-copyright attacks and are actively monitoring for suspicious behavior,\" the spokesperson said. \"Since day one, we have stood with the artist community against piracy, and we are actively working with our industry partners to protect creators and defend their rights.\" The Record reports: The spokesperson added that Anna's Archive did not contact them before publishing the files. They also said it did not consider the incident a \"hack\" of Spotify. The people behind the leaked database systematically violated Spotify's terms by stream-ripping some of the music from the platform over a period of mont",
        "id": 4401150,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/24/1939236/spotify-disables-accounts-after-open-source-group-scrapes-86-million-songs-from-platform",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Spotify Disables Accounts After Open-Source Group Scrapes 86 Million Songs From Platform",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T22:56:41.273574+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T22:02:00+00:00",
        "description": "Microsoft has denied any plans to rewrite Windows 11 using AI and Rust after a LinkedIn post from one of its top-level engineers sparked a wave of online backlash by claiming the company's goal was to \"eliminate every line of C and C++ from Microsoft by 2030.\" \n\nGalen Hunt, a principal software engineer responsible for several large-scale research projects at Microsoft, made the claim in what was originally a hiring post for his team. His original wording described a \"North Star\" of \"1 engineer, 1 month, 1 million lines of code\" and outlined a strategy to \"combine AI and Algorithms to rewrite Microsoft's largest codebases.\" The repeated use of \"our\" in the post led many to interpret it as an official company direction rather than a personal research ambition. \n\nFrank X. Shaw, Microsoft's head of communications, told Windows Latest that the company has no such plans. Hunt subsequently edited his LinkedIn post to clarify that \"Windows is NOT being rewritten in Rust with AI\" and that his",
        "id": 4401151,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/24/1819240/microsoft-says-its-not-planning-to-use-ai-to-rewrite-windows-from-c-to-rust",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Says It's Not Planning To Use AI To Rewrite Windows From C To Rust",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T22:56:41.437455+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T21:40:00+00:00",
        "description": "Italy's antitrust regulator Italian Competition Authority ordered Meta to suspend a policy that blocks rival AI chatbots from using WhatsApp's business APIs, citing potential abuse of market dominance. \"Meta's conduct appears to constitute an abuse, since it may limit production, market access, or technical developments in the AI Chatbot services market, to the detriment of consumers,\" the Authority wrote. \"Moreover, while the investigation is ongoing, Meta's conduct may cause serious and irreparable harm to competition in the affected market, undermining contestability.\" TechCrunch reports: The AGCM in November had broadened the scope of an existing investigation into Meta, after the company changed its business API policy in October to ban general-purpose chatbots from being offered on the chat app via the API. Meta has argued that its API isn't designed to be a platform for the distribution of chatbots and that people have more avenues beyond WhatsApp to use AI bots from other comp",
        "id": 4401152,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/24/1945240/italy-tells-meta-to-suspend-its-policy-that-bans-rival-ai-chatbots-from-whatsapp",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Italy Tells Meta To Suspend Its Policy That Bans Rival AI Chatbots From WhatsApp",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T21:44:01.073479+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T21:21:00+00:00",
        "description": "Amazon finds itself caught between two competing impulses as AI shopping agents from OpenAI, Google, Perplexity and Microsoft mushroom across the e-commerce space -- block them to protect its dominant position, or partner with them to avoid being left behind. The company has largely played defense so far. Amazon recently updated its website code to block external AI agents from crawling it, and as of this week had blocked 47 bots including those from all major AI companies. In November, Amazon sued Perplexity over an agent in the startup's Comet browser that can make purchases on users' behalf, alleging the company concealed its agents to continue scraping Amazon's site. But Amazon's stance appears to be shifting, CNBC reports. \n\nCEO Andy Jassy said on an October earnings call that Amazon expects to partner with third-party agents and has engaged in conversations with some providers. The company is now hiring a corporate development leader to forge strategic partnerships in \"agentic c",
        "id": 4400780,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/24/1937204/amazon-faces-leaders-dilemma---fight-ai-shopping-bots-or-join-them",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Faces 'Leader's Dilemma' - Fight AI Shopping Bots or Join Them",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T21:44:01.322545+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T20:40:00+00:00",
        "description": "An anonymous reader quotes a report from the Wall Street Journal: Concerned that artificial intelligence could threaten Communist Party rule, Beijing is taking extraordinary steps to keep it under control. Although China's government sees AI as crucial to the country's economic and military future, regulations and recent purges of online content show it also fears AI could destabilize society. Chatbots pose a particular problem: Their ability to think for themselves could generate responses that spur people to question party rule.\n \nIn November, Beijing formalized rules it has been working on with AI companies to ensure their chatbots are trained on data filtered for politically sensitive content, and that they can pass an ideological test before going public. All AI-generated texts, videos and images must be explicitly labeled and traceable, making it easier to track and punish anyone spreading undesirable content. Authorities recently said they removed 960,000 pieces of what they re",
        "id": 4400781,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/24/1910223/china-is-worried-ai-threatens-party-rule",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Is Worried AI Threatens Party Rule",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T20:34:00.899748+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T20:00:00+00:00",
        "description": "Los Angeles Times (non-paywalled source): When police questioned Marvin Margolis following the murder of Elizabeth Short -- who became known as the Black Dahlia -- he lied about how well he had known her. The 22-year-old Short had been found mutilated in a weedy lot in South Los Angeles, severed neatly in half with what detectives thought was surgical skill. Margolis was on the list of suspects. He was a sullen 21-year-old premed student at USC, a shell-shocked World War II veteran who had expressed an eagerness to practice surgery. He was \"a resentful individual who shows ample evidence of open aggression,\" a military psychiatrist had concluded. \n\nAt first, Margolis did not tell detectives that he had lived with Short for 12 days at a Hollywood Boulevard apartment, three months before her January 1947 murder. Margolis later admitted they had lived together in Apartment 726 at the Guardian Arms Apartments. But he soon moved to Chicago and changed his name, frustrating further attempts",
        "id": 4400449,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/24/187259/an-amateur-codebreaker-may-have-just-solved-the-black-dahlia-and-zodiac-killings",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "An Amateur Codebreaker May Have Just Solved the Black Dahlia and Zodiac Killings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T20:34:00.991253+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T19:30:00+00:00",
        "description": "European leaders including Emmanuel Macron have accused Washington of \"coercion and intimidation,\" after the US imposed a visa ban on five prominent European figures who have been at heart of the campaign to introduce laws regulating American tech companies. From a report: The visa bans were imposed on Tuesday on Thierry Breton, the former EU commissioner and one of the architects of the bloc's Digital Services Act (DSA), and four anti-disinformation campaigners, including two in Germany and two in the UK. \n\nThe other individuals targeted were Imran Ahmed, the British chief executive of the US-based Center for Countering Digital Hate; Anna-Lena von Hodenberg and Josephine Ballon of the German non-profit HateAid; and Clare Melford, co-founder of the Global Disinformation Index. Justifying the visa bans, the US secretary of state, Marco Rubio, wrote on X: \"For far too long, ideologues in Europe have led organised efforts to coerce American platforms to punish American viewpoints they op",
        "id": 4400450,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/24/1919250/european-leaders-condemn-us-visa-bans-as-row-over-censorship-escalates",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "European Leaders Condemn US Visa Bans as Row Over 'Censorship' Escalates",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T19:25:41.921557+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T19:01:00+00:00",
        "description": "Russia plans to put a nuclear power plant on the moon in the next decade to supply its lunar space programme and a joint Russian-Chinese research station, as major powers rush to explore the earth's only natural satellite. Reuters: Ever since Soviet cosmonaut Yuri Gagarin became the first human to go into space in 1961, Russia has prided itself as a leading power in space exploration, but in recent decades it has fallen behind the United States and, increasingly, China. Russia's ambitions suffered a massive blow in August 2023 when its unmanned Luna-25 mission smashed into the surface of the moon while attempting to land, and Elon Musk has revolutionised the launch of space vehicles - once a Russian speciality. \n\nRussia's state space corporation, Roscosmos, said in a statement that it planned to build a lunar power plant by 2036 and signed a contract with the Lavochkin Association aerospace company to do it. Roscosmos did not say explicitly that the plant would be nuclear but it said ",
        "id": 4400085,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/24/1724223/russia-plans-a-nuclear-power-plant-on-the-moon-within-a-decade",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russia Plans a Nuclear Power Plant on the Moon Within a Decade",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T18:19:05.203207+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T18:01:00+00:00",
        "description": "The Justice Department justified its delayed release of sensitive files by citing the need to carefully redact information that could identify victims, but at least some of those redactions have proven to be technically ineffective and can be bypassed by simply copying and pasting the blacked-out text into a new document. \n\nA 2022 complaint filed by the US Virgin Islands seeking damages from Jeffrey Epstein's estate appeared on the DOJ's \"Epstein Library\" website with black boxes throughout. Techdirt founder Mike Masnick and others shared on Bluesky that the redactions could be trivially circumvented. The exposed text includes allegations that a co-executor signed over $400,000 in foundation checks \"payable to young female models and actresses, including a former Russian model,\" and details about an immigration lawyer allegedly \"involved in one or more forced marriages arranged among Epstein's victims.\" \n\nSeparately, Drop Site News was also apparently able to guess URLs of files not y",
        "id": 4399669,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/24/1710233/some-of-dojs-careful-redactions-can-be-defeated-with-copy-paste",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Some of DOJ's Careful Redactions Can Be Defeated With Copy-Paste",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T17:13:15.533505+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T17:00:00+00:00",
        "description": "Hallmark has released more than 300 Christmas-themed TV movies since 2000, and a detailed internal rulebook obtained by film data analyst Stephen Follows explains how the company manages to produce nearly one new holiday film per week during the final quarter of each year without the whole operation collapsing into creative chaos. \n\nThe document, referred to as Hallmark's \"bible\" by writers and producers who have worked on these films, specifies everything from script length (105-110 pages across a rigid nine-act structure) to prohibited activities (no bowling, no karaoke). Christmas movies must include snow or its remnants and feature characters engaged in seasonal activities like baking cookies, ice skating, and drinking hot chocolate. \n\nThe target demographic is women aged 25-54, and the content must be watchable by an 80-year-old grandmother and a 5-year-old niece simultaneously. The economics differ sharply from theatrical filmmaking. Licensed titles from outside production compa",
        "id": 4399257,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/24/1632200/what-rules-govern-hallmark-christmas-movies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Rules Govern Hallmark Christmas Movies?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T16:07:12.087115+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T16:00:00+00:00",
        "description": "An anonymous reader shares a report: In 2024, 25.2% of gross final energy consumption in the EU came from renewable sources, up by 0.7 percentage points compared with 2023. This share is 17.3 pp short of meeting the 2030 target (42.5%), which would require an annual average increase of 2.9 pp from 2025 to 2030. \n\nAmong the EU countries, Sweden recorded the highest share of its gross final energy consumption coming from renewable sources (62.8%). Sweden primarily relied on solid biomass, hydro and wind. Finland followed with 52.1%, relying on solid biomass, wind and hydro, while Denmark came in third with 46.8%, with most of its renewable energy sourced from solid biomass, wind and biogas. The lowest shares of renewables were recorded in Belgium (14.3%), Luxembourg (14.7%), and Ireland (16.1%).<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=25.2%25+of+Energy+EU+Used+in+2024+Came+From+Renewables%3A+https%3A%2F%2Fhardw",
        "id": 4398839,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/24/1430253/252-of-energy-eu-used-in-2024-came-from-renewables",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "25.2% of Energy EU Used in 2024 Came From Renewables",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T16:07:12.353553+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T15:01:00+00:00",
        "description": "YouTube has been winning the streaming wars for years, but its real competitive advantage comes not from prime-time viewing but from its stranglehold on daytime hours when Americans are meditating, exercising, cooking, or simply looking for background noise. At 11 a.m. in October, YouTube commanded an average audience of 6.3 million viewers compared to Netflix's 2.8 million, according to Nielsen data. Amazon drew about a million viewers at that hour, and HBO Max, Paramount+ and Peacock each pulled fewer than 600,000. \n\nThe gap narrows significantly at night -- Netflix's audience swells to over 11 million at 9 p.m., trailing YouTube's 12 million -- but YouTube's dominance reasserts itself in overnight hours and through the next day. Netflix is responding by bringing at least 34 video podcasts to its service next year, including \"The Breakfast Club,\" \"The Bill Simmons Podcast,\" and \"Pardon My Take.\" Amazon added the Kelce brothers' \"New Heights\" podcast to Prime Video in September. The ",
        "id": 4398840,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/24/1329210/youtube-has-a-firm-grip-on-daytime-tv",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Has a Firm Grip on Daytime TV",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T15:00:01.738570+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T14:00:00+00:00",
        "description": "Goldman Sachs, in a note this week, via India Dispatch: There are various reasons that explains this: (i) A large part of the global education spend goes towards formal education (schools, colleges and universities), which are typically either run by governments or are not-for-profit institutions; \n\n(ii) It is difficult to replicate education quality at scale in our view, since most teachers would have a different pedagogy, and thus standardization is harder to achieve vs that in other internet categories; \n\n(iii) Education is fragmented - it includes various fields (schools, undergrad courses, medicine, engg, management, etc.), each with their own curriculum, and the same being vastly different across countries globally; this makes scalability difficult beyond a few certain specializations and regions. \n\nAdditionally, we believe the ability for online education to capture a sizable value share of supplemental education is limited since the perceived value of offline, including that f",
        "id": 4398408,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/24/0846214/why-are-there-no-large-market-cap-companies-globally-in-edtech",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Why Are There No Large Market Cap Companies Globally in Edtech?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T13:52:13.336179+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: The State Department announced Tuesday it was barring five Europeans it accused of leading efforts to pressure U.S. tech firms to censor or suppress American viewpoints. The Europeans, characterized by Secretary of State Marco Rubio as \"radical\" activists and \"weaponized\" nongovernmental organizations, fell afoul of a new visa policy announced in May to restrict the entry of foreigners deemed responsible for censorship of protected speech in the United States. \"For far too long, ideologues in Europe have led organized efforts to coerce American platforms to punish American viewpoints they oppose,\" Rubio posted on X. \"The Trump Administration will no longer tolerate these egregious acts of extraterritorial censorship.\"\n \nThe five Europeans were identified by Sarah Rogers, the under secretary of state for public diplomacy, in a series of posts on social media. [...] The five Europeans named by Rogers are: Imran Ahmed, chief ",
        "id": 4398009,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/24/0319202/us-bars-five-europeans-it-says-pressured-tech-firms-to-censor-american-viewpoints-online",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Bars Five Europeans It Says Pressured Tech Firms To Censor American Viewpoints Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T10:24:48.263259+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T10:00:00+00:00",
        "description": "Longtime Slashdot reader MrFreak shares a public radio interview from 2015 discussing artificial intelligence as inference over abstract inputs, along with scaling limits, automation, and governance models, where for-profit engines are constrained by nonprofit oversight: Recorded months before OpenAI was founded, the conversation treats intelligence as math plus incentives rather than something mystical, touching on architectural bottlenecks, why \"reasoning\" may not simply emerge from brute force, labor displacement, and institutional design for advanced AI systems. Many of the themes align closely with current debates around large language models and AI governance.\n \nThe recording was revisited following recent remarks by Sergey Brin at Stanford, where he acknowledged that despite Google's early work on Transformers, institutional hesitation and incentive structures limited how aggressively the technology was pursued. The interview provides an earlier, first-principles perspective on",
        "id": 4396896,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/23/2242225/2015-radio-interview-frames-ai-as-high-level-algebra",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "2015 Radio Interview Frames AI As 'High-Level Algebra'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T07:07:56.252507+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T07:00:00+00:00",
        "description": "theodp writes: We all mix pictures, emojis, and text freely in our communications. So why not in our code? That's the premise of \"Fun With Python and Emoji: What Might Adding Pictures to Text Programming Languages Look Like?\" (two-image Bluesky explainer; full slides), which takes a look at what mixing emoji with Python and SQL might look like. A GitHub repo includes a Google Colab-ready Python notebook proof of concept that does rudimentary emoji-to-text translation via an IPython input transformer.\n \nSo, in the Golden Age of AI -- some 60+ years after Kenneth Iverson introduced the chock-full-of-symbols APL -- are valid technical reasons still keeping symbols and pictures out of code, or is their absence more of a programming dogma thing?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=What+Might+Adding+Emojis+and+Pictures+To+Text+Programming+Languages+Look+Like%3F%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2",
        "id": 4396068,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/24/0323250/what-might-adding-emojis-and-pictures-to-text-programming-languages-look-like",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Might Adding Emojis and Pictures To Text Programming Languages Look Like?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T04:02:09.433601+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Across Uzbekistan, a network of about a hundred banks of high-resolution roadside cameras continuously scan vehicles' license plates and their occupants, sometimes thousands a day, looking for potential traffic violations. Cars running red lights, drivers not wearing their seatbelts, and unlicensed vehicles driving at night, to name a few. The driver of one of the most surveilled vehicles in the system was tracked over six months as he traveled between the eastern city of Chirchiq, through the capital Tashkent, and in the nearby settlement of Eshonguzar, often multiple times a week. We know this because the country's sprawling license plate-tracking surveillance system has been left exposed to the internet.\n \nSecurity researcher Anurag Sen, who discovered the security lapse, found the license plate surveillance system exposed online without a password, allowing anyone access to the data within. It's not clear how long the surveillan",
        "id": 4395460,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/23/2220226/inside-uzbekistans-nationwide-license-plate-surveillance-system",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Inside Uzbekistan's Nationwide License Plate Surveillance System",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T02:54:05.793275+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T02:10:00+00:00",
        "description": "Under pressure from the Digital Markets Act, Apple's iOS 26.3 adds AirPods-style proximity pairing and notification support for third-party accessories in the EU. The changes will roll out to European users in 2026. MacRumors reports: The Digital Markets Act requires Apple to provide third-party accessories with the same capabilities and access to device features that Apple's own products get. In iOS 26.3, EU wearable device makers can now test proximity pairing and improved notifications.\n \nHere are the new capabilities that Apple is adding:\n- Proximity pairing - Devices like earbuds will be able to pair with an iOS device in an AirPods-like way by bringing the accessory close to an iPhone or iPad to initiate a simple, one-tap pairing process. Pairing third-party devices will no longer require multiple steps.\n- Notifications - Third-party accessories like smart watches will be able to receive notifications from the iPhone. Users will be able to view and react to incoming notification",
        "id": 4395240,
        "language": "en-us",
        "link": "https://devices.slashdot.org/story/25/12/23/2247241/ios-263-brings-airpods-like-pairing-to-third-party-devices-in-eu-under-dma",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "iOS 26.3 Brings AirPods-Like Pairing To Third-Party Devices In EU Under DMA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T01:48:12.044132+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T01:30:00+00:00",
        "description": "A group of authors led by John Carreyrou has filed a new lawsuit against Anthropic, Google, OpenAI, Meta, xAI, and Perplexity, accusing the AI firms of training models on pirated copies of their books. TechCrunch reports: If this sounds familiar, it's because another set of authors already filed a class action suit against Anthropic for these same acts of copyright infringement. In that case, the judge ruled that it was legal for Anthropic and similar AI companies to train on pirated copies of books, but that it was not legal to pirate the books in the first place.\n \nWhile eligible writers can receive about $3,000 from the $1.5 billion Anthropic settlement, some authors were dissatisfied with that resolution -- it doesn't hold AI companies accountable for the actual act of using stolen books to train their models, which generate billions of dollars in revenue. The plaintiffs in the new lawsuit say the proposed Anthropic settlement \"seems to serve [the AI companies], not creators.\"\n \n\"",
        "id": 4394968,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/23/2254257/john-carreyou-and-other-authors-bring-new-lawsuit-against-six-major-ai-companies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "John Carreyou and Other Authors Bring New Lawsuit Against Six Major AI Companies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T01:48:12.130677+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T00:50:00+00:00",
        "description": "Phoronix's Michael Larabel writes: An interesting anecdote from this month's Linux Plumbers Conference in Tokyo is that Meta (Facebook) is using the Linux scheduler originally designed for the needs of Valve's Steam Deck... On Meta Servers. Meta has found that the scheduler can actually adapt and work very well on the hyperscaler's large servers. [...]\n \nThe presentation at LPC 2025 by Meta engineers was in fact titled \"How do we make a Steam Deck scheduler work on large servers.\" At Meta they have explored SCX_LAVD as a \"default\" fleet scheduler for their servers that works for a range of hardware and use-cases for where they don't need any specialized scheduler. They call this scheduler built atop sched_ext as \"Meta's New Default Scheduler.\"\n \nLAVD they found to work well across the growing CPU and memory configurations of their servers, nice load balancing between CCX/LLC boundaries, and more. Those wishing to learn more about Meta's use and research into SCX-LAVD can find the Linu",
        "id": 4394969,
        "language": "en-us",
        "link": "https://linux.slashdot.org/story/25/12/23/227227/meta-is-using-the-linux-scheduler-designed-for-valves-steam-deck-on-its-servers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta Is Using The Linux Scheduler Designed For Valve's Steam Deck On Its Servers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-24T00:41:39.548031+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-24T00:10:00+00:00",
        "description": "An anonymous reader quotes a report from MarketWatch: ServiceNow announced a deal to acquire cybersecurity company Armis on Tuesday, marking a new milestone in the software giant's artificial-intelligence business strategy. The $7.75 billion all-cash transaction is part of ServiceNow's goal of advancing governance and trust in autonomous AI agents, and the company's largest transaction to date. \"The acquisition of Armis will extend and enhance ServiceNow's Security, Risk, and [Operational Technology] portfolios in critical and fast-growing areas of cybersecurity and drive increased AI adoption by strengthening trust across businesses' connected environments,\" the company wrote in a press release.\n \nWhile ServiceNow built its foundation IT service management products, the company has positioned itself as an \"AI control tower\" that orchestrates workflows across HR, customer service and security operations. Organizations today are operating in increasingly complex environments, with asse",
        "id": 4394698,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/23/2313234/servicenow-to-buy-armis-for-775-billion-as-it-bets-big-on-cybersecurity-for-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ServiceNow To Buy Armis For $7.75 Billion As It Bets Big On Cybersecurity For AI",
        "vote": 0
    }
]