[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-26T20:21:10.419701+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-26T19:30:06+00:00",
        "description": "Gundam fans not concerned with this game's shortcomings have nothing to worry about. There is a whole lot of content and value in this package, and enough references to the universe and story they love, that this purchase would be a no brainer to them. \n\nBut what I truly hope for is that this rerelease does well enough that the developers return with a new, higher budget entry, with a more newcomer friendly campaign and better visuals, which can greatly expand the number of people interested in the Gundam property by itself. That’ll be the game for them. \n\nThis one? This one is probably best left to the existing Gundam fans. You folks, at least, are going to have a blast.\n\nNote: All footage seen in this video is official. We weren't able to capture footage because the Switch wouldn't allow it for unknown reasons.",
        "id": 2776902,
        "language": null,
        "link": "https://www.youtube.com/watch?v=gjxmBkhUlOE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gjxmBkhUlOE/hqdefault.jpg",
        "title": "Mobile Suit Gundam SEED: Battle Destiny - Remastered Review - Only For The Hardcore Fans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-26T16:01:44.001787+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-26T15:30:34+00:00",
        "description": "The Mortal Kombat franchise has been a juggernaut for WB Games for a long time now, but things with Mortal Kombat 1 have certainly not progressed the way the company would have hoped. \n\nThe series’ latest reboot launched in 2023 to immediately divisive reception from fans, and in the time following its release, things didn’t get much better, thanks to questionable post-launch decisions, underwhelming content, and aggressive monetization. \n\nNow, it has been announced that support is ending for Mortal Kombat 1, a bit prematurely compared to what many would have expected, and it’s hard not to feel disappointed with how things have gone for the game.",
        "id": 2775332,
        "language": null,
        "link": "https://www.youtube.com/watch?v=wafqQDWgNSw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wafqQDWgNSw/hqdefault.jpg",
        "title": "How Mortal Kombat 1 Was BUTCHERED",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-26T13:50:51.182166+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-26T13:30:22+00:00",
        "description": "If you told me in 2021 that Questline and Awaken Realms would translate the dark fantasy setting of Tainted Grail: Conquest into a full-fledged open-world action RPG comparable to The Elder Scrolls, I wouldn't believe you. Very few titles have been able to compare to the sheer scale of Bethesda's work, much less the quality of its best, never mind a small, relatively unknown studio of about 50 developers. Nevertheless, it's 2025, Tainted Grail: The Fall of Avalon is out of early access, and it's garnering positive impressions from critics and players alike.\n\nThe timing is all the more incredible because it's following The Elder Scrolls 4: Oblivion Remastered, which introduced a whole new generation to one of Bethesda's premier titles and reminded many why it still holds up so well (warts and all). But with how notable Oblivion is and the sheer value of its deal – since it includes all expansions and DLC – what makes Tainted Grail worth checking out and in some ways, even better?",
        "id": 2774308,
        "language": null,
        "link": "https://www.youtube.com/watch?v=EhrqMhy2O4Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EhrqMhy2O4Y/hqdefault.jpg",
        "title": "What Makes Tainted Grail: The Fall of Avalon SO ADDICTIVE?",
        "vote": 0
    }
]