[
    {
        "age": null,
        "album": "",
        "author": "Ku Bogu",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-05-26T22:53:58.157430+00:00",
        "date_dead_since": null,
        "date_published": "2025-05-26T21:41:46+00:00",
        "description": "Dlaczego publikuję takie materiały? Każdy żołnierz oraz tzw. mundurowy wie, że m.in. kluczem do zwycięstwa nad przeciwnikiem jest jego głeboka znajomość. Poznanie jego zwyczajów, taktyki, ale i szerzej - jego strategii, jego słabości i mocnych stron jest jednym z kluczy do sukcesu w takiej walce, choć go automatycznie nie gwarantuje. Materiały te publikuję także, aby pomóc wyjść wielu osobom uwiązanym ze złem odciąć się od niego i jego wpływu na ich życie, uświadomić wielu braciom i siostrom w Chrystusie Jezusie, dlaczego zło zdaje się triumfować w wielu przypadkach, pomimo ich oddania Panu Bogu - zdawałoby się na każdym polu. Wielu uwięzionych w sieci zła nie wie jak się z niej wyrwać. Będę o tym mówił i wracał do tematu. Zachęcam jednak i PRZEDE WSZYSTKIM do konferencji, kazań oraz homilii prowadzonych przez \"znających się na rzeczy\" kapłanów Świętego Kościoła Katolickiego - egzorcystów oraz byłych egzorcystów, weteranów walki z nieprzyjacielem, a także studiowania klasycznej litera",
        "id": 2777638,
        "language": null,
        "link": "https://www.youtube.com/watch?v=-Yj08U82aYc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 178,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-Yj08U82aYc/hqdefault.jpg",
        "title": "Walka duchowa: Świadectwo Eiry. Jak szatan został oszukany? #Podcast 002",
        "vote": 0
    }
]