[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T23:17:23+00:00",
        "description": "Ancient Slashdot reader Alain Williams shares a report from the BBC: Meta has won an emergency ruling in the US to temporarily stop a former director of Facebook from promoting or further distributing copies of her memoir. The book, Careless People by Sarah Wynn-Williams, who used to be the company's global public policy director, includes a series of critical claims about what she witnessed during her seven years working at Facebook.\n \nFacebook's parent company, Meta, says the ruling -- which orders her to stop promotions \"to the extent within her control\" -- affirms that \"the false and defamatory book should never have been published.\" The UK publisher Macmillan says it is \"committed to upholding freedom of speech\" and Ms Wynn-Williams' \"right to tell her story.\" [You can also hear Ms Wynn-Williams interviewed in the BBC Radio 4 Media Show on March 12.]<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Stops+Ex",
        "id": 2317534,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/13/2043257/meta-stops-ex-director-from-promoting-critical-memoir?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Stops Ex-Director From Promoting Critical Memoir",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T22:12:55+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Anthropic CEO Dario Amodei raised a few eyebrows on Monday after suggesting that advanced AI models might someday be provided with the ability to push a \"button\" to quit tasks they might find unpleasant. Amodei made the provocative remarks during an interview at the Council on Foreign Relations, acknowledging that the idea \"sounds crazy.\"\n \n\"So this is -- this is another one of those topics that's going to make me sound completely insane,\" Amodei said during the interview. \"I think we should at least consider the question of, if we are building these systems and they do all kinds of things like humans as well as humans, and seem to have a lot of the same cognitive capacities, if it quacks like a duck and it walks like a duck, maybe it's a duck.\"\n \nAmodei's comments came in response to an audience question from data scientist Carmem Domingues about Anthropic's late-2024 hiring of AI welfare researcher Kyle Fish \"to look at, you kn",
        "id": 2317159,
        "language": null,
        "link": "https://slashdot.org/story/25/03/13/2038219/anthropic-ceo-floats-idea-of-giving-ai-a-quit-job-button?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anthropic CEO Floats Idea of Giving AI a 'Quit Job' Button",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T22:12:55+00:00",
        "description": "An anonymous reader shares a report: Citigroup plans to dramatically reduce its reliance on IT contractors and hire thousands of employees for IT as the lender grapples with regulatory punishments over data governance and deficient controls. Citigroup's head of technology Tim Ryan told staff in recent weeks that the bank aims to cut back external contractors to 20% of those working in IT from the current 50%, according to an internal presentation to employees seen by Reuters. \n\nThe briefing did not give a precise time horizon for the changes. As part of the overhaul, Citi will replenish the ranks by hiring more staff, and aims to have 50,000 employees in technology, up from 48,000 in 2024, the presentation showed. \"Citi is growing our internal technology capabilities to support our strategy to improve safety and soundness, enable revenue growth and drive efficiencies,\" Citi said in a statement to Reuters.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\"",
        "id": 2317160,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/13/1858228/citigroup-plans-to-slash-it-contractors-hire-staff-to-improve-controls?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Citigroup Plans To Slash IT Contractors, Hire Staff To Improve Controls",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T21:08:27+00:00",
        "description": "Google is continuing its quest to get more people to use Gemini, and it's doing that by giving away even more AI computing. From a report: Today, Google is releasing a raft of improvements for the Gemini 2.0 models, and as part of that upgrade, some of the AI's most advanced features are now available to free users. You'll be able to use the improved Deep Research to get in-depth information on a topic, and Google's newest reasoning model can peruse your search history to improve its understanding of you as a person. \n\n[...] With the aim of making Gemini more personal to you, Google is also plugging Flash Thinking Experimental into a new source of data: your search history. Google stresses that you have to opt in to this feature, and it can be disabled at any time. Gemini will even display a banner to remind you it's connected to your search history so you don't forget.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?statu",
        "id": 2316718,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/13/1853231/googles-gemini-ai-can-now-see-your-search-history?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's Gemini AI Can Now See Your Search History",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T21:08:27+00:00",
        "description": "OpenAI has warned the U.S. government that restricting AI models from learning from copyrighted material would threaten America's technological leadership against China, according to a proposal submitted [PDF] to the Office of Science and Technology Policy for the AI Action Plan. \n\nIn its March 13 document, OpenAI argues its AI training aligns with fair use doctrine, saying its models don't replicate works but extract \"patterns, linguistic structures, and contextual insights\" without harming commercial value of original content. \"If the PRC's developers have unfettered access to data and American companies are left without fair use access, the race for AI is effectively over. America loses, as does the success of democratic AI,\" OpenAI stated. \n\nThe Microsoft-backed startup criticized European and UK approaches that allow copyright holders to opt out of AI training, claiming these restrictions hinder innovation, particularly for smaller companies with limited resources. The proposal ",
        "id": 2316719,
        "language": null,
        "link": "https://slashdot.org/story/25/03/13/1846224/openai-warns-limiting-ai-access-to-copyrighted-content-could-give-china-advantage?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Warns Limiting AI Access To Copyrighted Content Could Give China Advantage",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T20:02:20+00:00",
        "description": "An anonymous reader shares a report: Germany's foreign intelligence service in 2020 put at 80%-90% the likelihood that the coronavirus behind the COVID-19 pandemic was accidentally released from China's Wuhan Institute of Virology, two German newspapers reported on Wednesday. \n\nAccording to a joint report by publications Die Zeit and Sueddeutscher Zeitung, Germany's spying agency BND had indications that the institute had conducted gain-of-function experiments, whereby viruses are modified to become more transmissible to humans for research purposes. \n\nIt also had indications that numerous violations of safety regulations had occurred at the lab, the papers said. The spy agency assessment's was based on an unspecified intelligence operation code-named \"Saaremaa\" as well as on publicly-available data. It had been commissioned by the office of Germany's chancellor at the time, Angela Merkel, but never published, the report said.<p><div class=\"share_submission\" style=\"position:relative;",
        "id": 2316213,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/13/1835237/german-spy-agency-concluded-covid-virus-likely-leaked-from-lab?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "German Spy Agency Concluded COVID Virus Likely Leaked From Lab",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T20:02:20+00:00",
        "description": "Microsoft says that some USB printers will start printing random text after installing Windows updates released since late January 2025. From a report: The known issue affects Windows 10 (version 22H2) and Windows 11 (versions 22H2 and 23H2), but according to an update to the Windows release health dashboard, the latest Windows 11 24H2 is not impacted. \n\n\"After installing the January 2025 Windows preview update (KB5050092), released January 29, 2025, or later updates, you might observe issues with USB connected dual-mode printers that support both USB Print and IPP Over USB protocols,\" Redmond explains. \"You might observe that the printer unexpectedly prints random text and data, including network commands and unusual characters.\" \n\nOn affected systems, users will often see erroneously printed text that begins with the header \"POST /ipp/print HTTP/1.1,\" followed by other IPP (Internet Printing Protocol) related issues headers. These printing issues are more frequent when the printer ",
        "id": 2316214,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/13/1828215/microsoft-recent-windows-updates-make-usb-printers-print-random-text?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft: Recent Windows Updates Make USB Printers Print Random Text",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T17:53:17+00:00",
        "description": "An Australian man in his forties has become the first person in the world to leave hospital with an artificial heart made of titanium. From a report: The device is used as a stopgap for people with heart failure who are waiting for a donor heart, and previous recipients of this type of artificial heart had remained in US hospitals while it was in place. \n\nThe man lived with the device for more than three months until he underwent surgery to receive a donated human heart. The man is recovering well, according to a statement from St Vincent's Hospital in Sydney, Australia, where the operations were conducted. The Australian is the sixth person globally to receive the device, known as BiVACOR, but the first to live with it for more than a month.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Man+Survives+With+Titanium+Heart+For+100+Days+-+a+World+First%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F03%2F13%2F173",
        "id": 2315138,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/13/173229/man-survives-with-titanium-heart-for-100-days---a-world-first?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Man Survives With Titanium Heart For 100 Days - a World First",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T17:53:17+00:00",
        "description": "Mozilla has warned that the U.S. Department of Justice's proposed remedies in its antitrust case against Google would harm independent browsers and reduce competition in the browser market. The DOJ and several state attorneys general last week filed revised proposed remedies in the U.S. v. Google search case that would prohibit all search payments to browser developers, a move Mozilla says would disproportionately impact smaller players. \n\n\"These proposed remedies prohibiting search payments to small and independent browsers miss the bigger picture -- and the people who will suffer most are everyday internet users,\" said Mark Surman, President of Mozilla. Unlike Apple and Microsoft, which generate revenue from hardware and operating systems, Mozilla relies primarily on search revenue to fund browser development. Mozilla argues that cutting these payments would not solve search dominance but would instead strengthen the position of tech giants. \n\nMozilla also warned that the proposal ",
        "id": 2315137,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/13/1716227/mozilla-warns-dojs-google-remedies-risk-death-of-open-web?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mozilla Warns DOJ's Google Remedies Risk 'Death of Open Web'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T16:48:33+00:00",
        "description": "Microsoft is preparing to launch an AI-powered Copilot for Gaming soon that will guide Xbox players through games and act as an assistant to download and launch games. From a report: Copilot for Gaming, as Microsoft is branding it, will be available through the Xbox mobile app initially and is designed to work on a second screen as a companion or assistant. \n\nMicrosoft is positioning Copilot for Gaming as a sidekick of sorts, one that will accompany you through games, offering up tips and guides and useful information about a game world. During a press briefing, Sonali Yadav, product manager for gaming AI, demonstrated several scenarios for what Copilot for Gaming could be used for. One involved a concept demo of Copilot assisting an Overwatch 2 player by coaching them on the mistakes they made when trying to push without teammates.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft's+Xbox+Copilot+Will+Act+As",
        "id": 2314455,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/13/1549238/microsofts-xbox-copilot-will-act-as-an-ai-gaming-coach?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's Xbox Copilot Will Act As an AI Gaming Coach",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T15:43:07+00:00",
        "description": "Britain's competition watchdog has concluded that Apple and Google are stifling competition in the UK mobile browser market, following an investigation by the Competition and Markets Authority (CMA). The inquiry found Apple's iOS policies particularly restrictive, requiring all browsers to use its WebKit engine while giving Safari preferential access to features. \n\nApple's practice of pre-installing Safari as the default browser also reduces awareness of alternatives, despite allowing users to change defaults. Google faces similar criticism for pre-installing Chrome on most Android devices, though investigators noted both companies have recently taken steps to facilitate browser switching. The probe identified Apple's revenue-sharing arrangement with Google -- which pays a significant share of search revenue to be the default iPhone search engine -- as \"significantly reducing their financial incentives to compete.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=",
        "id": 2313813,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/13/1356205/uk-investigation-says-apple-google-hampering-mobile-browser-competition?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Investigation Says Apple, Google Hampering Mobile Browser Competition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T15:43:07+00:00",
        "description": "A new statistical analysis has identified the films audiences \"love to hate,\" with Battlefield Earth, Morbius, Grease 2, and Cats topping the list of cinema's most detested productions. The study, published by data analyst Daniel Parris, examined review data from MovieLens to calculate both the percentage of one-star reviews and total disapproval magnitude for each release. \n\nA common thread among these widely derided titles: many were adaptations of popular books or shows, or attempted to capitalize on once-beloved franchises. Adam Sandler leads the actors most frequently appearing in widely disliked films, followed by comedians and action stars who have starred in productions with high one-star review rates. \n\nThe research also reveals an industry trend toward increasing one-star reviews over time, with family-oriented fare and horror films receiving disproportionately negative ratings despite consistent box office profitability - suggesting studios have prioritized risk-averse, co",
        "id": 2313812,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/13/148212/which-movies-do-people-love-to-hate-a-statistical-analysis?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Which Movies Do People Love to Hate? A Statistical Analysis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T14:37:21+00:00",
        "description": "Parents who are worried about their children being on Roblox should not let them use it, the chief executive of the gigantic gaming platform has said. From a report: The site, which is the most popular in the UK among young gamers aged eight to 12, has been dogged by claims of some children being exposed to explicit or harmful content through its games, alongside multiple reported allegations of bullying and grooming. \n\nBut its co-founder and CEO Dave Baszucki insisted that the company is vigilant in protecting its users and pointed out that \"tens of millions\" of people have \"amazing experiences\" on the site. When asked what his message is to parents who don't want their children on the platform, Mr Baszucki said: \"My first message would be, if you're not comfortable, don't let your kids be on Roblox.\" [...] \"That sounds a little counter-intuitive, but I would always trust parents to make their own decisions,\" he told BBC News in an exclusive interview.<p><div class=\"share_submission",
        "id": 2313246,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/13/1341218/keep-kids-off-roblox-if-youre-worried-its-ceo-tells-parents?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Keep Kids Off Roblox If You're Worried, Its CEO Tells Parents",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T13:33:02+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Anthropic's CEO Dario Amodei is worried that spies, likely from China, are getting their hands on costly \"algorithmic secrets\" from the U.S.'s top AI companies -- and he wants the U.S. government to step in. Speaking at a Council on Foreign Relations event on Monday, Amodei said that China is known for its \"large-scale industrial espionage\" and that AI companies like Anthropic are almost certainly being targeted. \"Many of these algorithmic secrets, there are $100 million secrets that are a few lines of code,\" he said. \"And, you know, I'm sure that there are folks trying to steal them, and they may be succeeding.\"\n \nMore help from the U.S. government to defend against this risk is \"very important,\" Amodei added, without specifying exactly what kind of help would be required. Anthropic declined to comment to TechCrunch on the remarks specifically but referred to Anthropic's recommendations to the White House's Office of Science and T",
        "id": 2312658,
        "language": null,
        "link": "https://slashdot.org/story/25/03/13/0118240/anthropic-ceo-says-spies-are-after-100-million-ai-secrets-in-a-few-lines-of-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anthropic CEO Says Spies Are After $100 Million AI Secrets In a 'Few Lines of Code'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T10:16:44+00:00",
        "description": "Longtime Slashdot reader UnknowingFool writes: Gamer's Nexus performed tests on the effect of removing legacy 32-bit PhysX on the newest generation of Nvidia cards with older games, and the results are not good. With PhysX on, the latest generation Nvidia was slightly beaten by a GTX 580 (released 2010) on some games and handily beaten by a GTX 980 (2014) on some games.\n \nWith the launch of the 5000 series, NVidia dropped 32-bit CUDA support going forward. Part of that change was dropping support for 32-bit PhysX. As a result, older titles that used it would perform poorly with 5000 series cards as it would default to CPU for calculations. Even the latest CPUs do not perform as well as 15-year-old GPUs when it comes to PhysX.\n \nThe best performance on the 5080 was to turn PhysX off however that would remove many effects like smoke, breaking glass, and rubble from scenes. The second-best option was to pair a 5000 series with an older card like a 980 to handle the PhysX computations.<p",
        "id": 2311309,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/13/0020246/legacy-32-bit-physx-removal-cripples-performance-on-new-gpus?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Legacy 32-bit PhysX Removal Cripples Performance On New GPUs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T07:01:35+00:00",
        "description": "Using the Summit supercomputer at the Department of Energy's Oak Ridge National Laboratory, researchers have modeled a key component of nucleotide excision repair (NER) called the pre-incision complex (PInC), which plays a crucial role in DNA damage repair. Their study, published in Nature Communications, provides new insights into how the PInC machinery orchestrates precise DNA excision, potentially leading to advancements in treating genetic disorders, preventing premature aging, and understanding conditions like xeroderma pigmentosum and Cockayne syndrome. Phys.Org reports: \"Computationally, once you assemble the PInC, molecular dynamics simulations of the complex become relatively straightforward, especially on large supercomputers like Summit,\" [said lead investigator Ivaylo Ivanov, a chemistry professor at Georgia State University]. Nanoscale Molecular Dynamics, or NAMD, is a molecular dynamics code specifically designed for supercomputers and is used to simulate the movements ",
        "id": 2310481,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/13/0035232/supercomputer-draws-molecular-blueprint-for-repairing-damaged-dna?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Supercomputer Draws Molecular Blueprint For Repairing Damaged DNA",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T04:51:56+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Researchers at Harvard University led the study, and it included nearly 58,000 adults in Japan who were followed for up to a year using a database of medical records from routine checkups. Researchers found that when people switched from being nondrinkers to drinkers during the study, they saw a drop in their \"bad\" cholesterol -- aka low-density lipoprotein cholesterol or LDL. Meanwhile, their \"good\" cholesterol -- aka high-density lipoprotein cholesterol or HDL -- went up when they began imbibing. HDL levels went up so much, that it actually beat out improvements typically seen with medications, the researchers noted.\n \nOn the other hand, drinkers who stopped drinking during the study saw the opposite effect: Upon giving up booze, their bad cholesterol went up and their good cholesterol went down. The cholesterol changes scaled with the changes in drinking. That is, for people who started drinking, the more they started drinking",
        "id": 2310023,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/13/0016206/large-study-shows-drinking-alcohol-is-good-for-your-cholesterol-levels?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Large Study Shows Drinking Alcohol Is Good For Your Cholesterol Levels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T02:41:12+00:00",
        "description": "Netflix has deployed AI upscaling on the 1987-1993 sitcom \"A Different World,\" resulting in significant visual artifacts documented by technology commentator Scott Hanselman. The AI processing, intended to enhance the original 360p footage for modern displays, has generated distortions resembling \"lava lamp effects\" on actors' bodies, improperly rendered mouths, and misshapen background objects including posters and tennis rackets. This marks Netflix's second controversial AI implementation in recent months, following December's AI-powered dubbing and mouth morphing on \"La Palma.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Netflix+Used+AI+To+Upscale+'A+Different+World'+and+It's+a+Melted+Nightmare%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F25%2F03%2F13%2F0218204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http",
        "id": 2309630,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/03/13/0218204/netflix-used-ai-to-upscale-a-different-world-and-its-a-melted-nightmare?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Netflix Used AI To Upscale 'A Different World' and It's a Melted Nightmare",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T01:36:17+00:00",
        "description": "Google says its new open-source AI model, Gemma 3, achieves nearly the same performance as DeepSeek AI's R1 while using just one Nvidia H100 GPU, compared to an estimated 32 for R1. ZDNet reports: Using \"Elo\" scores, a common measurement system used to rank chess and athletes, Google claims Gemma 3 comes within 98% of the score of DeepSeek's R1, 1338 versus 1363 for R1. That means R1 is superior to Gemma 3. However, based on Google's estimate, the search giant claims that it would take 32 of Nvidia's mainstream \"H100\" GPU chips to achieve R1's score, whereas Gemma 3 uses only one H100 GPU.\n \nGoogle's balance of compute and Elo score is a \"sweet spot,\" the company claims. In a blog post, Google bills the new program as \"the most capable model you can run on a single GPU or TPU,\" referring to the company's custom AI chip, the \"tensor processing unit.\" \"Gemma 3 delivers state-of-the-art performance for its size, outperforming Llama-405B, DeepSeek-V3, and o3-mini in preliminary human pre",
        "id": 2309399,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/13/0010231/google-claims-gemma-3-reaches-98-of-deepseeks-accuracy-using-only-one-gpu?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Claims Gemma 3 Reaches 98% of DeepSeek's Accuracy Using Only One GPU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T00:28:06+00:00",
        "description": "Saudi Arabia's Public Investment Fund (PIF) is acquiring Niantic&#226;(TM)s gaming division for $3.5 billion through its subsidiary Savvy Games Group. Niantic's titles include the hit mobile game Pokemon Go, Monster Hunter Now and Pikmin Bloom. \"Despite launching almost a decade ago, Pokemon Go is still amongst the highest-grossing mobile games in the world, with 30 million monthly players,\" notes the BBC. From the report: Scopely is one of the biggest names in mobile gaming, with its most successful title, Monopoly Go, being downloaded more than 50 million times and generating more than $3 billion in revenue. Pokemon itself is jointly owned by Nintendo, Game Freak and Creatures, which licensed the brand to Niantic so it could develop the game.\n \nEd Wu, who leads the Pokemon Go team at Niantic, said in a blog post he believed the move was \"a positive step\" for the game's future. \"Pokemon Go is more than just a game to me, it's my life's work,\" he said. \"I won't say that Pokemon Go wi",
        "id": 2309091,
        "language": null,
        "link": "https://games.slashdot.org/story/25/03/13/000254/saudi-investment-fund-pays-35-billion-to-capture-pokemon-go?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Saudi Investment Fund Pays $3.5 Billion To Capture Pokemon Go",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-13T00:28:06+00:00",
        "description": "According to The Verge, Sonos has abandoned its plans to release a streaming video player this year. From the report: The news was announced by the company's leadership during an all-hands call today. That product, codenamed Pinewood, was set to be Sonos' next major hardware launch. It was already deep into development and has spent months in beta testing. But now the team behind it will be reassigned to other projects as interim CEO Tom Conrad reprioritizes the company's future roadmap and continues what he hopes will be a turnaround from a bruising 2024. He told employees that a push into video from Sonos is off the table \"for now.\" [...]\n \nPinewood was designed to offer many of the same streaming video apps as other devices on the market along with deep universal search and content aggregation. But as I reported last month, Sonos also intended for it to double as an HDMI switcher and support passthrough functionality for gaming consoles, 4K Blu-ray players, and more. The box was a",
        "id": 2309092,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/12/2344201/sonos-cancels-its-streaming-video-player?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Sonos Cancels Its Streaming Video Player",
        "vote": 0
    }
]