[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-28T19:03:17.957394+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-28T16:01:36+00:00",
        "description": "Tales of the Shire: A Lord of the Rings Game is a truly unique take on not only the Lord of the Rings property, but also the cozy sim genre as well. The game puts you in the shoes of a young Hobbit that has decided to move into the town of Bywater for a fresh start. Beyond that, however, there really isn’t much in the way of story to make you keep playing.\n\nWhat will make you come back to the game is the overall relaxing atmosphere, and how just about every aspect of gameplay feeds into its core mechanics of making new friends and getting to know your old friends better over a shared meal. \n\nJust about every gameplay system in the title feeds into the cooking system, which in turn is how you get to know the other villagers in Bywater. Just don’t expect much of a story here.",
        "id": 3219330,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=yXJkr0jw5U8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yXJkr0jw5U8/hqdefault.jpg",
        "title": "Tales of The Shire: A The Lord of the Rings Game Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-28T13:42:15.568923+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-28T13:30:25+00:00",
        "description": "Sony has already released its mid-life refresh of the PS5, the aptly named PS5 Pro. Boasting over 16 TFLOPs of raw compute, the PS5 Pro is an absolute gaming beast and also a significant upgrade over the base PS5. \n\nMany fans would be interested to know how much would it cost to build a PC that matches the performance of the console using all new parts. With this video, we try to do exactly that and discuss why we chose each part as we reach a conclusion of the total amount of our build and stack that against the price of PS5 Pro.",
        "id": 3216668,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=IJKrXsk7VXw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IJKrXsk7VXw/hqdefault.jpg",
        "title": "How Much Would It Cost To Build A PC As Powerful As The PS5 Pro? (2025 Edition)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-28T11:10:38.123145+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-28T10:00:19+00:00",
        "description": "If July seems jam-packed with releases, then August looks to one-up it in every single way. Several highly anticipated titles and sequels to long-running franchises are en route, starting with Hangar 13's Mafia: The Old Country on August 8th. Echoes of the End offers a unique action-adventure experience from Deep Silver, while Senua's Saga: Hellblade 2 finally makes its way to PS5 on August 12th. \n\nMadden NFL 26 and Drag x Drive cover the sports demographic on August 14th. However, it's the latter half of the month that's so interesting, since you can expect the likes of Metal Gear Solid Delta: Snake Eater, Gears of War: Reloaded, Lost Soul Aside, and Shinobi: Art of Vengeance. \n\nIndie efforts like The Rogue Prince of Persia and Sword of the Sea are also worth looking forward to. So while Gamescom may take up most of the attention, here are 15 of the biggest titles launching next month and what to expect from them.",
        "id": 3215683,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=FC7ZFBtPD1I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FC7ZFBtPD1I/hqdefault.jpg",
        "title": "15 NEW Games of August 2025 You Need To Look Forward To",
        "vote": 0
    }
]