[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T19:46:33.230878+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T19:46:32+00:00",
        "description": "The sale of bankrupt DNA data bank 23andMe is delayed as the company struggles to secure a lead bidder who can meet regulatory and privacy requirements, pushing the initial auction deadline from Friday to Monday. Seeking Alpha reports: 23andMe Holdings (OTC:MEHCQ), currently in Chapter 11 bankruptcy proceedings, is requiring that any potential bidders for the company's assets \"guaranty that they will comply with the Company's privacy policies and applicable law.\" The genetics company said this is necessary to protect customers' data.\n \nIn addition, bidders will need to submit documentation of their intended use of any data, describe the privacy programs and security controls they have in place or would implement, and say whether they would ask for current privacy policies to be amended. 23andMe has also filed a motion asking for the appointment of an independent customer Data representative to review whether a proposed deal is in alignment with the company's privacy policies and data ",
        "id": 2550187,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/28/193247/23andme-requiring-potential-bidders-to-affirm-they-will-uphold-data-privacy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "23andMe Requiring Potential Bidders To Affirm They Will Uphold Data Privacy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T19:46:33.346508+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T19:46:32+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: Here's an easy to understand example of how Donald Trump's tariffs on imported products have completely screwed small U.S. businesses and entrepreneurs: the crowdfunding site Kickstarter is introducing a \"Tariff Manager tool\" that will allow creators to add extra charges to projects that were already fully funded in order to deal with the higher and unexpected costs of the president's global trade war. \"Over the past few weeks, we've been hard at work developing tariff-relevant resources to support our community. From guidance to help creators navigate rapidly changing policies, to tips on shipping logistics, and even information to help backers better understand the challenges creators are facing. Our focus has been supporting you through uncertain times, but we also know that information alone isn't always enough,\" Kickstarter said in a blog post published last week announcing the Tariff Manager tool. \"Built specifically to address",
        "id": 2550188,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/28/1857213/kickstarter-introduces-tariff-manager-tool-to-add-charges-to-already-fully-funded-projects?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Kickstarter Introduces 'Tariff Manager Tool' To Add Charges To Already Fully Funded Projects",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T17:35:37.562199+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T17:35:37+00:00",
        "description": "Huawei is gearing up to test its newest and most powerful AI processor, which the company hopes could replace some higher-end products of U.S. chip giant Nvidia. From a WSJ report: Huawei has approached some Chinese tech companies about testing the technical feasibility of the new chip, called the Ascend 910D, people familiar with the matter said. The company is slated to receive the first batch of samples of the processor as soon as late May, some of the people said. \n\nThe development is still at an early stage, and a series of tests will be needed to assess the chip's performance and get it ready for customers, the people said. Huawei hopes that the latest iteration of its Ascend AI processors will be more powerful than Nvidia's H100, a popular chip used for AI training that was released in 2022, said one of the people. Previous versions are called 910B and 910C.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Chin",
        "id": 2549030,
        "language": null,
        "link": "https://slashdot.org/story/25/04/28/1727240/chinas-huawei-develops-new-ai-chip-seeking-to-match-nvidia?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China's Huawei Develops New AI Chip, Seeking To Match Nvidia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T17:35:37.680933+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T17:35:37+00:00",
        "description": "Researchers claiming affiliation with the University of Zurich secretly deployed AI-powered bots in a popular Reddit forum to test whether AI could change users' minds on contentious topics. The unauthorized experiment, which targeted the r/changemyview subreddit, involved bots making over 1,700 comments across several months while adopting fabricated identities including a sexual assault survivor, a Black man opposing Black Lives Matter, and a domestic violence shelter worker. \n\nThe researchers \"personalized\" comments by analyzing users' posting histories to infer demographic information. The researchers, who remain anonymous despite inquiries, claimed their bots were \"consistently well-received,\" garnering over 20,000 upvotes and 137 \"deltas\" -- awards indicating successful opinion changes. Hundreds of bot comments were deleted following the disclosure.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Unauthorized+A",
        "id": 2549031,
        "language": null,
        "link": "https://slashdot.org/story/25/04/28/1642223/unauthorized-ai-bot-experiment-infiltrated-reddit-to-test-persuasion-capabilities?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Unauthorized AI Bot Experiment Infiltrated Reddit To Test Persuasion Capabilities",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T16:25:46.093293+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T16:25:45+00:00",
        "description": "Inventor James Dyson described his career as \"a life of failure\" in a recent Wall Street Journal interview, citing setbacks as drivers of innovation. The 77-year-old creator of the bagless vacuum cleaner, who built a $16.8 billion fortune according to Bloomberg's Billionaire Index, created 5,127 prototypes over five years before successfully launching his signature product in 1993. \"If something works, it's less challenging, it's less interesting,\" Dyson said. \"If something's gone wrong, you want to know why it's gone wrong, and it's a learning process.\" \n\nDyson's company abandoned its electric vehicle project in 2019 despite investing over $600 million, concluding it wasn't commercially viable. The prototype now sits prominently at the company's Singapore headquarters. \"I had to be pragmatic about it and say it's too risky for us to do, which is a shame because I loved doing it,\" Dyson said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://",
        "id": 2548261,
        "language": null,
        "link": "https://slashdot.org/story/25/04/28/164253/dyson-founder-says-he-has-lived-a-life-of-failure?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dyson Founder Says He Has Lived a 'Life of Failure'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T16:25:46.215433+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T16:25:45+00:00",
        "description": "IBM announced plans to invest $150 billion in the United States over the next five years, with more than $30 billion earmarked specifically for research and development of mainframes and quantum computing technology. The investment follows similar commitments from tech giants including Apple and Nvidia -- each pledging approximately $500 billion -- in the wake of President Trump's election and tariff threats. \n\n\"We have been focused on American jobs and manufacturing since our founding 114 years ago,\" said IBM CEO Arvind Krishna in a statement. The company currently manufactures its mainframe systems in upstate New York and plans to continue designing and assembling quantum computers domestically. The announcement comes amid challenging circumstances for IBM, which recently saw 15 government contracts shelved under the Trump administration's cost-cutting initiatives. \n\nFurther reading: IBM US Cuts May Run Deeper Than Feared - and the Jobs Are Heading To India;\nIBM Now Has More Employe",
        "id": 2548262,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/28/1523232/ibm-pledges-150-billion-us-investment?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "IBM Pledges $150 Billion US Investment",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T14:57:02.279217+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T14:57:02+00:00",
        "description": "Ruby on Rails creator and Basecamp CTO David Heinemeier Hansson, makes a case for why Google shouldn't be forced to sell Chrome: First, Chrome won the browser war fair and square by building a better surfboard for the internet. This wasn't some opportune acquisition. This was the result of grand investments, great technical prowess, and markets doing what they're supposed to do: rewarding the best. Besides, we have a million alternatives. Firefox still exists, so does Safari, so does the billion Chromium-based browsers like Brave and Edge. And we finally even have new engines on the way with the Ladybird browser. \n\nLook, Google's trillion-dollar business depends on a thriving web that can be searched by Google.com, that can be plastered in AdSense, and that now can feed the wisdom of AI. Thus, Google's incredible work to further the web isn't an act of charity, it's of economic self-interest, and that's why it works. Capitalism doesn't run on benevolence, but incentives. \n\nWe want an ",
        "id": 2547495,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/28/1444215/dont-make-google-sell-chrome?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Don't Make Google Sell Chrome'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T13:16:27.376664+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T13:16:27+00:00",
        "description": "Widespread power outages were reported Monday in parts of Spain, Portugal and France, affecting critical infrastructure like airports and causing transportation disruptions. From a report: \"The interruption was due to a problem in the European electricity grid,\" E-Redes, the national energy supplier of Portugal, said in a statement. In addition to Portugal, it said, \"The blackout also affected regions of Spain and France, due to faults in very high voltage lines.\" \n\nE-Redes said that the outage was widespread across Spain, with outages in Catalonia, Andalusia, Aragon, Navarre, the Basque Country, Castile and Leon, Extremadura and Murcia. In France, the Portuguese energy supplier said, \"the Basque Coast and the Burgundy region also experienced power cuts.\" \n\nSpain's national power company, Red Electricia, said in a post on X that it had restored some power in the north and south of the peninsula. The cause of the outages was not immediately clear. But the effects of the disruption were",
        "id": 2546811,
        "language": null,
        "link": "https://slashdot.org/story/25/04/28/1245258/widespread-power-outage-is-reported-in-spain-france-and-portugal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Widespread Power Outage Is Reported in Spain, France and Portugal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T11:59:41.202306+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T11:59:40+00:00",
        "description": "Sales of electric vehicles in America jumped 10.6% in the first three months of 2025 (compared to the same period in 2024), reports Bloomberg.\n \nAnd research provider BloombergNEF expects all of 2025 will see a 31.5% sales increase from 2024's sales in the U:S. &mdash; slightly above the global increase rate of 30%. (That's 22 million battery-powered vehicles around the world.) \n\n\"EV adoption is cruising along in the U.S.,\" Bloomberg writes, with interest \"spreading from early-adopters to mainstream consumers\" tired of paying for gas and oil changes &mdash; and attracted by new products from familiar brands:\n\n\nOf the 63 or so fully electric cars and trucks on the U.S. market, one quarter weren't available a year ago. The product blitz includes the first EV offerings from Acura, Dodge and Jeep, second models from Mini and Porsche and two more battery-powered machines each from Cadillac and Volvo... \nMany of the new EVs are relatively affordable. Cox Automotive estimates the price sprea",
        "id": 2546220,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/28/0736204/americas-electric-vehicle-sales-have-jumped-106-compared-to-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's Electric Vehicle Sales Have Jumped 10.6% Compared to 2024",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T08:22:51.364369+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T08:22:51+00:00",
        "description": "\"A new study found that a gene recently recognized as a biomarker for Alzheimer's disease is actually a cause of it,\" announced the University of California, San Diego, \"due to its previously unknown secondary function.\" \n\n\"Researchers at the University of California San Diego used artificial intelligence to help both unravel this mystery of Alzheimer's disease and discover a potential treatment that obstructs the gene's moonlighting role.\" \n\nA team led by Sheng Zhong, a professor in the university's bioengineering department, had previously discovered a potential blood biomarker for early detection of Alzheimer's disease (called PHGDH). But now they've discovered a correlation: the more protein and RNA that it produces, the more advanced the disease. And after more research they ended up with \"a therapeutic candidate with demonstrated efficacy that has the potential of being further developed into clinical tests...\"\n\nThat correlation has since been verified in multiple cohorts from d",
        "id": 2544752,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/28/0610254/ai-helps-unravel-a-cause-of-alzheimers-disease-and-identify-a-therapeutic-candidate?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Helps Unravel a Cause of Alzheimer's Disease and Identify a Therapeutic Candidate",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T03:46:36.834470+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T03:46:36+00:00",
        "description": "A new DARPA project called expMath \"aims to jumpstart math innovation with the help of AI,\" writes The Register. America's \"Defense Advanced Research Projects Agency\" believes mathematics isn't advancing fast enough, according to their article...\n\nSo to accelerate &mdash; or \"exponentiate\" &mdash; the rate of mathematical research, DARPA this week held a Proposers Day event to engage with the technical community in the hope that attendees will prepare proposals to submit once the actual Broad Agency Announcement solicitation goes out... \n\n[T]he problem is that AI just isn't very smart. It can do high school-level math but not high-level math. [One slide from DARPA program manager Patrick Shafto noted that OpenAI o1 \"continues to abjectly fail at basic math despite claims of reasoning capabilities.\"] Nonetheless, expMath's goal is to make AI models capable of: \n\n- auto decomposition &mdash; automatically decompose natural language statements into reusable natural language lemmas (a pro",
        "id": 2543633,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/28/0255248/could-a-math-genius-ai-co-author-proofs-within-three-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Could a 'Math Genius' AI Co-author Proofs Within Three Years?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T01:36:33.292584+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T01:36:33+00:00",
        "description": "Remember First Light Fusion? Founded in 2011, it was a pioneering British startup that in 2022 \"successfully combined atomic nuclei, which U.K. regulators called a milestone in the decades-long push for fusion energy. \n\nIt's now \"pulled the plug on plans to build its first reactor,\" reports the Telegraph, abandoning its push for a prototype power plant based on its \"projectile fusion\" technology due to a lack of funding.\nThe technology involves a 5p-sized projectile being fired at a fuel cell at extreme speeds using electromagnets to generate a powerful reaction and simulate collisions at extremely high speeds, such as those in space. Instead of building its own plant, First Light plans to supply other nuclear power companies with one of its inventions, called an \"amplifier\", which houses a nuclear fuel capsule and boosts the power of fusion reactions. \n\nThe group has burned through tens of millions of pounds trying to bring its technology to fruition... The decision to ditch its orig",
        "id": 2543229,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/28/013206/nuclear-fusion-pioneer-abandons-plan-for-prototype-reactor-will-license-reaction-boosting-nuclear-fuel-capsule?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nuclear Fusion Pioneer Abandons Plan for Prototype Reactor, Will License Reaction-Boosting Nuclear Fuel Capsule",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T00:32:23.323577+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T00:32:23+00:00",
        "description": "Its goal was to \"support workers to reclaim the power of future-making\". A 2022 pilot project saw over 25 Amazon workers meeting online \"to discuss how science fiction shed light on their working conditions and futures.\" 13 of them then continued meeting regularly in 2023 with the \"Worker as Futurist\" project (funded by Canada's Social Sciences and Humanities Research Council, according to an article by the project's leaders in the socialist magazine Jacobin). \"Our team of scholars, teachers, writers, and activists has been able to pay Amazon workers (warehouse workers, drivers, copy editors, MTurk workers, and more) to participate in a series of skill-building writing workshops and information sessions....\" \nAnd when it was over, \"the participants were supported to draft the stories they wanted to tell about The World After Amazon....\" \n\nSix months ago they held the big launch event for the book's print edition, while also promising that \"you can read the workers' stories online, or ",
        "id": 2543026,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/27/2336243/to-reclaim-future-making-amazon-workers-published-a-collection-of-science-fiction-stories?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "To 'Reclaim Future-Making', Amazon Workers Published a Collection of Science Fiction Stories",
        "vote": 0
    }
]