[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T15:09:40.523830+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T14:00:34+00:00",
        "description": "The Elder Scrolls 4: Oblivion Remastered has got off to a predictably excellent start where its player numbers are concerned, having seen over 4 million players across all platforms within haff a week of its release, and enjoying a peak of over 216,000 concurrent players on Steam. \n\nBut why exactly is it that the game has attracted players in such numbers, besides just being a major new Elder Scrolls release? From growing hunger for anything Elder Scrolls brought on by the series’ prolonged hiatus, to the impressive and comprehensive upgrades that Virtuos and Bethesda have made to the core experience without changing it too radically, there’s a lot contributing to Oblivion Remastered’s success.",
        "id": 2547985,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Kq4WK95fDCw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Kq4WK95fDCw/hqdefault.jpg",
        "title": "Why Are MILLLIONS of Gamers Addicted To The Elder Scrolls 4: Oblivion Remastered?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-28T11:23:47.570419+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-28T10:01:32+00:00",
        "description": "Sony Bend’s Days Gone is a game that continues to be one of the most divisive ones of the last console generation. While some gamers would swear by it to be one of the best zombie games of recent memory, others would bring up the litany of bugs or poor pacing as the factors that ultimately stopped it from reaching the heights that it could. \n\nSince its release, Days Gone has gone on to gather a sizable fan following and even though a sequel doesn’t seem to be in the cards at this point in time - we do have Days Gone Remastered. Built for the PS5, Days Gone Remastered aims to provide a souped-up version of the original that can actually leverage the capabilities of current-gen hardware and elevate the playing experience to another level.",
        "id": 2545931,
        "language": null,
        "link": "https://www.youtube.com/watch?v=sA9uHXlkeBg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sA9uHXlkeBg/hqdefault.jpg",
        "title": "Days Gone Remastered vs Original Graphics Comparison - WHAT HAS CHANGED?",
        "vote": 0
    }
]