[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T14:59:57+00:00",
        "description": "Friday Bill Gates shared an excerpt from his upcoming memoir Source Code: My Beginnings. Published in the Wall Street Journal, the excerpt includes pictures of young Bill Gates when he was 12 (dressed for a hike) and 14 (studying a teletype machine). \n\nGates remembers forming \"a sort of splinter group\" from the Boy Scouts when he was 13 with a group of boys who \"wanted more freedom and more risk\" and took long hikes around Seattle, travelling hundreds of miles together on hikes as long as \"seven days or more.\" (His favorite breakfast dish was Oscar Mayer Smokie Links.) But he also remembers another group of friends &mdash; Kent, Rick, and... Paul &mdash; who connected to a mainframe computer from a phone line at their private school. Both hiking and programming \"felt like an adventure... exploring new worlds, traveling to places even most adults couldn't reach.\" \n\nLike hiking, programming fit me because it allowed me to define my own measure of success, and it seemed limitless, not d",
        "id": 1981568,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/26/0249204/bill-gates-began-the-altair-basic-code-in-his-head-while-hiking-as-a-teenager?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bill Gates Began the Altair BASIC Code in His Head While Hiking as a Teenager",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T14:59:57+00:00",
        "description": "Two computer scientists at the University of Waterloo in Canada believe changing 30 lines of code in Linux \"could cut energy use at some data centers by up to 30 percent,\" according to the site Data Centre Dynamics. \n\nIt's the code that processes packets of network traffic, and Linux \"is the most widely used OS for data center servers,\" according to the article:\n\nThe team tested their solution's effectiveness and submitted it to Linux for consideration, and the code was published this month as part of Linux's newest kernel, release version 6.13. \"All these big companies &mdash; Amazon, Google, Meta &mdash; use Linux in some capacity, but they're very picky about how they decide to use it,\" said Martin Karsten [professor of Computer Science in the Waterloo's Math Faculty]. \"If they choose to 'switch on' our method in their data centers, it could save gigawatt hours of energy worldwide. Almost every single service request that happens on the Internet could be positively affected by thi",
        "id": 1981570,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/25/2111225/could-new-linux-code-cut-data-center-energy-use-by-30?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Could New Linux Code Cut Data Center Energy Use By 30%?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T14:59:57+00:00",
        "description": "July saw the news that Meta had launched a powerful open-source AI model, Llama 3.1. \n\nBut the Free Software Foundation evaluated Llama 3.1's license agreement, and announced this week that \"this is not a free software license and you should not use it, nor any software released under it.\"\n\n\nNot only does it deny users their freedom, but it also purports to hand over powers to the licensors that should only be exercised through lawmaking by democratically-elected governments. \n\nMoreover, it has been applied by Meta to a machine-learning (ML) application, even though the license completely fails to address software freedom challenges inherent in such applications.... \n\nWe decided to review the Llama license because it is being applied to an ML application and model, while at the same time being presented by Meta as if it grants users a degree of software freedom. This is certainly not the case, and we want the free software community to have clarity on this.\n \n\nIn other news, the FSF ",
        "id": 1981567,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/25/2311217/fsf-metas-license-for-its-llama-31-ai-model-is-not-a-free-software-license?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "FSF:   Meta's License for Its Llama 3.1 AI Model 'is Not a Free Software License'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T14:59:57+00:00",
        "description": "Slashdot reader DevNull127 writes: \"Every US intelligence agency still unanimously maintains that Covid-19 was not developed as a biological weapon,\" CNN reported today. \n\nBut what about the possibility of an accidental leak (rather than Covid-19 originating in wild animal meat from the Wuhan Market)? \"The agency has for years said it did not have enough information to determine which origin theory was more likely.\" \n\nCNN notes there's suddenly been a new announcement \"just days\" after the CIA's new director took the reins &mdash; former lawyer turned Republican House Representative John Ratcliffe. While the market-origin theory remains a possibility according to the CIA, CNN notes that Ratcliffe himself \"has long favored the theory that the pandemic originated from research being done in China and vowed in an interview published in Breitbart on Thursday that he would make the issue a Day 1 priority.\" \n\n\"We have low confidence in this judgement,\" the CIA says in the complete text of ",
        "id": 1981566,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/26/0351245/new-cia-director-touts-low-confidence-assessment-about-covid-lab-leak-theory?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New CIA Director Touts 'Low Confidence' Assessment About Covid Lab Leak Theory",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T14:59:57+00:00",
        "description": "A plan to keep TikTok available in the U.S. \"involves tapping software company Oracle and a group of outside investors,\" reports NPR, \"to effectively take control of the app's global operations, according to two people with direct knowledge of the talks...\" \n\n\"[P]otential investors who are engaged in the talks include Microsoft.\"\n\nUnder the deal now being negotiated by the White House, TikTok's China-based owner ByteDance would retain a minority stake in the company, but the app's algorithm, data collection and software updates will be overseen by Oracle, which already provides the foundation of TikTok's web infrastructure... \"The goal is for Oracle to effectively monitor and provide oversight with what is going on with TikTok,\" said the person directly involved in the talks, who was not authorized to speak publicly about the deliberations. \"ByteDance wouldn't completely go away, but it would minimize Chinese ownership....\" Officials from Oracle and the White House held a meeting on ",
        "id": 1981569,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/26/0037255/oracle-and-us-investors-including-microsoft-discuss-taking-control-of-tiktok-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Oracle and US Investors (Including Microsoft) Discuss Taking Control of TikTok in the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T14:59:57+00:00",
        "description": "Founded in 1947, the Minor Planet Center is the official worldwide authority \"for observing and reporting new asteroids, comets and other small bodies in the solar system,\" reports USA Today. \n\nUnfortunately, \"What an amateur astronomer recently took to be a newly discovered asteroid turned out to be a Tesla Roadster,\"\n\n\nThe Minor Planet Center didn't initially consider the possibility when the organization announced the discovery on Jan. 2 of the unusual asteroid, complete with an official name: 2018 CN41. But less than 17 hours later, the Minor Planet Center issued an editorial notice that it would be deleting 2018 CN41 from its records... According to the Minor Planet Center's notice regarding the deletion, turns out the object was the Roadster, along with the Falcon Heavy rocket's upper stage.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Report+of+Newly-Discovered+Asteroid+Turns+Out+to+Be...+a+Tesla+Roadster",
        "id": 1981571,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/25/2026244/report-of-newly-discovered-asteroid-turns-out-to-be-a-tesla-roadster?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Report of Newly-Discovered Asteroid Turns Out to Be... a Tesla Roadster",
        "vote": 0
    }
]