[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T21:00:30+00:00",
        "description": "The Xbox Developer_Direct returned this year and may have been the strongest showing yet from Microsoft. Though South of Midnight and DOOM: The Dark Ages made strong impressions, Team Ninja and PlatinumGames arguably stole the show by announcing Ninja Gaiden 4.\n\nLaunching this Fall for Xbox Series X/S, PS5, and PC (alongside Game Pass), the sequel debuts a new protagonist, Yakumo, who ventures to Tokyo to take out the Dark Dragon. As part of the Raven clan, he utilizes a different style called Bloodraven Form, creating a massive blade of blood to slice multiple foes apart.\n\nThankfully, Ryu Hayabusa still appears as a playable character while opposing Yakumo for some unknown reason. With gorgeous visuals, high-speed combat, and tense bosses, Ninja Gaiden 4 looks like everything we've wanted in a sequel and then some. Check out ten new things we've learned about it.",
        "id": 1984454,
        "language": null,
        "link": "https://www.youtube.com/watch?v=sxlqarPSlR4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sxlqarPSlR4/hqdefault.jpg",
        "title": "Ninja Gaiden 4 - 10 NEW Details You May Not Know",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T13:45:01+00:00",
        "description": "Sniping has always had a place in first-person shooters, either as standalone missions or proprietary mechanics on top of the running and gunning. Few titles made it their prime focus until Rebellion's Sniper Elite came along.\n\nFactoring in multiple aspects, from ballistics and bullet drop to wind direction and surrounding noise, it emerged as something new and fresh in the realm of shooters. Of course, more than a decade later, it's grown into a franchise with new mainline titles and spin-offs, massive sandbox levels with multiple opportunities, multiplayer modes, and much more.\n\nThe latest title, Sniper Elite: Resistance, arrives on January 30th for Xbox One, Xbox Series X/S, PS4, PS5, and PC. What are some of the best titles to play beforehand? Which ones are more underrated? Join us as we rank all the games and standalone expansions from the series.",
        "id": 1981662,
        "language": null,
        "link": "https://www.youtube.com/watch?v=G6_qDKJQQWw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/G6_qDKJQQWw/hqdefault.jpg",
        "title": "All Sniper Elite Games Ranked From Underrated To Best - Before You Play Sniper Elite Resistance",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-26T10:15:00+00:00",
        "description": "The current state of the early access version of Tokyo Xtreme Racer is largely satisfying. There are a few design issues in terms of map layout, fast travel and locking max currency limit behind multiple skill barriers, but there is a lot to like here. \n\nThe 1v1 racing, the visuals and performance, the simple yet addictive gameplay and its adherence to the series’ roots is what makes Tokyo Xtreme Racer standout from the competition.",
        "id": 1981663,
        "language": null,
        "link": "https://www.youtube.com/watch?v=8MUnOpFDyIc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8MUnOpFDyIc/hqdefault.jpg",
        "title": "Tokyo Xtreme Racer Early Access Review - A Damn Good Start",
        "vote": 0
    }
]