[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T18:30:07+00:00",
        "description": "Kingdom Come Deliverance 2 adds some quality-of-life updates to a series rooted in realism, but it's still a very hands-off kind of game. Even when played on the tutorial-laden Normal mode, plenty of hidden mechanics and secrets abound.\n\nThe subtle photo mode is a perfect example of this. It's an entirely new addition from the previous game, yet is never tutorialized in-game.\n\nPlenty of other helpful tips, especially for those early game difficulties, populate this list. Get a head-start on your journey to Trosky Castle and avoid novice blunders with this handy guide.",
        "id": 2041258,
        "language": null,
        "link": "https://www.youtube.com/watch?v=5GaC-tM8URY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5GaC-tM8URY/hqdefault.jpg",
        "title": "13 Beginners Tips And Tricks Kingdom Come Deliverance 2 DOESN'T TELL YOU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T16:00:42+00:00",
        "description": "Kingdom Come: Deliverance 2 launches on February 4th for Xbox Series X/S, PS5, and PC, and the hype is real. It's understandable if there's skepticism surrounding its performance, especially considering how the first game launched in such a problematic state.\n\nHowever, all the pre-release hype noting the smoothness of the game's performance has turned out to be true. The PC version of the sequel runs pretty well, even with dips in certain scenes and very slightly noticeable pop-in on 4K and Ultra settings. Even more incredible is how the PS5 version fares, both in Performance and Quality mode.\n\nThey both deliver smooth performance without many drops and even though pop-in is definitely noticeable (especially in Performance mode), you could make a case for either. While it's not perfect, Kingdom Come: Deliverance 2 is technically strong on PS5 and PC, with the latter recommended for its fidelity and frame rate.",
        "id": 2040158,
        "language": null,
        "link": "https://www.youtube.com/watch?v=kIY_8EQDoRY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kIY_8EQDoRY/hqdefault.jpg",
        "title": "Kingdom Come Deliverance 2 PS5 vs PC Graphics Comparison - A True Next-Gen Open World Experience?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T06:30:09+00:00",
        "description": "Unsurprisingly, action-adventure games continue to be one of the most popular genres and its popularity doesn’t seem to be dwindling down anytime soon. 2025 and beyond is also similarly packed with great games of this ilk, right from remastered versions of classics like Tomb Raider 4-6 to exciting new IPs and much-anticipated revivals like Ninja Gaiden 4 and Perfect Dark among others. \n\nWith this video, we will be taking a look at 25 of the biggest action-adventure games releasing in 2025 and beyond that you should definitely keep an eye out for in the coming weeks and months.",
        "id": 2036438,
        "language": null,
        "link": "https://www.youtube.com/watch?v=PFZ_9IXi5yM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PFZ_9IXi5yM/hqdefault.jpg",
        "title": "TOP 25 NEW Action-Adventure Games of 2025 And Beyond We Are Excited For",
        "vote": 0
    }
]