[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T23:28:12+00:00",
        "description": "An anonymous reader writes: Low quality books that appear to be AI generated are making their way into public libraries via their digital catalogs, forcing librarians who are already understaffed to either sort through a functionally infinite number of books to determine what is written by humans and what is generated by AI, or to spend taxpayer dollars to provide patrons with information they don't realize is AI-generated.\n \nPublic libraries primarily use two companies to manage and lend ebooks: Hoopla and OverDrive, the latter of which people may know from its borrowing app, Libby. Both companies have a variety of payment options for libraries, but generally libraries get access to the companies' catalog of books and pay for customers to be able to borrow that book, with different books having different licenses and prices. A key difference is that with OverDrive, librarians can pick and choose which books in OverDrive's catalog they want to give their customers the option of borro",
        "id": 2043039,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/04/2119257/ai-generated-slop-is-already-in-your-public-library?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI-Generated Slop Is Already In Your Public Library",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T22:23:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: US Senator Ted Cruz (R-Texas) has been demanding an overhaul of a $42.45 billion broadband deployment program, and now his telecom policy director has been chosen to lead the federal agency in charge of the grant money. \"Congratulations to my Telecom Policy Director, Arielle Roth, for being nominated to lead NTIA,\" Cruz wrote last night, referring to President Trump's pick to lead the National Telecommunications and Information Administration. Roth's nomination is pending Senate approval. Roth works for the Senate Commerce Committee, which is chaired by Cruz. \"Arielle led my legislative and oversight efforts on communications and broadband policy with integrity, creativity, and dedication,\" Cruz wrote.\n \nShortly after Trump's election win, Cruz called for an overhaul of the Broadband Equity, Access, and Deployment (BEAD) program, which was created by Congress in November 2021 and is being implemented by the NTIA. Biden-era leader",
        "id": 2042574,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/04/2059206/42-billion-broadband-grant-program-may-scrap-biden-admins-preference-for-fiber?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "$42 Billion Broadband Grant Program May Scrap Biden Admin's Preference For Fiber",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T22:23:00+00:00",
        "description": "The DeepComputing RISC-V Mainboard that Framework announced last year for its 13-inch laptops is now available for $199. Liliputing reports: If you already have a Framework Laptop 13 with an Intel or AMD motherboard, the new board is a drop-in replacement. But if you don't have a Framework Laptop you can also use the mainboard as a standalone computer: Framework sells a $39 Cooler Master case that effectively turns its mainboards into mini desktop computers. The RISC-V Mainboard comes from a partnership between Framework and DeepComputing, the Chinese company behind the DC-ROMA laptops, which were some of the first notebook computers to ship with RISC-V processors.\n \nThe board features a StarFive JH7110 processor, which is a 1.5 GHz quad-core chip featuring SiFive U74 RISC-V CPU cores and Imagination BXE-4-32 graphics, 8GB of onboard RAM, and a a 64GB SD card for storage (there's also support for an optional eMMC module, but you'll need to bring your own). Since the board is designed",
        "id": 2042573,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/02/04/217248/risc-v-mainboard-for-the-framework-laptop-13-is-now-available?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "RISC-V Mainboard For the Framework Laptop 13 Is Now Available",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T21:18:59+00:00",
        "description": "In his post about the future of Fedora Workstation, Christian F.K. Schaller discusses how the Red Hat team plans to integrate AI with IBM's open-source Granite engine to enhance developer tools, such as IDEs, and create an AI-powered Code Assistant. He says the team is also working on streamlining AI acceleration in Toolbx and ensuring Fedora users have access to tools like RamaLama. From the post: One big item on our list for the year is looking at ways Fedora Workstation can make use of artificial intelligence. Thanks to IBMs Granite effort we know have an AI engine that is available under proper open source licensing terms and which can be extended for many different usecases. Also the IBM Granite team has an aggressive plan for releasing updated versions of Granite, incorporating new features of special interest to developers, like making Granite a great engine to power IDEs and similar tools. We been brainstorming various ideas in the team for how we can make use of AI to provid",
        "id": 2042148,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/02/04/2047240/red-hat-plans-to-add-ai-to-fedora-and-gnome?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Red Hat Plans to Add AI to Fedora and GNOME",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T20:14:01+00:00",
        "description": "Amazon's brick-and-mortar expansion has faltered, WSJ reported Tuesday, as the e-commerce giant plans to close its Amazon Go store in Woodland Hills, California, shrinking the cashierless convenience store chain to 16 locations across four states, down from roughly twice that number in early 2023. \n\nThe company is pivoting to license its \"Just Walk Out\" technology, now used by more than 200 retailers including colleges and airports, while focusing its physical retail strategy on grocery stores through Whole Foods Market and Amazon Fresh locations. Amazon's other physical retail experiments, including bookstores and \"4-star\" locations selling popular website items, have also struggled.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon%2C+King+of+Online+Retail%2C+Can't+Seem+To+Make+Its+Physical+Stores+Work%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F04%2F1830249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwit",
        "id": 2041715,
        "language": null,
        "link": "https://slashdot.org/story/25/02/04/1830249/amazon-king-of-online-retail-cant-seem-to-make-its-physical-stores-work?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon, King of Online Retail, Can't Seem To Make Its Physical Stores Work",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T19:09:16+00:00",
        "description": "Autonomous vehicle company Cruise will lay off about half of its 2,100 employees and remove several top executives, including CEO Marc Whitten, as parent company General Motors shifts away from robotaxi development to focus on personal autonomous vehicles. \n\nThe cuts come two months after GM said it would stop funding Cruise's robotaxi program to save $1 billion annually. Affected workers will receive severance packages including eight weeks of pay and benefits through April. The restructuring follows an October incident where a Cruise vehicle dragged a pedestrian, leading to the suspension of its permits.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Cruise+To+Slash+Workforce+By+Nearly+50%25+After+GM+Cuts+Funding+To+Robotaxi+Operations%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F04%2F1825220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<",
        "id": 2041221,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/04/1825220/cruise-to-slash-workforce-by-nearly-50-after-gm-cuts-funding-to-robotaxi-operations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cruise To Slash Workforce By Nearly 50% After GM Cuts Funding To Robotaxi Operations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T18:03:51+00:00",
        "description": "Americans quit 39.6 million jobs in 2024, an 11% drop from 2023 and 22% below the 2022 peak, Labor Department data showed Tuesday, signaling an end to the post-pandemic job-switching frenzy. The monthly quit rate fell below pre-pandemic levels as workers faced diminishing options in a cooling labor market. Available positions per unemployed worker dropped to 1.1 from 2 in March 2022, while hiring declined to a monthly average of 3.5% in 2024 from 4.4% in 2021. \n\nTotal hiring fell to 66 million in 2024 from 71 million in 2023, though the job market remained stable. The unemployment rate held at 4.1%, with economists expecting steady job growth in Friday's upcoming labor report. The Conference Board's latest survey showed fewer respondents viewing jobs as plentiful compared to the early 2020s, with more reporting difficulties finding work.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Americans+Kiss+Job+Hopping+Good",
        "id": 2040665,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/04/1720223/americans-kiss-job-hopping-goodbye?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Americans Kiss Job Hopping Goodbye",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T18:03:51+00:00",
        "description": "Panasonic will cut its costs, restructure underperforming units and revamp its workforce as it pivots toward AI data centers and away from its consumer electronics roots, the company said on Tuesday. The Japanese conglomerate aims to boost profits by 300 billion yen ($1.93 billion) by March 2029, partly by consolidating production and logistics operations. \n\nBloomberg reports that CEO Yuki Kusumi has declined to confirm if the company would divest its TV business but said alternatives were being considered. The Tesla battery supplier plans to integrate AI across operations through a partnership with Anthropic, targeting growth in components for data centers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Panasonic+To+Cut+Costs+To+Support+Shift+Into+AI%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F04%2F1738246%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.pn",
        "id": 2040664,
        "language": null,
        "link": "https://slashdot.org/story/25/02/04/1738246/panasonic-to-cut-costs-to-support-shift-into-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Panasonic To Cut Costs To Support Shift Into AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T16:59:17+00:00",
        "description": "The proportion of people being diagnosed with lung cancer who have never smoked is increasing, with air pollution an \"important factor,\" the World Health Organization's cancer agency has said. From a report: Lung cancer in people who have never smoked cigarettes or tobacco is now estimated to be the fifth highest cause of cancer deaths worldwide, according to the International Agency for Research on Cancer (IARC). Lung cancer in never-smokers is also occurring almost exclusively as adenocarcinoma, which has become the most dominant of the four main subtypes of the disease in both men and women globally, the IARC said. \n\nAbout 200,000 cases of adenocarcinoma were associated with exposure to air pollution in 2022, according to the IARC study published in the Lancet Respiratory Medicine journal. The largest burden of adenocarcinoma attributable to air pollution was found in east Asia, particularly China, the study found.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a cla",
        "id": 2040118,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/04/1453255/lung-cancer-diagnoses-on-the-rise-among-never-smokers-worldwide?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lung Cancer Diagnoses On the Rise Among Never-Smokers Worldwide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T16:59:17+00:00",
        "description": "Microsoft has intensified efforts to block unsupported Windows 11 installations, removing documentation about bypassing system requirements and flagging third-party workaround tools as potential malware. The move comes as Windows 10 approaches end of support in October 2025, when users must either continue without updates, upgrade to Windows 11, or purchase new hardware compatible with Windows 11's TPM 2.0 requirement. \n\nMicrosoft Defender now identifies Flyby11, a popular tool for installing Windows 11 on incompatible devices, as \"PUA:Win32/Patcher.\" Users are also reporting that unsupported Windows 11 installations are already facing restrictions, with some machines unable to receive major updates. Microsoft has also removed text from its \"Ways to install Windows 11\" page that had provided instructions for bypassing TPM 2.0 requirements through registry key modifications. The removed section included technical details for users who acknowledged and accepted the risks of installing ",
        "id": 2040117,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/04/161234/microsoft-quietly-makes-it-harder-to-install-windows-11-on-old-pcs-ahead-of-windows-10s-end-of-support?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Quietly Makes It Harder To Install Windows 11 on Old PCs Ahead of Windows 10's End of Support",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T15:55:44+00:00",
        "description": "Chris Anderson, who transformed TED from a small conference into a global platform for sharing ideas, announced today he's stepping down after 25 years at the helm. The nonprofit's leader is seeking new ownership through an unusual open call for proposals. Anderson told WIRED he wants potential buyers -- whether universities, philanthropic organizations, media companies or tech firms -- to demonstrate both vision and financial capacity. \n\nThe organization, which charges $12,500 for its flagship conference seats, maintains $25 million in cash reserves and reports a $100 million break-even balance sheet. The future owner must commit to keeping the conference running and maintaining TED's practice of sharing talks for free.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Chris+Anderson+Is+Giving+TED+Away+To+Whoever+Has+the+Best+Idea+for+Its+Future%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F02%2F04%2F1446222%2F%3",
        "id": 2039491,
        "language": null,
        "link": "https://news.slashdot.org/story/25/02/04/1446222/chris-anderson-is-giving-ted-away-to-whoever-has-the-best-idea-for-its-future?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chris Anderson Is Giving TED Away To Whoever Has the Best Idea for Its Future",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T14:50:53+00:00",
        "description": "China said Tuesday it has launched an antitrust investigation into Google, part of a swift retaliation after the U.S. President Donald Trump imposed a 10% tariff on Chinese goods. From a report: The probe by China's State Administration for Market Regulation will examine alleged monopolistic practices by the U.S. tech giant, which has had its search and internet services blocked in China since 2010 but maintains operations there primarily focused on advertising.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Launches+Antitrust+Investigation+Into+Google%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F04%2F1250212%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F02%2F04%2F1250212%2Fchina-launches-antitrust-investigation-into-google%3Fu",
        "id": 2038944,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/02/04/1250212/china-launches-antitrust-investigation-into-google?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Launches Antitrust Investigation Into Google",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T14:50:53+00:00",
        "description": "New submitter mastazi writes: In his latest post, veteran Microsoft developer Raymond Chen reflects on what it means living in a world where you might need to reboot your toothbrush, or perform a firmware update to your shoes!<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Veteran+Ponders+World+Where+Toothbrushes+Need+Reboots%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F02%2F04%2F133247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F02%2F04%2F133247%2Fmicrosoft-veteran-ponders-world-where-toothbrushes-need-reboots%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/25/02/04/133247/microsoft-veteran-ponders-world-where-too",
        "id": 2038943,
        "language": null,
        "link": "https://it.slashdot.org/story/25/02/04/133247/microsoft-veteran-ponders-world-where-toothbrushes-need-reboots?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Veteran Ponders World Where Toothbrushes Need Reboots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T13:45:48+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: In what is becoming a sadly regular occurrence, two popular free software projects, X.org/Freedesktop.org and Alpine Linux, need to rally some of their millions of users so that they can continue operating. Both services have largely depended on free server resources provided by Equinix (formerly Packet.net) and its Metal division for the past few years. Equinix announced recently that it was sunsetting its bare-metal sales and services, or renting out physically distinct single computers rather than virtualized and shared hardware. As reported by the Phoronix blog, both free software organizations have until the end of April to find and fund new hosting, with some fairly demanding bandwidth and development needs.\n \nAn issue ticket on Freedesktop.org's GitLab repository provides the story and the nitty-gritty needs of that project. Both the X.org foundation (home of the 40-year-old window system) and Freedesktop.org (a shared bas",
        "id": 2038444,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/02/04/0044210/popular-linux-orgs-freedesktop-alpine-linux-are-scrambling-for-new-web-hosting?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Popular Linux Orgs Freedesktop, Alpine Linux Are Scrambling For New Web Hosting",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T09:25:36+00:00",
        "description": "AI systems that pose \"unacceptable risk\" or harm can now be banned in the European Union. Some of the unacceptable AI activities include social scoring, deceptive manipulation, exploiting personal vulnerabilities, predictive policing based on appearance, biometric-based profiling, real-time biometric surveillance, emotion inference in workplaces or schools, and unauthorized facial recognition database expansion. TechCrunch reports: Under the bloc's approach, there are four broad risk levels: (1) Minimal risk (e.g., email spam filters) will face no regulatory oversight; (2) limited risk, which includes customer service chatbots, will have a light-touch regulatory oversight; (3) high risk -- AI for healthcare recommendations is one example -- will face heavy regulatory oversight; and (4) unacceptable risk applications -- the focus of this month's compliance requirements -- will be prohibited entirely.\n \nCompanies that are found to be using any of the above AI applications in the EU wil",
        "id": 2036919,
        "language": null,
        "link": "https://slashdot.org/story/25/02/04/0124248/ai-systems-with-unacceptable-risk-are-now-banned-in-the-eu?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Systems With 'Unacceptable Risk' Are Now Banned In the EU",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T05:05:27+00:00",
        "description": "Salesforce is cutting jobs as its latest fiscal year gets underway, Bloomberg reported Monday, citing a person familiar with the matter, even as the company simultaneously hires workers to sell new artificial intelligence products. From the report: More than 1,000 roles will be affected, according to the person, who asked not to be identified because the information is private. Displaced workers will be able to apply for other jobs internally, the person added. Salesforce had nearly 73,000 workers as of January 2024, when that fiscal year ended.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Salesforce+Cutting+1%2C000+Roles+While+Hiring+Salespeople+for+AI%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F02%2F04%2F041235%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2",
        "id": 2035944,
        "language": null,
        "link": "https://slashdot.org/story/25/02/04/041235/salesforce-cutting-1000-roles-while-hiring-salespeople-for-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Salesforce Cutting 1,000 Roles While Hiring Salespeople for AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T04:00:43+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: Advanced artificial intelligence is to revolutionize fundamental physics and could open a window on to the fate of the universe, according to Cern's next director general. Prof Mark Thomson, the British physicist who will assume leadership of Cern on 1 January 2026, says machine learning is paving the way for advances in particle physics that promise to be comparable to the AI-powered prediction of protein structures that earned Google DeepMind scientists a Nobel prize in October. At the Large Hadron Collider (LHC), he said, similar strategies are being used to detect incredibly rare events that hold the key to how particles came to acquire mass in the first moments after the big bang and whether our universe could be teetering on the brink of a catastrophic collapse.\n \n\"These are not incremental improvements,\" Thomson said. \"These are very, very, very big improvements people are making by adopting really advanced techniques.\" \"I",
        "id": 2035722,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/04/0015227/cerns-mark-thomson-ai-to-revolutionize-fundamental-physics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CERN's Mark Thomson: AI To Revolutionize Fundamental Physics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T01:50:41+00:00",
        "description": "A study found that bonobos can recognize when someone lacks knowledge they possess and take action to help, demonstrating a basic form of theory of mind. This suggests that the ability to understand others' perspectives is evolutionarily older than previously thought and may have existed in our common ancestors to enhance cooperation and coordination. New Scientist reports: [W]e have been missing clear evidence from controlled settings that primates can track a perspective that differs from their own and then act upon it, says Luke Townrow at Johns Hopkins University in Maryland. To investigate this, Townrow and Christopher Krupenye, also at Johns Hopkins University, tested if three male bonobos at the Ape Initiative research centre in Iowa could identify ignorance in someone they were trying to cooperate with, and then gesture to them to help solve the task. On a table between the bonobo and an experimenter were three upturned plastic cups. A second researcher placed a barrier betwe",
        "id": 2035261,
        "language": null,
        "link": "https://science.slashdot.org/story/25/02/04/002204/bonobos-can-tell-when-they-know-something-you-dont?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bonobos Can Tell When They Know Something You Don't",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T01:50:41+00:00",
        "description": "Senator Josh Hawley has introduced a bill that would criminalize the import, export, and collaboration on AI technology with China. What this means is that \"someone who knowingly downloads a Chinese developed AI model like the now immensely popular DeepSeek could face up to 20 years in jail, a million dollar fine, or both, should such a law pass,\" reports 404 Media. From the report: Hawley introduced the legislation, titled the Decoupling America's Artificial Intelligence Capabilities from China Act, on Wednesday of last year. \"Every dollar and gig of data that flows into Chinese AI are dollars and data that will ultimately be used against the United States,\" Senator Hawley said in a statement. \"America cannot afford to empower our greatest adversary at the expense of our own strength. Ensuring American economic superiority means cutting China off from American ingenuity and halting the subsidization of CCP innovation.\"\n \nHawley's statement explicitly says that he introduced the legi",
        "id": 2035262,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/04/0037221/senator-hawley-proposes-jail-time-for-people-who-download-deepseek?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Senator Hawley Proposes Jail Time For People Who Download DeepSeek",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-02-04T00:41:02+00:00",
        "description": "The Department of Homeland Security's Inspector General has launched an audit of the TSA's use of facial recognition technology at U.S. airports following concerns from lawmakers and privacy advocates. The Register reports: Homeland Security Inspector General Joseph Cuffari notified a bipartisan group of US Senators who had asked for such an investigation last year that his office has announced an audit of TSA facial recognition technology in a letter [PDF] sent to the group Friday. \"We have reviewed the concerns raised in your letter as part of our work planning process,\" said Cuffari, a Trump appointee who survived the recent purge of several Inspectors General. \"[The audit] will determine the extent to which TSA's facial recognition and identification technologies enhance security screening to identify persons of interest and authenticate flight traveler information while protecting passenger privacy,\" Cuffari said.\n \nThe letter from the Homeland Security OIG was addressed to Sena",
        "id": 2034957,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/02/03/2353253/tsas-airport-facial-recognition-tech-faces-audit-probe?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "TSA's Airport Facial-Recognition Tech Faces Audit Probe",
        "vote": 0
    }
]