[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T18:45:50.707516+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T18:00:06+00:00",
        "description": "Exceptional leaders don’t fail because they lack talent: They fail because their greatest strengths often become their blind spots. \n\nTo reach their full potential, leaders must learn when and how to adapt. Jon Cobb is a Marine Corps combat veteran and the Founder & CEO of Dynamic Leadership University. He is a former Fellow at Harvard Center for Public Leadership, and a graduate of the Harvard Kennedy School and the Vanderbilt Owen Graduate School of Management. \n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4131347,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2EA7VXH-8fA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2EA7VXH-8fA/hqdefault.jpg",
        "title": "4 types of leaders—and why great ones master them all | Jon Cobb | TEDxHarvard Square",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:33.272880+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:12:05+00:00",
        "description": "After losing her home in the Eaton Fire, Katie Clark realized that rebuilding isn’t just about structures—it’s about systems. In this urgent and visionary talk, she applies the principles of universal design to disaster recovery, asking: what if recovery worked for everyone, not just the most resourced? From tenants to longtime homeowners, Katie outlines a model where equity, dignity, and accessibility guide how communities truly rebuild—together. Dr. Katie Clark is a longtime Altadena renter, organizer, and local elected official. She has served as an elected Trustee of the Altadena Library District since 2018, and is one of the founders of the Altadena Tenants Union, created to ensure that renters had a voice in the aftermath of the Eaton Fire. She is a steering committee member for the Altadena Earthseed Community Land Trust, working towards community ownership and permanently affordable housing in Altadena. An Oxford-trained historian, she is also the founder and principal of The ",
        "id": 4130863,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1SXvHbBEg8s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1SXvHbBEg8s/hqdefault.jpg",
        "title": "Universal Design as Disaster Recovery: Systems That Bring Everyone Home | Katie Clark | TEDxAltadena",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:33.651386+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:12:02+00:00",
        "description": "When professional dog trainer Nicole Ellis lost her Altadena home in the Eaton Fire, she found that the lessons she’d spent years teaching others—patience, consistency, and compassion—were the same ones she needed to rebuild her life. In this heartfelt and often humorous talk, Nicole shares how dogs model resilience better than humans ever could, reminding us that progress is built one small reward—and one wagging tail—at a time. Nicole Ellis, CPDT-KA, KPA-CTP, FFCP-T, is a celebrity dog trainer, author, and pet lifestyle expert behind the brand @TailsWithNicole. Seen on Amazon’s The Pack, she’s trained everything from bears to rescue dogs and helps people—from Hollywood stars to everyday pet parents—do more with their dogs through positive reinforcement. Her dogs, Maggie and Rossi, work in film, therapy, and public demos—showcasing the fun and \n\npossibilities of life with a dog. After she and her husband lost their home in the Eaton Canyon fire, they launched @TailsOfRebuilding to sh",
        "id": 4130864,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZkMR7BQnwK4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZkMR7BQnwK4/hqdefault.jpg",
        "title": "What Dog Training Taught Me About Rebuilding a Life | Nicole Ellis | TEDxAltadena",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:33.926972+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:10:15+00:00",
        "description": "A small grocery store owner in Utah is redefining our relationship with plastic waste by giving everyday containers—ketchup bottles, jam jars, and more—multiple lives through a simple refill system. Discover why reuse may be one of our most underestimated climate solutions, and how small, practical shifts in our daily habits can spark collective environmental change, one refill at a time. Growing up in the mountains of Utah, Jamaica Trinnaman experienced a childhood immersed in nature and adventure, fostering a deep respect for the earth. As one of eight children, she also learned the value of home-cooked meals and minimizing waste. This foundation stood in stark contrast to the waste Jamaica witnessed during her career in the natural grocery industry, inspiring her to open what is currently Utah’s only refill grocery store, in 2018. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/t",
        "id": 4130865,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=gxKhAoZ4z-I",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gxKhAoZ4z-I/hqdefault.jpg",
        "title": "Inspiring reuse practices for collective climate impact | Jamaica Trinnaman | TEDxSaltLakeCity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:34.162906+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:04:36+00:00",
        "description": "We are entering the most significant transformation of labor since the Industrial Revolution — a world where robots don’t just follow instructions, but learn human dexterity. In this talk, Edmond Douglass shares why touch, skill, and the ancient intelligence of the human hand are the true bottlenecks holding robotics back — and how new technologies, like multi-sensor smart gloves, are transferring that embodied knowledge from humans to machines.\n\nHe explores the math behind America’s looming labor shortfall, the societal consequences of large-scale automation, and why robotics will become the largest industry of the 21st century. Drawing on history, economics, and emerging AI-robotics capabilities, he challenges us to build boldly but govern wisely, proposing new frameworks — including a “robot tax” — to ensure automation lifts communities rather than hollowing them out.\n\nThis is a talk about inevitability, responsibility, and the chance to build a new kind of civilization — one shape",
        "id": 4130866,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fpJrrSH167U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fpJrrSH167U/hqdefault.jpg",
        "title": "Robots Are Coming for Your Future — Outlive Them | Edmond Douglass | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:34.440955+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:04:02+00:00",
        "description": "What if your hangover isn’t just a punishment—but a preview of aging?\n\nIn this unforgettable talk, pharmacist and inflammation researcher Jackie Iversen RPh MS reveals the science connecting hangovers and longevity. With humor and clarity, she walks us through 5,000 years of failed cures—only to show that the hangover may be one of the most powerful biological models we have for understanding aging.\n\nHangovers compress decades of low-grade chronic inflammation into 12 intense hours—triggering the same immune pathways linked to arthritis, heart disease, dementia, and more. Jackie shares breakthrough research showing how inflammation—not dehydration—is the true culprit behind hangover symptoms, and how this inflammatory response may hold the key to preventing age-related decline.\n\nWhether you’re a biohacker chasing healthspan or someone who’s just Googled “hangover cure,” this talk will change how you see pain, recovery, and the future of medicine.\n\nBecause solving the hangover might ju",
        "id": 4130867,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=SNjf10LVmDA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SNjf10LVmDA/hqdefault.jpg",
        "title": "The science of hangovers | Jackie Iversen | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:34.731566+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:03:59+00:00",
        "description": "The Most Important Number in Longevity: Why we need a Consumer Reports for how we measure biological age.\n\nVarious tests claim to tell you your biological age, but can you trust what they tell you? No one so far has done an experiment to see which tests respond correctly to therapies that extend healthy life. If we want to go from longevitainment to something that can guide our decisions, we need a neutral third party testing the tests and telling us which ones are worth your attention, a Consumer Reports for measuring biological age. This is something we can do today, for less than Bryan Johnson spends on his health in one year. Martin Borch Jensen has been advancing longevity for two decades. He is the cofounder and CSO of Gordian Biotechnology, the first company to discover novel targets for complex disease through pooled in vivo therapeutic screening. Martin led the development of the technology to interrogate disease states inside living organisms, and guides therapeutic developm",
        "id": 4130868,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=z1RaVD59gug",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z1RaVD59gug/hqdefault.jpg",
        "title": "The most important number in longevity | Martin Borch Jensen | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:35.023094+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:03:27+00:00",
        "description": "A physiological and psychological approach to the woman's brain in mid life and how the decline of estrogen contributes to changes that impact resilience, which as the capacity to successfully adapt in the face of adversity or risk, should be valued and validated.  Dr. Shepherd introduces how estrogen is an immune neurological factor for the changes seen in emotion. The discussion also looks at the tenets of optimism, emotional stability, emotion regulation, self-compassion, and self-trust, women need tools and support in resilience for their psychological well-being and health during perimenopause and menopause.  Dr. Jessica Shepherd, MD, MBA, FACOG, is shaping the future of women’s health. A board-certified OB/GYN and Chief Medical Officer of Hers, she’s leading the charge in making expert-driven, accessible care the new norm. As the author of Generation M, she’s challenging outdated menopause narratives and giving women the tools they need to thrive.\nWith expertise spanning hormona",
        "id": 4130869,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=6cZk5swWnvQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6cZk5swWnvQ/hqdefault.jpg",
        "title": "Menopause and the Mind: A New Science of Emotional Resilience | Dr Jessica Shepherd | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:35.301704+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:03:14+00:00",
        "description": "What if we could regrow the human brain? In this visionary TEDx talk, neuroscientist Dr. Annie Kathuria explores the next frontier in regenerative medicine -the emerging science of brain organoids designed for transplantation. While current treatments can’t yet reverse brain damage, Dr. Kathuria outlines a research roadmap showing how this could become possible within our lifetime: developing living, modular brain tissue grown from stem cells that might one day be surgically implanted to restore lost function. Drawing on experimental data and cross-disciplinary advances, she describes how multi-region brain organoids (MRBOs) with replaceable, region-specific modules could progress from concept to clinic, leveraging GMP-grade stem-cell protocols already proven safe in other FDA-authorized studies. Dr. Kathuria explains why this vision is no longer science fiction, but a plausible next step for neuroscience. Advances in vascularization, immune compatibility, and neural integration are s",
        "id": 4130870,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=7cm50VEesrk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7cm50VEesrk/hqdefault.jpg",
        "title": "A new era in neuroregeneration | Annie Kathuria | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:35.482904+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:03:01+00:00",
        "description": "What if an overlooked longevity breakthrough isn’t in a lab, but in how we deliver care? Physician Jay Luthar reveals how reimagining primary care as the vehicle for prevention, technology, and human connection can turn cutting-edge science into longer, healthier lives. This talk gets to the heart of the human experience in medicine, and shows how the future of longevity begins with care itself. Dr. Jay Luthar is a triple board–certified physician in Internal Medicine, Lifestyle Medicine, and Integrative Medicine. He is the founder of Lutanen Health, an innovative Boston-based medical practice dedicated to infusing longevity science into primary care, redefining what is possible through the integration of science, compassion, and whole-person healing. At Harvard Medical School, Dr. Luthar teaches first-year medical students in the Physical Diagnosis and Reasoning course, passionate above reviving the lost art of the physical exam. He also mentors and teaches fellows in the Osher Colla",
        "id": 4130871,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZDwKZCMJU8U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZDwKZCMJU8U/hqdefault.jpg",
        "title": "The Longevity Breakthrough Hiding in Plain Sight | Jay Luthar | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:35.708878+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:02:37+00:00",
        "description": "Most people trying to extend their healthspans are missing a fundamental truth: aging doesn’t happen in isolation from infection. From before birth through everyday exposures, we accumulate viral, bacterial, and parasitic pathogens that can persist in our tissues and nerves for decades, quietly manipulating the systems that sustain us. These microbes are not harmless stowaways—they’re expert hackers of human biology. Persistent pathogens like herpesviruses and Toxoplasma gondii hijack our mitochondria—the cell’s energy factories—and reprogram metabolic and genetic signaling to serve their own survival. They can accelerate telomere shortening and directly interfere with longevity-related genes, driving nearly every hallmark of aging.  If we want to extend human healthspan, we have to confront this hidden enemy. The solution is clear but radical: we must integrate infection biology into the science of aging. That means developing next-generation diagnostics to detect pathogen persistenc",
        "id": 4130872,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XMcVUrErzeU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XMcVUrErzeU/hqdefault.jpg",
        "title": "How persistent pathogens could accelerate the aging process | Amy Proal | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:35.989517+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T17:02:28+00:00",
        "description": "We wear devices for sleep and heart rate, but ignore the most honest signals we make every day. Scott Hickle explains how culture, plumbing, and embarrassment muted stool and urine as health clues—and why bringing them back could improve daily life for millions and catch problems earlier.\n\nWhat you’ll learn\n• Why tyrants guarded their poop and doctors still ask for photos\n• How bathroom biosignals shape daily life\n• Why colon cancer can be stopped its tracks\n\nShare this talk with a friend who “doesn’t want to talk about it.” That’s exactly why we should. Scott Hickle is an engineer and entrepreneur dedicated to transforming how we understand our health. He is the founder and CEO of Throne Science, a company building AI-powered toilet sensors that translate everyday waste into actionable insights about gut health, hydration, and urinary function. Scott’s work sits at the intersection of health, technology, and design, with a mission to improve health and save lives with every flush. Be",
        "id": 4130873,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=v42gznW6cuA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/v42gznW6cuA/hqdefault.jpg",
        "title": "The History and Power of Poop | Scott Hickle | TEDxBoston",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:36.299460+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:56:46+00:00",
        "description": "In this TEDx Talk, Fitz explores “Unfollow Psychology” through three powerful acts of inner rebellion: Unfollow the Mirror. Unfollow the Past. Unfollow the Crowd.\nIn a world obsessed with comparison, approval, and curated perfection, Fitz challenges us to question the invisible algorithms shaping our identity. This talk unpacks how we unconsciously mirror what we see, carry what no longer serves us, and conform to the noise around us — often at the cost of our truth.\nThrough compelling storytelling and  insight, Fitz invites us to unfollow the habits, narratives, and illusions that distort self-perception and tether us to outdated versions of ourselves. This is not about deleting social media — it is about uninstalling the internal programming that tells you who you are supposed to be.\nIf you have ever felt trapped by comparison, haunted by your past, or pressured to fit into spaces that mute your voice, this talk offers a powerful framework to reclaim your original self.\nBecause the ",
        "id": 4130874,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=OC1GMSHCtqA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OC1GMSHCtqA/hqdefault.jpg",
        "title": "Unfollow Me: Why the Cure for Anxiety Isn't More Approval  | Fitzgerald Light | TEDxMallard Creek",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:36.542910+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:56:33+00:00",
        "description": "Les Jeux de Paris ont révélé quelque chose de précieux : une fierté collective, un sentiment d’unité, une dynamique partagée qui a transcendé les clivages. Dans ce talk inspirant, Patrick Mathieu revient sur cette parenthèse d’harmonie pour nous inviter à en tirer une leçon durable. Et si cet esprit, loin de se limiter à l’événement sportif, pouvait irriguer nos vies quotidiennes, nos organisations, nos projets ? Un appel vibrant à faire vivre cette énergie dans tous les espaces où l’humain se rassemble et avance ensemble. Chercheur et entrepreneur, Patrick Mathieu a développé la Théorie de la Singularité, une approche innovante pour transformer les organisations. À la tête de Patrick Mathieu Singularité (PMS), il accompagne les entreprises à révéler leur ADN unique en alliant intelligence collective et IA. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4130875,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zdgBHKKgmyM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zdgBHKKgmyM/hqdefault.jpg",
        "title": "Comment retrouver l’esprit français des Jeux Olympiques ? | Patrick Mathieu | TEDxTélécom SudParis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:36.845258+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:55:33+00:00",
        "description": "“The art of storytelling through change explores how powerful narratives can guide us through uncertainty, inspire transformation, and help us make sense of the world as it shifts around us. It’s about turning experiences—both disruptive and uplifting—into stories that move people, spark reflection, and ignite action.” Ruchi Gour Mehta is a seasoned finance leader and CFO with extensive experience across top national and multinational companies including ITC Ltd, Asian Paints, Cloudtail (Amazon Group), Myntra, Swiggy, and Dream Sports. With expertise in finance, audits, investments, and business strategy, she exemplifies ethical leadership and a strong analytical approach in driving organizational growth. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4130876,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EBP8e_trMVU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EBP8e_trMVU/hqdefault.jpg",
        "title": "The Art Of Story Telling Through Change | Ruchi Gour Mehta | TEDxAmity University Chhattisgarh",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T17:42:37.059427+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:55:20+00:00",
        "description": "What if cities could move beyond macroeconomic planning to microeconomic development and prosperity? In this thought-provoking TEDx conversation, Shri Shankar Lalwani invites us to rethink how urban India defines growth — from focusing on roads and infrastructure to building thriving local economies that uplift every citizen.\nThrough his vision to double Indore’s GDP by 2030, Shri Lalwani introduces the SET Model — Social Empowerment, Economic Development, and Transport & Connectivity — a replicable blueprint for cities to accelerate progress, strengthen industries, and inspire citizen participation. His message reframes development as more than numbers; it’s about improving the quality of life for every resident.\n Shri Shankar Lalwani, Member of Parliament from Indore, has been at the forefront of transforming the city’s growth story. From leading initiatives in infrastructure and connectivity to driving holistic urban reforms, he continues to champion the idea that when citizens and",
        "id": 4130877,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=_rmAptpt3OI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/_rmAptpt3OI/hqdefault.jpg",
        "title": "Why Cities Need to Start Rethinking their Economic Planning | Shri Shankar Lalwani | TEDxPalasia",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:39.373356+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:37:56+00:00",
        "description": "Medicine wasn’t designed for women and it’s costing lives. Physician and author Dr. Jyoti Patel exposes how gender bias distorts research and treatment, and shares a vision for healthcare that finally serves women’s bodies, minds, and voices.\n Dr. Jyoti Patel is a triple-board-certified physician in Internal Medicine, Pediatrics, and Integrative Medicine who is shattering medicine's most dangerous myth: that diseases affect men and women equally. Her work proves women's bodies are not just \"\"smaller versions of men's\"\" - they require fundamentally different medical consideration.\n\nThrough her book Beyond Bikini Medicine and powerful speaking engagements, she provides women with the precise language to use with doctors, the most revealing tests to request, and the confidence to insist their symptoms matter. Her message resonates because it combines shocking data with actionable strategies that transform patient-doctor conversations.\n\nBoard-certified in both conventional and integrative",
        "id": 4130193,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=z8SXmSi0eGI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/z8SXmSi0eGI/hqdefault.jpg",
        "title": "How medicine is failing women and what you can do to fix it | Dr. Jyoti Patel | TEDxWilsonPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:39.717321+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:37:30+00:00",
        "description": "What if your greatest power lies in your thumbs, toes, and tongue? Kenneth Basham shares a practical, body-based approach to overcoming presenteeism. Helping you move from passive presence to purposeful engagement in every part of your life. Kenneth Allen Basham III is an Integrative Wellness Strategist and the originator of The Eight Layers to Welcoming Wellness framework. His work illuminates the pervasive impact of presenteeism, defined as the condition of being physically present while emotionally, socially, or civically disengaged, and explores how it quietly erodes the quality of our personal lives, our workplaces, and our communities.\n\nIn this TEDx Talk, Kenneth introduces a striking, body-based blueprint: Control your thumbs. Control your toes. Control your tongue. This memorable triad offers audiences a tangible and restorative practice to counter emotional withdrawal, digital overwhelm, and civic disconnection, ultimately calling individuals worldwide to reclaim their presen",
        "id": 4130194,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=P5PSJ2GQdxk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/P5PSJ2GQdxk/hqdefault.jpg",
        "title": "Being fully present in a distracted world | Kenneth Allen Basham III | TEDxWilsonPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:39.905131+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:35:37+00:00",
        "description": "In rural Alabama, Meggin Tallman built a pediatric obesity clinic from the ground up. She shows how compassion, individualized care, and practical systems can empower families to break generational cycles of poor health and create lifelong wellness. Meggin Tallman is a dedicated Family Nurse Practitioner with a deep commitment to tackling pediatric obesity in rural Alabama. Drawing from her early career as a nurse volunteering in developing countries, Meggin has always been driven by a mission to serve vulnerable populations and address healthcare disparities.\n\nAfter a few years of noticing great need for care and inspired by the American Academy of Pediatrics’ first-ever Pediatric Obesity Practice Guidelines released in 2023, Meggin established a pediatric obesity clinic within the small pediatrician’s office where she practices. Her clinic is one of only two in the state of Alabama focused on applying these guidelines to support children struggling with obesity and its related comor",
        "id": 4130195,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PuQNYczUTF0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PuQNYczUTF0/hqdefault.jpg",
        "title": "The power of compassionate care in childhood obesity | Meggin Tallman | TEDxWilsonPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:40.142493+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:35:29+00:00",
        "description": "Architecture isn’t just about buildings, it’s about belonging. Architect Barron Peper explores how design shapes our relationships, our well-being, and our communities, proving that the way we build determines how we live and connect. Barron Peper is a licensed architect, speaker, and community-builder based in Missoula, Montana. His practice, Architecture of Belonging, helps people design homes and neighborhoods that reflect their values, support meaningful relationships, and foster a deep sense of place.\n\nWith over a decade of experience in residential and community-focused design, Barron’s work bridges architecture with culture change. He believes that buildings do more than just shelter us—they shape our habits, our relationships, and the ways we move through the world. His design process begins with personal values and long-term vision, aligning clients’ physical environments with the lives they actually want to live.\n\nA graduate of the University of Texas at Austin, Barron went ",
        "id": 4130196,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=xAQFLEUiLcM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xAQFLEUiLcM/hqdefault.jpg",
        "title": "Designing spaces that bring people together | Barron Peper | TEDxWilsonPark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:40.515142+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:34:56+00:00",
        "description": "Uma reflexão profunda de Carlos Ferreirinha sobre como o luxo contemporâneo deixou de ser objeto e passou a ser experiência, significado e sensibilidade. Um dos destaques desta edição será o gestor e consultor de negócios de luxo, Carlos Ferreirinha, fundador da MCF Consultoria e Abrael (Associação das Marcas e Empresas de Luxo). Ferreirinha é referência no mercado de luxo brasileiro. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4130197,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zkQRG9yndAw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zkQRG9yndAw/hqdefault.jpg",
        "title": "O que vem depois de uma experiência? | Carlos Ferreirinha | TEDxSãoJoséDosCampos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:40.854576+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:34:04+00:00",
        "description": "Adriana Espinel and Claudia de Paz sing \"Someone like You\". I'm Adriana. I was born in Madrid in 2011. I began playing the cello in 2019 and have been attending the conservatory to study the trombone since 2020. In addition, I love swimming, playing volleyball, and participating in sports. I'm also keen on photography. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4130198,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LtaFNXytNl8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LtaFNXytNl8/hqdefault.jpg",
        "title": "Student's Show \"Somenone like You\" | Adriana Espinel | TEDxIES Saramago Majadahonda Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:41.154866+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:33:52+00:00",
        "description": "Claudia de Paz and Adriana Espinel sing \"Someone like you\". Claudia was born on 18th November 2011, in Madrid. Since I was 7 years old, I have taken on roles in musicals such as Bastian in \"The Neverending Story\", Summer in \"The School of Rock\" or Nala in \"The Lion King\". I have also taken part in different events in Madrid. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4130199,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=hLf7ezgtbYI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hLf7ezgtbYI/hqdefault.jpg",
        "title": "Students Show \"Someone like you\" | Claudia de Paz | TEDxIES Saramago Majadahonda Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:41.394138+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:32:09+00:00",
        "description": "How can we make a place feel like home even though it is changing?  When done well, placemaking can bring numerous positive benefits and should preserve and celebrate a community's cultural identity. But do we know the “cultural identity” of a place – is it easily identifiable? Can we agree on it? Sense of place comes from personal and community histories; institutions can’t tell multiple and diverse stories. We hold family stories that are jigsaw pieces of a bigger story. By recording and celebrating who we are, we can design public spaces that are inspiring, relatable and feel like home.  Linda is a Museums, Heritage and Culture Consultant with over 20 years of experience leading senior digital roles across the sector. Originally from Wrexham, she moved to Birmingham in 2004 to work with Birmingham Museums, where her career began with a groundbreaking community digitisation project in East Yorkshire. This experience sparked her lifelong passion for personal heritage, local storytell",
        "id": 4130200,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=waCveRex2Bc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/waCveRex2Bc/hqdefault.jpg",
        "title": "Using Our Past to Build a Future  | Linda Spurdle | TEDxLadywood Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:41.693039+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:32:00+00:00",
        "description": "When Natalie’s mathematician husband predicted it would take four years to conceive their child through IVF and was right, it sparked more than a miracle. It triggered a profound epiphany: what if success could be reverse-engineered? In this powerful talk, Natalie shares how one prediction became the foundation for a personal development formula rooted in storytelling, stoic resilience, and the power of compounding. Blending heartfelt narrative with a practical life-design framework, she offers a roadmap for anyone ready to overcome adversity and build the life they truly want.\n Natalie is a multi-award-winning producer, creative leader, and CEO of Transition Stage Company, renowned for her bold approach to storytelling and innovation in the creative industries. A classically trained actor with a Master’s from the Birmingham Royal Conservatoire, she has appeared in BBC productions, produced over 50 new plays, three films, and secured international film funding across the UK and USA.\n\n",
        "id": 4130201,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=PIgU91ynZVs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/PIgU91ynZVs/hqdefault.jpg",
        "title": "IVF, Maths & Storytelling: My Growth Formula | Natalie Adele Edward-Yesufu | TEDxLadywood Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:42.018624+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:31:58+00:00",
        "description": "What if we saw people not as their past labels, addict, criminal, offender, but as humans capable of change? Drawing on 16 years of experience in the justice system and recovery settings, Emma shares how yoga and movement can reconnect people to their essence, stretch imaginations of identity, and spark personal transformation. From prison gyms to recovery centres, Emma's witnessed hardened exteriors soften, self-worth bloom, and light return. This isn’t about posture, it’s about possibility. By seeing the person first, not the behaviour, we invite a chance to rewrite the story. This is not just movement. This is A movement. Emma is a trauma-informed yoga teacher, founder of the high-energy Drum n Bounce fitness brand, and a DJ and radio host. Originally from the Lake District, she has called Birmingham home for the past 16 years.\n\nWith over 16 years’ experience in the criminal justice system and social welfare settings, Emma has built a unique career at the intersection of wellbeing ",
        "id": 4130202,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vBBrN58528s",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vBBrN58528s/hqdefault.jpg",
        "title": "The Long Stretch and Seeing Beyond the Labels We Carry | Emma Smallman | TEDxLadywood Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:42.425668+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:31:45+00:00",
        "description": "What if children could see the patriarchy and choose to unlearn it? This talk introduces a child-friendly framework that helps children and the adults in their lives notice, name, and question unfair patterns, including limiting gender norms often described as the patriarchy. Kids see unfairness every day, but we don’t give them the words for it. Lauren Currie shows how shared language can build empathy, confidence, and critical thinking without shame or blame. When children and adults have words for what they see, they are better equipped to challenge harmful patterns and imagine something better. Lauren is the Founder of UPFRONT, an organisation on a mission to transform confidence, visibility, and power for 10 million women worldwide. Thousands of women from over 50 countries have graduated from The UPFRONT Bond, the flagship programme that has become the leading choice for women and organisations seeking to build confidence. UPFRONT’s client list includes Nike, Just Eat Takeaway, ",
        "id": 4130203,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nNtXUZzXle0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nNtXUZzXle0/hqdefault.jpg",
        "title": "Helping children name the patriarchy and choose fairness | Lauren Currie OBE | TEDxLadywood Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:42.794460+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:31:41+00:00",
        "description": "What does it mean when Black hair is barely coded into our games? Danielle Udogaranya unpacks the emotional impact on identity of limited Black hair representation in gaming, where afros, fades, and one style of locs are often the only options (if at all). Through her journey of creating authentic Black hairstyles for The Sims and beyond, Danielle reveals how this erasure affects identity, why it starts in game development education, and how we can rebuild character creation to reflect the fullness of who we are. Danielle Udogaranya is Founder & CEO of EBONIX\n\nA true trailblazer at the intersection of gaming, tech, and culture, Danielle has spent nearly a decade pioneering authentic representation for Black players in games. Her Afrocentric custom content for The Sims 4 reshaped diversity in virtual spaces and empowered creators across the world.\n\nHer high-profile collaborations include The Sims, Dark & Lovely’s Play In Color initiative, and global brands such as Samsung, Meta, Xbox, ",
        "id": 4130204,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=2I9zTObXzDQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2I9zTObXzDQ/hqdefault.jpg",
        "title": "The Emotional Cost of Missing Black Hair In Games | Danielle Udogaranya | TEDxLadywood Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:43.106745+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:31:33+00:00",
        "description": "In a world full of fast takes, outrage and loud opinions, being right puts you at the top of the social scoreboard. But is our obsession with proving we’re right pushing us forward? Or pulling us apart? In this talk, Savannah Hanson shares how curiosity has helped her connect across divides - not by avoiding difficult discussions, but by changing how we approach them. If you’ve ever found yourself raising your voice, biting your tongue, or simply frozen in tough conversations, this talk offers a different path: one that begins not with the answers, but with curiosity. Savannah specialises in helping people step into the conversations most of us try to avoid. From generational differences to power dynamics, identity to change, she creates spaces where dialogue isn’t just brave — it’s transformative. By blending curiosity, radical empathy, and disarming honesty, Savannah helps people move beyond silence or shouting, towards real connection.\n\nHer expertise in media literacy, countering m",
        "id": 4130205,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=D7ZNjvbx2Fw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/D7ZNjvbx2Fw/hqdefault.jpg",
        "title": "Being Right Is Overrated. How Curiosity Can Shape Our Future | Savannah Hanson | TEDxLadywood Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:43.417951+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:31:25+00:00",
        "description": "In an era of information overload, we are consuming more content in a single day than people did in an entire lifetime just a few centuries ago. But as the speed of information has increased, our ability to question it has decreased. The result? Fake news spreads six times faster than real news, AI-generated deepfakes are becoming indistinguishable from reality, and people are making high-stakes decisions based on false or manipulated information.\n\nThis talk examines why our brains are predisposed to fall for deception, how social media and digital algorithms amplify falsehoods, and, most importantly, how we can train ourselves to distinguish fact from fiction. As a former Senior Crime Investigator, Nikki shares powerful techniques to make smarter decisions-because the future belongs to those who can see through deception.\n A former Senior Crime Investigator and Human Behaviour Expert, Nikki spent over two decades on the frontline tackling serious and organised crime. In high-stakes e",
        "id": 4130206,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Zs4qDleA2fA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Zs4qDleA2fA/hqdefault.jpg",
        "title": "How to Spot Deception in a World of Misinformation | Nikki Bhamra | TEDxLadywood Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-11-21T16:39:43.822870+00:00",
        "date_dead_since": null,
        "date_published": "2025-11-21T16:27:20+00:00",
        "description": "“The art of storytelling through change explores how powerful narratives can guide us through uncertainty, inspire transformation, and help us make sense of the world as it shifts around us. It’s about turning experiences—both disruptive and uplifting—into stories that move people, spark reflection, and ignite action.” Ruchi Gour Mehta is a seasoned finance leader and CFO with extensive experience across top national and multinational companies including ITC Ltd, Asian Paints, Cloudtail (Amazon Group), Myntra, Swiggy, and Dream Sports. With expertise in finance, audits, investments, and business strategy, she exemplifies ethical leadership and a strong analytical approach in driving organizational growth. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4130207,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=KfLR16A_Dpk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KfLR16A_Dpk/hqdefault.jpg",
        "title": "The Art Of Story Telling Through Change | Ruchi Gour Mehta | TEDxAmity University Chhattisgarh",
        "vote": 0
    }
]