[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T22:30:08+00:00",
        "description": "Among the many properties Sony published and never revisited over the years, Freedom Wars is truly a product of its time. The far-future premise which mixes sci-fi with real-world issues in a bombastic, over-the-top fashion. The hack-and-slash combat tailormade for quick commutes. The streamlined progression and systems.\n\nIt's finally received the remastered treatment, shining in 4K/60 FPS like never before and presenting some truly horrendous English voice-acting for select characters. And it is intriguing to see how Freedom Wars aged. Combat is still simplistic but solid and enjoyable despite the repetition and lack of variety. Meanwhile, the aesthetic is unique and backed by a surprisingly great soundtrack, even while showing its age.\n\nWhile Freedom Wars Remastered won't compete with the best of today, it is a decent blast from the past with some unique world-building and gameplay systems that fans may still enjoy.",
        "id": 1938404,
        "language": null,
        "link": "https://www.youtube.com/watch?v=bu6Y-tQG6YA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bu6Y-tQG6YA/hqdefault.jpg",
        "title": "Freedom Wars Remastered PS5 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T18:30:11+00:00",
        "description": "Sony’s lineup of first party studios has been one of its biggest strengths for years at this point, and even though the last couple of years have seen the company faltering a little bit on that front, excitement surrounding the future output of the PlayStation Studios umbrella continues to be quite high. \n\nSome, like Naughty Dog and Sucker Punch, have outright confirmed what games they have in the pipeline, while others, like Guerrilla and Sucker Punch, have provided little more than bits and pieces of hints- but either way, there’s no shortage of things to talk about with each studio. \n\nHere, that’s exactly what we’re going to do, as we take a look at the entire PlayStation Studios lineup and discuss what those teams have got cooking up.",
        "id": 1937485,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DjzkjrvIMJ8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DjzkjrvIMJ8/hqdefault.jpg",
        "title": "What Every PlayStation Studio Is Working On - NEW PS5 Games In Development",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T10:00:41+00:00",
        "description": "February is rapidly approaching, and one of its first major releases is Kingdom Come: Deliverance 2. As a direct sequel, it focuses on Henry of Skalitz, who ventures to Northern Bohemia and Kuttenberg to avenge his parents.\n\nThough the approach to simulating the world follows in the original's footsteps, numerous improvements and changes make for exciting exploration. Outside of the increased scale (with about 100 hours of gameplay promised), the world is more reactive, with individuals reacting to your actions more naturally. You can be arrested and charged with crimes, and a variety of playstyles is possible.\n\nThat's not factoring in new activities like blacksmithing, additional weapon slots for easier switching during combat, flashbacks to the first game for new players, and more. Check out all the juicy details ahead of Kingdom Come: Deliverance 2's launch on February 4th for Xbox Series X/S, PS5, and PC.",
        "id": 1935593,
        "language": null,
        "link": "https://www.youtube.com/watch?v=gBpupKQpcMg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/gBpupKQpcMg/hqdefault.jpg",
        "title": "Kingdom Come Deliverance 2 - 15 MORE NEW Things You Need To Know Before You Purchase",
        "vote": 0
    }
]