[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T23:01:48.614588+00:00",
        "description": "The Washington Post reports:\nRuptures of undersea cables that have rattled European security officials in recent months were likely the result of maritime accidents rather than Russian sabotage, according to several U.S. and European intelligence officials. \n\nThe determination reflects an emerging consensus among U.S. and European security services, according to senior officials from three countries involved in ongoing investigations of a string of incidents in which critical seabed energy and communications lines have been severed... [S]o far, officials said, investigations involving the United States and a half-dozen European security services have turned up no indication that commercial ships suspected of dragging anchors across seabed systems did so intentionally or at the direction of Moscow. Instead, U.S. and European officials said that the evidence gathered to date &mdash; including intercepted communications and other classified intelligence &mdash; points to accidents cause",
        "id": 1938389,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/19/225237/accidents-not-sabotage-likely-damaged-baltic-undersea-cables-say-us-and-european-intelligence-officials?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Accidents, Not Sabotage, Likely Damaged Baltic Undersea Cables, Say US and European Intelligence Officials",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T21:54:22.858044+00:00",
        "description": "\"As large-scale solar farms crop up across the U.S.,\" reports ABC News, \"the booming solar industry has found an unlikely mascot...\" Sheep.\n\n\nIn Milam County, outside Austin [Texas], SB Energy operates the fifth-largest solar project in the country, capable of generating 900 megawatts of power across 4,000 acres (1,618 hectares). How do they manage all that grass? With the help of about 3,000 sheep, which are better suited than lawnmowers to fit between small crevices and chew away rain or shine. The proliferation of sheep on solar farms is part of a broader trend &mdash; solar grazing &mdash; that has exploded alongside the solar industry. Agrivoltaics, a method using land for both solar energy production and agriculture, is on the rise with more than 60 solar grazing projects in the U.S., according to the National Renewable Energy Laboratory. \n\nThe American Solar Grazing Association says 27 states engage in the practice. \"The industry tends to rely on gas-powered mowers, which kind",
        "id": 1938177,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/01/19/213256/large-scale-us-solar-farms-brings-solar-grazing-work-for-sheep?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Large-Scale US Solar Farms Brings 'Solar Grazing' Work for Sheep",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T19:45:04.677203+00:00",
        "description": "ABC News reported that the official newspaper of China's communist party is claiming TikTok refugees on RedNote found a \"new home,\" and \"openness, communication, and mutual learning are... the heartfelt desires of people from all countries.\" \n\nBut in fact, Wired reports, \"China's Cyberspace Administration, the country's top internet watchdog, has reportedly already grown concerned about content being shared by foreigners on Xiaohongshu,\" and \"warned the platform earlier this week to 'ensure China-based users can't see posts from U.S. users,' according to The Information.\" \n\nAnd that's just the beginning. Wired reports that RedNote is now also \"scrambling to hire English-speaking moderators.\"\n\nSocial media platforms in China are legally required to remove a wide range of content, including nudity and graphic violence, but especially information that the government deems politically sensitive... \"RedNote &mdash; like all platforms owned by Chinese companies &mdash; is subject to the Ch",
        "id": 1937733,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/19/0127205/rednote-scrambles-to-hire-english-speaking-content-moderators?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "RedNote Scrambles to Hire English-Speaking Content Moderators",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T18:40:26.820135+00:00",
        "description": "CNN reports:\n TikTok appears to be coming back online just hours after President-elect Donald Trump pledged Sunday that he would sign an executive order Monday that aims to restore the banned app. Around 12 hours after first shutting itself down, U.S. users began to have access to TikTok on a web browser and in the app, although the page still showed a warning about the shutdown. \n\nThe brief outage was \"the first time in history the U.S. government has outlawed a widely popular social media network,\" reports NPR. Apple and Google removed TikTok from their app stores. (And Apple also removed Lemon8). \n\n\nThe incoming president announced his pending executive order \"in a post on his Truth Social account,\" reports the Associated Press, \"as millions of TikTok users in the U.S. awoke to discover they could no longer access the TikTok app or platform.\" \nBut two Republican Senators said Sunday that the incoming president doesn't have the power to pause the TikTok ban. Tom Cotton of Arkansas ",
        "id": 1937461,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/19/1814232/tiktok-goes-offline-in-us---then-comes-back-online-after-trump-promises-90-day-reprieve?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "TikTok Goes Offline in US - Then Comes Back Online After Trump Promises 90-Day Reprieve",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T17:35:10.040298+00:00",
        "description": "The JavaScript runtime Node.js can execute TypeScript (Microsoft's JavaScript-derived language with static typing). \nBut now it can do it even better, explains Marco Ippolito of the Node.js steering committee:\n\nIn August 2024 Node.js introduced a new experimental feature, Type Stripping, aimed at addressing a longstanding challenge in the Node.js ecosystem: running TypeScript with no configuration. Enabled by default in Node.js v23.6.0, this feature is on its way to becoming stable. \n\n\nTypeScript has reached incredible levels of popularity and has been the most requested feature in all the latest Node.js surveys. Unlike other alternatives such as CoffeeScript or Flow, which never gained similar traction, TypeScript has become a cornerstone of modern development. While it has been supported in Node.js for some time through loaders, they relied heavily on configuration and user libraries. This reliance led to inconsistencies between different loaders, making them difficult to use inter",
        "id": 1937205,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/01/19/0335202/nodejs-type-stripping-for-typescript-now-enabled-by-default?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Node.js 'Type Stripping' for TypeScript Now Enabled by Default",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T16:30:05.366001+00:00",
        "description": "In 2022 Google released a tool to easily scan for vulnerabilities in dependencies named OSV-Scanner. \"Together with the open source community, we've continued to build this tool, adding remediation features,\" according to Google's security blog, \"as well as expanding ecosystem support to 11 programming languages and 20 package manager formats... Users looking for an out-of-the-box vulnerability scanning CLI tool should check out OSV-Scanner, which already provides comprehensive language package scanning capabilities...\" \n\nThursday they also announced an extensible library for \"software composition analysis\" scanning (as well as file-system scanning) named OSV-SCALIBR (Open Source Vulnerability &mdash; Software Composition Analysis LIBRary). The new library \"combines Google's internal vulnerability management expertise into one scanning library with significant new capabilities such as:\n\n Software composition analysis for installed packages, standalone binaries, as well as source code",
        "id": 1936905,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/19/0547233/google-upgrades-open-source-vulnerability-scanning-tool-with-sca-scanning-library?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Upgrades Open Source Vulnerability Scanning Tool with SCA Scanning Library",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T13:14:54.659351+00:00",
        "description": "Fortune reports 18% of workers have engaged in \"career catfishing\" &mdash; getting a job offer, but then refusing to show up on the first day of work. \n\nAnd when someone posted Fortune's article to Reddit's antiwork subreddit, it drew 2,100 upvotes -- and another 84 comments. (\"I love doing this...! This feels really great to do after a company has jerked you around, and basically said that several other people were in line ahead of you... after five interviews.\") \n\nBut Fortune reports there's other sources of frustration:\n\nAt the moment, Gen Z is contending with an onerous battle to land an entry-level, full-time role. The class of 2025 is set to apply to more jobs than the graduating class prior, already submitting 24% more applications on average this past summer than seniors did last year. Furthermore, the class of 2024 applied to 64% more jobs than the cohort before them, according to job platform Handshake. To make matters all the more bleak, the number of job listings has dwin",
        "id": 1936098,
        "language": null,
        "link": "https://it.slashdot.org/story/25/01/18/0018202/are-career-catfishers-justified-in-not-showing-up-for-work?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Are 'Career Catfishers' Justified In Not Showing Up for Work?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T08:46:34.153454+00:00",
        "description": "CNN has the latest on \"a startling discovery made public in July that metallic rocks were apparently producing oxygen on the Pacific Ocean's seabed, where no light can penetrate. \n\n\"Initial research suggested potato-size nodules rich in metals, predominantly found 4,000 meters (13,100 feet) below the surface in the Clarion-Clipperton Zone, released an electrical charge, splitting seawater into oxygen and hydrogen through electrolysis.\"\n\n The unprecedented natural phenomenon challenges the idea that oxygen can only be made from sunlight via photosynthesis. Andrew Sweetman, a professor at the UK's Scottish Association for Marine Science who was behind the find, is embarking on a three-year project to investigate the production of \"dark\" oxygen further... Uncovering dark oxygen revealed just how little is known about the deep ocean, and the Clarion-Clipperton Zone, or CCZ, in particular. The region is being explored for the deep-sea mining of rare metals contained in the rock nodules. T",
        "id": 1935173,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/18/2240252/scientists-probe-mysterious-oxygen-source-possibly-discovered-on-the-sea-floor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Scientists Probe Mysterious Oxygen Source Possibly Discovered on the Sea Floor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T06:36:16.362037+00:00",
        "description": "\"The universe is expanding faster than predicted by theoretical models,\" writes Phys.org, \"and faster than can be explained by our current understanding of physics.\" There's now been new confirmation of this (published in The Astrophysical Journal Letters) by a team led by Dan Scolnic, an associate professor of physics at Duke University. \n\nAnd this means the so-called Hubble tension \"now turns into a crisis,\" said Dan Scolnic, who led the research team... This is saying, to some respect, that our model of cosmology might be broken.\"\nMeasuring the universe requires a cosmic ladder, which is a succession of methods used to measure the distances to celestial objects, with each method, or \"rung,\" relying on the previous for calibration. The ladder used by Scolnic was created by a separate team using data from the Dark Energy Spectroscopic Instrument (DESI), which is observing more than 100,000 galaxies every night from its vantage point at the Kitt Peak National Observatory. Scolnic rec",
        "id": 1934874,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/19/0422230/a-hubble-crisis-new-measurement-confirms-universe-is-expanding-too-fast-for-current-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "A 'Hubble Crisis'? New Measurement Confirms Universe is Expanding Too Fast for Current Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T04:25:26.580840+00:00",
        "description": "Jersey is an island in the English channel, \"a self-governing British Crown Dependency near the coast of northwest France,\" according to Wikipedia &mdash; population: 103,267. \n\nBut now some residents of Jersey \"have been recommended bloodletting to reduce high concentrations of 'forever chemicals' in their blood,\" reports the Guardian, \"after tests showed some islanders have levels that can lead to health problems.\"\n\n\nPrivate drinking water supplies in Jersey were polluted by the use of firefighting foams containing PFAS (per- and polyfluoroalkyl substances) at the island's airport, which were manufactured by the U.S. multinational 3M. .. Bloodletting draws blood from a vein in measured amounts. It is safe and the body replenishes the blood naturally, but it must be repeated until clean... \n\nIn response to the blood results, the government established an independent PFAS scientific advisory panel to advise public policy. The panel's first report recommended that the government shoul",
        "id": 1934570,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/18/2310259/after-pfas-contamination-on-english-channel-island-government-panel-recommends-bloodletting-for-those-affected?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After PFAS Contamination on English Channel Island, Government Panel Recommends Bloodletting for Those Affected",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-19T02:14:39.529435+00:00",
        "description": "Chinese social-networking site RedNote became the #1 most-downloaded app in America, reports the Associated Press, with some new users considering it a way to protest America's possible TikTok ban. \n\nSo what happened next?\nThey were met with surprise, curiosity and in-jokes on Xiaohongshu &mdash; literally, \"Little Red Book\" &mdash; whose users saw English-language posts take over feeds almost overnight. Americans introduced themselves with hashtag TikTok refugees, ask me anything attitude and posting photos of their pets to pay their hosts' \"cat tax.\" Parents swapped stories about raising kids and Swifties from both countries, of course, quickly found each other. It's a rare moment of direct contact between two online worlds that are usually kept apart by language, corporate boundaries, and China's strict system of online censorship that blocks access to nearly all international media and social media services... Xiaohongshu's 300 million monthly active users are overwhelmingly Chin",
        "id": 1934274,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/19/0016233/on-eve-of-tiktok-ban-chinese-app-rednote-surges-in-popularity-delighting-chinese-state-media?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "On Eve of TikTok Ban, Chinese App RedNote Surges in Popularity, Delighting Chinese State Media",
        "vote": 0
    }
]