[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T18:28:11.272567+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T18:00:06+00:00",
        "description": "TV comedy writer, Gil Rief, shares how working under constant creative pressure taught him that the best ideas come from collaboration, not isolation. Through stories from The Ellen Show, he reveals how the “writers’ room mindset” — treating creativity as a team sport — transforms stuck moments into breakthroughs. He explains that creativity thrives when people separate brainstorming (“write drunk”) from editing (“edit sober”) and create space for curiosity instead of criticism. Ultimately, Gil urges everyone to apply this mindset beyond comedy, using playfulness, trust, and teamwork to generate better ideas—faster.\n\nIf you’d like to reach out to him directly, please visit www.gilrief.com Gil Rief is a 13-time Emmy-winning comedy writer and former head writer at The Ellen Show and The Jennifer Hudson Show. Along with his work in television, Gil teaches organizations how to use creative leadership to boost innovation and teamwork. \n\nThis talk was given at a TEDx event using the TED con",
        "id": 4318913,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=374TpFtfJys",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/374TpFtfJys/hqdefault.jpg",
        "title": "Want better ideas fast? Think like a comedy writer | Gil Rief | TEDxFullerton",
        "vote": 0
    }
]