[
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T19:18:00.492308+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T19:00:37+00:00",
        "description": "For over 10 years, Rapid has been perfecting the curation of digital twins for heavy-duty vehicles, both on the data and distribution sides, using their OneCX platform to power content in Unreal Engine.\n\nRapid has worked with Mack Trucks and Volvo Trucks North America over the last four years to launch their new ranges of vehicles with not only a configurator, but a full suite of marketing and training materials. For the last launch alone, more than 100 pieces of content were created in Unreal Engine. Starting the process early with the vehicle still in its pre-production phase, Rapid supports internal visualization right through to production and post-launch.\n\nThis session recorded at Unreal Fest Stockholm describes the process for developing a heavy duty digital twin in Unreal Engine for the purpose of marketing and training content, and also shows an example of the content in action at live promotional events.\n\nLearn more about Unreal Engine here: unrealengine.com\n\n#AutomotiveConfi",
        "id": 4319234,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=b1Bv5WdbyIo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/b1Bv5WdbyIo/hqdefault.jpg",
        "title": "Beyond the Configurator: Digital Twins for Heavy-Duty Vehicles | Unreal Fest Stockholm 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Unreal Engine",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T18:10:53.733927+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T17:01:26+00:00",
        "description": "Are you new to creating in Fortnite? Are you a developer curious about UEFN but unsure about where to start? This session recorded at Unreal Fest Stockholm is all about first steps, including all the learning and community resources to help you develop your first UEFN island.\n\nIn this video, we go in-game to explore templates and examples for learning UEFN, designing certain game modes, and making your own branded experiences. We also go over all the learning materials available to help you get started. \n\nFrom documentation and videos, to exploring the snippets, forums, to the Developer Assistant, there's a wealth of information available to get you started. The talk also touches on the overall island publishing process and resources for more experienced users.\n\nSo what are you waiting for? Watch for everything you need to gear up and jump off the Battle Bus of developing in Fortnite!\n\nLearn more about UEFN here: unrealengine.com/uses/uefn-unreal-editor-for-fortnite\n\n#GameDevelopment,",
        "id": 4318855,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=vHUzFSgJ96A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 685,
        "source_url": "https://youtube.com/channel/UCBobmJyzsJ6Ll7UbfhI4iwQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vHUzFSgJ96A/hqdefault.jpg",
        "title": "Jump off the Bus and Get Developing in Fortnite! | Unreal Fest Stockholm 2025",
        "vote": 0
    }
]