[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T16:03:01.404584+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T16:00:22+00:00",
        "description": "As far as video games are concerned, 2025 is going to be a year for the books. It’s been a year of incredible, incredible highs, this was the year we saw a small unknown team take everyone by surprise with their debut masterpiece, Clair Obscur. This was the year where Metal Gear Solid came back, and the year that Silent Hill got its first original entry in over a decade - and it turned out to be good! This was the year that Kojima put out another masterpiece in Death Stranding 2, and the year that Donkey Kong returned to the scene with a literal smash hit. Silksong came out this year, and it was fantastic! Metroid Prime 4 came out this year! \n\nSo many great things happened that it feels almost ungrateful to be negative about video games after all that. And yet, in spite of how amazing the games themselves have been, this year also had some really dismal lows, and those are all owed to the platform holders who are tasked to be the custodians of the industry. \n\nMake no mistake about it,",
        "id": 4318088,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=G7khchtGL2A",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/G7khchtGL2A/hqdefault.jpg",
        "title": "PS5 vs Xbox vs Switch 2 - Who Won 2025?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T10:24:01.188466+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T10:00:04+00:00",
        "description": "There are just so many great games out there, but even the best ones have scars. These are the mandatory sections that break the flow, test your patience, or feel so out of place that they leave you wondering what the developers were even thinking in the first place. \n\nWhether it’s awkward vehicle segments, slow-paced stealth detours, sudden difficulty spikes, or mechanics that clash with the rest of the experience, these moments stand out for all the wrong reasons. \n\nDespite these missteps, the games themselves remain beloved and iconic. In this video, we look at 15 fantastic titles that impressed players overall but still stumbled with mandatory sections that were frustrating, off-putting, and unforgettable for reasons no player would hope for.\n\nThumbnail credit: Nexusmod user: generalpengu",
        "id": 4316300,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=2KSUsy3O9BE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2KSUsy3O9BE/hqdefault.jpg",
        "title": "10 Awesome Games That Had Totally Off Putting Mandatory Sections",
        "vote": 0
    }
]