[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T23:28:45.315479+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T22:59:00+00:00",
        "description": "An anonymous reader shared this report from the BBC:\n\n\nA billionaire investor keen on buying TikTok's US operations has told the BBC he has been left in limbo as the latest deadline for the app's sale looms. \nThe US has repeatedly delayed the date by which the platform's Chinese owner, Bytedance, must sell or be blocked for American users. US President Donald Trump appears poised to extend the deadline for a fifth time on Tuesday. \"We're just standing by and waiting to see what happens,\" investor Frank McCourt told BBC News... \n\nThe president...said \"sophisticated\" US investors would acquire the app, including two of his allies: Oracle chairman Larry Ellison and Dell Technologies' Michael Dell. Members of the Trump administration had indicated the deal would be formalised in a meeting between Trump and Xi in October &mdash; however it concluded without an agreement being reached. Neither TikTok's Chinese owner ByteDance nor Beijing have since announced approval of a sale, despite Trum",
        "id": 4320397,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/14/2257237/investors-in-limbo-will-the-tiktok-deals-deadline-be-extended-again",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Investors in Limbo'.  Will the TikTok Deal's Deadline Be Extended Again?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T22:18:11.403341+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T21:34:00+00:00",
        "description": "An anonymous reader shared this report from the Los Angeles Times:\n\n\n\nPopular podcast host Steven Bartlett has used an AI clone to launch a new kind of content aimed at the 13 million followers of his podcast \"Diary of a CEO.\" On YouTube, his clone narrates \"100 CEOs With Steven Bartlett,\" which adds AI-generated animation to Bartlett's cloned voice to tell the life stories of entrepreneurs such as Steve Jobs and Richard Branson. Erica Mandy, the Redondo Beach-based host of the daily news podcast called \"The Newsworthy,\" let an AI voice fill in for her earlier this year after she lost her voice from laryngitis and her backup host bailed out... \n\nIn podcasting, many listeners feel strong bonds to hosts they listen to regularly. The slow encroachment of AI voices for one-off episodes, canned ad reads, sentence replacement in postproduction or translation into multiple languages has sparked anger as well as curiosity from both creators and consumers of the content. Augmenting or replacin",
        "id": 4320046,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/14/2110234/podcast-industry-under-siege-as-ai-bot-flood-airways-with-thousands-of-programs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Podcast Industry Under Siege as AI Bot Flood Airways with Thousands of Programs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T21:10:47.232205+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T20:34:00+00:00",
        "description": "AI \"has gutted entry-level roles in the tech industry,\" reports Rest of World. \n\nOne student at a high-ranking engineering college in India tells them that among his 400 classmates, \"fewer than 25% have secured job offers... there's a sense of panic on the campus.\"\n\n\nStudents at engineering colleges in India, China, Dubai, and Kenya are facing a \"jobpocalypse\" as artificial intelligence replaces humans in entry-level roles. Tasks once assigned to fresh graduates, such as debugging, testing, and routine software maintenance, are now increasingly automated. Over the last three years, the number of fresh graduates hired by big tech companies globally has declined by more than 50%, according to a report published by SignalFire, a San Francisco-based venture capital firm. Even though hiring rebounded slightly in 2024, only 7% of new hires were recent graduates. As many as 37% of managers said they'd rather use AI than hire a Gen Z employee... \n\nIndian IT services companies have reduced ent",
        "id": 4319756,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/14/2030215/entry-level-tech-workers-confront-an-ai-fueled-jobpocalypse",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Entry-Level Tech Workers Confront an AI-Fueled Jobpocalypse",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T19:59:22.392229+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T19:12:00+00:00",
        "description": "\"Polar bears are still sadly expected to go extinct this century,\" with two-thirds of the population gone by 2050,\" says the lead researcher on a new study from the University of East Anglia in Britain. \n\nBut their research also suggests polar bears \"are rapidly rewiring their own genetics in a bid to survive,\" reports NBC News, in \"the first documented case of rising temperatures driving genetic change in a mammal.\"\n\n\n\"I believe our work really does offer a glimmer of hope &mdash; a window of opportunity for us to reduce our carbon emissions to slow down the rate of climate change and to give these bears more time to adapt to these stark changes in their habitats,\" [the lead author of the study told NBC News]. \n\nBuilding on earlier University of Washington research, [lead researcher] Godden's team analyzed blood samples from polar bears in northeastern and southeastern Greenland. In the slightly warmer south, they found that genes linked to heat stress, aging and metabolism behaved d",
        "id": 4319417,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/14/199215/polar-bears-are-rewiring-their-own-genetics-to-survive-a-warming-climate",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Polar Bears are Rewiring Their Own Genetics to Survive a Warming Climate",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T17:46:05.953888+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T17:34:00+00:00",
        "description": "America's solar industry \"just delivered another huge quarter,\" reports Electrek, \"installing 11.7 gigawatts (GW) of new capacity in Q3 2025. That makes it the third-largest quarter on record and pushes total solar additions this year past 30 GW...\"\n\n\nAccording to the new \"US Solar Market Insight Q4 2025\" report from Solar Energy Industries Association (SEIA) and Wood Mackenzie, 85% of all new power added to the grid during the first nine months of the Trump administration came from solar and storage. And here's the twist: Most of that growth &mdash; 73% &mdash; happened in red [Republican-leaning] states. Eight of the top 10 states for new installations fall into that category, including Texas, Indiana, Florida, Arizona, Ohio, Utah, Kentucky, and Arkansas... \n\n\nTwo new solar module factories opened this year in Louisiana and South Carolina, adding a combined 4.7 GW of capacity. That brings the total new U.S. module manufacturing capacity added in 2025 to 17.7 GW. With a new wafer fac",
        "id": 4318655,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/13/0110246/america-adds-117-gw-of-new-solar-capacity-in-q3---third-largest-quarter-on-record",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "America Adds 11.7 GW of New Solar Capacity in Q3 - Third Largest Quarter on Record",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T17:46:06.141540+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T16:34:00+00:00",
        "description": "Nonprofit Code.org released its 2025 State of AI &amp; Computer Science Education report this week with a state-by-state analysis of school policies complaining that \"0 out of 50 states require AI+CS for graduation.\" \n\nBut meanwhile, at the college level, \"Purdue University will begin requiring that all of its undergraduate students demonstrate basic competency in AI,\" writes former college president Michael Nietzel, \"starting with freshmen who enter the university in 2026.\"\n\n\nThe new \"AI working competency\" graduation requirement was approved by the university's Board of Trustees at its meeting on December 12... The requirement will be embedded into every undergraduate program at Purdue, but it won't be done in a \"one-size-fits-all\" manner. Instead, the Board is delegating authority to the provost, who will work with the deans of all the academic colleges to develop discipline-specific criteria and proficiency standards for the new campus-wide requirement. [Purdue president] Chiang s",
        "id": 4318656,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/14/0557226/purdue-university-approves-new-ai-requirement-for-all-undergrads",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Purdue University Approves New AI Requirement For All Undergrads",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T16:32:02.784048+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T15:34:00+00:00",
        "description": "U.S. Senator Sheldon Whitehouse said Friday he was moving to file a bipartisan bill to repeal Section 230 of America's Communications Decency Act. \n\n\n\"The law prevents most civil suits against users or services that are based on what others say,\" explains an EFF blog post.\n\n\"Experts argue that a repeal of Section 230 could kill free speech on the internet,\" writes LiveMint &mdash; though America's last two presidents both supported a reapl:\n\nDuring his first presidency, US President Donald Trump called to repeal the law and signed an executive order attempting to curb some of its protections, though it was challenged in court.\nSubsequently, former President Joe Biden also voiced his opinion against the law. \n\nAn EFF blog post explains the case for Section 230:\n\nCongress passed this bipartisan legislation because it recognized that promoting more user speech online outweighed potential harms. When harmful speech takes place, it's the speaker that should be held responsible, not the ser",
        "id": 4318233,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/14/0656223/repeal-section-230-and-its-platform-protections-urges-new-bipartisan-us-bill",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Repeal Section 230 and Its Platform Protections, Urges New Bipartisan US Bill",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T13:10:40.986516+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T12:34:00+00:00",
        "description": "Time magazine used its 98th annual \"Person of the Year\" cover to \"recognize a force that has dominated the year's headlines, for better or for worse. For delivering the age of thinking machines, for wowing and worrying humanity, for transforming the present and transcending the possible, the Architects of AI are TIME's 2025 Person of the Year.\" \n\n\nOne cover illustration shows eight AI executives sitting precariously on a beam high above the city, while Time's 6,700-word article promises \"the story of how AI changed our world in 2025, in new and exciting and sometimes frightening ways. It is the story of how [Nvidia CEO] Huang and other tech titans grabbed the wheel of history, developing technology and making decisions that are reshaping the information landscape, the climate, and our livelihoods.\" \n\nTime describes them betting on \"one of the biggest physical infrastructure projects of all time,\" mentioning all the usual worries &mdash; datacenters' energy consumption, chatbot psychos",
        "id": 4317087,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/14/084207/time-magazines-person-of-the-year-the-architects-of-ai",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Time Magazine's 'Person of the Year': the Architects of AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T09:48:09.300803+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T08:44:00+00:00",
        "description": "A January order blocking wind energy projects in America has now been vacated by a U.S. judge and declared unlawful, reports the Associated Press:\n\n[Judge Saris of the U.S. district court for the district of Massachusetts] ruled in favor of a coalition of state attorneys general from 17 states and Washington DC, led by Letitia James, New York's attorney general, that challenged President Trump's day one order that paused leasing and permitting for wind energy projects... The coalition that opposed Trump's order argued that Trump does not have the authority to halt project permitting, and that doing so jeopardizes the states' economies, energy mix, public health and climate goals. \n\nThe coalition includes Arizona, California, Colorado, Connecticut, Delaware, Illinois, Maine, Maryland, Massachusetts, Michigan, Minnesota, New Jersey, New Mexico, New York, Oregon, Rhode Island, Washington state and Washington DC. They say they have invested hundreds of millions of dollars collectively to ",
        "id": 4316162,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/13/0157258/trump-ban-on-wind-energy-permits-unlawful-court-rules",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Trump Ban on Wind Energy Permits 'Unlawful', Court Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T06:20:17.859006+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T05:34:00+00:00",
        "description": "An anonymous reader shared this report from Phoronix:\n\n\nDue to the growing number of GNOME Shell extensions looking to appear on extensions.gnome.org that were generated using AI, it's now prohibited. The new rule in their guidelines note that AI-generated code will be explicitly rejected: \n\n \"Extensions must not be AI-generated \n\nWhile it is not prohibited to use AI as a learning aid or a development tool (i.e. code completions), extension developers should be able to justify and explain the code they submit, within reason. \n\nSubmissions with large amounts of unnecessary code, inconsistent code style, imaginary API usage, comments serving as LLM prompts, or other indications of AI-generated output will be rejected.\" \n\n \n\nIn a blog post, GNOME developer Javad Rahmatzadeh explains that\n\"Some devs are using AI without understanding the code...\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+Rule+Forbids+GNOME+Shel",
        "id": 4315549,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/14/0453227/new-rule-forbids-gnome-shell-extensions-made-using-ai-generated-code",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Rule Forbids GNOME Shell Extensions Made Using AI-Generated Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T04:09:04.932680+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T03:44:00+00:00",
        "description": "The R programming language \"is sometimes frowned upon by 'traditional' software engineers,\" says the CEO of software quality services vendor Tiobe, \"due to its unconventional syntax and limited scalability for large production systems.\" But he says it \"continues to thrive at universities and in research-driven industries, and \"for domain experts, it remains a powerful and elegant tool.\" \n\nYet it's now gaining more popularity as statistics and large-scale data visualization become important (a trend he also sees reflected in the rise of Wolfram/Mathematica). That's according to December's edition of his TIOBE Index, which attempts to rank the popularity of programming languages based on search-engine results for courses, third-party vendors, and skilled engineers. InfoWorld explains:\n\nIn the December 2025 index, published December 7, R ranks 10th with a 1.96% rating. R has cracked the Tiobe index's top 10 before, such as in April 2020 and July 2020, but not in recent years. The rival P",
        "id": 4315210,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/14/0340217/is-the-r-programming-language-surging-in-popularity",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Is the R Programming Language Surging in Popularity?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T01:50:13.963658+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T01:34:00+00:00",
        "description": "This week System76 launched the first stable release of its Rust-based COSMIC desktop environment, reports 9to5Linux. \n\nAnnounced in 2021, it's designed for all GNU/Linux distributions &mdash; and it shipping with Pop!_OS 24.04 LTS (based on Ubuntu 24.04 LTS):\n\n\nPrevious Pop!_OS releases used a version of the COSMIC desktop that was based on the GNOME desktop environment. However, System76 wanted to create a new desktop environment from scratch while keeping the same familiar interface and user experience built for efficiency and fun. This means that some GNOME apps have been replaced by COSMIC apps, including COSMIC Files instead of Nautilus (Files), COSMIC Terminal instead of GNOME Terminal, COSMIC Text Editor instead of GNOME Text Editor, and COSMIC Media Player instead of Totem (Video Player). \nAlso, the Pop!_Shop graphical package manager used in previous Pop!_OS releases has now been replaced by a new app called COSMIC Store. \n\n\"If you're ambitious enough, or maybe just crazy en",
        "id": 4314755,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/14/0112231/system76-launches-first-stable-release-of-cosmic-desktop-and-popos-2404-lts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "System76 Launches First Stable Release of COSMIC Desktop and Pop!_OS 24.04 LTS",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-14T01:50:14.155137+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-14T00:35:00+00:00",
        "description": "This week the Free Software Foundation honored Andy Wingo, Alx Sa, and Govdirectory with this year's annual Free Software Awards (given to community members and groups making\n\"significant\" contributions to software freedom):\n\n\nAndy Wingo is one of the co-maintainers of GNU Guile,\nthe official extension language of the GNU operating system and the\nScheme \"backbone\" of GNU\nGuix. Upon receiving the award, he stated: \"Since I learned\nabout free software, the vision of a world in which hackers freely\nshare and build on each others' work has been a profound inspiration\nto me, and I am humbled by this recognition of my small efforts in\nthe context of the Guile Scheme implementation. I thank my\nco-maintainer, Ludovic Court&egrave;s, for his comradery over the years: we\nare just building on the work of the past maintainers of Guile, and I\nhope that we live long enough to congratulate its many future\nmaintainers.\" \n\nThe 2024 Award for\nOutstanding New Free\nSoftware Contributor went to Alx Sa for",
        "id": 4314756,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/14/0030234/free-software-awards-winners-announced-andy-wingo-alx-sa-govdirectory",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Free Software Awards' Winners Announced: Andy Wingo, Alx Sa, Govdirectory",
        "vote": 0
    }
]