[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T23:41:47.296147+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T23:00:00+00:00",
        "description": "Struggling small biotech firms are pivoting into cryptocurrencies, rebranding as \"crypto treasuries\" or stockpiling digital assets like Ether and Litecoin as a last-ditch effort to boost share prices amid stalled funding and weak drug pipelines. Bloomberg reports: Shares of 180 Life Sciences Corp., now doing business as ETHZilla, tripled after the Peter Thiel-backed company said it had accumulated Ether tokens worth over $350 million. Less than two weeks later, the stock's gains have been erased. In July, Sonnet BioTherapeutics Holdings soared 243% in one volatile session on plans to transform into a public crypto treasury while MEI Pharma Inc. initially doubled on plans to sell shares to fund a Litecoin treasury.\n \nSuch about-faces are a tried-and-true formula for small firms when funds are low and shares are under pressure. For drugmakers it can be a sudden shift to chase after trendy new treatment targets, still other companies rebrand with buzzwords like artificial intelligence to",
        "id": 3417245,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/25/2145230/biotechs-turn-to-digital-coins-crypto-to-boost-stock-prices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Biotechs Turn to Digital Coins, Crypto to Boost Stock Prices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T22:37:41.371875+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T22:20:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: AMD's X3D-series Ryzen chips have become popular with PC gamers because games in particular happen to benefit disproportionately from the chips' extra 64MB of L3 cache memory. But that extra memory occasionally comes with extra headaches. Not long after they were released earlier this year, some early adopters started having problems with their CPUs, ranging from failure to boot to actual physical scorching and burnout -- the problems were particularly common for users of the 9800X3D processor in ASRock motherboards, and one Reddit thread currently records 157 incidents of failure for that CPU model across various ASRock boards.\n \nIn an interview with the Korean language website Quasar Zone (via Tom's Hardware), AMD executives David McAfee and Travis Kirsch acknowledged the problems and pointed to the most likely culprit: motherboard makers who don't follow AMD's recommended specifications. Some manufacturers have historically shi",
        "id": 3416964,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/25/2013208/amd-blames-motherboard-makers-for-burnt-out-cpus?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AMD Blames Motherboard Makers For Burnt-Out CPUs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T22:37:41.501982+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T21:40:00+00:00",
        "description": "Apple has filed a lawsuit against former Apple Watch staffer Dr. Chen Shi, alleging that he \"conspired to steal Apple's trade secrets relating to Apple Watch and to disclose them to his new employers (Oppo).\" The company alleges he downloaded 63 sensitive documents, attended technical meetings, and coordinated with Oppo to transfer proprietary information, though Oppo denies wrongdoing. The Verge reports: Ahead of starting his new job at Oppo, the employee, Dr. Chen Shi, attended \"dozens\" of meetings with technical members on the Apple Watch team to learn about their work and downloaded 63 documents \"from a protected Box folder\" that he loaded onto a USB drive, according to the lawsuit. Shi allegedly sent a message to Oppo saying that he was working to \"collect as much information as possible\" before starting his job. And he searched the internet for terms like \"how to wipe out macbook\" and \"Can somebody see if I've opened a file on a shared drive?\" from his Apple-issued MacBook befor",
        "id": 3416965,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/25/2023259/apple-accuses-former-apple-watch-staffer-of-conspiring-to-steal-trade-secrets-for-oppo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Accuses Former Apple Watch Staffer of Conspiring to Steal Trade Secrets for Oppo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T21:31:48.050119+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T21:00:00+00:00",
        "description": "Nvidia has launched its Jetson AGX Thor robotics chip module, a $3,499 \"robot brain\" developer kit that starts shipping next month. CNBC reports: After a company uses the developer kit to prototype their robot, Nvidia will sell Thor T5000 modules that can be installed in production-ready robots. If a company needs more than 1,000 Thor chips, Nvidia will charge $2,999 per module. CEO Jensen Huang has said robotics is the company's largest growth opportunity outside of artificial intelligence, which has led to Nvidia's overall sales more than tripling in the past two years. \"We do not build robots, we do not build cars, but we enable the whole industry with our infrastructure computers and the associated software,\" said Deepu Talla, Nvidia's vice president of robotics and edge AI, on a call with reporters Friday.\n \nThe Jetson Thor chips are based on a Blackwell graphics processor, which is Nvidia's current generation of technology used in its AI chips, as well as its chips for computer ",
        "id": 3416520,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/08/25/207231/nvidias-new-robot-brain-goes-on-sale?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nvidia's New 'Robot Brain' Goes On Sale",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T21:31:48.178512+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T20:20:00+00:00",
        "description": "An anonymous reader quotes a report from PYMNTS: Artificial intelligence startup Perplexity has announced a new subscription program called Comet Plus that it said gives users access to premium content from trusted publishers and journalists, while providing publishers with a better compensation model. \"Comet Plus transforms how publishers are compensated in the AI age,\" the company said in a Monday blog post. \"As users demand a better internet in the age of AI, it's time for a business model to ensure that publishers and journalists benefit from their contributions to a better internet.\"\n \nComet Plus is included in Perplexity's Pro and Max memberships and is available as a standalone subscription for $5 per month. Perplexity introduced its Comet AI-powered browser in July, saying the tool lets users answer questions and carry out tasks and research from a single interface. Bloomberg reported Monday that Perplexity has allocated $42.5 million for a revenue sharing program that compens",
        "id": 3416521,
        "language": "en-us",
        "link": "https://search.slashdot.org/story/25/08/25/201210/perplexity-launches-subscription-program-that-includes-revenue-sharing-with-publishers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Perplexity Launches Subscription Program That Includes Revenue Sharing With Publishers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T20:27:26.325210+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T19:39:00+00:00",
        "description": "The Federal Trade Commission is warning major U.S. tech companies against yielding to foreign government demands that weaken data security, compromise encryption, or impose censorship on their platforms. From a report: FTC Chairman Andrew N. Ferguson signed the letter sent to large American companies like Akamai, Alphabet (Google), Amazon, Apple, Cloudflare, Discord, GoDaddy, Meta, Microsoft, Signal, Snap, Slack, and X (Twitter). Ferguson stresses that weakening data security at the request of foreign governments, especially if they don't alert users about it, would constitute a violation of the FTC Act and expose companies to legal consequences. \n\nFerguson's letter specifically cites foreign laws such as the EU's Digital Services Act and the UK's Online Safety and Investigatory Powers Acts. Earlier this year, Apple was forced to remove support for iCloud end-to-end encryption in the United Kingdom rather than give in to demands to add a backdoor for the government to access encrypted",
        "id": 3416055,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/25/1939221/ftc-warns-tech-giants-not-to-bow-to-foreign-pressure-on-encryption?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FTC Warns Tech Giants Not To Bow To Foreign Pressure on Encryption",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T19:22:32.463345+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T18:45:00+00:00",
        "description": "Intel said Monday that converting $8.87 billion in federal chip subsidies into a 10% equity stake creates unprecedented complications and potential \"adverse reactions\" for a company deriving 76% of revenue internationally. The arrangement transforms Biden-era CHIPS Act grants into share purchases at $20.74 -- a discount to Friday's $24.80 close -- with the Department of Commerce receiving up to 433 million shares by Tuesday's expected closing. \n\nForeign governments may impose additional regulations on Intel due to US government ownership, the company warned in securities filings, while the precedent could discourage other nations from offering grants if they expect similar equity conversions. China alone represents 29% of Intel's revenue. The deal also restricts Intel's strategic flexibility, requiring government votes align with board recommendations except on matters affecting federal interests.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"ht",
        "id": 3415600,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/25/1831240/intel-warns-us-equity-stake-could-trigger-adverse-reactions?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Intel Warns US Equity Stake Could Trigger 'Adverse Reactions'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T18:15:36.979720+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T18:05:00+00:00",
        "description": "Living through extreme heat waves can accelerate your rate of aging, according to research published Monday. From a report: Scientists analyzed 15 years' worth of health data from nearly 25,000 adults in Taiwan and found that two years of exposure to heat waves could speed up a person's so-called biological aging by eight to 12 extra days. It may not sound like a lot, but this number builds over time, said Cui Guo, an assistant professor at the University of Hong Kong who led the study, which was published Monday in the journal Nature Climate Change. \n\n\"This small number actually matters,\" she said. \"This was a study of a two-year exposure, but we know heat waves have actually been occurring for decades.\" The research comes as human-induced climate change is making heat waves more intense and long-lasting. The West Coast of the United States is suffering from sweltering temperatures while Iran is experiencing searing heat. Record-breaking temperatures punished Europe, Japan and Korea ",
        "id": 3415110,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/25/184250/in-a-hotter-world-some-people-age-faster-researchers-find?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "In a Hotter World, Some People Age Faster, Researchers Find",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T18:15:37.093498+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T17:25:00+00:00",
        "description": "Google will require identity verification for all Android app developers, including those distributing apps outside the Play Store, starting September 2026 in Brazil, Indonesia, Singapore, and Thailand before expanding globally through 2027. Developers must register through a new Android Developer Console beginning March 2026. The requirement applies to certified Android devices running Google Mobile Services. Google cited malware prevention as the primary motivation, noting sideloaded apps contain 50 times more malware than Play Store apps. \n\nHobbyist and student developers will receive separate account types. Developer information submitted to Google will not be displayed to users.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+To+Require+Identity+Verification+for+All+Android+App+Developers+by+2027%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F08%2F25%2F1716213%2F%3Futm_source%3Dtwitter%26utm_medium%3Dt",
        "id": 3415111,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/25/1716213/google-to-require-identity-verification-for-all-android-app-developers-by-2027?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google To Require Identity Verification for All Android App Developers by 2027",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T17:10:13.997288+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T16:54:00+00:00",
        "description": "Security researchers have uncovered critical vulnerabilities in Perplexity's Comet browser that enable attackers to hijack user accounts and execute malicious code through the browser's AI summarization features. The flaws, discovered independently by Brave and Guardio Labs, exploit indirect prompt injection attacks that bypass traditional web security mechanisms when users request webpage summaries. \n\nBrave demonstrated account takeover through a malicious Reddit post that compromised Perplexity accounts when summarized. The vulnerability allows attackers to embed commands in webpage content that the browser's large language model executes with full user privileges across authenticated sessions. \n\nGuardio's testing found the browser would complete phishing transactions and prompt users for banking credentials without warning indicators. The paid browser, available to Perplexity Pro and Enterprise Pro subscribers since July, processes untrusted webpage content without distinguishing b",
        "id": 3414593,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/25/1654220/perplexitys-ai-browser-comet-vulnerable-to-prompt-injection-attacks-that-hijack-user-accounts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Perplexity's AI Browser Comet Vulnerable To Prompt Injection Attacks That Hijack User Accounts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T17:10:14.112148+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T16:05:00+00:00",
        "description": "A group representing the world's biggest stock exchanges has called on securities regulators to clamp down on so-called tokenised stocks, arguing that the blockchain-based tokens create new risks for investors and could harm market integrity. From a report: \n\nCrypto exchange Coinbase and broker Robinhood are among those making a push into the nascent sector that could shake up the securities investing landscape. Proponents say tokenised equities can cut trading costs, speed up settlement and facilitate around-the-clock trading. The World Federation of Exchanges (WFE), in a letter sent to three regulatory bodies last Friday, said it was concerned the tokens \"mimic\" equities without providing the same rights or trading safeguards.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Stock+Exchanges+Urge+Regulators+To+Crack+Down+on+'Tokenised+Stocks'%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F08%2F25%2F162240%2F%3Futm",
        "id": 3414594,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/25/162240/stock-exchanges-urge-regulators-to-crack-down-on-tokenised-stocks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Stock Exchanges Urge Regulators To Crack Down on 'Tokenised Stocks'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T16:04:29.464583+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T15:28:00+00:00",
        "description": "An anonymous reader shares a report: Elon Musk's AI startup xAI sued Apple and ChatGPT maker OpenAI in U.S. federal court in Texas on Monday, accusing them of illegally conspiring to thwart competition for artificial intelligence. \n\nMusk earlier this month had threatened to sue Cupertino, California-based Apple, saying in a post on his social media platform X that \"Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Musk's+xAI+Sues+Apple+and+OpenAI+Over+Alleged+Antitrust+Violations%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F08%2F25%2F1528251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F08%2F25%2F1528251%2Fmusks-xai-sues-a",
        "id": 3414044,
        "language": "en-us",
        "link": "https://apple.slashdot.org/story/25/08/25/1528251/musks-xai-sues-apple-and-openai-over-alleged-antitrust-violations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Musk's xAI Sues Apple and OpenAI Over Alleged Antitrust Violations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T14:57:25.109801+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T14:41:00+00:00",
        "description": "Years of aggressive capacity expansion have driven China's solar manufacturing sector into deep losses. Panel prices have hit their lowest levels since 2011 even as the country's installations more than doubled. Shanghai-listed Tongwei reported a 4.96 billion yuan ($693 million) net loss for the first half of 2025, widening from 3.13 billion yuan a year earlier, while Trina Solar swung to a 2.92 billion yuan loss from a prior-year profit. \n\nPanel prices touched 8.7 cents per watt in July, forcing manufacturers to write down inventory values across the polysilicon-to-module supply chain. China installed 212.2 gigawatts of photovoltaic capacity through June, bringing total installations to 1.1 terawatts, yet supply continues outpacing demand after seven major manufacturers posted their first combined annual loss in 2024. The Ministry of Industry and Information Technology convened leading producers last week to urge shutdowns of outdated capacity, while the China Photovoltaic Industry A",
        "id": 3413518,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/25/1436233/chinese-solar-makers-losses-deepen-as-industry-vows-to-end-price-war?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Solar Makers' Losses Deepen as Industry Vows To End Price War",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T14:57:25.242279+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T14:01:00+00:00",
        "description": "DHL's German operations, facing the departure of one-third of support staff within five years, has automated customer service calls and begun capturing institutional knowledge through AI-conducted exit interviews. The company's voicebot now processes one million monthly calls, resolving half without human intervention, though initial deployments struggled with basic German language recognition. \n\nFT adds: At DHL in Germany, one in three staff working in support operations will retire in the next five years, taking with them decades of institutional memory. \"Everyone in Germany understands that if you don't automate and use AI, you won't be able to deal with the shrinking workforce,\" says Gemein [chief information officer for post and parcels].<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=DHL+Deploys+AI+To+Fill+Retirement+Gap+as+Third+of+German+Workers+Near+Exit%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F08%2F25%",
        "id": 3413519,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/25/1149215/dhl-deploys-ai-to-fill-retirement-gap-as-third-of-german-workers-near-exit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "DHL Deploys AI To Fill Retirement Gap as Third of German Workers Near Exit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T11:41:45.922931+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T11:34:00+00:00",
        "description": "Yahoo Finance interviews Peter Cappelli, a Wharton professor of management, on \"the business case for employers pushing for workers to get back to the office.\" (Cappelli has co-written a new book with workplace strategist Ranya Nehmeh titled In Praise of the Office: The Limits to Hybrid and Remote Work ...)\n\n\nYahoo Finance: What's wrong with a hybrid work arrangement? \nCappelli: People just don't come in. That's maybe the single biggest factor. There is a growing awareness that people are really never there on their anchor days. If you want that for your company, you have to manage that attendance... \nYahoo Finance: What's the compelling advantage of in-person work? \nCappelli: There's value in human interaction, what we learn from each other, the cooperation that we can get in solving problems, and the motivation and commitment that comes from being around other people... When you first began your career, imagine what it would've been like if no one was in the office. You'd be complet",
        "id": 3412060,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/25/0628205/new-book-argues-hybrid-schedules-dont-work-return-to-office-brings-motivation-and-learning?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Book Argues Hybrid Schedules 'Don't Work', Return-to-Office Brings Motivation and Learning",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T08:27:13.092297+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T07:44:00+00:00",
        "description": "People in Mississippi no longer have access to Bluesky. \"If you access Bluesky from a Mississippi IP address, you'll see a message explaining why the app isn't available,\" announced a Bluesky blog post Friday. \n\nThe reason is a new Mississippi law that \"requires all users to verify their ages before using common social media sites ranging from Facebook to Nextdoor,\" noted NPR. Bluesky wrote that their block \"will remain in place while the courts decide whether the law will stand.\"\n\n[U]nder the law, we would need to verify every user's age and obtain parental consent for anyone under 18. The potential penalties for non-compliance are substantial &mdash; up to $10,000 per user. Building the required verification systems, parental consent workflows, and compliance infrastructure would require significant resources that our small team is currently unable to spare. \n\nBluesky also notes that the law \"requires collecting and storing sensitive personal information from all users...not just th",
        "id": 3410922,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/25/0723204/bluesky-blocks-mississippi-over-age-verification-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bluesky Blocks Mississippi Over Age Verification Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T06:17:18.544499+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T05:34:00+00:00",
        "description": "More than 30,000 Python developers from around the world answered questions for the Python Software Foundation's annual survey &mdash; and PSF Fellow Michael Kennedy tells the Python community what they've learned in a new blog post. Some highlights:\n\n\nMost still use older Python versions despite benefits of newer releases... Many of us (15%) are running on the very latest released version of Python, but more likely than not, we're using a version a year old or older (83%). [Although less than 1% are using \"Python 3.5 or lower\".] The survey also indicates that many of us are using Docker and containers to execute our code, which makes this 83% or higher number even more surprising... You simply choose a newer runtime, and your code runs faster. CPython has been extremely good at backward compatibility. There's rarely significant effort involved in upgrading... [He calculates some cloud users are paying up to $420,000 and $5.6M more in compute costs.] If your company realizes you are b",
        "id": 3410332,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/08/25/0527225/survey-finds-more-python-developers-like-postgresql-ai-coding-agents---and-rust-for-packages?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Survey Finds More Python Developers Like PostgreSQL, AI Coding Agents - and Rust for Packages",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T03:00:17.968409+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T02:50:00+00:00",
        "description": "\"For a few dozen people in the world, the downside of living with a rare immune condition comes with a surprising superpower &mdash; the ability to fight off all viruses...\" notes an announcement from Columbia University.\n\n\"At first, the condition only seemed to increase vulnerability to some bacterial infections. But as more patients were identified, its unexpected antiviral benefits became apparent.\"\n\nColumbia immunologist Dusan Bogunovic discovered the individuals' antiviral powers about 15 years ago, soon after he identified the genetic mutation that causes the condition... Bogunovic, a professor of pediatric immunology at Columbia University's Vagelos College of Physicians and Surgeons, soon learned that everyone with the mutation, which causes a deficiency in an immune regulator called ISG15, has mild, but persistent systemic inflammation... \"In the back of my mind, I kept thinking that if we could produce this type of light immune activation in other people, we could protect th",
        "id": 3409680,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/25/0242216/could-recreating-a-rare-mutation-grant-almost-universal-virus-immunity-for-days?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could Recreating a Rare Mutation Grant Almost Universal Virus Immunity For Days?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-25T00:48:52.036460+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-25T00:29:00+00:00",
        "description": "\"A fierce dust storm hit the Black Rock Desert on the eve of its annual Burning Man festival,\" reports the San Francisco Chronicle, \"causing at least four minor injuries and damaging campsites that had been set up early.\" [Alternate URL] \n\n\"Winds of up to 50 mph stirred up the lake bed's alkaline dust so ferociously that participants in the annual art and culture festival reported not being able to see beyond a foot... \"\n\nThe dust storm arrived Saturday evening after strong thunderstorms in the Sierra Nevada drifted off the mountains and whipped up strong winds in the Nevada desert... At 5:14 p.m. Saturday, the weather service issued a dust storm advisory for Black Rock City and warned of \"a wall of blowing dust coming off the Smoke Creek and Black Rock Desert playa areas is tracking northward at around 30 mph.\" The agency warned of visibility less than 1 mile and wind gusts exceeding 45 mph. A weather station at Black Rock City Airport measured gusts up to 52 mph at 5:50 p.m... [\"We ",
        "id": 3409306,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/25/0027216/burning-man-hit-by-50-mph-dust-storm-possible-monsoon-thunderstorms-forecast?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Burning Man Hit By 50 MPH Dust Storm. Possible Monsoon Thunderstorms Forecast",
        "vote": 0
    }
]