[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T23:40:36+00:00",
        "description": "Nuclear fusion &mdash; which releases four times the energy of fission &mdash; could theoretically happen sooner in space than on earth, reports CNN. \n\n\"And it could help spacecraft achieve speeds of up to 500,000 miles (805,000 kilometers) per hour &mdash; more than the fastest object ever built...\"\n\nWith funding from the UK Space Agency, British startup Pulsar Fusion has unveiled Sunbird, a space rocket concept designed to meet spacecraft in orbit, attach to them, and carry them to their destination at breakneck speed using nuclear fusion... For now, Sunbird is in the very early stages of construction and it has exceptional engineering challenges to overcome, but Pulsar says it hopes to achieve fusion in orbit for the first time in 2027. [Pulsar's founder/CEO says the first functional Sunbird would be ready four to five years later.] \n\n If the rocket ever becomes operational, it could one day cut the journey time of a potential mission to Mars in half.\n \n\nCNN says the proposed Sunb",
        "id": 2499101,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/06/2255204/could-we-reach-mars-faster-with-nuclear-fusion-powered-rockets?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Could We Reach Mars Faster With Nuclear Fusion-Powered Rockets?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T22:35:10+00:00",
        "description": "It was already the best-selling videogame of all time, notes the Hollywood Reporter. And A Minecraft Movie just had the biggest opening ever for a video game movie adaptation. WIth a production budget of $150 million, it earned in $157 million in just its first weekend in the U.S., with a worldwide total of $301 million. \n\n\nA Warner Bros. executive called the movie \"lightning in a bottle,\" while the head of co-producer Legendary Pictures acknowledged the game is a global phenomon, according to the article. (About the movie's performance, the executive \"said the opening is a both a reflection of the mandate to celebrate the world of Minecraft in a joyful way, and the singular experience that only theatrical can offer.\" \n\n\nBut an unfinished version leaked online before the movie was even released, reports Variety\n\n\nScreenshots and footage from the fantasy adventure were being shared widely on social media platforms this week, and were also available on file sharing sites. The images an",
        "id": 2498857,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/06/2137219/minecraft-movie-scores-biggest-videogame-movie-opening-ever-faces-early-leaks-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Minecraft Movie' Scores Biggest Videogame Movie Opening Ever, Faces Early Leaks Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T20:25:26+00:00",
        "description": "theodp writes: America's National Football League announced that beginning with the 2025 season, Sony's Hawk-Eye virtual measurement technology will assess and identify first downs after a ball spot. Sony's Hawk-Eye virtual measurement technology, which consists of six 8K cameras for optical tracking of the position of the ball, is operated from the NFL's \"Art McNally GameDay Central Officiating Center\" in New York and is integrated with the League's existing replay system. It will serve as an efficient alternative to the process of having a three-person chain crew walk chains onto the field and manually measure whether 10 yards have been met after the official has spotted the ball.\n\n However, the chain crew will remain on the field in a secondary capacity. \n\nThe NFL's executive VP of football operations says their move brings \"world-class on field officiating with state-of-the-art technology to advance football excellence.\" (The NFL's announcement notes the whole process takes about",
        "id": 2498379,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/06/1932242/nfl-adopts-sonys-virtual-measurements-for-footballs-first-downs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NFL Adopts Sony's 'Virtual Measurements' for Football's First Downs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T18:15:12+00:00",
        "description": "It's \"a milestone for Meta AI and for open source,\" Mark Zuckerberg said this weekend. \"For the first time, the best small, mid-size, and potentially soon frontier [large-language] models will be open source.\" \n\nZuckerberg anounced four new Llama LLMs in a video posted on Instagram and Facebook &mdash; two dropping this weekend, with another two on the way. \"Our goal is to build the world's leading AI, open source it, and make it universally accessible so that everyone in the world benefits.\" \n\nZuckerberg's announcement:\n I've said for a while that I think open source AI is going to become the leading models. And with Llama 4 this is starting to happen. \n\n- The first model is Llama 4 Scout. It is extremely fast, natively multi-modal. It has an industry-leading \"nearly infinite\" 10M-token context length, and is designed to run on a single GPU. It is 17 billion parameters by 16 experts, and it is by far the highest performing small model in its class. \n\n- The second model is Llama 4 Ma",
        "id": 2497741,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/06/182233/in-milestone-for-open-source-meta-releases-new-benchmark-beating-llama-4-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "In 'Milestone' for Open Source, Meta Releases New Benchmark-Beating Llama 4 Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T17:10:52+00:00",
        "description": "It was long-time Slashdot reader uninet who argued \"Apple Needs a Snow Sequoia.\" (That is, Apple needs an upgrade to MacOS Sequoia that's like it's earlier \"Snow Leopard\" upgrade to \"Leopard\" OS &mdash; an upgrade that's \"all about how little it added and how much it took away\".) \n\"My recent column on Apple's declining software quality hit a nerve...\" he writes in a follow-up. \"So why do any of us put up with software that grows increasingly buggy?\" \n\n\"One word: hardware. And that's where I'd love to see someone help Linux take the next step.\"\n\nApple knows how to turn out very good quality pieces of hardware and, for many purposes, stands alone. That's been largely true for the last couple of decades. The half-decade of Apple Silicon has cemented this position. At any price point Apple contends, Macs, iPads and iPhones are either without peers or at the top of the market in build quality and processing power... [I]f only there were hardware that was as good and worked together as wel",
        "id": 2497421,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/04/06/0037234/forget-snow-sequoia-now-im-cheering-for-better-linux-hardware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Forget 'Snow Sequoia'.  Now I'm Cheering for Better Linux Hardware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T16:05:39+00:00",
        "description": "\"I started working on Voyager in 1977,\" the Voyager mission's project scientist told Gizmodo Saturday in a new interview. \"It was my first job out of college.\" \n\n35 years later, a Voyager probe became the first spacecraft to cross into interstellar space in 2012, with Voyager 2 following in 2018. But while each Voyager spacecraft carries 10 scientific instruments, all but three have now been turned off to conserve power, Gizmodo writes. \"The two spacecraft now have enough power to operate for another year or so before engineers are forced to turn off two more instruments...\"\n\n\nVoyager Mission Project Scientist Linda Spilker: The number of people that are working on and flying Voyager is a whole lot smaller than it was in the planetary days... The challenge was, can we reach the heliopause? We didn't know where it was, we had no idea how far away it was. We got to Neptune, and then we thought, \"well, maybe it's just another 10 [astronomical units] or so, a little bit further, a little",
        "id": 2497058,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/06/0258203/after-48-years-voyager-scientist-confronts-the-missions-final-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "After 48 Years, Voyager Scientist Confronts the Missions Final Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T15:00:55+00:00",
        "description": "Tinder \"is experimenting with a chatbot that claims to help users improve their flirting skills,\" notes Washington Post internet-culture reporter Tatum Hunter. The chatbot is available only to users in the United States on iPhones for a limited time, and powered by OpenAI's GPT-4o each character \"kicks off an improvised conversation, and the user responds out loud with something flirty...\" \n\n\"Three of them dumped me.\"\n\nYou can win points for banter the app deems \"charming\" or \"playful.\" You lose points if your back-and-forth seems \"cheeky\" or \"quirky\"... It asked me to talk out loud into my phone and win the romantic interest of various AI characters. \nThe first scenario involved a financial analyst named Charles, whom I've supposedly run into at the Tokyo airport after accidentally swapping our luggage. I tried my best to be polite to the finance guy who stole my suitcase, asking questions about his travel and agreeing to go to coffee. But the game had some critical feedback: I shou",
        "id": 2496769,
        "language": null,
        "link": "https://slashdot.org/story/25/04/05/0414240/new-tinder-game-lets-you-flirt-with-ai-characters-three-of-them-dumped-me?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Tinder Game 'Lets You Flirt With AI Characters. Three of Them Dumped Me'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T11:45:20+00:00",
        "description": "This October will see the release of a film that's nearly 43 years in the making, reports Ars Technica:\n\n\n\nIt's difficult to underestimate the massive influence that Disney's 1982 cult science fiction film, TRON, had on both the film industry &mdash; thanks to combining live action with what were then groundbreaking visual effects rife with computer-generated imagery &mdash; and on nerd culture at large. Over the ensuing decades there has been one sequel, an animated TV series, a comic book miniseries, video games, and theme park attractions, all modeled on director Steve Lisberg's original fictional world. \n\n\n\nNow we're getting a third installment in the film franchise: TRON: Ares, directed by Joachim R&oslash;nning (Pirates of the Caribbean: Dead Men Tell No Tales, Maleficent: Mistress of Evil), that serves as a standalone sequel to 2010's TRON: Legacy. Disney just released the first trailer and poster art, and while the footage is short on plot, it's got the show-stopping visuals ",
        "id": 2495864,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/04/05/2218210/tron-sequel-trailer-released-by-disney?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Tron' Sequel Trailer Released by Disney",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T08:30:20+00:00",
        "description": "U.K. postmasters were mistakenly sent to prison due to a bug in their \"Horizon\" accounting software &mdash; as first reported by Computer Weekly back in 2009. Nearly 16 years later, the same site reports that now the Scottish Criminal Cases Review Commission \"is attempting to contact any former subpostmasters that could have been prosecuted for unexplained losses on the Post Office's pre-Horizon Capture software. \n\n\"There are former subpostmasters that, like Horizon users, could have been convicted of crimes based on data from these systems...\"\n\n\nSince the Post Office Horizon scandal hit the mainstream in January 2024 &mdash; revealing to a wide audience the suffering experienced by subpostmasters who were blamed for errors in the Horizon accounting system &mdash; users of Post Office software that predated Horizon have come forward... to tell their stories, which echoed those of victims of the Horizon scandal. The Criminal Cases Review Commission for England and Wales is now reviewi",
        "id": 2495146,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/06/0221239/were-still-more-uk-postmasters-also-wrongly-prosecuted-over-accounting-bug?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Were Still More UK Postmasters Also Wrongly Prosecuted Over Accounting Bug?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T05:15:38+00:00",
        "description": "The Starliner spacecraft lost four thrusters while approaching the International Space Station last summer. NASA astronaut, Butch Wilmore took manual control, remembers Ars Technica, \"But as Starliner's thrusters failed, Wilmore lost the ability to move the spacecraft in the direction he wanted to go...\"\n\nStarliner had flown to within a stone's throw of the space station, a safe harbor, if only they could reach it. But already, the failure of so many thrusters violated the mission's flight rules. In such an instance, they were supposed to turn around and come back to Earth. Approaching the station was deemed too risky for Wilmore and Williams, aboard Starliner, as well as for the astronauts on the $100 billion space station. \n\nBut what if it was not safe to come home, either? \n\n\"I don't know that we can come back to Earth at that point,\" Wilmore said in an interview. \"I don't know if we can. And matter of fact, I'm thinking we probably can't.\" \n\nAfter a half-hour exclusive interview,",
        "id": 2494601,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/06/0136232/starliners-space-station-flight-was-wilder-than-we-thought?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Starliner's Space Station Flight Was 'Wilder' Than We Thought",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T02:00:37+00:00",
        "description": "Microsoft has created a real-time AI-generated rendition of Quake II gameplay (playable on the web). \n\nFriday Xbox's general manager of gaming AI posted the startling link to \"an AI-generated gaming experience\" at Copilot.Microsoft.com \"Move, shoot, explore &mdash; and every frame is created on the fly by an AI world model, responding to player inputs in real-time. Try it here.\" \n\n\nThey started with their \"Muse\" videogame world models, adding \"a real-time playable extension\" that players can interact with through keyboard/controller actions, \"essentially allowing you to play inside the model,\" according to a Microsoft blog post.\n\nA concerted effort by the team resulted in both planning out what data to collect (what game, how should the testers play said game, what kind of behaviours might we need to train a world model, etc), and the actual collection, preparation, and cleaning of the data required for model training. Much to our initial delight we were able to play inside the world",
        "id": 2494143,
        "language": null,
        "link": "https://games.slashdot.org/story/25/04/05/2329252/microsofts-new-ai-generated-version-of-quake-2-now-playable-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft's New AI-Generated Version of 'Quake 2' Now Playable Online",
        "vote": 0
    }
]