[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T17:00:52+00:00",
        "description": "If you are a platformer fan, chances are you may have heard of Mandragora: Whispers of the Witch Tree. Indie developer Primal Game Studios’ 2.5D sidescrolling action RPG mixes elements from Soulslikes and platformers alike, and by the looks of it, it’s taking promising shape. \n\nMandragora is promising a substantial, mechanically dense experience, and if it can live up to the many promises that it is making, it is going to be a worth keeping an eye on. Ahead of its imminent release, then, here, we’re going to shine a light on everything that you should know about Mandragora: Whispers of the Witch Tree.",
        "id": 2497437,
        "language": null,
        "link": "https://www.youtube.com/watch?v=vNQJXyom2tw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/vNQJXyom2tw/hqdefault.jpg",
        "title": "Mandragora: Whispers of The Witch Tree – 15 Things You Need To Know About This Exciting Souls-like",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T13:30:19+00:00",
        "description": "You can never have too many mech games, even if it comes from WarGaming, better known for World of Tanks. Steel Hunters is available now in Steam Early Access for PC while remaining free-to-play, but this is more of a short stop-over than protracted development.\n\nAs such, the overall vision is clear - that of a PvEvP extraction shooter with a mech, having unique abilities and customizable kits. The Hunter in question carry some heft but feel slow, which ties into the sheer destructibility of the environments. However, the overall formula feels surface-level at best, or at least not particularly in-depth, especially given the setting and potential.\n\nThat's not accounting for the progression with its myriad of currencies and convoluted ways to upgrade the mech. Steel Hunters isn't necessarily dead on arrival, and it does have some potential if WarGaming can embrace the chaos. Despite encompassing so many trends, it's seemingly treading water for now.",
        "id": 2496438,
        "language": null,
        "link": "https://www.youtube.com/watch?v=U4mwfz2dckw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/U4mwfz2dckw/hqdefault.jpg",
        "title": "Steel Hunters - Does It Quench Gamers' Thirst For A NEW TITANFALL?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-04-06T06:30:19+00:00",
        "description": "Metroid Prime 4 was originally announced at the beginning of the Nintendo Switch generation, and here, at the beginning of the Nintendo Switch 2 era, it is finally ready to release. \n\nSometime later this year, the long awaited first person action adventure title will release as a cross-gen title for the Switch and the Switch 2, and thankfully, we’re now beginning to get a clearer picture of what it will look like. \n\nRecent days and weeks have brought plenty of new gameplay footage and information for starved Prime fans to feast on, and here, we are going to go over the most crucial details we have learned about Metroid Prime 4: Beyond.",
        "id": 2494949,
        "language": null,
        "link": "https://www.youtube.com/watch?v=hmrcdR7ZiRk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/hmrcdR7ZiRk/hqdefault.jpg",
        "title": "Metroid Prime 4: Beyond - 10 NEW Details You Probably Don't Know",
        "vote": 0
    }
]