[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T23:26:00.600502+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T22:40:00+00:00",
        "description": "SAP will invest over 20 billion euros ($23 billion) in European sovereign cloud infrastructure over the next decade. \"Innovation and sovereignty cannot be two separate things -- it needs to come together,\" said Thomas Saueressig, SAP's board member tasked with leading customer services and delivery. CNBC reports: The company said it was expanding its sovereign cloud offerings to include an infrastructure-as-a-service (IaaS) platform enabling companies to access various computing services via its data center network. IaaS is a market dominated by players like Microsoft and Amazon. It will also roll out a new on-site option that allows customers to use SAP-operated infrastructure within their own data centers. The aim of the initiative is to ensure that customer data is stored within the European Union to maintain compliance with regional data protection regulations such as the General Data Protection Regulation, or GDPR.\n \n[...] Saueressig said that SAP is \"closely\" involved in the cre",
        "id": 3480952,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/02/1959258/sap-to-invest-over-20-billion-euros-in-sovereign-cloud?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "SAP To Invest Over 20 Billion Euros In 'Sovereign Cloud'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T22:25:40.414248+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: OpenAI said on Tuesday it will acquire Statsig in an all-stock deal valuing the product testing startup at about $1.1 billion based on OpenAI's current valuation of $300 billion. The ChatGPT maker will also appoint Statsig's chief executive officer, Vijaye Raji, as OpenAI's tech chief of applications, in a push to build on its artificial intelligence products amid strong competition from rivals.\n \n[...] In his role, Vijaye will head product engineering for ChatGPT and the company's coding agent, Codex, with responsibilities that span core systems and product lines including infrastructure, the company said. Statsig builds tools to help software developers test and flag new features. It raised $100 million in funding earlier this year. Once the acquisition is finalized, Statsig employees will work for OpenAI but will continue operating independently out of its Seattle office, OpenAI said. The move follows the acquisition of iPhone desig",
        "id": 3480592,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/02/1955214/openai-to-acquire-product-testing-startup-statsig-appoints-cto-of-applications?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI To Acquire Product Testing Startup Statsig, Appoints CTO of Applications",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T22:25:40.513123+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T21:24:00+00:00",
        "description": "A federal judge spared Google from the harshest penalties in its antitrust case. The search giant can keep Chrome and avoid breaking up Android, but it has been barred from exclusive contracts and ordered to limit data sharing with rivals. CNBC reports: U.S. District Judge Amit Mehta ruled against the most severe consequences that were proposed by the U.S. Department of Justice, including selling off its Chrome browser, which provides data that helps its advertising business deliver targeted ads. \"Google will not be required to divest Chrome; nor will the court include a contingent divestiture of the Android operating system in the final judgment,\" the decision stated. \"Plaintiffs overreached in seeking forced divesture of these key assets, which Google did not use to effect any illegal restraints.\"\n \nThe company can make payments to preload products, but it cannot have exclusive contracts, the decision stated. The DOJ asked Google to stop the practice of \"compelled syndication,\" whic",
        "id": 3480593,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/09/02/2119208/google-gets-to-keep-chrome-but-is-barred-from-exclusive-search-deals-judge-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Gets To Keep Chrome But Is Barred From Exclusive Search Deals, Judge Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T21:25:23.340130+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T20:41:00+00:00",
        "description": "An old school ransomware attack has a new twist: threatening to feed data to AI companies so it'll be added to LLM datasets. 404 Media reports: Artists&amp;Clients is a website that connects independent artists with interested clients. Around August 30, a message appeared on Artists&amp;Clients attributed to the ransomware group LunaLock. \"We have breached the website Artists&amp;Clients to steal and encrypt all its data,\" the message on the site said, according to screenshots taken before the site went down on Tuesday. \"If you are a user of this website, you are urged to contact the owners and insist that they pay our ransom. If this ransom is not paid, we will release all data publicly on this Tor site, including source code and personal data of users. Additionally, we will submit all artwork to AI companies to be added to training datasets.\" \n\nLunaLock promised to delete the stolen data and allow users to decrypt their files if the site's owner paid a $50,000 ransom. \"Payment is ac",
        "id": 3480230,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/02/1936245/hackers-threaten-to-submit-artists-data-to-ai-models-if-art-site-doesnt-pay-up?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Hackers Threaten To Submit Artists' Data To AI Models If Art Site Doesn't Pay Up",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T20:24:59.093639+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T20:01:00+00:00",
        "description": "An anonymous reader shares a report: It's broadly understood that electric vehicles are more environmentally friendly than their counterparts that burn only gasoline. And yes -- that includes the impact of manufacturing batteries and generating power to charge them. But even then, such generalizations gloss over specifics, like which EVs are especially eco-friendly, not to mention where. The efficiency of an electric car varies greatly depending on ambient temperature, which is less compromising for gas-burning vehicles. \n\nWe now have the data and math to answer these questions, courtesy of the University of Michigan. Last week, researchers there released a study along with a calculator that allows users to compare the lifetime difference in greenhouse gas emissions of various vehicle types and powertrains from \"cradle to grave,\" as they say. That includes vehicle production and disposal, as well as use-phase emissions from \"driving and upstream fuel production and/or electricity gene",
        "id": 3479798,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/02/1921238/new-study-proves-evs-are-always-cleaner-than-gas-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Study Proves EVs Are Always Cleaner Than Gas Cars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T20:24:59.204800+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T19:22:00+00:00",
        "description": "UK weather agency Met Office, in a blog post: Provisional Met Office statistics confirm that summer 2025 is officially the warmest summer on record for the UK. Analysis by Met Office climate scientists has also shown that a summer as hot or hotter than 2025 is now 70 times more likely than it would be in a 'natural' climate with no human caused greenhouse gas emissions. \n\nThe UK's mean temperature from 1 June to 31 August stands at 16.10C, which is 1.51C above the long-term meteorological average. This surpasses the previous record of 15.76C, set in 2018, and pushes the summer of 1976 out of the top five warmest summers in a series dating back to 1884.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Summer+2025+is+the+Warmest+on+Record+for+the+UK%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F02%2F191239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\">",
        "id": 3479799,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/02/191239/summer-2025-is-the-warmest-on-record-for-the-uk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Summer 2025 is the Warmest on Record for the UK",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T19:24:39.141193+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T18:41:00+00:00",
        "description": "Taylor Otwell, inventor and maintainer of popular PHP framework Laravel, is warning against overly complex code and the risks of bypassing the framework. From a report: Developers are sometimes drawn to building \"cathedrals of complexity that aren't so easy to change,\" he said, speaking in a podcast for maintainable.fm, a series produced by Ruby on Rails consultancy Planet Argon. \n\nSoftware, he said, should be \"simple and disposable and easy to change.\" Some problems are genuinely complex, but in general, if a developer finds a \"clever solution\" which goes beyond the standard documented way in a framework such as Laravel or Ruby on Rails, \"that would be like a smell.\" \n\nA code smell -- for the uninitiated in the The Reg readership -- is a term developers use for code that works but may cause problems at a later date. Otwell described himself as a \"pretty average programmer\" but reckons many others are the same, solving basic problems as quickly and efficiently as they can.<p><div clas",
        "id": 3479209,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/09/02/1829251/laravel-inventor-tells-devs-to-quit-writing-cathedrals-of-complexity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Laravel Inventor Tells Devs To Quit Writing 'Cathedrals of Complexity'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T18:23:24.161802+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T18:01:00+00:00",
        "description": "For decades, the dry season in the Amazon rainforest has been getting drier. A new study, published on Tuesday, found that about 75% of the decrease in rainfall is directly linked to deforestation. From a report: The study, in Nature Communications, also found that tree loss was partly responsible for increased heat across the Amazon. Since 1985, the hottest days in the Amazon have warmed by about 2 degrees Celsius. About 16% of that increase, the researchers found, was because of deforestation. \n\nMarco Franco, an assistant professor at the University of Sao Paulo who led the study, said he was surprised by the findings. \"We were expecting to see deforestation as a driver, but not this much,\" he said. \"It tells us a lot about what's going on in the biome.\" The Amazon rainforest is often called the lungs of the planet because its trees help to regulate the global climate by absorbing planet-warming carbon dioxide. But decades of large-scale logging and burning in the forest have recent",
        "id": 3478794,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/02/1649244/poor-amazon-rains-linked-to-brazil-deforestation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Poor Amazon Rains Linked To Brazil Deforestation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T18:23:24.270878+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T17:22:00+00:00",
        "description": "An anonymous reader shares a report: If you're sharing an ad-free YouTube Premium or YouTube Music account with friends or family who live outside of your home, you could lose your premium privileges. Customers who lose these can still watch YouTube or listen to music with ads -- but let's be real, it's not the same. \n\nMultiple reports have shown people who have the service have been receiving notices that their premium service will be paused for 15 days due to violating a policy that's been in place since 2023. On its support page, YouTube says that an account manager can add up to five family members in a household to their Premium membership. But, the post says, \"Family members sharing a YouTube family plan must live in the same household as the family manager.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+Is+Pausing+Premium+Family+Plans+if+You+Aren't+Watching+From+the+Same+Address%3A+https%3A%2F%2Fnews",
        "id": 3478795,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/02/1643241/youtube-is-pausing-premium-family-plans-if-you-arent-watching-from-the-same-address?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Is Pausing Premium Family Plans if You Aren't Watching From the Same Address",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T17:22:56.596923+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T16:42:00+00:00",
        "description": "Steam's August 2025 hardware survey shows 32GB RAM configurations reached 35.42% of users while 16GB systems fell to 41.67%, continuing a six-month trend that positions 32GB to become the dominant memory configuration among PC gamers before year's end. \n\nWindows 11 crossed 60% adoption among Steam users. The RTX 4060 continues gaining market share despite newer RTX 5060 availability. Display resolutions at 2560x1600 pixels saw the largest growth, primarily from gaming laptops.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=32GB+of+RAM+On+Track+To+Become+the+New+Majority+For+Gamers%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F09%2F02%2F1631203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F25%2F09%2F02%2F1631203%2F32gb-of-ram-on-track-to-become",
        "id": 3478225,
        "language": "en-us",
        "link": "https://games.slashdot.org/story/25/09/02/1631203/32gb-of-ram-on-track-to-become-the-new-majority-for-gamers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "32GB of RAM On Track To Become the New Majority For Gamers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T16:22:20.644227+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T16:04:00+00:00",
        "description": "America is becoming a nation of economic pessimists. WSJ reports: A new Wall Street Journal-NORC poll [PDF] finds that the share of people who say they have a good chance of improving their standard of living fell to 25%, a record low in surveys dating to 1987. More than three-quarters said they lack confidence that life for the next generation will be better than their own, the poll found. \n\nNearly 70% of people said they believe the American dream -- that if you work hard, you will get ahead -- no longer holds true or never did, the highest level in nearly 15 years of surveys. Republicans in the survey were less pessimistic than Democrats, reflecting the longstanding trend that the party holding the White House has a rosier view of the economy. An index that combined six poll questions found that 55% of Republicans, as well as 90% of Democrats, held a negative view of prospects for themselves and their children. \n\nThe discontent reaches across demographic lines. By large majorities,",
        "id": 3477656,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/02/164215/americans-lose-faith-that-hard-work-leads-to-economic-gains-wsj-norc-poll-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Americans Lose Faith That Hard Work Leads to Economic Gains, WSJ-NORC Poll Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T16:22:20.753550+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T15:22:00+00:00",
        "description": "Speaking of Amazon Prime, Amazon is axing the program that lets Prime members share their free shipping perk with people outside their household. The Verge: In an update to its support page, Amazon says it will cut off Prime benefit sharing on October 1st, 2025, prompting invitees who don't live with the account holder to sign up for their own subscription at a discounted $14.99 rate for an entire year (and then $14.99 per month after that). \n\nInstead, Amazon is replacing this program with Amazon Family, which lets account holders share Prime benefits -- but only with people they live with. Amazon says everyone in a \"Family\" must live at the same primary residential address, defined as \"the address you consider to be your home and where you spend the majority of your time.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Ends+Shared+Prime+Free+Shipping+Outside+Your+Home%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F",
        "id": 3477657,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/02/1459213/amazon-ends-shared-prime-free-shipping-outside-your-home?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon Ends Shared Prime Free Shipping Outside Your Home",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T16:22:20.863326+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T14:40:00+00:00",
        "description": "Developer Hugo Tunius, writing in a blog post: Sideloading has been a hot topic for the last decade. Most recently, Google has announced further restrictions on the practice in Android. Many hundreds of comment threads have discussed these changes over the years. One point in particular is always made: \"I should be able to run whatever code I want on hardware I own.\" I agree entirely with this point, but within the context of this discussion it's moot. \n\nWhen Google restricts your ability to install certain applications they aren't constraining what you can do with the hardware you own, they are constraining what you can do using the software they provide with said hardware. It's through this control of the operating system that Google is exerting control, not at the hardware layer. You often don't have full access to the hardware either and building new operating systems to run on mobile hardware is impossible, or at least much harder than it should be. This is a separate, and I thin",
        "id": 3477658,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/09/02/1434208/what-every-argument-about-sideloading-gets-wrong?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "What Every Argument About Sideloading Gets Wrong",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T14:19:32.883769+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T14:00:00+00:00",
        "description": "An anonymous reader shares a report: The United States is on the precipice of a historic, if dubious, achievement. If current trends hold, 2025 could be the first year on record in which the US population actually shrinks. \n\nThe math is straightforward. Population growth has two sources: natural increase (births minus deaths) and net immigration (arrivals minus departures). Last year, births outnumbered deaths by 519,000 people. That means any decline in net immigration in excess of half a million could push the U.S. into population decline. A recent analysis of Census data by the Pew Research Center found that between January and June, the US foreign-born population fell for the first time in decades by more than one million. While some economists have questioned the report, a separate analysis by the American Enterprise Institute predicted that net migration in 2025 could be as low as negative 525,000. In either case, annual population growth this year could easily turn negative.<p>",
        "id": 3476463,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/02/1242252/the-us-population-could-shrink-in-2025-for-the-first-time-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The US Population Could Shrink in 2025, For the First Time Ever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T14:19:32.999958+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T12:30:00+00:00",
        "description": "An anonymous reader shares a report: Amazon doubled its Prime Day discount sales to four days this year and touted blowout numbers days after the event. But by one critical metric, it missed the mark. Sign-ups in the U.S. failed to meet last year's total and even the company's own target, according to internal company data reviewed by Reuters. \n\nThe world's largest online retailer registered 5.4 million U.S. sign-ups over the 21-day run-up to Prime Day and its four-day sales event from July 8 to July 11. That was around 116,000 fewer than for the same period a year earlier and 106,000 below the company's own goal, a roughly 2% decline in both metrics.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+US+Prime+Sign-Ups+Slow+Despite+Expanded+Promotion%2C+Data+Shows%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F09%2F02%2F1230217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitte",
        "id": 3476464,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/02/1230217/amazon-us-prime-sign-ups-slow-despite-expanded-promotion-data-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Amazon US Prime Sign-Ups Slow Despite Expanded Promotion, Data Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T14:19:33.116578+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T09:30:00+00:00",
        "description": "Shenzhen-Hong Kong-Guangzhou has overtaken Tokyo-Yokohama to become the world's top cluster for innovation, the United Nations said Monday. From a report: The UN's World Intellectual Property Organization (WIPO) said the Chinese cluster had leapfrogged its Japanese rival in its 2025 Global Innovation Index. The change at the top of the world's 100 leading innovation clusters was down to WIPO broadening the criteria to include venture capital investments to formulate the annual rankings. \n\n The UN agency dealing with patenting and innovation previously only used patent filing and scientific publishing data to identify local concentrations of world-leading innovation activity. \"Venture capital investment activity helps capture how scientific and technological knowledge translates into start-up creation and, ultimately, new goods and services in the marketplace,\" WIPO said. The agency said Shenzhen-Hong Kong-Guangzhou and Tokyo-Yokohama \"make a massive contribution to global scientific p",
        "id": 3476465,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/02/0837225/chinese-cluster-now-worlds-top-innovation-hotspot-un-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Cluster Now World's Top Innovation Hotspot, UN Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T14:19:33.236518+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T06:25:00+00:00",
        "description": "Premium bottled water is emerging as restaurants' answer to declining alcohol consumption as establishments offer curated water menus featuring bottles priced up to $25.70. La Popote in Cheshire has introduced a seven-water selection ranging from $6.75 Peak District spring water to $25.70 Portuguese Vidago, served in wine glasses at room temperature. \n\nWater sommelier Doran Binder, who created the menu and founded Crag spring water, reports 7 million monthly social media views for water content. The movement extends beyond Britain -- over a dozen US restaurants maintain water lists, while new producers like Hampshire's Chorq plan champagne-style bottles with corks. Michael Mascha's FineWaters has certified more than 100 water sommeliers globally as demand grows for waters distinguished by mineral content ranging from 14 to 3,300 milligrams per liter of dissolved solids.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status",
        "id": 3476466,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/09/02/0623209/water-menus-gain-traction-as-restaurants-seek-non-alcoholic-revenue-streams?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Water Menus Gain Traction as Restaurants Seek Non-Alcoholic Revenue Streams",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T14:19:33.355633+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T04:20:00+00:00",
        "description": "Google denied claims Monday that it had issued a security warning to Gmail users about a major vulnerability. The company stated that recent reports claiming a broad Gmail security alert were \"entirely false.\" Google said its email service blocks more than 99.9% of phishing and malware attempts from reaching users' inboxes.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Says+Gmail+Security+Alert+Claims+Are+False%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F09%2F02%2F0419231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F09%2F02%2F0419231%2Fgoogle-says-gmail-security-alert-claims-are-false%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://tec",
        "id": 3476467,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/09/02/0419231/google-says-gmail-security-alert-claims-are-false?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Says Gmail Security Alert Claims Are False",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T02:57:57.385606+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T02:00:00+00:00",
        "description": "College students have integrated generative AI into their academic routines at an unprecedented scale as 85% report usage for coursework in the past year, according to new Inside Higher Ed survey data. The majority employ AI tools for brainstorming ideas, seeking tutoring assistance, and exam preparation rather than wholesale academic outsourcing. Only 25% admitted using AI to complete assignments entirely, while 19% generated full essays. \n\nStudents overwhelmingly reject institutional policing approaches, with 53% favoring education on ethical AI use over detection software deployment. Despite widespread adoption, 35% of respondents report no change in their perception of college value, while 23% view their degrees as more valuable in the AI era.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=85%25+of+College+Students+Report+AI+Use%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F09%2F01%2F2328220%2F%3Futm_source%",
        "id": 3472827,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/01/2328220/85-of-college-students-report-ai-use?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "85% of College Students Report AI Use",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-09-02T01:51:11.981393+00:00",
        "date_dead_since": null,
        "date_published": "2025-09-02T00:15:00+00:00",
        "description": "International tourism to the United States faces an unprecedented 8.2% decline in 2025, with the World Travel and Tourism Council projecting a $12.5 billion loss in visitor spending -- the only decline among 184 economies analyzed. Canadian visitors, traditionally comprising 28% of international arrivals, have dropped by approximately 25% through July. \n\nSeattle tour operators report 30-50% fewer Canadian customers with many explicitly citing recent tariff policies and political rhetoric as deterrents. The newly implemented $250 \"visa integrity fee\" for certain countries compounds existing concerns about immigration policies and National Guard deployments in major cities. Tourism Economics now projects full recovery to pre-pandemic levels won't occur until 2029, three years later than initially forecast.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Tourism+Suffers+8.2%25+Decline%3A+https%3A%2F%2Fnews.slashdot.o",
        "id": 3472063,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/09/01/2339241/us-tourism-suffers-82-decline?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "US Tourism Suffers 8.2% Decline",
        "vote": 0
    }
]