[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T23:48:21.631832+00:00",
        "description": "Richard Stallman founded the Free Software Foundation as a nonprofit in 1985 with four other directors (including MIT computer science professor Gerald Jay Sussman). Sussman remains on the Board of directors, along with EFF co-founder John Gilmore and five others. \n\nFriday the eight directors published a new article explaining how their goal and principles are protected by the nonprofit's governance structure:\n\nAn obvious option, used by many organizations, was to let supporters sign up as members and have the members' votes control everything about the organization. We rejected that approach because it would have made the organization vulnerable to being taken over by people who disagreed with its mission... [A]ctivist organizations should be steady in their mission. Already in 1985, we could see that many of the people who appreciated the GNU Project's work (developing useful GNU software packages) did not support our goal and values. To look at software issues in terms of freedom ",
        "id": 1885262,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/11/2244246/why-the-fsf-is-structured-the-way-it-is?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why the FSF is Structured the Way It Is",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T22:43:46.875167+00:00",
        "description": "WordPress co-creator (and Automattic CEO) Matt Mullenweg \"has deactivated the accounts of several WordPress.org community members,\" reports TechCrunch, \"some of whom have been spearheading a push to create a new fork of the open source WordPress project.\"\n\n Joost de Valk &mdash; creator of WordPress-focused SEO tool Yoast (and former marketing and communications' lead for the WordPress Foundation) &mdash; last month published his \"vision for a new WordPress era,\" alluding to a potential fork in the form of \"federated and independent repositories.\" Karim Marucchi, CEO of enterprise web consulting firm Crowd Favorite, echoed these thoughts in a separate blog post. WP Engine indicated it was on standby to lend a corporate hand. Mullenweg, for his part, has publicly supported the notion of a new WordPress fork. \n\nBut when Automattic slashed its contributions to Wordpress.org, things heated up:\n\n This spurred de Valk to take to X.com on Friday to indicate that he was willing to lead on th",
        "id": 1885016,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/11/2129257/wordpressorg-accounts-deactivated-for-contributors-said-to-be-planning-a-fork---by-automattic-ceo?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WordPress.org Accounts Deactivated for Contributors Said to Be Planning a Fork - by Automattic CEO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T21:39:03.168924+00:00",
        "description": "Friday America's consumer watchdog agency \"proposed a rule to give virtual video game currencies protections similar to those of real-world bank accounts...\" reports the Washington Post, \"so players can receive refunds or compensation for unauthorized transactions, similar to how banks are required to respond to claims of fraudulent activity.\"\n\n\nThe Consumer Financial Protection Bureau is seeking public input on a rule interpretation to clarify which rights are protected and available to video game consumers under the Electronic Fund Transfer Act. It would hold video game companies subject to violations of federal consumer financial law if they fail to address financial issues reported by customers. The public comment period lasts from Friday through March 31. In particular, the independent federal agency wants to hear from gamers about the types of transactions they make, any issues with in-game currencies, and stories about how companies helped or denied help. \n\nThe effort is in re",
        "id": 1884755,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/11/0642227/should-in-game-currency-receive-federal-government-banking-protections?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Should In-Game Currency Receive Federal Government Banking Protections?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T20:33:03.179382+00:00",
        "description": "As the ecological disaster continues, CNN reports the Palisades Fire near Malibu, California has burned at least 22,660 acres, left 100,000 peope under evacuation orders, left at least 11 people dead and \"destroyed thousands of homes and other structures.\" From the last reports it was only 11% contained, and \"flames are now spreading east in the Mandeville Canyon area, approaching Interstate 405, one of LA's busiest freeways.\" \n\nBut the Atlantic's assistant editor wrote Friday that \"I have received 11 alerts. As far as I can tell, they were all sent in error.\"\n\nMy home is not in a mandatory evacuation zone or even a warning zone. It is, or is supposed to be, safe. Yet my family's phones keep blaring with evacuation notices, as they move in and out of service.... \n\nEarlier today, Kevin McGowan, the director of Los Angeles County's emergency-management office, acknowledged at a press conference that officials knew alerts like these had gone out, acknowledged some of them were wrong, an",
        "id": 1884561,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/11/1926225/californias-wildfires-livestreams-from-burning-homes-and-dire-text-messages---sometimes-erroneous?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "California's Wildfires: Livestreams from Burning Homes and Dire Text Messages - Sometimes Erroneous",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T19:29:19.961902+00:00",
        "description": "While CES wraps up this week, \"Not all innovation is good innovation,\" warns Elizabeth Chamberlain, iFixit's Director of Sustainability (heading their Right to Repair advocacy team). So this year the group held its fourth annual \"anti-awards ceremony\" to call out CES's \"least repairable, least private, and least sustainable products...\" (iFixit co-founder Kyle Wiens mocked a $2,200 \"smart ring\" with a battery that only lasts for 500 charges. \"Wanna open it up and change the battery? Well you can't! Trying to open it will completely destroy this device...\") There's also a category for the worst in security &mdash; plus a special award titled \"Who asked for this?\" &mdash; and then a final inglorious prize declaring \"the Overall Worst in Show...\" \n\nThursday their \"panel of dystopia experts\" livestreamed to iFixit's feed of over 1 million subscribers on YouTube, with the video's description warning about manufacturers \"hoping to convince us that they have invented the future. But will th",
        "id": 1884295,
        "language": null,
        "link": "https://news.slashdot.org/story/25/01/11/1748206/ces-worst-in-show-devices-mocked-in-ifixit-video---while-youtube-inserts-ads-for-them?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CES 'Worst In Show' Devices Mocked In IFixit Video - While YouTube Inserts Ads For Them",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T18:23:57.536705+00:00",
        "description": "An anonymous reader shared this report from CNN:\n\n\nNew intelligence has led two US intelligence agencies to conclude that it's possible a small number of mysterious health ailments colloquially termed as Havana Syndrome impacting spies, soldiers and diplomats around the world may have been caused by a \"novel weapon\" wielded by a foreign actor, according to intelligence officials and a new unclassified summary report released on Friday. However, the two agencies are in the minority and the broader intelligence community assessment remains that it is very unlikely that the symptoms were caused by a foreign actor, according to the unclassified report summary issued Friday &mdash; even as an official with the Office of the Director of National Intelligence [ODNI] emphasized that analysts cannot \"rule out\" the possibility in some small number of cases. \n\n The subtle, technocratic shift in the assessment over the cause of Havana Syndrome has reignited a bitter debate that has split US offi",
        "id": 1883994,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/11/069211/havana-syndrome-debate-rises-again-in-us-government?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Havana Syndrome' Debate Rises Again in US Government",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T17:18:05.479116+00:00",
        "description": "\"Microsoft's Digital Crimes Unit is taking legal action to ensure the safety and integrity of our AI services,\" according to a Friday blog post by the unit's assistant general counsel. Microsoft blames \"a foreign-based threat-actor group\" for \"tools specifically designed to bypass the safety guardrails of generative AI services, including Microsoft's, to create offensive and harmful content. \n\nMicrosoft \"is accusing three individuals of running a 'hacking-as-a-service' scheme,\" reports Ars Technica, \"that was designed to allow the creation of harmful and illicit content using the company's platform for AI-generated content\" after bypassing Microsoft's AI guardrails:\nThey then compromised the legitimate accounts of paying customers. They combined those two things to create a fee-based platform people could use. Microsoft is also suing seven individuals it says were customers of the service. All 10 defendants were named John Doe because Microsoft doesn't know their identity.... The thr",
        "id": 1883709,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/01/11/073210/foreign-cybercriminals-bypassed-microsofts-ai-guardrails-lawsuit-alleges?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Foreign Cybercriminals Bypassed Microsoft's AI Guardrails, Lawsuit Alleges",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T16:13:51.216341+00:00",
        "description": "\"What if they ban TikTok and people keep using it anyway?\" asks the New York Times, saying a pending ban in America \"is vague on how it would be enforced\"\n\nSome experts say that even if TikTok is actually banned this month or soon, there may be so many legal and technical loopholes that millions of Americans could find ways to keep TikTok'ing. The law is \"Swiss cheese with lots of holes in it,\" said Glenn Gerstell, a former top lawyer at the National Security Agency and a senior adviser at the Center for Strategic and International Studies, a policy research organization. \"There are obviously ways around it....\" When other countries ban apps, the government typically orders internet providers and mobile carriers to block web traffic to and from the blocked website or app. That's probably not how a ban on TikTok in the United States would work. Two lawyers who reviewed the law said the text as written doesn't appear to order internet and mobile carriers to stop people from using TikTo",
        "id": 1883363,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/11/0517244/what-if-they-ban-tiktok-and-people-keep-using-it-anyway?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'What If They Ban TikTok and People Keep Using It Anyway?'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T14:04:18.113299+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: On Saturday, Triplegangers CEO Oleksandr Tomchuk was alerted that his company's e-commerce site was down. It looked to be some kind of distributed denial-of-service attack. He soon discovered the culprit was a bot from OpenAI that was relentlessly attempting to scrape his entire, enormous site. \"We have over 65,000 products, each product has a page,\" Tomchuk told TechCrunch. \"Each page has at least three photos.\" OpenAI was sending \"tens of thousands\" of server requests trying to download all of it, hundreds of thousands of photos, along with their detailed descriptions. \"OpenAI used 600 IPs to scrape data, and we are still analyzing logs from last week, perhaps it's way more,\" he said of the IP addresses the bot used to attempt to consume his site. \"Their crawlers were crushing our site,\" he said \"It was basically a DDoS attack.\"\n \nTriplegangers' website is its business. The seven-employee company has spent over a decade assemblin",
        "id": 1882729,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/11/0449242/openais-bot-crushes-seven-person-companys-website-like-a-ddos-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI's Bot Crushes Seven-Person Company's Website 'Like a DDoS Attack'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T10:48:53.132896+00:00",
        "description": "Wikipedia's massive dataset helped researchers identify three styles of curiosity -- \"busybody,\" \"hunter,\" and \"dancer\" -- based on how users navigate its pages (see: wiki rabbit hole). These curiosity styles reflect broader social trends and highlight curiosity's role in connecting information rather than merely acquiring it. Scientific American reports: In this lexicon, a busybody traces a zigzagging route through many often distantly related topics. A hunter, in contrast, searches with sustained focus, moving among a relatively small number of closely related articles. A dancer links together highly disparate topics to try to synthesize new ideas. \"Curiosity actually works by connecting pieces of information, not just acquiring them,\" says University of Pennsylvania network scientist Dani Bassett, cosenior author on a recent study of these curiosity types in Science Advances. \"It's not as if we go through the world and pick up a piece of information and put it in our pockets like ",
        "id": 1881888,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/11/0427258/wikipedia-searches-reveal-differing-styles-of-curiosity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wikipedia Searches Reveal Differing Styles of Curiosity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T07:33:22.639333+00:00",
        "description": "SysEngineer shares a report from the Associated Press: A spacecraft has beamed back some of the best close-up photos yet of Mercury's north pole. The European and Japanese robotic explorer swooped as close as 183 miles (295 kilometers) above Mercury's night side before passing directly over the planet's north pole. The European Space Agency released the stunning snapshots Thursday, showing the permanently shadowed craters at the top of of our solar system's smallest, innermost planet. Cameras also captured views of neighboring volcanic plains and Mercury's largest impact crater, which spans more than 930 miles (1,500 kilometers).<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Spacecraft+Buzzes+Mercury's+North+Pole+and+Beams+Back+Stunning+Photos%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F25%2F01%2F11%2F0419232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.p",
        "id": 1881228,
        "language": null,
        "link": "https://science.slashdot.org/story/25/01/11/0419232/spacecraft-buzzes-mercurys-north-pole-and-beams-back-stunning-photos?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Spacecraft Buzzes Mercury's North Pole and Beams Back Stunning Photos",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T04:18:51.337994+00:00",
        "description": "An anonymous reader quotes a report from Axios: Meta's Mark Zuckerberg, in an appearance on the \"Joe Rogan Experience\" podcast, criticized the Biden administration for pushing for censorship around COVID-19 vaccines, the media for hounding Facebook to clamp down on misinformation after the 2016 election, and his own company for complying. Zuckerberg's three-hour interview with Rogan gives a clear window into his thinking during a remarkable week in which Meta loosened its content moderation policies and shut down its DEI programs.\n \nThe Meta CEO said a turning point for his approach to censorship came after Biden publicly said social media companies were \"killing people\" by allowing COVID misinformation to spread, and politicians started coming after the company from all angles. Zuckerberg told Rogan, who was a prominent skeptic of the COVID-19 vaccine, that the Biden administration would \"call up the guys on our team and yell at them and cursing and threatening repercussions if we d",
        "id": 1880745,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/01/10/2331238/zuckerberg-on-rogan-facebooks-censorship-was-something-out-of-1984?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Zuckerberg On Rogan: Facebook's Censorship Was 'Something Out of 1984'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T02:10:23.719206+00:00",
        "description": "Meta CEO Mark Zuckerberg criticized Apple's innovation record and business practices in a Joe Rogan podcast interview on January 10, claiming the iPhone maker has not \"invented anything great in a while\" and is \"just sitting\" on its flagship product 20 years after Steve Jobs created it. \n\nZuckerberg accused Apple of using arbitrary App Store rules and 30% developer fees to offset declining iPhone sales. He also said Apple blocks competitors from accessing iPhone protocols, citing Meta's failed attempt to integrate its Ray-Ban smart glasses with Apple's connectivity features. The Meta chief also criticized Apple's $3,500 Vision Pro headset, calling it inferior to Meta's $300-400 device.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Zuckerberg%3A+Apple+'Hasn't+Invented+Anything+Great+in+a+While'%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F01%2F11%2F0051258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><im",
        "id": 1880442,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/01/11/0051258/zuckerberg-apple-hasnt-invented-anything-great-in-a-while?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Zuckerberg: Apple 'Hasn't Invented Anything Great in a While'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T01:06:17.302793+00:00",
        "description": "TechCrunch's Rebecca Szkutak reports: TechCrunch recently surveyed 20 VCs who back startups building for enterprises about what gives an AI startup a moat, or what makes it different compared to its peers. More than half of the respondents said that the thing that will give AI startups an edge is the quality or rarity of their proprietary data. Paul Drews, a managing partner at Salesforce Ventures, told TechCrunch that it's really hard for AI startups to have a moat because the landscape is changing so quickly. He added that he looks for startups that have a combination of differentiated data, technical research innovation, and a compelling user experience.\n \nJason Mendel, a venture investor at Battery Ventures, agreed that technology moats are diminishing. \"I'm looking for companies that have deep data and workflow moats,\" Mendel told TechCrunch. \"Access to unique, proprietary data enables companies to deliver better products than their competitors, while a sticky workflow or user e",
        "id": 1880173,
        "language": null,
        "link": "https://slashdot.org/story/25/01/10/2126237/vcs-say-ai-companies-need-proprietary-data-to-stand-out?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "VCs Say AI Companies Need Proprietary Data To Stand Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-11T01:06:16.889260+00:00",
        "description": "Amazon said it is halting some of its diversity and inclusion initiatives, joining a growing list of major corporations that have made similar moves in the face of increasing public and legal scrutiny. From a report: In a Dec. 16 internal note to staffers that was obtained by CNBC, Candi Castleberry, Amazon's VP of inclusive experiences and technology, said the company was in the process of \"winding down outdated programs and materials\" as part of a broader review of hundreds of initiatives.\n\n\"Rather than have individual groups build programs, we are focusing on programs with proven outcomes -- and we also aim to foster a more truly inclusive culture,\" Castleberry wrote in the note, which was first reported by Bloomberg. Castleberry's memo doesn't say which programs the company is dropping as a result of its review. Further reading: Meta Kills DEI Programs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+To+H",
        "id": 1880172,
        "language": null,
        "link": "https://slashdot.org/story/25/01/11/0033231/amazon-to-halt-some-of-its-dei-programs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon To Halt Some of Its DEI Programs",
        "vote": 0
    }
]