[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T17:00:08+00:00",
        "description": "At $29.99, Wreckfest 2 is a hard sell in its current early access state and that's even with gameplay elements like the handling and crash physics feeling pretty good. It's probably the best possible advertisement for the original – if you're new, revisiting the past is ideal, especially with how much more content is offered. \n\nAs it stands, the sequel is neither good, bad, or average – it simply isn't much of anything right now beyond a foundation for what's to come. If you enjoyed the first one enough to support the sequel's development, then by all means, but it will be a while before it reaches the same lofty heights.",
        "id": 2383852,
        "language": null,
        "link": "https://www.youtube.com/watch?v=A3oJ-IjU7Rc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/A3oJ-IjU7Rc/hqdefault.jpg",
        "title": "WRECKFEST 2 Is Here, But It Still Has Ways To Go",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T14:00:24+00:00",
        "description": "The sequel to the beloved indie roguelike downhill biking game has some interesting twists up its sleeve. First is the complete omission of bikes and inclusion of two boarding sports: snowboarding and mountainboarding. \n\nThe demo gives us the first taste of the kind of physics and tricks the new boarding sports can supply, but we’re excited to test the particularly challenging downhill courses. Besides this core change-up, Descenders Next fuses the Career and Parks from the first game to make progression seamless and holistic.\n\nThe addictive pull of Descenders Next comes in the form of surviving the procedural trails long enough to reach the next safe zone, which vary between hand-crafted parks, shops, and the like.",
        "id": 2383131,
        "language": null,
        "link": "https://www.youtube.com/watch?v=GkjuV-wd7A8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GkjuV-wd7A8/hqdefault.jpg",
        "title": "15 New Cool Features In DESCENDERS NEXT I Can't Wait To Check Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T09:30:10+00:00",
        "description": "With slick combat, endlessly enjoyable stealth, and excellent traversal mechanics, there’s a lot to love about Assassin's Creed Shadows, but arguably, the action RPG’s biggest strengths lie in its setting. \n\nDelivering memorable maps is, of course, something that the genre has always been known for, but it’s hard to shake the thought that Shadows might very well be one of the series’ best designed maps. \n\nNot only is its rendition of feudal Japan absolutely stunning to look at– made even more impressive by the variety it boasts – it’s also immaculately designed, a joy to traverse, and not unreasonably stuffed with content likesome past Assassin’s Creed games have been.",
        "id": 2381657,
        "language": null,
        "link": "https://www.youtube.com/watch?v=TF_-hr3unAY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TF_-hr3unAY/hqdefault.jpg",
        "title": "Hate It or Like It, You Can't Ignore This ONE THING In Assassin's Creed Shadows",
        "vote": 0
    }
]