[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T23:05:29+00:00",
        "description": "\"China is considering trying to blunt greater U.S. tariffs and other trade barriers,\" reports the Wall Street Journal, \"by offering to curb the quantity of certain goods exported to the U.S., according to advisers to the Chinese government.\"\nTokyo's adoption of so-called voluntary export restraints, or VERs, to limit its auto shipments to the U.S. in the 1980s helped prevent Washington from imposing higher import duties. A similar move from Beijing, especially in sectors of key concern to Washington, like electric vehicles and batteries, would mitigate criticism from the U.S. and others over China's \"economic imbalances\": heavily subsidized companies making stuff for slim profits but saturating global markets, to the detriment of other countries' manufacturers... \n\nThe Xi leadership has indicated a desire to cut a deal with the Trump administration to head off greater trade attacks... Similar to Japan, the Chinese advisers say, Beijing may also consider negotiating export restraints ",
        "id": 2385305,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/03/22/2227218/china-explores-limiting-its-evs-and-battery-exports-for-us-tariff-negotiations?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Explores Limiting Its EVs and Battery Exports For US Tariff Negotiations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T21:56:21+00:00",
        "description": "Besides administering standardized pre-college tests, America's nonprofit College Board designs college-level classes that high school students can take. But now they're also crafting courses \"not just with higher education at the table, but industry partners such as the U.S. Chamber of Commerce and the technology giant IBM,\" reports Education Week. \n\n\"The organization hopes the effort will make high school content more meaningful to students by connecting it to in-demand job skills.\"\n\n It believes the approach may entice a new kind of AP student: those who may not be immediately college-bound.... The first two classes developed through this career-driven model &mdash; dubbed AP Career Kickstart &mdash; focus on cybersecurity and business principles/personal finance, two fast-growing areas in the workforce.\" Students who enroll in the courses and excel on a capstone assessment could earn college credit in high school, just as they have for years with traditional AP courses in subject",
        "id": 2385122,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/22/2112245/americas-college-board-launches-ap-cybersecurity-course-for-non-college-bound-students?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's College Board Launches AP Cybersecurity Course For Non-College-Bound Students",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T20:51:29+00:00",
        "description": "The governments of Australia, Canada, Cyprus, Denmark, Israel, and Singapore \"are likely customers of Israeli spyware maker Paragon Solutions,\" reports TechCrunch, \"according to a new technical report by a renowned digital security lab.\"\n\n\n\nOn Wednesday, The Citizen Lab, a group of academics and security researchers housed at the University of Toronto that has investigated the spyware industry for more than a decade, published a report about the Israeli-founded surveillance startup, identifying the six governments as \"suspected Paragon deployments.\" \n\nAt the end of January, WhatsApp notified around 90 users that the company believed were targeted with Paragon spyware, prompting a scandal in Italy, where some of the targets live... Paragon's executive chairman John Fleming told TechCrunch that the company \"licenses its technology to a select group of global democracies &mdash; principally, the United States and its allies.\" Israeli news outlets reported in late 2024 that U.S. venture ",
        "id": 2384830,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/22/0459224/six-countries-named-as-likely-purchasers-of-paragons-cellphone-spyware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Six Countries Named as 'Likely' Purchasers of Paragon's Cellphone Spyware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T19:46:30+00:00",
        "description": "This week the \"Old Vintage Computing Research\" blog published a 21,000-word exploration of the DEC PDP-11, the 16-bit minicomputer sold by Digital Equipment Corporation. Slashdot reader AndrewZX calls the blog post \"an excellent deep dive\" into the machine's history and capabilities \"and the classic Venix UNIX that it ran.\" The blogger still owns a working 1984 DEC Professional 380, \"a tank of a machine, a reasonably powerful workstation, and the most practical PDP-adjacent thing you can actually slap on a (large) desk.\" \n\nBut more importantly, \"It runs PRO/VENIX, the only official DEC Unix option for the Pros.\"\n In that specific market it was almost certainly the earliest such licensed Unix (in 1983) and primarily competed against XENIX, Microsoft's dominant \"small Unix,\" which first emerged for XT-class systems as SCO XENIX in 1984. You'd wonder how rogue processes could be prevented from stomping on each other in such systems when neither the Intel 8086/8088 nor the IBM PC nor the",
        "id": 2384521,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/22/1927247/rebooting-a-retro-pdp-11-workstation---and-its-classic-venix-unix?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Rebooting A Retro PDP-11 Workstation - and Its Classic 'Venix' UNIX",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T19:46:30+00:00",
        "description": "Was the cutting of undersea cables part of a larger pattern? Russia and its proxies are accused by western officials of \"staging dozens of attacks and other incidents across Europe since the invasion of Ukraine three years ago,\" reports the Associated Press. \n\nThat includes cyberattacks and committing acts of sabotage/vandalism/arson, as well as spreading propaganda and even plotting killings, according to the article. (\"Western intelligence agencies uncovered what they said was a Russian plot to kill the head of a major German arms manufacturer that is a supplier of weapons to Ukraine...\") The news agency documented 59 incidents \"in which European governments, prosecutors, intelligence services or other Western officials blamed Russia, groups linked to Russia or its ally Belarus.\"\n\n[Western officials] allege the disruption campaign is an extension of Russian President Vladimir Putin's war, intended to sow division in European societies and undermine support for Ukraine... The incide",
        "id": 2384522,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/22/1821200/was-undersea-cable-sabotage-part-of-a-larger-pattern?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Was Undersea Cable Sabotage Part of a Larger Pattern?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T18:20:48+00:00",
        "description": "Slashdot reader Required Snark shared this article from Phys.org:\n\n\nIn the realm of science fiction, [sun-energy capturing] Dyson spheres and ringworlds have been staples for decades. But it is well known that the simplest designs are unstable against gravitational forces and would thus be torn apart. Now a scientist from Scotland, UK has shown that certain configurations of these objects near a two-mass system can be stable against such fractures... \n\n\n[A] rigid ring around a star or planet, as in Larry Niven's \"Ringworld\" series of novels, is also unstable, as it would drift under any slight gravitational differences and collide with the star. So [engineering science professor Colin] McInnes considered a restricted three-body problem where two equal masses orbit each other circularly with a uniform ring of infinitesimal mass rotating in their orbital plane. The ring could enclose both masses, just one or none... McInnes also investigated a shell-restricted three-body problem with t",
        "id": 2384146,
        "language": null,
        "link": "https://science.slashdot.org/story/25/03/22/0414254/surprisingly-some-dyson-spheres-and-ringworlds-can-be-stable?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Surprisingly, Some Dyson Spheres and Ringworlds Can Be Stable",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T17:15:05+00:00",
        "description": "\"I intend to sue the National Archives,\" said Joseph diGenova, an 80-year-old former Trump campaign lawyer (and a U.S. Attorney from 1983 to 1988). While releasing 63,000 unredacted pages about the 1963 assassination of President Kennedy, the U.S. government erroneously \"made public the Social Security numbers and other sensitive personal information of potentially hundreds of former congressional staffers and other people,\" reports USA Today. (\"It is virtually impossible to tell the scope of the breach because the National Archives put them online without a way to search them by keyword, some JFK files experts and victims of the information release told USA TODAY...\") \n\nMark Zaid, a national security lawyer who represented current and former spies and other officials in cases against the government, told USA Today that he \"saw a few names I know and I informed them of the breach... Hundreds were doxxed but of that number I don't know how many are still living.\"\n\nZaid, who has fought",
        "id": 2383823,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/22/0237216/us-release-of-unredacted-jfk-files-doxxed-officials-including-social-security-numbers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Release of Unredacted JFK Files 'Doxxed' Officials, Including Social Security Numbers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T16:10:02+00:00",
        "description": "Founded in 1979, the Association for the Advancement of AI is an international scientific society. Recently 25 of its AI researchers surveyed 475 respondents in the AAAI community about \"the trajectory of AI research\" &mdash; and their results were surprising. \n\n Futurism calls the results \"a resounding rebuff to the tech industry's long-preferred method of achieving AI gains\" &mdash; namely, adding more hardware:\n\n\nYou can only throw so much money at a problem. This, more or less, is the line being taken by AI researchers in a recent survey. Asked whether \"scaling up\" current AI approaches could lead to achieving artificial general intelligence (AGI), or a general purpose AI that matches or surpasses human cognition, an overwhelming 76 percent of respondents said it was \"unlikely\" or \"very unlikely\" to succeed... \n\n\"The vast investments in scaling, unaccompanied by any comparable efforts to understand what was going on, always seemed to me to be misplaced,\" Stuart Russel, a computer",
        "id": 2383450,
        "language": null,
        "link": "https://slashdot.org/story/25/03/22/0341222/majority-of-ai-researchers-say-tech-industry-is-pouring-billions-into-a-dead-end?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Majority of AI Researchers Say Tech Industry Is Pouring Billions Into a Dead End",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T15:04:15+00:00",
        "description": "Two \"groundbreaking research reports\" on open source security were announced this week by the Linux Foundation in partnership with the Open Source Security Foundation (OpenSSF) and Linux Foundation Europe. The reports specifically address the EU's Cyber Resilience Act (or CRA) and \"highlight knowledge gaps and best practices for CRA compliance.\" \n\n\"Unaware and Uncertain: The Stark Realities of CRA-Readiness in Open Source\" includes a survey which found that when it comes to CRA requirements, 62% of respondents were either \"not familiar at all\" (36%) or \"slightly familiar\" (26%) &mdash; while 51% weren't sure about its deadlines. (\"Only 28% correctly identified 2027 as the target year for full compliance,\" according to one infographic, which adds that CRA \"is expected to drive a 6% average price increase, though 53% of manufacturers are still assessing pricing impacts.\")\n\nManufacturers, who bear primary responsibility, lack readiness &mdash; many [46%] passively rely on upstream secur",
        "id": 2383106,
        "language": null,
        "link": "https://news.slashdot.org/story/25/03/21/0212206/unaware-and-uncertain-report-finds-widespread-unfamiliarity-with-2027s-eu-cyber-resilience-requirements?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Unaware and Uncertain':  Report Finds Widespread Unfamiliarity With 2027's EU Cyber Resilience Requirements",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T13:57:24+00:00",
        "description": "Computer programming jobs in the US have declined by more than a quarter over the past two years, placing the profession among the 10 hardest-hit occupations of 420-plus jobs tracked by the Bureau of Labor Statistics and potentially signaling the first concrete evidence of artificial intelligence replacing workers. \n\nThe timing coincides with OpenAI's release of ChatGPT in late 2022. Anthropic researchers found people use AI to perform programming tasks more than those of any other job, though 57 percent of users employ AI to augment rather than automate work. \"Without getting hysterical, the unemployment jump for programming really does look at least partly like an early, visible labor market effect of AI,\" said Mark Muro of the Brookings Institution. \n\nWhile software developer positions have remained stable with only a 0.3 percent decline, programmers who perform more routine coding from specifications provided by others have seen their ranks diminish to levels not seen since 1980.",
        "id": 2382801,
        "language": null,
        "link": "https://developers.slashdot.org/story/25/03/22/1211202/us-programming-jobs-plunge-275-in-two-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Programming Jobs Plunge 27.5% in Two Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T11:47:29+00:00",
        "description": "Apple's latest iOS 18.3.2 update is automatically re-enabling its Apple Intelligence feature even for users who previously disabled it, adding to mounting concerns about the company's AI strategy. \n\nThe update presents a splash screen with no option except to tap \"Continue,\" which activates the feature. Users must then manually disable it through settings, with the AI consuming up to 7GB of storage space. This forced activation comes amid broader troubles with Apple's AI initiatives.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+iOS+Update+Re-Enables+Apple+Intelligence+For+Users+Who+Had+Turned+It+Off%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F22%2F1125225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F25%2F03%2F22%2F1125225%2Fnew-ios-update-r",
        "id": 2382175,
        "language": null,
        "link": "https://slashdot.org/story/25/03/22/1125225/new-ios-update-re-enables-apple-intelligence-for-users-who-had-turned-it-off?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New iOS Update Re-Enables Apple Intelligence For Users Who Had Turned It Off",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T09:36:56+00:00",
        "description": "The French National Assembly has rejected a controversial provision that would have forced messaging platforms like Signal and WhatsApp to allow government access to encrypted private conversations, lawmakers voted Thursday night. The measure, embedded within anti-drug trafficking legislation, would have implemented a \"ghost participant model\" allowing law enforcement to silently join encrypted chats without users' knowledge.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=France+Rejects+Backdoor+Mandate%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F03%2F22%2F0855215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F03%2F22%2F0855215%2Ffrance-rejects-backdoor-mandate%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/f",
        "id": 2381646,
        "language": null,
        "link": "https://it.slashdot.org/story/25/03/22/0855215/france-rejects-backdoor-mandate?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "France Rejects Backdoor Mandate",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T07:27:20+00:00",
        "description": "London's Heathrow Airport resumed operations late Friday after an electrical fire at a nearby substation forced a full-day closure, causing global travel chaos with hundreds of canceled flights and thousands of stranded passengers. The explosion at a Hayes substation 1.5 miles from the airport knocked out power early Thursday, requiring 70 firefighters to battle a blaze in a transformer containing 25,000 liters of cooling oil. \n\nDespite backup generators, Europe's busiest airport couldn't maintain normal operations, forcing flights to divert to airports across Europe and as far as Bangor, Maine. \"Contingencies of certain sizes we cannot guard ourselves against 100%,\" Heathrow CEO Thomas Woldbye told the BBC. \"This is as big as it gets for our airport.\" British Airways, which planned to carry 100,000 passengers Friday, prioritized long-haul flights to Australia, Brazil and South Africa when operations resumed after 4 p.m.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a ",
        "id": 2381166,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/22/010205/how-an-electrical-fire-shut-down-heathrow-and-upended-global-air-travel?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "How an Electrical Fire Shut Down Heathrow and Upended Global Air Travel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T05:16:39+00:00",
        "description": "Web infrastructure provider Cloudflare unveiled \"AI Labyrinth\" this week, a feature designed to thwart unauthorized AI data scraping by feeding bots realistic but irrelevant content instead of blocking them outright. The system lures crawlers into a \"maze\" of AI-generated pages containing neutral scientific information, deliberately wasting computing resources of those attempting to collect training data for language models without permission. \n\n\"When we detect unauthorized crawling, rather than blocking the request, we will link to a series of AI-generated pages that are convincing enough to entice a crawler to traverse them,\" Cloudflare explained. The company reports AI crawlers generate over 50 billion requests to their network daily, comprising nearly 1% of all web traffic they process. The feature is available to all Cloudflare customers, including those on free plans. This approach marks a shift from traditional protection methods, as Cloudflare claims blocking bots sometimes a",
        "id": 2380815,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/03/22/014247/cloudflare-turns-ai-against-itself-with-endless-maze-of-irrelevant-facts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cloudflare Turns AI Against Itself With Endless Maze of Irrelevant Facts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T02:02:05+00:00",
        "description": "Amazon CEO Andy Jassy is pushing to cut bureaucracy by reducing management layers, according to a recording of a recent internal all-hands meeting obtained by Business Insider. Amazon plans to increase the ratio of individual contributors to managers by 15% by March-end, a process the company says is now complete and affected a \"relatively small subset of employees.\" \n\n\"The way to get ahead at Amazon is not to go accumulate a giant team and fiefdom,\" Jassy told employees, stressing that successful leaders \"get the most done with the least amount of resources.\" Jassy has established a \"No Bureaucracy\" email alias that has received over a thousand suggestions, leading to more than 375 changes aimed at speeding operations. \"It's a meritocracy,\" Jassy said, urging employees to \"move fast and act like owners.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+CEO+Criticizes+Manager+Fiefdoms+and+Stresses+the+Need+For",
        "id": 2380336,
        "language": null,
        "link": "https://slashdot.org/story/25/03/22/018254/amazon-ceo-criticizes-manager-fiefdoms-and-stresses-the-need-for-meritocracy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon CEO Criticizes Manager Fiefdoms and Stresses the Need For 'Meritocracy'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-03-22T02:02:05+00:00",
        "description": "Hollywood filmmaker Carl Erik Rinsch has been charged with defrauding Netflix of $11 million after allegedly misusing funds intended for an unfinished science fiction series, federal prosecutors said. \n\nRinsch, 47, was arrested in West Hollywood this week on charges of wire fraud, money laundering and unlawful monetary transactions that could result in decades of imprisonment if convicted. The FBI and Acting U.S. Attorney for the Southern District of New York allege Rinsch diverted funds meant for his series \"Conquest\" to speculate on cryptocurrency, stay in luxury hotels and purchase high-end items including five Rolls-Royces and a Ferrari. \n\nNetflix had paid Rinsch $44 million between 2018 and 2019 for the science fiction project about an artificial humanlike species. Prosecutors say he then requested an additional $11 million but never completed the production. An arbitrator ruled in Netflix's favor last year, ordering Rinsch to pay the company $11.8 million. Rinsch appeared in fe",
        "id": 2380337,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/03/21/2343252/director-charged-with-netflix-fraud-after-splurging-on-crypto-instead-of-finishing-sci-fi-series?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Director Charged With Netflix Fraud After Splurging on Crypto Instead of Finishing Sci-fi Series",
        "vote": 0
    }
]