[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T23:56:20.130878+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T23:56:19+00:00",
        "description": "A new investigation reveals that children as young as five can easily access inappropriate content and interact unsupervised with adults on Roblox, despite the platform's child-friendly image and recent safety updates. The Guardian reports: Describing itself as \"the ultimate virtual universe,\" Roblox features millions of games and interactive environments, known collectively as \"experiences.\" Some of the content is developed by Roblox, but much of it is user-generated. In 2024, the platform had more than 85 million daily active users, an estimated 40% of whom are under 13. While the company said it \"deeply sympathized\" with parents whose children came to harm on the platform, it said \"tens of millions of people have a positive, enriching and safe experience on Roblox every day.\"\n \nHowever, in an investigation shared with the Guardian, the digital-behavior experts Revealing Reality discovered \"something deeply disturbing ... a troubling disconnect between Roblox's child-friendly appear",
        "id": 2558791,
        "language": null,
        "link": "https://games.slashdot.org/story/25/04/14/2259206/risks-to-children-playing-roblox-deeply-disturbing-say-researchers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Risks To Children Playing Roblox 'Deeply Disturbing,' Say Researchers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T23:56:19.981469+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T23:56:19+00:00",
        "description": "Samsung has paused the global rollout of its One UI 7 update after a serious bug was reported that prevented some Galaxy S24 owners from unlocking their phones. The Verge reports: While the complaints seem to have specifically come from South Korean owners of Galaxy S24 series handsets, Samsung has played it safe and paused the rollout across all models worldwide. While some users will have already downloaded the update to One UI 7, using the app CheckFirm we've confirmed that the update is no longer listed on Samsung's servers as the latest firmware version across several Galaxy devices, with older patches appearing instead. Samsung hasn't confirmed the pause in the rollout, nor plans to issue a fix for users who have already downloaded the One UI 7 update. We've reached out to the company for comment.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Samsung+Pauses+One+UI+7+Rollout+Worldwide%3A+https%3A%2F%2Fmobile.s",
        "id": 2558790,
        "language": null,
        "link": "https://mobile.slashdot.org/story/25/04/14/236246/samsung-pauses-one-ui-7-rollout-worldwide?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Samsung Pauses One UI 7 Rollout Worldwide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T22:51:14.280079+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T22:51:14+00:00",
        "description": "Intel will sell a 51% stake in its Altera programmable chip unit to private equity firm Silver Lake for $4.46 billion, aiming to cut costs, raise cash, and streamline the company's focus as it shifts toward becoming a contract chip manufacturer. CNBC reports: The deal, announced on Monday, values Altera at $8.75 billion, a sharp decline from the $17 billion Intel paid in 2015. [...] Since last year, Intel has taken steps to spin Altera out as a separate unit and said it planned to sell a portion of its stake. \"Today's announcement reflects our commitment to sharpening our focus, lowering our expense structure and strengthening our balance sheet,\" [CEO Lip-Bu Tan], who took the helm after former top boss Pat Gelsinger's ouster, said.\n \nAltera makes programmable chips that can be used for various purposes from telecom equipment to military. Reuters had first reported in November that Silver Lake was among potential suitors competing for a minority stake in Altera. The deal is expected t",
        "id": 2558492,
        "language": null,
        "link": "https://slashdot.org/story/25/04/14/1943245/intel-to-sell-majority-stake-in-altera-for-446-billion-to-fund-revival-effort?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel To Sell Majority Stake In Altera For $4.46 Billion To Fund Revival Effort",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T21:46:04.390416+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T21:46:03+00:00",
        "description": "Several crosswalk buttons in Palo Alto and nearby cities were hacked over the weekend to play deepfake-style satirical audio clips mimicking Elon Musk and Mark Zuckerberg. Authorities have disabled the altered systems, but the identity of the prankster remains unknown. SFGATE reports: Videos of the altered crosswalks began circulating on social media throughout Saturday and Sunday. [...] A city employee was the first to report an issue with one of the signals at University Avenue and High Street in downtown Palo Alto, Horrigan-Taylor told SFGATE via email. Officials later discovered that as many as 12 intersections in downtown Palo Alto had been affected.\n \n\"The impact is isolated,\" Horrigan-Taylor said. \"Signal operations are otherwise unaffected, and motorists are reminded to always exercise caution around pedestrians.\" Officials told the outlet they've removed any devices that were tampered with and the compromised voice-over systems have since been disabled, with footage obtained ",
        "id": 2558123,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/14/1932207/hacked-crosswalks-in-bay-area-play-deepfake-style-messages-from-tech-billionaires?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hacked Crosswalks In Bay Area Play Deepfake-Style Messages From Tech Billionaires",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T21:46:04.268771+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T21:46:03+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: British laws restricting what the police can say about criminal cases are \"not fit for the social media age (source paywalled; alternative source),\" a government committee said in a report released Monday in Britain that highlighted how unchecked misinformation stoked riots last summer. Violent disorder, fueled by the far right, affected several towns and cities for days after a teenager killed three girls on July 29 at a Taylor Swift-themed dance class in Southport, England. In the hours after the stabbings, false claims that the attacker was an undocumented Muslim immigrant spread rapidly online. In a report looking into the riots, a parliamentary committee said a lack of information from the authorities after the attack \"created a vacuum where misinformation was able to grow.\" The report blamed decades-old British laws, aimed at preventing jury bias, that stopped the police from correcting false claims. By the time the po",
        "id": 2558122,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/14/1937244/uk-laws-are-not-fit-for-social-media-age?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Laws Are Not 'Fit For Social Media Age'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T20:41:03.285750+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T20:41:03+00:00",
        "description": "Meta said the company plans to start using data collected from its users in the European Union to train its AI systems. Engadget reports: Starting this week, the tech giant will begin notifying Europeans through email and its family of apps of the fact, with the message set to include an explanation of the kind of data it plans to use as part of the training. Additionally, the notification will link out to a form users can complete to opt out of the process. \"We have made this objection form easy to find, read, and use, and we'll honor all objection forms we have already received, as well as newly submitted ones,\" says Meta.\n \nThe company notes it will only use data it collects from public posts and Meta AI interactions for training purposes. It won't use private messages in its training sets, nor any interactions, public or otherwise, made by users under the age of 18. As for why the company wants to start using EU data now, it claims the information will allow it to fine tune its fu",
        "id": 2557720,
        "language": null,
        "link": "https://meta.slashdot.org/story/25/04/14/1926259/meta-starts-using-data-from-eu-users-to-train-its-ai-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Starts Using Data From EU Users To Train Its AI Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T20:41:03.431777+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T20:41:03+00:00",
        "description": "An anonymous reader quotes a report from DefenseScoop: NATO announced Monday that it has awarded a contract to Palantir to adopt its Maven Smart System for artificial intelligence-enabled battlefield operations. Through the contract, which was finalized March 25, the NATO Communications and Information Agency (NCIA) plans to use a version of the AI system -- Maven Smart System NATO -- to support the transatlantic military organization's Allied Command Operations strategic command. NATO plans to use the system to provide \"a common data-enabled warfighting capability to the Alliance, through a wide range of AI applications -- from large language models (LLMs) to generative and machine learning,\" it said in a release, ultimately enhancing \"intelligence fusion and targeting, battlespace awareness and planning, and accelerated decision-making.\" [...] NATO's Allied Command Operations will begin using Maven within the next 30 days, the organization said Monday, adding that it hopes that usin",
        "id": 2557721,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/14/1917246/nato-inks-deal-with-palantir-for-maven-ai-system?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NATO Inks Deal With Palantir For Maven AI System",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T19:20:00.731396+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T19:20:00+00:00",
        "description": "The European Commission is issuing burner phones and basic laptops to some US-bound staff to avoid the risk of espionage [non-paywalled source], a measure traditionally reserved for trips to China. Financial Times: Commissioners and senior officials travelling to the IMF and World Bank spring meetings next week have been given the new guidance, according to four people familiar with the situation. They said the measures replicate those used on trips to Ukraine and China, where standard IT kit cannot be brought into the countries for fear of Russian or Chinese surveillance. \n\n\"They are worried about the US getting into the commission systems,\" said one official. The treatment of the US as a potential security risk highlights how relations have deteriorated since the return of Donald Trump as US president in January. Trump has accused the EU of having been set up to \"screw the US\" and announced 20 per cent so-called reciprocal tariffs on the bloc's exports, which he later halved for a 9",
        "id": 2557187,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/04/14/1814239/eu-issues-us-bound-staff-with-burner-phones-over-spying-fears?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EU Issues US-bound Staff With Burner Phones Over Spying Fears",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T19:20:00.624319+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T19:20:00+00:00",
        "description": "VMware has resumed offering a free hypervisor. News of the offering emerged in a throwaway line in the Release Notes for version 8.0 Update 3e of the Broadcom business unit's ESXi hypervisor. From a report: Just below the \"What's New\" section of that document is the statement: \"Broadcom makes available the VMware vSphere Hypervisor version 8, an entry-level hypervisor. You can download it free of charge from the Broadcom Support portal.\" \n\nVMware offered a free version of ESXi for years, and it was beloved by home lab operators and vAdmins who needed something to tinker with. But in February 2024, VMware discontinued it on grounds that it was dropping perpetual licenses and moving to subscriptions.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=VMware+Revives+Its+Free+ESXi+Hypervisor%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F25%2F04%2F14%2F1851214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://",
        "id": 2557186,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/14/1851214/vmware-revives-its-free-esxi-hypervisor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "VMware Revives Its Free ESXi Hypervisor",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T18:15:03.388480+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T18:15:01+00:00",
        "description": "OpenAI unveiled its GPT-4.1 model family on Monday, prioritizing coding capabilities and instruction following while expanding context windows to 1 million tokens -- approximately 750,000 words. The lineup includes standard GPT-4.1, GPT-4.1 mini, and GPT-4.1 nano variants, all available via API but not ChatGPT. \n\nThe flagship model scores 54.6% on SWE-bench Verified, lagging behind Google's Gemini 2.5 Pro (63.8%) and Anthropic's Claude 3.7 Sonnet (62.3%) on the same software engineering benchmark, according to TechCrunch. However, it achieves 72% accuracy on Video-MME's long video comprehension tests -- a significant improvement over GPT-4o's 65.3%. \n\nOpenAI simultaneously announced plans to retire GPT-4.5 -- their largest model released just two months ago -- from API access by July 14. The company claims GPT-4.1 delivers \"similar or improved performance\" at substantially lower costs. Pricing follows a tiered structure: GPT-4.1 costs $2 per million input tokens and $8 per million out",
        "id": 2556698,
        "language": null,
        "link": "https://slashdot.org/story/25/04/14/1726250/openai-unveils-coding-focused-gpt-41-while-phasing-out-gpt-45?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Unveils Coding-Focused GPT-4.1 While Phasing Out GPT-4.5",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T16:08:55.626471+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T16:08:55+00:00",
        "description": "Blue Origin's New Shepard completed its 31st mission Monday morning, carrying the first all-female crew to space since Soviet cosmonaut Valentina Tereshkova's 1963 solo flight. The NS-31 mission lifted off from West Texas at 9:30 a.m. EDT, with hundreds of thousands watching via livestream as the autonomous vehicle crossed the Karman line 62 miles above Earth. \n\nThe 10-minute suborbital journey carried six passengers: journalist and Bezos' fiancee Lauren S&#195;nchez, former NASA scientist Aisha Bowe, bioastronautics researcher Amanda Nguyen, CBS journalist Gayle King, pop star Katy Perry, and film producer Kerianne Flynn. Bowe conducted three research experiments during the flight, while Nguyen became the first Vietnamese and Southeast Asian woman in space. The fully reusable New Shepard system features a pressurized capsule that separates from its booster before returning to Earth with three parachutes.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" ",
        "id": 2555516,
        "language": null,
        "link": "https://science.slashdot.org/story/25/04/14/1512214/blue-origin-sends-all-female-crew-to-edge-of-space-in-historic-flight?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Blue Origin Sends All-Female Crew To Edge of Space in Historic Flight",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T16:08:55.484516+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T16:08:55+00:00",
        "description": "An anonymous reader shares a report: Requests to remove books from library shelves are on the rise in the UK, as the influence of pressure groups behind book bans in the US crosses the Atlantic, according to those working in the sector. Although \"the situation here is nowhere [near] as bad, censorship does happen and there are some deeply worrying examples of library professionals losing their jobs and being trolled online for standing up for intellectual freedom on behalf of their users,\" said Louis Coiffait-Gunn, CEO of the Chartered Institute of Library and Information Professionals (Cilip). \n\nEd Jewell, president of Libraries Connected, an independent charity that represents public libraries, said: \"Anecdotal evidence from our members suggests that requests to remove books are increasing.\" The School Library Association (SLA) said this year has seen an \"increase in member queries about censorship.\" Most of the UK challenges appear to come from individuals or small groups, unlike i",
        "id": 2555515,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/14/1538206/librarians-in-uk-increasingly-asked-to-remove-books?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Librarians in UK Increasingly Asked To Remove Books",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T15:05:58.829364+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T15:05:58+00:00",
        "description": "An anonymous reader shares a report: An attorney for the Federal Trade Commission told a judge that Facebook, fearing the competitive threat of Instagram posted to their social media network, acquired both as a way to \"neutralize\" the rival. \"They decided that competition was too hard,\" the FTC's attorney, Daniel Matheson, said in his opening statement in the government's antitrust case against the Meta Platforms social media empire. \n\nHe argued that with Meta's monopoly in social media, \"consumers do not have reasonable alternatives they can turn to,\" even as satisfaction has declined. At stake is the potential breakup of Facebook-parent Meta, as the government has zeroed in on the 2012 acquisition of Instagram and 2014 purchase of WhatsApp.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Facebook+Sought+To+'Neutralize'+Competitive+Threats%2C+FTC+Argues+As+Landmark+Antitrust+Trial+Begins%3A+https%3A%2F%2Ftech.slashd",
        "id": 2554868,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/14/1439241/facebook-sought-to-neutralize-competitive-threats-ftc-argues-as-landmark-antitrust-trial-begins?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Facebook Sought To 'Neutralize' Competitive Threats, FTC Argues As Landmark Antitrust Trial Begins",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T15:05:59.056310+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T15:05:58+00:00",
        "description": "Nvidia has announced plans to manufacture AI supercomputers entirely within the United States, commissioning over 1 million square feet of manufacturing space across Arizona and Texas. Production of Blackwell chips has begun at TSMC's Phoenix facilities, while supercomputer assembly will occur at new Foxconn and Wistron plants in Houston and Dallas respectively. \n\n\"The engines of the world's AI infrastructure are being built in the United States for the first time,\" said Jensen Huang, Nvidia's founder and CEO. \"Adding American manufacturing helps us better meet the incredible and growing demand for AI chips and supercomputers, strengthens our supply chain and boosts our resiliency.\" \n\nThe company will deploy its own AI, robotics, and digital twin technologies in these facilities, using Nvidia Omniverse to create digital twins of factories and Isaac GR00T to build manufacturing automation robots. Nvidia projects an ambitious $500 billion in domestic AI infrastructure production over th",
        "id": 2554869,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/14/1352243/nvidia-to-make-ai-supercomputers-in-us-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia To Make AI Supercomputers in US for First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T14:01:26.731513+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T14:01:26+00:00",
        "description": "Nvidia announced plans to manufacture AI supercomputers entirely within the United States, commissioning over 1 million square feet of manufacturing space across Arizona and Texas. Production of Blackwell chips has begun at TSMC's Phoenix facilities, while supercomputer assembly will occur at new Foxconn and Wistron plants in Houston and Dallas respectively. \n\n\"The engines of the world's AI infrastructure are being built in the United States for the first time,\" said Jensen Huang, Nvidia's founder and CEO. \"Adding American manufacturing helps us better meet the incredible and growing demand for AI chips and supercomputers, strengthens our supply chain and boosts our resiliency.\" \n\nThe company will deploy its own AI, robotics, and digital twin technologies in these facilities, using Nvidia Omniverse to create digital twins of factories and Isaac GR00T to build manufacturing automation robots. Nvidia projects an ambitious $500 billion in domestic AI infrastructure production over the ne",
        "id": 2554198,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/14/1352243/nvidia-to-make-american-made-ai-supercomputers-in-us-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia To Make American-Made AI Supercomputers in US for First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T12:24:49.970729+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T12:24:49+00:00",
        "description": "America's Department of Energy launched a federally funded R&amp;D center in 1946 called the Argonne National Laboratory, and its research became the basis for all of the world's commercial nuclear reactors. \n\nBut it's now developed an AI-based tool that can \"help operators run nuclear plants,\" reports the Wall Street Journal, citing comments from a senior nuclear engineer in the lab's nuclear science and engineering division:\nArgonne's plan is to offer the Parameter-Free Reasoning Operator for Automated Identification and Diagnosis, or PRO-AID, to new, tech-forward nuclear builds, but it's also eyeing the so-called dinosaurs, some of which are being resurrected by companies like Amazon and Microsoft to help power their AI data centers. The global push for AI is poised to fuel a sharp rise in electricity demand, with consumption from data centers expected to more than double by the end of the decade, the International Energy Agency said Thursday. The owners of roughly a third of U.S. ",
        "id": 2553595,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/04/14/0154240/can-ai-help-manage-nuclear-reactors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Can AI Help Manage Nuclear Reactors?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T08:05:12.060034+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T08:05:11+00:00",
        "description": "Formula One cars, the world's fastest racecars, need to grip the track for speed and safety on the curves &mdash; leading engineers to design cars that create downforce. And racing fans are even told that \"a Formula 1 racecar generates enough downforce above a certain speed that it could theoretically drive upside down,\" writes the automotive site Jalopnik. \n\n\"McMurtry Automotive turned this theory into reality after having its Sp&eacute;irling hypercar complete the impressive feat...\"\n\n\nAdmittedly, the Sp&eacute;irling's success can be solely attributed to its proprietary 'Downforce-on-Demand' fan system that produces 4,400 pounds of downforce at the push of a button... For those looking to do the math, Sp&eacute;irling weighs 2,200 pounds. With the stopped car's fan whirling at 23,000 rpm, the rig was rotated to invert the road deck... Then, the hypercar rolled forward a few feet before stopping while inverted. The rig rotated the road deck back down, and the Sp&eacute;irling drove ",
        "id": 2552072,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/04/14/0542240/an-electric-racecar-drives-upside-down?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "An Electric Racecar Drives Upside Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T04:50:03.774016+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T04:50:03+00:00",
        "description": "10 years ago \"certificate authorities normally issued certificate lifetimes lasting a year or more,\" remembers a new blog post Thursday by the EFF's engineering director. So in 2015 when the free cert authority Let's Encrypt first started issuing 90-day TLS certificates for websites, \"it was considered a bold move, that helped push the ecosystem towards shorter certificate life times.\"\n\n \nAnd then this January Let's Encrypt announced new six-day certificates... \n\nThis week saw a related announcement from the EFF engineering director. More than 31 million web sites maintain their HTTPS certificates using the EFF's Certbot tool (which automatically fetches free HTTPS certificates forever) &mdash; and Certbot is now supporting Let's Encrypt's six-day certificates. (It's accomplished through ACME profiles with dynamic renewal at 1/3rd of lifetime left or 1/2 of lifetime left, if the lifetime is shorter than 10 days):\n \nThere is debate on how short these lifetimes should be, but with ACME ",
        "id": 2551371,
        "language": null,
        "link": "https://it.slashdot.org/story/25/04/14/0356212/the-effs-certbot-now-supports-six-day-certs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The EFF's 'Certbot' Now Supports Six-Day Certs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T02:40:24.216814+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T02:40:23+00:00",
        "description": "Late Friday news broke that U.S. President Trump's new tariffs included exemptions for smartphones, computer monitors, semiconductors, and other electronics. But Sunday morning America's commerce secretary insisted \"a special-focus type of tariff\" was coming for those products, reports ABC News. President Trump \"is saying they're exempt from the reciprocal tariffs,\" the commerce secretary told an interviewer, \"but they're included in the semiconductor tariffs, which are coming in probably a month or two.... This is not like a permanent sort of exemption.\" \n\nThe Wall Street Journal notes that Sunday the president himself posted on social media that \"NOBODY is getting 'off the hook' for the unfair Trade Balances, and Non Monetary Tariff Barriers... There was no Tariff 'exception' announced on Friday. These products are subject to the existing 20% Fentanyl Tariffs, and they are just moving to a different Tariff 'bucket.'\" \n\n\"The administration is expected to take the first step toward en",
        "id": 2550889,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/14/0038246/trump-denies-tariff-exception-for-electronics-promises-new-electronics-tariffs-soon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Trump Denies Tariff 'Exception' for Electronics, Promises New Electronics Tariffs Soon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T00:30:17.608199+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T00:30:15+00:00",
        "description": "Stanford law school graduate Peter Thiel later co-founded Facebook, PayPal, and Palantir. But in 2010 Thiel also created the Thiel Fellowship, which annually gives 20 to 30 people under the age of 23 $100,000 \"to encourage students to not stick around college.\" (College students must drop out in order to accept the fellowship.) \n\nAnd now Palantir \"is taking a similar approach as it maneuvers to attract new talent,\" reports financial news site The Street:\n\n\nThe company has launched what it refers to as the &#226;oeMeritocracy Fellowship,&#226; a four-month internship program for recent high school graduates who have not enrolled in college. The position pays roughly $5,400 per month, more than plenty of post-college internship programs. Palantir&#226;(TM)s job posting suggests that the company is especially interested in candidates with experience in programming and statistical analysis. \nPalantir's job listing specifically says they launched their four-month fellowship \"in response to",
        "id": 2550529,
        "language": null,
        "link": "https://news.slashdot.org/story/25/04/13/2342232/palantirs-meritocracy-fellowship-urges-high-school-grads-to-skip-colleges-indoctrination-and-debt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Palantir's 'Meritocracy Fellowship' Urges High School Grads to Skip College's 'Indoctrination' and Debt",
        "vote": 0
    }
]