[
    {
        "age": null,
        "album": "",
        "author": "Ku Bogu",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T21:32:14.443655+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T20:22:47+00:00",
        "description": "Monumentalne dzieło bł. Anny Katarzyny Emmerich z: Imprimatur Nr 8501 z dnia 03/07/1899 r. Wrocław; Imprimatur nr 2398 z dnia 04/08/1899 r. Poznań; Imprimatur V. I. 33/27; 1400 stron. Opublikujemy całość.\n\nKsiążka ta uważana jest, po Piśmie Świętym, za jedną z najlepszych w dwutysięcznej historii chrześcijaństwa!\n\nTo wielka Łaska Boża na obecne czasy! Skierowana nie tylko do wierzących, aby jeszcze bardziej ożywili i pogłębili swoją wiarę i miłość do Boga, ale do wszystkich ludzi, wykształconych i prostych, odłączonych od Kościoła Katolickiego jak i niewierzących w Boskie i odkupieńcze posłannictwo Chrystusa. To unikalne, jedyne w Polsce wydanie zawiera opis wszystkich nadprzyrodzonych wizji słynnej na cały świat niemieckiej stygmatyczki, błogosławionej Anny Katarzyny Emmerich. Dzięki specjalnej Łasce Bożej widziała całe dzieło stworzenia i odkupienia, stworzenie Aniołów, Raju, Adama, Ewy i ich upadek, oraz jak Bóg przez wielkich Proroków Starego Testamentu przygotowywał ludzkość na p",
        "id": 2557935,
        "language": null,
        "link": "https://www.youtube.com/watch?v=BK44a4la9S8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 178,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/BK44a4la9S8/hqdefault.jpg",
        "title": "Bł. Anna Katarzyna Emmerich: Żywot i Bolesna Męka Pana naszego Jezusa Chrystusa. E01",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Ku Bogu",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T10:55:12.137893+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T09:45:05+00:00",
        "description": "Pewnego dnia nasz Pan ukaże się swojej służebnicy, dawnej liczbie dusz cierpiących, pozbawionych opieki świętej dziewicy i świętych. Mimo wizyt ich aniołów stróżów, była to, jak mówił Boże Nauczyciel, kara za brak jedności z ich przełożonymi i zapewne nieporozumienia. Wiele z tych dusz było przeznaczonych zostać długo w straszliwych płomieniach. Błogosławiona również rozpozna wiele dusz, które żyły religijnie, lecz z powodu braku jedności z braćmi i miłosierdzia były pozbawione pomocy i wsparcia. Święty Piotr poucza nas w pierwszym liście: \"Miejcie przede wszystkim miłość nieustającą jednych ku drugim, ponieważ miłość zakrywa liczne grzechy.\" Przejdźmy do tego, co Biblia mówi na temat miłosierdzia. Miłosierdzie jest niezwykle cenne przed Bogiem. Pan Jezus powiedział: \"Wiele grzechów zostało odpuszczonych, ponieważ bardzo umiłował ludzi.\"\n\n\nNagranie pochodzi z programu \"Czyścimy czyściec\", który swoją premierę ma w każdą środę o godzinie 21:20 na kanale YouTube Ku Bogu.\nCałą historię z",
        "id": 2552889,
        "language": null,
        "link": "https://www.youtube.com/watch?v=id__a0cyBJk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 178,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/id__a0cyBJk/hqdefault.jpg",
        "title": "Jedność drogą do świętości  📖🌿 #shorts #maryja #kuBogu #wiara #czyścimyczyściec #Bóg",
        "vote": 0
    }
]