[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T16:57:45.925047+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T16:01:24+00:00",
        "description": "Indiana Jones and the Great Circle launches on April 17th for PS5, ushering in the previously Xbox console exclusive to an audience accustomed to adventure courtesy of the Uncharted series. While much has been said about the story, the characters, Troy Baker's incredible performance as Dr. Jones, and more, the visuals are particularly striking.\n\nThe Great Circle is developed on id Tech 7, which already offers numerous improvements, like improved LOD, ray tracing support, and much more. On Xbox Series X and PS5, it runs at a dynamic 4K and targets 60 FPS while offering ray-traced global illumination to stunning effect. Given the sheer visual density and meticulous presentation, you would expect it to slouch in places.\n\nHowever, it's perhaps one of the best-looking games of this generation. The PS5 version measures up well to both Xbox Series X and PC and despite a minor nitpick (or two), it delivers stunning visuals with a steadfast frame rate.",
        "id": 2555990,
        "language": null,
        "link": "https://www.youtube.com/watch?v=yG_fGnLJqsY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/yG_fGnLJqsY/hqdefault.jpg",
        "title": "Indiana Jones And The Great Circle: PS5 vs Xbox Series X vs PC - Which Version Comes Out On Top?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T14:27:24.788941+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T14:00:00+00:00",
        "description": "In a year already packed with big releases and Game of the Year contenders, it's only appropriate that one of the best games of last year should find a new audience. MachineGames' Indiana Jones and the Great Circle launches on April 17th for PS5, and it's the latest first-party Xbox title to jump to PlayStation.\n\nBut its appeal goes beyond Xbox and PlayStation. This is a top-grade action adventure that genre fans need to play. Not only is it an exquisitely designed title with likeable characters, incredible level design, intricate (yet sensible) puzzle design, and stunning visuals, but it's also a love letter to the Indiana Jones. It's the purest and best form of the character and his adventures in a long, long time.\n\nMelee combat may not be top-tier, and there are occasional stealth snafus, but Indiana Jones and the Great Circle deserves your attention.",
        "id": 2554602,
        "language": null,
        "link": "https://www.youtube.com/watch?v=aAWS28Rzg4E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/aAWS28Rzg4E/hqdefault.jpg",
        "title": "Indiana Jones And The Great Circle PS5 Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-04-14T11:01:17.170603+00:00",
        "date_dead_since": null,
        "date_published": "2025-04-14T10:00:06+00:00",
        "description": "We all have games that we feel are unfairly underrated. Our list here represents something along those lines, yet a with a slightly different spin. First, these are single player experiences at their core. They’re also a set of games that continue to have a negative reputation today, for one reason or another. \n\nStill, these 15 games share a positive trait or two in common. Reasons such as poor marketing and unexpected direction are common factors with many of these games. But when compared to other titles within the same genres, these 15 games go above in beyond in a number of ways.",
        "id": 2552999,
        "language": null,
        "link": "https://www.youtube.com/watch?v=3zxYHqAmzBk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3zxYHqAmzBk/hqdefault.jpg",
        "title": "15 Addictive Single Player Games PLAYERS HAVEN'T BEEN KIND TO",
        "vote": 0
    }
]