[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-10T00:10:22.639644+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T23:20:00+00:00",
        "description": "Apple announced that macOS 26 \"Tahoe\" will be the final version to support Intel-based Macs, with future macOS releases running exclusively on Apple Silicon devices (that is, 2020 M1 models and newer). They will, however, continue to receive security updates for a few more years. 9to5Mac reports: In some ways, Apple has already stopped supporting some non-Apple Silicon models of its lineup. macOS Tahoe does not work with any Intel MacBook Air or Mac mini for instance. But Tahoe does still support some Intel Macs. That includes compatibility with the 2019 16-inch MacBook Pro, the 2020 Intel 13-inch MacBook Pro, 2020 iMac, and the 2019 Mac Pro.\n \nBased on Apple's warning, you can expect that macOS 27 will drop support for all of these legacy machines, and therefore macOS 26 will be the last compatible version. These devices will continue to receive security updates for another three years, however. Going forward, the minimum support hardware generations will be from 2020 onwards, as tha",
        "id": 2890441,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/09/2245206/apple-will-end-support-for-intel-macs-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Will End Support For Intel Macs Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-10T00:10:22.798126+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T22:40:00+00:00",
        "description": "Ohio State University is launching a campus-wide AI fluency initiative requiring all students to integrate AI into their studies, aiming to make them proficient in both their major and the responsible use of AI. \"Ohio State has an opportunity and responsibility to prepare students to not just keep up, but lead in this workforce of the future,\" said the university's president, Walter \"Ted\" Carter Jr. He added: \"Artificial intelligence is transforming the way we live, work, teach and learn. In the not-so-distant future, every job, in every industry, is going to be [affected] in some way by AI.\" The Guardian reports: The university said its program will prioritize the incoming freshman class and onward, in order to make every Ohio State graduate \"fluent in AI and how it can be responsibly applied to advance their field.\" [...] Steven Brown, an associate professor of philosophy at the university, told NBC News that after students turned in the first batch of AI-assisted papers he found \"a",
        "id": 2890442,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/09/2130227/ohio-university-says-all-students-will-be-required-to-train-and-be-fluent-in-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ohio University Says All Students Will Be Required To Train and 'Be Fluent' In AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T22:28:18.992402+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T22:00:00+00:00",
        "description": "Warner Bros Discovery will split into two separate publicly traded companies -- one focused on its studios and streaming assets like HBO, DC Studios, and HBO Max, and the other on its declining cable networks including CNN and TNT Sports. The move, which unwinds the 2022 WarnerMedia-Discovery merger, is expected by mid-2026 and is \"the latest unraveling of decades of media consolidation that created global conglomerates spanning content creation, distribution and in some cases, telecommunications,\" reports Reuters. From the report: The new streaming-and-studios company will include Warner Bros, DC Studios and HBO Max - the crown jewels of WBD's entertainment library. The networks unit, which will hold up to a 20% stake in its counterpart, will house CNN, TNT Sports and Bleacher Report. CEO David Zaslav will lead the streaming and studios unit, while CFO Gunnar Wiedenfels will head the networks unit. The separation will be structured as a tax-free transaction and is expected to be comp",
        "id": 2889989,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/25/06/09/2120207/warner-bros-discovery-splits-streaming-from-cable-tv?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Warner Bros. Discovery Splits Streaming From Cable TV",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T22:28:19.148874+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T21:20:00+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Apple is launching what it calls the Foundation Models framework, which the company says will let developers tap into its AI models in an offline, on-device fashion. Onstage at WWDC 2025 on Monday, Apple VP of software engineering Craig Federighi said that the Foundation Models framework will let apps use on-device AI models created by Apple to drive experiences. These models ship as a part of Apple Intelligence, Apple's family of models that power a number of iOS features and capabilities.\n \n\"For example, if you're getting ready for an exam, an app like Kahoot can create a personalized quiz from your notes to make studying more engaging,\" Federighi said. \"And because it happens using on-device models, this happens without cloud API costs [] We couldn't be more excited about how developers can build on Apple intelligence to bring you new experiences that are smart, available when you're offline, and that protect your privacy.\"\n \nIn ",
        "id": 2889990,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/09/1859253/apple-lets-developers-tap-into-its-offline-ai-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Lets Developers Tap Into Its Offline AI Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T21:21:13.882792+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T20:40:00+00:00",
        "description": "At WWDC 2025, Apple announced a new dedicated Games app coming to Mac, iPhone, and iPad with features like leaderboards, matchmaking, and integration with Apple Arcade. Engadget's Jessica Conditt describes it as \"a revamp of Game Center\" that behaves \"more like a modern gaming hub, a la Xbox or GOG Galaxy.\" From the report: You can see what your friends are playing and challenge them to specific feats in certain titles. The library tab will include every game you've ever downloaded from the App Store, allowing you to booth them up right there. On Mac, a Games app overlay makes communication tools, audio controls, Bluetooth connections and live battery levels accessible at any time.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Unveils+a+Dedicated+Games+App%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F25%2F06%2F09%2F1854216%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twit",
        "id": 2889632,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/09/1854216/apple-unveils-a-dedicated-games-app?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Unveils a Dedicated Games App",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T20:17:20.603665+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T20:00:00+00:00",
        "description": "According to Bloomberg, several major Chinese AI companies, including Alibaba, ByteDance, and Tencent, have temporarily disabled certain chatbot features during the gaokao college entrance exams to prevent cheating. \"Popular AI apps, including Alibaba's Qwen and ByteDance's Doubao, have stopped picture recognition features from responding to questions about test papers, while Tencent's Yuanbao, Moonshot's Kimi have suspended photo-recognition services entirely during exam hours,\" adds The Verge. From the report: The rigorous multi-day \"gaokao\" exams are sat by more than 13.3 million Chinese students between June 7-10th, each fighting to secure one of the limited spots at universities across the country. Students are already banned from using devices like phones and laptops during the hours-long tests, so the disabling of AI chatbots serves as an additional safety net to prevent cheating during exam season.\n \nWhen asked to explain the suspension, Bloomberg reports the Yuanbao and Kimi ",
        "id": 2889041,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/09/1849202/china-shuts-down-ai-tools-during-nationwide-college-exams?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "China Shuts Down AI Tools During Nationwide College Exams",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T20:17:20.771824+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T19:20:00+00:00",
        "description": "Apple unveiled iPadOS 26 at its Worldwide Developer Conference on Monday, introducing what appears to be the most significant productivity overhaul in the tablet operating system's history. The update brings dynamically resizable windows that users can drag by their corners, a menu bar accessible through swipe gestures or cursor movement, and Expose for viewing all open windows in a tiled array. \n\nThe new windowing system allows users to seamlessly close, minimize, resize, and tile app windows while maintaining the iPad's touch-first interface. When users reopen apps, windows return to their last position and size. The menu bar, a longtime Mac staple, provides access to familiar commands like File, Edit, and View through either touch or trackpad controls. \n\nApple is also enhancing the Files app with resizable columns and collapsible folders, while bringing the Preview app to iPad for the first time with PDF editing capabilities and Apple Pencil support. The update introduces Backgroun",
        "id": 2889042,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/09/1843200/apple-finally-brings-mac-like-windowing-and-menu-bar-to-ipad?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Finally Brings Mac-like Windowing and Menu Bar To iPad",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T19:01:34.964685+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T18:40:00+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: YouTube videos may be getting a bit more pernicious soon. Google's dominant video platform has spent years removing discriminatory and conspiracy content from its platform in accordance with its usage guidelines, but the site is now reportedly adopting a lighter-touch approach to moderation. A higher bar for content removal will allow more potentially inflammatory content to remain up in the \"public interest.\" [...]\n \nBeginning late last year, YouTube began informing moderators they should err on the side of caution when removing videos that are in the public interest. That includes user uploads that discuss issues like elections, race, gender, sexuality, abortion, immigration, and censorship. Previously, YouTube's policy told moderators to remove videos if one-quarter or more of the content violated policies. Now, the exception cutoff has been increased to half. In addition, staff are now told to bring issues to managers if they ",
        "id": 2888389,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/09/1839245/youtube-will-protect-free-expression-by-pulling-back-on-content-moderation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Will 'Protect Free Expression' By Pulling Back On Content Moderation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T19:01:35.126631+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T18:05:00+00:00",
        "description": "An anonymous reader shares a report: Seagate has announced a new 4TB version of its storage expansion card for the Xbox Series X and S consoles. It's the first time the company has introduced a new capacity since launching 2TB and 512GB versions of the expansion card in late 2021. \n\nThe 4TB card is available starting today through Seagate's online store and Best Buy for $499.99, but is discounted to $429.99 as part of a limited-time launch promotion. For comparison, the Xbox Series S starts at $379.99, while the Xbox Series X starts at $599.99.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Seagate's+New+4TB+Xbox+Expansion+Card+Costs+More+Than+the+Xbox+Series+S%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F25%2F06%2F09%2F180229%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2F",
        "id": 2888390,
        "language": null,
        "link": "https://hardware.slashdot.org/story/25/06/09/180229/seagates-new-4tb-xbox-expansion-card-costs-more-than-the-xbox-series-s?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Seagate's New 4TB Xbox Expansion Card Costs More Than the Xbox Series S",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T17:55:43.502222+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T17:30:00+00:00",
        "description": "Apple today introduced Liquid Glass, a new design language that brings transparency and glass shine effects across macOS, iPadOS, iOS, and its other software platforms. Alan Dye, Apple's VP of human interface, described the update as the company's \"broadest design update, ever\" and \"the first time we're introducing a universal design across our platforms.\" \n\nThe design overhaul adds glass-like elements throughout iOS 26, including glass edges that appear when users swipe up on the lock screen and similar transparent effects across system interfaces. The changes represent Apple's most significant departure from the iOS 7 design philosophy that has shaped the mobile operating system for over a decade since 2013, when Apple moved away from skeuomorphism. App developers will need to adjust their applications to accommodate the new visual language.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple's+New+Design+Languag",
        "id": 2887265,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/09/1726200/apples-new-design-language-is-liquid-glass?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple's New Design Language is Liquid Glass",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T17:55:43.615100+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T16:56:00+00:00",
        "description": "United Natural Foods (UNFI), a major distributor of groceries to Whole Foods and other retailers, said on Monday that it was hit by a cyberattack, warning of disruptions to its ability to fulfill and distribute customer orders. From a report: UNFI said in a Monday filing with the U.S. Securities and Exchange Commission that it became aware of unauthorized access to its IT systems last Thursday, and began shutting down portions of its network. The filing added that the company has \"implemented workarounds for certain operations in order to continue servicing its customers where possible,\" but noted that the intrusion has caused ongoing disruptions to its business operations. \n\nThe Providence, Rhode Island-based company is one of the largest grocery distributors in North America, selling fresh produce, goods, and food products to more than 30,000 stores and supermarket locations across the U.S. and Canada. UNFI also serves as the \"primary distributor\" to Whole Foods, the Amazon-owned gr",
        "id": 2887266,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/09/1656213/major-us-grocery-distributor-warns-of-disruption-after-cyberattack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Major US Grocery Distributor Warns of Disruption After Cyberattack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T17:55:43.773187+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T16:16:00+00:00",
        "description": "The world's oceans are in worse health than realised, scientists have said today, as they warn that a key measurement shows we are \"running out of time\" to protect marine ecosystems. From a report: Ocean acidification, often called the \"evil twin\" of the climate crisis, is caused when carbon dioxide is rapidly absorbed by the ocean, where it reacts with water molecules leading to a fall in the pH level of the seawater. It damages coral reefs and other ocean habitats and, in extreme cases, can dissolve the shells of marine creatures. \n\nUntil now, ocean acidification had not been deemed to have crossed its \"planetary boundary.\" The planetary boundaries are the natural limits of key global systems -- such as climate, water and wildlife diversity -- beyond which their ability to maintain a healthy planet is in danger of failing. Six of the nine had been crossed already, scientists said last year. However, a new study by the UK's Plymouth Marine Laboratory (PML), the Washington-based Natio",
        "id": 2887267,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/09/1616214/sea-acidity-has-reached-critical-levels-threatening-entire-ecosystem?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Sea Acidity Has Reached Critical Levels, Threatening Entire Ecosystem",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T17:55:43.929142+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T15:22:00+00:00",
        "description": "A cybersecurity researcher was able to figure out the phone number linked to any Google account, information that is usually not public and is often sensitive, according to the researcher, Google, and 404 Media's own tests. From a report: The issue has since been fixed but at the time presented a privacy issue in which even hackers with relatively few resources could have brute forced their way to peoples' personal information. \"I think this exploit is pretty bad since it's basically a gold mine for SIM swappers,\" the independent security researcher who found the issue, who goes by the handle brutecat, wrote in an email. \n\n[...] In mid-April, we provided brutecat with one of our personal Gmail addresses in order to test the vulnerability. About six hours later, brutecat replied with the correct and full phone number linked to that account. \"Essentially, it's bruting the number,\" brutecat said of their process. Brute forcing is when a hacker rapidly tries different combinations of digi",
        "id": 2887268,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/09/156210/a-researcher-figured-out-how-to-reveal-any-phone-number-linked-to-a-google-account?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Researcher Figured Out How To Reveal Any Phone Number Linked To a Google Account",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T17:55:44.085224+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T14:40:00+00:00",
        "description": "An anonymous reader shares a report: Meta is in talks to make a multibillion-dollar investment into AI startup Scale AI, according to people familiar with the matter. The financing could exceed $10 billion in value, some of the people said, making it one of the largest private company funding events of all time. \n\n[...] Scale AI, whose customers include Microsoft and OpenAI, provides data labeling services to help companies train machine-learning models and has become a key beneficiary of the generative AI boom. The startup was last valued at about $14 billion in 2024, in a funding round that included backing from Meta and Microsoft.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+in+Talks+for+Scale+AI+Investment+That+Could+Top+%2410+Billion%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F25%2F06%2F09%2F1421259%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"",
        "id": 2887269,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/09/1421259/meta-in-talks-for-scale-ai-investment-that-could-top-10-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Meta in Talks for Scale AI Investment That Could Top $10 Billion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T17:55:44.242096+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T14:00:00+00:00",
        "description": "Apple researchers have found that state-of-the-art \"reasoning\" AI models like OpenAI's o3-mini, Gemini (with thinking mode-enabled), Claude 3.7, DeepSeek-R1 face complete performance collapse [PDF] beyond certain complexity thresholds when tested on controllable puzzle environments. The finding raises questions about the true reasoning capabilities of large language models. \n\nThe study, which examined models using Tower of Hanoi, checker jumping, river crossing, and blocks world puzzles rather than standard mathematical benchmarks, found three distinct performance regimes that contradict conventional assumptions about AI reasoning progress. \n\nAt low complexity levels, standard language models surprisingly outperformed their reasoning-enhanced counterparts while using fewer computational resources. At medium complexity, reasoning models demonstrated advantages, but both model types experienced complete accuracy collapse at high complexity levels. Most striking was the counterintuitive ",
        "id": 2887270,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/09/1151210/apple-researchers-challenge-ai-reasoning-claims-with-controlled-puzzle-tests?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Apple Researchers Challenge AI Reasoning Claims With Controlled Puzzle Tests",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T12:18:16.170107+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T11:34:00+00:00",
        "description": "Vox publishes a story about \"the quiet revolutions that have prevented millions of cancer deaths.... \n\n\"The age-adjusted death rate in the US for cancer has declined by about a third since 1991, meaning people of a given age have about a third lower risk of dying from cancer than people of the same age more than three decades ago... \"\n\n\nThe dramatic bend in the curve of cancer deaths didn't happen by accident &mdash; it's the compound interest of three revolutions. While anti-smoking policy has been the single biggest lifesaver, other interventions have helped reduce people's cancer risk. One of the biggest successes is the HPV vaccine. A study last year found that death rates of cervical cancer &mdash; which can be caused by HPV infections &mdash; in US women ages 20-39 had dropped 62 percent from 2012 to 2021, thanks largely to the spread of the vaccine. Other cancers have been linked to infections, and there is strong research indicating that vaccination can have positive effects o",
        "id": 2885203,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/09/0232200/the-medical-revolutions-that-prevented-millions-of-cancer-deaths?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "The Medical Revolutions That Prevented Millions of Cancer Deaths",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T07:58:15.907533+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T07:34:00+00:00",
        "description": "The Atlantic makes that case that \"the foundation of the AI industry is a scam\" and that AI \"is not what its developers are selling it as: a new class of thinking &mdash; and, soon, feeling &mdash; machines.\"\n\n[OpenAI CEO Sam] Altman brags about ChatGPT-4.5's improved \"emotional intelligence,\" which he says makes users feel like they're \"talking to a thoughtful person.\" Dario Amodei, the CEO of the AI company Anthropic, argued last year that the next generation of artificial intelligence will be \"smarter than a Nobel Prize winner.\" Demis Hassabis, the CEO of Google's DeepMind, said the goal is to create \"models that are able to understand the world around us.\" These statements betray a conceptual error: Large language models do not, cannot, and will not \"understand\" anything at all. They are not emotionally intelligent or smart in any meaningful or recognizably human sense of the word. LLMs are impressive probability gadgets that have been fed nearly the entire internet, and produce w",
        "id": 2883208,
        "language": null,
        "link": "https://slashdot.org/story/25/06/09/062257/ai-is-not-intelligent-the-atlantic-criticizes-scam-underlying-the-ai-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'AI Is Not Intelligent': The Atlantic Criticizes 'Scam' Underlying the AI Industry",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T07:58:16.095649+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T04:34:00+00:00",
        "description": "\"Replanting forests can help cool the planet even more than some scientists once believed, especially in the tropics,\" according to a recent announcement from the University of California, Riverside.\n\nIn a new modeling study published in Communications Earth &amp; Environment, researchers at the University of California, Riverside, showed that restoring forests to their preindustrial extent could lower global average temperatures by 0.34 degrees Celsius. That is roughly one-quarter of the warming the Earth has already experienced. The study is based on an increase in tree area of about 12 million square kilometers, which is 135% of the area of the United States, and similar to estimates of the global tree restoration potential of 1 trillion trees. It is believed the planet has lost nearly half of its trees (about 3 trillion) since the onset of industrialized society. \n\nThe Washington Post noted that the researchers factored in how tree emissions interacted with molecules in the atmosp",
        "id": 2883209,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/09/0427208/scientists-show-reforestation-helps-cool-the-planet-even-more-than-thought?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Scientists Show Reforestation Helps Cool the Planet Even More Than Thought",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T07:58:16.261069+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T02:23:00+00:00",
        "description": "A new study \"adds a whole extra level of detail to our understanding of caffeine's impact on the brain during sleep,\" reports ScienceAlert:\n\nCaffeine was shown to increase brain signal complexity, and shift the brain closer to a state of 'criticality', in tests run by researchers from the University of Montreal in Canada. This criticality refers to the brain being balanced between structure and flexibility, thought to be the most efficient state for processing information, learning, and making decisions. However, this state might prevent restful sleep, the researchers suggest. The caffeine isn't just keeping us alert, but actually changing how the brain is operating. What's more, they found younger adults aged 20 to 27 were more greatly affected in this way... \n\nWhen it comes to the different reactions across different ages, the researchers suggest that changes in the brain as we age might be responsible. Adenosine molecules gradually build up in the brain during the day, leading to a",
        "id": 2883210,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/08/2355252/caffeine-has-a-weird-effect-on-your-brain-while-youre-asleep?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Caffeine Has a Weird Effect On Your Brain While You're Asleep",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-09T07:58:16.416929+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-09T01:23:00+00:00",
        "description": "The U.K. electricity grid \"was built to deliver power generated by coal and gas plants near the country's major cities and towns,\" reports the BBC, \"and doesn't always have sufficient capacity in the wires that carry electricity around the country to get the new renewable electricity generated way out in the wild seas and rural areas. \n\n\"And this has major consequences.\"\n\nThe way the system currently works means a company like Ocean Winds gets what are effectively compensation payments if the system can't take the power its wind turbines are generating and it has to turn down its output. It means Ocean winds was paid &pound;72,000 [nearly $100,000 USD] not to generate power from its wind farms in the Moray Firth during a half-hour period on 3 June because the system was overloaded &mdash; one of a number of occasions output was restricted that day. At the same time, 44 miles (70km) east of London, the Grain gas-fired power station on the Thames Estuary was paid &pound;43,000 to provid",
        "id": 2883211,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/09/0121203/uk-renewable-energy-firms-are-being-paid-huge-sums-to-not-provide-power?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "UK Renewable Energy Firms are Being Paid Huge Sums to Not Provide Power",
        "vote": 0
    }
]