[
    {
        "age": null,
        "album": "",
        "author": "The School of Life",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T15:14:17.620914+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T14:01:28+00:00",
        "description": "We are unnecessarily scared of being on our own because we fail to keep in mind the distinction between solitude (a fine condition) and loneliness (a pain). We need to recover a sense of the good sides of being by ourselves - in order to be able to make the right choices around friendship and love.\n\nFURTHER READING\n\nYou can read more on this and other subjects here: https://bit.ly/2A9k7HI\n\n“In the privacy of our minds, one thought – highly shameful by nature – may haunt us as we evaluate whether to stay in or leave an unsatisfactory relationship: what if we were to end things and end up in a place of appalling loneliness?\n\n We’re meant to be above such pragmatic worries. Only cowards and reprobates would mind a few weekends (or decades) by themselves. We’ve heard of those books that sing the praises of solitude (the divorcee who relocated to a solitary hut on a bare Scottish island; the one who went sailing around the world in a dinghy). But we can admit that we’re not naturals at thi",
        "id": 4227820,
        "language": "en-US",
        "link": "https://www.youtube.com/shorts/n-fO-Jt0j00",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 353,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC7IcJI8PUf5Z3zKxnZvTBog",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/n-fO-Jt0j00/hqdefault.jpg",
        "title": "The Terror of Being Alone #relationships  #theschooloflife  #animation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "The School of Life",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T15:14:17.794880+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T14:01:21+00:00",
        "description": "Emotional Intelligence, Daily. Start now: https://www.theschooloflife.com/subscription/ \nDid a bad childhood ruin your chance at love? This film explores the two self-sabotaging traps people with deep self-hatred fall into: pursuing cruel, unavailable partners or rejecting kind ones because their goodness feels \"sickening.\" Discover the third option: acknowledging your \"illness\" and inviting a supportive partner to help you bear the anxiety of being cared for. #ChildhoodTrauma #Relationships #SelfSabotage #AttachmentStyles #Healing Unlock all the content of The School of Life with a subscription to our podcast, articles, videos, and exercises, specially tailored to your needs. \nGet weekly insights for better relationships, deeper self-knowledge, and inner calm straight to your inbox. Sign up for more ideas, plus 10% off your first shop order: https://www.theschooloflife.com/signup/ \n\nYou can read more on this and other subjects in our articles, here: https://www.theschooloflife.com/ar",
        "id": 4227821,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=jsPsPMM1ZLs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 353,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC7IcJI8PUf5Z3zKxnZvTBog",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jsPsPMM1ZLs/hqdefault.jpg",
        "title": "Your Two Options in Love After a Bad Childhood",
        "vote": 0
    }
]