[
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:58.338981+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T18:01:01+00:00",
        "description": "What began as a moment of exhaustion and frustration became one of Dr. Holly’s most defining life lessons. In this talk, she reflects on how embracing uncomfortable moments, trusting yourself, and seizing unexpected opportunities can transform setbacks into defining solos. Learn what it really means to take your “SOLO”: Stay true, Open up, Lean in, and Own it. \n\nDr. Holly Hatcher-Frazier is best known as the “voice of reason” on the series, Dance Moms. A doctoral graduate of the University of Pennsylvania’s Graduate School of Education, she worked in education for over 20 years, as a teacher, administrator and principal before the show. Dr. Hatcher-Frazier served as a positive role model both on and off the reality television show. She enjoys new challenges and inspires others through public speaking and as a podcast co-host. An avid traveler with an adventurous spirit, Dr. Hatcher-Frazier is a digital contributor to Travel & Leisure Asia. She also enjoys giving back to her community ",
        "id": 4229968,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=g4OSstHrIHs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/g4OSstHrIHs/hqdefault.jpg",
        "title": "The real story behind my viral 'Dance Moms' moment | Holly Hatcher-Frazier | TEDxPenn",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:58.451650+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:59:25+00:00",
        "description": "L’intervento mostra come scuole, aziende e professionisti reagiscano all’AI cercando di evitare noia, pigrizia e fatica, invece di assumersi responsabilità. Dai controlli scolastici aggirati, al caso Texas A&M con studenti accusati ingiustamente, fino agli errori di Samsung e agli avvocati che depositano sentenze inventate: il problema non è l’AI, ma l’uso scorretto e non controllato dell’AI.\nL’AI Act e la Legge 132/2025 richiedono trasparenza, verificabilità, supervisione umana, policy chiare e formazione obbligatoria.\nLa tesi finale: le macchine non possono sostituire la responsabilità umana. \nLa Lex Machina serve proprio a ricordare che la responsabilità non si delega all’algoritmo si esercita. Alberta Antonucci nasce a Padova nel 1982 e dopo gli studi scientifici consegue la laurea in Giurisprudenza presso l’università di Trento. Dopo un’esperienza in un importante studio legale milanese, fonda la propria boutique nel 2013. Dal 2017 opera con il brand Ontheinfluencerside e nel 201",
        "id": 4229969,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=tXpBkHAz52k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tXpBkHAz52k/hqdefault.jpg",
        "title": "Quando sbaglia l’AI | Alberta Antonucci | TEDxLink Campus University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:58.556664+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:59:12+00:00",
        "description": "Il talk mostra che la giustizia algoritmica non è teoria: è un mercato miliardario che sta trasformando il diritto. L’ingresso massiccio di capitali privati nel LegalTech sta cambiando ruoli e poteri: l’avvocato diventa analista dei dati, i giudici usano sistemi predittivi, il legislatore si confronta con modelli e piattaforme sviluppate da attori globali. Il settore pubblico fatica a tenere il passo di soluzioni private che possiedono tecnologia, dati e capacità di scalare. La giustizia diventa così un’infrastruttura finanziata e intermediata. Il risultato: il diritto non è più solo interpretato, ma ingegnerizzato e distribuito come servizio, con un nuovo equilibrio di potere che si sposta verso startup e investitori. Emanuele Rumi Rios è avvocato specializzato in diritto societario, con particolare attenzione ai settori dell’innovazione, delle nuove tecnologie e delle industrie creative. Assiste fondi di private equity e venture capital, imprese e founder nella strutturazione e gest",
        "id": 4229970,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=rEX0jnaNa1M",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rEX0jnaNa1M/hqdefault.jpg",
        "title": "Harder, Better, Faster… Funded? | Emanuele Rumi Rios | TEDxLink Campus University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:58.662429+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:58:54+00:00",
        "description": "L’avvocato affronta il tema del “criminale digitale”, spiegando che oggi non esiste un confronto solo tra legge e tecnologia, ma serve un “trilogo” che metta al centro la persona e i suoi diritti. Nell’era digitale esiste un “io immateriale” fatto di immagini, contenuti e identità online, che necessita di tutela quanto la persona fisica. A differenza del criminale tradizionale, il criminale digitale è spesso un individuo comune, di media cultura, che con un semplice click può commettere reati senza percepirne davvero la gravità, perché la distanza virtuale elimina la percezione della vittima. Questo porta a fenomeni di “disimpegno morale”, dove si banalizzano azioni illecite come la diffusione di immagini private. Il caso emblematico è quello del Revenge Porn, definito non come vendetta o pornografia ma come violenza, nato in rete e reso drammaticamente noto dalla vicenda di Tiziana Cantone. Nel digitale basta un click per distruggere una dignità, perché ciò che viene diffuso diventa ",
        "id": 4229971,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=s9Kx_7A96ew",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/s9Kx_7A96ew/hqdefault.jpg",
        "title": "Revenge Porn | Gaia Morelli | TEDxLink Campus University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:58.768727+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:58:34+00:00",
        "description": "Il testo affronta il rapporto tra intelligenza artificiale e autodeterminazione personale, ribaltando la visione spaventosa spesso dominante nel dibattito europeo. Il discorso si sviluppa attraverso tre scenari emblematici: auto a guida autonoma, credit scoring algoritmico e algoritmi nel processo penale. Dalla paura di perdere il controllo in una self-driving car, al caso di un giovane imprenditore a cui la banca nega il credito basandosi su uno score automatizzato, fino al rischio che un algoritmo influenzi una sentenza. In tutti i casi emerge lo stesso nodo: possiamo davvero delegare decisioni che toccano i nostri diritti fondamentali? La conclusione è ottimista: l’IA non è un destino inevitabile, ma uno strumento da istruire con dati corretti e valori condivisi. Sta a noi decidere come usarla e far sì che serva le persone, non che le sovrasti. Francesca Bartolini è Professoressa associata di Diritto privato all'Università degli Studi Link, è avvocato, componente con funzioni di vi",
        "id": 4229972,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=JEUodGsYQ4Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JEUodGsYQ4Y/hqdefault.jpg",
        "title": "La macchina giudica l'uomo | Francesca Bartolini | TEDxLink Campus University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:58.871853+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:58:16+00:00",
        "description": "Il testo esplora se sia necessario riconoscere una forma di personalità giuridica all’intelligenza artificiale. La domanda nasce dall’esigenza di tutelare i terzi dai danni causati dai sistemi di AI, ma la personalità non è l’unica strada: gli attuali principi di responsabilità civile potrebbero essere adattati, purché individuabile un soggetto responsabile e un patrimonio capiente per i risarcimenti. Attribuire personalità all’AI, però, avrebbe conseguenze molto ampie: significherebbe permetterle non solo di essere responsabile, ma anche di vantare diritti e agire in giudizio. Inoltre, il concetto di “persona” negli ordinamenti attuali è incompatibile con le caratteristiche dell’AI. Nonostante ciò, alcuni Paesi stanno spingendo verso forme di riconoscimento giuridico, guidati più da logiche di mercato che da reali esigenze di protezione. Ferruccio Maria Sbarbaro è uno dei fondatori dello Studio, di cui è attualmente Co-Managing Partner. Professore Associato e avvocato cassazionista, ",
        "id": 4229973,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=nAISkm7mHkw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nAISkm7mHkw/hqdefault.jpg",
        "title": "IA e diritto | Ferruccio Maria Sbarbaro | TEDxLink Campus University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:59.006431+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:58:03+00:00",
        "description": "L’intervento analizza il rapporto tra diritto e tecnologia, interrogandosi sull’adeguatezza dell’attuale metodo legislativo europeo di fronte a innovazioni che avanzano molto più rapidamente delle norme. Negli ultimi anni l’UE ha prodotto un’intensa quantità di regolamenti digitali, ispirati alla strategia “Shaping Europe’s Digital Future”, con l’obiettivo di coniugare innovazione, diritti dei cittadini e sovranità digitale. Tuttavia questa iper-produzione normativa, costruita su un approccio basato sul rischio ma molto attento alla tutela dei diritti, ha creato complessità, sovrapposizioni e difficoltà applicative, come evidenziato dal rapporto Draghi del 2024. Il nuovo pacchetto “digital omnibus” del 2024 tenta di correggere la rotta semplificando, accorpando norme esistenti e rinviando parti dell’AI Act troppo complesse o onerose. La tesi conclusiva sostiene che un sistema normativo efficace dovrebbe spostare il focus dalla tutela astratta dei diritti all’analisi concreta del risch",
        "id": 4229974,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VHL3ri9t2aE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VHL3ri9t2aE/hqdefault.jpg",
        "title": "La sfida tra il diritto e la tecnologia | Silvia Stefanelli | TEDxLink Campus University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:59.136867+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:57:44+00:00",
        "description": "L’intervento riflette su come, nell’era dell’intelligenza artificiale, alla frase “La legge è uguale per tutti” se ne debba affiancare un’altra: “L’algoritmo è uguale per tutti?”. Il caso reale della Florida del 2014 mostra come un algoritmo predittivo abbia valutato in modo discriminatorio due imputati, rivelando che l’IA non è infallibile né neutrale, ma rispecchia i bias presenti nei dati con cui è addestrata. L’algoritmo vede e interpreta elementi sensibili, al contrario della “dea bendata” che simboleggia l’imparzialità della giustizia. A questo si aggiunge il problema delle allucinazioni dell’IA, che hanno già causato centinaia di errori giudiziari nel mondo. La normativa italiana stabilisce che ogni decisione resti responsabilità del magistrato, che deve sempre controllare gli output dell’IA. Nei sistemi giuridici europei la libertà interpretativa del giudice è essenziale, tanto che la Francia ha vietato la judge analytics per proteggerla. Tuttavia anche la giustizia umana è fa",
        "id": 4229975,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=GeyVWj2Ho7c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GeyVWj2Ho7c/hqdefault.jpg",
        "title": "L'algoritmo è uguale per tutti? | Ernesto Belisario | TEDxLink Campus University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:59.254135+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:57:08+00:00",
        "description": "L’intervento mostra che l’AI non è un “mostro recente”, ma una disciplina con 70 anni di storia nata per simulare capacità umane e migliorare la qualità della vita, proprio come ogni innovazione tecnologica. Ripercorre le tappe principali dell’AI, dalle prime calcolatrici al Test di Turing, da Deep Blue a Watson, fino ai modelli generativi moderni. \nOggi l’AI è al centro della trasformazione digitale e l’Europa la regola attraverso l’AI Act e il nuovo Codice di Condotta, puntando su sicurezza, trasparenza ed etica. In un mondo in cui la competenza digitale è ormai fondamentale quanto leggere e scrivere, il vero rischio non è l’AI in sé, ma non usarla e perdere le opportunità che offre alla società, al lavoro e alla qualità della vita. Master Inventor e Corporate Social Responsability Manager IBM Italia. Si occupata da sempre di accelerare l’evoluzione del digitale creando progetti innovativi  basati su A.I.  21 sono i suoi brevetti nel campo digitale.  Supporta ed orientale nuove gene",
        "id": 4229976,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=LlEjBpnAduw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LlEjBpnAduw/hqdefault.jpg",
        "title": "Qual è il piu grande rischio dell’AI? | Filomena Floriana Ferrara | TEDxLink Campus University",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:59.392908+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:56:17+00:00",
        "description": "Migration isn’t a crisis — it’s the key to our renewal.\nIn this powerful talk, economist and transformational speaker Dr. Daphne Hering redefines how we see one of humanity’s oldest and most transformative forces. Blending research, personal story, and timeless insight, she reveals how migration fuels creativity, productivity, and innovation—shaping prosperity across societies. Her message is simple yet revolutionary: when we open doors to migrants, we unlock opportunity for us all. Dr. Daphne Hering is an economist, transformational speaker, and entrepreneur whose work bridges research, leadership, and lived experience to reimagine how societies thrive in times of uncertainty and change. Her PhD on migrant entrepreneurship revealed how migration fuels opportunity recognition and drives innovation. As founder of Cyra Capital, she invests in migrant-founded tech startups shaping Europe’s future. Through her work, Daphne inspires leaders worldwide to see migration not as a crisis, but a",
        "id": 4229977,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Y4MU7fkaU3g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Y4MU7fkaU3g/hqdefault.jpg",
        "title": "Why migration is the key to our renewal | Daphne Hering | TEDxBerlin Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:59.501700+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:55:58+00:00",
        "description": "Millions of kids and adults quietly believe they’re broken — not because of who they are, but because of the systems and stories that define difference as a deficit. In this powerful talk, writer and parenting activist Debbie Reber shares how understanding and embracing neurodivergence — including ADHD, autism, and learning disabilities — is helping families and generations of adults rewrite their stories from shame to self-acceptance. Her talk offers a hopeful roadmap for belonging, identity, and redefining what it means to be human. Debbie Reber is a parenting activist, bestselling author, and founder of Tilt Parenting, a global community for families raising neurodivergent children. When she launched Tilt in 2016, most conversations about neurodevelopmental differences focused on deficits and disorder. Debbie has been at the forefront of changing that narrative, championing a strengths-based approach that celebrates the potential of differently wired kids and reframes how society s",
        "id": 4229978,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ORHtOsyQUBY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ORHtOsyQUBY/hqdefault.jpg",
        "title": "What if Feeling Broken Wasn't the End of the Story? | Deborah Reber | TEDxBerlin Women",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:59.658493+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:54:06+00:00",
        "description": "Sisters Naomi and Natalie Evans, founders of Everyday Racism, share how one moment on a train reshaped their lives and revealed the power of purpose. Through honesty, reflection, and hope, they show how understanding your “why” can transform frustration into action. They explore how finding your thread—no matter how small—can begin to unravel systems of injustice. This talk invites everyone to recognise their own role in change and demonstrates how everyday actions, grounded in purpose, can spark extraordinary impact. Naomi and Natalie Evans are a dynamic duo who are making a powerful impact on the fight against racism. They are speakers, authors, educators, and award-winning influencers for their Instagram platform Everyday Racism, which serves as the largest anti-racism platform in the UK. \n\nNaomi and Natalie are sisters and natural communicators who draw upon their lived experience to drive the work they do. At the heart of their work is a commitment to empowering people to make a ",
        "id": 4229979,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=95avjIolR_U",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/95avjIolR_U/hqdefault.jpg",
        "title": "The power of knowing your purpose | Natalie & Naomi Evans | TEDxTeesside",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:59.793103+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:52:23+00:00",
        "description": "In this emotional and scientific talk, Sofia explores how music reaches brain regions that remain intact even after severe memory loss. She presents research, real cases, and moving examples showing how melodies restore identity, awaken dormant emotions, and reconnect people when language fails. Sofia Skornicki is a TBSRJ student deeply interested in music, neuroscience, and human emotion. Fascinated by music as a universal language, she studies how melodies activate deep memory, sustain emotional connection, and promote healing even in individuals with significant cognitive decline. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4229980,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fa2v4ZRIzZ4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fa2v4ZRIzZ4/hqdefault.jpg",
        "title": "How Music Heals What Words Can't  | Sofia Skornicki | TEDxTBSRJ Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:56:59.974841+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:52:10+00:00",
        "description": "This talk examines the impact of personalities, societal roles, and the responsibilities we impose upon ourselves on our essence. It analyzes the traces we leave on our soul when we set aside our genuine self and attempt to adopt the roles we feel we must possess. Batu Tayga Konak graduated from our school in 2024. He is currently continuing his undergraduate education in the Department of Interior Architecture and Environmental Design at Bilkent University. Batu has been working with various non-governmental organizations since his primary school years. Contributing his conservatory education, he composes music for software and coding projects, and produces illustrations for institutions and his own projects, especially for children's books. He continues to be productive by undertaking many initiatives in the fields of art and design. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com",
        "id": 4229981,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=UHUp9TjLSxM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UHUp9TjLSxM/hqdefault.jpg",
        "title": "The Path of the Soul | Batu Tayga Konak | TEDxODTU Gelistirme Vakfi Lisesi",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:57:00.139050+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:52:02+00:00",
        "description": "Un viaggio dal Vendée Globe alla vita quotidiana per mostrare come il metodo mentale trasformi un sogno in rotta concreta.\nTra sfide estreme, disciplina e scelte consapevoli, emergono quattro principi per costruire resilienza operativa.\nDal privilegio alla responsabilità: ogni giorno è pratica, consapevolezza e trasformazione. Nato a Firenze nel 1975, Giancarlo Pedote ha subito sentito una forte attrazione per lo sport e il mare. Dopo boxe e full contact scopre la vela a 14 anni. Navigare gli permette di esprimersi liberamente in una disciplina che richiede una grande robustezza mentale, che gli permette di esplorare il mondo e di uscire dalla sua zona di comfort. Diventa presto istruttore di vela, formatore, e si laurea in filosofia (2002), da cui trae metodo e disciplina per leggere gli errori, trasformarli in esperienza e superare i propri limiti. Campione Italiano Mini 2008, n.1 nel ranking mondiale 2013, Velista dell’Anno 2014 e 2016, vince la Transat Jacques Vabre 2015 in Multi5",
        "id": 4229982,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XhCna3dcsIQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XhCna3dcsIQ/hqdefault.jpg",
        "title": "Come essere artefici del proprio destino | Giancarlo Pedote | TEDxTrento",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:25.042597+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:32:56+00:00",
        "description": "W jaki sposób nadajemy nowe znaczenia wydarzeniom emocjonalnym? Czy i jaki mamy wpływ na to, jak doświadczamy emocji i jak je regulujemy? Punktem wyjścia może tu być stara przypowieść o królu, którego pozorne nieszczęście ostatecznie przynosi mu ocalenie. Przy czym – to język odgrywa kluczową rolę w kształtowaniu reprezentacji mentalnych i reakcji emocjonalnych. Słowa oraz narracje funkcjonują jak „programy” zapisane w pamięci, wpływające na przyszłe doświadczenia. Główna konkluzja brzmi: choć wydarzenia często wymykają się naszej kontroli, nadawane im znaczenia już nie. Ich aktualizacja może zmienić nie tylko to, jak czujemy się dzisiaj, lecz także to, jak będziemy reagować jutro. Ta prezentacja została wygłoszona na wydarzeniu TEDx, stworzonej przy użyciu formatu konferencji TED, ale niezależnie zorganizowanej przez lokalną społeczność. Szczegóły na https://www.ted.com/tedx // \nHow do we give new meaning to emotional events? To what extent can we influence the way we experience and ",
        "id": 4229207,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Q9q_sgLKcgA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Q9q_sgLKcgA/hqdefault.jpg",
        "title": "Czy można zaprogramować własne emocje? | Ewelina Kinalska | TEDxUniversityofWarsaw",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:25.308752+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:32:44+00:00",
        "description": "Have you ever changed your mind? Have you persuaded someone else to change theirs? Jens E. Kjeldsen is a professor of rhetoric who has spent more than three decades studying the art of persuasion. But the most important lesson he learned wasn’t how to persuade others — it was how to be open to being persuaded himself. Persuading others is a powerful skill. Allowing yourself to be persuaded? That can be life changing. Jens E. Kjeldsen is professor of Rhetoric at University of Bergen (Norway) and award-winning speechwriter. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4229208,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=EwwM3xNmQzE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EwwM3xNmQzE/hqdefault.jpg",
        "title": "The Art of Being Persuaded | Jens Kjeldsen | TEDxØygarden",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:25.565111+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:32:09+00:00",
        "description": "What if every failure was just life’s way of asking you to roll the dice again?\nIn this inspiring and deeply Talk, Sirish Korada, Managing Director & CEO of BINDZ Consulting, shares his journey from failing the IIT exam to building global ventures and leading with purpose. Through stories of rejection, risk, and resilience—from washing cars in Australia to launching successful companies—Sirish reveals how servant leadership, empathy, and people-first culture can transform both careers and lives.\nA reminder that success doesn’t belong to the extraordinary—it belongs to those who keep rolling the dice. Sirish Korada is the Managing Director and CEO of BINDZ Consulting, a purpose-led finance firm redefining the future of offshoring in financial consulting. With over two decades of global experience in investment banking, accounting, and consulting, he has built and led high-performing teams across geographies. Known for his people-first leadership style, Sirish has played a pivotal role ",
        "id": 4229209,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=umHN-x8jyOA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/umHN-x8jyOA/hqdefault.jpg",
        "title": "Keep Rolling the Dice: The Power of Getting Back Up | Sirish korada | TEDxNerul",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:25.926674+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:32:06+00:00",
        "description": "Mondale Smiley challenges the long held assumption that professionalism must be defined by stern routine, rigid systems, and formal expectations. Through humor and storytelling, he reveals how creativity and play can unlock deeper engagement, stronger workplace culture, and meaningful innovation. Mondale explains that when people are encouraged to explore ideas, experiment freely, and bring their authentic selves to work, organizations benefit in measurable ways, including higher morale and increased productivity. Drawing from his internship with a youth centered nonprofit, he shares how one simple question  reshaped his leadership style and allowed him to model joy, imagination, and courage for the young people he served. Inviting the audience to reconnect with their early sense of wonder and curiosity, he demonstrates that being playful and being effective are not opposites.  Mondale Dalon Smiley is a Faith-Driven Business Strategist, Youth Development & Advocacy Specialist and Inno",
        "id": 4229210,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=Et3AzaXMWoY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Et3AzaXMWoY/hqdefault.jpg",
        "title": "Becoming a Corporate Kid | Mondale Dalon Smiley | TEDxYouth@JeffersonStreet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:26.341320+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:31:56+00:00",
        "description": "In this insightful talk, Mahi Nandrey challenges the belief that growth comes only from major milestones or life changing achievements. Through personal stories of scattered mornings, overwhelm, and the quiet moment she chose to reclaim her balance, she reveals how meaningful growth often begins with one small choice made consistently. Drawing on principles from identity based habits, she explains how shifting from outcome focused goals to the daily actions that shape who we become can create lasting change. Mahi shows that personal and professional growth are deeply connected, and that the stability we build in our private routines strengthens our confidence and discipline. Her message is clear and empowering: stop waiting for the perfect moment. Real growth starts now, in the next small choice you make. Mahi Nandrey is a high school senior passionate about science, health and the ways they shape people’s lives. Fascinated by how small ideas can lead to lasting impact, Nandrey enjoys",
        "id": 4229211,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=XsDPVUFufUI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XsDPVUFufUI/hqdefault.jpg",
        "title": "The Power of Small Choices | Mahi Nandrey | TEDxYouth@JeffersonStreet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:26.750792+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:31:47+00:00",
        "description": "This talk explores the idea that true leadership isn’t about authority or position—it’s about service. Through relatable reflections and real examples, the speaker shows how empathy, responsibility, and small acts of service can create meaningful change in communities. The talk invites youth to rethink leadership as a daily practice of helping others grow, not a title to be claimed. Dr. Ari Rosandi is an education practitioner and the Director of Education at Cahaya Rancamaya Islamic Boarding School (CRIBS). With over two decades of experience, he has held strategic roles from teacher to principal, focusing on building strong learning cultures and developing high-performing schools. His work highlights servant leadership, character development, and student-centered environments that promote both excellence and empathy. Dr. Ari connects educational ideals with real classroom needs, encouraging teachers, parents, and students to view education not just as grades, but as a lifelong proce",
        "id": 4229212,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=i1Wj6VRU1hQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/i1Wj6VRU1hQ/hqdefault.jpg",
        "title": "Lead by Serving | Dr. Ari Rosandi | TEDxCRIBS Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:27.045237+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:29:38+00:00",
        "description": "In this moving talk, Madison Harbour begins with a simple childhood memory of an untuned guitar and a trembling first performance, a moment that revealed a truth she now carries into her life as a musician. The value of music is not found in perfection, but in the humanity behind the sound. Through stories of struggle, growth, and the emotional connection we feel when a song reflects our own past, she shows how the imperfections in a performance carry meaning that technology alone cannot create. As AI generated music becomes more common and more convincing, Madison raises an essential question: what happens when flawless output replaces the earned, emotional labor of an artist. Blending personal experience with industry insight, she argues that human made music holds a depth and honesty that algorithms cannot replicate. She invites listeners to protect the soul of music, to support live experiences, and to keep creating with courage, reminding us that the pulse of music depends on the",
        "id": 4229213,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ct2gyCmD-xo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/ct2gyCmD-xo/hqdefault.jpg",
        "title": "Why Music Needs Our Humanity | Madison Harbour | TEDxYouth@JeffersonStreet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:27.227726+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:29:30+00:00",
        "description": "In this heartfelt talk, Levia Hatcher traces her family’s agricultural legacy across five generations, beginning with an enslaved farmer in the 1800s and extending to her own work on the land today. She reveals how farming shaped her family’s identity, strengthened their community, and built a tradition of resilience that she now feels called to continue. Hatcher places this personal history within a larger national crisis: the disappearance of Black farms and the loss of more than ninety percent of Black owned farmland over the last century. Blending history, science, and lived experience, she explains why farming knowledge matters at a time when many young people are moving away from agriculture and when the food we buy is increasingly shaped by chemicals and industrial processes. Through stories of harvesting corn under the summer sun and sharing crops with her neighbors, Levia shows how farming cultivates connection, generosity, and purpose. She invites audiences to begin their ow",
        "id": 4229214,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=CZJwE9tA9PI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CZJwE9tA9PI/hqdefault.jpg",
        "title": "Why farming still matters | Levia Harvey | TEDxYouth@JeffersonStreet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:27.400239+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:29:27+00:00",
        "description": "Esta charla nos invita a escuchar la música con otros oídos: no como un arte reservado a los escenarios o las aulas privadas, sino como un lenguaje universal que nos conecta, nos sana y nos transforma.\nDesde la experiencia en la terapia musical bajo el método Benenzon, descubrimos que los verdaderos logros no se miden en aplausos, sino en momentos de reconocimiento: cuando un niño o un trabajador se reconoce como instrumento, o cuando una persona con Alzheimer revive un recuerdo a través de una canción.\nLa charla inspira a ver la música como un espacio para sentir, crear y volver a creer.  Musico, cantante, profesora de música, terapista bajo el Modelo Benenzon This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4229215,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=tdAM4Vtltuk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/tdAM4Vtltuk/hqdefault.jpg",
        "title": "La música, puente invisible entre corazones | Diana Cabrera | TEDxSanta Rosa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:27.553644+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:28:30+00:00",
        "description": "In this powerful reflection on heritage and cultural memory, Addae' Lane guides us through a journey that reveals how African American music has always been more than entertainment. It has been a revolution, a form of resistance, and a means of survival. Moving from the spirituals birthed in the churches of the South to the rise of gospel, blues, jazz, soul, Motown, hip hop, and New Jack Swing, she shows how each generation carried stories of hope, pain, pride, and triumph through sound. Drawing on historical perspectives and her own personal history, Addae' illustrates how these musical traditions shaped her identity and inspired her commitment to preserving the legacies of the artists who came before her. In an era when conversations about removing African American history from classrooms continue to surface, she argues that music remains a living archive that cannot be erased. With clarity and conviction, she reminds us that the songs carried across oceans and across time are revol",
        "id": 4229216,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=ZUfy5RE8Sws",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/ZUfy5RE8Sws/hqdefault.jpg",
        "title": "Our Songs Are the Revolution | Addae’ Lane | TEDxYouth@JeffersonStreet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:27.771689+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:28:20+00:00",
        "description": "In this heartfelt reflection on creativity, culture, and courage, Lena shares how her earliest attempts at songwriting taught her a lesson that would shape her entire understanding of growth. From rewriting verses again and again as a child to navigating life as an Ethiopian student in the United States, she explores how imperfections in music, learning, and identity are not shortcomings but sources of authenticity and connection. Her message is clear and powerful: perfection is not the goal. Connection is. She invites the audience to embrace their cracks, celebrate the honesty in their flaws, and recognize that the imperfections we often try to hide are the very things that make us human, real, and unforgettable. Lina Samuel is a junior at Rockvale High School, where she pursues the Health Science pathway with an interest for helping others and advancing well-being in her community. A three-year DECA competitor and dedicated HOSA competitor, Samuel brings innovation and leadership to",
        "id": 4229217,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=RIUl2FrSyqc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/RIUl2FrSyqc/hqdefault.jpg",
        "title": "The Beauty of Imperfection | Lina Samuel | TEDxYouth@JeffersonStreet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:27.986330+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:28:04+00:00",
        "description": "En un mundo cada vez más interconectado pero a menudo desconectado en las conexiones humanas, esta charla propone un cambio de mentalidad poderoso: ver cada interacción profesional como una oportunidad para fortalecer el tejido social. Nos invita a invertir en el capital humano y relacional de nuestras comunidades, entendiendo que el verdadero progreso no se mide solo en cifras, sino en vínculos. Vendedora profesional, directora comercial de Pasión y Estrategia en Barquisimeto. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4229219,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=uk4YpjQRu-g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uk4YpjQRu-g/hqdefault.jpg",
        "title": "La venta como un acto noble de servicio | Maria Da Silva | TEDxSanta Rosa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:28.208146+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:27:46+00:00",
        "description": "In this powerful talk, Keona Gwinn reflects on the staggering financial and emotional realities families face when seeking quality medical care for their children—costs that can exceed half a million dollars. Born with spina bifida and raised within the coordinated, compassionate environment of Children’s Healthcare of Atlanta, Gwinn experienced firsthand what it means for a hospital to feel like home: unified providers, shared communication, and a system designed around the dignity of the child. She contrasts this lived reality with the fragmented care many families encounter and introduces the medical home model as a transformative, family-centered solution. With clarity, conviction, and hope, Gwinn challenges us to reimagine pediatric healthcare as a place of belonging, continuity, and coordinated support—where every child feels known, valued, and fully cared for. Keona Gwinn is a disability advocate, content creator, and Master of Public Health candidate from Atlanta, Georgia. Bor",
        "id": 4229220,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=zM7y27vSwGA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zM7y27vSwGA/hqdefault.jpg",
        "title": "Preserving the Music of Cultural Icons | Keona Gwinn | TEDxYouth@JeffersonStreet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:28.373112+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:27:40+00:00",
        "description": "In this timely and compelling talk, Jenna Hammoud invites audiences to confront a truth we often overlook: the artificial intelligence tools we trust every day are quietly learning from and amplifying our biases. Drawing from personal experiences, global examples, and emerging research, Hammoud reveals how AI systems can misrepresent voices, misidentify faces, and reinforce inequities across healthcare, education, employment, and everyday life. From an early encounter with a robot that failed to recognize her voice to real world cases where hiring algorithms favored men over women, she illustrates how these systems reflect the assumptions embedded in their training data. Yet Hammoud’s message is ultimately a hopeful one. Through AI literacy, curiosity, and the courage to question, she argues that we can interrupt these patterns and reshape technology to be more ethical, inclusive, and human centered. This talk challenges each of us to reflect on the power we hold, not only to use AI, ",
        "id": 4229221,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bjT3tmiRGCc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bjT3tmiRGCc/hqdefault.jpg",
        "title": "Seeing Beyond the Algorithm | Jenna Hammoud | TEDxYouth@JeffersonStreet",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T17:38:28.521304+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:26:05+00:00",
        "description": "We’re not lacking creativity—we’re lacking clarity. In an AI-driven world of endless content, the real challenge is creating with depth, purpose, and meaning instead of speed and noise. Dmitry Chislov-Starkin is a filmmaker and creative director who helps brands and creators craft original, emotionally resonant stories—merging AI, identity, and artistry to connect without compromise. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
        "id": 4229222,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=fDQ78IreXqw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fDQ78IreXqw/hqdefault.jpg",
        "title": "AI Isn't Neutral: It's What We Make It | Dmitry Chislov-Starkin | TEDxGrandJunction",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T16:29:35.047123+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T15:53:18+00:00",
        "description": "NOTE FROM TED: Some viewers may find elements of this talk to be distressing or objectionable. Contents only represent the speaker’s personal views and experiences. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nPoet Nicola Daniel-Symonette shares a gripping and deeply reflective TEDx talk about the beauty and complexity of mentorship. How the people who shape us can be inspiring, imperfect, and sometimes unexpectedly human. From a high-school literature teacher who awakened her love of Shakespeare, Achebe, Chaucer, and Brontë, to the moment a cherished mentor overstepped a boundary, Nicola reveals how guidance can empower us… and how growth sometimes requires stepping beyond the ones who once taught us.\nWith lyrical language and emotional cla",
        "id": 4228469,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=1M8VR6fH5hc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/1M8VR6fH5hc/hqdefault.jpg",
        "title": "To Me, With Love: My journey through poetry | Nicola Daniel-Symonette | TEDxMiramar Youth",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T16:29:35.386801+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T15:49:50+00:00",
        "description": "In “Dumplings Released My Demons – How Food Can Heal Generational Trauma,” Katie Chin shares a deeply personal journey from cultural shame and family loss to self-acceptance and pride. Through stories of growing up embarrassed by her Chinese heritage, surviving an emotionally abusive marriage, and witnessing her mother’s resilience as both a restaurateur and a grieving parent, she reveals how cooking—especially making dumplings—became a path to healing. This talk explores how food rituals can transform pain into connection, break cycles of trauma and empower us to reclaim our identities, one dumpling at a time. Katie Chin is an award-winning cookbook author, TV chef, playwright, LA City Commissioner and Culinary  Ambassador to the National Pediatric Cancer Foundation. Raised in her late mother Leeann Chin’s restaurants, Katie left her film marketing career to become a chef and follow in her mother’s footsteps.   She co-hosted PBS’s Double Happiness and has appeared on Food Network, Th",
        "id": 4228470,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=lqlYckyYNJs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lqlYckyYNJs/hqdefault.jpg",
        "title": "How food can repair families | Katie Chin | TEDxFargo",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "TEDx Talks",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T16:29:35.716636+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T15:48:49+00:00",
        "description": "NOTE FROM TED: Please do not look to this talk for medical advice. This talk only represents the speaker's personal views and understanding of stem cell therapy, disease, and longevity which remain an ongoing field of study. The FDA has not currently approved stem cell-based therapies for COVID-19, associated illnesses, and several other conditions in the talk. We've flagged this talk because it falls outside the content guidelines TED gives TEDx organizers. TEDx events are independently organized by volunteers. The guidelines we give TEDx organizers are described in more detail here: http://storage.ted.com/tedx/manuals/tedx_content_guidelines.pdf\n\nThe speaker explores how innovation and human ingenuity can push the boundaries of what’s possible for longevity and performance. He reflects on how modern lifestyles often drain our energy and creativity, and how regenerative thinking, not just in science but in mindset, can help us restore balance, resilience, and purpose. Through his jou",
        "id": 4228471,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=VZZ5QrOYWhM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 915,
        "source_url": "https://youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VZZ5QrOYWhM/hqdefault.jpg",
        "title": "New Lifestyle for New Challenges!! | Dr. Sairam Atluri | TEDxKPRIT",
        "vote": 0
    }
]