[
    {
        "age": null,
        "album": "",
        "author": "Vox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T22:56:01.615412+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T22:14:09+00:00",
        "description": "The Trump administration is now openly advancing a worldview built by alt-right white nationalists in the 2010s. At a Cabinet meeting on Tuesday, Trump railed against Somali immigrants — saying “I don’t want them in our country” because America could “go the wrong way if we keep taking in garbage.” This statement mirrors the alt-right idea that immigrants hailing from developing countries cannot under any circumstances adapt to America.\n\nVox senior correspondent Zack Beauchamp breaks down the alt-right roots of the administration’s immigration policies. \n\nSubscribe to our channel and turn on notifications (🔔) so you don't miss any videos: http://goo.gl/0bsAjO\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com.\n\nWatch our full video catalog: http://goo.gl/IZONyE\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom\nCheck out our articles: https://www.vox.com/\nListen to our podcasts:",
        "id": 4231832,
        "language": "en",
        "link": "https://www.youtube.com/shorts/a1uR3oN8DKs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 779,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCLXo7UDZvByw2ixzpQCufnA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/a1uR3oN8DKs/hqdefault.jpg",
        "title": "The dark reality behind Trump’s anti-immigrant rants #shorts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Vox",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:50:47.881791+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T18:00:49+00:00",
        "description": "Lithium is being called the new “white gold.”\n\nIn 2022, the price of this metal soared to nearly $70,000 per metric ton. Fueled by the global rise in electric vehicles and the proliferation of lithium-ion batteries, we now use nearly 28 times more lithium per capita than in the 1990s. After China, the US is the world’s second-largest consumer of lithium, yet it mines less than one percent of the global supply.\n\nTo rectify this lack of domestic lithium, the US government approved a $2.26 billion loan in October 2025 to Lithium Americas, a Canadian company developing Thacker Pass in northern Nevada, the largest lithium deposit ever discovered in the United States. But this major investment may have come a little too late.\n\nIn this video, we’ll explore how lithium is fueling the “white gold rush” in Nevada, whether or not the government’s investment in Thacker Pass will pay off, and what the history of mining ghost towns can tell us about the future of this critical mineral.\n\nMore from V",
        "id": 4229948,
        "language": "en",
        "link": "https://www.youtube.com/watch?v=bYzmx5qPWvM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 779,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCLXo7UDZvByw2ixzpQCufnA",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/bYzmx5qPWvM/hqdefault.jpg",
        "title": "Is lithium the new gold rush in the US?",
        "vote": 0
    }
]