[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T23:22:01.953997+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T22:22:00+00:00",
        "description": "An anonymous reader quotes a report from Politico: Five months after releasing a plan to accelerate the development of artificial intelligence, the Trump administration is turning to robots. Commerce Secretary Howard Lutnick has been meeting with robotics industry CEOs and is \"all in\" on accelerating the industry's development, according to three people familiar with the discussions who were granted anonymity to share details. The administration is considering issuing an executive order on robotics next year, according to two of the people. A Department of Commerce spokesperson said: \"We are committed to robotics and advanced manufacturing because they are central to bringing critical production back to the United States.\"\n \nThe Department of Transportation is also preparing to announce a robotics working group, possibly before the end of the year, according to one person familiar with the planning. A spokesperson for the department did not respond to a request for comment. There's gr",
        "id": 4232140,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/03/1737210/after-ai-push-trump-administration-is-now-looking-to-robots",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "After AI Push, Trump Administration Is Now Looking To Robots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T22:21:15.250696+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T21:21:00+00:00",
        "description": "Micron is shutting down its Crucial consumer RAM business in 2026 after nearly three decades, citing heavy demand from AI data centers. \"The AI-driven growth in the data center has led to a surge in demand for memory and storage,\" Sumit Sadana, EVP and chief business officer at Micron Technology, said in a statement. \"Micron has made the difficult decision to exit the Crucial consumer business in order to improve supply and support for our larger, strategic customers in faster-growing segments.\" Ars Technica reports: Micron said it will continue shipping Crucial consumer products through the end of its fiscal second quarter in February 2026 and will honor warranties on existing products. The company will continue selling Micron-branded enterprise products to commercial customers and plans to redeploy affected employees to other positions within the company.\n \nCrucial launched in 1996 during the Pentium era as Micron's consumer brand for RAM and storage upgrades. Over the years, the br",
        "id": 4231656,
        "language": "en-us",
        "link": "https://hardware.slashdot.org/story/25/12/03/2118251/after-nearly-30-years-crucial-will-stop-selling-ram-to-consumers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "After Nearly 30 Years, Crucial Will Stop Selling RAM To Consumers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T21:19:34.961026+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T20:20:00+00:00",
        "description": "HBO Max's 4K debut of Mad Men was botched after Lionsgate reportedly supplied the wrong file, leading to visible crew members where someone is seen pumping a vomit hose. Ars Technica reports: Mad Men ran on the AMC channel for seven seasons from 2007 to 2015. The show had a vintage aesthetic, depicting the 1960s advertising industry in New York City. Last month, HBO Max announced it would modernize the show by debuting a 4K version. The show originally aired in SD and HD resolutions and had not been previously made available in 4K through other means, such as Blu-ray.\n \nHowever, viewers were quick to spot problems with HBO Max's 4K Mad Men stream, the most egregious being visible crew members in the background of a scene. The episode was \"Red in the Face\" (Season 1, Episode 7), which was reportedly mislabeled. In it, Roger Sterling (John Slattery) throws up oysters. In the 4K version that was streaming on HBO Max, viewers could see someone pumping a vomit hose to make the fake puke fl",
        "id": 4231230,
        "language": "en-us",
        "link": "https://entertainment.slashdot.org/story/25/12/03/1728235/hbo-max-botches-mad-mens-4k-debut-after-streaming-wrong-file-showing-visible-crewmembers",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "HBO Max Botches Mad Men's 4K Debut After Streaming Wrong File Showing Visible Crewmembers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T20:17:38.575329+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T19:19:00+00:00",
        "description": "YouTube has launched its first-ever \"Recap\" for videos watched on the main platform, giving users personalized cards that showcase their top channels, interests, and a personality type based on their watch habits. The feature rolls out across North America today and globally this week. TechCrunch reports: Users can find their Recap directly on the YouTube homepage or under the \"You\" tab. Recaps are accessible on mobile devices and desktop. YouTube says the new feature was requested by users and that it conducted over 50 different concept tests before landing on the final product. Alongside the launch of Recap, YouTube also released trend charts showcasing the top creators, podcasts, and songs of the year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+Releases+Its+First-Ever+Recap+of+Videos+You've+Watched%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F12%2F03%2F1721213%2F%3Futm_source%3Dtwitter%26utm_medi",
        "id": 4230731,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/03/1721213/youtube-releases-its-first-ever-recap-of-videos-youve-watched",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "YouTube Releases Its First-Ever Recap of Videos You've Watched",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T19:16:33.490173+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T18:18:00+00:00",
        "description": "India has withdrawn its order requiring Apple and other smartphone makers to preinstall the government's Sanchar Saathi app after public backlash and privacy concerns. AppleInsider reports: On November 28, the India Ministry of Communication issued a secret directive to Apple and other smartphone manufacturers, requiring the preinstallation of a government-backed app. Less than a week later, the order has been rescinded. The withdrawal on Wednesday means Apple doesn't have to preload the Sanchar Saathi app onto iPhones sold in the country, in a way that couldn't be \"disabled or restricted.\" [...]\n \nIn pulling back from the demand, the government insisted that the app had an \"increasing acceptance\" among citizens. There was a tenfold spike of new user registrations on Tuesday alone, with over 600,000 new users made aware of the app from the public debacle. India Minister of Communications Jyotiraditya Scindia took a moment to insist that concerns the app could be used for increased sur",
        "id": 4230280,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/12/03/1712242/india-pulls-its-preinstalled-iphone-app-demand",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "India Pulls Its Preinstalled iPhone App Demand",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:00:47.505280+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T17:17:00+00:00",
        "description": "Despite Windows 10 losing free support, Statcounter shows Windows 11 holding only a modest lead of 53.7% market share compared to Windows 10's 42.7%. Analysts say the slow transition reflects both hardware limitations and a lack of must-have Windows 11 features compelling organizations to refresh their fleets. The Register reports: The Register spoke to Lansweeper principal technical evangelist Esben Dochy, who noted that consumers were more likely to have devices that couldn't be upgraded or follow the \"if it ain't broke, don't fix it\" rule when it comes to change. He also pointed out consumers in the EU get Microsoft Extended Security Updates (ESU) for free.\n \nFor businesses, though, it's different. Dochy told us: \"The primary blocker is slow change management processes. These can be slow due to bad planning, lack of resources, difficulty in execution (in highly distributed organizations) etc. \"The ESU are used to be secure while those change management processes take place, but org",
        "id": 4229574,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/03/174257/windows-11-growth-slows-as-millions-stick-with-windows-10",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Windows 11 Growth Slows As Millions Stick With Windows 10",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T18:00:47.681355+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T16:16:00+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Multiple divisions at Microsoft have lowered sales growth targets for certain artificial intelligence products after many sales staff missed goals in the fiscal year that ended in June, The Information reported on Wednesday. It is rare for Microsoft to lower quotas for specific products, the report said, citing two salespeople in the Azure cloud unit. The division is closely watched by investors as it is the main beneficiary of Microsoft's AI push. [...]\n \nThe Information report said Carlyle Group last year started using Copilot Studio to automate tasks such as meeting summaries and financial models, but cut its spending on the product after flagging Microsoft about its struggles to get the software to reliably pull data from other applications. The report shows the industry was in the early stages of adopting AI, said D.A. Davidson analyst Gil Luria. \"That does not mean there isn't promise for AI products to help companies become more",
        "id": 4229575,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/03/1656245/microsoft-lowers-ai-software-sales-quota-as-customers-resist-new-products",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Microsoft Lowers AI Software Sales Quota As Customers Resist New Products",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T15:46:39.426408+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T15:15:00+00:00",
        "description": "schwit1 shares a report from CNN: A private Chinese space firm successfully sent its Zhuque-3 rocket to orbit but failed in its historic attempt to re-land the rocket booster Wednesday -- the first such trial by a Chinese firm as the country's growing commercial space sector races to catch up with American rivals like SpaceX. The rocket entered orbit as planned, but its first stage did not successfully return to a landing site, instead crashing down, the company said in a statement.\n \n\"An anomaly occurred after the first-stage engine ignited during the landing phase, preventing a soft landing on the designated recovery pad,\" the statement said. \"The debris landed at the edge of the recovery area, resulting in a failed recovery test.\" The team would \"conduct a comprehensive review\" and continue to \"advance the verification and application of reusable rocket technology in future missions,\" the statement added. You can watch a video of the launch and subsequent crash here.<p><div class=\"",
        "id": 4228205,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/03/1510248/chinese-reusable-booster-explodes-during-first-orbital-test",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Chinese Reusable Booster Explodes During First Orbital Test",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T14:41:09.662003+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T14:14:00+00:00",
        "description": "The Zig Software Foundation has quit GitHub after years of unresolved GitHub Actions bugs -- including a \"safe_sleep\" script that could spin forever and cripple CI runners. Zig leadership puts the blame on Microsoft's growing AI-first priorities and declining engineering quality. Other open-source developers are voicing similar frustrations. The Register reports: The drama began in April 2025 when GitHub user AlekseiNikiforovIBM started a thread titled \"safe_sleep.sh rarely hangs indefinitely.\" GitHub addressed the problem in August, but didn't reveal that in the thread, which remained open until Monday. That timing appears notable. Last week, Andrew Kelly, president and lead developer of the Zig Software Foundation, announced that the Zig project is moving to Codeberg, a non-profit git hosting service, because GitHub no longer demonstrates commitment to engineering excellence.\n \nOne piece of evidence he offered for that assessment was the \"safe_sleep.sh rarely hangs indefinitely\" thr",
        "id": 4227552,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/12/03/070228/zig-quits-github-says-microsofts-ai-obsession-has-ruined-the-service",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Zig Quits GitHub, Says Microsoft's AI Obsession Has Ruined the Service",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T13:37:07.371411+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T13:13:00+00:00",
        "description": "An anonymous reader quotes a report from GamesIndustry.biz: Japanese game makers are struggling to locate affordable commercial fonts after one of the country's leading font licensing services raised the cost of its annual plan from around $380 to $20,500 (USD). As reported by Gamemakers and GameSpark and translated by Automaton, Fontworks LETS discontinued its game license plan at the end of November. The expensive replacement plan -- offered through Fontwork's parent company, Monotype -- doesn't even provide local pricing for Japanese developers, and comes with a 25,000 user-cap, which is likely not workable for Japan's bigger studios.\n \nThe problem is further compounded by the difficulties and complexities of securing fonts that can accurately transcribe Kanji and Katakana characters. UI/UX designer Yamanaka stressed that this would be particularly problematic for live service games; even if studios moved quickly and switched to fonts available through an alternate licensee, they w",
        "id": 4227039,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/03/0649236/japanese-devs-face-font-licensing-dilemma-as-annual-costs-increase-from-380-to-20k",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Japanese Devs Face Font Licensing Dilemma as Annual Costs Increase From $380 To $20K",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T10:24:22.835875+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T10:10:00+00:00",
        "description": "China's private launch firm LandSpace is preparing the debut flight of its Zhuque-3 rocket, aiming to become the country's first to land a reusable orbital-class booster using a Falcon-9-style return profile. Ars Technica reports: Liftoff could happen around 11 pm EST tonight (04:00 UTC Wednesday), or noon local time at the Jiuquan Satellite Launch Center in northwestern China. Airspace warning notices advising pilots to steer clear of the rocket's flight path suggest LandSpace has a launch window of about two hours. When it lifts off, the Zhuque-3 (Vermillion Bird-3) rocket will become the largest commercial launch vehicle ever flown in China. What's more, LandSpace will become the first Chinese launch provider to attempt a landing of its first stage booster, using the same tried-and-true return method pioneered by SpaceX and, more recently, Blue Origin in the United States.\n \nConstruction crews recently finished a landing pad in the remote Gobi Desert, some 240 miles (390 kilometers",
        "id": 4225655,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/03/0457240/landspace-could-become-chinas-first-company-to-land-a-reusable-rocket",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "LandSpace Could Become China's First Company To Land a Reusable Rocket",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T08:11:45.779387+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T07:07:00+00:00",
        "description": "Bruce66423 shares a report from the Los Angeles Times: Tattoo ink doesn't just sit inertly in the skin. New research shows it moves rapidly into the lymphatic system, where it can persist for months, kill immune cells, and even disrupt how the body responds to vaccines. Scientists in Switzerland used a mouse model to trace what happens after tattooing. Pigments drained into nearby lymph nodes within minutes and continued to accumulate for two months, triggering immune-cell death and sustained inflammation. The ink also weakened the antibody response to Pfizer Inc. and BioNTech SE's COVID vaccine when the shot was administered in tattooed skin. In contrast, the same inflammation appeared to boost responses to an inactivated flu vaccine. \"This work represents the most extensive study to date regarding the effect of tattoo ink on the immune response and raises serious health concerns associated with the tattooing practice,\" the researchers said. \"Our work underscores the need for further",
        "id": 4224983,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/03/0447236/study-finds-tattoo-ink-moves-through-the-body-killing-immune-cells",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Study Finds Tattoo Ink Moves Through the Body, Killing Immune Cells",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T06:02:01.885064+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T05:05:00+00:00",
        "description": "Anthropic has made its first acquisition by buying Bun, the engine behind its fast-growing Claude Code agent. The move strengthens Anthropic's push into enterprise developer tooling as it scales Claude Code with major backers like Microsoft, Nvidia, Amazon, and Google. Adweek reports: Claude Code is a coding agent that lets developers write, debug and interpret code through natural-language instructions. Claude Code had already hit $1 billion in revenue six months since its public debut in May, according to a LinkedIn post from Anthropic's chief product officer, Mike Krieger. The coding agent continues to barrel toward scale with customers like Netflix, Spotify, and Salesforce. Further reading: Meet Bun, a Speedy New JavaScript Runtime<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+Acquires+Bun+In+First+Acquisition%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F25%2F12%2F03%2F0437256%2F%3Futm_source%3D",
        "id": 4224398,
        "language": "en-us",
        "link": "https://developers.slashdot.org/story/25/12/03/0437256/anthropic-acquires-bun-in-first-acquisition",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Anthropic Acquires Bun In First Acquisition",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T03:52:04.541907+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T03:03:00+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: The San Francisco city attorney filed on Tuesday the nation's first government lawsuit against food manufacturers over ultraprocessed fare (source may be paywalled; alternative source), arguing that cities and counties have been burdened with the costs of treating diseases that stem from the companies' products. David Chiu, the city attorney, sued 10 corporations that make some of the country's most popular food and drinks. Ultraprocessed products now comprise 70 percent of the American food supply and fill grocery store shelves with a kaleidoscope of colorful packages. Think Slim Jim meat sticks and Cool Ranch Doritos. But also aisles of breads, sauces and granola bars marketed as natural or healthy.\n \nIt is a rare issue on which the liberal leaders in San Francisco City Hall are fully aligned with the Trump administration, which has targeted ultraprocessed foods as part of its Make America Healthy Again mantra. Mr. Chiu's ",
        "id": 4223856,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/12/02/2229255/san-francisco-will-sue-ultraprocessed-food-companies",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "San Francisco Will Sue Ultraprocessed Food Companies",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T02:44:58.063856+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T02:02:00+00:00",
        "description": "A Waymo robotaxi struck a small unleashed dog in San Francisco -- just weeks after another Waymo killed a beloved neighborhood cat. The dog's condition is unknown. The Los Angeles Times reports: The incident occurred near the intersection of Scott and Eddy streets and drew a small crowd, according to social media posts. A person claiming to be one of the passengers posted about the accident on Reddit. \"Our Waymo just ran over a dog,\" the passenger wrote. \"Kids saw the whole thing.\" The passenger described the dog as between 20 and 30 pounds and wrote that their family was traveling back home after a holiday tree lighting event. The National Highway Traffic Safety Administration has recorded Waymo taxis as being involved in at least 14 animal collisions since 2021.\n \n\"Unfortunately, a Waymo vehicle made contact with a small, unleashed dog in the roadway,\" a company spokesperson said. \"We are dedicated to learning from this situation and how we show up for our community as we continue i",
        "id": 4223573,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/02/2322203/waymo-hits-a-dog-in-san-francisco-reigniting-safety-debate",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Waymo Hits a Dog In San Francisco, Reigniting Safety Debate",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T01:40:19.378016+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T01:01:00+00:00",
        "description": "During last month's KubeCon North America in Atlanta, Kubernetes maintainers announced the upcoming retirement of Ingress NGINX. \"Best-effort maintenance will continue until March 2026,\" noted the Kubernetes SIG Network and the Security Response Committee. \"Afterward, there will be no further releases, no bugfixes, and no updates to resolve any security vulnerabilities that may be discovered.\" In a recent op-ed for The Register, Steven J. Vaughan-Nichols reflects on the decision and speculates about what might have prevented this outcome: Ingress NGINX, for those who don't know it, is an ingress controller in Kubernetes clusters that manages and routes external HTTP and HTTPS traffic to the cluster's internal services based on configurable Ingress rules. It acts as a reverse proxy, ensuring that requests from clients outside the cluster are forwarded to the correct backend services within the cluster according to path, domain, and TLS configuration. As such, it's vital for network tra",
        "id": 4223300,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/12/02/2253248/kubernetes-is-retiring-its-popular-ingress-nginx-controller",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Kubernetes Is Retiring Its Popular Ingress NGINX Controller",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-12-03T00:36:14.127771+00:00",
        "date_dead_since": null,
        "date_published": "2025-12-03T00:00:00+00:00",
        "description": "OpenAI has reportedly issued a \"code red\" on Monday, pausing projects like ads, shopping agents, health tools, and its Pulse assistant to focus entirely on improving ChatGPT. \"This includes core features like greater speed and reliability, better personalization, and the ability to answer more questions,\" reports The Verge, citing a memo reported by the Wall Street Journal and The Information. \"There will be a daily call for those tasked with improving the chatbot, the memo said, and Altman encouraged temporary team transfers to speed up development.\" From the report: The newfound urgency illustrates an inflection point for OpenAI as it spends hundreds of billions of dollars to fund growth and figures out a path to future profitability. It is also something of a full-circle moment in the AI race. Google, which declared its own \"code red\" after the arrival of ChatGPT, is a particular concern. Google's AI user base is growing -- helped by the success of popular tools like the Nano Banan",
        "id": 4223024,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/12/02/2221238/openai-declares-code-red-as-google-catches-up-in-ai-race",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "OpenAI Declares 'Code Red' As Google Catches Up In AI Race",
        "vote": 0
    }
]