[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T20:14:08.466587+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T19:32:00+00:00",
        "description": "In late April Meta introduced its Meta AI app, which included something called a Discover feed. (\"You can see the best prompts people are sharing, or remix them to make them your own.\") \nBut while Meta insisted \"you're in control: nothing is shared to your feed unless you choose to post it\" &mdash; just two days later Business Insider noticed that \"clearly, some people don't realize they're sharing personal stuff.\"\nTo be clear, your AI chats are not public by default &mdash; you have to choose to share them individually by tapping a share button. Even so, I get the sense that some people don't really understand what they're sharing, or what's going on. \n\nLike the woman with the sick pet turtle. Or another person who was asking for advice about what legal measures he could take against his former employer after getting laid off. Or a woman asking about the effects of folic acid for a woman in her 60s who has already gone through menopause. Or someone asking for help with their Blue Cro",
        "id": 2881544,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/08/1929242/mozilla-criticizes-metas-invasive-feed-of-users-ai-prompts-demands-its-shutdown?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mozilla Criticizes Meta's 'Invasive' Feed of Users' AI Prompts, Demands Its Shutdown",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T19:09:11.459742+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T18:09:00+00:00",
        "description": "Last month, Duolingo CEO Luis von Ahn \"shared on LinkedIn an email he had sent to all staff announcing Duolingo was going 'AI-first',\" remembers the Financial Times. \n\n\"I did not expect the amount of blowback,\" he admits....\n\nHe attributes this anger to a general \"anxiety\" about technology replacing jobs. \"I should have been more clear to the external world,\" he reflects on a video call from his office in Pittsburgh. \"Every tech company is doing similar things [but] we were open about it....\" \n\nSince the furore, von Ahn has reassured customers that AI is not going to replace the company's workforce. There will be a \"very small number of hourly contractors who are doing repetitive tasks that we no longer need\", he says. \"Many of these people are probably going to be offered contractor jobs for other stuff.\" Duolingo is still recruiting if it is satisfied the role cannot be automated. Graduates who make up half the people it hires every year \"come with a different mindset\" because they ",
        "id": 2881170,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/08/185209/after-ai-first-promise-duolingo-ceo-admits-i-did-not-expect-the-blowback?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "After 'AI-First' Promise, Duolingo CEO Admits 'I Did Not Expect the Blowback'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T17:00:02.147179+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T16:34:00+00:00",
        "description": "The New York Times reports:\nCalifornia State University announced this year that it was making ChatGPT available to more than 460,000 students across its 23 campuses to help prepare them for \"California's future A.I.-driven economy.\" Cal State said the effort would help make the school \"the nation's first and largest A.I.-empowered university system...\" Some faculty members have already built custom chatbots for their students by uploading course materials like their lecture notes, slides, videos and quizzes into ChatGPT. \nAnd other U.S. campuses including the University of Maryland are also \"working to make A.I. tools part of students' everyday experiences,\" according to the article. It's all part of an OpenAI initiative \"to overhaul college education &mdash; by embedding its artificial intelligence tools in every facet of campus life.\" \n\nThe Times calls it \"a national experiment on millions of students.\"\n\nIf the company's strategy succeeds, universities would give students A.I. assi",
        "id": 2880328,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/08/0239237/welcome-to-campus-heres-your-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'Welcome to Campus. Here's Your ChatGPT.'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T15:54:10.153414+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T15:34:00+00:00",
        "description": "It's no longer a hypothetical question, writes the Washington Post. \"In recent years, scientists have devised powerful genetic tools that may be able to eradicate mosquitoes and other pests once and for all.\" \n\nBut along with the ability to fight malaria, dengue, West Nile virus and other serious diseases, \"the development of this technology also raises a profound ethical question: When, if ever, is it okay to intentionally drive a species out of existence...?\"\n\nWhen so many wildlife conservationists are trying to save plants and animals from disappearing, the mosquito is one of the few creatures that people argue is actually worthy of extinction. Forget about tigers or bears; it's the tiny mosquito that is the deadliest animal on Earth. The human misery caused by malaria is undeniable. Nearly 600,000 people died of the disease in 2023, according to the World Health Organization, with the majority of cases in Africa... But recently, the Hastings Center for Bioethics, a research instit",
        "id": 2880013,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/07/0630231/we-finally-may-be-able-to-rid-the-world-of-mosquitoes-but-should-we?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "'We Finally May Be Able to Rid the World of Mosquitoes. But Should We?'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T14:49:01.951493+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T14:34:00+00:00",
        "description": "The Associated Press reports that on Friday, U.K. High Court justice Victoria Sharp and fellow judge Jeremy Johnson ruled on the possibility of false information being submitted to the court. Concerns had been raised by lower-court judges about \"suspected use by lawyers of generative AI tools to produce written legal arguments or witness statements which are not then checked.\"\nIn a ruling written by Sharp, the judges said that in a 90 million pound ($120 million) lawsuit over an alleged breach of a financing agreement involving the Qatar National Bank, a lawyer cited 18 cases that did not exist. The client in the case, Hamad Al-Haroun, apologized for unintentionally misleading the court with false information produced by publicly available AI tools, and said he was responsible, rather than his solicitor Abid Hussain. But Sharp said it was \"extraordinary that the lawyer was relying on the client for the accuracy of their legal research, rather than the other way around.\" \nIn the other ",
        "id": 2879667,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/08/036219/could-uk-lawyers-face-life-in-prison-for-citing-fake-ai-generated-cases?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Could UK Lawyers Face Life in Prison for Citing Fake AI-Generated Cases?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T12:39:05.201495+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T11:34:00+00:00",
        "description": "Last year's Pentagon report reviewing UFO reports \"left out the truth behind some of the foundational myths about UFOs,\" reports the Wall Street Journal. \n\"The Pentagon itself sometimes deliberately fanned the flames, in what amounted to the U.S. government targeting its own citizens with disinformation.\"\n\nThe congressionally ordered probe took investigators back to the 1980s, when an Air Force colonel visited a bar near Area 51, a top-secret site in the Nevada desert. He gave the owner photos of what might be flying saucers. The photos went up on the walls, and into the local lore went the idea that the U.S. military was secretly testing recovered alien technology. But the colonel was on a mission &mdash; of disinformation. The photos were doctored, the now-retired officer confessed to the Pentagon investigators in 2023. The whole exercise was a ruse to protect what was really going on at Area 51: The Air Force was using the site to develop top-secret stealth fighters, viewed as a cr",
        "id": 2879011,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/08/0520236/how-false-ufo-stories-were-created---sometimes-deliberately---by-the-us-military?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "How False UFO Stories Were Created - Sometimes Deliberately - by the US Military",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T08:19:03.706827+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T07:34:00+00:00",
        "description": "An anonymous reader shared this report from The New York Times:\n\nRussian counterintelligence agents are analyzing data from the popular Chinese messaging and social media app WeChat to monitor people who might be in contact with Chinese spies, according to a Russian intelligence document obtained by The New York Times. The disclosure highlights the rising level of concern about Chinese influence in Russia as the two countries deepen their relationship. As Russia has become isolated from the West over its war in Ukraine, it has become increasingly reliant on Chinese money, companies and technology. But it has also faced what the document describes as increased Chinese espionage efforts. \n\nThe document indicates that the Russian domestic security agency, known as the F.S.B., pulls purloined data into an analytical tool known as \"Skopishche\" (a Russian word for a mob of people). Information from WeChat is among the data being analyzed, according to the document... One Western intelligenc",
        "id": 2877913,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/08/0139238/russian-spies-are-analyzing-data-from-chinas-wechat-app?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Russian Spies Are Analyzing Data From China's WeChat App",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T03:59:05.774266+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T03:34:00+00:00",
        "description": "An anonymous reader shared this report from SFGate about a lawsuit alleging a \"warrantless drone surveillance program\" that's \"trampling residents' right to privacy\":\n\nSonoma County has been accused of deploying hundreds of drone flights over residents in a \"runaway spying operation\"... according to a lawsuit filed Wednesday by the American Civil Liberties Union. The North Bay county of Sonoma initially started the 6-year-old drone program to track illegal cannabis cultivation, but the lawsuit alleges that officials have since turned it into a widespread program to catch unrelated code violations at residential properties and levy millions of dollars in fines. The program has captured 5,600 images during more than 700 flights, the lawsuit said... \n\nMatt Cagle, a senior staff attorney with the ACLU Foundation of Northern California, said in a Wednesday news release that the county \"has hidden these unlawful searches from the people they have spied on, the community, and the media....\" ",
        "id": 2877132,
        "language": null,
        "link": "https://yro.slashdot.org/story/25/06/07/2346244/aclu-accuses-california-local-governments-drones-of-runaway-spying-operation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "ACLU Accuses California Local Government's Drones of 'Runaway Spying Operation'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T01:49:04.188594+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T01:34:00+00:00",
        "description": "AppleInsider reports:\n\nThe engineer behind much of the Mac's early graphical user interfaces, QuickDraw, MacPaint, Hypercard and much more, William D. \"Bill\" Atkinson, died on June 5 of complications from pancreatic cancer... \nAtkinson, who built a post-Apple career as a noted nature photographer, worked at Apple from 1978 to 1990. Among his lasting contributions to Apple's computers were the invention of the menubar, the selection lasso, the \"marching ants\" item selection animation, and the discovery of a midpoint circle algorithm that enabled the rapid drawing of circles on-screen. \nHe was Apple Employee No. 51, recruited by Steve Jobs. Atkinson was one of the 30 team members to develop the first Macintosh, but also was principle designer of the Lisa's graphical user interface (GUI), a novelty in computers at the time. He was fascinated by the concept of dithering, by which computers using dots could create nearly photographic images similar to the way newspapers printed photos. He ",
        "id": 2876852,
        "language": null,
        "link": "https://apple.slashdot.org/story/25/06/08/016210/bill-atkinson-hypercard-creator-and-original-mac-team-member-dies-at-age-74?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Bill Atkinson, Hypercard Creator and Original Mac Team Member, Dies at Age 74",
        "vote": 0
    }
]