[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T16:14:20.125154+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T15:30:05+00:00",
        "description": "Coming from developer and publisher 11 bit studios – with brutal survival game This War of Mine and city-building survivor Frostpunk to their name – is The Alters, the team’s latest stab at the survival genre. \n\nThis one tells the story of Jan Dolski, the sole survivor of an ill-fated space expedition, and his mission to evade a harsh sun’s radiation. Base building, resource management, crafting, a keen observation of day-and-night cycles, \n\nThe Alters features all the survival mechanics you’ll recognize from other games of the genre, but there’s a twist in the tale: Jan needs clones of himself to ensure his survival. Differing skills, emotions, and experience typify each Alter, with their collective morale of importance as much as their ability to solve specific problems.",
        "id": 2880050,
        "language": null,
        "link": "https://www.youtube.com/watch?v=5bTc8yLMxLs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5bTc8yLMxLs/hqdefault.jpg",
        "title": "The Alters - 15 Things You NEED To Know Before You Buy (A Game Where You Clone Yourself)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T10:50:34.698029+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T10:30:18+00:00",
        "description": "Atomfall’s first DLC is now out and it’s a decently sized story expansion to boot. Wicked Isle takes place on a separate island situated near the Windscale Plant. Hop on the new boatman’s ferry in Wyndham and you’re there…well, if you’ve paid the DLC’s $19.99 price tag, that is.\n\nThe map of the new island is comparable to Casterfell Woods from the base game. I didn’t particularly care for all the repeated enemies and backtracking that quests demand, but it’s not a bad DLC all told. \n\nThe story and characters of Wicked Isle save it from being a total disappointment. That and the clever branching gameplay/dialogue, which players can use or experiment at their discretion. Wicked Isle also includes a new ending for the main game, so returning players can have a brand new playthrough path to try out.",
        "id": 2878424,
        "language": null,
        "link": "https://www.youtube.com/watch?v=cPrpMflwxPg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/cPrpMflwxPg/hqdefault.jpg",
        "title": "Atomfall: Wicked Isle Story DLC Review - A Step Down From The Base Game",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-08T10:50:34.889971+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-08T10:30:16+00:00",
        "description": "With how much Warhammer 40,000: Space Marine 2 blows up, it makes sense that the original would come back in some form or another. Cue the Master Crafted Edition, which offers higher resolution textures, 4K support, a modern control scheme, revamped audio and better character models.\n\nWhile the differences can be difficult to judge without comparing them side by side with the original, Space Marine's characters, effects and lighting look noticeably crisper. Anti-aliasing from a distance can look less than smooth at times, and aside from some additional details, environmental texture quality looks very similar.\n\nNevertheless, if you never played the original and want to give it another go, Warhammer 40,000: Space Marine - Master Crafted Edition is worth the purchase, especially with all the post-launch content included. The campaign alone is worth the price of admission, even if it can feel short for some, and the combat is fantastic.",
        "id": 2878425,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Uo5NoJr3xB4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Uo5NoJr3xB4/hqdefault.jpg",
        "title": "Warhammer 40,000: Space Marine - Master Crafted Edition Review - How GOOD Is This Remaster?",
        "vote": 0
    }
]