[
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T23:17:00.677858+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T22:36:00+00:00",
        "description": "What happens if you track how much heat enters Earth's atmosphere and how much heat leaves? \n\nYou discover that Earth's energy budget \"is now well and truly out of balance,\" three climate researchers write at The Conversation:\n\n\nOur recent research found this imbalance has more than doubled over the last 20 years. Other researchers have come to the same conclusions. This imbalance is now substantially more than climate models have suggested... These findings suggest climate change might well accelerate in the coming years... \n\n[T]he burning of coal, oil and gas has now added more than two trillion tonnes of carbon dioxide and other greenhouse gases to the atmosphere. These trap more and more heat, preventing it from leaving. Some of this extra heat is warming the land or melting sea ice, glaciers and ice sheets. But this is a tiny fraction. Fully 90% has gone into the oceans due to their huge heat capacity... \n\nThe doubling of the energy imbalance has come as a shock, because the soph",
        "id": 3048229,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/29/2233252/earth-is-trapping-much-more-heat-than-climate-models-forecast?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Earth is Trapping Much More Heat Than Climate Models Forecast",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T22:12:02.234279+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T21:34:00+00:00",
        "description": "The Free Software Foundation is a non-profit &mdash; and they're having some fun with it. \n\nThey've just announced a summer fundraiser, \"and that means the GNU Press Shop is open!\"\nFrom now until July 28, you can buy your FSF gear at the GNU Press shop. First and foremost, there's the launch of the FSF's fortieth anniversary shirt in a summery yellow. We're taking orders for a limited time for these (until July 28), and then printing them &mdash; you should have yours on your shoulders a few weeks after the shop closes. \nWe've also restocked some favorites in the shop: \n\n- A fresh batch of the popular Ada &amp; Zangemann: A Tale of Software, Skateboards, and Raspberry Ice Cream book by Matthias Kirschner from the Free Software Foundation Europe (FSFE). This tale of software, skateboards, and raspberry ice cream teaches kids how neat and exciting it is having control over your software, a perfect fun summer read! \n\n- Reading is hard in the glaring sun, so shade your eyes with a freshly",
        "id": 3047951,
        "language": null,
        "link": "https://news.slashdot.org/story/25/06/29/2132204/for-the-free-software-foundations-summer-fundraiser-the-gnu-press-shop-is-open?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "For the Free Software Foundation's Summer Fundraiser, the 'GNU Press Shop' is Open",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T21:06:06.731661+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T19:59:00+00:00",
        "description": "An anonymous reader shared this report from the tech news site The Register:\n\nThe U.S. Cybersecurity and Infrastructure Security Agency (CISA) and the National Security Agency (NSA) this week published guidance urging software developers to adopt memory-safe programming languages. \"The importance of memory safety cannot be overstated,\" the inter-agency report says... \n\nThe CISA/NSA report revisits the rationale for greater memory safety and the government's calls to adopt memory-safe languages (MSLs) while also acknowledging the reality that not every agency can change horses mid-stream. \"A balanced approach acknowledges that MSLs are not a panacea and that transitioning involves significant challenges, particularly for organizations with large existing codebases or mission-critical systems,\" the report says. \"However, several benefits, such as increased reliability, reduced attack surface, and decreased long-term costs, make a strong case for MSL adoption.\" \nThe report cites how Goog",
        "id": 3047712,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/29/1956256/new-nsacisa-report-again-urges-the-use-of-memory-safe-programming-language?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New NSA/CISA Report Again Urges the Use of Memory-Safe Programming Language",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T18:56:53.708239+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T18:49:00+00:00",
        "description": "Just four weeks after an early June flight to the edge of space, Blue Origin has again carried six more passengers there and back again, reports CBS News, noting that the 10-minute ride was Blue Origin's 13th flight \"out of the discernible atmosphere.\"\n\nThe New Shepard capsule's stubby single-stage booster roared to life just after 9:38 a.m. EDT, throttled up to full thrust and smoothly climbed away from Blue Origin's launch site near Van Horn, Texas. The hydrogen-fueled BE-3 engine powering the New Shepard fired for about two-and-a-half minutes, accelerating the spacecraft to just under three times the speed of sound. \n\nThe capsule then separated from the booster and continued coasting upward along its up-and-down trajectory. At that point, the passengers &mdash; Allie and Carl Kuehner, Leland Larson, Freddie Rescigno Jr., Jim Sitkin and Owolabi Salis, the first Nigerian to fly in space &mdash; began enjoying about three minutes of weightlessness. Free to unstrap and float about the ",
        "id": 3047076,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/29/1841252/blue-origin-just-launched-six-more-passengers-to-the-edge-of-space?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Blue Origin Just Launched Six More Passengers to the Edge of Space",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T18:56:53.917436+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T17:49:00+00:00",
        "description": "\"The potential threat of bosses attempting to replace human workers with AI agents is just one of many compounding reasons people are critical of generative AI...\" writes Wired, arguing that there's an AI backlash that \"keeps growing strong.\" \n\n\n\"The pushback from the creative community ramped up during the 2023 Hollywood writer's strike, and continued to accelerate through the current wave of copyright lawsuits brought by publishers, creatives, and Hollywood studios.\" And \"Right now, the general vibe aligns even more with the side of impacted workers.\"\n\n\"I think there is a new sort of ambient animosity towards the AI systems,\" says Brian Merchant, former WIRED contributor and author of Blood in the Machine, a book about the Luddites rebelling against worker-replacing technology. \"AI companies have speedrun the Silicon Valley trajectory.\" Before ChatGPT's release, around 38 percent of US adults were more concerned than excited about increased AI usage in daily life, according to the P",
        "id": 3047077,
        "language": null,
        "link": "https://it.slashdot.org/story/25/06/29/1747204/has-an-ai-backlash-begun?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Has an AI Backlash Begun?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:52:13.384794+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T16:34:00+00:00",
        "description": "The problem? \"Companies want their products and brands to appear in chatbot results,\" reports 9to5Mac. And \"Since Reddit forms a key part of the training material for Google's AI, then one effective way to make that happen is to spam Reddit.\"\n\nHuffman has confirmed to the Financial Times that this is happening, with companies using AI bots to create fake posts in the hope that the content will be regurgitated by chatbots: \n\"For 20 years, we've been fighting people who have wanted to be popular on Reddit,\" Huffman said... \"If you want to show up in the search engines, you try to do well on Reddit, and now the LLMs, it's the same thing. If you want to be in the LLMs, you can do it through Reddit.\" \n\nMultiple ad agency execs confirmed to the FT that they are indeed \"posting content on Reddit to boost the likelihood of their ads appearing in the responses of generative AI chatbots.\" Huffman says that AI bots are increasingly being used to make spam posts, and Reddit is trying to block the",
        "id": 3046231,
        "language": null,
        "link": "https://tech.slashdot.org/story/25/06/28/1649245/to-spam-ai-chatbots-companies-spam-reddit-with-ai-generated-posts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "To Spam AI Chatbots, Companies Spam Reddit with AI-Generated Posts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:52:13.609636+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T15:34:00+00:00",
        "description": "In its first 10 hours the Rubin space telescope found 2,104 never-before-seen asteroids in our solar system. And Gizmodo reports the data went directly to the International Astronomical Union's Minor Planet Center (MPC), which \"plays an essential role in the early detection and monitoring of asteroids that threaten Earth.\"\n The MPC has spent years preparing for the deluge of data from Rubin, ramping up its software to process massive amounts of observations. When the first round officially came flooding in on Monday, it was \"nerve-racking and exciting simultaneously,\" Matthew Payne, MPC director, told Gizmodo. \n\n But Space.com explains how extraordinary that is. \"There are approximately a million known asteroids in our cosmic neighborhood; over the next few years, Rubin could very well hike that figure up to five million.\"\n\n\n\"This is five times more than all the astronomers in the world discovered during the last 200 years since the discovery of the first asteroid,\" &#197;&#189;eljko ",
        "id": 3046232,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/29/0119223/just-how-much-space-data-will-the-rubin-observatory-collect?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Just How Much Space Data Will the Rubin Observatory Collect?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:52:14.128175+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T14:34:00+00:00",
        "description": "\"It has long been unclear when humans started using fire,\" writes Phys.org...\n\n\nTo address this question, researchers from the Institute of Oceanology of the Chinese Academy of Sciences (IOCAS), alongside collaborators from China, Germany, and France, analyzed the pyrogenic carbon record in a 300,000-year-old sediment core from the East China Sea. \"Our findings challenge the widely held belief that humans only began influencing the environment with fire in the recent past, during the Holocene,\" said Dr. Zhao Debo, the study's corresponding author. \nThis study, published in the Proceedings of the National Academy of Sciences, highlights the presence of charred plant remains &mdash; known as pyrogenic carbon &mdash; formed when vegetation burns but is not completely consumed by fire. The research reveals a notable increase in fire activity across East Asia approximately 50,000 years ago. This finding aligns with earlier reports of heightened fire activities in Europe, Southeast Asia, an",
        "id": 3046233,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/29/0142237/carbon-record-reveals-evidence-of-extensive-human-fire-use-50000-years-ago?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Carbon Record Reveals Evidence of Extensive Human Fire Use 50,000 Years Ago",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:52:14.353600+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T11:34:00+00:00",
        "description": "\"I wonder who actually uses AI and why,\" writes Slashdot reader VertosCay:\n\nOut of pure curiosity, I have asked various AI models to create: simple Arduino code, business letters, real estate listing descriptions, and 3D models/vector art for various methods of manufacturing (3D printing, laser printing, CNC machining). None of it has been what I would call \"turnkey\". Everything required some form of correction or editing before it was usable. \n\nSo what's the point? \nTheir original submission includes more AI-related questions for Slashdot readers (\"Do you use it? Why?\") But their biggest question seems to be: \"Do you have to correct it?\" \nAnd if that's the case, then when you add up all that correction time... \"Is it actually helpful?\" \nShare your own thoughts and experiences in the comments. Do you use AI &mdash; and is it actually helpful?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ask+Slashdot%3A+Do+You+Use+",
        "id": 3046234,
        "language": null,
        "link": "https://ask.slashdot.org/story/25/06/28/0521201/ask-slashdot-do-you-use-ai---and-is-it-actually-helpful?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Ask Slashdot: Do You Use AI - and Is It Actually Helpful?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:52:14.518956+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T07:34:00+00:00",
        "description": "An anonymous reader shared this report from Smithsonian magazine:\nLast year, Australian scientists picked up a mysterious burst of radio waves that briefly appeared brighter than all other signals in the sky. Now, the researchers have discovered the blast didn't come from a celestial object, but a defunct satellite orbiting Earth... \"We got all excited, thinking maybe we'd discovered a new pulsar or some other object,\" says Clancy James, a researcher at Australia's Curtin University who is on the Australian Square Kilometer Array Pathfinder (ASKAP) team, to Alex Wilkins at New Scientist. After taking a closer look, however, the team realized that the only viable source for the burst was NASA's dead Relay 2, a short-lived satellite that hasn't been in operation since 1967.... \n\nThe researchers also discovered that at the time of the event, the satellite was only around 2,800 miles away from Earth, which explains why the signal appeared so strong. The reason behind Relay 2's sudden burs",
        "id": 3046235,
        "language": null,
        "link": "https://science.slashdot.org/story/25/06/29/0410213/mysterious-radio-burst-turns-out-to-be-from-a-dead-1967-nasa-satellite?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Mysterious Radio Burst Turns Out to Be From a Dead 1967 NASA Satellite",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:52:14.739991+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T03:34:00+00:00",
        "description": "Bcachefs \"pitches itself as a filesystem that 'doesn't eat your data',\" writes the open source/Linux blog It's FOSS. Although it was last October that Bcachefs developer Kent Overstreet was restricted from participating in the Linux 6.13 kernel development cycle (after ending a mailing list post with \"Get your head examined. And get the fuck out of here with this shit.\") \n\nAnd now with the upcoming Linux kernel 6.17 release, Linus Torvalds has decided to drop Bcachefs support, they report, \"owing to growing tensions\" with Overstreet:\n\n The decision follows a series of disagreements over how fixes and changes for it were submitted during the 6.16 release cycle... Kent filed a pull request to add a new feature called \"journal-rewind\". It was meant to improve bcachefs repair functionality, but it landed during the release candidate (RC) phase, a time usually reserved for bug fixes, not new features, as Linus pointed out. [Adding \"I remain steadfastly convinced that anybody who uses bcach",
        "id": 3046236,
        "language": null,
        "link": "https://linux.slashdot.org/story/25/06/29/0248236/new-linux-kernel-drama-torvalds-drops-bcachefs-support-after-clash?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "New Linux Kernel Drama: Torvalds Drops Bcachefs Support After Clash",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "EditorDavid",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:52:14.952245+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T01:34:00+00:00",
        "description": "Technology writer Matthew Hutson (also Slashdot reader #1,467,653) looks at a new kind of self-improving AI coding system. It rewrites its own code based on empirical evidence of what's helping &mdash; as described in a recent preprint on arXiv. \n\nFrom Hutson's new article in IEEE Spectrum:\n\n\n\nA Darwin G&ouml;del Machine (or DGM) starts with a coding agent that can read, write, and execute code, leveraging an LLM for the reading and writing. Then it applies an evolutionary algorithm to create many new agents. In each iteration, the DGM picks one agent from the population and instructs the LLM to create one change to improve the agent's coding ability [by creating \"a new, interesting, version of the sampled agent\"]. LLMs have something like intuition about what might help, because they're trained on lots of human code. What results is guided evolution, somewhere between random mutation and provably useful enhancement. The DGM then tests the new agent on a coding benchmark, scoring its ",
        "id": 3046237,
        "language": null,
        "link": "https://slashdot.org/story/25/06/28/2314203/ai-improves-at-improving-itself-using-an-evolutionary-trick?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "AI Improves At Improving Itself Using an Evolutionary Trick",
        "vote": 0
    }
]