[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:25:45.667820+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T15:30:36+00:00",
        "description": "College Football 25, released last year after a long hiatus, was a large-scale success. Championing the electrifying atmosphere, unique tradition, and pageantry of College Football gameday alongside an authentic gameplay replication of the sport’s pace and ferocity meant a follow-up was never in doubt. \n\nEA Sports College Football 26 arrives on July 10th to PlayStation 5 and Xbox Series X|S, and whilst last year’s edition featured plenty of highlights a handful of niggles stopped it short of perfection. This year, EA are focusing on enhancing realism via expanding play variety, overhauling Wear and Tear, streamlining substitutions and formation adjustments, and providing new player archetypes, to name a few innovations. \n\nGameday atmosphere - already a standout feature - receives a shot in the arm too.",
        "id": 3043626,
        "language": null,
        "link": "https://www.youtube.com/watch?v=wxngIUHZpQc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wxngIUHZpQc/hqdefault.jpg",
        "title": "EA Sports College Football 26 vs College Football 25 - 15 BIGGEST Differences",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-06-29T17:25:45.982633+00:00",
        "date_dead_since": null,
        "date_published": "2025-06-29T09:30:29+00:00",
        "description": "Wearing its Soulslike action-RPG influence on its sleeve is Wuchang: Fallen Feathers, a debut outing from studio Leenzee. Encompassing the three pillars of Soulslike game design - world building, combat, and narrative - is Fallen Feathers, however the studio are putting most emphasis on the first two, the game’s world and its combat. \n\nVisually, Wuchang: Fallen Feathers is stunning, darkly fantastical imbued with interesting elements. It’s certain to be a joy exploring. However, this video dissects the game’s combat, of which numerous systems intertwine magnificently to create an engaging and empowering experience. \n\nWholly customisable too, Leenzee have incorporated elements of unexpected discovery as players climb higher up the game’s skill tree. There is a bottom line here too: the game will marry accessibility with ambition. Owing to how it's designed, its appeal should be widespread.",
        "id": 3043627,
        "language": null,
        "link": "https://www.youtube.com/watch?v=UdsY0FBsmTs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UdsY0FBsmTs/hqdefault.jpg",
        "title": "Why I ABSOLUTELY CANNOT WAIT For Wuchang: Fallen Feathers",
        "vote": 0
    }
]