[
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T23:18:32.257015+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T22:40:00+00:00",
        "description": "A widely used Node.js utility called fast-glob, relied on by thousands of projects&#226;\"including over 30 U.S. Department of Defense systems -- is maintained solely by a Russian developer linked to Yandex. While there's no evidence of malicious activity, cybersecurity experts warn that the lack of oversight in such critical open-source projects leaves them vulnerable to potential exploitation by state-backed actors. The Register reports: US cybersecurity firm Hunted Labs reported the revelations on Wednesday. The utility in question is fast-glob, which is used to find files and folders that match specific patterns. Its maintainer goes by the handle \"mrmlnc\", and the Github profile associated with that handle identifies its owner as a Yandex developer named Denis Malinochkin living in a suburb of Moscow. A website associated with that handle also identifies its owner as the same person, as Hunted Labs pointed out.\n \nHunted Labs told us that it didn't speak to Malinochkin prior to publ",
        "id": 3435638,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/27/2026245/defense-department-reportedly-relies-on-utility-written-by-russian-dev?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Defense Department Reportedly Relies On Utility Written by Russian Dev",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T22:12:40.017372+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T22:00:00+00:00",
        "description": "An anonymous reader quotes a report from 404 Media: 4chan and Kiwi Farms sued the United Kingdom's Office of Communications (Ofcom) over its age verification law in U.S. federal court Wednesday, fulfilling a promise it announced on August 23. In the lawsuit, 4chan and Kiwi Farms claim that threats and fines they have received from Ofcom \"constitute foreign judgments that would restrict speech under U.S. law.\" Both entities say in the lawsuit that they are wholly based in the U.S. and that they do not have any operations in the United Kingdom and are therefore not subject to local laws. Ofcom's attempts to fine and block 4chan and Kiwi Farms, and the lawsuit against Ofcom, highlight the messiness involved with trying to restrict access to specific websites or to force companies to comply with age verification laws.\n \nThe lawsuit calls Ofcom an \"industry-funded global censorship bureau.\" \"Ofcom's ambitions are to regulate Internet communications for the entire world, regardless of where",
        "id": 3435226,
        "language": "en-us",
        "link": "https://yro.slashdot.org/story/25/08/27/205230/4chan-and-kiwi-farms-sue-the-uk-over-its-age-verification-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "4chan and Kiwi Farms Sue the UK Over Its Age Verification Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T22:12:40.142633+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T21:20:00+00:00",
        "description": "Starting with Word for Windows version 2509, Microsoft is making cloud saving the default behavior. New documents will automatically save to OneDrive (or another cloud destination), with dated filenames, unless users manually revert to local saving in the settings. From the report: \"Anything new you create will be saved automatically to OneDrive or your preferred cloud destination\", writes Raul Munoz, product manager at Microsoft on the Office Shared Services and Experiences team. Munoz backs up the decision with half a dozen advantages for saving documents to the cloud. From never losing progress and access anywhere to easy collaboration and increased security and compliance. While cloud saving is without doubt beneficial in some cases, Munoz fails to address the elephant in the room. Some users may not want that their documents are stored in the cloud. There are good reasons for that, including privacy.\n \nSummed up:\n- If you do not mind that Word documents are stored in the cloud, y",
        "id": 3435227,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/27/1955256/word-documents-will-now-be-saved-to-the-cloud-automatically-on-windows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Word Documents Will Now Be Saved To the Cloud Automatically On Windows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T21:08:02.197502+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T20:42:00+00:00",
        "description": "Google has eliminated more than one-third of its managers overseeing small teams, an executive told employees last week, as the company continues its focus on efficiencies across the organization. From a report: \"Right now, we have 35% fewer managers, with fewer direct reports\" than at this time a year ago, said Brian Welle, vice president of people analytics and performance, according to audio of an all-hands meeting reviewed by CNBC. \"So a lot of fast progress there.\" \n\nAt the meeting, employees asked Welle and other executives about job security, \"internal barriers\" and Google's culture after several recent rounds of layoffs, buyouts and reorganizations. Welle said the idea is to reduce bureaucracy and run the company more efficiently. \"When we look across our entire leadership population, that['s mangers, directors and VPs, we want them to be a smaller percentage of our overall workforce over time,\" he said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"sla",
        "id": 3434792,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/27/1955230/google-has-eliminated-35-of-managers-overseeing-small-teams-in-past-year-exec-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Google Has Eliminated 35% of Managers Overseeing Small Teams in Past Year, Exec Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T21:08:02.312491+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T20:02:00+00:00",
        "description": "After losing his job in 2024, Eric Thompson spearheaded a working group to push for federal legislation banning \"ghost jobs\" -- openings posted with no intent to hire. The proposed Truth in Job Advertising and Accountability Act would require transparency around job postings, set limits on how long ads can remain up, and fine companies that violate the rules. CNBC reports: \"There's nothing illegal about posting a job, currently, and never filling it,\" says Thompson, a network engineering leader in Warrenton, Virginia. Not to mention, it's \"really hard to prove, and so that's one of the reasons that legally, it's been kind of this gray area.\" As Thompson researched more into the phenomenon, he connected with former colleagues and professional connections across the country experiencing the same thing. Together, the eight of them decided to form the TJAAA working group to spearhead efforts for federal legislation to officially ban businesses from posting ghost jobs.\n \nIn May, the group ",
        "id": 3434793,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/08/27/1938243/a-proposal-to-ban-ghost-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "A Proposal to Ban Ghost Jobs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T20:02:46.200553+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T19:25:00+00:00",
        "description": "An anonymous reader quotes a report from The Hill: Republicans on the House Oversight and Government Reform Committee opened a probe into alleged organized efforts to inject bias into Wikipedia entries and the organization's responses. Chair James Comer (R-Ky.) and Rep. Nancy Mace (R-S.C.), chair of the panel's subcommittee on cybersecurity, information technology, and government innovation, on Wednesday sent an information request on the matter to Maryana Iskander, chief executive officer of the Wikimedia Foundation, the nonprofit that hosts Wikipedia. The request, the lawmakers said in the letter (PDF), is part of an investigation into \"foreign operations and individuals at academic institutions subsidized by U.S. taxpayer dollars to influence U.S. public opinion.\"\n \nThe panel is seeking documents and communications about Wikipedia volunteer editors who violated the platform's policies, as well as the Wikimedia Foundation's efforts to \"thwart intentional, organized efforts to inject",
        "id": 3434434,
        "language": "en-us",
        "link": "https://politics.slashdot.org/story/25/08/27/1923235/republicans-investigate-wikipedia-over-allegations-of-organized-bias?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Republicans Investigate Wikipedia Over Allegations of Organized Bias",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T18:57:52.434036+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T18:05:00+00:00",
        "description": "An anonymous reader shares a report: Security researchers from Palo Alto Networks' Unit 42 have discovered the key to getting large language model (LLM) chatbots to ignore their guardrails, and it's quite simple. You just have to ensure that your prompt uses terrible grammar and is one massive run-on sentence like this one which includes all the information before any full stop which would give the guardrails a chance to kick in before the jailbreak can take effect and guide the model into providing a \"toxic\" or otherwise verboten response the developers had hoped would be filtered out. \n\nThe paper also offers a \"logit-gap\" analysis approach as a potential benchmark for protecting models against such attacks. \"Our research introduces a critical concept: the refusal-affirmation logit gap,\" researchers Tung-Ling \"Tony\" Li and Hongliang Liu explained in a Unit 42 blog post. \"This refers to the idea that the training process isn't actually eliminating the potential for a harmful response ",
        "id": 3433899,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/27/1756253/one-long-sentence-is-all-it-takes-to-make-llms-misbehave?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "One Long Sentence is All It Takes To Make LLMs Misbehave",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T17:52:38.668734+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T17:29:00+00:00",
        "description": "Deforestation has killed more than half a million people in the tropics over the past two decades as a result of heat-related illness, a study has found. The Guardian: Land clearance is raising the temperature in the rainforests of the Amazon, Congo and south-east Asia because it reduces shade, diminishes rainfall and increases the risk of fire, the authors of the paper found. Deforestation is responsible for more than a third of the warming experienced by people living in the affected regions, which is on top of the effect of global climate disruption. \n\nAbout 345 million people across the tropics suffered from this localised, deforestation-caused warming between 2001 and 2020. For 2.6 million of them, the additional heating added 3C to their heat exposure. In many cases, this was deadly. The researchers estimated that warming due to deforestation accounted for 28,330 annual deaths over that 20-year period.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpo",
        "id": 3433368,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/27/1729211/deforestation-has-killed-half-a-million-people-in-past-20-years-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Deforestation Has Killed Half a Million People in Past 20 Years, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T16:47:42.733441+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T16:44:00+00:00",
        "description": "The FBI and other law enforcement and intelligence agencies around the world warned Wednesday that a Chinese-government hacking campaign that previously penetrated nine U.S. telecommunications companies has expanded into other industries and regions, striking at least 200 American organizations and 80 countries. From a report: The joint advisory was issued with the close allies in the Five Eyes English-language intelligence-sharing arrangement and also agencies from Finland, Netherlands, Poland and the Czech Republic, an unusually broad array meant to demonstrate global resolve against what intelligence officials said is a pernicious campaign that exceeds accepted norms for snooping. \n\n\"The expectation of privacy here was violated, not just in the U.S., but globally,\" FBI Assistant Director Brett Leatherman, who heads the bureau's cyber division, told The Washington Post in an interview. Chinese hackers won deep access to major communication carriers in the U.S. and elsewhere, then ex",
        "id": 3432696,
        "language": "en-us",
        "link": "https://it.slashdot.org/story/25/08/27/1644221/fbi-warns-chinese-hacking-campaign-has-expanded-reaching-80-countries?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "FBI Warns Chinese Hacking Campaign Has Expanded, Reaching 80 Countries",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T16:47:42.847655+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T16:01:00+00:00",
        "description": "Phonemaker Nothing used professional stock photos to demonstrate its Phone 3's camera capabilities on retail demo units, according to The Verge. Five images the company presented as community-captured samples were licensed photographs from the Stills marketplace, taken with other cameras in 2023. \n\nThe Verge verified EXIF data confirming one image predated the Phone 3's release. Co-founder Akis Evangelidis acknowledged the photos were placeholders intended for pre-production testing that weren't replaced before deployment to stores.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nothing+Caught+Using+Stock+Photos+as+Phone+3+Camera+Samples%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F25%2F08%2F27%2F1529224%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fmobile.slashdot.org%2Fsto",
        "id": 3432697,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/08/27/1529224/nothing-caught-using-stock-photos-as-phone-3-camera-samples?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Nothing Caught Using Stock Photos as Phone 3 Camera Samples",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T15:42:57.702888+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T15:21:00+00:00",
        "description": "South Korea has passed a bill banning the use of mobile phones and smart devices during class hours in schools -- becoming the latest country to restrict phone use among children and teens. From a report: The law, which comes into effect from the next school year in March 2026, is the result of a bi-partisan effort to curb smartphone addiction, as more research points to its harmful effects. Lawmakers, parents and teachers argue that smartphone use is affecting students' academic performance and takes away time they could have spent studying.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=South+Korea+Bans+Phones+in+School+Classrooms+Nationwide%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F25%2F08%2F27%2F155240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fmobile.slashdot.org%",
        "id": 3431927,
        "language": "en-us",
        "link": "https://mobile.slashdot.org/story/25/08/27/155240/south-korea-bans-phones-in-school-classrooms-nationwide?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "South Korea Bans Phones in School Classrooms Nationwide",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T15:42:57.818404+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T14:40:00+00:00",
        "description": "Wikipedia's volunteer editors have rejected founder Jimmy Wales' proposal to use ChatGPT for article review guidance after the AI tool produced error-filled feedback when Wales tested it on a draft submission. The ChatGPT response misidentified Wikipedia policies, suggested citing non-existent sources and recommended using press releases despite explicit policy prohibitions. \n\nEditors argued automated systems producing incorrect advice would undermine Wikipedia's human-centered model. The conflict follows earlier tensions over the Wikimedia Foundation's AI experiments, including a paused AI summary feature and new policies targeting AI-generated content.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wikipedia+Editors+Reject+Founder's+AI+Review+Proposal+After+ChatGPT+Fails+Basic+Policy+Test%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F25%2F08%2F27%2F107221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"",
        "id": 3431928,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/27/107221/wikipedia-editors-reject-founders-ai-review-proposal-after-chatgpt-fails-basic-policy-test?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Wikipedia Editors Reject Founder's AI Review Proposal After ChatGPT Fails Basic Policy Test",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "msmash",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T14:37:34.432506+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T14:00:00+00:00",
        "description": "Digital resurrections of deceased individuals are emerging as the next commercial frontier in AI, with the digital afterlife industry projected to reach $80 billion within a decade. Companies developing these AI avatars are exploring revenue models ranging from interstitial advertising during conversations to data collection about users' preferences. \n\nStoryFile CEO Alex Quinn confirmed his company is exploring methods to monetize interactions between users and deceased relatives' digital replicas, including probing for consumer information during conversations. The technology has already demonstrated persuasive capabilities in legal proceedings, where an AI recreation of road rage victim Chris Pelkey delivered testimony that contributed to a maximum sentence. Current implementations operate through subscription models, though no federal regulations govern commercial applications of posthumous AI representations despite state-level protections for deceased individuals' likeness rights",
        "id": 3431006,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/27/094233/posthumous-ai-avatars-shift-from-memorial-tools-to-revenue-generators?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Posthumous AI Avatars Shift From Memorial Tools To Revenue Generators",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T14:37:34.546242+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T13:00:00+00:00",
        "description": "An anonymous reader quotes a report from CoinTelegraph: Paying interest on stablecoin deposits could spark a wave of bank outflows similar to the money market fund boom of the 1980s, Citi's Future of Finance head Ronit Ghose warned in a report published Monday. According to the Financial Times, Ghose compared the potential outflows caused by paying interest on stablecoins to the rise of money market funds in the late 1970s and early 1980s. Those funds ballooned from about $4 billion in 1975 to $235 billion in 1982, outpacing banks whose deposit rates were tightly regulated, Federal Reserve data showed. Withdrawals from bank accounts exceeded new deposits by $32 billion between 1981 and 1982.\n \nSean Viergutz, banking and capital markets advisory leader at consultancy PwC, similarly suggested that a shift from consumers to higher-yielding stablecoins could spell trouble for the banking sector. \"Banks may face higher funding costs by relying more on wholesale markets or raising deposit r",
        "id": 3431007,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/26/2338207/citi-executive-warns-stablecoin-yields-could-drain-bank-deposits?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Citi Executive Warns Stablecoin Yields Could Drain Bank Deposits",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T10:29:29.849471+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T10:00:00+00:00",
        "description": "schwit1 shares a report from the Korea Herald: Korean Air, South Korea's flagship carrier, on Tuesday announced a sweeping $50 billion deal to purchase next-generation aircraft from Boeing and spare engines from GE Aerospace and CFM International, its largest-ever investment aimed at fueling long-term growth. The deal, signed during President Lee Jae Myung's visit to Washington, includes $36.2 billion for 103 Boeing aircraft, $690 million for 19 spare engines, and a $13 billion long-term engine maintenance contract. The fleet order spans a wide mix of models: 20 Boeing 777-9s, 25 Boeing 787-10s, 50 Boeing 737-10s, and eight Boeing 777-8F freighters. Deliveries will be phased through the end of the 2030s. Korean Air will also acquire 11 spare engines from GE Aerospace and eight from CFM International, alongside a 20-year maintenance service agreement with GE covering 28 aircraft.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/ho",
        "id": 3429480,
        "language": "en-us",
        "link": "https://tech.slashdot.org/story/25/08/26/2321251/korean-air-inks-record-50-billion-us-aviation-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Korean Air Inks Record $50 Billion US Aviation Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T07:16:19.399332+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T07:00:00+00:00",
        "description": "alternative_right shares a report from Phys.org: You've probably heard it before in a meeting: 'Let's touch base offline to align our bandwidth on this workflow.' Corporate jargon like this is easy to laugh at -- but its negative impact in the office can be serious. According to a new study, using too much jargon in the workplace can hurt employees' ability to process messages, leading them to experience negative feelings and making them feel less confident. In turn, they're less likely to reach out and ask for or share information with their colleagues.\n \n\"You need people to be willing to collaborate, share ideas and look for more information if they don't understand something at work,\" said Olivia Bullock, Ph.D., an assistant professor of advertising at the University of Florida and co-author of the new study. \"And jargon might actually be impeding that information flow across teams.\" Age made a difference, though. Older workers had a harder time processing jargon, but were more lik",
        "id": 3428364,
        "language": "en-us",
        "link": "https://slashdot.org/story/25/08/26/2318239/workplace-jargon-hurts-employee-morale-and-collaboration-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Workplace Jargon Hurts Employee Morale and Collaboration, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T04:01:21.983490+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T03:30:00+00:00",
        "description": "An anonymous reader quotes a report from ScienceAlert: A genetically modified pig lung transplanted into a brain-dead human patient functioned for nine days in a new achievement that reveals both the promise and significant challenges of xenotransplantation. Over the course of the experiment, the patient showed increasing signs of organ rejection before scientists at the First Affiliated Hospital of Guangzhou Medical University in China terminated the experiment, allowing the recipient to pass away. It's the first time a pig lung has been transplanted into a human patient, demonstrating a significant step forward, and giving scientists new problems to solve as they develop this emerging medical technique further. [...]\n \nThe goal of the experiment was not to achieve a successful transplantation on the first try -- that would have been pretty incredible, but not a realistic expectation. Rather, the researchers wanted to observe how the patient's immune system responded to the transplan",
        "id": 3427549,
        "language": "en-us",
        "link": "https://science.slashdot.org/story/25/08/26/2257216/pig-lung-transplanted-into-a-human-in-major-scientific-first?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Pig Lung Transplanted Into a Human In Major Scientific First",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "BeauHD",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-08-27T00:44:44.302276+00:00",
        "date_dead_since": null,
        "date_published": "2025-08-27T00:02:00+00:00",
        "description": "Canada's tech job market has collapsed from its pandemic-era boom, with postings down 19% from 2020 levels. Analysts say the decline was sharper than the overall job market and worsened after ChatGPT's debut in 2022 fueled AI-driven shifts in workforce demand. The Canadian Press reports: \"The Canadian tech world remains stuck in a hiring freeze,\" said Brendon Bernard, Indeed's senior economist. \"While both the tech job market and the overall job market have definitely cooled off from their 2022 peaks, the cool off has been much sharper in tech.\" He thinks the fall was likely caused by the market adjusting after a pandemic boom in hiring along with recent artificial intelligence advances that have reduced tech firms' interest in expanding their workforces.\n \n\"We went from this really hot job market with job postings through the roof to one where job postings really crashed, falling well below their pre-pandemic levels,\" Bernard said. However, he sees AI's recent boom as a \"watershed mo",
        "id": 3426798,
        "language": "en-us",
        "link": "https://news.slashdot.org/story/25/08/26/2250204/canadas-tech-job-market-has-gone-from-boom-to-bust-in-last-five-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://a.fsdn.com/sd/twitter_icon_large.png",
        "title": "Canada's Tech Job Market Has Gone From Boom To Bust In Last Five Years",
        "vote": 0
    }
]