[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-23T20:45:00+00:00",
        "description": "Microsoft and Xbox revealed new deep dives into five of their biggest games (some exclusives and some not). These include new gameplay footage and release dates for South of Midnight, Clair Obscur: Expedition 33, Ninja Gaiden 2 Black and DOOM: The Dark Ages. However there were some surprises as well. Ninja Gaiden 4 was announced for a Fall 2025 release. \n\nCheck out all the biggest announcements from the latest Xbox Developer Direct.",
        "id": 1967199,
        "language": null,
        "link": "https://www.youtube.com/watch?v=L-ugi-pFkPs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/L-ugi-pFkPs/hqdefault.jpg",
        "title": "5 BIGGEST GAME Announcements From Xbox Developer Direct 2025 You Need To Check Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-23T16:00:48+00:00",
        "description": "We have yet another classic Star Wars title to our libraries with the early 2000s action platformer, Jedi Power Battles. This is a decent way to experience the action of Star Wars Episode I if you can forgive some glaring gameplay irritants and have a friend to co-op with. \n\nThis remaster is based on the superior Dreamcast version, though it preserved some of the PS1’s UI elements and stage textures. In addition to the sharpened textures and enhanced performance, the developer has included 13 brand-new characters to unlock.\n\nYou can even play as the four previously locked characters right from the start, allowing players to unearth the secrets early on. My experience was riddled with invisible wall deaths, questionable hurt boxes, and numerous game-overs, but the way the setting is represented still puts a smile on my face at times. The developer has done a pretty good job preserving this classic, even if the core gameplay doesn’t hold up so well.",
        "id": 1965139,
        "language": null,
        "link": "https://www.youtube.com/watch?v=lPvQAjef37E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lPvQAjef37E/hqdefault.jpg",
        "title": "Star Wars Episode I: Jedi Power Battles Remastered Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-23T16:00:21+00:00",
        "description": "Synduality: Echoes of Ada takes place in the far future of 2222, where a strange type of rainfall managed to wipe out 90 percent of humanity. The survivors, however, have managed to build back up thanks to a new power source called AO Crystals, which are in turn gathered by mech pilots called Drifters. Now, these Drifters have to deal with fighting strange creatures called Enders and sometimes even rogue Drifters to make sure that humanity can continue to build itself back up.\n\nUnfortunately, when it comes to gameplay, Synduality is a letdown. The game’s combat never really evolves beyond pointing, shooting, and occasionally circle-strafing. Throw in on top the fact that there isn’t really much going on in the game’s story aside from its setup, as well as the fact that the general art direction is incredibly bland, and you get an extraction shooter that is difficult to recommend.",
        "id": 1965140,
        "language": null,
        "link": "https://www.youtube.com/watch?v=MQo4qYwJ2RI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MQo4qYwJ2RI/hqdefault.jpg",
        "title": "SYNDUALITY Echo of Ada Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2025-01-23T10:00:57+00:00",
        "description": "Grand Theft Auto 6 is still slated for Fall 2025, though Rockstar has yet to provide any updates or new details. As it continues to gather hype, one analyst recently discussed the hope of an $80 to $100 price. Not necessarily to put further strain on players' wallets but to set a precedent for other titles to increase their game prices.\n\nThe reasoning for this lies in the escalating cost of video game budgets compared to their pricing, which hasn't increased as much when factoring in inflation. Whether fans will purchase Grand Theft Auto 6 for that price point is surprisingly a no-brainer. Many are keen to partake in the upcoming open-world epic. After all, Rockstar titles are major events and a follow-up to GTA even more so.\n\nWill it spur other publishers and developers to adopt the same pricing model? What could that mean for other titles, some of which have been struggling even with the $70 price point? Find out here.",
        "id": 1962931,
        "language": null,
        "link": "https://www.youtube.com/watch?v=wakC90DJSoo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/wakC90DJSoo/hqdefault.jpg",
        "title": "Will You Pay $80 To $100 For GTA 6?",
        "vote": 0
    }
]