[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-16T18:05:59.532159+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-16T17:30:01+00:00",
        "description": "The Xbox Series S was a bold move by Microsoft, offering next-gen gaming at an affordable price point, and especially when paired with Game Pass - it's a no-brainer for anyone wanting to try out AAA games without breaking the bank. \n\nWhile the console has already started showing signs of aging under the pressure of today’s demanding titles, it remains a go-to option for budget-conscious gamers. But how does it compare to a gaming PC built on a similar specs? What kind of costs will be involved?\n\nIn this video, we break down the cost and components of a comparable PC build and see how all of that pans out.\n\nUpdate: Thanks for pointing the RAM mistake in our original video. This video fixes that and also adjusts the price accordingly!",
        "id": 3181748,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=3mb1ZbgEht8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3mb1ZbgEht8/hqdefault.jpg",
        "title": "What’s the Cost to Build a Gaming PC That Competes With the Xbox Series S in 2025?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-16T15:53:57.324526+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-16T15:45:06+00:00",
        "description": "Despite a lot of bad news for Microsoft and its Xbox division in recent times, the company’s optimistic take on the future of its presence in modern gaming might be justified with reports of new additions to the Fallout franchise showcasing a more strategic approach to its upcoming projects. \n\nRumors of a remaster of Fallout 3 and the next mainline entry to the franchise could very well prove to be the next big push into a new generation of games and gaming hardware in the wake of Microsoft’s new partnership with AMD and its “Xbox Anywhere” marketing push. \n\nFallout’s recent surge in popularity thanks to its excellent live-action adaptation makes the franchise a perfect candidate to prop up Microsoft and Xbox’s push to take modern gaming in a bold new direction while rewarding fans who have waited a very long time for the franchise to make a triumphant return to modern gaming.",
        "id": 3180537,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=kFW1iVdRN68",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kFW1iVdRN68/hqdefault.jpg",
        "title": "Xbox Might Be Struggling, But Fallout Fans Will Be Eating Good",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_created": "2025-07-16T14:45:24.253370+00:00",
        "date_dead_since": null,
        "date_published": "2025-07-16T13:45:01+00:00",
        "description": "Among all the games releasing this month, I didn't expect Void Interactive's Ready or Not to have this much of an impact. Yes, I know the PC version was quite popular when it was released in December 2023, and the hype around the console versions has been palpable. But more than that, I didn't think I would enjoy it this much.\n\nIt's something that goes beyond the lack of SWAT-inspired, squad-based tactical shooters, though Ready or Not is quite accomplished in that regard as well. Maybe it's the brutality and realism, which immerses the player in the world of Los Suenos without letting up. Perhaps it's the situations, which can unfold in numerous different ways, ensuring that every mission plays out differently, even if the core gameplay loop remains the same throughout.\n\nOr maybe it's the sense of accomplishment and mastery when everything begins to connect, as you seamlessly clear rooms, take down suspects without incident, rescue civilians, and rack up those perfect scores. Regardl",
        "id": 3179857,
        "language": "en-US",
        "link": "https://www.youtube.com/watch?v=7SnJsS1h_vY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7SnJsS1h_vY/hqdefault.jpg",
        "title": "Why Are GAMERS ADDICTED To Ready or Not On PS5 And Xbox",
        "vote": 0
    }
]